{
    "case_title": "Yap Guat Beng\n      v\n      Public Prosecutor",
    "ncitation": "[2010] SGHC 354",
    "coram": "Steven Chong J",
    "sections": {
        "Introduction": "1       The prohibition against an undischarged bankrupt\n                    from managing (or being a director of) a company or a business as found in\n                    s 148(1) of the Companies Act (Cap 50, 2006 Rev Ed) (“the\n                    Companies Act’) and s 26(1) of the Business Registration Act\n                    (Cap 32, 2004 Rev Ed) (“the Business Registration Act”)\n                    serves the important role of safeguarding the interests of the business’\n                    existing creditors, as well as the interests of potential creditors of the\n                    business, who may be unaware of the financial status of persons in charge of\n                    such businesses. 2       The prohibition also serves to protect the\n                    greater public interest to prevent the undischarged bankrupt from misusing the\n                    corporate structure for collateral purposes to the detriment of stakeholders\n                    such as the company’s shareholders, the business’ trading partners\n                    and suppliers, consumers, and the general public who depend on the services\n                    and/or products of such businesses or companies. 3       From my review of several written decisions from\n                    the Subordinate Courts, it appears to me that the trend is to impose a custodial\n                    sentence for offenders who breach the prohibition by acting as a director of a\n                    company or being involved in management of a business in spite of their bankrupt\n                    status. Of the six decisions which I reviewed, five imposed custodial sentences\n                    ranging from two weeks to six weeks. In only one instance was a fine imposed.\n                    From my examination of the line of Subordinate Court decisions on the same\n                    offence, it seems to me that there is no discernible sentencing principle or a\n                    common sentencing policy which can be drawn from them. The present situation\n                    presents a disparate and unclear position on what the benchmark sentence should\n                    be, and what the proper factors to be considered as relevant aggravating factors\n                    are. It is hoped that this decision will provide some rational sentencing\n                    guidelines in relation to such offences. 4       Further, this appeal has also revealed the need\n                    for a review of the working protocol as regards the removal of persons as\n                    directors who have been adjudged bankrupt. In this case, the appellant remained\n                    on record as a director of a company for almost four years after she was\n                    adjudged a bankrupt. How was this possible? The breach was only discovered when\n                    the appellant applied to be discharged as a bankrupt. Instead of beingdischarged, she wascharged.",
        "Background Facts": "The Charges 5       The appellant pleaded guilty to three charges.\n                    The first charge, DAC 10992 of 2009, relates to the appellant having acted\n                    as a director of a company, Novena Communication Pte Ltd (“NCPL”),\n                    whilst being a bankrupt without the leave of the High Court or the written\n                    permission of the Official Assignee (“the OA”), which is an\n                    offence punishable under s 148(1) of the Companies Act. The second charge,\n                    DAC 10995 of 2009, relates to the appellant, having taken part in the management\n                    of a sole proprietorship named Novena Security System (“NSS”),\n                    whilst being an undischarged bankrupt, without the leave of the High Court or\n                    the written permission of the OA, which is an offence punishable under\n                    s 26(1) of the Business Registration Act. The third charge, DAC 10999 of\n                    2009, which is not the subject matter of this appeal, relates to the appellant\n                    having remained outside Singapore without the prior permission of the OA, which\n                    is an offence punishable under s 131(2) of the Bankruptcy Act (Cap 20,\n                    2009 Rev Ed) (“the Bankruptcy Act”). The appellant further\n                    consented to six other charges (two charges under s 148(1) of the Companies\n                    Act, two charges under s 26(1) of the Business Registration Act, and two\n                    charges under s 131(2) of the Bankruptcy Act) being taken into\n                    consideration for the purposes of sentencing\n                (“TIC”). 6       The District Judge (“the DJ”)\n                    sentenced the appellant to six weeks’ imprisonment for each of the first\n                    two charges, and a fine of $5,000 for the third charge, with the imprisonment\n                    terms ordered to run concurrently. The appellant appealed and sought a\n                    non-custodial sentence.",
        "Events before the appellant’s bankruptcy": "7       The appellant and her husband were the directors\n                    of two companies, namely Novena Lighting Pte Ltd (“NLPL”) and\n                    NCPL, which were registered on 4 January 1986 and 18 August 1988 respectively\n                    long before her bankruptcy. Fujitec Singapore Corporation Ltd\n                    (“Fujitec”) was one of NCPL’s principal clients. At all\n                    material times, one Koh Heng Chuan (“Koh”) was employed by NLPL,\n                    but subsequently became more involved in NCPL’s business as he was trained\n                    in audio video communications. 8       As NCPL experienced dire financial difficulties,\n                    the appellant borrowed various sums of $50,000, $25,000 and $30,000 from Koh in\n                    1999, March 2000 and November 2000 respectively. These loans totalled\n                    $105,000. 9       Sometime in February 2001, the appellant\n                    suggested that Koh set up a sole-proprietorship to take over NCPL’s\n                    distributorship of audio video intercommunications (“AVI”)\n                    equipment supplied by Nippon Interphone Ltd (“Nippon”). Koh was\n                    concerned with his lack of management experience. The appellant assured Koh that\n                    she would teach and guide him. Koh acceded to the appellant’s request and\n                    registered a business known as Kaseve International (“Kaseve”)\n                    under his name on 8 March 2001. Koh contributed a total of $85,088.40 to\n                    finance Kaseve’s purchase of AVI equipment from Nippon. 10     Subsequently, Koh was informed by the\n                    appellant that Fujitec did not recognise the name “Kaseve\n                    International” for the purposes of making payment. On 19 April 2001,\n                    pursuant to the appellant’s instructions, Koh registered another\n                    sole-proprietorship, NSS under his name. Between 19 April 2001 and\n                    10 July 2001, Fujitec issued purchase orders to NSS in the aggregate sum of\n                    $15,677.63. Kaseve in turn purchased the goods to fulfil the orders placed by\n                    Fujitec with NSS. Fujitec credited a sum of $10,381.37 into NCPL’s bank\n                    account on 25 July 2001.",
        "The appellant’s bankruptcy": "11     The appellant was adjudged a bankrupt on 23\n                    November 2001. A few weeks later, on 18 December 2001, she was briefed on\n                    her duties and responsibilities as an undischarged bankrupt, and she\n                    acknowledged receipt of several documents which included the following: (a)Bankruptcy order against the appellant dated 23\n                            November 2001;(b)Bankruptcy information sheet 1on the rights and\n                            responsibilities as an undischarged bankrupt;(c)Bankruptcy information sheet 2 on how the\n                            appellant could get out of bankruptcy under the Bankruptcy\n                        Act;(d)Bankruptcy information sheet 3 on how the\n                            appellant could continue to operate a savings account to pay her debts\n                            through GIRO and;(e)Bankruptcy information sheet 5 on the process to\n                            obtain the OA’s permission to travel out of\n                        Singapore.12     Bankruptcy information sheet 1 included a\n                    paragraph that stipulated the prohibition on taking part either directly or\n                    indirectly in the management of any company or business or acting as a director\n                    without the written permission of the OA or the leave of the High\n                Court.Events after the appellant’s bankruptcy13     Despite acknowledging receipt of the various\n                    documents from the OA which included the prohibition on acting as director or\n                    being involved in management, the appellant continued as a director of NCPL for\n                    almost four years, between 18 December 2001 and 4 July 2005. The\n                    appellant only resigned from her directorship on 4 July 2005, after\n                    receiving a letter of warning dated 24 June 2005 from the Insolvency &\n                    Public Trustee’s Office (“IPTO”).14     The appellant had unrestricted access to\n                    NCPL’s funds (via an ATM card and cheque book) between 18 December\n                    2001 and 31 January 2002. Fujitec credited a sum of $21,349.84 on\n                    21 December 2001 into NCPL’s bank account. Thereafter, the appellant\n                    issued cheques which totalled the sum of $22,786.50 to pay various creditors.\n                    The appellant also withdrew the sum of $6,266.52 from NCPL’s bank account\n                    on 26 January 2002, after Fujitec credited the sum of $5,814.35 on\n                    25 January 2002. The appellant had, on 26 December 2001, represented\n                    herself as a director of NCPL when she signed a tenancy agreement on behalf of\n                    NCPL.15     In relation to the offence of taking part in\n                    the management of NSS, the appellant was substantially involved in the running\n                    of NSS’ business. It was the appellant who made all the business decisions\n                    while Koh’s role was reduced to providing the financing for the purchase\n                    of the AVI equipment. The appellant admitted that because NCPL was unable to\n                    fulfil its obligation to supply AVI equipment to Fujitec under its existing\n                    contracts, the appellant had asked Koh to set up NSS, and had used Koh’s\n                    funds to purchase the AVI equipment through NSS to supply to Fujitec[note: 1].16     Between January and April 2002, Koh\n                    received cheque payments totalling $19,000, for the AVI equipment purchased by\n                    Fujitec from NSS, as well as cash payments of around $2,000 for servicing\n                    charges. In addition, the appellant handed Koh a cheque issued in the name of\n                    NSS for the sum of $350 in March 2002. Fujitec further credited $18,454\n                    into NSS’ account on 25 April 2002.17     In December 2001, Koh discovered that the\n                    appellant had been adjudged a bankrupt on 23 November 2001.To safeguard his own\n                    interest, Koh terminated the two sole-proprietorships of Kaseve and NSS on\n                    28 June 2002.The Decision below18     In arriving at her decision to impose a\n                    sentence of six weeks’ imprisonment for each of the two charges, the DJ\n                    took into account the following factors:(a)     The appellant’s deliberate\n                        disregard of the prohibition on acting as a director of NCPL for a period of\n                        more than four years (consequently no concession was given for her guilty\n                        plea or her complete absence of antecedents).(b)     The appellant’s lack of honesty in her\n                        dealings with Koh in that she manipulated the transactions and utilised\n                        payments received from Fujitec after she was adjudged to be a bankrupt for\n                        purposes unrelated to Koh, Kaseve and NSS.(c)     The appellant’s involvement in the\n                        management of NSS and Kaseve was not just “in passing” and she\n                        had deliberately influenced Koh into registering the two\n                        sole-proprietorships for her to manage.(d)     The absence of exceptional circumstances which\n                        warranted a non-custodial sentence.Overview of the Subordinate Court decisions19     The statutory provisions of s 148(1) of\n                    the Companies Act and s 26(1) of the Business Registration Act are\n                    reproduced below:Restriction on undischarged bankrupt being\n                        director or manager148. —(1) Every person who, being an undischarged bankrupt\n                        (whether he was adjudged bankrupt by a Singapore Court or a foreign\n                        court having jurisdiction in bankruptcy), acts as director of, or\n                        directly or indirectly takes part in or is concerned in the management\n                        of, any corporation, except with the leave of the Court or the written\n                        permission of the Official Assignee, shall be guilty of an offence and\n                        shall be liable on conviction to a fine not exceeding $10,000 or to\n                        imprisonment for a term not exceeding 2 years or to both.Restriction on undischarged bankrupt being\n                        manager26. —(1) Any person who, being an undischarged bankrupt\n                        (whether he was adjudicated bankrupt by a Singapore court or a foreign\n                        court having jurisdiction in bankruptcy), directly or indirectly, takes\n                        part in or is concerned in the management of any business carried on by\n                        any person required to be registered under this Act, without the leave\n                        of the High Court or the written permission of the Official Assignee,\n                        shall be guilty of an offence and shall be liable on conviction to a\n                        fine not exceeding $10,000 or to imprisonment for a term not exceeding\n                        2 years or to both20     An offender who contravenes these provisions\n                    faces a wide range of punishment: the offender is liable to be punished by a\n                    fine not exceeding $10,000, or an imprisonment term not exceeding two years, or\n                    both. As alluded to above at[3], my analysis\n                    of several earlier decisions in the Subordinate Courts did not reveal any clear\n                    or consistent sentencing policy. It is unclear what constitutes relevant or\n                    recognised aggravating factors for sentencing purposes. It is to these decisions\n                    that my attention now turns.21     InPublic Prosecutor v. Ong\n                        Kwang Eng[2005] SGDC 175 (“Ong Kwang Eng”), the offender was sentenced to one\n                    month’s imprisonment under s 148(1) of the Companies Act for taking\n                    part in the management of a company. In determining whether a custodial sentence\n                    was warranted, the judge observed that the “flagrant\n                    contravention” of the law was an aggravating feature in that case (at\n                    [11]):...a custodial sentence would be appropriate where there are aggravating\n                        features such as flagrant contravention of the law, dishonesty, or where the\n                        offender has previous convictions of a similar nature...22     The judge, however, adopted a curious approach\n                    as to what constitutes “blatant disregard” of the law (at\n                    [15]):I...considered the length of sentence that would be appropriate on the\n                        facts of this case. The accused blatantly disregarded the disqualification\n                        on him. His actions in directly taking part in the management of Gabriel\n                        Technology Pte Ltd. showed a deliberate disregard of the law...23     As can be seen from the above, the judge\n                    regarded the very offence (which was the direct involvement in the management of\n                    the company) as an aggravating factor in itself. The judge also imposed a\n                    sentence of one month’s imprisonment for breach of the disqualification\n                    order under s 154(1) of the Companies Act, and ordered both imprisonment\n                    sentences to run concurrently.24     A somewhat inconsistent outcome was reached inPublic Prosecutor v Lim Hua Tong Jasons[2005] SGDC 122 (“Lim Hua\n                    Tong”) where a non-custodial sentence was imposed for a\n                    conviction under s 148(1) of the Companies Act despite the fact that the\n                    offender was directly involved in the management of the company (a private\n                    education centre), made management decisions, and was in charge of the academic\n                    programmes, training courses and the business development of the company. Like\n                    the case inOng Kwang Eng, no harm resulted from\n                    the commission of the offences. The judge inLim Hua\n                        Tongfound that a fine of $5,000 (in default six weeks’\n                    imprisonment) was appropriate since no harm was caused by the offences, the\n                    offences did not persist over several years, and the offender had no relevant\n                    antecedents. The judge held that (at [23]):The range of fines for such a first [time] offender, who does not cause\n                        harm, is generally between $2,000 to $6,000 or so.25     A different sentencing approach was adopted inPublic Prosecutor v Yeong Chuan Wor[2004] SGDC 141 (“Yeong Chuan\n                    Wor”). Unlike the approach inOng Kwang\n                        Engwhere the judge found that direct involvement in the\n                    management of the companyper seconstituted a\n                    flagrant contravention of the law and was hence an aggravating factor, the judge\n                    inYeong Chuan Woradopted a slightly more\n                    methodical approach in the treatment of “flagrant contravention of the\n                    law”. The judge found that there was flagrant contravention of the law\n                    due to several factors:(a)the offender committed the offence despite having\n                                been briefedby the OA;(b)the offender had continued to manage the company\n                            despite ceasing to be a director; and(c)the offender incorporated three companiesafterhe was adjudged a\n                            bankrupt.The judge found that a custodial sentence was warranted due to this\n                    “flagrant contravention of the law”, even though there was no\n                    dishonesty and no loss was caused by the offender (Yeong\n                        Chuan Worat [37]):In the present case, in determining whether the custody threshold had been\n                        breached, I noted that there had been no dishonesty established and that\n                        there had been no evidence of any loss to the clients of the companies.\n                        However, even in the absence of dishonesty or loss to third parties, a\n                        custodial sentence is correct when there has been a flagrant contravention\n                        of the [prohibition]...I found that to be the case here. The accused who was\n                        served with the bankruptcy information sheet knew perfectly well that he\n                        should not concern himself in the management of a company. Yet he did\n                        precisely that. After having ceased to hold the position of director of\n                        Scmart Malaysia as requested by the OA, he nevertheless continued to manage\n                        the company in disobedience of the statutory provision. ...He carried on\n                        disobeying the order by incorporating not one company, but three\n                        companies.26     The sentences imposed by the judge inYeong Chuan Worwere nonetheless quite odd, to\n                    say the least. A sentence of six weeks’ imprisonment was imposed on the\n                    accused for managing Scmart Singapore for less than six months, while a sentence\n                    of three weeks was imposed for managing another company, Synergy, for slightly\n                    more than eleven months. Inexplicably, a sentence of two weeks’\n                    imprisonment was imposed for managing Calphix Singapore for a period of about 20\n                    months. These sentences are hardly consistent with the sentence of four\n                    weeks’ imprisonment imposed on the offender inOng\n                        Kwang Eng, who had managed the relevant company for about seven\n                    months, and who, unlike the offender inYeong Chuan\n                        Wor, had serious antecedents of eight convictions for cheating\n                    offences. It is also curious that the judge inYeong Chuan\n                        Worhad, without explanation, concluded that there was no\n                    dishonesty, given that the Judge herself observed the undisputed fact that the\n                    offender had registered his siblings as the companies’ directors, so as to\n                    allow the offender to camouflage his participation in the management of the\n                    company’s operations.27     InPublic Prosecutor v Ng\n                        Chuan Seng[2006] SDGC 264 (“Ng Chuan\n                        Seng”) the judge’s approach was not dissimilar to\n                    that ofOng Kwang EngandYeong\n                        Chuan Worin determining what constitutes “deliberate\n                    disregard of the law” (at [10]–[12]):10    This was not a case where the accused was ignorant\n                            of the fact that she could not manage a business. He had beenbriefed just like any other bankruptsthat he\n                            should not concern himself in the management of a\n                        business......12    In the instant case, it is plain that the accused\n                            has quiteblatantly defiedthe\n                            disqualification order on him. Hisinvolvement was\n                                not in passing. He admitted that he was directly managing the\n                                business. Hisdeliberate\n                                disregardof the law continued for a considerable period\n                            of time...[emphasis in bold and in italics added]28     InNg Chuan\n                    Seng, the offender was sentenced to one month’s imprisonment\n                    under s 26(1) of the Business Registration Act, even thoughlosswas caused to a creditor as a result of the\n                    offence, in addition to the aggravating factor of the so-called\n                    “deliberate disregard of the law”. This is in contrast to the more\n                    severe imprisonment sentences meted out inYeong Chuan\n                        Woreven though in that case no harm or loss was\n                caused.29     Interestingly, the court inPublic Prosecutor v Heng Boon Tong[2007] SGDC 290\n                        (“Heng Boon Tong”) decided to\n                    impose a custodial sentence of one month’s imprisonment for a conviction\n                    under s 26(1) of the Business Registration Act based on wholly different\n                    sentencing considerations. The judge was particularly persuaded by the decision\n                    of Yong CJ inPublic Prosecutor v Choong Kian Haw[2002] 4 SLR(R) 776 (“Choong Kian\n                        Haw”). He observed (Heng Boon\n                        Tongat [7] and [14]):7.    InPublic Prosecutor v. Choong\n                                Kian Haw[2002] 4 SLR 776, the High Court commented that\n                            fines were in general, not a suitable punishment since bankrupts would\n                            typically lack the means to pay for the fines themselves. If they had\n                            the funds to pay the fines, these monies should clearly be channelled\n                            instead to the unpaid creditors. If they lacked the funds and a third\n                            party paid for them, the punitive effect of the punishment is\n                            diminished...The court added that the burden was on the offender to show\n                            that there were such exceptional circumstances to warrant a deviation\n                            from the usual imposition of a custodial sentence....14.    In arriving at the appropriate sentence for the\n                            charge under...s. 26(1) of the Business Registration Act...I...accepted\n                            the prosecution’s submission that a fine is inappropriate in the\n                            present case.30     It appears that the judge inHeng Boon Tongimposed a custodial sentence solely on\n                    this sentencing philosophy as there was no explicable aggravating factor present\n                    in that case. Such a sentencing philosophy was, however, neither referred to nor\n                    applied inOng Kwang Eng,Lim\n                        Hua TongorYeong Chuan Wor. It\n                    was, however, endorsed inNg Chuan Sengwhere the\n                    judge observed that (at [13]):...Yong CJ stated that a sentence in the form of a fine would generally be\n                        ineffective as the bankrupt is unlikely to have sufficient funds to pay the\n                        fine, which would result in someone else having to pay the fine on behalf of\n                        the bankrupt (for which any punitive effect would clearly be\n                        diluted)...31     From the above review, with the exception ofLim Hua Tong, the only common denominator\n                    which I have been able to ascertain from the above decisions is that each of the\n                    judges treated the breach of the statutory prohibition as a deliberate and\n                    flagrant disregard of the law and, on that basis, imposed a range of custodial\n                    sentences. More will be said about this below.Underlying purpose of s 148 of the Companies Act32     Any review of the earlier Subordinate Court\n                    decisions would not be complete without examining themischiefwhich s 148 of the Companies Act is intended to\n                    safeguard against. As stated above (at[1]–[2]), the\n                    prohibition of an undischarged bankrupt from managing (or being a director of) a\n                    company or a business serves not only to protect creditors’ interests; it\n                    also serves to safeguard the greater public interest to prevent an undischarged\n                    bankrupt from misusing the corporate structure for collateral purposes to the\n                    detriment of innocent third parties. InNg Chuan\n                        Seng, the Court observed that s 26(1) of the Business\n                    Registration Act is “designed to protect the public”, while a\n                    similar observation was made inOng Kwang Engthat\n                    the purpose of the disqualification under s 148(1) of the Companies Act is\n                    to “protect corporate and commercial integrity”.33     In England, an undischarged bankrupt would not\n                    be granted leave to be a director, or to manage a company if it iscontrary to the public interestto do so, as is evident\n                    from the express language of s 11of the UK Company Directors\n                    Disqualification Act 1986 (“CDDA”), which provides as\n                    follows:11 Undischarged bankrupts(1)It is an offence for a person to act as director\n                            of, or directly or indirectly to take part in or be concerned in the\n                            promotion, formation or management of a company, without the leave of\n                            court, at a time when-(a)he is an undischarged bankrupt...(2)In England and Wales, the leave of the court\n                            shall not be given unless notice of intention to apply for it has been\n                            served on the official receiver; and it is the latter’s duty, if\n                            he is of opinion that it iscontrary to public\n                                interestthat the application should be granted, to\n                            attend on the hearing of the application and oppose it.[emphasis in bold added]34     The English Court of Appeal inR v Sundranpillai Theivendran(1992)\n                    13 Cr App R (S) 601 (“Sundranpillai Theivendran”), observed the protective\n                    rationale of s 11(1) of the CDDA (as well as s 360(1)(a) of the UK Insolvency Act 1986, being inpari materiawith s 148(1)(a) of our local Bankruptcy Act) (per Farquharson LJ at\n                    603):the underlying purpose of [these statutory provisions]... is to\n                        rationalise the law of insolvency and in general to enable those involved in\n                        business failureto get back on their feet as rapidly as\n                            may be consistent with fairness to their creditors.[emphasis added]35     The Australian Courts highlighted that the\n                    prohibition serves protective purposes and isnot a punitive\n                        rule. The Supreme Court of New South Wales inRe Altim Pty Ltd[1968] 2 NSWR 762 made the following\n                    observation in the context of s 117(1) of the Australian Companies Act 1961\n                    (inpari materiawith s 148(1) of our\n                    Companies Act) (per Street J in 764):...the section is not in any sense a punishment of the bankrupt. Nor\n                        should a refusal to grant leave under that section be regarded as punitive.The prohibition is entirely\n                        protective...[emphasis added]36     Bowen CJ similarly observed inRe Magna Alloys & Research Pty Ltd(1975)\n                    1 ACLR 203 at 205 that the rationale of the prohibition was not\n                    punitive, but protective:The section is not punitive. It is designed to protect the public and to\n                        prevent the corporate structure from being used to the financial detriment\n                        of investors, shareholders, creditors and persons dealing with a company. In\n                        its operation[,] it is calculated as a safeguard against the corporate\n                        structure being used by individuals in a manner which is contrary to proper\n                        commercial standards.37     The protective rationale is consistent with\n                    the policy behind the bankruptcy regime to achieve a balanced approach.\n                    Professor Ho Peng Kee observed in the Second Reading of the Bankruptcy\n                    (Amendment) Bill (Singapore Parliamentary Debates,\n                    19 January 2009, vol 85) that:Our bankruptcy regime seeks to give creditors their rights whilst, at the\n                        same time, give debtors an opportunity to make a fresh start\n                        in their financial matters.38     The non-punitive rationale behind the\n                    prohibition as observed in the English and Australian positions applies equally\n                    to s 148 of our Companies Act. This is apparent from the amendments made in\n                    1999 to facilitate the ability of undischarged bankrupts to resume directorship\n                    or management of businesses. As observed in the Reading of the Bankruptcy\n                    (Amendment) Bill (Singapore Parliamentary Debates,\n                    18 August 1999, vol 70, col 2184 to 2186, per Professor Ho Peng Kee):...it is important that a bankrupt remains economically productive even\n                        during bankruptcy. This will allow the bankrupt to settle his debts earlier\n                        and get out of bankruptcy more speedily. It will also allow the bankrupt to\n                        continue contributing economically to society during bankruptcy.Presently, a bankrupt cannot act as a company director or engage in the\n                        management of a company or business, except with leave of Court. However,\n                        very few bankrupts apply to court for permission to do business, deterred by\n                        the costs and trouble of having to apply to Court. The Official Assignee, as\n                        administrator of a bankruptcy estate, frequently deals with bankrupts and is\n                        more knowledgeable of their affairs. He will therefore be able to consider\n                        the merits of each case before he grants permission. Allowing the Official\n                        Assignee to grant such permission will also make the process cheaper,\n                        simpler and more accessible to the bankrupts.39     In light of the authorities above, it is clear\n                    to me that the prohibition on managing a company or business (or being a\n                    director of a company) found in s 148(1) of the Companies Act and\n                    s 26(1) of the Business Registration Act is premised on protective\n                    considerations. The prohibition in these provisions is not intended to be\n                    punitive in nature. Accordingly, to mete out the correct sentence, it is\n                    critical to bear this statutory objective in mind.Sentencing Guidelines40     Given the protective nature of the relevant\n                    provisions, the predominant consideration in sentencing offenders for breach of\n                    s 148(1) of the Companies Act and s 26(1) of the Business Registration\n                    Act is to evaluate the applicability of the deterrent principle with a view to\n                    protecting the interests of creditors and the public from harm caused by the\n                    bankrupt’s management of the business. As a starting point, if no harm was\n                    caused to anyone arising from the offence and there was no dishonest element in\n                    the commission of the offence, a fine would generally be\n                sufficient.41     In my view, a custodial sentence would\n                    typically be appropriate where one or more of the following aggravating\n                    circumstances are present,viz:(a)     The unlawful continuance of\n                        directorship and/or management of the company or business resulting in loss\n                        or harm suffered by innocent third parties who dealt with the company or\n                        business under the management of the undischarged bankrupt (see[43]below).(b)     The offence was committed with dishonest\n                        intention to cheat or defraud innocent third parties (see[51]below).(c)     The offender obtained personal gains or was\n                        enriched as a result of committing the offences (see[44]below).(d)     The flagrant or reckless disregard of the\n                        prohibition, such as the direct or indirect involvement in the incorporation\n                        of companiesafterthe offender has already\n                        been made a bankrupt in order to circumvent the prohibition (see[45]–[50]below).(e)     The offence was committed in breach of an existing\n                        disqualification order made under ss 149, 149A and154 of the Companies Act\n                        (see[51]below).(f)     The offence was committed over a\n                        prolonged period of time during which the offender was inactivemanagement.(g)     The offender has antecedents of the same offence or\n                        related bankruptcy offences under the Bankruptcy Act, Companies Act and/or\n                        the Business Registration Act (see[51]below).42     The above aggravating factors serve as a guide\n                    in the exercise of sentencing discretion. They are not intended to be\n                    exhaustive. Each case must necessarily be decided on its own facts. Although the\n                    lack of any of these aggravating factorsmay not\n                        necessarilypreclude the imposition of a custodial sentence, a\n                    sentencing judge ought to give due consideration and justification whenever a\n                    custodial sentence is imposed in theabsenceof\n                    recognised aggravating factors. I will elaborate on the aggravating factors. In\n                    the meantime, I should add that it is certainly incorrect to approach the\n                    question by examining whether there are exceptional circumstances to warrant the\n                    imposition of anon-custodialsentence as observed\n                    by the DJ at [33] of her grounds of decision (“the GD”). In my\n                    view, it should be the other way round. As I have explained in[40]above, in the absence of loss or harm to\n                    third parties or dishonesty (which are both aggravating factors), a fine is\n                    typically the appropriate sentence. Accordingly, the court should instead\n                    establish whether there are circumstances to warrant the imposition of a\n                    custodial sentence.43     Consistent with the protective rationale of\n                    the prohibition, the law will take a serious view towards offenders who, as a\n                    result of the continued directorship or management of businesses, caused\n                    innocent third parties who deal with such businesses to suffer losses. A\n                    custodial sentence would be imposed in these situations to satisfy the\n                    requirements of specific and general deterrence. InLim Hua\n                        Tong, a fine of $5,000 was imposed for the conviction of one\n                    charge under s 148(1) of the Companies Act. The judge placed emphasis on\n                    the fact that no harm was caused to anyone (at [22]–[23]):...there was nothing here that called for the imposition of a sentence of\n                        imprisonment. There was no harm caused to any one apparently, as there was\n                        no mention of this in the [Statement of Facts]......The range of fines for such a first [time] offender, who does not cause\n                        harm is generally between $2,000 to $6,000 or so.44     A fine is generally inappropriate where the\n                    offender has obtained personal gains or was enriched as a result of committing\n                    the offences. In such situations, a fine will generally not be sufficient to\n                    serve as a deterrent as it may only disgorge some of the profits (given that the\n                    maximum fine is only $10,000).45     It has been accepted that the offender’srecklessorflagrantdisregard of the prohibition under s 148(1) of the\n                    Companies Act, or s 26(1) of the Business Registration Act is an\n                    aggravating factor: seeOng Kwang Engat [15],Yeong Chuan WorandSundranpillai Theivendran. However, the DJ in the court below\n                    took a questionable position on what constitutes “reckless” or\n                    “flagrant” disregard. She decided that one of the reasons which\n                    warranted a custodial sentence was because the appellant had been informed by\n                    the OA that she was prohibited from managing a business, and by doing so despite\n                    having been informed, the appellant had “blatantly flouted” the\n                    disqualification (see [31]):...this was not a case where the accused was ignorant of the fact that she\n                        could not manage a business or company.She was briefed,\n                            like any other undischarged bankrupts, by the Official\n                        Assignee that she should not concern herself in the management of a business\n                        or company...In this case, it was plain that the accused hadblatantly floutedthe disqualification.[emphasis in bold and in italics added]46     In support of the DJ’s observations\n                    above, the Prosecution argued the following (at [35] of the DPP’s\n                    submissions):While it is true that the [a]ppellant managed NSS and NCPL before she was\n                        made a bankrupt[,] thatipso factois not a\n                        distinguishing factor from the case precedents as the fact remains that she\n                        continued to run NSS and NCPL after she was made a bankrupt and thereafter\n                        managed Kaseve Lite N Comm and Kaseve Lighting Pte Ltd inflagrant disregardof the law that prohibited her from doing\n                        so...[emphasis added].47     In the same vein, the court inNg Chuan Sengat [10]–[12] observed that:10    This was not a casewhere the\n                                accused was ignorant of the fact that he could not manage a\n                                business. He had been briefed just like any other bankrupt that he\n                                should not concern himself in the management of a\n                                business. However, he sought to justify his acts by\n                            claiming that it was a family business and he had his wife’s\n                            sanction......12    ...it is plain that the accused has quite blatantly\n                            defied the disqualification order on him...His deliberate disregard of\n                            the law continued for a considerable period of time[emphasis added].48     In so far as the above views stand for the\n                    proposition that an offender who committed the offence despite having been\n                    briefed by the OA of the prohibition against management (or directorship) should\n                    be punished with a custodial sentence, as they have “blatantly”\n                    disregarded the prohibition, I would disagree. As observed by the DJ herself,\n                    the offender,like any other undischarged\n                        bankrupts, was briefed by the OA of the prohibitions. This means\n                    that apart from the rare case where the undischarged bankrupt wasnot briefedby the OA (perhaps due to its hypothetical\n                    rare lapse, if any or at all), all offenders wouldinexorablybe punished with a custodial sentence. This would\n                    render the discretion to impose a fine superfluous.49     Furthermore, the fact that a person has\n                    breached the prohibition simply gives rise to the offence itself. As a matter of\n                    jurisprudential logic, it is a self-evident sentencing principle that the very\n                    fact which creates the offence cannotin and of\n                        itselfbe an aggravating factor. This is different from taking\n                    into account themannerin which the offence was\n                    committed which, in appropriate circumstances, can amount to an aggravating\n                    factor. However, thevery actof committing an\n                    offence cannot at the same time be an aggravating factor. Otherwise, the\n                    sentencing court would be inclined to impose aheavysentence forallinstances\n                    when such an offence iscommitted. If left\n                    unchecked, this would lead to an inadvertent and illegitimate judicial\n                    legislating of a “minimum sentence” over and above the statutorily\n                    prescribed minimum sentence. As such, I emphasise that whether a custodial\n                    sentence is appropriate in situations where the offender has been briefed by the\n                    OA depends on all the relevant facts and circumstances.50     The circumstances that give rise to flagrant\n                    or reckless disregard of the prohibition can vary across a broad spectrum of\n                    factual matrix. An example is when the offender commits multiple bankruptcy\n                    offences that complements his illegal management of the business, such as the\n                    case inHeng Boon Tong, where the offender was\n                    sentenced to one month’s imprisonment for managing a business without\n                    leave under s 26(1) of the Business Registration Act, along with three\n                    months imprisonment for obtaining credit exceeding $500 without the disclosure\n                    of his bankruptcy status, under s 141(1)(a)\n                    of the Bankruptcy Act. Another example of flagrant disregard is the case ofYeong Chuan Wor, where the offenderincorporatedand managed three companiesafterthe accused was already made a bankrupt. The\n                    offender had also deliberately used his siblings to be the formal directors on\n                    record for the companies in order to evade the prohibition.51     Other aggravating factors include situations\n                    when third parties are cheated or defrauded by the offender (although this may\n                    be diluted if there is a conviction and sentence for a separate cheating\n                    charge); where the offender had committed the offences whilst under an existing\n                    disqualification order under s 154(1) of the Companies Act (such as in the\n                    case ofOng Kwang Eng); and where the offender has\n                    antecedents of similar bankruptcy offences of sufficient gravity. In these\n                    situations, a custodial sentence would usually be appropriate as such offenders\n                    show a manifest disregard for the bankruptcy regime, which if left unchecked,\n                    has the potential to cause substantial harm to the interests of creditors and\n                    the greater public.52     Before I consider the facts of the present\n                    case, it is perhaps appropriate for me to comment on the observation made by\n                    Yong CJ inChoong Kian Haw. Although it was not a\n                    decision on either s 148(1) of the Companies Act or s 26(1) of the\n                    Business Registration Act, the following remark inChoong\n                        Kian Haw(at [24]) appeared to have “inspired” the court to impose custodial sentences in two\n                    earlier decisions inHeng Boon TongandNg Chuan Seng:The magistrate misread my decision inPP v. Ong Ker\n                            Seng[[2001] 3 SLR(R) 134]. In that case, I did not\n                        contradict the trite principles that fines may be imposed in appropriate\n                        circumstances. However, I stated my view that fines were, in general, not a\n                        suitable means of punishment since bankrupts would typically lack the means\n                        to pay for the fines themselves. If they had the funds to pay the fines,\n                        these monies should clearly be channelled instead to the unpaid creditors.\n                        If they lacked the funds and a third party paid for them, the punitive\n                        effect of the punishments is diminished.These concerns\n                            apply with equal force to the sentencing of bankrupts in\n                            general. They are not limited to offences committed under\n                            s 141(1)(a) [the offence of obtaining\n                        credit without disclosure of bankruptcy status under the Bankruptcy\n                        Act].[emphasis added]53     This comment is, with respect, mereobiter dicta. Indeed, there was no charge under\n                        s 141(1)(a) inChoong\n                        Kian Hawin the first place. The question in that case was\n                    whether the imposition of fines for three charges of leaving Singapore without\n                    the OA’s permission (under s 131(1)(b)\n                    of the Bankruptcy Act) was manifestly inadequate. Given the egregious disregard\n                    of the law as the offender had committed the offence 44 times over a period of\n                    15 months, it was plainly clear that the sentences imposed inChoong Kian Hawwere indeed manifestly inadequate. It should\n                    also be noted that the above comment was made to clarify an earlier decision\n                        (PP v Ong Ker Seng[2001]\n                    3 SLR(R) 134). Indeed, the comment has since been analysed and\n                    clarified by Lee J inGanesh s/o M Sinnathamby v Public\n                        Prosecutor[2008] 1 SLR(R) 495:23    The force of the\n                            argument, that the imposition of a fine would not be adequate punishment\n                            in the case of an undischarged bankrupt, is compelling. However it is\n                            not clear how a bankrupt would be able to get his hands on money to pay\n                            the fine except in cases where it is paid by family members or friends.\n                            Therefore, except where a third party is prepared to pay the fine, an\n                            undischarged bankrupt would invariably serve the imprisonment imposed in\n                            default of payment of the fine. Subsequent toChoong\n                                Kian Haw, the lower courts have tended to impose\n                            custodial sentences for such cases. Indeed, this sentencing trend was so\n                            prevalent that it was raised in Parliament on 2 March 2007 (seeSingapore Parliamentary Debates, Official\n                                Report(2 March 2007) vol 82 at cols 2348-2349) by\n                            Mr Inderjit Singh, whose comments were as follows:Sir, one particular example of how harsh the regime here is the case\n                            of bankrupts who leave Singapore ... Many of these persons get hauled up\n                            before the courts and face criminal sanction under the Bankruptcy Act,\n                            section 131, where the Act punishes them with either a $10,000 fine or a\n                            jail term of two years. But unfortunately, we had a precedent set by the\n                            former Chief Justice where, under the case of Public Prosecutorvs[Chung Kian How], he decided that\n                            punishment for this offence should be a jail term. And subsequently, the\n                            Subordinate Courts are bound by this precedent. I am not a lawyer, but I\n                            think they are bound by this precedent set by the High Court.I think the courts should not be playing the role of Parliament and I\n                            hope that the Minister can explain this. I suggest that the Minister\n                            look at Chapters 7 and 13 and also the harshness of this rule to be\n                            reduced.24    Notably, the\n                            response by the Senior Minister of State for Law, Assoc Prof Ho Peng Kee\n                            was couched in the following terms (vol 82 at col 2365):[W]hy are they jailed? This is a court decision, but let me just say\n                            that they are not all jailed because, in fact, the Act allows for a\n                            person to be either jailed or fined. So I would say that we should leave\n                            it to the court to look at the facts and circumstances of the case\n                            because every case is unique - whether he has travelled before, how long\n                            he stays away, whether he is a cooperative bankrupt, whether he has\n                            other offences hanging over his head. That is why I think we should\n                            leave it to the court. My assurance to Mr Singh is that there are cases\n                            where the bankrupt is only fined and not jailed. So it is not mandatory\n                            jail.25    Unfortunately, the foregoing exchange underscores a\n                            misconception that the case ofChoong Kian\n                                Hawhas unfairly imposed a sentencing \"precedent\" that\n                            compels the imposition of a custodial sentence on bankrupts who\n                            contravene travel restrictions under the Act ([1]supra). This is clearly not the case.26    To begin with, it should be highlighted that Yong\n                            CJ prefaced his guidelines by stating in no uncertain terms that he \"did\n                            not contradict the trite principles that fines may be imposed in\n                            appropriate circumstances\" (above at [22]). On appeal, the Prosecution\n                            tendered a list of cases in which fines were in fact imposed in cases\n                            where the accused had taken a small number of trips out of the\n                            jurisdiction. While the number of trips may be an important factor to be\n                            considered in determining the appropriate sentence (in so far as it\n                            reflects the degree of recalcitrance), it is undoubtedly not the sole\n                            factor.27    On this note, I feel compelled to reiterate that\n                            whilst past cases serve as focal guidelines for the sentencing court,\n                            these \"tariffs\" should be applied with due appreciation of the unique\n                            facts and circumstances of each individual case (Soong Hee Sin v PP[2001]\n                            1 SLR(R) 475  ). It remains the duty of the court to\n                            remain apprised of all relevant factors and to seize the \"judicial\n                            prerogative to tailor criminal sanctions to the individual offender\"\n                                (Abu Syeed Chowdhury v PP[2002]\n                            1 SLR(R) 182 at [15]).54     I cannot agree more with the above\n                    observations. It would require significantly more than meredictato create a fetter on a court’s sentencing\n                    discretion. To expect any less would be to tread perilously close to an\n                    abdication of the responsibility of the sentencing judge in applying his mind\n                    and the law to the facts of each case.The\n                        Court’s decision55     Turning to the facts of the present case, it\n                    is pertinent to first highlight that the Prosecution conceded that no one\n                    suffered any lossarisingfrom the\n                    appellant’s offences. The appellant’s debt of $105,000 (as loaned\n                    from Koh) was incurredbeforeshe was adjudged a\n                    bankrupt. The sum of $85,088.40 contributed by Koh to finance the purchase of\n                    the AVI equipment for onward sale to Fujitec was also incurredbeforethe appellant was adjudged a bankrupt, and was\n                    therefore irrelevant to the charges. At the time when the offences were\n                    committed, not only did no one suffer any loss, Koh and NSS in fact received\n                    some repayments in reduction of the debts owed by the appellant. Koh received\n                    the sum of around $21,000 from Fujitec between January and April 2002, and\n                    a sum of $350 from the appellant in March 2002, and NSS received the sum of\n                    $18,454 from Fujitec on 25 April 2002.56     The Prosecution argued before me that the\n                    appellant had dishonestly used Koh’s monies, through the entities of\n                    Kaseve and NSS, to finance the purchase of AVI equipment to supply to Fujitec,\n                    and that when Fujitec made payment for the equipment, the monies were\n                    dishonestly received by the appellant and NCPL. This submission was apparently\n                    accepted by the DJ as can be observed from her GD (at [29]):As seen in paragraph 12 herein, Fujitec’s payments were madeafterthe accused became a bankrupt and\n                        she utilised the money for other purposes unrelated to Koh, NSS or Kaseve\n                        International...Evidently, the accused was not honest in her dealings with\n                        Koh...in view of the excuses she gave Koh...and that she utilized the money\n                        for other purposes, I did not believe the mitigation that it was\n                        miscommunication and/or inadvertence that Fujitec paid into the incorrect\n                        account.[emphasis in original]57     There is no factual basis to support either\n                    the Prosecution’s submission or the finding by the DJ. To begin with, the\n                    reference by the DJ to [12] of her GD to support her finding is clearly\n                    erroneous since [12] merely referred to payments received from Fujitec after NSS\n                    was formed and not after the appellant’s bankruptcy. Fujitec’s\n                    payment of $10,381.37 into NCPL’s bank account on 25 July 2001 was\n                    irrelevant to the appellant’s charges as it took placebeforeshe was adjudged a bankrupt. Although Fujitec credited\n                    the sums of $21,349.84 and $5,814.35 into NCPL’s bank account on\n                    21 December 2001 and 25 January 2002 respectively, shortlyaftershe was adjudged a bankrupt, there was nothing in\n                    the statement of facts (“SOF”) to indicate that these payments\n                    were credited for deliveries of AVI equipment made by NSS, Kaseve, or Kohafterher bankruptcy. Given that the payment\n                    on 21 December 2001 took place a month after the appellant was adjudged a\n                    bankrupt and that NCPL had existing dealings with Fujitec, it cannot be assumed\n                    that the payments received by NCPL were not in respect of transactions with\n                    Fujitec concluded prior to her bankruptcy. Even if the payments were indeed made\n                    for NSS’ deliveries to Fujitec, and NSS was the proper entity to receive\n                    the payment, the payment was clearly in respect of the two purchase orders dated\n                    19 April 2001 and 10 July 2001[note: 2]which were transacted some\n                    time prior to the appellant’s bankruptcy. Further, it was also admitted in\n                    the SOF that the goods which were delivered pursuant to these two purchase\n                    orders were in turn purchased by Kaseve in March 2001[note: 3].\n                    In my view, there was no question of any manipulation. The appellant was simply\n                    seeking to fulfil NCPL’s existing obligations to Fujitec through NSS and\n                    Kaseve. In any event, even if there was manipulation, it took placebeforeshe was adjudged a bankrupt on 23 November 2001\n                    and was therefore equally irrelevant to the charges. For completeness, I\n                    observed that a cheating charge initially preferred against the appellant (DAC\n                    10990 of 2009) for the payments into NCPL’s account was subsequently\n                    withdrawn and the appellant was granted a discharge amounting to an acquittal in\n                    relation to that charge[note: 4]. In these\n                    circumstances, there cannot be any basis to find that the appellant had, while\n                    committing the offences of managing the business of NSS,dishonestlymade use of Koh, Kaseve and NSS to finance the\n                    supply of the AVI equipment to Fujitec in order to enrich NCPL or\n                    herself.58     The DJ also found that the appellant had\n                    “deliberately influenced” Koh into registering the sole\n                    proprietorships of Kaseve and NSS to enable her to manage them (at [31]):[the appellant’s] involvement was not in passing. She had\n                        deliberately influenced Koh into registering sole proprietorships which she\n                        then managed.The suggestion from this finding is that the appellant had asked Koh\n                    to register Kaseve and NSS in Koh’s namebecausethe appellant knew that she was prohibited from managing\n                    these sole-proprietorships. However, it is incontrovertible that both Kaseve and\n                    NSS were formedbeforethe appellant was adjudged\n                    a bankrupt. The present case is therefore unlike the situation inYeong Chuan Wor, where the offender had requested his\n                    siblings to be the directors on record for three companies in order to conceal\n                    his involvement in running the operations of the companies. Further, inYeong Chuan Wor, the companies were\n                    incorporatedafterthe offender’s\n                    bankruptcy. Finally, the appellant had admitted (and the Prosecution does not\n                    dispute this) that the reason why she requested Koh to register Kaseve and NSS\n                    wasbecauseof NCPL’s financial difficulties\n                    in performing its existing contracts with Fujitec (at [36] of SOF):...NCPL had pre-existing contracts with Fujitec for the supply of\n                        intercommunication equipment. However, NCPL was not in a financial position\n                        to fulfil its contractual obligations and NCPL risked a potential lawsuit\n                        from Fujitec. To avert the situation, the accused admitted to Koh that she\n                        had asked him to register KI and subsequently NSS...59     Further, the DJ also attached considerable\n                    weight to her finding that the offences were committed over a prolonged period\n                    of time and consequently decided not to attach weight to the fact that the\n                    appellant was a first time offender, (at [31]–[32] of her GD):[The appellant’s] deliberate disregard of the law continued for a\n                        considerable period of more than 4 years...I further felt that because the offences were committed over a few years,\n                        there was little reason to make a concession to the plea that she had no\n                        previous conviction60     With respect, this finding is flawed. Although\n                    the appellant had remained as a director on record of NCPL for a period of\n                    almost four years between 18 December 2001 and 4 July 2005, and hence\n                    committed the offence under s 148(1) for that period of time, it cannot be\n                    said that her “deliberate disregard of the\n                        law” continued throughout a period of more than four\n                    years. The appellant’s last act of management in relation to NCPL was the\n                    withdrawal of a sum of $6,266.52 on 26 January 2002[note: 5].\n                    This took place slightly over a month after she was notified of the prohibitions\n                    by the OA on 18 December 2001. With regard to the management of NSS, it was\n                    clearly stated in the SOF (at [31]) that:...after the accused was notified of her duties and responsibilities as an\n                        undischarged bankrupt on 18 December 2001, the accused continued to\n                        operate the business of NSS until the last Purchase Order of Fujitec dated\n                        10 April 2002.61     It is therefore clear that the\n                    appellant’s last act of management of NSS took place just slightly less\n                    than four months after she was briefed by the OA. Furthermore, there are no\n                    facts to suggest that the late discovery of the appellant’s continued\n                    directorship of NCPL over a period of almost four years was due to the her\n                    attempt to evade detection from the authorities.62     The appellant stated in mitigation that due to\n                    a variety of personal problems, she was in a fragile state of mind at the time\n                    when the OA briefed her on the duties and responsibilities of an undischarged\n                    bankrupt and the relevant prohibitions on 18 December 2001. I agree with\n                    the DJ that her alleged “fragile state of mind” did not constitute\n                    valid mitigation in the circumstances. Nonetheless, I add the general\n                    observation that persons adjudged as bankrupt may not fully appreciate the\n                    duties and responsibilities of an undischarged bankrupt, and may not\n                    sufficiently digest the lengthy list of prohibitions stated in the various\n                    information sheets provided by the OA. This merely reinforces my point that\n                    there should be a system in place for the OA’s office to effectively\n                    liaise with Accounting and Corporate Regulatory Authority (“ACRA”)\n                    to ensure the timely cessation of directorships held by an undischarged bankrupt\n                    immediately or shortly after being pronounced bankrupt. I pause to note that\n                    under s 173(6A) of the Companies Act, there is strictly no obligation for\n                    the bankrupt person to file the cessation notification since such a person\n                        “may” lodge the notification\n                    without specifying the time within which it had to be filed. This is to be\n                    contrasted with s 173(6) of the Companies Act that expressly stipulates\n                    that the company “shall” lodge the\n                    notification within one month after the director ceases to be or is disqualified\n                    to act as a director.Conclusion63     The above analysis of the facts relevant to\n                    the present charges revealed that there are no aggravating factors to warrant\n                    the imposition of a custodial sentence. In particular, I attached significance\n                    to the fact that no one suffered any loss from the appellant’s offences\n                    and that there was no dishonest element either. Further, although the offence of\n                    acting as a director of NCPL was committed over almost four years, in truth, her\n                    acts of management were limited only to perform the purchase orders that were\n                    placed by Fujitec over a relatively short period of time following her briefing\n                    by the OA. I have taken into consideration the fact that there are six TIC\n                    charges, and that the appellant has no antecedents. For the reasons set out\n                    above, I allow the appeal and reduce the sentences to:(a)DAC 10992 of 2009 – fine of $7,000 (in\n                            default 4 weeks’ imprisonment)(b)DAC 10995 of 2009 – fine of $7,000 (in\n                            default 4 weeks’ imprisonment)The sentence imposed by the court below for DAC 10999 of 2009 which is\n                    not the subject of the appeal before me stands as it is.Post Script64     During the hearing of the appeal, I remarked\n                    that it was odd for the appellant to have remained on record as a director of\n                    NCPL for such a long time despite being made a bankrupt. I directed the\n                    Prosecution to file additional submissions to explain the working protocol\n                    between ACRA and the OA as regards removal of persons as directors who have been\n                    adjudged bankrupt. From the further submissions, the following picture has\n                    emerged:(a)     Prior to January 2001, the\n                        Registry of Companies and Businesses (“RCB”) (now known as\n                        ACRA) relied on the company to provide notification under s 173(6) of\n                        the Companies Act whenever a person was disqualified from acting as\n                        director.(b)     In January 2001, s 173 of the Companies Act was amended with the\n                        insertion of a new subsection 6A to enable the disqualified person to\n                        directly report the cessation if he has reasonable cause to believe that the\n                        company may not notify the RCB.(c)     Currently, IPTO would provide a list of persons against\n                        whom bankruptcy orders have been made to ACRA on a weekly\n                    basis.(d)     Checks on\n                        the status of a bankrupt are conducted at “critical” junctures in the course of bankruptcy\n                        administration such as when a complaint is received against a bankrupt or\n                        when the bankrupt is being reviewed for suitability for discharge. Where\n                        such checks or searches reveal that the bankrupt has remained a director,\n                        IPTO will then send a letter to the bankrupt to remind him or her that it is\n                        an offence to act as a director and that steps should be taken to file\n                        cessation notification within a stipulated time.(e)     IPTO would refer breaches of\n                        s 148 of the Companies Act to the Commercial Affairs Department\n                        (“CAD”) for investigation and\n                prosecution.65     It is apparent from the description of the\n                    existing protocol that the cessation of a person acting as a director is heavily\n                    dependent on the initiative of the company or the undischarged bankrupt. As a\n                    result, if steps are not taken by either the company or the director to file\n                    cessation notification, it is possible that the undischarged bankrupt may remain\n                    a director in the company for years following the bankruptcy adjudication.\n                    Indeed, this was precisely the case in the present appeal where the appellant\n                    remained a director of NCPL for almost four years following her bankruptcy.\n                    Although not raised by the Prosecution, I have noted that in addition to the new\n                    subsection 6A, subsection 6B was introduced at the same time to empower the\n                    Registrar of Companies, on his own initiative, to remove the name of any person\n                    from the registry whom he has reason to believe is no longer qualified to act as\n                    a director by virtue of s 148 or s 155 of the Companies\n                Act.66     From the additional submissions filed by the\n                    Prosecution, the unsatisfactory state of the existing arrangement presents a\n                    more compelling case for review. On 17 April 2003, the RCB issued a summons\n                    against the appellant for failing to lodge a change of address in respect of\n                    NLPL in 2002, an offence punishable under s 143(1) of the Companies Act. On\n                    19 February 2004, the RCB issued another summons against the appellant for\n                    failing to hold an Annual General Meeting and for failing to file annual returns\n                    in respect of NLPL and NCPL in 2002, offences punishable under s 175(4) and\n                    s 197(7) of the Companies Act. In the course of the appellant making\n                    representations for the charges to be withdrawn, ACRA found out that she was a\n                    bankrupt. On 25 July 2005, the charges against the appellant were formally\n                    withdrawn presumably because ACRA was satisfied that given her bankruptcy\n                    status, the appellant had in fact ceased to be actively involved in the\n                    management of NLPL and NCPL, as the charges were in respect of her failure, in\n                    her capacity as an officer of the companies, to hold an annual general meeting\n                    and her failure to file annual returns for NLPL and NCPL. Despite the fortuitous\n                    discovery of the appellant’s bankruptcy status, ACRA did not take any step\n                    to require the appellant to lodge the cessation notification though the\n                    Registrar of Companies is empowered to remove her as a director from the\n                    registry pursuant to s 173(6B) of the Companies Act. Instead, the discovery\n                    of her breaches came up under a different context during IPTO’s review of\n                    the appellant’s suitability for discharge from bankruptcy. Thereafter on\n                    24 June 2005, IPTO wrote to the appellant to advise her to take steps to\n                    resign as a director which she duly did on 4 July 2005. Notwithstanding her\n                    compliance with IPTO’s reminder to resign, the appellant was charged for\n                    acting as a director on 22 December 2009, almost five years later. There is\n                    no suggestion, from the facts provided by the Prosecution, that any letter was\n                    sent to the appellant to inform her to cease her directorship in NCPL, between\n                    the time when ACRA discovered her bankruptcy status to the time it was\n                    discovered by IPTO in June 2005. As I have explained in[32], the rationale for s 148 of the\n                    Companies Act is to safeguard the interest of the unsuspecting public from\n                    dealing with companies managed by directors who are undischarged bankrupts. The\n                    existing arrangement which depends on the initiative of the company and the\n                    undischarged bankrupt may not be adequate to achieve the intended objective of\n                    s 148 of the Companies Act. In my view, it is imperative for ACRA or IPTO\n                    to take proactive steps to ensure the immediate cessation of directorship(s) by\n                    such persons and not leave it to chance to discover the breaches at\n                        “critical” junctures in the\n                    bankruptcy administration.67     In my opinion, the following measures should\n                    beconsideredfor implementation:(a)     Currently, a list of persons\n                        adjudged to be bankrupt isalreadyprovided by\n                        IPTO to ACRA on a weekly basis. From this list, a check on the directorship\n                        status of persons adjudged bankrupt should be made by\n                    ACRA.(b)     The results\n                        of such searches should then be submitted to IPTO. I assume these steps\n                        could be completed in good time with the benefit of a computerised process\n                        and the use of identification numbers of persons adjudged to be a bankrupt.\n                        A letter should then be sent by IPTO to these persons to inform them of\n                        their obligation to file a notice of cessation in accordance with\n                        s 173(6A) of the Companies Act.(c)     If the notice of cessation is not filed within the\n                        requisite time, IPTO can consider taking appropriate steps, including\n                        sending a further reminder or inviting the Registrar of Companies to remove\n                        the person as a director from the registry or adopting the option of\n                        referring the matter to the CAD or any other relevant authority for\n                        consideration of further action.68     The rationale and importance of establishing a\n                    systemic process such as this is to prevent undischarged bankrupts from\n                    unwittingly committing the technical offence of remaining as a director on\n                    record of companies, even if these persons had played no role in the management\n                    of such companies. Equally, it would serve to ensure that public interest is\n                    protected to prevent third parties from dealing with companies in ignorance of\n                    the bankrupt status of its directors. The above measures are onlysuggestionsfor consideration as ultimately the\n                    feasibility of such a system is a matter for ACRA and IPTO to implement. Having\n                    said that, it is clear to me that it is not entirely satisfactory for the\n                    relevant authorities to find out that an offence has been committed only when\n                    the undischarged bankrupt is being reviewed for suitability for discharge. In\n                    this case, instead of beingdischargedfrom\n                    bankruptcy, to add to her woes, the appellant was insteadchargedand, worse still, faced with the possibility of a\n                    custodial sentence. This is indeed an unfortunate and ironic outcome given that\n                    “the underlying purpose of [these statutory provisions]... is to\n                    rationalise the law of insolvency and in general to enable those involved in\n                    business failureto get back on their feet as rapidly as may\n                        be consistent with fairness to their\n                        creditors”[note: 6].[note: 1]Statement of Facts at\n                [36].[note: 2]Statement of\n                                Facts at [15].[note: 3]Ibid.[note: 4]Appellant’s Skeletal Submissions\n                                dated 20 October 2010 at [16].[note: 5]See Statement of Facts at [26].[note: 6]Per\n                                Farquharson L. J. in the English Court of Appeal decision ofR v Sundranpillai Theivendran(1992) 13 Cr App R (S) 601 at p\n                            603.",
        "Events after the appellant’s bankruptcy": "13     Despite acknowledging receipt of the various\n                    documents from the OA which included the prohibition on acting as director or\n                    being involved in management, the appellant continued as a director of NCPL for\n                    almost four years, between 18 December 2001 and 4 July 2005. The\n                    appellant only resigned from her directorship on 4 July 2005, after\n                    receiving a letter of warning dated 24 June 2005 from the Insolvency &\n                    Public Trustee’s Office (“IPTO”). 14     The appellant had unrestricted access to\n                    NCPL’s funds (via an ATM card and cheque book) between 18 December\n                    2001 and 31 January 2002. Fujitec credited a sum of $21,349.84 on\n                    21 December 2001 into NCPL’s bank account. Thereafter, the appellant\n                    issued cheques which totalled the sum of $22,786.50 to pay various creditors.\n                    The appellant also withdrew the sum of $6,266.52 from NCPL’s bank account\n                    on 26 January 2002, after Fujitec credited the sum of $5,814.35 on\n                    25 January 2002. The appellant had, on 26 December 2001, represented\n                    herself as a director of NCPL when she signed a tenancy agreement on behalf of\n                    NCPL. 15     In relation to the offence of taking part in\n                    the management of NSS, the appellant was substantially involved in the running\n                    of NSS’ business. It was the appellant who made all the business decisions\n                    while Koh’s role was reduced to providing the financing for the purchase\n                    of the AVI equipment. The appellant admitted that because NCPL was unable to\n                    fulfil its obligation to supply AVI equipment to Fujitec under its existing\n                    contracts, the appellant had asked Koh to set up NSS, and had used Koh’s\n                    funds to purchase the AVI equipment through NSS to supply to Fujitec[note: 1]. 16     Between January and April 2002, Koh\n                    received cheque payments totalling $19,000, for the AVI equipment purchased by\n                    Fujitec from NSS, as well as cash payments of around $2,000 for servicing\n                    charges. In addition, the appellant handed Koh a cheque issued in the name of\n                    NSS for the sum of $350 in March 2002. Fujitec further credited $18,454\n                    into NSS’ account on 25 April 2002. 17     In December 2001, Koh discovered that the\n                    appellant had been adjudged a bankrupt on 23 November 2001.To safeguard his own\n                    interest, Koh terminated the two sole-proprietorships of Kaseve and NSS on\n                    28 June 2002.",
        "The Decision below": "18     In arriving at her decision to impose a\n                    sentence of six weeks’ imprisonment for each of the two charges, the DJ\n                    took into account the following factors: (a)     The appellant’s deliberate\n                        disregard of the prohibition on acting as a director of NCPL for a period of\n                        more than four years (consequently no concession was given for her guilty\n                        plea or her complete absence of antecedents). (b)     The appellant’s lack of honesty in her\n                        dealings with Koh in that she manipulated the transactions and utilised\n                        payments received from Fujitec after she was adjudged to be a bankrupt for\n                        purposes unrelated to Koh, Kaseve and NSS. (c)     The appellant’s involvement in the\n                        management of NSS and Kaseve was not just “in passing” and she\n                        had deliberately influenced Koh into registering the two\n                        sole-proprietorships for her to manage. (d)     The absence of exceptional circumstances which\n                        warranted a non-custodial sentence.",
        "Overview of the Subordinate Court decisions": "19     The statutory provisions of s 148(1) of\n                    the Companies Act and s 26(1) of the Business Registration Act are\n                    reproduced below: Restriction on undischarged bankrupt being\n                        director or manager 148. —(1) Every person who, being an undischarged bankrupt\n                        (whether he was adjudged bankrupt by a Singapore Court or a foreign\n                        court having jurisdiction in bankruptcy), acts as director of, or\n                        directly or indirectly takes part in or is concerned in the management\n                        of, any corporation, except with the leave of the Court or the written\n                        permission of the Official Assignee, shall be guilty of an offence and\n                        shall be liable on conviction to a fine not exceeding $10,000 or to\n                        imprisonment for a term not exceeding 2 years or to both. Restriction on undischarged bankrupt being\n                        manager 26. —(1) Any person who, being an undischarged bankrupt\n                        (whether he was adjudicated bankrupt by a Singapore court or a foreign\n                        court having jurisdiction in bankruptcy), directly or indirectly, takes\n                        part in or is concerned in the management of any business carried on by\n                        any person required to be registered under this Act, without the leave\n                        of the High Court or the written permission of the Official Assignee,\n                        shall be guilty of an offence and shall be liable on conviction to a\n                        fine not exceeding $10,000 or to imprisonment for a term not exceeding\n                        2 years or to both 20     An offender who contravenes these provisions\n                    faces a wide range of punishment: the offender is liable to be punished by a\n                    fine not exceeding $10,000, or an imprisonment term not exceeding two years, or\n                    both. As alluded to above at[3], my analysis\n                    of several earlier decisions in the Subordinate Courts did not reveal any clear\n                    or consistent sentencing policy. It is unclear what constitutes relevant or\n                    recognised aggravating factors for sentencing purposes. It is to these decisions\n                    that my attention now turns. 21     InPublic Prosecutor v. Ong\n                        Kwang Eng[2005] SGDC 175 (“Ong Kwang Eng”), the offender was sentenced to one\n                    month’s imprisonment under s 148(1) of the Companies Act for taking\n                    part in the management of a company. In determining whether a custodial sentence\n                    was warranted, the judge observed that the “flagrant\n                    contravention” of the law was an aggravating feature in that case (at\n                    [11]): ...a custodial sentence would be appropriate where there are aggravating\n                        features such as flagrant contravention of the law, dishonesty, or where the\n                        offender has previous convictions of a similar nature... 22     The judge, however, adopted a curious approach\n                    as to what constitutes “blatant disregard” of the law (at\n                    [15]): I...considered the length of sentence that would be appropriate on the\n                        facts of this case. The accused blatantly disregarded the disqualification\n                        on him. His actions in directly taking part in the management of Gabriel\n                        Technology Pte Ltd. showed a deliberate disregard of the law... 23     As can be seen from the above, the judge\n                    regarded the very offence (which was the direct involvement in the management of\n                    the company) as an aggravating factor in itself. The judge also imposed a\n                    sentence of one month’s imprisonment for breach of the disqualification\n                    order under s 154(1) of the Companies Act, and ordered both imprisonment\n                    sentences to run concurrently. 24     A somewhat inconsistent outcome was reached inPublic Prosecutor v Lim Hua Tong Jasons[2005] SGDC 122 (“Lim Hua\n                    Tong”) where a non-custodial sentence was imposed for a\n                    conviction under s 148(1) of the Companies Act despite the fact that the\n                    offender was directly involved in the management of the company (a private\n                    education centre), made management decisions, and was in charge of the academic\n                    programmes, training courses and the business development of the company. Like\n                    the case inOng Kwang Eng, no harm resulted from\n                    the commission of the offences. The judge inLim Hua\n                        Tongfound that a fine of $5,000 (in default six weeks’\n                    imprisonment) was appropriate since no harm was caused by the offences, the\n                    offences did not persist over several years, and the offender had no relevant\n                    antecedents. The judge held that (at [23]): The range of fines for such a first [time] offender, who does not cause\n                        harm, is generally between $2,000 to $6,000 or so. 25     A different sentencing approach was adopted inPublic Prosecutor v Yeong Chuan Wor[2004] SGDC 141 (“Yeong Chuan\n                    Wor”). Unlike the approach inOng Kwang\n                        Engwhere the judge found that direct involvement in the\n                    management of the companyper seconstituted a\n                    flagrant contravention of the law and was hence an aggravating factor, the judge\n                    inYeong Chuan Woradopted a slightly more\n                    methodical approach in the treatment of “flagrant contravention of the\n                    law”. The judge found that there was flagrant contravention of the law\n                    due to several factors: (a)the offender committed the offence despite having\n                                been briefedby the OA;(b)the offender had continued to manage the company\n                            despite ceasing to be a director; and(c)the offender incorporated three companiesafterhe was adjudged a\n                            bankrupt.The judge found that a custodial sentence was warranted due to this\n                    “flagrant contravention of the law”, even though there was no\n                    dishonesty and no loss was caused by the offender (Yeong\n                        Chuan Worat [37]):In the present case, in determining whether the custody threshold had been\n                        breached, I noted that there had been no dishonesty established and that\n                        there had been no evidence of any loss to the clients of the companies.\n                        However, even in the absence of dishonesty or loss to third parties, a\n                        custodial sentence is correct when there has been a flagrant contravention\n                        of the [prohibition]...I found that to be the case here. The accused who was\n                        served with the bankruptcy information sheet knew perfectly well that he\n                        should not concern himself in the management of a company. Yet he did\n                        precisely that. After having ceased to hold the position of director of\n                        Scmart Malaysia as requested by the OA, he nevertheless continued to manage\n                        the company in disobedience of the statutory provision. ...He carried on\n                        disobeying the order by incorporating not one company, but three\n                        companies.26     The sentences imposed by the judge inYeong Chuan Worwere nonetheless quite odd, to\n                    say the least. A sentence of six weeks’ imprisonment was imposed on the\n                    accused for managing Scmart Singapore for less than six months, while a sentence\n                    of three weeks was imposed for managing another company, Synergy, for slightly\n                    more than eleven months. Inexplicably, a sentence of two weeks’\n                    imprisonment was imposed for managing Calphix Singapore for a period of about 20\n                    months. These sentences are hardly consistent with the sentence of four\n                    weeks’ imprisonment imposed on the offender inOng\n                        Kwang Eng, who had managed the relevant company for about seven\n                    months, and who, unlike the offender inYeong Chuan\n                        Wor, had serious antecedents of eight convictions for cheating\n                    offences. It is also curious that the judge inYeong Chuan\n                        Worhad, without explanation, concluded that there was no\n                    dishonesty, given that the Judge herself observed the undisputed fact that the\n                    offender had registered his siblings as the companies’ directors, so as to\n                    allow the offender to camouflage his participation in the management of the\n                    company’s operations.27     InPublic Prosecutor v Ng\n                        Chuan Seng[2006] SDGC 264 (“Ng Chuan\n                        Seng”) the judge’s approach was not dissimilar to\n                    that ofOng Kwang EngandYeong\n                        Chuan Worin determining what constitutes “deliberate\n                    disregard of the law” (at [10]–[12]):10    This was not a case where the accused was ignorant\n                            of the fact that she could not manage a business. He had beenbriefed just like any other bankruptsthat he\n                            should not concern himself in the management of a\n                        business......12    In the instant case, it is plain that the accused\n                            has quiteblatantly defiedthe\n                            disqualification order on him. Hisinvolvement was\n                                not in passing. He admitted that he was directly managing the\n                                business. Hisdeliberate\n                                disregardof the law continued for a considerable period\n                            of time...[emphasis in bold and in italics added]28     InNg Chuan\n                    Seng, the offender was sentenced to one month’s imprisonment\n                    under s 26(1) of the Business Registration Act, even thoughlosswas caused to a creditor as a result of the\n                    offence, in addition to the aggravating factor of the so-called\n                    “deliberate disregard of the law”. This is in contrast to the more\n                    severe imprisonment sentences meted out inYeong Chuan\n                        Woreven though in that case no harm or loss was\n                caused.29     Interestingly, the court inPublic Prosecutor v Heng Boon Tong[2007] SGDC 290\n                        (“Heng Boon Tong”) decided to\n                    impose a custodial sentence of one month’s imprisonment for a conviction\n                    under s 26(1) of the Business Registration Act based on wholly different\n                    sentencing considerations. The judge was particularly persuaded by the decision\n                    of Yong CJ inPublic Prosecutor v Choong Kian Haw[2002] 4 SLR(R) 776 (“Choong Kian\n                        Haw”). He observed (Heng Boon\n                        Tongat [7] and [14]):7.    InPublic Prosecutor v. Choong\n                                Kian Haw[2002] 4 SLR 776, the High Court commented that\n                            fines were in general, not a suitable punishment since bankrupts would\n                            typically lack the means to pay for the fines themselves. If they had\n                            the funds to pay the fines, these monies should clearly be channelled\n                            instead to the unpaid creditors. If they lacked the funds and a third\n                            party paid for them, the punitive effect of the punishment is\n                            diminished...The court added that the burden was on the offender to show\n                            that there were such exceptional circumstances to warrant a deviation\n                            from the usual imposition of a custodial sentence....14.    In arriving at the appropriate sentence for the\n                            charge under...s. 26(1) of the Business Registration Act...I...accepted\n                            the prosecution’s submission that a fine is inappropriate in the\n                            present case.30     It appears that the judge inHeng Boon Tongimposed a custodial sentence solely on\n                    this sentencing philosophy as there was no explicable aggravating factor present\n                    in that case. Such a sentencing philosophy was, however, neither referred to nor\n                    applied inOng Kwang Eng,Lim\n                        Hua TongorYeong Chuan Wor. It\n                    was, however, endorsed inNg Chuan Sengwhere the\n                    judge observed that (at [13]):...Yong CJ stated that a sentence in the form of a fine would generally be\n                        ineffective as the bankrupt is unlikely to have sufficient funds to pay the\n                        fine, which would result in someone else having to pay the fine on behalf of\n                        the bankrupt (for which any punitive effect would clearly be\n                        diluted)...31     From the above review, with the exception ofLim Hua Tong, the only common denominator\n                    which I have been able to ascertain from the above decisions is that each of the\n                    judges treated the breach of the statutory prohibition as a deliberate and\n                    flagrant disregard of the law and, on that basis, imposed a range of custodial\n                    sentences. More will be said about this below.Underlying purpose of s 148 of the Companies Act32     Any review of the earlier Subordinate Court\n                    decisions would not be complete without examining themischiefwhich s 148 of the Companies Act is intended to\n                    safeguard against. As stated above (at[1]–[2]), the\n                    prohibition of an undischarged bankrupt from managing (or being a director of) a\n                    company or a business serves not only to protect creditors’ interests; it\n                    also serves to safeguard the greater public interest to prevent an undischarged\n                    bankrupt from misusing the corporate structure for collateral purposes to the\n                    detriment of innocent third parties. InNg Chuan\n                        Seng, the Court observed that s 26(1) of the Business\n                    Registration Act is “designed to protect the public”, while a\n                    similar observation was made inOng Kwang Engthat\n                    the purpose of the disqualification under s 148(1) of the Companies Act is\n                    to “protect corporate and commercial integrity”.33     In England, an undischarged bankrupt would not\n                    be granted leave to be a director, or to manage a company if it iscontrary to the public interestto do so, as is evident\n                    from the express language of s 11of the UK Company Directors\n                    Disqualification Act 1986 (“CDDA”), which provides as\n                    follows:11 Undischarged bankrupts(1)It is an offence for a person to act as director\n                            of, or directly or indirectly to take part in or be concerned in the\n                            promotion, formation or management of a company, without the leave of\n                            court, at a time when-(a)he is an undischarged bankrupt...(2)In England and Wales, the leave of the court\n                            shall not be given unless notice of intention to apply for it has been\n                            served on the official receiver; and it is the latter’s duty, if\n                            he is of opinion that it iscontrary to public\n                                interestthat the application should be granted, to\n                            attend on the hearing of the application and oppose it.[emphasis in bold added]34     The English Court of Appeal inR v Sundranpillai Theivendran(1992)\n                    13 Cr App R (S) 601 (“Sundranpillai Theivendran”), observed the protective\n                    rationale of s 11(1) of the CDDA (as well as s 360(1)(a) of the UK Insolvency Act 1986, being inpari materiawith s 148(1)(a) of our local Bankruptcy Act) (per Farquharson LJ at\n                    603):the underlying purpose of [these statutory provisions]... is to\n                        rationalise the law of insolvency and in general to enable those involved in\n                        business failureto get back on their feet as rapidly as\n                            may be consistent with fairness to their creditors.[emphasis added]35     The Australian Courts highlighted that the\n                    prohibition serves protective purposes and isnot a punitive\n                        rule. The Supreme Court of New South Wales inRe Altim Pty Ltd[1968] 2 NSWR 762 made the following\n                    observation in the context of s 117(1) of the Australian Companies Act 1961\n                    (inpari materiawith s 148(1) of our\n                    Companies Act) (per Street J in 764):...the section is not in any sense a punishment of the bankrupt. Nor\n                        should a refusal to grant leave under that section be regarded as punitive.The prohibition is entirely\n                        protective...[emphasis added]36     Bowen CJ similarly observed inRe Magna Alloys & Research Pty Ltd(1975)\n                    1 ACLR 203 at 205 that the rationale of the prohibition was not\n                    punitive, but protective:The section is not punitive. It is designed to protect the public and to\n                        prevent the corporate structure from being used to the financial detriment\n                        of investors, shareholders, creditors and persons dealing with a company. In\n                        its operation[,] it is calculated as a safeguard against the corporate\n                        structure being used by individuals in a manner which is contrary to proper\n                        commercial standards.37     The protective rationale is consistent with\n                    the policy behind the bankruptcy regime to achieve a balanced approach.\n                    Professor Ho Peng Kee observed in the Second Reading of the Bankruptcy\n                    (Amendment) Bill (Singapore Parliamentary Debates,\n                    19 January 2009, vol 85) that:Our bankruptcy regime seeks to give creditors their rights whilst, at the\n                        same time, give debtors an opportunity to make a fresh start\n                        in their financial matters.38     The non-punitive rationale behind the\n                    prohibition as observed in the English and Australian positions applies equally\n                    to s 148 of our Companies Act. This is apparent from the amendments made in\n                    1999 to facilitate the ability of undischarged bankrupts to resume directorship\n                    or management of businesses. As observed in the Reading of the Bankruptcy\n                    (Amendment) Bill (Singapore Parliamentary Debates,\n                    18 August 1999, vol 70, col 2184 to 2186, per Professor Ho Peng Kee):...it is important that a bankrupt remains economically productive even\n                        during bankruptcy. This will allow the bankrupt to settle his debts earlier\n                        and get out of bankruptcy more speedily. It will also allow the bankrupt to\n                        continue contributing economically to society during bankruptcy.Presently, a bankrupt cannot act as a company director or engage in the\n                        management of a company or business, except with leave of Court. However,\n                        very few bankrupts apply to court for permission to do business, deterred by\n                        the costs and trouble of having to apply to Court. The Official Assignee, as\n                        administrator of a bankruptcy estate, frequently deals with bankrupts and is\n                        more knowledgeable of their affairs. He will therefore be able to consider\n                        the merits of each case before he grants permission. Allowing the Official\n                        Assignee to grant such permission will also make the process cheaper,\n                        simpler and more accessible to the bankrupts.39     In light of the authorities above, it is clear\n                    to me that the prohibition on managing a company or business (or being a\n                    director of a company) found in s 148(1) of the Companies Act and\n                    s 26(1) of the Business Registration Act is premised on protective\n                    considerations. The prohibition in these provisions is not intended to be\n                    punitive in nature. Accordingly, to mete out the correct sentence, it is\n                    critical to bear this statutory objective in mind.Sentencing Guidelines40     Given the protective nature of the relevant\n                    provisions, the predominant consideration in sentencing offenders for breach of\n                    s 148(1) of the Companies Act and s 26(1) of the Business Registration\n                    Act is to evaluate the applicability of the deterrent principle with a view to\n                    protecting the interests of creditors and the public from harm caused by the\n                    bankrupt’s management of the business. As a starting point, if no harm was\n                    caused to anyone arising from the offence and there was no dishonest element in\n                    the commission of the offence, a fine would generally be\n                sufficient.41     In my view, a custodial sentence would\n                    typically be appropriate where one or more of the following aggravating\n                    circumstances are present,viz:(a)     The unlawful continuance of\n                        directorship and/or management of the company or business resulting in loss\n                        or harm suffered by innocent third parties who dealt with the company or\n                        business under the management of the undischarged bankrupt (see[43]below).(b)     The offence was committed with dishonest\n                        intention to cheat or defraud innocent third parties (see[51]below).(c)     The offender obtained personal gains or was\n                        enriched as a result of committing the offences (see[44]below).(d)     The flagrant or reckless disregard of the\n                        prohibition, such as the direct or indirect involvement in the incorporation\n                        of companiesafterthe offender has already\n                        been made a bankrupt in order to circumvent the prohibition (see[45]–[50]below).(e)     The offence was committed in breach of an existing\n                        disqualification order made under ss 149, 149A and154 of the Companies Act\n                        (see[51]below).(f)     The offence was committed over a\n                        prolonged period of time during which the offender was inactivemanagement.(g)     The offender has antecedents of the same offence or\n                        related bankruptcy offences under the Bankruptcy Act, Companies Act and/or\n                        the Business Registration Act (see[51]below).42     The above aggravating factors serve as a guide\n                    in the exercise of sentencing discretion. They are not intended to be\n                    exhaustive. Each case must necessarily be decided on its own facts. Although the\n                    lack of any of these aggravating factorsmay not\n                        necessarilypreclude the imposition of a custodial sentence, a\n                    sentencing judge ought to give due consideration and justification whenever a\n                    custodial sentence is imposed in theabsenceof\n                    recognised aggravating factors. I will elaborate on the aggravating factors. In\n                    the meantime, I should add that it is certainly incorrect to approach the\n                    question by examining whether there are exceptional circumstances to warrant the\n                    imposition of anon-custodialsentence as observed\n                    by the DJ at [33] of her grounds of decision (“the GD”). In my\n                    view, it should be the other way round. As I have explained in[40]above, in the absence of loss or harm to\n                    third parties or dishonesty (which are both aggravating factors), a fine is\n                    typically the appropriate sentence. Accordingly, the court should instead\n                    establish whether there are circumstances to warrant the imposition of a\n                    custodial sentence.43     Consistent with the protective rationale of\n                    the prohibition, the law will take a serious view towards offenders who, as a\n                    result of the continued directorship or management of businesses, caused\n                    innocent third parties who deal with such businesses to suffer losses. A\n                    custodial sentence would be imposed in these situations to satisfy the\n                    requirements of specific and general deterrence. InLim Hua\n                        Tong, a fine of $5,000 was imposed for the conviction of one\n                    charge under s 148(1) of the Companies Act. The judge placed emphasis on\n                    the fact that no harm was caused to anyone (at [22]–[23]):...there was nothing here that called for the imposition of a sentence of\n                        imprisonment. There was no harm caused to any one apparently, as there was\n                        no mention of this in the [Statement of Facts]......The range of fines for such a first [time] offender, who does not cause\n                        harm is generally between $2,000 to $6,000 or so.44     A fine is generally inappropriate where the\n                    offender has obtained personal gains or was enriched as a result of committing\n                    the offences. In such situations, a fine will generally not be sufficient to\n                    serve as a deterrent as it may only disgorge some of the profits (given that the\n                    maximum fine is only $10,000).45     It has been accepted that the offender’srecklessorflagrantdisregard of the prohibition under s 148(1) of the\n                    Companies Act, or s 26(1) of the Business Registration Act is an\n                    aggravating factor: seeOng Kwang Engat [15],Yeong Chuan WorandSundranpillai Theivendran. However, the DJ in the court below\n                    took a questionable position on what constitutes “reckless” or\n                    “flagrant” disregard. She decided that one of the reasons which\n                    warranted a custodial sentence was because the appellant had been informed by\n                    the OA that she was prohibited from managing a business, and by doing so despite\n                    having been informed, the appellant had “blatantly flouted” the\n                    disqualification (see [31]):...this was not a case where the accused was ignorant of the fact that she\n                        could not manage a business or company.She was briefed,\n                            like any other undischarged bankrupts, by the Official\n                        Assignee that she should not concern herself in the management of a business\n                        or company...In this case, it was plain that the accused hadblatantly floutedthe disqualification.[emphasis in bold and in italics added]46     In support of the DJ’s observations\n                    above, the Prosecution argued the following (at [35] of the DPP’s\n                    submissions):While it is true that the [a]ppellant managed NSS and NCPL before she was\n                        made a bankrupt[,] thatipso factois not a\n                        distinguishing factor from the case precedents as the fact remains that she\n                        continued to run NSS and NCPL after she was made a bankrupt and thereafter\n                        managed Kaseve Lite N Comm and Kaseve Lighting Pte Ltd inflagrant disregardof the law that prohibited her from doing\n                        so...[emphasis added].47     In the same vein, the court inNg Chuan Sengat [10]–[12] observed that:10    This was not a casewhere the\n                                accused was ignorant of the fact that he could not manage a\n                                business. He had been briefed just like any other bankrupt that he\n                                should not concern himself in the management of a\n                                business. However, he sought to justify his acts by\n                            claiming that it was a family business and he had his wife’s\n                            sanction......12    ...it is plain that the accused has quite blatantly\n                            defied the disqualification order on him...His deliberate disregard of\n                            the law continued for a considerable period of time[emphasis added].48     In so far as the above views stand for the\n                    proposition that an offender who committed the offence despite having been\n                    briefed by the OA of the prohibition against management (or directorship) should\n                    be punished with a custodial sentence, as they have “blatantly”\n                    disregarded the prohibition, I would disagree. As observed by the DJ herself,\n                    the offender,like any other undischarged\n                        bankrupts, was briefed by the OA of the prohibitions. This means\n                    that apart from the rare case where the undischarged bankrupt wasnot briefedby the OA (perhaps due to its hypothetical\n                    rare lapse, if any or at all), all offenders wouldinexorablybe punished with a custodial sentence. This would\n                    render the discretion to impose a fine superfluous.49     Furthermore, the fact that a person has\n                    breached the prohibition simply gives rise to the offence itself. As a matter of\n                    jurisprudential logic, it is a self-evident sentencing principle that the very\n                    fact which creates the offence cannotin and of\n                        itselfbe an aggravating factor. This is different from taking\n                    into account themannerin which the offence was\n                    committed which, in appropriate circumstances, can amount to an aggravating\n                    factor. However, thevery actof committing an\n                    offence cannot at the same time be an aggravating factor. Otherwise, the\n                    sentencing court would be inclined to impose aheavysentence forallinstances\n                    when such an offence iscommitted. If left\n                    unchecked, this would lead to an inadvertent and illegitimate judicial\n                    legislating of a “minimum sentence” over and above the statutorily\n                    prescribed minimum sentence. As such, I emphasise that whether a custodial\n                    sentence is appropriate in situations where the offender has been briefed by the\n                    OA depends on all the relevant facts and circumstances.50     The circumstances that give rise to flagrant\n                    or reckless disregard of the prohibition can vary across a broad spectrum of\n                    factual matrix. An example is when the offender commits multiple bankruptcy\n                    offences that complements his illegal management of the business, such as the\n                    case inHeng Boon Tong, where the offender was\n                    sentenced to one month’s imprisonment for managing a business without\n                    leave under s 26(1) of the Business Registration Act, along with three\n                    months imprisonment for obtaining credit exceeding $500 without the disclosure\n                    of his bankruptcy status, under s 141(1)(a)\n                    of the Bankruptcy Act. Another example of flagrant disregard is the case ofYeong Chuan Wor, where the offenderincorporatedand managed three companiesafterthe accused was already made a bankrupt. The\n                    offender had also deliberately used his siblings to be the formal directors on\n                    record for the companies in order to evade the prohibition.51     Other aggravating factors include situations\n                    when third parties are cheated or defrauded by the offender (although this may\n                    be diluted if there is a conviction and sentence for a separate cheating\n                    charge); where the offender had committed the offences whilst under an existing\n                    disqualification order under s 154(1) of the Companies Act (such as in the\n                    case ofOng Kwang Eng); and where the offender has\n                    antecedents of similar bankruptcy offences of sufficient gravity. In these\n                    situations, a custodial sentence would usually be appropriate as such offenders\n                    show a manifest disregard for the bankruptcy regime, which if left unchecked,\n                    has the potential to cause substantial harm to the interests of creditors and\n                    the greater public.52     Before I consider the facts of the present\n                    case, it is perhaps appropriate for me to comment on the observation made by\n                    Yong CJ inChoong Kian Haw. Although it was not a\n                    decision on either s 148(1) of the Companies Act or s 26(1) of the\n                    Business Registration Act, the following remark inChoong\n                        Kian Haw(at [24]) appeared to have “inspired” the court to impose custodial sentences in two\n                    earlier decisions inHeng Boon TongandNg Chuan Seng:The magistrate misread my decision inPP v. Ong Ker\n                            Seng[[2001] 3 SLR(R) 134]. In that case, I did not\n                        contradict the trite principles that fines may be imposed in appropriate\n                        circumstances. However, I stated my view that fines were, in general, not a\n                        suitable means of punishment since bankrupts would typically lack the means\n                        to pay for the fines themselves. If they had the funds to pay the fines,\n                        these monies should clearly be channelled instead to the unpaid creditors.\n                        If they lacked the funds and a third party paid for them, the punitive\n                        effect of the punishments is diminished.These concerns\n                            apply with equal force to the sentencing of bankrupts in\n                            general. They are not limited to offences committed under\n                            s 141(1)(a) [the offence of obtaining\n                        credit without disclosure of bankruptcy status under the Bankruptcy\n                        Act].[emphasis added]53     This comment is, with respect, mereobiter dicta. Indeed, there was no charge under\n                        s 141(1)(a) inChoong\n                        Kian Hawin the first place. The question in that case was\n                    whether the imposition of fines for three charges of leaving Singapore without\n                    the OA’s permission (under s 131(1)(b)\n                    of the Bankruptcy Act) was manifestly inadequate. Given the egregious disregard\n                    of the law as the offender had committed the offence 44 times over a period of\n                    15 months, it was plainly clear that the sentences imposed inChoong Kian Hawwere indeed manifestly inadequate. It should\n                    also be noted that the above comment was made to clarify an earlier decision\n                        (PP v Ong Ker Seng[2001]\n                    3 SLR(R) 134). Indeed, the comment has since been analysed and\n                    clarified by Lee J inGanesh s/o M Sinnathamby v Public\n                        Prosecutor[2008] 1 SLR(R) 495:23    The force of the\n                            argument, that the imposition of a fine would not be adequate punishment\n                            in the case of an undischarged bankrupt, is compelling. However it is\n                            not clear how a bankrupt would be able to get his hands on money to pay\n                            the fine except in cases where it is paid by family members or friends.\n                            Therefore, except where a third party is prepared to pay the fine, an\n                            undischarged bankrupt would invariably serve the imprisonment imposed in\n                            default of payment of the fine. Subsequent toChoong\n                                Kian Haw, the lower courts have tended to impose\n                            custodial sentences for such cases. Indeed, this sentencing trend was so\n                            prevalent that it was raised in Parliament on 2 March 2007 (seeSingapore Parliamentary Debates, Official\n                                Report(2 March 2007) vol 82 at cols 2348-2349) by\n                            Mr Inderjit Singh, whose comments were as follows:Sir, one particular example of how harsh the regime here is the case\n                            of bankrupts who leave Singapore ... Many of these persons get hauled up\n                            before the courts and face criminal sanction under the Bankruptcy Act,\n                            section 131, where the Act punishes them with either a $10,000 fine or a\n                            jail term of two years. But unfortunately, we had a precedent set by the\n                            former Chief Justice where, under the case of Public Prosecutorvs[Chung Kian How], he decided that\n                            punishment for this offence should be a jail term. And subsequently, the\n                            Subordinate Courts are bound by this precedent. I am not a lawyer, but I\n                            think they are bound by this precedent set by the High Court.I think the courts should not be playing the role of Parliament and I\n                            hope that the Minister can explain this. I suggest that the Minister\n                            look at Chapters 7 and 13 and also the harshness of this rule to be\n                            reduced.24    Notably, the\n                            response by the Senior Minister of State for Law, Assoc Prof Ho Peng Kee\n                            was couched in the following terms (vol 82 at col 2365):[W]hy are they jailed? This is a court decision, but let me just say\n                            that they are not all jailed because, in fact, the Act allows for a\n                            person to be either jailed or fined. So I would say that we should leave\n                            it to the court to look at the facts and circumstances of the case\n                            because every case is unique - whether he has travelled before, how long\n                            he stays away, whether he is a cooperative bankrupt, whether he has\n                            other offences hanging over his head. That is why I think we should\n                            leave it to the court. My assurance to Mr Singh is that there are cases\n                            where the bankrupt is only fined and not jailed. So it is not mandatory\n                            jail.25    Unfortunately, the foregoing exchange underscores a\n                            misconception that the case ofChoong Kian\n                                Hawhas unfairly imposed a sentencing \"precedent\" that\n                            compels the imposition of a custodial sentence on bankrupts who\n                            contravene travel restrictions under the Act ([1]supra). This is clearly not the case.26    To begin with, it should be highlighted that Yong\n                            CJ prefaced his guidelines by stating in no uncertain terms that he \"did\n                            not contradict the trite principles that fines may be imposed in\n                            appropriate circumstances\" (above at [22]). On appeal, the Prosecution\n                            tendered a list of cases in which fines were in fact imposed in cases\n                            where the accused had taken a small number of trips out of the\n                            jurisdiction. While the number of trips may be an important factor to be\n                            considered in determining the appropriate sentence (in so far as it\n                            reflects the degree of recalcitrance), it is undoubtedly not the sole\n                            factor.27    On this note, I feel compelled to reiterate that\n                            whilst past cases serve as focal guidelines for the sentencing court,\n                            these \"tariffs\" should be applied with due appreciation of the unique\n                            facts and circumstances of each individual case (Soong Hee Sin v PP[2001]\n                            1 SLR(R) 475  ). It remains the duty of the court to\n                            remain apprised of all relevant factors and to seize the \"judicial\n                            prerogative to tailor criminal sanctions to the individual offender\"\n                                (Abu Syeed Chowdhury v PP[2002]\n                            1 SLR(R) 182 at [15]).54     I cannot agree more with the above\n                    observations. It would require significantly more than meredictato create a fetter on a court’s sentencing\n                    discretion. To expect any less would be to tread perilously close to an\n                    abdication of the responsibility of the sentencing judge in applying his mind\n                    and the law to the facts of each case.The\n                        Court’s decision55     Turning to the facts of the present case, it\n                    is pertinent to first highlight that the Prosecution conceded that no one\n                    suffered any lossarisingfrom the\n                    appellant’s offences. The appellant’s debt of $105,000 (as loaned\n                    from Koh) was incurredbeforeshe was adjudged a\n                    bankrupt. The sum of $85,088.40 contributed by Koh to finance the purchase of\n                    the AVI equipment for onward sale to Fujitec was also incurredbeforethe appellant was adjudged a bankrupt, and was\n                    therefore irrelevant to the charges. At the time when the offences were\n                    committed, not only did no one suffer any loss, Koh and NSS in fact received\n                    some repayments in reduction of the debts owed by the appellant. Koh received\n                    the sum of around $21,000 from Fujitec between January and April 2002, and\n                    a sum of $350 from the appellant in March 2002, and NSS received the sum of\n                    $18,454 from Fujitec on 25 April 2002.56     The Prosecution argued before me that the\n                    appellant had dishonestly used Koh’s monies, through the entities of\n                    Kaseve and NSS, to finance the purchase of AVI equipment to supply to Fujitec,\n                    and that when Fujitec made payment for the equipment, the monies were\n                    dishonestly received by the appellant and NCPL. This submission was apparently\n                    accepted by the DJ as can be observed from her GD (at [29]):As seen in paragraph 12 herein, Fujitec’s payments were madeafterthe accused became a bankrupt and\n                        she utilised the money for other purposes unrelated to Koh, NSS or Kaseve\n                        International...Evidently, the accused was not honest in her dealings with\n                        Koh...in view of the excuses she gave Koh...and that she utilized the money\n                        for other purposes, I did not believe the mitigation that it was\n                        miscommunication and/or inadvertence that Fujitec paid into the incorrect\n                        account.[emphasis in original]57     There is no factual basis to support either\n                    the Prosecution’s submission or the finding by the DJ. To begin with, the\n                    reference by the DJ to [12] of her GD to support her finding is clearly\n                    erroneous since [12] merely referred to payments received from Fujitec after NSS\n                    was formed and not after the appellant’s bankruptcy. Fujitec’s\n                    payment of $10,381.37 into NCPL’s bank account on 25 July 2001 was\n                    irrelevant to the appellant’s charges as it took placebeforeshe was adjudged a bankrupt. Although Fujitec credited\n                    the sums of $21,349.84 and $5,814.35 into NCPL’s bank account on\n                    21 December 2001 and 25 January 2002 respectively, shortlyaftershe was adjudged a bankrupt, there was nothing in\n                    the statement of facts (“SOF”) to indicate that these payments\n                    were credited for deliveries of AVI equipment made by NSS, Kaseve, or Kohafterher bankruptcy. Given that the payment\n                    on 21 December 2001 took place a month after the appellant was adjudged a\n                    bankrupt and that NCPL had existing dealings with Fujitec, it cannot be assumed\n                    that the payments received by NCPL were not in respect of transactions with\n                    Fujitec concluded prior to her bankruptcy. Even if the payments were indeed made\n                    for NSS’ deliveries to Fujitec, and NSS was the proper entity to receive\n                    the payment, the payment was clearly in respect of the two purchase orders dated\n                    19 April 2001 and 10 July 2001[note: 2]which were transacted some\n                    time prior to the appellant’s bankruptcy. Further, it was also admitted in\n                    the SOF that the goods which were delivered pursuant to these two purchase\n                    orders were in turn purchased by Kaseve in March 2001[note: 3].\n                    In my view, there was no question of any manipulation. The appellant was simply\n                    seeking to fulfil NCPL’s existing obligations to Fujitec through NSS and\n                    Kaseve. In any event, even if there was manipulation, it took placebeforeshe was adjudged a bankrupt on 23 November 2001\n                    and was therefore equally irrelevant to the charges. For completeness, I\n                    observed that a cheating charge initially preferred against the appellant (DAC\n                    10990 of 2009) for the payments into NCPL’s account was subsequently\n                    withdrawn and the appellant was granted a discharge amounting to an acquittal in\n                    relation to that charge[note: 4]. In these\n                    circumstances, there cannot be any basis to find that the appellant had, while\n                    committing the offences of managing the business of NSS,dishonestlymade use of Koh, Kaseve and NSS to finance the\n                    supply of the AVI equipment to Fujitec in order to enrich NCPL or\n                    herself.58     The DJ also found that the appellant had\n                    “deliberately influenced” Koh into registering the sole\n                    proprietorships of Kaseve and NSS to enable her to manage them (at [31]):[the appellant’s] involvement was not in passing. She had\n                        deliberately influenced Koh into registering sole proprietorships which she\n                        then managed.The suggestion from this finding is that the appellant had asked Koh\n                    to register Kaseve and NSS in Koh’s namebecausethe appellant knew that she was prohibited from managing\n                    these sole-proprietorships. However, it is incontrovertible that both Kaseve and\n                    NSS were formedbeforethe appellant was adjudged\n                    a bankrupt. The present case is therefore unlike the situation inYeong Chuan Wor, where the offender had requested his\n                    siblings to be the directors on record for three companies in order to conceal\n                    his involvement in running the operations of the companies. Further, inYeong Chuan Wor, the companies were\n                    incorporatedafterthe offender’s\n                    bankruptcy. Finally, the appellant had admitted (and the Prosecution does not\n                    dispute this) that the reason why she requested Koh to register Kaseve and NSS\n                    wasbecauseof NCPL’s financial difficulties\n                    in performing its existing contracts with Fujitec (at [36] of SOF):...NCPL had pre-existing contracts with Fujitec for the supply of\n                        intercommunication equipment. However, NCPL was not in a financial position\n                        to fulfil its contractual obligations and NCPL risked a potential lawsuit\n                        from Fujitec. To avert the situation, the accused admitted to Koh that she\n                        had asked him to register KI and subsequently NSS...59     Further, the DJ also attached considerable\n                    weight to her finding that the offences were committed over a prolonged period\n                    of time and consequently decided not to attach weight to the fact that the\n                    appellant was a first time offender, (at [31]–[32] of her GD):[The appellant’s] deliberate disregard of the law continued for a\n                        considerable period of more than 4 years...I further felt that because the offences were committed over a few years,\n                        there was little reason to make a concession to the plea that she had no\n                        previous conviction60     With respect, this finding is flawed. Although\n                    the appellant had remained as a director on record of NCPL for a period of\n                    almost four years between 18 December 2001 and 4 July 2005, and hence\n                    committed the offence under s 148(1) for that period of time, it cannot be\n                    said that her “deliberate disregard of the\n                        law” continued throughout a period of more than four\n                    years. The appellant’s last act of management in relation to NCPL was the\n                    withdrawal of a sum of $6,266.52 on 26 January 2002[note: 5].\n                    This took place slightly over a month after she was notified of the prohibitions\n                    by the OA on 18 December 2001. With regard to the management of NSS, it was\n                    clearly stated in the SOF (at [31]) that:...after the accused was notified of her duties and responsibilities as an\n                        undischarged bankrupt on 18 December 2001, the accused continued to\n                        operate the business of NSS until the last Purchase Order of Fujitec dated\n                        10 April 2002.61     It is therefore clear that the\n                    appellant’s last act of management of NSS took place just slightly less\n                    than four months after she was briefed by the OA. Furthermore, there are no\n                    facts to suggest that the late discovery of the appellant’s continued\n                    directorship of NCPL over a period of almost four years was due to the her\n                    attempt to evade detection from the authorities.62     The appellant stated in mitigation that due to\n                    a variety of personal problems, she was in a fragile state of mind at the time\n                    when the OA briefed her on the duties and responsibilities of an undischarged\n                    bankrupt and the relevant prohibitions on 18 December 2001. I agree with\n                    the DJ that her alleged “fragile state of mind” did not constitute\n                    valid mitigation in the circumstances. Nonetheless, I add the general\n                    observation that persons adjudged as bankrupt may not fully appreciate the\n                    duties and responsibilities of an undischarged bankrupt, and may not\n                    sufficiently digest the lengthy list of prohibitions stated in the various\n                    information sheets provided by the OA. This merely reinforces my point that\n                    there should be a system in place for the OA’s office to effectively\n                    liaise with Accounting and Corporate Regulatory Authority (“ACRA”)\n                    to ensure the timely cessation of directorships held by an undischarged bankrupt\n                    immediately or shortly after being pronounced bankrupt. I pause to note that\n                    under s 173(6A) of the Companies Act, there is strictly no obligation for\n                    the bankrupt person to file the cessation notification since such a person\n                        “may” lodge the notification\n                    without specifying the time within which it had to be filed. This is to be\n                    contrasted with s 173(6) of the Companies Act that expressly stipulates\n                    that the company “shall” lodge the\n                    notification within one month after the director ceases to be or is disqualified\n                    to act as a director.Conclusion63     The above analysis of the facts relevant to\n                    the present charges revealed that there are no aggravating factors to warrant\n                    the imposition of a custodial sentence. In particular, I attached significance\n                    to the fact that no one suffered any loss from the appellant’s offences\n                    and that there was no dishonest element either. Further, although the offence of\n                    acting as a director of NCPL was committed over almost four years, in truth, her\n                    acts of management were limited only to perform the purchase orders that were\n                    placed by Fujitec over a relatively short period of time following her briefing\n                    by the OA. I have taken into consideration the fact that there are six TIC\n                    charges, and that the appellant has no antecedents. For the reasons set out\n                    above, I allow the appeal and reduce the sentences to:(a)DAC 10992 of 2009 – fine of $7,000 (in\n                            default 4 weeks’ imprisonment)(b)DAC 10995 of 2009 – fine of $7,000 (in\n                            default 4 weeks’ imprisonment)The sentence imposed by the court below for DAC 10999 of 2009 which is\n                    not the subject of the appeal before me stands as it is.Post Script64     During the hearing of the appeal, I remarked\n                    that it was odd for the appellant to have remained on record as a director of\n                    NCPL for such a long time despite being made a bankrupt. I directed the\n                    Prosecution to file additional submissions to explain the working protocol\n                    between ACRA and the OA as regards removal of persons as directors who have been\n                    adjudged bankrupt. From the further submissions, the following picture has\n                    emerged:(a)     Prior to January 2001, the\n                        Registry of Companies and Businesses (“RCB”) (now known as\n                        ACRA) relied on the company to provide notification under s 173(6) of\n                        the Companies Act whenever a person was disqualified from acting as\n                        director.(b)     In January 2001, s 173 of the Companies Act was amended with the\n                        insertion of a new subsection 6A to enable the disqualified person to\n                        directly report the cessation if he has reasonable cause to believe that the\n                        company may not notify the RCB.(c)     Currently, IPTO would provide a list of persons against\n                        whom bankruptcy orders have been made to ACRA on a weekly\n                    basis.(d)     Checks on\n                        the status of a bankrupt are conducted at “critical” junctures in the course of bankruptcy\n                        administration such as when a complaint is received against a bankrupt or\n                        when the bankrupt is being reviewed for suitability for discharge. Where\n                        such checks or searches reveal that the bankrupt has remained a director,\n                        IPTO will then send a letter to the bankrupt to remind him or her that it is\n                        an offence to act as a director and that steps should be taken to file\n                        cessation notification within a stipulated time.(e)     IPTO would refer breaches of\n                        s 148 of the Companies Act to the Commercial Affairs Department\n                        (“CAD”) for investigation and\n                prosecution.65     It is apparent from the description of the\n                    existing protocol that the cessation of a person acting as a director is heavily\n                    dependent on the initiative of the company or the undischarged bankrupt. As a\n                    result, if steps are not taken by either the company or the director to file\n                    cessation notification, it is possible that the undischarged bankrupt may remain\n                    a director in the company for years following the bankruptcy adjudication.\n                    Indeed, this was precisely the case in the present appeal where the appellant\n                    remained a director of NCPL for almost four years following her bankruptcy.\n                    Although not raised by the Prosecution, I have noted that in addition to the new\n                    subsection 6A, subsection 6B was introduced at the same time to empower the\n                    Registrar of Companies, on his own initiative, to remove the name of any person\n                    from the registry whom he has reason to believe is no longer qualified to act as\n                    a director by virtue of s 148 or s 155 of the Companies\n                Act.66     From the additional submissions filed by the\n                    Prosecution, the unsatisfactory state of the existing arrangement presents a\n                    more compelling case for review. On 17 April 2003, the RCB issued a summons\n                    against the appellant for failing to lodge a change of address in respect of\n                    NLPL in 2002, an offence punishable under s 143(1) of the Companies Act. On\n                    19 February 2004, the RCB issued another summons against the appellant for\n                    failing to hold an Annual General Meeting and for failing to file annual returns\n                    in respect of NLPL and NCPL in 2002, offences punishable under s 175(4) and\n                    s 197(7) of the Companies Act. In the course of the appellant making\n                    representations for the charges to be withdrawn, ACRA found out that she was a\n                    bankrupt. On 25 July 2005, the charges against the appellant were formally\n                    withdrawn presumably because ACRA was satisfied that given her bankruptcy\n                    status, the appellant had in fact ceased to be actively involved in the\n                    management of NLPL and NCPL, as the charges were in respect of her failure, in\n                    her capacity as an officer of the companies, to hold an annual general meeting\n                    and her failure to file annual returns for NLPL and NCPL. Despite the fortuitous\n                    discovery of the appellant’s bankruptcy status, ACRA did not take any step\n                    to require the appellant to lodge the cessation notification though the\n                    Registrar of Companies is empowered to remove her as a director from the\n                    registry pursuant to s 173(6B) of the Companies Act. Instead, the discovery\n                    of her breaches came up under a different context during IPTO’s review of\n                    the appellant’s suitability for discharge from bankruptcy. Thereafter on\n                    24 June 2005, IPTO wrote to the appellant to advise her to take steps to\n                    resign as a director which she duly did on 4 July 2005. Notwithstanding her\n                    compliance with IPTO’s reminder to resign, the appellant was charged for\n                    acting as a director on 22 December 2009, almost five years later. There is\n                    no suggestion, from the facts provided by the Prosecution, that any letter was\n                    sent to the appellant to inform her to cease her directorship in NCPL, between\n                    the time when ACRA discovered her bankruptcy status to the time it was\n                    discovered by IPTO in June 2005. As I have explained in[32], the rationale for s 148 of the\n                    Companies Act is to safeguard the interest of the unsuspecting public from\n                    dealing with companies managed by directors who are undischarged bankrupts. The\n                    existing arrangement which depends on the initiative of the company and the\n                    undischarged bankrupt may not be adequate to achieve the intended objective of\n                    s 148 of the Companies Act. In my view, it is imperative for ACRA or IPTO\n                    to take proactive steps to ensure the immediate cessation of directorship(s) by\n                    such persons and not leave it to chance to discover the breaches at\n                        “critical” junctures in the\n                    bankruptcy administration.67     In my opinion, the following measures should\n                    beconsideredfor implementation:(a)     Currently, a list of persons\n                        adjudged to be bankrupt isalreadyprovided by\n                        IPTO to ACRA on a weekly basis. From this list, a check on the directorship\n                        status of persons adjudged bankrupt should be made by\n                    ACRA.(b)     The results\n                        of such searches should then be submitted to IPTO. I assume these steps\n                        could be completed in good time with the benefit of a computerised process\n                        and the use of identification numbers of persons adjudged to be a bankrupt.\n                        A letter should then be sent by IPTO to these persons to inform them of\n                        their obligation to file a notice of cessation in accordance with\n                        s 173(6A) of the Companies Act.(c)     If the notice of cessation is not filed within the\n                        requisite time, IPTO can consider taking appropriate steps, including\n                        sending a further reminder or inviting the Registrar of Companies to remove\n                        the person as a director from the registry or adopting the option of\n                        referring the matter to the CAD or any other relevant authority for\n                        consideration of further action.68     The rationale and importance of establishing a\n                    systemic process such as this is to prevent undischarged bankrupts from\n                    unwittingly committing the technical offence of remaining as a director on\n                    record of companies, even if these persons had played no role in the management\n                    of such companies. Equally, it would serve to ensure that public interest is\n                    protected to prevent third parties from dealing with companies in ignorance of\n                    the bankrupt status of its directors. The above measures are onlysuggestionsfor consideration as ultimately the\n                    feasibility of such a system is a matter for ACRA and IPTO to implement. Having\n                    said that, it is clear to me that it is not entirely satisfactory for the\n                    relevant authorities to find out that an offence has been committed only when\n                    the undischarged bankrupt is being reviewed for suitability for discharge. In\n                    this case, instead of beingdischargedfrom\n                    bankruptcy, to add to her woes, the appellant was insteadchargedand, worse still, faced with the possibility of a\n                    custodial sentence. This is indeed an unfortunate and ironic outcome given that\n                    “the underlying purpose of [these statutory provisions]... is to\n                    rationalise the law of insolvency and in general to enable those involved in\n                    business failureto get back on their feet as rapidly as may\n                        be consistent with fairness to their\n                        creditors”[note: 6].[note: 1]Statement of Facts at\n                [36].[note: 2]Statement of\n                                Facts at [15].[note: 3]Ibid.[note: 4]Appellant’s Skeletal Submissions\n                                dated 20 October 2010 at [16].[note: 5]See Statement of Facts at [26].[note: 6]Per\n                                Farquharson L. J. in the English Court of Appeal decision ofR v Sundranpillai Theivendran(1992) 13 Cr App R (S) 601 at p\n                            603.",
        "Underlying purpose of s 148 of the Companies Act": "32     Any review of the earlier Subordinate Court\n                    decisions would not be complete without examining themischiefwhich s 148 of the Companies Act is intended to\n                    safeguard against. As stated above (at[1]–[2]), the\n                    prohibition of an undischarged bankrupt from managing (or being a director of) a\n                    company or a business serves not only to protect creditors’ interests; it\n                    also serves to safeguard the greater public interest to prevent an undischarged\n                    bankrupt from misusing the corporate structure for collateral purposes to the\n                    detriment of innocent third parties. InNg Chuan\n                        Seng, the Court observed that s 26(1) of the Business\n                    Registration Act is “designed to protect the public”, while a\n                    similar observation was made inOng Kwang Engthat\n                    the purpose of the disqualification under s 148(1) of the Companies Act is\n                    to “protect corporate and commercial integrity”. 33     In England, an undischarged bankrupt would not\n                    be granted leave to be a director, or to manage a company if it iscontrary to the public interestto do so, as is evident\n                    from the express language of s 11of the UK Company Directors\n                    Disqualification Act 1986 (“CDDA”), which provides as\n                    follows: 11 Undischarged bankrupts(1)It is an offence for a person to act as director\n                            of, or directly or indirectly to take part in or be concerned in the\n                            promotion, formation or management of a company, without the leave of\n                            court, at a time when-(a)he is an undischarged bankrupt...(2)In England and Wales, the leave of the court\n                            shall not be given unless notice of intention to apply for it has been\n                            served on the official receiver; and it is the latter’s duty, if\n                            he is of opinion that it iscontrary to public\n                                interestthat the application should be granted, to\n                            attend on the hearing of the application and oppose it.[emphasis in bold added]34     The English Court of Appeal inR v Sundranpillai Theivendran(1992)\n                    13 Cr App R (S) 601 (“Sundranpillai Theivendran”), observed the protective\n                    rationale of s 11(1) of the CDDA (as well as s 360(1)(a) of the UK Insolvency Act 1986, being inpari materiawith s 148(1)(a) of our local Bankruptcy Act) (per Farquharson LJ at\n                    603):the underlying purpose of [these statutory provisions]... is to\n                        rationalise the law of insolvency and in general to enable those involved in\n                        business failureto get back on their feet as rapidly as\n                            may be consistent with fairness to their creditors.[emphasis added]35     The Australian Courts highlighted that the\n                    prohibition serves protective purposes and isnot a punitive\n                        rule. The Supreme Court of New South Wales inRe Altim Pty Ltd[1968] 2 NSWR 762 made the following\n                    observation in the context of s 117(1) of the Australian Companies Act 1961\n                    (inpari materiawith s 148(1) of our\n                    Companies Act) (per Street J in 764):...the section is not in any sense a punishment of the bankrupt. Nor\n                        should a refusal to grant leave under that section be regarded as punitive.The prohibition is entirely\n                        protective...[emphasis added]36     Bowen CJ similarly observed inRe Magna Alloys & Research Pty Ltd(1975)\n                    1 ACLR 203 at 205 that the rationale of the prohibition was not\n                    punitive, but protective:The section is not punitive. It is designed to protect the public and to\n                        prevent the corporate structure from being used to the financial detriment\n                        of investors, shareholders, creditors and persons dealing with a company. In\n                        its operation[,] it is calculated as a safeguard against the corporate\n                        structure being used by individuals in a manner which is contrary to proper\n                        commercial standards.37     The protective rationale is consistent with\n                    the policy behind the bankruptcy regime to achieve a balanced approach.\n                    Professor Ho Peng Kee observed in the Second Reading of the Bankruptcy\n                    (Amendment) Bill (Singapore Parliamentary Debates,\n                    19 January 2009, vol 85) that:Our bankruptcy regime seeks to give creditors their rights whilst, at the\n                        same time, give debtors an opportunity to make a fresh start\n                        in their financial matters.38     The non-punitive rationale behind the\n                    prohibition as observed in the English and Australian positions applies equally\n                    to s 148 of our Companies Act. This is apparent from the amendments made in\n                    1999 to facilitate the ability of undischarged bankrupts to resume directorship\n                    or management of businesses. As observed in the Reading of the Bankruptcy\n                    (Amendment) Bill (Singapore Parliamentary Debates,\n                    18 August 1999, vol 70, col 2184 to 2186, per Professor Ho Peng Kee):...it is important that a bankrupt remains economically productive even\n                        during bankruptcy. This will allow the bankrupt to settle his debts earlier\n                        and get out of bankruptcy more speedily. It will also allow the bankrupt to\n                        continue contributing economically to society during bankruptcy.Presently, a bankrupt cannot act as a company director or engage in the\n                        management of a company or business, except with leave of Court. However,\n                        very few bankrupts apply to court for permission to do business, deterred by\n                        the costs and trouble of having to apply to Court. The Official Assignee, as\n                        administrator of a bankruptcy estate, frequently deals with bankrupts and is\n                        more knowledgeable of their affairs. He will therefore be able to consider\n                        the merits of each case before he grants permission. Allowing the Official\n                        Assignee to grant such permission will also make the process cheaper,\n                        simpler and more accessible to the bankrupts.39     In light of the authorities above, it is clear\n                    to me that the prohibition on managing a company or business (or being a\n                    director of a company) found in s 148(1) of the Companies Act and\n                    s 26(1) of the Business Registration Act is premised on protective\n                    considerations. The prohibition in these provisions is not intended to be\n                    punitive in nature. Accordingly, to mete out the correct sentence, it is\n                    critical to bear this statutory objective in mind.Sentencing Guidelines40     Given the protective nature of the relevant\n                    provisions, the predominant consideration in sentencing offenders for breach of\n                    s 148(1) of the Companies Act and s 26(1) of the Business Registration\n                    Act is to evaluate the applicability of the deterrent principle with a view to\n                    protecting the interests of creditors and the public from harm caused by the\n                    bankrupt’s management of the business. As a starting point, if no harm was\n                    caused to anyone arising from the offence and there was no dishonest element in\n                    the commission of the offence, a fine would generally be\n                sufficient.41     In my view, a custodial sentence would\n                    typically be appropriate where one or more of the following aggravating\n                    circumstances are present,viz:(a)     The unlawful continuance of\n                        directorship and/or management of the company or business resulting in loss\n                        or harm suffered by innocent third parties who dealt with the company or\n                        business under the management of the undischarged bankrupt (see[43]below).(b)     The offence was committed with dishonest\n                        intention to cheat or defraud innocent third parties (see[51]below).(c)     The offender obtained personal gains or was\n                        enriched as a result of committing the offences (see[44]below).(d)     The flagrant or reckless disregard of the\n                        prohibition, such as the direct or indirect involvement in the incorporation\n                        of companiesafterthe offender has already\n                        been made a bankrupt in order to circumvent the prohibition (see[45]–[50]below).(e)     The offence was committed in breach of an existing\n                        disqualification order made under ss 149, 149A and154 of the Companies Act\n                        (see[51]below).(f)     The offence was committed over a\n                        prolonged period of time during which the offender was inactivemanagement.(g)     The offender has antecedents of the same offence or\n                        related bankruptcy offences under the Bankruptcy Act, Companies Act and/or\n                        the Business Registration Act (see[51]below).42     The above aggravating factors serve as a guide\n                    in the exercise of sentencing discretion. They are not intended to be\n                    exhaustive. Each case must necessarily be decided on its own facts. Although the\n                    lack of any of these aggravating factorsmay not\n                        necessarilypreclude the imposition of a custodial sentence, a\n                    sentencing judge ought to give due consideration and justification whenever a\n                    custodial sentence is imposed in theabsenceof\n                    recognised aggravating factors. I will elaborate on the aggravating factors. In\n                    the meantime, I should add that it is certainly incorrect to approach the\n                    question by examining whether there are exceptional circumstances to warrant the\n                    imposition of anon-custodialsentence as observed\n                    by the DJ at [33] of her grounds of decision (“the GD”). In my\n                    view, it should be the other way round. As I have explained in[40]above, in the absence of loss or harm to\n                    third parties or dishonesty (which are both aggravating factors), a fine is\n                    typically the appropriate sentence. Accordingly, the court should instead\n                    establish whether there are circumstances to warrant the imposition of a\n                    custodial sentence.43     Consistent with the protective rationale of\n                    the prohibition, the law will take a serious view towards offenders who, as a\n                    result of the continued directorship or management of businesses, caused\n                    innocent third parties who deal with such businesses to suffer losses. A\n                    custodial sentence would be imposed in these situations to satisfy the\n                    requirements of specific and general deterrence. InLim Hua\n                        Tong, a fine of $5,000 was imposed for the conviction of one\n                    charge under s 148(1) of the Companies Act. The judge placed emphasis on\n                    the fact that no harm was caused to anyone (at [22]–[23]):...there was nothing here that called for the imposition of a sentence of\n                        imprisonment. There was no harm caused to any one apparently, as there was\n                        no mention of this in the [Statement of Facts]......The range of fines for such a first [time] offender, who does not cause\n                        harm is generally between $2,000 to $6,000 or so.44     A fine is generally inappropriate where the\n                    offender has obtained personal gains or was enriched as a result of committing\n                    the offences. In such situations, a fine will generally not be sufficient to\n                    serve as a deterrent as it may only disgorge some of the profits (given that the\n                    maximum fine is only $10,000).45     It has been accepted that the offender’srecklessorflagrantdisregard of the prohibition under s 148(1) of the\n                    Companies Act, or s 26(1) of the Business Registration Act is an\n                    aggravating factor: seeOng Kwang Engat [15],Yeong Chuan WorandSundranpillai Theivendran. However, the DJ in the court below\n                    took a questionable position on what constitutes “reckless” or\n                    “flagrant” disregard. She decided that one of the reasons which\n                    warranted a custodial sentence was because the appellant had been informed by\n                    the OA that she was prohibited from managing a business, and by doing so despite\n                    having been informed, the appellant had “blatantly flouted” the\n                    disqualification (see [31]):...this was not a case where the accused was ignorant of the fact that she\n                        could not manage a business or company.She was briefed,\n                            like any other undischarged bankrupts, by the Official\n                        Assignee that she should not concern herself in the management of a business\n                        or company...In this case, it was plain that the accused hadblatantly floutedthe disqualification.[emphasis in bold and in italics added]46     In support of the DJ’s observations\n                    above, the Prosecution argued the following (at [35] of the DPP’s\n                    submissions):While it is true that the [a]ppellant managed NSS and NCPL before she was\n                        made a bankrupt[,] thatipso factois not a\n                        distinguishing factor from the case precedents as the fact remains that she\n                        continued to run NSS and NCPL after she was made a bankrupt and thereafter\n                        managed Kaseve Lite N Comm and Kaseve Lighting Pte Ltd inflagrant disregardof the law that prohibited her from doing\n                        so...[emphasis added].47     In the same vein, the court inNg Chuan Sengat [10]–[12] observed that:10    This was not a casewhere the\n                                accused was ignorant of the fact that he could not manage a\n                                business. He had been briefed just like any other bankrupt that he\n                                should not concern himself in the management of a\n                                business. However, he sought to justify his acts by\n                            claiming that it was a family business and he had his wife’s\n                            sanction......12    ...it is plain that the accused has quite blatantly\n                            defied the disqualification order on him...His deliberate disregard of\n                            the law continued for a considerable period of time[emphasis added].48     In so far as the above views stand for the\n                    proposition that an offender who committed the offence despite having been\n                    briefed by the OA of the prohibition against management (or directorship) should\n                    be punished with a custodial sentence, as they have “blatantly”\n                    disregarded the prohibition, I would disagree. As observed by the DJ herself,\n                    the offender,like any other undischarged\n                        bankrupts, was briefed by the OA of the prohibitions. This means\n                    that apart from the rare case where the undischarged bankrupt wasnot briefedby the OA (perhaps due to its hypothetical\n                    rare lapse, if any or at all), all offenders wouldinexorablybe punished with a custodial sentence. This would\n                    render the discretion to impose a fine superfluous.49     Furthermore, the fact that a person has\n                    breached the prohibition simply gives rise to the offence itself. As a matter of\n                    jurisprudential logic, it is a self-evident sentencing principle that the very\n                    fact which creates the offence cannotin and of\n                        itselfbe an aggravating factor. This is different from taking\n                    into account themannerin which the offence was\n                    committed which, in appropriate circumstances, can amount to an aggravating\n                    factor. However, thevery actof committing an\n                    offence cannot at the same time be an aggravating factor. Otherwise, the\n                    sentencing court would be inclined to impose aheavysentence forallinstances\n                    when such an offence iscommitted. If left\n                    unchecked, this would lead to an inadvertent and illegitimate judicial\n                    legislating of a “minimum sentence” over and above the statutorily\n                    prescribed minimum sentence. As such, I emphasise that whether a custodial\n                    sentence is appropriate in situations where the offender has been briefed by the\n                    OA depends on all the relevant facts and circumstances.50     The circumstances that give rise to flagrant\n                    or reckless disregard of the prohibition can vary across a broad spectrum of\n                    factual matrix. An example is when the offender commits multiple bankruptcy\n                    offences that complements his illegal management of the business, such as the\n                    case inHeng Boon Tong, where the offender was\n                    sentenced to one month’s imprisonment for managing a business without\n                    leave under s 26(1) of the Business Registration Act, along with three\n                    months imprisonment for obtaining credit exceeding $500 without the disclosure\n                    of his bankruptcy status, under s 141(1)(a)\n                    of the Bankruptcy Act. Another example of flagrant disregard is the case ofYeong Chuan Wor, where the offenderincorporatedand managed three companiesafterthe accused was already made a bankrupt. The\n                    offender had also deliberately used his siblings to be the formal directors on\n                    record for the companies in order to evade the prohibition.51     Other aggravating factors include situations\n                    when third parties are cheated or defrauded by the offender (although this may\n                    be diluted if there is a conviction and sentence for a separate cheating\n                    charge); where the offender had committed the offences whilst under an existing\n                    disqualification order under s 154(1) of the Companies Act (such as in the\n                    case ofOng Kwang Eng); and where the offender has\n                    antecedents of similar bankruptcy offences of sufficient gravity. In these\n                    situations, a custodial sentence would usually be appropriate as such offenders\n                    show a manifest disregard for the bankruptcy regime, which if left unchecked,\n                    has the potential to cause substantial harm to the interests of creditors and\n                    the greater public.52     Before I consider the facts of the present\n                    case, it is perhaps appropriate for me to comment on the observation made by\n                    Yong CJ inChoong Kian Haw. Although it was not a\n                    decision on either s 148(1) of the Companies Act or s 26(1) of the\n                    Business Registration Act, the following remark inChoong\n                        Kian Haw(at [24]) appeared to have “inspired” the court to impose custodial sentences in two\n                    earlier decisions inHeng Boon TongandNg Chuan Seng:The magistrate misread my decision inPP v. Ong Ker\n                            Seng[[2001] 3 SLR(R) 134]. In that case, I did not\n                        contradict the trite principles that fines may be imposed in appropriate\n                        circumstances. However, I stated my view that fines were, in general, not a\n                        suitable means of punishment since bankrupts would typically lack the means\n                        to pay for the fines themselves. If they had the funds to pay the fines,\n                        these monies should clearly be channelled instead to the unpaid creditors.\n                        If they lacked the funds and a third party paid for them, the punitive\n                        effect of the punishments is diminished.These concerns\n                            apply with equal force to the sentencing of bankrupts in\n                            general. They are not limited to offences committed under\n                            s 141(1)(a) [the offence of obtaining\n                        credit without disclosure of bankruptcy status under the Bankruptcy\n                        Act].[emphasis added]53     This comment is, with respect, mereobiter dicta. Indeed, there was no charge under\n                        s 141(1)(a) inChoong\n                        Kian Hawin the first place. The question in that case was\n                    whether the imposition of fines for three charges of leaving Singapore without\n                    the OA’s permission (under s 131(1)(b)\n                    of the Bankruptcy Act) was manifestly inadequate. Given the egregious disregard\n                    of the law as the offender had committed the offence 44 times over a period of\n                    15 months, it was plainly clear that the sentences imposed inChoong Kian Hawwere indeed manifestly inadequate. It should\n                    also be noted that the above comment was made to clarify an earlier decision\n                        (PP v Ong Ker Seng[2001]\n                    3 SLR(R) 134). Indeed, the comment has since been analysed and\n                    clarified by Lee J inGanesh s/o M Sinnathamby v Public\n                        Prosecutor[2008] 1 SLR(R) 495:23    The force of the\n                            argument, that the imposition of a fine would not be adequate punishment\n                            in the case of an undischarged bankrupt, is compelling. However it is\n                            not clear how a bankrupt would be able to get his hands on money to pay\n                            the fine except in cases where it is paid by family members or friends.\n                            Therefore, except where a third party is prepared to pay the fine, an\n                            undischarged bankrupt would invariably serve the imprisonment imposed in\n                            default of payment of the fine. Subsequent toChoong\n                                Kian Haw, the lower courts have tended to impose\n                            custodial sentences for such cases. Indeed, this sentencing trend was so\n                            prevalent that it was raised in Parliament on 2 March 2007 (seeSingapore Parliamentary Debates, Official\n                                Report(2 March 2007) vol 82 at cols 2348-2349) by\n                            Mr Inderjit Singh, whose comments were as follows:Sir, one particular example of how harsh the regime here is the case\n                            of bankrupts who leave Singapore ... Many of these persons get hauled up\n                            before the courts and face criminal sanction under the Bankruptcy Act,\n                            section 131, where the Act punishes them with either a $10,000 fine or a\n                            jail term of two years. But unfortunately, we had a precedent set by the\n                            former Chief Justice where, under the case of Public Prosecutorvs[Chung Kian How], he decided that\n                            punishment for this offence should be a jail term. And subsequently, the\n                            Subordinate Courts are bound by this precedent. I am not a lawyer, but I\n                            think they are bound by this precedent set by the High Court.I think the courts should not be playing the role of Parliament and I\n                            hope that the Minister can explain this. I suggest that the Minister\n                            look at Chapters 7 and 13 and also the harshness of this rule to be\n                            reduced.24    Notably, the\n                            response by the Senior Minister of State for Law, Assoc Prof Ho Peng Kee\n                            was couched in the following terms (vol 82 at col 2365):[W]hy are they jailed? This is a court decision, but let me just say\n                            that they are not all jailed because, in fact, the Act allows for a\n                            person to be either jailed or fined. So I would say that we should leave\n                            it to the court to look at the facts and circumstances of the case\n                            because every case is unique - whether he has travelled before, how long\n                            he stays away, whether he is a cooperative bankrupt, whether he has\n                            other offences hanging over his head. That is why I think we should\n                            leave it to the court. My assurance to Mr Singh is that there are cases\n                            where the bankrupt is only fined and not jailed. So it is not mandatory\n                            jail.25    Unfortunately, the foregoing exchange underscores a\n                            misconception that the case ofChoong Kian\n                                Hawhas unfairly imposed a sentencing \"precedent\" that\n                            compels the imposition of a custodial sentence on bankrupts who\n                            contravene travel restrictions under the Act ([1]supra). This is clearly not the case.26    To begin with, it should be highlighted that Yong\n                            CJ prefaced his guidelines by stating in no uncertain terms that he \"did\n                            not contradict the trite principles that fines may be imposed in\n                            appropriate circumstances\" (above at [22]). On appeal, the Prosecution\n                            tendered a list of cases in which fines were in fact imposed in cases\n                            where the accused had taken a small number of trips out of the\n                            jurisdiction. While the number of trips may be an important factor to be\n                            considered in determining the appropriate sentence (in so far as it\n                            reflects the degree of recalcitrance), it is undoubtedly not the sole\n                            factor.27    On this note, I feel compelled to reiterate that\n                            whilst past cases serve as focal guidelines for the sentencing court,\n                            these \"tariffs\" should be applied with due appreciation of the unique\n                            facts and circumstances of each individual case (Soong Hee Sin v PP[2001]\n                            1 SLR(R) 475  ). It remains the duty of the court to\n                            remain apprised of all relevant factors and to seize the \"judicial\n                            prerogative to tailor criminal sanctions to the individual offender\"\n                                (Abu Syeed Chowdhury v PP[2002]\n                            1 SLR(R) 182 at [15]).54     I cannot agree more with the above\n                    observations. It would require significantly more than meredictato create a fetter on a court’s sentencing\n                    discretion. To expect any less would be to tread perilously close to an\n                    abdication of the responsibility of the sentencing judge in applying his mind\n                    and the law to the facts of each case.The\n                        Court’s decision55     Turning to the facts of the present case, it\n                    is pertinent to first highlight that the Prosecution conceded that no one\n                    suffered any lossarisingfrom the\n                    appellant’s offences. The appellant’s debt of $105,000 (as loaned\n                    from Koh) was incurredbeforeshe was adjudged a\n                    bankrupt. The sum of $85,088.40 contributed by Koh to finance the purchase of\n                    the AVI equipment for onward sale to Fujitec was also incurredbeforethe appellant was adjudged a bankrupt, and was\n                    therefore irrelevant to the charges. At the time when the offences were\n                    committed, not only did no one suffer any loss, Koh and NSS in fact received\n                    some repayments in reduction of the debts owed by the appellant. Koh received\n                    the sum of around $21,000 from Fujitec between January and April 2002, and\n                    a sum of $350 from the appellant in March 2002, and NSS received the sum of\n                    $18,454 from Fujitec on 25 April 2002.56     The Prosecution argued before me that the\n                    appellant had dishonestly used Koh’s monies, through the entities of\n                    Kaseve and NSS, to finance the purchase of AVI equipment to supply to Fujitec,\n                    and that when Fujitec made payment for the equipment, the monies were\n                    dishonestly received by the appellant and NCPL. This submission was apparently\n                    accepted by the DJ as can be observed from her GD (at [29]):As seen in paragraph 12 herein, Fujitec’s payments were madeafterthe accused became a bankrupt and\n                        she utilised the money for other purposes unrelated to Koh, NSS or Kaseve\n                        International...Evidently, the accused was not honest in her dealings with\n                        Koh...in view of the excuses she gave Koh...and that she utilized the money\n                        for other purposes, I did not believe the mitigation that it was\n                        miscommunication and/or inadvertence that Fujitec paid into the incorrect\n                        account.[emphasis in original]57     There is no factual basis to support either\n                    the Prosecution’s submission or the finding by the DJ. To begin with, the\n                    reference by the DJ to [12] of her GD to support her finding is clearly\n                    erroneous since [12] merely referred to payments received from Fujitec after NSS\n                    was formed and not after the appellant’s bankruptcy. Fujitec’s\n                    payment of $10,381.37 into NCPL’s bank account on 25 July 2001 was\n                    irrelevant to the appellant’s charges as it took placebeforeshe was adjudged a bankrupt. Although Fujitec credited\n                    the sums of $21,349.84 and $5,814.35 into NCPL’s bank account on\n                    21 December 2001 and 25 January 2002 respectively, shortlyaftershe was adjudged a bankrupt, there was nothing in\n                    the statement of facts (“SOF”) to indicate that these payments\n                    were credited for deliveries of AVI equipment made by NSS, Kaseve, or Kohafterher bankruptcy. Given that the payment\n                    on 21 December 2001 took place a month after the appellant was adjudged a\n                    bankrupt and that NCPL had existing dealings with Fujitec, it cannot be assumed\n                    that the payments received by NCPL were not in respect of transactions with\n                    Fujitec concluded prior to her bankruptcy. Even if the payments were indeed made\n                    for NSS’ deliveries to Fujitec, and NSS was the proper entity to receive\n                    the payment, the payment was clearly in respect of the two purchase orders dated\n                    19 April 2001 and 10 July 2001[note: 2]which were transacted some\n                    time prior to the appellant’s bankruptcy. Further, it was also admitted in\n                    the SOF that the goods which were delivered pursuant to these two purchase\n                    orders were in turn purchased by Kaseve in March 2001[note: 3].\n                    In my view, there was no question of any manipulation. The appellant was simply\n                    seeking to fulfil NCPL’s existing obligations to Fujitec through NSS and\n                    Kaseve. In any event, even if there was manipulation, it took placebeforeshe was adjudged a bankrupt on 23 November 2001\n                    and was therefore equally irrelevant to the charges. For completeness, I\n                    observed that a cheating charge initially preferred against the appellant (DAC\n                    10990 of 2009) for the payments into NCPL’s account was subsequently\n                    withdrawn and the appellant was granted a discharge amounting to an acquittal in\n                    relation to that charge[note: 4]. In these\n                    circumstances, there cannot be any basis to find that the appellant had, while\n                    committing the offences of managing the business of NSS,dishonestlymade use of Koh, Kaseve and NSS to finance the\n                    supply of the AVI equipment to Fujitec in order to enrich NCPL or\n                    herself.58     The DJ also found that the appellant had\n                    “deliberately influenced” Koh into registering the sole\n                    proprietorships of Kaseve and NSS to enable her to manage them (at [31]):[the appellant’s] involvement was not in passing. She had\n                        deliberately influenced Koh into registering sole proprietorships which she\n                        then managed.The suggestion from this finding is that the appellant had asked Koh\n                    to register Kaseve and NSS in Koh’s namebecausethe appellant knew that she was prohibited from managing\n                    these sole-proprietorships. However, it is incontrovertible that both Kaseve and\n                    NSS were formedbeforethe appellant was adjudged\n                    a bankrupt. The present case is therefore unlike the situation inYeong Chuan Wor, where the offender had requested his\n                    siblings to be the directors on record for three companies in order to conceal\n                    his involvement in running the operations of the companies. Further, inYeong Chuan Wor, the companies were\n                    incorporatedafterthe offender’s\n                    bankruptcy. Finally, the appellant had admitted (and the Prosecution does not\n                    dispute this) that the reason why she requested Koh to register Kaseve and NSS\n                    wasbecauseof NCPL’s financial difficulties\n                    in performing its existing contracts with Fujitec (at [36] of SOF):...NCPL had pre-existing contracts with Fujitec for the supply of\n                        intercommunication equipment. However, NCPL was not in a financial position\n                        to fulfil its contractual obligations and NCPL risked a potential lawsuit\n                        from Fujitec. To avert the situation, the accused admitted to Koh that she\n                        had asked him to register KI and subsequently NSS...59     Further, the DJ also attached considerable\n                    weight to her finding that the offences were committed over a prolonged period\n                    of time and consequently decided not to attach weight to the fact that the\n                    appellant was a first time offender, (at [31]–[32] of her GD):[The appellant’s] deliberate disregard of the law continued for a\n                        considerable period of more than 4 years...I further felt that because the offences were committed over a few years,\n                        there was little reason to make a concession to the plea that she had no\n                        previous conviction60     With respect, this finding is flawed. Although\n                    the appellant had remained as a director on record of NCPL for a period of\n                    almost four years between 18 December 2001 and 4 July 2005, and hence\n                    committed the offence under s 148(1) for that period of time, it cannot be\n                    said that her “deliberate disregard of the\n                        law” continued throughout a period of more than four\n                    years. The appellant’s last act of management in relation to NCPL was the\n                    withdrawal of a sum of $6,266.52 on 26 January 2002[note: 5].\n                    This took place slightly over a month after she was notified of the prohibitions\n                    by the OA on 18 December 2001. With regard to the management of NSS, it was\n                    clearly stated in the SOF (at [31]) that:...after the accused was notified of her duties and responsibilities as an\n                        undischarged bankrupt on 18 December 2001, the accused continued to\n                        operate the business of NSS until the last Purchase Order of Fujitec dated\n                        10 April 2002.61     It is therefore clear that the\n                    appellant’s last act of management of NSS took place just slightly less\n                    than four months after she was briefed by the OA. Furthermore, there are no\n                    facts to suggest that the late discovery of the appellant’s continued\n                    directorship of NCPL over a period of almost four years was due to the her\n                    attempt to evade detection from the authorities.62     The appellant stated in mitigation that due to\n                    a variety of personal problems, she was in a fragile state of mind at the time\n                    when the OA briefed her on the duties and responsibilities of an undischarged\n                    bankrupt and the relevant prohibitions on 18 December 2001. I agree with\n                    the DJ that her alleged “fragile state of mind” did not constitute\n                    valid mitigation in the circumstances. Nonetheless, I add the general\n                    observation that persons adjudged as bankrupt may not fully appreciate the\n                    duties and responsibilities of an undischarged bankrupt, and may not\n                    sufficiently digest the lengthy list of prohibitions stated in the various\n                    information sheets provided by the OA. This merely reinforces my point that\n                    there should be a system in place for the OA’s office to effectively\n                    liaise with Accounting and Corporate Regulatory Authority (“ACRA”)\n                    to ensure the timely cessation of directorships held by an undischarged bankrupt\n                    immediately or shortly after being pronounced bankrupt. I pause to note that\n                    under s 173(6A) of the Companies Act, there is strictly no obligation for\n                    the bankrupt person to file the cessation notification since such a person\n                        “may” lodge the notification\n                    without specifying the time within which it had to be filed. This is to be\n                    contrasted with s 173(6) of the Companies Act that expressly stipulates\n                    that the company “shall” lodge the\n                    notification within one month after the director ceases to be or is disqualified\n                    to act as a director.Conclusion63     The above analysis of the facts relevant to\n                    the present charges revealed that there are no aggravating factors to warrant\n                    the imposition of a custodial sentence. In particular, I attached significance\n                    to the fact that no one suffered any loss from the appellant’s offences\n                    and that there was no dishonest element either. Further, although the offence of\n                    acting as a director of NCPL was committed over almost four years, in truth, her\n                    acts of management were limited only to perform the purchase orders that were\n                    placed by Fujitec over a relatively short period of time following her briefing\n                    by the OA. I have taken into consideration the fact that there are six TIC\n                    charges, and that the appellant has no antecedents. For the reasons set out\n                    above, I allow the appeal and reduce the sentences to:(a)DAC 10992 of 2009 – fine of $7,000 (in\n                            default 4 weeks’ imprisonment)(b)DAC 10995 of 2009 – fine of $7,000 (in\n                            default 4 weeks’ imprisonment)The sentence imposed by the court below for DAC 10999 of 2009 which is\n                    not the subject of the appeal before me stands as it is.Post Script64     During the hearing of the appeal, I remarked\n                    that it was odd for the appellant to have remained on record as a director of\n                    NCPL for such a long time despite being made a bankrupt. I directed the\n                    Prosecution to file additional submissions to explain the working protocol\n                    between ACRA and the OA as regards removal of persons as directors who have been\n                    adjudged bankrupt. From the further submissions, the following picture has\n                    emerged:(a)     Prior to January 2001, the\n                        Registry of Companies and Businesses (“RCB”) (now known as\n                        ACRA) relied on the company to provide notification under s 173(6) of\n                        the Companies Act whenever a person was disqualified from acting as\n                        director.(b)     In January 2001, s 173 of the Companies Act was amended with the\n                        insertion of a new subsection 6A to enable the disqualified person to\n                        directly report the cessation if he has reasonable cause to believe that the\n                        company may not notify the RCB.(c)     Currently, IPTO would provide a list of persons against\n                        whom bankruptcy orders have been made to ACRA on a weekly\n                    basis.(d)     Checks on\n                        the status of a bankrupt are conducted at “critical” junctures in the course of bankruptcy\n                        administration such as when a complaint is received against a bankrupt or\n                        when the bankrupt is being reviewed for suitability for discharge. Where\n                        such checks or searches reveal that the bankrupt has remained a director,\n                        IPTO will then send a letter to the bankrupt to remind him or her that it is\n                        an offence to act as a director and that steps should be taken to file\n                        cessation notification within a stipulated time.(e)     IPTO would refer breaches of\n                        s 148 of the Companies Act to the Commercial Affairs Department\n                        (“CAD”) for investigation and\n                prosecution.65     It is apparent from the description of the\n                    existing protocol that the cessation of a person acting as a director is heavily\n                    dependent on the initiative of the company or the undischarged bankrupt. As a\n                    result, if steps are not taken by either the company or the director to file\n                    cessation notification, it is possible that the undischarged bankrupt may remain\n                    a director in the company for years following the bankruptcy adjudication.\n                    Indeed, this was precisely the case in the present appeal where the appellant\n                    remained a director of NCPL for almost four years following her bankruptcy.\n                    Although not raised by the Prosecution, I have noted that in addition to the new\n                    subsection 6A, subsection 6B was introduced at the same time to empower the\n                    Registrar of Companies, on his own initiative, to remove the name of any person\n                    from the registry whom he has reason to believe is no longer qualified to act as\n                    a director by virtue of s 148 or s 155 of the Companies\n                Act.66     From the additional submissions filed by the\n                    Prosecution, the unsatisfactory state of the existing arrangement presents a\n                    more compelling case for review. On 17 April 2003, the RCB issued a summons\n                    against the appellant for failing to lodge a change of address in respect of\n                    NLPL in 2002, an offence punishable under s 143(1) of the Companies Act. On\n                    19 February 2004, the RCB issued another summons against the appellant for\n                    failing to hold an Annual General Meeting and for failing to file annual returns\n                    in respect of NLPL and NCPL in 2002, offences punishable under s 175(4) and\n                    s 197(7) of the Companies Act. In the course of the appellant making\n                    representations for the charges to be withdrawn, ACRA found out that she was a\n                    bankrupt. On 25 July 2005, the charges against the appellant were formally\n                    withdrawn presumably because ACRA was satisfied that given her bankruptcy\n                    status, the appellant had in fact ceased to be actively involved in the\n                    management of NLPL and NCPL, as the charges were in respect of her failure, in\n                    her capacity as an officer of the companies, to hold an annual general meeting\n                    and her failure to file annual returns for NLPL and NCPL. Despite the fortuitous\n                    discovery of the appellant’s bankruptcy status, ACRA did not take any step\n                    to require the appellant to lodge the cessation notification though the\n                    Registrar of Companies is empowered to remove her as a director from the\n                    registry pursuant to s 173(6B) of the Companies Act. Instead, the discovery\n                    of her breaches came up under a different context during IPTO’s review of\n                    the appellant’s suitability for discharge from bankruptcy. Thereafter on\n                    24 June 2005, IPTO wrote to the appellant to advise her to take steps to\n                    resign as a director which she duly did on 4 July 2005. Notwithstanding her\n                    compliance with IPTO’s reminder to resign, the appellant was charged for\n                    acting as a director on 22 December 2009, almost five years later. There is\n                    no suggestion, from the facts provided by the Prosecution, that any letter was\n                    sent to the appellant to inform her to cease her directorship in NCPL, between\n                    the time when ACRA discovered her bankruptcy status to the time it was\n                    discovered by IPTO in June 2005. As I have explained in[32], the rationale for s 148 of the\n                    Companies Act is to safeguard the interest of the unsuspecting public from\n                    dealing with companies managed by directors who are undischarged bankrupts. The\n                    existing arrangement which depends on the initiative of the company and the\n                    undischarged bankrupt may not be adequate to achieve the intended objective of\n                    s 148 of the Companies Act. In my view, it is imperative for ACRA or IPTO\n                    to take proactive steps to ensure the immediate cessation of directorship(s) by\n                    such persons and not leave it to chance to discover the breaches at\n                        “critical” junctures in the\n                    bankruptcy administration.67     In my opinion, the following measures should\n                    beconsideredfor implementation:(a)     Currently, a list of persons\n                        adjudged to be bankrupt isalreadyprovided by\n                        IPTO to ACRA on a weekly basis. From this list, a check on the directorship\n                        status of persons adjudged bankrupt should be made by\n                    ACRA.(b)     The results\n                        of such searches should then be submitted to IPTO. I assume these steps\n                        could be completed in good time with the benefit of a computerised process\n                        and the use of identification numbers of persons adjudged to be a bankrupt.\n                        A letter should then be sent by IPTO to these persons to inform them of\n                        their obligation to file a notice of cessation in accordance with\n                        s 173(6A) of the Companies Act.(c)     If the notice of cessation is not filed within the\n                        requisite time, IPTO can consider taking appropriate steps, including\n                        sending a further reminder or inviting the Registrar of Companies to remove\n                        the person as a director from the registry or adopting the option of\n                        referring the matter to the CAD or any other relevant authority for\n                        consideration of further action.68     The rationale and importance of establishing a\n                    systemic process such as this is to prevent undischarged bankrupts from\n                    unwittingly committing the technical offence of remaining as a director on\n                    record of companies, even if these persons had played no role in the management\n                    of such companies. Equally, it would serve to ensure that public interest is\n                    protected to prevent third parties from dealing with companies in ignorance of\n                    the bankrupt status of its directors. The above measures are onlysuggestionsfor consideration as ultimately the\n                    feasibility of such a system is a matter for ACRA and IPTO to implement. Having\n                    said that, it is clear to me that it is not entirely satisfactory for the\n                    relevant authorities to find out that an offence has been committed only when\n                    the undischarged bankrupt is being reviewed for suitability for discharge. In\n                    this case, instead of beingdischargedfrom\n                    bankruptcy, to add to her woes, the appellant was insteadchargedand, worse still, faced with the possibility of a\n                    custodial sentence. This is indeed an unfortunate and ironic outcome given that\n                    “the underlying purpose of [these statutory provisions]... is to\n                    rationalise the law of insolvency and in general to enable those involved in\n                    business failureto get back on their feet as rapidly as may\n                        be consistent with fairness to their\n                        creditors”[note: 6].[note: 1]Statement of Facts at\n                [36].[note: 2]Statement of\n                                Facts at [15].[note: 3]Ibid.[note: 4]Appellant’s Skeletal Submissions\n                                dated 20 October 2010 at [16].[note: 5]See Statement of Facts at [26].[note: 6]Per\n                                Farquharson L. J. in the English Court of Appeal decision ofR v Sundranpillai Theivendran(1992) 13 Cr App R (S) 601 at p\n                            603.",
        "Sentencing Guidelines": "40     Given the protective nature of the relevant\n                    provisions, the predominant consideration in sentencing offenders for breach of\n                    s 148(1) of the Companies Act and s 26(1) of the Business Registration\n                    Act is to evaluate the applicability of the deterrent principle with a view to\n                    protecting the interests of creditors and the public from harm caused by the\n                    bankrupt’s management of the business. As a starting point, if no harm was\n                    caused to anyone arising from the offence and there was no dishonest element in\n                    the commission of the offence, a fine would generally be\n                sufficient. 41     In my view, a custodial sentence would\n                    typically be appropriate where one or more of the following aggravating\n                    circumstances are present,viz: (a)     The unlawful continuance of\n                        directorship and/or management of the company or business resulting in loss\n                        or harm suffered by innocent third parties who dealt with the company or\n                        business under the management of the undischarged bankrupt (see[43]below). (b)     The offence was committed with dishonest\n                        intention to cheat or defraud innocent third parties (see[51]below). (c)     The offender obtained personal gains or was\n                        enriched as a result of committing the offences (see[44]below). (d)     The flagrant or reckless disregard of the\n                        prohibition, such as the direct or indirect involvement in the incorporation\n                        of companiesafterthe offender has already\n                        been made a bankrupt in order to circumvent the prohibition (see[45]–[50]below). (e)     The offence was committed in breach of an existing\n                        disqualification order made under ss 149, 149A and154 of the Companies Act\n                        (see[51]below). (f)     The offence was committed over a\n                        prolonged period of time during which the offender was inactivemanagement. (g)     The offender has antecedents of the same offence or\n                        related bankruptcy offences under the Bankruptcy Act, Companies Act and/or\n                        the Business Registration Act (see[51]below). 42     The above aggravating factors serve as a guide\n                    in the exercise of sentencing discretion. They are not intended to be\n                    exhaustive. Each case must necessarily be decided on its own facts. Although the\n                    lack of any of these aggravating factorsmay not\n                        necessarilypreclude the imposition of a custodial sentence, a\n                    sentencing judge ought to give due consideration and justification whenever a\n                    custodial sentence is imposed in theabsenceof\n                    recognised aggravating factors. I will elaborate on the aggravating factors. In\n                    the meantime, I should add that it is certainly incorrect to approach the\n                    question by examining whether there are exceptional circumstances to warrant the\n                    imposition of anon-custodialsentence as observed\n                    by the DJ at [33] of her grounds of decision (“the GD”). In my\n                    view, it should be the other way round. As I have explained in[40]above, in the absence of loss or harm to\n                    third parties or dishonesty (which are both aggravating factors), a fine is\n                    typically the appropriate sentence. Accordingly, the court should instead\n                    establish whether there are circumstances to warrant the imposition of a\n                    custodial sentence. 43     Consistent with the protective rationale of\n                    the prohibition, the law will take a serious view towards offenders who, as a\n                    result of the continued directorship or management of businesses, caused\n                    innocent third parties who deal with such businesses to suffer losses. A\n                    custodial sentence would be imposed in these situations to satisfy the\n                    requirements of specific and general deterrence. InLim Hua\n                        Tong, a fine of $5,000 was imposed for the conviction of one\n                    charge under s 148(1) of the Companies Act. The judge placed emphasis on\n                    the fact that no harm was caused to anyone (at [22]–[23]): ...there was nothing here that called for the imposition of a sentence of\n                        imprisonment. There was no harm caused to any one apparently, as there was\n                        no mention of this in the [Statement of Facts]... ...The range of fines for such a first [time] offender, who does not cause\n                        harm is generally between $2,000 to $6,000 or so. 44     A fine is generally inappropriate where the\n                    offender has obtained personal gains or was enriched as a result of committing\n                    the offences. In such situations, a fine will generally not be sufficient to\n                    serve as a deterrent as it may only disgorge some of the profits (given that the\n                    maximum fine is only $10,000). 45     It has been accepted that the offender’srecklessorflagrantdisregard of the prohibition under s 148(1) of the\n                    Companies Act, or s 26(1) of the Business Registration Act is an\n                    aggravating factor: seeOng Kwang Engat [15],Yeong Chuan WorandSundranpillai Theivendran. However, the DJ in the court below\n                    took a questionable position on what constitutes “reckless” or\n                    “flagrant” disregard. She decided that one of the reasons which\n                    warranted a custodial sentence was because the appellant had been informed by\n                    the OA that she was prohibited from managing a business, and by doing so despite\n                    having been informed, the appellant had “blatantly flouted” the\n                    disqualification (see [31]): ...this was not a case where the accused was ignorant of the fact that she\n                        could not manage a business or company.She was briefed,\n                            like any other undischarged bankrupts, by the Official\n                        Assignee that she should not concern herself in the management of a business\n                        or company...In this case, it was plain that the accused hadblatantly floutedthe disqualification. [emphasis in bold and in italics added] 46     In support of the DJ’s observations\n                    above, the Prosecution argued the following (at [35] of the DPP’s\n                    submissions): While it is true that the [a]ppellant managed NSS and NCPL before she was\n                        made a bankrupt[,] thatipso factois not a\n                        distinguishing factor from the case precedents as the fact remains that she\n                        continued to run NSS and NCPL after she was made a bankrupt and thereafter\n                        managed Kaseve Lite N Comm and Kaseve Lighting Pte Ltd inflagrant disregardof the law that prohibited her from doing\n                        so... [emphasis added]. 47     In the same vein, the court inNg Chuan Sengat [10]–[12] observed that: 10    This was not a casewhere the\n                                accused was ignorant of the fact that he could not manage a\n                                business. He had been briefed just like any other bankrupt that he\n                                should not concern himself in the management of a\n                                business. However, he sought to justify his acts by\n                            claiming that it was a family business and he had his wife’s\n                            sanction... ... 12    ...it is plain that the accused has quite blatantly\n                            defied the disqualification order on him...His deliberate disregard of\n                            the law continued for a considerable period of time [emphasis added]. 48     In so far as the above views stand for the\n                    proposition that an offender who committed the offence despite having been\n                    briefed by the OA of the prohibition against management (or directorship) should\n                    be punished with a custodial sentence, as they have “blatantly”\n                    disregarded the prohibition, I would disagree. As observed by the DJ herself,\n                    the offender,like any other undischarged\n                        bankrupts, was briefed by the OA of the prohibitions. This means\n                    that apart from the rare case where the undischarged bankrupt wasnot briefedby the OA (perhaps due to its hypothetical\n                    rare lapse, if any or at all), all offenders wouldinexorablybe punished with a custodial sentence. This would\n                    render the discretion to impose a fine superfluous. 49     Furthermore, the fact that a person has\n                    breached the prohibition simply gives rise to the offence itself. As a matter of\n                    jurisprudential logic, it is a self-evident sentencing principle that the very\n                    fact which creates the offence cannotin and of\n                        itselfbe an aggravating factor. This is different from taking\n                    into account themannerin which the offence was\n                    committed which, in appropriate circumstances, can amount to an aggravating\n                    factor. However, thevery actof committing an\n                    offence cannot at the same time be an aggravating factor. Otherwise, the\n                    sentencing court would be inclined to impose aheavysentence forallinstances\n                    when such an offence iscommitted. If left\n                    unchecked, this would lead to an inadvertent and illegitimate judicial\n                    legislating of a “minimum sentence” over and above the statutorily\n                    prescribed minimum sentence. As such, I emphasise that whether a custodial\n                    sentence is appropriate in situations where the offender has been briefed by the\n                    OA depends on all the relevant facts and circumstances. 50     The circumstances that give rise to flagrant\n                    or reckless disregard of the prohibition can vary across a broad spectrum of\n                    factual matrix. An example is when the offender commits multiple bankruptcy\n                    offences that complements his illegal management of the business, such as the\n                    case inHeng Boon Tong, where the offender was\n                    sentenced to one month’s imprisonment for managing a business without\n                    leave under s 26(1) of the Business Registration Act, along with three\n                    months imprisonment for obtaining credit exceeding $500 without the disclosure\n                    of his bankruptcy status, under s 141(1)(a)\n                    of the Bankruptcy Act. Another example of flagrant disregard is the case ofYeong Chuan Wor, where the offenderincorporatedand managed three companiesafterthe accused was already made a bankrupt. The\n                    offender had also deliberately used his siblings to be the formal directors on\n                    record for the companies in order to evade the prohibition. 51     Other aggravating factors include situations\n                    when third parties are cheated or defrauded by the offender (although this may\n                    be diluted if there is a conviction and sentence for a separate cheating\n                    charge); where the offender had committed the offences whilst under an existing\n                    disqualification order under s 154(1) of the Companies Act (such as in the\n                    case ofOng Kwang Eng); and where the offender has\n                    antecedents of similar bankruptcy offences of sufficient gravity. In these\n                    situations, a custodial sentence would usually be appropriate as such offenders\n                    show a manifest disregard for the bankruptcy regime, which if left unchecked,\n                    has the potential to cause substantial harm to the interests of creditors and\n                    the greater public. 52     Before I consider the facts of the present\n                    case, it is perhaps appropriate for me to comment on the observation made by\n                    Yong CJ inChoong Kian Haw. Although it was not a\n                    decision on either s 148(1) of the Companies Act or s 26(1) of the\n                    Business Registration Act, the following remark inChoong\n                        Kian Haw(at [24]) appeared to have “inspired” the court to impose custodial sentences in two\n                    earlier decisions inHeng Boon TongandNg Chuan Seng: The magistrate misread my decision inPP v. Ong Ker\n                            Seng[[2001] 3 SLR(R) 134]. In that case, I did not\n                        contradict the trite principles that fines may be imposed in appropriate\n                        circumstances. However, I stated my view that fines were, in general, not a\n                        suitable means of punishment since bankrupts would typically lack the means\n                        to pay for the fines themselves. If they had the funds to pay the fines,\n                        these monies should clearly be channelled instead to the unpaid creditors.\n                        If they lacked the funds and a third party paid for them, the punitive\n                        effect of the punishments is diminished.These concerns\n                            apply with equal force to the sentencing of bankrupts in\n                            general. They are not limited to offences committed under\n                            s 141(1)(a) [the offence of obtaining\n                        credit without disclosure of bankruptcy status under the Bankruptcy\n                        Act]. [emphasis added] 53     This comment is, with respect, mereobiter dicta. Indeed, there was no charge under\n                        s 141(1)(a) inChoong\n                        Kian Hawin the first place. The question in that case was\n                    whether the imposition of fines for three charges of leaving Singapore without\n                    the OA’s permission (under s 131(1)(b)\n                    of the Bankruptcy Act) was manifestly inadequate. Given the egregious disregard\n                    of the law as the offender had committed the offence 44 times over a period of\n                    15 months, it was plainly clear that the sentences imposed inChoong Kian Hawwere indeed manifestly inadequate. It should\n                    also be noted that the above comment was made to clarify an earlier decision\n                        (PP v Ong Ker Seng[2001]\n                    3 SLR(R) 134). Indeed, the comment has since been analysed and\n                    clarified by Lee J inGanesh s/o M Sinnathamby v Public\n                        Prosecutor[2008] 1 SLR(R) 495: 23    The force of the\n                            argument, that the imposition of a fine would not be adequate punishment\n                            in the case of an undischarged bankrupt, is compelling. However it is\n                            not clear how a bankrupt would be able to get his hands on money to pay\n                            the fine except in cases where it is paid by family members or friends.\n                            Therefore, except where a third party is prepared to pay the fine, an\n                            undischarged bankrupt would invariably serve the imprisonment imposed in\n                            default of payment of the fine. Subsequent toChoong\n                                Kian Haw, the lower courts have tended to impose\n                            custodial sentences for such cases. Indeed, this sentencing trend was so\n                            prevalent that it was raised in Parliament on 2 March 2007 (seeSingapore Parliamentary Debates, Official\n                                Report(2 March 2007) vol 82 at cols 2348-2349) by\n                            Mr Inderjit Singh, whose comments were as follows: Sir, one particular example of how harsh the regime here is the case\n                            of bankrupts who leave Singapore ... Many of these persons get hauled up\n                            before the courts and face criminal sanction under the Bankruptcy Act,\n                            section 131, where the Act punishes them with either a $10,000 fine or a\n                            jail term of two years. But unfortunately, we had a precedent set by the\n                            former Chief Justice where, under the case of Public Prosecutorvs[Chung Kian How], he decided that\n                            punishment for this offence should be a jail term. And subsequently, the\n                            Subordinate Courts are bound by this precedent. I am not a lawyer, but I\n                            think they are bound by this precedent set by the High Court. I think the courts should not be playing the role of Parliament and I\n                            hope that the Minister can explain this. I suggest that the Minister\n                            look at Chapters 7 and 13 and also the harshness of this rule to be\n                            reduced. 24    Notably, the\n                            response by the Senior Minister of State for Law, Assoc Prof Ho Peng Kee\n                            was couched in the following terms (vol 82 at col 2365): [W]hy are they jailed? This is a court decision, but let me just say\n                            that they are not all jailed because, in fact, the Act allows for a\n                            person to be either jailed or fined. So I would say that we should leave\n                            it to the court to look at the facts and circumstances of the case\n                            because every case is unique - whether he has travelled before, how long\n                            he stays away, whether he is a cooperative bankrupt, whether he has\n                            other offences hanging over his head. That is why I think we should\n                            leave it to the court. My assurance to Mr Singh is that there are cases\n                            where the bankrupt is only fined and not jailed. So it is not mandatory\n                            jail. 25    Unfortunately, the foregoing exchange underscores a\n                            misconception that the case ofChoong Kian\n                                Hawhas unfairly imposed a sentencing \"precedent\" that\n                            compels the imposition of a custodial sentence on bankrupts who\n                            contravene travel restrictions under the Act ([1]supra). This is clearly not the case. 26    To begin with, it should be highlighted that Yong\n                            CJ prefaced his guidelines by stating in no uncertain terms that he \"did\n                            not contradict the trite principles that fines may be imposed in\n                            appropriate circumstances\" (above at [22]). On appeal, the Prosecution\n                            tendered a list of cases in which fines were in fact imposed in cases\n                            where the accused had taken a small number of trips out of the\n                            jurisdiction. While the number of trips may be an important factor to be\n                            considered in determining the appropriate sentence (in so far as it\n                            reflects the degree of recalcitrance), it is undoubtedly not the sole\n                            factor. 27    On this note, I feel compelled to reiterate that\n                            whilst past cases serve as focal guidelines for the sentencing court,\n                            these \"tariffs\" should be applied with due appreciation of the unique\n                            facts and circumstances of each individual case (Soong Hee Sin v PP[2001]\n                            1 SLR(R) 475  ). It remains the duty of the court to\n                            remain apprised of all relevant factors and to seize the \"judicial\n                            prerogative to tailor criminal sanctions to the individual offender\"\n                                (Abu Syeed Chowdhury v PP[2002]\n                            1 SLR(R) 182 at [15]). 54     I cannot agree more with the above\n                    observations. It would require significantly more than meredictato create a fetter on a court’s sentencing\n                    discretion. To expect any less would be to tread perilously close to an\n                    abdication of the responsibility of the sentencing judge in applying his mind\n                    and the law to the facts of each case. The\n                        Court’s decision 55     Turning to the facts of the present case, it\n                    is pertinent to first highlight that the Prosecution conceded that no one\n                    suffered any lossarisingfrom the\n                    appellant’s offences. The appellant’s debt of $105,000 (as loaned\n                    from Koh) was incurredbeforeshe was adjudged a\n                    bankrupt. The sum of $85,088.40 contributed by Koh to finance the purchase of\n                    the AVI equipment for onward sale to Fujitec was also incurredbeforethe appellant was adjudged a bankrupt, and was\n                    therefore irrelevant to the charges. At the time when the offences were\n                    committed, not only did no one suffer any loss, Koh and NSS in fact received\n                    some repayments in reduction of the debts owed by the appellant. Koh received\n                    the sum of around $21,000 from Fujitec between January and April 2002, and\n                    a sum of $350 from the appellant in March 2002, and NSS received the sum of\n                    $18,454 from Fujitec on 25 April 2002. 56     The Prosecution argued before me that the\n                    appellant had dishonestly used Koh’s monies, through the entities of\n                    Kaseve and NSS, to finance the purchase of AVI equipment to supply to Fujitec,\n                    and that when Fujitec made payment for the equipment, the monies were\n                    dishonestly received by the appellant and NCPL. This submission was apparently\n                    accepted by the DJ as can be observed from her GD (at [29]): As seen in paragraph 12 herein, Fujitec’s payments were madeafterthe accused became a bankrupt and\n                        she utilised the money for other purposes unrelated to Koh, NSS or Kaseve\n                        International...Evidently, the accused was not honest in her dealings with\n                        Koh...in view of the excuses she gave Koh...and that she utilized the money\n                        for other purposes, I did not believe the mitigation that it was\n                        miscommunication and/or inadvertence that Fujitec paid into the incorrect\n                        account. [emphasis in original] 57     There is no factual basis to support either\n                    the Prosecution’s submission or the finding by the DJ. To begin with, the\n                    reference by the DJ to [12] of her GD to support her finding is clearly\n                    erroneous since [12] merely referred to payments received from Fujitec after NSS\n                    was formed and not after the appellant’s bankruptcy. Fujitec’s\n                    payment of $10,381.37 into NCPL’s bank account on 25 July 2001 was\n                    irrelevant to the appellant’s charges as it took placebeforeshe was adjudged a bankrupt. Although Fujitec credited\n                    the sums of $21,349.84 and $5,814.35 into NCPL’s bank account on\n                    21 December 2001 and 25 January 2002 respectively, shortlyaftershe was adjudged a bankrupt, there was nothing in\n                    the statement of facts (“SOF”) to indicate that these payments\n                    were credited for deliveries of AVI equipment made by NSS, Kaseve, or Kohafterher bankruptcy. Given that the payment\n                    on 21 December 2001 took place a month after the appellant was adjudged a\n                    bankrupt and that NCPL had existing dealings with Fujitec, it cannot be assumed\n                    that the payments received by NCPL were not in respect of transactions with\n                    Fujitec concluded prior to her bankruptcy. Even if the payments were indeed made\n                    for NSS’ deliveries to Fujitec, and NSS was the proper entity to receive\n                    the payment, the payment was clearly in respect of the two purchase orders dated\n                    19 April 2001 and 10 July 2001[note: 2]which were transacted some\n                    time prior to the appellant’s bankruptcy. Further, it was also admitted in\n                    the SOF that the goods which were delivered pursuant to these two purchase\n                    orders were in turn purchased by Kaseve in March 2001[note: 3].\n                    In my view, there was no question of any manipulation. The appellant was simply\n                    seeking to fulfil NCPL’s existing obligations to Fujitec through NSS and\n                    Kaseve. In any event, even if there was manipulation, it took placebeforeshe was adjudged a bankrupt on 23 November 2001\n                    and was therefore equally irrelevant to the charges. For completeness, I\n                    observed that a cheating charge initially preferred against the appellant (DAC\n                    10990 of 2009) for the payments into NCPL’s account was subsequently\n                    withdrawn and the appellant was granted a discharge amounting to an acquittal in\n                    relation to that charge[note: 4]. In these\n                    circumstances, there cannot be any basis to find that the appellant had, while\n                    committing the offences of managing the business of NSS,dishonestlymade use of Koh, Kaseve and NSS to finance the\n                    supply of the AVI equipment to Fujitec in order to enrich NCPL or\n                    herself. 58     The DJ also found that the appellant had\n                    “deliberately influenced” Koh into registering the sole\n                    proprietorships of Kaseve and NSS to enable her to manage them (at [31]): [the appellant’s] involvement was not in passing. She had\n                        deliberately influenced Koh into registering sole proprietorships which she\n                        then managed. The suggestion from this finding is that the appellant had asked Koh\n                    to register Kaseve and NSS in Koh’s namebecausethe appellant knew that she was prohibited from managing\n                    these sole-proprietorships. However, it is incontrovertible that both Kaseve and\n                    NSS were formedbeforethe appellant was adjudged\n                    a bankrupt. The present case is therefore unlike the situation inYeong Chuan Wor, where the offender had requested his\n                    siblings to be the directors on record for three companies in order to conceal\n                    his involvement in running the operations of the companies. Further, inYeong Chuan Wor, the companies were\n                    incorporatedafterthe offender’s\n                    bankruptcy. Finally, the appellant had admitted (and the Prosecution does not\n                    dispute this) that the reason why she requested Koh to register Kaseve and NSS\n                    wasbecauseof NCPL’s financial difficulties\n                    in performing its existing contracts with Fujitec (at [36] of SOF): ...NCPL had pre-existing contracts with Fujitec for the supply of\n                        intercommunication equipment. However, NCPL was not in a financial position\n                        to fulfil its contractual obligations and NCPL risked a potential lawsuit\n                        from Fujitec. To avert the situation, the accused admitted to Koh that she\n                        had asked him to register KI and subsequently NSS... 59     Further, the DJ also attached considerable\n                    weight to her finding that the offences were committed over a prolonged period\n                    of time and consequently decided not to attach weight to the fact that the\n                    appellant was a first time offender, (at [31]–[32] of her GD): [The appellant’s] deliberate disregard of the law continued for a\n                        considerable period of more than 4 years... I further felt that because the offences were committed over a few years,\n                        there was little reason to make a concession to the plea that she had no\n                        previous conviction 60     With respect, this finding is flawed. Although\n                    the appellant had remained as a director on record of NCPL for a period of\n                    almost four years between 18 December 2001 and 4 July 2005, and hence\n                    committed the offence under s 148(1) for that period of time, it cannot be\n                    said that her “deliberate disregard of the\n                        law” continued throughout a period of more than four\n                    years. The appellant’s last act of management in relation to NCPL was the\n                    withdrawal of a sum of $6,266.52 on 26 January 2002[note: 5].\n                    This took place slightly over a month after she was notified of the prohibitions\n                    by the OA on 18 December 2001. With regard to the management of NSS, it was\n                    clearly stated in the SOF (at [31]) that: ...after the accused was notified of her duties and responsibilities as an\n                        undischarged bankrupt on 18 December 2001, the accused continued to\n                        operate the business of NSS until the last Purchase Order of Fujitec dated\n                        10 April 2002. 61     It is therefore clear that the\n                    appellant’s last act of management of NSS took place just slightly less\n                    than four months after she was briefed by the OA. Furthermore, there are no\n                    facts to suggest that the late discovery of the appellant’s continued\n                    directorship of NCPL over a period of almost four years was due to the her\n                    attempt to evade detection from the authorities. 62     The appellant stated in mitigation that due to\n                    a variety of personal problems, she was in a fragile state of mind at the time\n                    when the OA briefed her on the duties and responsibilities of an undischarged\n                    bankrupt and the relevant prohibitions on 18 December 2001. I agree with\n                    the DJ that her alleged “fragile state of mind” did not constitute\n                    valid mitigation in the circumstances. Nonetheless, I add the general\n                    observation that persons adjudged as bankrupt may not fully appreciate the\n                    duties and responsibilities of an undischarged bankrupt, and may not\n                    sufficiently digest the lengthy list of prohibitions stated in the various\n                    information sheets provided by the OA. This merely reinforces my point that\n                    there should be a system in place for the OA’s office to effectively\n                    liaise with Accounting and Corporate Regulatory Authority (“ACRA”)\n                    to ensure the timely cessation of directorships held by an undischarged bankrupt\n                    immediately or shortly after being pronounced bankrupt. I pause to note that\n                    under s 173(6A) of the Companies Act, there is strictly no obligation for\n                    the bankrupt person to file the cessation notification since such a person\n                        “may” lodge the notification\n                    without specifying the time within which it had to be filed. This is to be\n                    contrasted with s 173(6) of the Companies Act that expressly stipulates\n                    that the company “shall” lodge the\n                    notification within one month after the director ceases to be or is disqualified\n                    to act as a director.",
        "Conclusion": "63     The above analysis of the facts relevant to\n                    the present charges revealed that there are no aggravating factors to warrant\n                    the imposition of a custodial sentence. In particular, I attached significance\n                    to the fact that no one suffered any loss from the appellant’s offences\n                    and that there was no dishonest element either. Further, although the offence of\n                    acting as a director of NCPL was committed over almost four years, in truth, her\n                    acts of management were limited only to perform the purchase orders that were\n                    placed by Fujitec over a relatively short period of time following her briefing\n                    by the OA. I have taken into consideration the fact that there are six TIC\n                    charges, and that the appellant has no antecedents. For the reasons set out\n                    above, I allow the appeal and reduce the sentences to: (a)DAC 10992 of 2009 – fine of $7,000 (in\n                            default 4 weeks’ imprisonment)(b)DAC 10995 of 2009 – fine of $7,000 (in\n                            default 4 weeks’ imprisonment)The sentence imposed by the court below for DAC 10999 of 2009 which is\n                    not the subject of the appeal before me stands as it is.Post Script64     During the hearing of the appeal, I remarked\n                    that it was odd for the appellant to have remained on record as a director of\n                    NCPL for such a long time despite being made a bankrupt. I directed the\n                    Prosecution to file additional submissions to explain the working protocol\n                    between ACRA and the OA as regards removal of persons as directors who have been\n                    adjudged bankrupt. From the further submissions, the following picture has\n                    emerged:(a)     Prior to January 2001, the\n                        Registry of Companies and Businesses (“RCB”) (now known as\n                        ACRA) relied on the company to provide notification under s 173(6) of\n                        the Companies Act whenever a person was disqualified from acting as\n                        director.(b)     In January 2001, s 173 of the Companies Act was amended with the\n                        insertion of a new subsection 6A to enable the disqualified person to\n                        directly report the cessation if he has reasonable cause to believe that the\n                        company may not notify the RCB.(c)     Currently, IPTO would provide a list of persons against\n                        whom bankruptcy orders have been made to ACRA on a weekly\n                    basis.(d)     Checks on\n                        the status of a bankrupt are conducted at “critical” junctures in the course of bankruptcy\n                        administration such as when a complaint is received against a bankrupt or\n                        when the bankrupt is being reviewed for suitability for discharge. Where\n                        such checks or searches reveal that the bankrupt has remained a director,\n                        IPTO will then send a letter to the bankrupt to remind him or her that it is\n                        an offence to act as a director and that steps should be taken to file\n                        cessation notification within a stipulated time.(e)     IPTO would refer breaches of\n                        s 148 of the Companies Act to the Commercial Affairs Department\n                        (“CAD”) for investigation and\n                prosecution.65     It is apparent from the description of the\n                    existing protocol that the cessation of a person acting as a director is heavily\n                    dependent on the initiative of the company or the undischarged bankrupt. As a\n                    result, if steps are not taken by either the company or the director to file\n                    cessation notification, it is possible that the undischarged bankrupt may remain\n                    a director in the company for years following the bankruptcy adjudication.\n                    Indeed, this was precisely the case in the present appeal where the appellant\n                    remained a director of NCPL for almost four years following her bankruptcy.\n                    Although not raised by the Prosecution, I have noted that in addition to the new\n                    subsection 6A, subsection 6B was introduced at the same time to empower the\n                    Registrar of Companies, on his own initiative, to remove the name of any person\n                    from the registry whom he has reason to believe is no longer qualified to act as\n                    a director by virtue of s 148 or s 155 of the Companies\n                Act.66     From the additional submissions filed by the\n                    Prosecution, the unsatisfactory state of the existing arrangement presents a\n                    more compelling case for review. On 17 April 2003, the RCB issued a summons\n                    against the appellant for failing to lodge a change of address in respect of\n                    NLPL in 2002, an offence punishable under s 143(1) of the Companies Act. On\n                    19 February 2004, the RCB issued another summons against the appellant for\n                    failing to hold an Annual General Meeting and for failing to file annual returns\n                    in respect of NLPL and NCPL in 2002, offences punishable under s 175(4) and\n                    s 197(7) of the Companies Act. In the course of the appellant making\n                    representations for the charges to be withdrawn, ACRA found out that she was a\n                    bankrupt. On 25 July 2005, the charges against the appellant were formally\n                    withdrawn presumably because ACRA was satisfied that given her bankruptcy\n                    status, the appellant had in fact ceased to be actively involved in the\n                    management of NLPL and NCPL, as the charges were in respect of her failure, in\n                    her capacity as an officer of the companies, to hold an annual general meeting\n                    and her failure to file annual returns for NLPL and NCPL. Despite the fortuitous\n                    discovery of the appellant’s bankruptcy status, ACRA did not take any step\n                    to require the appellant to lodge the cessation notification though the\n                    Registrar of Companies is empowered to remove her as a director from the\n                    registry pursuant to s 173(6B) of the Companies Act. Instead, the discovery\n                    of her breaches came up under a different context during IPTO’s review of\n                    the appellant’s suitability for discharge from bankruptcy. Thereafter on\n                    24 June 2005, IPTO wrote to the appellant to advise her to take steps to\n                    resign as a director which she duly did on 4 July 2005. Notwithstanding her\n                    compliance with IPTO’s reminder to resign, the appellant was charged for\n                    acting as a director on 22 December 2009, almost five years later. There is\n                    no suggestion, from the facts provided by the Prosecution, that any letter was\n                    sent to the appellant to inform her to cease her directorship in NCPL, between\n                    the time when ACRA discovered her bankruptcy status to the time it was\n                    discovered by IPTO in June 2005. As I have explained in[32], the rationale for s 148 of the\n                    Companies Act is to safeguard the interest of the unsuspecting public from\n                    dealing with companies managed by directors who are undischarged bankrupts. The\n                    existing arrangement which depends on the initiative of the company and the\n                    undischarged bankrupt may not be adequate to achieve the intended objective of\n                    s 148 of the Companies Act. In my view, it is imperative for ACRA or IPTO\n                    to take proactive steps to ensure the immediate cessation of directorship(s) by\n                    such persons and not leave it to chance to discover the breaches at\n                        “critical” junctures in the\n                    bankruptcy administration.67     In my opinion, the following measures should\n                    beconsideredfor implementation:(a)     Currently, a list of persons\n                        adjudged to be bankrupt isalreadyprovided by\n                        IPTO to ACRA on a weekly basis. From this list, a check on the directorship\n                        status of persons adjudged bankrupt should be made by\n                    ACRA.(b)     The results\n                        of such searches should then be submitted to IPTO. I assume these steps\n                        could be completed in good time with the benefit of a computerised process\n                        and the use of identification numbers of persons adjudged to be a bankrupt.\n                        A letter should then be sent by IPTO to these persons to inform them of\n                        their obligation to file a notice of cessation in accordance with\n                        s 173(6A) of the Companies Act.(c)     If the notice of cessation is not filed within the\n                        requisite time, IPTO can consider taking appropriate steps, including\n                        sending a further reminder or inviting the Registrar of Companies to remove\n                        the person as a director from the registry or adopting the option of\n                        referring the matter to the CAD or any other relevant authority for\n                        consideration of further action.68     The rationale and importance of establishing a\n                    systemic process such as this is to prevent undischarged bankrupts from\n                    unwittingly committing the technical offence of remaining as a director on\n                    record of companies, even if these persons had played no role in the management\n                    of such companies. Equally, it would serve to ensure that public interest is\n                    protected to prevent third parties from dealing with companies in ignorance of\n                    the bankrupt status of its directors. The above measures are onlysuggestionsfor consideration as ultimately the\n                    feasibility of such a system is a matter for ACRA and IPTO to implement. Having\n                    said that, it is clear to me that it is not entirely satisfactory for the\n                    relevant authorities to find out that an offence has been committed only when\n                    the undischarged bankrupt is being reviewed for suitability for discharge. In\n                    this case, instead of beingdischargedfrom\n                    bankruptcy, to add to her woes, the appellant was insteadchargedand, worse still, faced with the possibility of a\n                    custodial sentence. This is indeed an unfortunate and ironic outcome given that\n                    “the underlying purpose of [these statutory provisions]... is to\n                    rationalise the law of insolvency and in general to enable those involved in\n                    business failureto get back on their feet as rapidly as may\n                        be consistent with fairness to their\n                        creditors”[note: 6].[note: 1]Statement of Facts at\n                [36].[note: 2]Statement of\n                                Facts at [15].[note: 3]Ibid.[note: 4]Appellant’s Skeletal Submissions\n                                dated 20 October 2010 at [16].[note: 5]See Statement of Facts at [26].[note: 6]Per\n                                Farquharson L. J. in the English Court of Appeal decision ofR v Sundranpillai Theivendran(1992) 13 Cr App R (S) 601 at p\n                            603.",
        "Post Script": "64     During the hearing of the appeal, I remarked\n                    that it was odd for the appellant to have remained on record as a director of\n                    NCPL for such a long time despite being made a bankrupt. I directed the\n                    Prosecution to file additional submissions to explain the working protocol\n                    between ACRA and the OA as regards removal of persons as directors who have been\n                    adjudged bankrupt. From the further submissions, the following picture has\n                    emerged: (a)     Prior to January 2001, the\n                        Registry of Companies and Businesses (“RCB”) (now known as\n                        ACRA) relied on the company to provide notification under s 173(6) of\n                        the Companies Act whenever a person was disqualified from acting as\n                        director. (b)     In January 2001, s 173 of the Companies Act was amended with the\n                        insertion of a new subsection 6A to enable the disqualified person to\n                        directly report the cessation if he has reasonable cause to believe that the\n                        company may not notify the RCB. (c)     Currently, IPTO would provide a list of persons against\n                        whom bankruptcy orders have been made to ACRA on a weekly\n                    basis. (d)     Checks on\n                        the status of a bankrupt are conducted at “critical” junctures in the course of bankruptcy\n                        administration such as when a complaint is received against a bankrupt or\n                        when the bankrupt is being reviewed for suitability for discharge. Where\n                        such checks or searches reveal that the bankrupt has remained a director,\n                        IPTO will then send a letter to the bankrupt to remind him or her that it is\n                        an offence to act as a director and that steps should be taken to file\n                        cessation notification within a stipulated time. (e)     IPTO would refer breaches of\n                        s 148 of the Companies Act to the Commercial Affairs Department\n                        (“CAD”) for investigation and\n                prosecution. 65     It is apparent from the description of the\n                    existing protocol that the cessation of a person acting as a director is heavily\n                    dependent on the initiative of the company or the undischarged bankrupt. As a\n                    result, if steps are not taken by either the company or the director to file\n                    cessation notification, it is possible that the undischarged bankrupt may remain\n                    a director in the company for years following the bankruptcy adjudication.\n                    Indeed, this was precisely the case in the present appeal where the appellant\n                    remained a director of NCPL for almost four years following her bankruptcy.\n                    Although not raised by the Prosecution, I have noted that in addition to the new\n                    subsection 6A, subsection 6B was introduced at the same time to empower the\n                    Registrar of Companies, on his own initiative, to remove the name of any person\n                    from the registry whom he has reason to believe is no longer qualified to act as\n                    a director by virtue of s 148 or s 155 of the Companies\n                Act. 66     From the additional submissions filed by the\n                    Prosecution, the unsatisfactory state of the existing arrangement presents a\n                    more compelling case for review. On 17 April 2003, the RCB issued a summons\n                    against the appellant for failing to lodge a change of address in respect of\n                    NLPL in 2002, an offence punishable under s 143(1) of the Companies Act. On\n                    19 February 2004, the RCB issued another summons against the appellant for\n                    failing to hold an Annual General Meeting and for failing to file annual returns\n                    in respect of NLPL and NCPL in 2002, offences punishable under s 175(4) and\n                    s 197(7) of the Companies Act. In the course of the appellant making\n                    representations for the charges to be withdrawn, ACRA found out that she was a\n                    bankrupt. On 25 July 2005, the charges against the appellant were formally\n                    withdrawn presumably because ACRA was satisfied that given her bankruptcy\n                    status, the appellant had in fact ceased to be actively involved in the\n                    management of NLPL and NCPL, as the charges were in respect of her failure, in\n                    her capacity as an officer of the companies, to hold an annual general meeting\n                    and her failure to file annual returns for NLPL and NCPL. Despite the fortuitous\n                    discovery of the appellant’s bankruptcy status, ACRA did not take any step\n                    to require the appellant to lodge the cessation notification though the\n                    Registrar of Companies is empowered to remove her as a director from the\n                    registry pursuant to s 173(6B) of the Companies Act. Instead, the discovery\n                    of her breaches came up under a different context during IPTO’s review of\n                    the appellant’s suitability for discharge from bankruptcy. Thereafter on\n                    24 June 2005, IPTO wrote to the appellant to advise her to take steps to\n                    resign as a director which she duly did on 4 July 2005. Notwithstanding her\n                    compliance with IPTO’s reminder to resign, the appellant was charged for\n                    acting as a director on 22 December 2009, almost five years later. There is\n                    no suggestion, from the facts provided by the Prosecution, that any letter was\n                    sent to the appellant to inform her to cease her directorship in NCPL, between\n                    the time when ACRA discovered her bankruptcy status to the time it was\n                    discovered by IPTO in June 2005. As I have explained in[32], the rationale for s 148 of the\n                    Companies Act is to safeguard the interest of the unsuspecting public from\n                    dealing with companies managed by directors who are undischarged bankrupts. The\n                    existing arrangement which depends on the initiative of the company and the\n                    undischarged bankrupt may not be adequate to achieve the intended objective of\n                    s 148 of the Companies Act. In my view, it is imperative for ACRA or IPTO\n                    to take proactive steps to ensure the immediate cessation of directorship(s) by\n                    such persons and not leave it to chance to discover the breaches at\n                        “critical” junctures in the\n                    bankruptcy administration. 67     In my opinion, the following measures should\n                    beconsideredfor implementation: (a)     Currently, a list of persons\n                        adjudged to be bankrupt isalreadyprovided by\n                        IPTO to ACRA on a weekly basis. From this list, a check on the directorship\n                        status of persons adjudged bankrupt should be made by\n                    ACRA. (b)     The results\n                        of such searches should then be submitted to IPTO. I assume these steps\n                        could be completed in good time with the benefit of a computerised process\n                        and the use of identification numbers of persons adjudged to be a bankrupt.\n                        A letter should then be sent by IPTO to these persons to inform them of\n                        their obligation to file a notice of cessation in accordance with\n                        s 173(6A) of the Companies Act. (c)     If the notice of cessation is not filed within the\n                        requisite time, IPTO can consider taking appropriate steps, including\n                        sending a further reminder or inviting the Registrar of Companies to remove\n                        the person as a director from the registry or adopting the option of\n                        referring the matter to the CAD or any other relevant authority for\n                        consideration of further action. 68     The rationale and importance of establishing a\n                    systemic process such as this is to prevent undischarged bankrupts from\n                    unwittingly committing the technical offence of remaining as a director on\n                    record of companies, even if these persons had played no role in the management\n                    of such companies. Equally, it would serve to ensure that public interest is\n                    protected to prevent third parties from dealing with companies in ignorance of\n                    the bankrupt status of its directors. The above measures are onlysuggestionsfor consideration as ultimately the\n                    feasibility of such a system is a matter for ACRA and IPTO to implement. Having\n                    said that, it is clear to me that it is not entirely satisfactory for the\n                    relevant authorities to find out that an offence has been committed only when\n                    the undischarged bankrupt is being reviewed for suitability for discharge. In\n                    this case, instead of beingdischargedfrom\n                    bankruptcy, to add to her woes, the appellant was insteadchargedand, worse still, faced with the possibility of a\n                    custodial sentence. This is indeed an unfortunate and ironic outcome given that\n                    “the underlying purpose of [these statutory provisions]... is to\n                    rationalise the law of insolvency and in general to enable those involved in\n                    business failureto get back on their feet as rapidly as may\n                        be consistent with fairness to their\n                        creditors”[note: 6].   [note: 1]Statement of Facts at\n                [36]. [note: 2]Statement of\n                                Facts at [15]. [note: 3]Ibid. [note: 4]Appellant’s Skeletal Submissions\n                                dated 20 October 2010 at [16]. [note: 5]See Statement of Facts at [26]. [note: 6]Per\n                                Farquharson L. J. in the English Court of Appeal decision ofR v Sundranpillai Theivendran(1992) 13 Cr App R (S) 601 at p\n                            603."
    }
}