{
    "case_title": "Seow Wei Sin\n      v\n      Public Prosecutor and another appeal",
    "ncitation": "[2010] SGHC 312",
    "coram": "Chao Hick Tin JA",
    "sections": {
        "Introduction": "1       This was a troubling case concerning a\n                    48-year-old National Service (“NS”) defaulter, Seow Wei Sin\n                    (“the Accused”). He pleaded guilty to an offence under\n                    s 32(1) of the Enlistment Act (Cap 93, 2001 Rev Ed) (“the\n                    Act”) of remaining outside Singapore from 26 May 1978 to\n                    25 August 2001 without a valid exit permit and the District Judge imposed a\n                    sentence of 18 months’ imprisonment (seePublic\n                        Prosecutor v Seow Wei Sin[2010] SGDC 191 (“the\n                    GD”)). Both the Accused (in Magistrate’s Appeal No 134 of 2010/01\n                    (“the Accused’s Appeal”)) and the Prosecution (in\n                    Magistrate’s Appeal No 134 of 2010/02 (“the Prosecution’s\n                    Appeal”)) appealed against the sentence. 2       After hearing the submissions of both parties in\n                    respect of both appeals, I was of the view, having regard to the particular\n                    circumstances of this case, that the imprisonment term imposed was manifestly\n                    excessive. Accordingly, I allowed the Accused’s Appeal and dismissed the\n                    Prosecution’s Appeal, and substituted the custodial sentence with a fine\n                    of $5,000. I now give my reasons.",
        "Background facts": "3       The Accused was born on 26 August 1961 in\n                    Singapore. In January 1963, when he was a year old, his entire family migrated\n                    to Malaysia and settled down in Dungun, Terengganu. Since then, he had not\n                    returned to Singapore to live on a long-term basis; he only visited relatives in\n                    Singapore for a few days on a few occasions between 1973 and 1975. In 1973, when\n                    the Accused was 12 years old, his father brought him back to Singapore to\n                    register for his National Registration Identity Card\n                    (“NRIC”). 4       On his behalf, his parents applied for Malaysian\n                    Permanent Resident (“PR”) status, which he obtained on\n                    22 February 1978. His NRIC was retained by the Malaysian authorities. A\n                    month later, his father sent a letter dated 25 March 1978 to the\n                    Central Manpower Base (“CMPB”) informing the latter of the\n                    family’s migration to Malaysia in January 1963. On 26 February 1978,\n                    when the Accused was 16 years and 6 months old, he became, under s 2 of the\n                    Act, a “person subject to [the] Act” and was required to report\n                    for registration for NS under s 3(1). On 7 October 1978, pursuant to\n                    s 3(1), the Accused was registered as an NS Overseas\n                Registrant. 5       Sometime in June 1979, CMPB wrote to the\n                    Accused’s father asking him to furnish a bond in order for an exit permit\n                    to be issued to the Accused so that he could remain in Malaysia for his studies.\n                    The next month, his father replied to CMPB that he was unable to furnish a bond\n                    as the Accused would not be returning to Singapore, and added that he would be\n                    applying for Malaysian citizenship for the Accused. On 9 July 1979, the\n                    Accused’s father was informed that the Accused should return to Singapore\n                    immediately as he was remaining outside Singapore without a valid exit permit.\n                    In August 1979, the father wrote back to CMPB stating that he was unable to\n                    furnish the bond and that the Accused would return to Singapore upon completion\n                    of his studies. 6       Unbeknownst to the Accused, on three occasions,\n                    in January 1988, April 1991 and July 1993, officers from CMPB conducted\n                    house visits at an address of an aunt of his. On those occasions, the aunt told\n                    the officers that the Accused was in Malaysia and had no intention to\n                    return. 7       Meanwhile, the Accused also set up his own\n                    family in Dungun, Terengganu. He got married in 1991 and had his first child in\n                    1993. He worked with his father at a petrol kiosk and held a few other jobs\n                    before setting up a small family-run pet shop in 2000. 8       In 1993, the Accused’s father, who had\n                    always been the one communicating with CMPB, passed away. Seven years later, on\n                    2 July 2000, the Immigration and Checkpoints Authority of Singapore\n                    (“ICA”) sent a letter to the Accused’s Malaysian address,\n                    informing him about the retention of his Singapore citizenship and advising him\n                    to liaise with CMPB. On 25 August 2001, the Accused turned 40 years old and\n                    ceased to be a “person subject to [the] Act”. 9       In 2008, the Accused attempted to apply for a\n                    Singapore passport. That was the first time he had to personally deal with the\n                    issues of his citizenship and NS liability. He corresponded with the ICA over\n                    this matter and on 26 July 2009 he returned to Singapore with a Document of\n                    Identity (as he had no passport) and reported to CMPB the next day. He was\n                    accordingly arrested and charged for remaining outside Singapore from\n                    26 May 1978 (with a three-month exemption under reg 25(1)(b)(i) of the Enlistment Regulations (Cap 93,\n                    Rg 1, 1999 Rev Ed)) to 25 August 2001 without a valid permit, an\n                    offence under s 32(1) of the Act.",
        "The District Judge’s grounds of decision": "10     Before the District Judge, the Prosecution\n                    pressed for a custodial sentence, submitting that a fine was not appropriate as\n                    this was a serious case of failure to perform NS liability. The Prosecution\n                    relied heavily on a statement made in Parliament by the Minister for Defence,\n                    Mr Teo Chee Hean (“the Minister”), on NS defaulters and on a\n                    proposal, which would later be submitted as a bill, to enhance the maximum fine\n                    which could be imposed by the court for an offence under the Act from $5,000 to\n                    $10,000 (seeSingapore Parliamentary Debates, Official\n                        Report(16 January 2006) vol 80 at cols 2004 - 2018 (Teo\n                    Chee Hean, Minister for Defence)) (“the Ministerial\n                    Statement”). 11     The District Judge also placed great emphasis\n                    on the Ministerial Statement, quoting extensively from it in his GD. First, he\n                    referred to the three fundamental principles undergirding the NS policy in\n                    Singapore highlighted by the Minister: national security, universality and\n                    equity. Secondly, he reiterated the Minister’s explanation of the tough\n                    stand that the Ministry of Defence (“Mindef”) takes against NS\n                    defaulters. Thirdly, he noted the fact that the Minister has indicated that his\n                    ministry, having reviewed the Act, would later propose, by way of a bill, to\n                    increase the maximum fine provided for in the Act from $5,000 to $10,000 and the\n                    illustrations provided by the Minister as to what “Mindef considers to be\n                    sentences appropriate to the nature of the offence or commensurate with its\n                    gravity” (at [6(c)] of the GD). As this latter portion of the Ministerial\n                    Statement requires closer examination, I reproduce it in full (see Ministerial\n                    Statement, at cols 2014 – 2015): I would like to provide some illustrations of what MINDEF considers to be\n                        sentences appropriate to the nature of the offence or commensurate with its\n                        gravity: (a)    Where the default period exceeds two years but the\n                            defaulter is young enough to serve his full-time and operationally ready\n                            NS duties in full, MINDEF will press for a short jail\n                        sentence. (b)    Where the defaulter has reached an age where he\n                            cannot serve his full-time NS in a combat vocation or fulfil his\n                            operationally ready NS obligations in full, a longer jail sentence to\n                            reflect the period of NS he has evaded may be appropriate. (c)    Where the defaulter has reached an age when he\n                            cannot be called up for NS at all, a jail sentence up to the maximum of\n                            three years may be appropriate. In all instances, we expect that the Court will take into account whatever\n                        aggravating or mitigating circumstances there may be in each case to\n                        determine the appropriate sentence. 12     The Prosecution submitted that the Accused\n                    fell under category (c) because he has reached an age where he could not be\n                    called up for NS at all and thus a custodial sentence was called\n                for. 13     While the District Judge was mindful of the\n                    fact that the Accused’s parents had taken him away to Terengganu at a\n                    tender age and that his father had dealt with all matters pertaining to his NS\n                    liability, he found that the Accused should have enquired about his NS liability\n                    as the obligation to perform NS in Singapore was “well-known and common\n                    knowledge” (at [8] of the GD). He also found it difficult to accept that\n                    the Accused was “completely in the dark” about his NS obligations;\n                    rather, the latter had preferred to let those obligations\n                    “by-pass” him until he reached the age when he could no longer be\n                    liable for NS. The District Judge felt that treating the Accused’s failure\n                    to perform NS lightly would undermine the fundamental principles of NS and\n                    “prejudice the fair and open [NS] system that has been build [sic] up over the years” (at [8]) and decided that\n                    a “deterrent sentence” of 18 months’ imprisonment was\n                    appropriate.",
        "The appeals": "14     On appeal, Counsel for the Accused submitted\n                    that the sentence was manifestly excessive, having regard to the sentencing\n                    precedents for similar offences where fines only were imposed. In particular,\n                    Counsel also pointed out that the District Judge erred in relying on the\n                    Ministerial Statement delivered in January 2006 in a case where the offence had\n                    been committed between 26 May 1978 and 26 August 2001, a period well before the\n                    statement was made. Instead, Counsel argued that the Accused “ought to be\n                    punished in the circumstances which then existed” (seeChota bin Abdul Razak v Public Prosecutor[1991]\n                    1 SLR(R) 501 (“Chota”) at\n                    [19]) and not take into account events which occurred\n                subsequently. 15     The Prosecution submitted that the Accused was\n                    a “serious defaulter” as he had failed to fulfil his NS liability\n                    for a period of 23 years and 3 months, which was one of the longest periods of\n                    default to have surfaced in the Singapore courts. As he had evaded his NS\n                    liabilities (both full-time and operationally ready service) completely, this\n                    was a case which fell within the range of conduct to be characterised as the\n                    most serious and therefore the maximum, or at least something close to the\n                    maximum, sentence permitted by law should be imposed.",
        "Ministerial statement": "16     The Ministerial Statement was delivered in\n                    Parliament on 16 January 2006 in response to the public outcry against\n                    the perceived leniency which was shown to the accused inPublic Prosecutor v Melvyn Tan Ban EngDistrict Arrest Case No\n                    14358 of 2005 (unreported) (“Melvyn\n                    Tan”). Melvyn Tan had left Singapore to pursue his music\n                    studies in England in 1969 when he was 12 but failed to return after his\n                    deferment period ended. He subsequently took up British citizenship in 1978 and\n                    was allowed to renounce his citizenship with effect from 21 July 1980. In\n                    2007 he returned to look after his ageing parents who had remained in Singapore,\n                    pleaded guilty to remaining outside Singapore without a valid exit permit\n                    (between 1 Sept 1977 and 20 July 1980) and was fined\n                $3,000. 17     In the Ministerial Statement, the Minister\n                    stated (at col 2013) that his ministry, following its review of the penalty\n                    regime under the Act, would later propose an increase of the maximum fine\n                    provided for in the Act from $5,000 to $10,000. In particular, Mindef had also\n                    considered the adequacy of the maximum three-year custodial sentence and the\n                    maximum fine, as well as the need for a mandatory minimum jail sentence. It\n                    concluded that there was no need to effect changes to the custodial sentence\n                    prescribed in the Act. It is worth noting that the Minister stated explicitly\n                    (at col 2014) that Mindef would “ask the prosecutor to press for a jail\n                    sentence inserious casesof NS defaulters, and\n                    explain why we consider a jail sentence appropriate in a particular case”\n                    [emphasis added]. He explained that (at col 2014): Serious cases include those who default on their full-time National\n                        Service responsibilities for two years or longer from the time they were\n                        required to register or enlist, or from the time their exit permits expired\n                        for those granted deferment, whichever is later. We believe that it is in\n                        the public interest that such NS defaulters face a jail sentence, unless\n                        there are mitigating circumstances. The Minister then laid out three specific illustrations of sentences\n                    which Mindef considered to be appropriate to the nature of the offence or\n                    commensurate with its gravity (see[11]above). 18     It is certainly within the Minister’s\n                    province to say that he would “ask the prosecutor” to press for a\n                    custodial sentence in “serious cases of NS defaulters”. However,\n                    this does not mean that the court will, as a matter of course, agree with either\n                    Mindef’s definition of “serious cases” or the\n                    Prosecution’s classification of any individual case as a\n                    “serious” one. After all, the courts have the “sole\n                    constitutional remit to decide on the guilt and sentencing of all individuals\n                    who violate the laws of Singapore” (Fricker Oliver v\n                        Public Prosecutor and another appeal and another matter[2010] SGHC 239 at [2]). 19     What effect then would the Ministerial\n                    Statement have on the sentencing process? Under s 9A(1) of the\n                    Interpretation Act (Cap 1, 2002 Rev Ed) (“Interpretation\n                    Act”), a purposive interpretation of a statutory provision is preferred\n                    to an interpretation that would not promote the purpose or object of that\n                    statute. It is further stated in ss 9A(2) and (3) that: (2)    Subject to\n                            subsection (4), in the interpretation of a provision of a written\n                            law, if any material not forming part of the written law iscapable of assisting in the ascertainment of\n                                the meaning of the provision, considerationmaybe given to that material\n                            — (a)    toconfirmthat the meaning of\n                                the provision is the ordinary meaning conveyed by the text of\n                                the provision taking into account its context in the written\n                                law and the purpose or object underlying the written law;\n                                or (b)    toascertain the meaning of the provision when— (i) the provision isambiguous or\n                                    obscure; or (ii) the ordinary meaning conveyed by the text of the\n                                provision taking into account its context in the written law\n                                and the purpose or object underlying the written law leads to a\n                                result that is manifestly absurd or unreasonable. (3)    Without limiting\n                            the generality of subsection (2), the material that may be\n                            considered in accordance with that subsection in the interpretation\n                            of a provision of a written law shall include — ... (c)    the speech made in Parliament by\n                                a Minister on the occasion of the moving by that Minister of a\n                                motion that the Bill containing the provision be read a second\n                                time in Parliament; (d)    any relevant material in any\n                                official record of debates in Parliament; ... [emphasis added] 20     The clear wording of s 9A of the\n                    Interpretation Act indicates that the court ispermitted, butnot obliged, to\n                    refer to material extrinsic to the text of a statute, such as Parliamentary\n                    debates or statements made by a Minister in Parliament, if such material is\n                    “capable of assisting in the ascertainment of themeaning” [emphasis added] of the text. That is the litmus\n                    test for the relevance of such extrinsic material. It is not necessary for there\n                    to be ambiguity in the plain meaning of the statutory provision before reference\n                    may be had to such material (seePublic Prosecutor v Low Kok\n                        Heng[2007] 4 SLR(R) 183 at [46]) 21     Next, even if the extrinsic material passes\n                    the litmus test, the court must be mindful to confine the actual use of the\n                    material to construing the ordinary meaning of the statutory provision in\n                    question. Section 9A(2) stipulates two particular purposes for which\n                    extrinsic material may be referred to: (a)     toconfirmthe ordinary meaning of a particular statutory\n                        provision; and (b)     toascertainthe meaning of a provision when\n                        it is obscure and ambiguous or when the ordinary meaning of the text in the\n                        light of its context and purpose leads to a manifestly absurd or\n                        unreasonable result. Thus, it is clear that under no\n                    circumstances should extrinsic material take the place of the actual words used\n                    in the statute. Such material can only be aids to interpretation. It should not\n                    be used to give the statute a sense which is contrary to its express text. In\n                    this regard, the following words of caution expressed by Mason CJ, Wilson\n                    and Dawson JJ inRe Bolton; Ex parte Beane(1987) 162 CLR 514 at 518 are pertinent: The words of a Minister must not be substituted for the\n                            text of the law. Particularly this is so when the intention\n                        stated by the Minister but unexpressed in the law is restrictive of the\n                        liberty of the individual. It is always possible that through oversight or\n                        inadvertence the clear intention of the Parliament fails to be translated\n                        into the text of the law. However unfortunate it may be when that happens,\n                        the task of the Court remains clear.The function of the\n                            Court is to give effect to the will of Parliament as expressed in the\n                            law. [emphasis added] Writing extra-judicially, Bryson J of the Supreme Court of New\n                    South Wales made the following germane observations on s 15abof the Australian Acts Interpretation Act\n                    1901 (Cth), which isin pari materiaewith our\n                    ss 9A(2) and (3) (see Mr Justice Bryson, “Statutory\n                    Interpretation: An Australian Judicial Perspective” (1992)\n                    13 Statute L Rev 187 at 202): Whether material is capable of assisting in ascertainment of the meaning\n                        of a provision depends on the nature of the exercise of ascertaining the\n                        meaning of a provision. There is room ... to start not only with the\n                        assumption that words mean what they say, but also with the assumption that\n                        the legislature said everything it wanted to say.The\n                            exercise can never really be otherwise than ascertaining the meaning of\n                            what they did say. There is no room for supplementing what the\n                            legislature said. Every use of extrinsic material must return to the\n                            starting point of ascertaining the meaning of the provision.\n                        To my mind, section 15abwas not\n                        intended to make any deep change in the nature of that process. It did\n                        nothing to alter the commitment of courts to ascertaining the meaning of the\n                        provision which the legislature has made. [emphasis added] 22     In order to ascertain whether there is a need\n                    to refer to the Ministerial Statement and what utility the Ministerial Statement\n                    would have on sentencing by the court, I should start by examining the actual\n                    words of the sections in the Act defining the offence and prescribing the\n                    punishment. The Accused was charged with an offence under s 32(1) which\n                    states: Exit permits. 32. —(1) A person subject to this Act\n                        who has been registered under section 3 or is deemed to be registered or is\n                        liable to register under this Act, or a relevant child, shall not leave\n                        Singapore or remain outside Singapore unless he is in possession of a valid\n                        permit (referred to in this Act as exit permit) issued by the proper\n                        authority permitting him to do so. The punishment for offences under the Act is governed by s 33.\n                    That section was amended with effect from 8 May 2006 to reflect the\n                    increased maximum fine for offences under the Act. As the Accused was charged\n                    with an offence that was completed before the amendment came into force, it is\n                    the pre-amendment version of s 33 that applied in this case, and it\n                    provided: Offences. 33.    Any person within\n                            or outside Singapore who — (a)    fails to comply with any order or notice\n                                issued under this Act; (b)    fails to fulfil any liability imposed on him\n                                under this Act; (c)    fraudulently obtains or attempts to obtain\n                                postponement, release, discharge or exemption from any duty under\n                                this Act; (d)    does any act with the intention of unlawfully\n                                evading service; (e)    gives the proper authority or any person\n                                acting on his behalf false or misleading information;\n                            or (f)    aids, abets or counsels any other person to\n                                act in the manner laid down in paragraph (a), (b), (c), (d) or\n                                    (e), shall be guilty of an offence and shall be liable on conviction to a fine\n                        not exceeding $5,000 or to imprisonment for a term not exceeding 3 years or\n                        to both. 23     The prohibition against a person subject to\n                    the Act (ie, a male citizen of Singapore who is\n                    not less than 16 years and 6 months of age and not more than 40 years of age)\n                    remaining outside of Singapore without a valid exit permit under s 32(1)\n                    seems reasonably clear. In this case, there was no dispute as to the application\n                    of that prohibition to the Accused. He had clearly remained outside Singapore\n                    for 23 years and 3 months without an exit permit. He admitted as much. His\n                    liability to suffer punishment under s 33 was also equally clear and\n                    unambiguous. Thus, he was guilty of an offence under s 32(1) and liable to\n                    be punished under s 33(b) of the Act by a\n                    fine of up to $5,000, or imprisonment of up to 3 years, or to both. There can be\n                    no argument that the ordinary meaning of the words in the two provisions is\n                    plain. 24     It must be recalled that the Ministerial\n                    Statement was made in the context of Mindef’s then imminent proposal to\n                    increase the maximum fine prescribed in s 33, and not for the purpose of\n                    explaining the scope of either of those provisions. Of course, it also set out\n                    Mindef’s thinking as to the sentence it considered appropriate in what it\n                    regarded as serious cases. The Minister even stated that where “a\n                    defaulter has reached an age when he cannot be called up for NS at all, a jail\n                    sentence up to the maximum of three years may be appropriate”. However,\n                    as a matter of principle, unless such thinking is incorporated in the Act itself\n                    it should notipso factobe followed by the court\n                    as a matter of course. Otherwise, it would mean that punishment imposed by the\n                    court would be governed by ministerial policy. In determining the appropriate\n                    punishment in each case, the court must not only consider all the circumstances,\n                    including mitigating circumstances, but also the objectives of the law, the\n                    prevalence of such offences and the need to curb them. The Minister obviously\n                    recognised this when he specifically stated that henceforth for serious cases\n                    Mindef would ask the prosecutor to “press for a jail sentence” and\n                    explain why a jail sentence was appropriate. As far as the applicable law as to\n                    the punishment for the offence was concerned, it was clear: the court could\n                    punish an accused with a fine of up to $5,000 or imprisonment of up to three\n                    years or both. Under the Act, no restriction was placed as to how the court\n                    should exercise its sentencing power. Significantly, I also noted that in the\n                    Ministerial Statement, it was stated (at col 2014) that Mindef did\n                    “not consider it necessary at this time to seek a minimum mandatory jail\n                    sentence for the Enlistment Act offences, as the circumstances of the cases vary\n                    widely”. In any event, the proposed increase in the maximum fine, which\n                    was enacted into law in May 2006, would not apply to the Accused, as his offence\n                    was committed before this amendment to the law was made. 25     The conventional approach to sentencing in\n                    Singapore is always to look first at the relevant sentencing precedents\n                    available for similar offences, then consider the mitigating and aggravating\n                    circumstances pertinent to the facts of the instant case, before arriving at a\n                    sentence that is fair and just in the light of all the relevant considerations\n                    (seePublic Prosecutor v UI[2008]\n                    4 SLR(R) 500 at [22]). The circumstances of each case are of paramount\n                    importance in determining the appropriate sentence and the sentence imposed must\n                    fit the offence. No two cases are identical and the unique facts of each case\n                    must be given due weight.",
        "Sentencing precedents": "26     Prior to the amendments to the Act with effect\n                    from 8 May 2006, NS defaulters who remained overseas without a valid exit\n                    permit were punished with fines rather than with custodial sentences. After the\n                    2006 amendments came into force, the Prosecution began pressing for custodial\n                    sentences for such defaulters. Counsel for the Accused contended that the\n                    sentencing precedents relating to offences committedafterthe 2006 amendments were not relevant and should not be\n                    relied upon in the present case to determine the appropriate sentence because\n                    the Accused should only be punished in the circumstances and in accordance with\n                    the law which existed at the time of his offence. I agreed. The Accused\n                    committed the offence 5 years before the amendments were enacted. InChota’s case, the court accepted the argument made\n                    on behalf of the accused that the district judge in that case should not have\n                    taken into account the amendments to the Misuse of Drugs Act (Cap 185,\n                    1985 Rev Ed) under which the punishment for trafficking in cannabis was\n                    enhanced, and held that (at [19]): The accused ought to be punished in the circumstances which then existed\n                        and in accordance with the legislation then in force, and it is not correct\n                        to take into account subsequent legislation. The learned district judge\n                        ought not to have been influenced, as he appears to have been influenced, by\n                        the subsequent legislation enhancing the punishment for the offence. 27     Counsel for the Accused referred to cases in\n                    which fines were imposed on accused persons who had remained outside Singapore\n                    without a valid exit permit for periods of more than 10 years. InPublic Prosecutor v Ang Tiam Huat and Ho Fui ShiongMagistrate’s Appeal No 345 of 1992 (unreported), the accused persons had\n                    remained outside Singapore for 15 years. On appeal, their 18-month imprisonment\n                    sentences were reduced to a fine of $3,000 each. Similarly, inPublic Prosecutor v Shaik Zaman s/o Rashid and Abu Zama s/o M\n                        RashidMagistrate’s Appeal No 530 of 1992 (unreported), a\n                    $3,000 fine was imposed on each of the accused persons who had remained outside\n                    Singapore without a valid exit permit for 12 years. 28     In a more recent case,Public Prosecutor v Shanthakumar s/o BannirchelvamMagistrate’s Appeal No 52 of 2008 (unreported), the accused had left\n                    Singapore for Australia when he was eight years old and acquired Australian\n                    citizenship in June 2005 when he was 17 years old. He returned to Singapore when\n                    he was 19 years old after several unsuccessful requests for deferment and was\n                    charged with the offence of remaining outside Singapore for one year and four\n                    months (8 May 2006 to 17 September 2007) without a valid exit permit.\n                    One charge of remaining outside Singapore from 7 August 2005 to 7 May\n                    2006 was taken into consideration for the purposes of sentencing.\n                    Notwithstanding that the charge proceeded with was for an offence to which the\n                    amendments to the Act applied, on appeal by the Public Prosecutor against a\n                    sentence of six months’ administrative probation imposed by the district\n                    court, the High Court only imposed a $1,500 fine instead. 29     Indeed, the fact that before 2006 the courts\n                    had generally not imposed a custodial sentence for a one-time defaulter under\n                    the Act was alluded to in the Ministerial Statement (at col 2012) and here\n                    I quote: Of note is that the High Court had, in a 1993 case, reduced the sentences\n                        of two NS defaulters – two brothers – from eight months’\n                        imprisonment to a fine of $3,000 on appeal. This was an unusual case where\n                        it could be said that there were mitigating circumstances. Since then the\n                        Subordinate Courts have been using this case as a guideline, and not imposed\n                        a jail sentence on single-instance defaulters, no matter how long the\n                        default period was. The courts have imposed jail sentence [sic] on single instance defaulters only in cases\n                        where there are aggravating factors, such as repeated Enlistment Act\n                        offences, past criminal records, concurrent charges of other civil offences,\n                        and absconding during investigation. 30     However, the Prosecution relied on several\n                    cases of offences under the Act where custodial sentences were imposed, of which\n                    three cases pertained to offences prosecuted under the pre-amendment version of\n                    the Act. InPublic Prosecutor v Chia Shu SianDistrict Arrest Case No 58753 of 2004 (unreported), the accused was sentenced to\n                    two months’ imprisonment for an offence of remaining in Malaysia for nine\n                    months without a valid exit permit. That accused person had already completed\n                    his full time NS; he had gone to Malaysia on a valid exit permit but stayed on\n                    after the expiry of that permit. The circumstances under which the accused\n                    person stayed on in Malaysia were wholly different from those in the instant\n                    case. InPublic Prosecutor v Ng Kwok Fai[2004] SGDC 232 (“Ng Kwok\n                    Fai”), the accused had failed to report as required under a\n                    further reporting order to CMPB for documentation and fitness examination and\n                    was sentenced to three months’ imprisonment. InLim Sin\n                        Han Andy v Public Prosecutor[2000] 1 SLR(R) 643\n                        (“Lim Sin Han Andy”), the\n                    accused was absent without leave from his place of duty while serving his\n                    full-time NS in the Singapore Civil Defence Force. His appeal against his\n                    18-month custodial sentence was dismissed. In each of these three cases, the\n                    offence was committed by the accused with full knowledge that he was infringing\n                    the law. Moreover, the offences inNg Kwok FaiandLim Sin Han Andywere not even similar to the\n                    one that the present Accused was being charged with. 31     The Prosecution also referred to three other\n                    cases which were prosecuted under the post-amendment version of the Act. InPublic Prosecutor v Amit Rahul ShahDistrict\n                    Arrest Case No 26717 of 2008 (unreported), the 22-year-old accused person\n                    pleaded guilty to a charge of remaining outside Singapore without a valid exit\n                    permit for four years and eight months and had another charge for the same\n                    offence pertaining to the period from 8 May 2006 to 3 January 2007\n                    taken into consideration for sentencing purposes. He had migrated to India with\n                    his family when he was a year old and had remained there after the expiry of his\n                    Singapore passport as his parents were unable to furnish the bank guarantee or\n                    find two Singaporean sureties required to extend the validity of his passport.\n                    He was sentenced to three months’ imprisonment and did not appeal against\n                    his sentence. In the cases ofPublic Prosecutor v Jaya Kumar\n                        s/o KrishnasamyDistrict Arrest Case No 29986 of 2009\n                    (unreported) andPublic Prosecutor v Xu JianlongDistrict Arrest Case No 46958 of 2008 (unreported), the accused persons failed\n                    to report for NS registration and enlistment respectively. They were sentenced\n                    to six weeks’ and three months’ imprisonment respectively. However,\n                    both accused persons were in Singapore when they knowingly committed the\n                    offences. These two cases were clearly different and were not useful as\n                    precedents for the present case.",
        "Aggravating and mitigating factors": "32     The Prosecution submitted that as the period\n                    of default of 23 years and 3 months in this case was one of the longest that had\n                    surfaced in the Singapore courts, and, as a result of the long period of default\n                    the Accused had evaded his NS duties entirely, this offence fell within the\n                    range of conduct which “characterises the most serious instances of the\n                    offence in question” (seeSim Gek Yong v Public\n                        Prosecutor[1995] 1 SLR(R) 185 (“Sim Gek Yong”) at [13]), justifying the\n                    imposition of the maximum or close to the maximum custodial sentence prescribed\n                    for the offence under the Act. 33     The seriousness of an offence under the Act\n                    should not be determined purely on the length of period of default. This would\n                    be quite unjust. I would have thought equally important, if not more so, must be\n                    the circumstances surrounding the default. Indeed, all the circumstances must be\n                    considered. InSim Gek Yong, Yong Pung How CJ\n                    pointed out (at [13]) that identifying the range of conduct which characterises\n                    the most serious instances of the offence in question necessarily involves\n                    “consideration both of the nature of the crime and of the circumstances\n                    of the criminal”. In the present case, it was certainly relevant that the\n                    period of default was a long one and that the Accused had evaded his NS\n                    obligations entirely. These factors pertained to the nature of the crime. They\n                    formed but one part of the consideration. The other equally important part, if\n                    not the more important part, related to the circumstances of the criminal, and,\n                    in turn, the offence. This directly concerned the question of\n                    culpability. 34     At this juncture, it would be necessary to\n                    look closely at the circumstances surrounding the Accused’s offence. He\n                    left Singapore at the very young age of one when his parents decided to migrate\n                    to Dungun, Terengganu. Understandably, at that age he could not have had any\n                    recollection of Singapore. To him, home would have been Dungun, a place where he\n                    was brought up and where he received his education. According to a website\n                    promoting tourism in Terengganu, Dungun is “nothing more than a coastal\n                    quite [sic] fishing town in the east coast of\n                    Peninsular Malaysia” and the town centre consists of a few rows of old\n                    shop houses. (See <http://www.terengganutourism.com/city_town_dungun.htm>,\n                    last accessed 19 October 2010.) Since then, he got married there and raised\n                    a family with five children. He eked out a living by running a family pet shop\n                    business. Clearly, other than being the place of birth, he had no connection to\n                    Singapore. He did not enjoy any of the socio-economic benefits which a Singapore\n                    citizenship accorded to its nationals. 35     According to his plea-in-mitigation, the\n                    Accused recalled returning to Singapore when he was 12 years old to register for\n                    his NRIC. When he was 18 years old, his father informed him that he would be\n                    writing to the Singapore government to deal with his NS issue. The Statement of\n                    Facts revealed that it was the Accused’s late father who dealt with the\n                    authorities in Singapore in respect of the Accused’s NS liability.\n                    According to the Statement of Facts, in July 2000, a letter from ICA was sent to\n                    the Accused’s Malaysian home address informing him of the retention of his\n                    Singapore citizenship and advising him to liaise with CMPB but by then he was\n                    already 39 years old. The Statement of Facts did not indicate whether he had\n                    responded to that letter. It was quite likely that owing to the fact that his\n                    father was the one who had handled issues relating to his NS liability, he did\n                    not know how to respond at that point. Only some eight years later in 2008, the\n                    Accused attempted to apply for a Singapore passport. That was the first time the\n                    NS issue surfaced starkly to him and he had to deal with it\n                squarely. 36     Without a doubt, NS is vital to the security\n                    of Singapore. InLim Sin Han Andy, Yong CJ\n                    dismissed the appeal against an 18-month imprisonment sentence on the ground\n                    that (at [18]) “[t]he deterrence of the individual offender, and others\n                    who might be tempted to commit the offence” was necessary “to\n                    advance the public interest” in cases relating to NS. Yong CJ was\n                    there dealing with a case in which a full-time national serviceman was absent\n                    without leave after serving seven months of NS in the Civil Defence Force. In\n                    that case, there was clearly a deliberate decision on the part of the accused to\n                    evade his NS liability and shirk his responsibilities as a Singapore citizen to\n                    the nation. He remained in Singapore throughout and had deliberately stayed away\n                    from the Civil Defence Force to work, purportedly to support his\n                family. 37     To my mind, the three fundamental principles\n                    underpinning the NS policy in Singapore,viz,\n                    national security, universality and equity, did not apply to the Accused.\n                    Although he was a Singapore citizen by virtue of his birth here, he could not be\n                    said to be a Singaporean in any other respect. He did not live in Singapore\n                    other than for the first year of his life. He never enjoyed any of the\n                    privileges and benefits of his citizenship; he never even received or used a\n                    Singapore passport. It was clear that he did not leave Singapore in order to\n                    evade his NS liability. He had no choice in the matter at all as the family had\n                    decided to migrate to Malaysia. Given his circumstances, he would have had no\n                    reason to return to Singapore as he had no links here. His Singapore NRIC was\n                    surrendered to the Malaysian authorities when he obtained his Malaysian PR\n                    status in 1978. To him, his father had resolved his NS liability issue with the\n                    authorities here; there was nothing left for him to be concerned with on that\n                    issue. Comparing the present case to the circumstances inMelvyn Tan, the Accused was certainly less culpable. Melvyn Tan\n                    led an arguably privileged life here in Singapore until he was 12 years old.\n                    Fortunately for Melvyn Tan, the policies regarding renunciation of citizenship\n                    then allowed him to renounce his Singapore citizenship in 1980 after he had\n                    attained UK citizenship in 1978. The Accused here had in fact applied for\n                    Malaysian citizenship but his application was rejected. If he had obtained\n                    Malaysian citizenship, he would no doubt have sought to renounce his Singapore\n                    citizenship. I should further add that theMelvyn\n                        Tancase was in line with precedents as alluded to by the\n                    Minister (see quote at[29]above), as the\n                    offence was committed long before the Ministerial Statement and the 2006\n                    amendment. 38     On the facts of this case, I was also not\n                    persuaded that a deterrent sentence was called for. As the Accused is no longer\n                    of an age where he can commit a similar offence in future, specific deterrence\n                    would not apply in this case (seePublic Prosecutor v\n                        Loqmanul Hakim bin Buang[2007] 4 SLR(R) 753 at [29]).\n                    As for general deterrence, I did not think that this was a case that should be\n                    used to send an uncompromising message to all “like-minded”\n                    offenders. While the period of default was long, it must be viewed in the light\n                    of all the circumstances alluded to earlier. The facts of this case were not of\n                    the usual kind,eg, persons who lived and were\n                    brought up substantially in Singapore seeking to evade their NS duties. It could\n                    hardly be characterised as the most serious instance of NS default. Bearing in\n                    mind the facts and the applicable precedents, I was of the opinion that this\n                    case did not warrant a custodial sentence. I would emphasise that this was not\n                    to say that cases of NS default should be treated lightly. But the severity of\n                    the sentence in each case must be tailored to fit the culpability of the\n                    offender and the seriousness of the circumstances surrounding the commission of\n                    the offence. To the Accused’s mind, it seemed that his father had sorted\n                    things out with the Singapore authorities regarding his NS duties. As stated\n                    earlier, his Singapore NRIC had already been taken and retained by the Malaysian\n                    authorities when his father applied for PR status in Malaysia on his behalf. He\n                    had no reason to think that he was a fugitive of the law in\n                Singapore. 39     Thus, while the period of defaultper semight be long, his degree of culpability for the\n                    same was far from high. All factors considered, I found that the custodial\n                    sentence of 18 months was manifestly excessive and that a fine of $5,000, being\n                    the maximum fine imposable by the court, should suffice.",
        "Conclusion": "40     In the result, I allowed the Accused’s\n                    Appeal by substituting the 18 months’ imprisonment term with a fine of\n                    $5,000, in default two months’ imprisonment. The Prosecution’s\n                    Appeal was accordingly dismissed."
    }
}