{
    "case_title": "Vorobiev Nikolay\n      v\n      Lush John Frederick Peters and others",
    "ncitation": "[2010] SGHC 290",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "Introduction": "1       The two applications before me relate to whether\n                    the plaintiff’s solicitors, Drew & Napier LLC (“Drew &\n                    Napier”) are conflicted from acting for the plaintiff in the present suit\n                    on the grounds that they had earlier acted for the defendants in same or related\n                    matters and therefore should be restrained from acting as counsel for the\n                    plaintiff. For the reasons that follow, I allow the defendants’\n                    application to restrain Drew & Napier from doing so.",
        "The plaintiff’s claim": "2       The plaintiff Nikolay Vorobiev brought this suit\n                    against the defendants John Frederick Peters Lush (“Lush”),\n                    Francois Ostinelli (“Ostinelli”) and Alexander Novoselov\n                    (“Novoselov”) on the grounds that the defendants made, or\n                    conspired to make, fraudulent misrepresentations to him to induce him into\n                    entering an agreement for the purchase of 20% of the shares in Stainby Overseas\n                    Limited (“Stainby”) (a company incorporated in British Virgin\n                    Islands (“BVI”)) which held the shares in Petroval Pte Ltd\n                    (“PPL”). 3       The plaintiff claimed that he and the defendants\n                    were directors of PPL. Subsequently, around February 2006, Artem Zakharov\n                    (“Zakharov”) contacted the plaintiff who then agreed to buy 20%\n                    share in PPL for US$3,810,000. The plaintiff was under the impression that\n                    another company Everon held the shares in PPL through Stainby. Pursuant to the\n                    agreement, on 8 May 2006, Boyce (a BVI company solely owned by the\n                    plaintiff) was issued 20% shareholding in Stainby, and on\n                    19 June 2006, Stainby became the sole shareholder of PPL. The three\n                    defendants and Zakharov, through their respective nominee companies, also each\n                    held 20% shareholdings in Stainby. Around late May or early June 2006, the\n                    parties (the plaintiff, the three defendants and Zakharov) agreed that they\n                    would each provide loans of US$2,000,000 to Stainby for the purpose of Stainby\n                    making a loan of US$10,000,000 to PPL. Following this, around\n                    26 June 2006, Stainby and PPL entered into a loan arrangement. Around\n                    September 2006, the same parties again agreed they would each provide\n                    another loan of US$1,000,000 to Stainby for the purpose of Stainby then making a\n                    loan of US$5,000,000 to PPL. Following this, around 27 September 2006,\n                    Stainby and PPL entered into another loan arrangement. 4       The plaintiff further claimed that on\n                    7 December 2007, another company Petroval SA (“PSA”)\n                    commenced proceedings in BVI against the defendants, their nominee companies,\n                    and Boyce, for a declaration that Stainby held the shares in PPL on trust for\n                    PSA, and for an account of profits. On 15 February 2008, PSA commenced\n                    proceedings in Singapore against the defendants seeking the same reliefs. Around\n                    10 September 2009, the parties to the Singapore proceedings\n                    settled. 5       The bases of the plaintiff’s claim against\n                    the defendants are as follows. Firstly, the plaintiff alleged that the\n                    defendants fraudulently misrepresented that they were the ultimate beneficial\n                    owners of the shares in PPL or had the authority of the beneficial owners to\n                    deal with the PPL shares, when in fact the shares were held by Stainby on trust\n                    for PSA (and therefore Stainby did not have the beneficial ownership to PPL).\n                    Secondly, the plaintiff alleged that the defendants fraudulently misrepresented\n                    that the purchase price paid by him for PPL shares was based on 20% of the price\n                    payable by the defendants to Everon for its beneficial shareholding in PPL. The\n                    plaintiff alleged that, unknown to him, Everon reduced the purchase price\n                    payable to it by the defendants for its beneficial interest in PPL such that the\n                    defendants did not have to make any payment to Everon and would only have to\n                    declare all of PPL’s monies at that time as dividends to Stainby (and\n                    ultimately to Everon). Thirdly, the plaintiff alleged that the defendants\n                    fraudulently misrepresented that neither Petroval Bunkering International\n                    (“PBI”) nor PPL will have any assets or liabilities at the time he\n                    acquires his 20% shareholding in PPL, although in fact PBI had liabilities\n                    amounting to US$5,000,000 at the material time. The plaintiff alleged that as a\n                    consequence of the defendants’ misrepresentations, he suffered losses\n                    amounting to US$3,810,000 for the purchase of the 20% stake in PPL, and\n                    US$3,000,000 for the shareholder loans made. In the alternative, the plaintiff\n                    alleged that the defendants wrongfully and dishonestly and with the intent to\n                    injure him, conspired and agreed together to make the representations to induce\n                    him to purchase a stake in Stainby, and to make the loans. 6       As the action against the first defendant has\n                    currently been stayed, and service on the second and third defendants have been\n                    set aside (see below), the defendants have not entered their\n                defence.",
        "Registrar’s Appeal No 154 of 2010": "7       On 30 September 2009, Lush filed an\n                    application to stay the proceedings against him in favour of Switzerland. The\n                    stay was granted by assistant registrar Crystal Tan but is now the subject\n                    of appeal (registrar’s appeal no 19 of 2010\n                    (“RA19/2010”)) and judgment has been reserved. On\n                    27 October 2009, the plaintiff obtained an order for service of the\n                    writ and statement of claim out of jurisdiction on Ostinelli and Novoselov, and\n                    they were duly served. However, that order for service out of jurisdiction was\n                    set aside by assistant registrar Denise Wong on 5 April 2010. That\n                    decision is the subject of the appeal before me in registrar’s appeal\n                    no 154 of 2010 (“RA154/2010”). However, in view of the appeal\n                    against the stay of proceedings against Lush in RA19/2010, I was of the view\n                    that it would be expedient to await the outcome of that appeal. I therefore\n                    adjourned RA154/2010 to await the outcome of RA19/2010.",
        "The applications before this court": "8       The defendants applied for the plaintiff’s\n                    solicitor, Drew & Napier, to be restrained by way of an injunction from\n                    acting as counsel for the plaintiff in the present suit and/or in any\n                    applications and/or appeals arising out of or made in connection with the\n                    present suit and/or giving legal advice to and/or legally representing in any\n                    other way the plaintiff in connection with this suit. The plaintiff applied for\n                    the defendants’ application to be struck out. 9       The basis of the defendants’ application\n                    is r 31(1) of the Legal Profession (Professional Conduct Rules)\n                    (Cap 161, r 71, 2000 Rev Ed) (“PCR”), which reads\n                    as follows: Not to act against\n                            client 31. —(1) An advocate and solicitor who has acted for a client in a\n                        matter shall not thereafter act against the client (or against persons who\n                        were involved in or associated with the client in that matter) in the same\n                        or any related matter. (2) For the purposes of paragraph (1), the term “client”\n                        includes a client of the law practice of which the advocate and solicitor is\n                        a partner, a director, an associate or an employee, whether or not he\n                        handles the client’s work. (3) Paragraph (1) shall apply even where the advocate and solicitor\n                        concerned becomes a member of a different law corporation. (4) Nothing herein shall preclude a law practice or law\n                        corporation from acting against a party in a matter provided that\n                        — (a) the law practice or law corporation\n                            has not previously acted for the party (or for persons who were involved\n                            in or associated with the party in that matter) in the same or any\n                            related matter; and (b) any advocate and solicitor of the\n                            law practice or law corporation who has previously acted for the party\n                            in the same or related matter neither acts nor is involved in that\n                            matter or related matter in any way whatsoever and does not otherwise\n                            disclose any confidential information relating to the matter or the\n                            party to any other member of the law practice or law corporation. 10     The defendants contended that r 31(1) of\n                    the PCR displaced the common law position on this issue. It was therefore an\n                    absolute prohibition against an advocate and solicitor acting against his former\n                    client in the same or related matter, and was not contingent on the advocate or\n                    solicitor having acquired confidential information from the client and/or that\n                    there be a risk of disclosure of such confidential information. For this\n                    proposition, the defendants relied on Pinsler’s observation inEthics and Professional Responsibility: A Code for the Advocate and\n                        Solicitor(Singapore: Academy Publishing, 2007) andLaw Society of Singapore v Seah Li Ming Edwin and\n                        another[2007] 3 SLR(R) 401. The defendants claimed\n                    that Drew & Napier had previously acted for them in the following matters\n                    (“the previous retainers”): (a)     The defendants’\n                        shareholders’ dispute with Everon which ultimately resolved through\n                        the defendants’ purchase of Everon’s shares held in\n                        Stainby. (b)     Negotiations with Everon on the purchase of Everon’s shares in\n                        Stainby and the terms of such purchase. (c)     Shareholders’ loan of US$10m from Stainby\n                        to PPL and the loan agreement dated 26 June 2006 between Stainby\n                        and PPL. The defendants contended that the previous\n                    retainers concern matters which are “same or related” to the\n                    present proceedings, and therefore, r 31(1) of PCR provided an absolute\n                    prohibition against Drew & Napier from acting for the plaintiff against the\n                    defendants. In particular, the defendants contended that Drew & Napier acted\n                    for the defendants in the previous retainers for at least a period of seven\n                    months, from December 2005 to July 2006, which was also the same\n                    period during which the plaintiff alleged that the defendants have made certain\n                    representations to him about the shareholding in PPL and the terms of the\n                    defendants’ purchase of Everon’s shares in Stainby. Therefore, by\n                    providing them with legal advice in their negotiations with Everon over the sale\n                    and purchase of Everon’s shares in Stainby, and by providing them with\n                    legal advice on the loan agreements, the defendants contended that Drew &\n                    Napier acted in matters which were related if not the same as the present\n                    proceedings. 11     The plaintiff did not dispute that Drew &\n                    Napier had acted for the defendants in the previous retainers as described\n                    above. But the plaintiff disputed the scope of “same or related\n                    matter” under r 31 of PCR. The plaintiff submitted that the basis of\n                    r 31 is the protection of relevant confidential information. Therefore, the\n                    matter is only “related” to the previous retainer if, by reason of\n                    the previous retainer, the advocate and solicitor obtains confidential\n                    information that is relevant to the present matter. For this proposition, the\n                    plaintiff relied on the common law position and the Ethics Committee of the Law\n                    Society of Singapore’s observations inDuties to Former\n                        Clients: Ethical ConsiderationsandIn re A\n                        Firm of Solicitors[1997] Ch 1. The plaintiff argued\n                    that since there is no guidance as to the interpretation of r 31, there is\n                    no reason for this court not to seek guidance from past case law. 12     Applying the above principles, the plaintiff\n                    contended that he never obtained any confidential information from Drew &\n                    Napier and is unaware of any information that Drew & Napier may have\n                    obtained from the defendants by virtue of their previous retainer. The\n                    plaintiffs contended he had prepared his case solely on his personal knowledge\n                    of the facts and/or the information obtained from documents that were obtained\n                    by the plaintiff before he instructed Drew & Napier in the current retainer.\n                    The plaintiff further contended that the defendants failed to particularise its\n                    allegations despite repeated requests from Drew & Napier.",
        "Scope of rule 31 of the PCR": "13     As may be readily observed, the main\n                    contention between the parties concern the scope of r 31(1) of the PCR, in\n                    particular, whether “same or related matter” must be read in the\n                    light of the receipt of confidential information. Pre-PCR position/common law position 14     Where a solicitor acts for a client in\n                    opposition to the interests of a former client, the common law position is\n                    divided between a school of thought which sees the test as whether there is a\n                    real conflict (iewhere confidential information\n                    would be disclosed to the subsequent client or used against the earlier client),\n                    and another which saw the test as one of reasonable likelihood of such mischief\n                    or prejudice occuring. This is best exemplified inRakusen v\n                        Ellis, Munday & Clarke[1912] 1 Ch 831\n                        (“Rakusen”), where the English\n                    Court of Appeal rejected the view that there was a general principle that a\n                    solicitor who has acted for a client in a particular matter cannot, under any\n                    circumstances, act for the opposite party in the same matter. Cozens-Hardy MR\n                    took the view that before granting an injunction order, the court “must\n                    be satisfied that real mischief and real prejudice will in all human probability\n                    result if the solicitor is allowed to act”. On the other hand, Buckley LJ\n                    took the view that there must “exist, or may be reasonably anticipated to\n                    exist, a danger of a breach of that which is a duty, an enforceable duty,\n                    namely, the duty not to communicate confidential information”. That case\n                    concerned a situation where one partner was acting for a client and another\n                    partner unknowingly agreed to act for the opposing client in the same\n                    action. 15In re a firm of\n                        solicitors[1992] QB 959, in the course of acting for a\n                    company, the law firm received confidential information from its client’s\n                    associated companies. Subsequently, the law firm was instructed to act for a\n                    defendant in another litigation brought by the said associated companies. Parker\n                    LJ preferred and applied the test as set out by Buckley LJiethat the test is \"whether there is or is not a reasonable\n                    anticipation of mischief”. Likewise, inAlrich\n                        Development Pte Ltd v Rafiq Jumabhoy[1994] 3 SLR(R) 38\n                        (“Alrich Development”) (where\n                    counsel for the plaintiffs contended that the defendant’s solicitor should\n                    disqualify themselves from further acting for the defendant because a former\n                    partner from the plaintiffs’ previous solicitors’ firm joined the\n                    defendant’s solicitor’s firm), Chao Hick Tin J (sitting in the High\n                    Court)(“Chao J”) held at [139]: In my opinion the public interest in the administration of justice is\n                        sufficiently safeguarded on the test of “reasonable anticipation of\n                        mischief” or in other words “reasonable likelihood of\n                        mischief”. … Chao J also quoted (at [142]) para 25[c] of the Practice Directions of\n                    the Law Society, which was a reply given by the Council of the Law Society to a\n                    member's query: … There was no general rule that a solicitor who had acted for some\n                        person either before or after a litigation began cannot in any case act for\n                        the opposite party.In each case, the court has to be\n                            satisfied that mischief would result from the solicitor so acting. If\n                            there was no danger of any breach of confidence for the solicitor to act\n                            for the opposite party in a particular situation, then the question of a\n                            conflict of interest will not arise. The decision on point is\n                        the English Court of Appeal case inRakusen v Ellis,\n                            Munday & Clarke. [emphasis added] 16     On the other hand, inSeet\n                        Melvin v Law Society of Singapore[1995] 2 SLR(R) 186\n                        (“Seet Melvin”), the Court of\n                    Appeal at [17] adopted the position taken by Cozens-Hardy MR inRakusen([14] supra) and held that what was prohibited\n                    was putting oneself in a situation where real mischief or prejudice would\n                    result, not merely a mere risk or possibility of mischief or\n                prejudice. 17     With either approach, it may be observed that\n                    the courts have identified the key interest as the protection of confidential\n                    information.In re A Firm of Solicitors[1997] Ch 1, the plaintiffs retained a firm to act for them in a\n                    litigation matter. Subsequently, a partner to the firm not involved in the\n                    matter left to join another firm who were later retained to act for the\n                    defendants to the litigation matter. The plaintiffs therefore applied to\n                    restrain the said partner from acting against them. Lightman J, after\n                    considering the authorities, stated (at p9E–p10F) that: … (1) The basis of the courts’ intervention is not a possible\n                        perception of impropriety: it is the protection of confidential information:\n                        seeRakusen v. Ellis, Munday & Clarke[1912] 1 Ch. 831, 845,perBuckley L.J.;David Lee & Co. (Lincoln) Ltd. v. Coward\n                            Chance[1991] Ch. 259, 268A-C,perSir Nicolas Browne-Wilkinson V.-C.;\n                        andIn re A Firm of Solicitors[1992] Q.B.\n                        959, 974,perStaughton L.J. (2) In view of\n                        the special importance of the relationship of confidence between solicitor\n                        and client and of the fact that the solicitor is an officer of the court,\n                        the court is particularly sensitive to the need to afford the fullest and,\n                        where required, special protection to such confidential information: seeRakusen v. Ellis, Munday & Clarke[1912] 1 Ch. 831 andIn re A Firm of\n                            Solicitors[1992] Q.B. 959 ... ... Accordingly (4) (a) a solicitor at one time retained by a client, but not\n                        in possession of relevant confidential information, is not by reason of the\n                        fact of such past retainer precluded from subsequently acting against him:\n                        seeRakusen v. Ellis, Munday & Clarke[1912] 1 Ch. 831; (b) a solicitor possessed of relevant confidential\n                        information is precluded from acting against his former client: seeIn re A Firm of Solicitors[1992] Q.B.\n                        959; (c) in the case of a firm previously retained by a client: (i) the\n                        members of the firm, whether partners or employees, who are in possession of\n                        relevant confidential information are likewise subject to such a constraint,\n                        whether they remain with the firm or practice elsewhere; (ii) the members\n                        who are not in possession of such information (a) are free from such\n                        restraint once they have left the firm and are practising elsewhere, (b) so\n                        long as they remain with the firm are undoubtedly precluded from so acting\n                        if the court considers there is a real, as opposed to fanciful, risk of a\n                        communication to them of any such relevant confidential information by those\n                        within the firm possessed of it (seeIn re A Firm of\n                            Solicitors, at pp. 969E-G,\n                            975B-F, 977-978) and may possibly be precluded in\n                        any event even if there is no such risk save in exceptional circumstances\n                        (see pp. 970D-F, 971F,\n                            978E-F), but contra, see pp. 971-973,\n                            976BandDavid Lee & Co.\n                            (Lincoln) Ltd. v. Coward Chance[1991] Ch. 259. (5) On the issue whether the solicitor is possessed of relevant\n                        confidential information: (a) it is in general not sufficient for the client\n                        to make a general allegation that the solicitor is in possession of relevant\n                        confidential information if this is in issue: some particularity as to the\n                        confidential information is required: seeBricheno v.\n                            Thorp, Jac. 300 andJohnson v.\n                            Marriott(1833) 2 C. & M. 183. ... The effect of the PCR 18     The PCR was introduced in\n                    1 June 1998 pursuant to s 71 of the Legal Profession Act\n                    (Cap 161, 2000 Rev Ed) which provided that the Council of the Law\n                    Society may make rules for regulating the professional conduct. Firstly I note\n                    that whatever may be the position taken by the Law Society in its practice\n                    directions earlier (egsee [15]), r 2(3) of\n                    the PCR provides that the PCR “shall, to the extent of any inconsistency,\n                    prevail over the Practice Directions and Rulings 1989 issued by the Law Society\n                    or any additions or amendments thereto.” 19     A plain reading of r 31 of the PCR does\n                    not support the plaintiff’s position that there is no change from the\n                    common law position. Rule 31(1) simply states “[a]n advocate and\n                    solicitor who has acted for a client in a matter shall not thereafter act\n                    against the client (or against persons who were involved in or associated with\n                    the client in that matter) in the same or any related matter.” There is\n                    nothing in r 31(1) which limits “any related matter” to\n                    matters where relevant confidential information has been passed. This is a new\n                    rule that came into force well after the common law rule was established. There\n                    is no reason to distort the meaning of a piece of subsidiary legislation to suit\n                    the common rule in existence at the time it was enacted. Furthermore, this\n                    interpretation fits the overall structure of r 31. While there is an\n                    absolute prohibition against an advocate and solicitor acting against a former\n                    client in the same or related matter (r 31(1)), an exception is made where\n                    the advocate and solicitor leaves to join another firm in which situation, his\n                    new firm may act against his former client in the same or related matter so long\n                    as he is not involved, and does not disclose confidential information\n                    (r 31(4)). 20     Helpfully, the Ethics Committee of the Law\n                    Society of Singapore released an article “Duties to Former Clients:\n                    Ethical Considerations” inLaw Gazette:Search & Sight(October 2009) commenting\n                    on the application of rule 31: Scenario\n                        1 Let us first look at a simple scenario. You acted for Client A in drafting\n                        a simple will a few years ago. That retainer then came to an end. You now\n                        act for Client B, the Wife in a divorce matter. Client A is the Husband in\n                        the divorce matter. What would you do? ... … The key issue in these situations is usually whether the\n                        solicitor is acting against the former client “in the same or . . .\n                        [a] related matter”. In some cases, it will be obvious that the two\n                        matters are neither the “same” nor “related”\n                        matters and the solicitor is therefore not prohibited under r 31 from\n                        acting against the former client. However, in other cases, the two matters\n                        may not be sufficiently distinct and a test is required to ascertain whether\n                        the two matters are the “same” or\n                        “related”. ... In Scenario 1, the will and the divorce are clearly not “the same\n                        matter” within the meaning of r 31(1). So r 31(1) prevents\n                        you from acting for the Wife only if the divorce proceeding is\n                        “related” to the Husband’s will. The mere fact that you\n                        prepared the will for the Husband does not in itself place you in a position\n                        of conflict if the two matters are not “related”. There is no guidance in the PCR on the test to be applied in determining\n                        whether one matter is “related” to another matter within the\n                        meaning of r 31(1). The Committee’s view is that two matters are\n                        clearly related if any information which the former client previously\n                        imparted in confidence to you for the purposes of the earlier matter is\n                        relevant to the later matter. This, it seems to the Committee, strikes the\n                        right balance between protecting the interest of the former client in having\n                        his confidences preserved and the interest of the current client in being\n                        permitted to engage her choice of counsel. ... Conclusion Whether a solicitor may act against a former client under r 31\n                        depends on whether the current matter is the “same” as or\n                        “related” to the former matter. This is always a question of\n                        substance, not form, and must therefore depend on the circumstances of each\n                        case. It will usually be obvious whether two matters are the\n                        “same” by reason of an identity or overlap of parties, legal\n                        or factual issues or subject-matter. The more difficult question is when two\n                        matters are “related”. In this regard, the\n                        “confidential information” test provides a useful yardstick.\n                        However, in an area where substance prevails over form, this is perhaps not\n                        the only yardstick. Members should therefore be aware that there could be\n                        other considerations that a court may take into account in applying this\n                        test, for example, the solicitor’s knowledge of the disposition of the\n                        former client which is neither confidential information nor information\n                        which is directly relevant to the subject-matter of the later matter. The plaintiff submitted that the Ethics Committee was of the view that\n                    whether matters are deemed “related” would depend on there being\n                    any information which the former client previously imparted in confidence to the\n                    advocate or solicitor which is relevant to the later matter. I am unable to\n                    agree. The question postulated was whether having acted for a client in a will\n                    would disqualify the solicitor from acting for his wife in their divorce. The\n                    issue was whether they constitute “related matters” under\n                    r 31(1), the answer to which was not immediately apparent in this scenario.\n                    What the Ethics Committee meant was that when confidential information is\n                    imparted by the former client to the advocate or solicitor, and such\n                    confidential information was relevant to the matter at hand, then the two\n                    matters are clearly related. However, while the “confidential\n                    information” test was useful, it was not the sole yardstick in\n                    determining if two matters are related. In fact, upon closer scrutiny of the\n                    article, it is noted that the Ethics Committee was applying the\n                    “confidential information” test to a situation where the two\n                    matters were not the same or obviously related, specifically the Ethics\n                    Committee envisaged a scenario where a solicitor acted for a husband in the\n                    drafting of a will, and subsequently, acted for the wife in a divorce matter. In\n                    such a case, the “confidential information” test is a useful, but\n                    not necessarily conclusive, tool in assessing whether an advocate and solicitor\n                    should represent the subsequent client. For the reasons below, I found that the\n                    matters in the previous retainer and the present case are obviously\n                    related. 21     I should add that the view that r 31 is\n                    not dependent on whether confidential information will be disclosed is also\n                    shared by commentators including Yasho Dhoraisingam and Sivakumar Murugaiyan in\n                    “Understanding the Recent Amendments to the Professional Conduct and\n                    Publicity Rules” inLaw Gazette:Getting On Top Of Ethics(December 2001). There,\n                    the authors stated the following when addressing the amendment to r 31 to\n                    include r 31(3): It should be noted that the absolute prohibition against an advocate and\n                        solicitor who has previously acted for a client in a matter to, thereafter,\n                        not act against the client or other person involved in the same or related\n                        matter remains.This was so whether he had in his\n                            possession any confidential information relevant to that\n                            matter. [emphasis added] 22     Likewise, Jeffrey Pinsler inEthics and Professional Responsibility: A Code for the Advocate and\n                        Solicitor(Academy Publishing, 2007) agrees that r 31 is\n                    stricter than the common law position. At para 16-008 he states: ...It will be clear that r 31 is stricter than the common law. and para 16-017: ... r 31 is not concerned with whether confidential information has\n                        been obtained from the client. It simply prohibits the advocate and\n                        solicitor from acting against his former client unless one of the\n                        qualifications in r 31(4) operates. … 23     It is my view that r 31 was not intended\n                    to replicate the common law position, and for two matters to be related, it is\n                    not necessary that the solicitor had received confidential information relevant\n                    to the subsequent suit. In taking the ordinary meaning of the word\n                    “related”, it may be useful to consider r 3.01 of the UK\n                    Solicitors’ Code of Conduct 2007 (“UK code”): 3.01 Duty not to\n                        act (1) You must not act if there is a conflict of interests (except in the\n                        limited circumstances dealt with in 3.02). (2) There is a conflict of interests if: (a) you owe, or your firm owes, separate duties to act in the best\n                            interests of two or more clients in relation to the same or related\n                            matters, and those duties conflict, or there is a significant risk that\n                            those duties may conflict; or (b) your duty to act in the best interests of any client in relation\n                            to a matter conflicts, or there is a significant risk that it may\n                            conflict, with your own interests in relation to that or a related\n                            matter. (3) For the purpose of 3.01(2),a related matter will\n                            always include any other matter which involves the same asset or\n                            liability. [emphasis added] It must be emphasised however that the UK Code is different from the\n                    PCR; in particular, the PCR does not limit the prohibition against solicitors\n                    acting in “related” matters to instances where there would be a\n                    conflict of interest, or risk of it. Regard may also had to the r 1.9 of\n                    the American Bar Association Model Rules of Professional Conduct: (a)    A lawyer who has formerly represented a client in\n                            a matter shall not thereafter represent another person in the same or a\n                            substantially related matter in which that person's interests are\n                            materially adverse to the interests of the former client unless the\n                            former client gives informed consent, confirmed in\n                        writing. In the comments to r 1.9, it is stated that [3]Matters are \"substantially related\" for purposes of\n                            this Rule if they involve the same transaction or legal\n                            disputeor if there otherwise is a substantial risk that\n                        confidential factual information as would normally have been obtained in the\n                        prior representation would materially advance the client's position in the\n                        subsequent matter. [emphasis added] 24     The interpretation of r 31 that I have\n                    adopted coincides with observations of the Court of Three Judges’ inLaw Society of Singapore v Seah Li Ming Edwin and\n                        another[2007] 3 SLR(R) 401 at [24]: The underlying rationale for such a rule [ierule 31] is to ensure that thetrustbetween\n                        lawyer and client is not compromised and that, on the contrary, the\n                        confidence of the client is in fact maintained.There\n                            is, indeed, a larger public interest that underscores such a\n                            rule. The legitimacy of the law in general and the confidence\n                        of clients in their lawyers in particular are of fundamental importance and\n                        will be undermined if such a rule is not observed.Indeed, the fact that a client may feel that he or she is let down or\n                            betrayed by his or her lawyer can be very damaging to the standing of\n                            the profession as a whole. [emphasis in original in italics;\n                        emphasis added in bold italics] The Court had clearly opined that there was a larger public interest\n                    beyond the need to protect against the disclosure of confidential information,\n                    and that is the solicitor-client relationship of trust and public confidence in\n                    the integrity of the legal profession. 25     Turning to the facts of the present case, the\n                    previous retainers and the present proceedings are “related”\n                    matters, given that the previous retainers dealt with the shareholders loan and\n                    price of Everon shares, the very matters which are the subject of dispute in\n                    this suit. Indeed, in the hearing before me, counsel for the plaintiff quite\n                    candidly conceded that the matters were “related” to the extent\n                    that the previous retainers pertained to matters the subject of the present\n                    litigation even though there was no confidential information at\n                risk.",
        "Whether an injunction order may be made against the particular\n                advocate and solicitor, or as against the law firm": "26     Before me, the plaintiff contended that since\n                    r 31(1) of PCR relates to a personal disqualification rule, the defendants\n                    cannot seek to restrain Drew & Napier (iethe\n                    entire law firm) by way of an injunction order. In my view, this contention is\n                    misguided. I agree with the defendants that by virtue of r 31(2), it is\n                    irrelevant whether the solicitor concerned personally handled the client’s\n                    work, so long as the client was a client of the law practice of which the\n                    solicitor is a partner, director, associate or employee of. Thus, any solicitor\n                    of Drew & Napier would be equally prohibited from acting against a former\n                    client of Drew & Napier in the same or related matter, whether or not he was\n                    personally involved in the earlier matter.",
        "Whether the defendants’ application should be taken out in a\n                separate suit": "27     The plaintiff also applied to strike out the\n                    defendants’ application pursuant to the inherent jurisdiction of the court\n                    on the ground that the normal and proper course is for the application to be\n                    made in separate proceedings against Drew & Napier aloneienot in the present suit. For this proposition, the plaintiff\n                    relied onDiamond v Foo and others[2002] EWHC 979 (CH) (“Diamond”). As the plaintiff was not privy to the\n                    defendants’ previous retainer and has no knowledge of what confidential\n                    information belonging to the defendants which Drew & Napier was in\n                    possession of, and the defendants have refused to waive privilege over the\n                    information, the plaintiff is prevented from obtaining information from his\n                    solicitors with respect to the matters raised by the defendants and is thus\n                    unable to respond fully to the defendants’ allegations. The defendants\n                    contended that this court is in a position to decide whether Drew & Napier\n                    is in breach of r 31(1) of the PCR by examining the scope of Drew &\n                    Napier’s previous retainers with the defendants and the issues raised in\n                    suit no 720 of 2009 proceedings to determine whether they are the same or\n                    related matters. 28     I do not think that Lightman J inDiamondlaid down any rule that an applicant\n                    for an order restraining solicitors acting for one of the parties on such basis\n                    must make that application in totally separate proceedings against the\n                    solicitors alone. The reason Lightman J found that the application ought to\n                    be made in totally separate proceedings against the solicitors was because the\n                    court would require to be informed as to what the confidential information was,\n                    and that such confidential information could not be disclosed in the main\n                    proceedings as the opposing party would then have access to them and all\n                    confidentiality in that information would be lost. However, given my findings\n                    above concerning the scope of r 31, a finding that the earlier and later\n                    matters are the same or related can be made without any consideration of\n                    confidential information. Furthermore, inAlrich\n                        Development([15]supra), the\n                    application to disqualify the law firm from acting because of an alleged\n                    conflict of interest was dealt with in the substantive action\n                itself.",
        "Conclusion": "29     For the reasons above, I grant the\n                    defendants’ application in summons no 2035 of 2010 for an\n                    injunction restraining Drew & Napier from further acting for the plaintiff\n                    in this action. It follows that summons no 2312 of 2010, in which the\n                    plaintiff applied to strike out summons no 2035 of 2010, is dismissed. I\n                    will hear counsel on the issue of costs."
    }
}