{
    "case_title": "ABB Holdings Pte Ltd and others\n      v\n      Sher Hock Guan Charles",
    "ncitation": "[2010] SGHC 267",
    "coram": "Shaun Leong Li Shiong AR",
    "sections": {
        "Introduction": "1       The present matter involves an application by\n                    the plaintiffs inABB Holdings Pte Ltd and others v. Sher\n                        Hock Guan Charles[2009] 4 SLR(R) 111 (‘ABB Holdings’) for leave to amend its Statement of\n                    Claim (Amendment No. 3). Judgment has been granted inABB\n                        Holdingsfor the second and third plaintiffs to elect between\n                    damages to be assessedoran account of the\n                    defendant’s profits to be taken. The plaintiffs now seek, by way of an\n                    amendment to the statement of claim, to obtain remedies in general damagesandrestitutionary damages.",
        "Factual Background": "2       The plaintiffs are part of a worldwide group of\n                    companies which bear the name (“ABB Group”). The defendant worked\n                    for various companies in the ABB Group. While still in the employ of the second\n                    and third plaintiffs, the defendant had communicated with a former ABB Group\n                    employee (‘Mr Leonhardt’) in relation to enquiries by a Chinese\n                    body, Xian High Voltage Apparatus Reasearch Institute (\"XIHARI\"), regarding\n                    whether the former employee would act as XIHARI's technical advisor in research\n                    and development projects relating to the development of a new generation of\n                    medium voltage circuit breakers. After leaving the second and third plaintiffs\n                    in 2003, the defendant joined a company in China called Xiamen Huadian\n                    Switchgear Co Ltd (\"Huadian\") as its General Manager. Huadian was a manufacturer\n                    of,inter alia, medium voltage circuit breakers.\n                    The defendant later became the Managing Director of Huadian. 3       Subsequently, the plaintiffs commenced\n                    proceedings against the defendant, alleging that the defendant was in breach of\n                    several express and implied fiduciary duties and that he had caused damage to\n                    the plaintiffs by such breaches. The parties have agreed to leave the question\n                    of “assessment of damages or calculation of\n                        profits” at a later stage. A consent order was granted on\n                    7 January 2009 for the trial to be bifurcated with “damages (if any)\n                    or calculation of profits (if any) to be assessed at a later stage”\n                    (‘consent order’). 4       InABB Holdings,\n                    the Court found that the defendant did not owe any fiduciary duties to the first\n                    plaintiff. The defendant was however found to be a fiduciary of the second and\n                    third plaintiffs, and on the facts, he had been in breach of the fiduciary\n                    duties owed. He was also in breach of his duty of fidelity to the third\n                    plaintiff. The Court granted judgment in favour for the second and third\n                    plaintiffs against the defendant fordamages to be\n                        assessed. 5       Thereafter, the plaintiffs requested for an\n                    audience before the same Judge who heardABB\n                        Holdings(‘the Judge’) to clarify the options of\n                    remedies available to the plaintiffs. The plaintiffs stated in a letter dated 8\n                    July 2009 that they have yet to elect the specific remedy to satisfy the\n                    plaintiffs’ claim, and requested for a clarification of the judgment to be\n                    read as “damages to be assessed or an account of\n                        profits, at the plaintiffs’ option”. After hearing\n                    submissions from both parties, the Judge gave a Final Judgment dated 6 July\n                    2009 (‘Final Judgment’) that: 2.    There be judgment\n                            for the 2ndand\n                                3rdPlaintiffs against the Defendant foreither damages to be assessed or an account of\n                                the Defendant’s profits to be taken, at the\n                            election of the 2ndand\n                                3rdPlaintiffs in respect of the\n                            following:- (a)    the breach by the Defendant of his\n                            fiduciary duty to the 2ndand\n                                3rdPlaintiffs and of his duty of\n                            fidelity to the 3rdPlaintiff when he failed\n                            to inform them of XIHARI’s intention to develop and market a new\n                            generation of circuit breakers; (b)    the breach by the Defendant of his\n                            fiduciary duty to the same parties when he communicated with\n                            Mr Leonhardt with a view to obtaining the latter’s services,\n                            as a consultant for XIHARI and Huadian; and (c)    the breach by the Defendant of his duty of\n                            fidelity to the 3rdPlaintiff when he spent\n                            time after about November 2002 working on plans to develop and run the\n                            business of Huadian. [emphasis in bold added] 6       About a year later and before proceeding to the\n                    stage of assessment of damages (or account of profits), the plaintiffs now\n                    sought to amend the ‘particulars of damages’ in its Statement of\n                    Claim (Amendment No. 3). Paragraph 14(d) sought to adjust (to a higher\n                    quantum) the costs incurred in the investigation of the defendant’s\n                    breaches. Paragraph 14(e) is an addition to the Statement of Claim which seeks\n                    to obtain,inter alia, the amount of salary,\n                    allowances and bonuses during the period when the defendant had breached its\n                    duties. By way of paragraph 14(f), the plaintiffs sought for restitutionary\n                    damages in addition to general damages: 14.    In addition to general damages, Plaintiffs have\n                            suffered additional special damages by reason of the aforesaid acts of\n                            the Defendant. ... (f)    To the best of the Plaintiffs’ knowledge to\n                            date and subject to further discovery, the difference between RMB\n                            33,091,585.88 (the value of the Defendant’s shares in Hua Dian)\n                            and Euro 180,000 (the Defendant’s capital investment in Gelpag\n                            GmbH), which difference represents the value of the Defendant’s\n                            wrongful gain and restitutionary damages",
        "The Issue": "7       I grant leave to amend paragraph 14(d) and (e).\n                    The plaintiff has the burden of adducing sufficient evidence for paragraph 14(d)\n                    to justify its claim before the assessing registrar. Paragraph 14(e) may\n                    require some authority to justify, such as the decision ofJohn While Springs (S) Pte Ltd and another v. Goh Sai Chuah Justin and\n                        Others[2004] SGHC 150, but that is a matter to be\n                    decided by the assessing registrar. 8       The only issue that remains is whether the\n                    plaintiffs can amend its statement of claim to seek for restitutionary damages\n                    in addition to general damages for the losses it suffered.",
        "The Decision": "",
        "General principles governing the grant of leave for amendment of\n                pleadings": "9       The principles that guide the Court in deciding\n                    whether to grant leave for amendment of pleadings have been clarified by the\n                    Court of Appeal inReview Publishing Co Ltd v Lee Hsien\n                        Loong[2010] 1 SLR 52 (‘Review\n                        Publishing’). The guiding principle is that the amendment\n                    should be allowed if it would enable the real question between the parties to be\n                    determined. However, it must be just for leave to be granted, having regard to\n                    all circumstances of the case and bearing in mind two key factors; whether the\n                    amendment would result in prejudice irremediable with costs, and whether the\n                    amendment is essentially a ‘second bite at the cherry’. It is\n                    apposite to visit the statements of principle laid down inReview Publishing(at [110]-[114]): 110    ... O 20 r 5(1) of the Rules of\n                        Court (Cap 322, R 5, 2006 Rev Ed) gives the court a wide discretion to allow\n                        pleadings to be amended at any stage of the proceedings on such terms as may\n                        be just. Order 20 r 5(1) reads: Subject to Order 15, Rules 6, 6A, 7 and 8, and this Rule, the Court\n                            may at any stage of the proceedings allow the plaintiff to amend his\n                            writ, or any party to amend his pleading,on such\n                                terms as to costs or otherwise as may be just and in such manner (if\n                                any) as it may direct. [emphasis added] 111    InChwee Kin Keong v\n                            Digilandmall.com Pte Ltd[2005] 1 SLR(R) 502\n                            ('Chwee Kin Keong'), this court said at\n                        [101]: Under O 20 r 5(1) of the Rules of Court (Cap 322, R 5,\n                        2004 Rev Ed), the court may grant leave to amend a pleading atanystage of the proceedings.This can be before or during the trial, or after judgment or on\n                            appeal. [emphasis added] 112    Indeed, local case law shows that\n                        our courts have allowed amendments to be made to pleadings even: (a)    at the final stages of a trial after the\n                            parties have made their closing submissions (seeChwee Kin Keongat [101]-[103] andLee Siew Chun v Sourgrapes Packaging Products Trading Pte\n                                Ltd[1992] 3 SLR(R) 855 at [91]-[96]); (b)    after summary or interlocutory judgment has\n                            been obtained (seeInvar Realty Pte Ltd v Kenzo Tange\n                                Urtec Inc[1990] 2 SLR(R) 66 at [21]-[22]);\n                            and (c)    pending an appeal or in the course of an\n                            appeal itself (seeSoon Peng Yam v Maimon bte\n                                Ahmad[1995] 1 SLR(R) 279 at [25]-[30],Asia Business Forum Pte Ltd v Long Ai\n                                Sin[2004] 2 SLR(R) 173 ('Asia Business Forum') at [17] andSusilawati v American Express Bank Ltd[2009]\n                            2 SLR(R) 737 ('Susilawati') at [56]; see also O 57 r 13(1) of\n                            the Rules of Court, which states that 'the Court of Appeal shall have\n                            all the powers and duties as to amendment and otherwise of the High\n                            Court'). ... 113    The guiding principle is that amendments to\n                        pleadings ought to be allowed if they would enable the real question and/or\n                        issue in controversy between the parties to be determined ... However, an\n                        important caveat to granting leave for the amendment of pleadings is that it\n                        must be just to grant such leave, having regard to all the circumstances of\n                        the case. Thus, this court held inAsia Business\n                            Forumthat the court, in determining whether to grant a party\n                        leave to amend his pleadings, must have regard to 'the justice of the case'\n                        (at[12]) and must bear in mind (at\n                        least) two key factors, namely, whether the amendments would cause any\n                        prejudice to the other party which cannot be compensated in costs and\n                        whether the party applying for leave to amend is 'effectively asking for a\n                        second bite at the cherry' (at [18]). These two key factors were endorsed\n                        recently again by this court inSusilawatiat\n                        [58]. 114    It cannot be over-emphasised that\n                        all the relevant circumstances of the case at hand should be considered by\n                        the court in deciding whether or not to allow an amendment to pleadings, and\n                        that delay in bringing the application for leave to amend per se does not\n                        constitute prejudice to the other party. As this court stated inWright Normanat [23]: In our opinion, at the end of the day, the most important question\n                            which the court must ask itself is, are the ends of justice served by\n                            allowing the proposed amendment. Pleadings should not be used as a means\n                            to punish a party for his errors or the errors of his solicitors. All\n                            relevant issues should be investigated, provided the other party will\n                            not be prejudiced in a way which cannot be compensated by costs. All\n                            relevant circumstances should be considered by the court before it\n                            exercises its discretion [as to] whether it would allow an amendment.While the time at which an amendment is made is a\n                                relevant consideration it is not necessarily decisive. Delay per se\n                                does not equal prejudice or injustice. We do not think\n                            any rigid rule should or can be laid down on this. [Court of Appeal's emphasis inReview Publishing Co Ltd\n                            v Lee Hsien Loong]",
        "Election of Remedies available to the Plaintiffs": "10     In the present case, the correspondence which\n                    showed the agreement to bifurcate the trial had made no mention of\n                    restitutionary damages. The parties decided to bifurcate on the basis that\n                    damages will be assessed or an account of profits will be taken at a later\n                    stage. The plaintiffs’ letter dated 1 December 2008 invited the defendant\n                    to bifurcate the matter on this basis[note: 1]: In the circumstances, the sensible and practical approach would be for\n                        this action to be “split” into two stages. The first stage\n                        concerns the issue of liability, i.e. whether our clients’ rights were\n                        infringed. The second stage, which is contingent upon liability being\n                        established at the first stage, is concerned with thequestion of assessment of damages or calculation of profits.\n                        In this way, the costs of exploring damages or profits are put off until it\n                        is clear that our clients’ rights were indeed infringed and the\n                        invasion of confidence necessarily involved in discovery of your\n                        client’s documents is postponed or, if your client is not liable,\n                        entirely obviated. We suggest such an approach. [emphasis added] 11     The defendant’s letter dated\n                    30 December 2008[note: 2]states: ...our client is agreeable to your proposal...that the action be\n                        “split” into two stages, i.e. for the trial to proceed on\n                        liability only, with damages (if any) to be assessed at a later\n                        stage. 12     The parties’ intentions were\n                    crystallised in a consent order dated 7 January 2009 for the trial to be\n                    bifurcated with “damages (if any) or calculation of\n                        profits (if any) to be assessed at a later stage”. After\n                    the conclusion of the trial, the parties’ appeared before the Judge on\n                    20 July 2009 to clarify the options of remedies available to the\n                    plaintiffs. The plaintiffs insisted in its right to elect its remedies between\n                    damages and the alternative of an account of profits. Thereafter, the Judge made\n                    an order of the remediesavailableto the\n                        2ndand 3rdplaintiffs\n                    in the Final Judgment, where they can elect between damages and an account of\n                    profits. 13     The specific question is whether the\n                    plaintiffs can include an additional remedy of restitutionary damages in light\n                    of the Final Judgment. InTang Man Sit v. Capacious\n                        Investments Ltd[1996] AC 514 (‘Tang Man Sit’), the Privy Council decided that a\n                    plaintiff can change his choice of remedies even at a very stage, so long as the\n                    Court has not rendered judgment for the remedy to be given: Faced with alternative and inconsistent remedies a plaintiff must choose,\n                        or elect, between them. He cannot have both. The basic principle governing\n                        when a plaintiff must make his choice is simple and clear.He is required to choose when, but not before, judgment is\n                            given in his favour and the judge is asked to make orders against the\n                            defendant. A plaintiff is not required to make his choice\n                        when he launches his proceedings. He may claim one remedy initially, and\n                        then by amendment of his writ and his pleadings abandon that claim in favour\n                        of the other. He may claim both remedies, as alternatives. But he must make\n                        up his mind when judgment is being entered against the defendant. Court\n                        orders are intended to be obeyed. In the nature of things, therefore, the\n                        court should not make orders which would afford a plaintiff both of two\n                        alternative remedies. [emphasis added] 14     The same position was adopted by the House of\n                    Lords decision ofUnited Australia v. Barclays\n                        Bank[1941] AC 1 (‘United\n                        Australia’) , where Viscount Simon LC emphasized that the\n                    there is nothing special about the remedies stated in the statement of claim as\n                    leave could always be granted for amendment any timebeforejudgment has been rendered: There is nothing conclusive about the form in which the writ is issued, or\n                        about the claims made in the statement of claim. A plaintiff may at any time\n                        before judgment be permitted to amend. The substance of the matter is that\n                        on certain facts he is claiming redress either in the form of compensation,\n                        i.e., damages as for a tort, or in the form of restitution of money to which\n                        he is entitled, but which the defendant has wrongfully received. The same\n                        set of facts entitles the plaintiff to claim either form of redress. At some\n                        stage of the proceedings the plaintiff must elect which remedy he will have.\n                        There is, however, no reason of principle or convenience why that stage\n                        should be deemed to be reached until the plaintiff applies for\n                        judgment. 15     Similarly, Lord Atkin emphasized that the\n                    relevant step when the plaintiff is estopped from electing a different remedy\n                    was when judgment for the remedy has been given: ...on a question of alternative remedies no question of election arises\n                        until one or other claim has been brought to judgment. Up to that stage the\n                        plaintiff may pursue both remedies together, or pursuing one may amend and\n                        pursue the other: but he can take judgment only for the one, and his cause\n                        of action on both will then be merged in the one. 16     In the present case, it is obvious that\n                    parties have proceeded on the basis that the remedies available to them in the\n                    event that they succeeded on their claims, would be damages. The alternative\n                    remedy is an account of profits. They have consistently acted on this basis from\n                    the beginning where the first statement of claim was filed, where the parties\n                    agreed to bifurcate the trial and until the time when the Final Judgment was\n                    given. The plaintiffs did not dispute the fact that no mention was made of\n                    restitutionary damages throughout these series of events. In the present\n                    circumstances and with particular reference to the Final Judgment, I find that\n                    the plaintiffs have elected their remediesin so far\n                        asthe plaintiffs have decided that an assessment of damages will\n                    be in thealternative(as opposed tocumulative) to a gains based remedy of an account in\n                    profits. The plaintiffs are of course free to elect thespecific remedyto satisfy its claim, be it in damages, or in an\n                    account of profits. However,to the extentthat\n                    the plaintiffs haveelected the optionsof\n                    alternative remediesavailableto the plaintiffs\n                    in the form of either damagesoran account of\n                    profitsby the time the Final Judgment had been\n                        given, I find that the plaintiffs are estopped from raising an\n                    additional remedy of restitutionary damages. 17     In my view, to allow the amendment at this\n                    stage would cause substantial prejudice to the defendant that cannot be remedied\n                    by costs – the defendant was denied the opportunity to defend in trial the\n                    issues in relation to the difference between the defendant’s shares in Hua\n                    Dian and his capital investment in Gelpag GmbH, pursuant to his breaches of\n                    fiduciary duties. Although it was found that the defendant had acted in breach\n                    of his fiduciary duties when it undertook a commission from XIHARI to\n                    communicate with Mr Leonhardt, there were no questions placed before the\n                    defendant in trial that the monies (constituting the commission received) were\n                    causally linked to his shares in Hua Dian or capital investment in Gelpag GmbH.\n                    It was also determined in trial that the defendant was in breach of his\n                    fiduciary duties when he failed to inform the second and third plaintiffs of\n                    XIHARI’s intention to develop and market new generation of circuit\n                    breakers, and when he spent time after November 2002 working on plans to develop\n                    and run the business of Hua Dian. However, the defendant was denied the\n                    opportunity to cross-examine on the plaintiffs’ implied assertions (by way\n                    of the present application for leave to amend) that the defendant has wrongfully\n                    obtained benefits in the course of committing such breaches. 18     Indeed, the plaintiffs’ attempt to bring\n                    in the question of the alleged capital investment in Gelpag GmbH (by way of the\n                    present application) at the stage of assessment of damages is a blatant attempt\n                    tore-litigatebefore the assessing registrar an\n                    issue that has already beendecidedby the Judge.\n                    The plaintiffs asserted in trial that the defendant’s capital investment\n                    in Gelpag GmbH came from the substantial proceeds in the Xiamen Project; and the\n                    plaintiffs are entitled to such proceeds/capital investment because of the\n                    proceeds were obtained contrary to the defendant’s express duty not to\n                    participate in other business activities[note: 3]. This has been conclusively\n                    dismissed by the Judge in view of the lack of evidence (see ABB Holdings at para\n                    [66]): Having considered the evidence very carefully, I think that there is not\n                        enough evidence to show that apart from receiving and passing on the\n                        opportunity the defendant during the period of his employment with the third\n                        plaintiff actively participated in Great Vision or the Xiamen project. There\n                        was no evidence that during the period between the formation of Great Vision\n                        and the defendant's resignation, he spent any time in China during which he\n                        could have been working on the project. The fact that the defendant made a\n                        substantial profit from the Xiamen project is not indicative of any active\n                        participation by him during this period: such payment could well have been\n                        his reward (or commission) for simply obtaining the opportunity and passing\n                        it on to his brother to develop in conjunction with Huang Jianhuang and\n                        Mr Lin. Again the documentation relating to the so called loan of\n                        RMB70,000 is equivocal. The defendant firmly maintained that his name was\n                        reflected by mistake and the document itself showed that the money was\n                        received by someone else. Even if the defendant was the ultimate recipient\n                        of the loan, this would not be sufficient to prove that he was actually\n                        engaged in any business in relation to the Xiamen project. 19     The plaintiffs’ counsel submitted that\n                    there is no question of prejudice as the plaintiffs has the right to amend the\n                    statement of claim at any time before the assessment stage to include all\n                    aspects of remedies, since the trial inABB\n                        Holdingshad only dealt with the question of liability. This was\n                    so because the parties have already agreed to bifurcate the dispute. I am unable\n                    to accept this submission. The parties’ agreement to bifurcate the trial\n                    in December 2008 wasmade on the basis of theplaintiffs’ statement of claim dated 14 March 2008, which had madeno mention of restitutionary damagesand where\n                    the plaintiffs had sought for damages or an account of profits. The decision to\n                    bifurcate may or may not have been different; it is not for this forum to\n                    speculate on that. It is undisputed however, that the defendant has been denied\n                    the opportunity to consider in full the consequences of bifurcation, having had\n                    no knowledge that the plaintiffs would include an additional remedy in\n                    restitutionary damages in the event that they have succeeded in their claim\n                    against the defendant. In this regard, I add parenthically the observation that\n                    although the Privy Council inTang Man Sitfound\n                    that there was no election before the stage of assessment of damages had been\n                    completed because the defendant had failed to give sufficient disclosure of\n                    information for the plaintiff to make an informed election (even though the\n                    plaintiff had already enforced a charging order pursuant to a remedy for an\n                    account of profitsbeforeproceeding to an\n                    assessment of damages), the question that faced the Privy Council was whether\n                    there had been an election between the remedies ordered by the Court; it did not\n                    involve the question of having anadditionalremedy of restitutionary damages which goesbeyondthe option of remedies available to the plaintiff as already ordered by the\n                    Court.",
        "Abuse of Process": "20     The plaintiffs’ counsel made an\n                    ingenuous argument that the reference to “damages” in the consent\n                    order, the Final Judgment and the parties’ agreement to bifurcate the\n                    trial had included (as a ‘subset’ of damages, so to speak),\n                    restitutionary damages. The plaintiffs are essentially asking for compensatory\n                    damagesandrestitutionary damages. This is but a\n                    mere attempt at circumventing the Final Judgment which had ordered an election\n                    betweenalternativeremedies of damages and an\n                    account of profits. As pointed out by the defendant’s counsel, both\n                    parties have appeared before the Judge on 20 July 2009 to clarify the\n                    remedies available to the plaintiffs. They had the opportunity to raise the\n                    issue of restitutionary damages before the Judge but failed to do so. Given that\n                    both parties have made submissions to the Judge on the remedies available to the\n                    plaintiff for election, and where the Judge has decided on that basis to award\n                    remedies in the alternative, I find that to allow the amendment to have an\n                    additional remedy in restitutionary damages would be to give the plaintiffs a\n                    second bite at the cherry. In my view, the Court would be condoning an abuse of\n                    process if the plaintiffs are allowed to circumvent the Final Judgment with a\n                    convenient labelling of ‘damages’ as inclusive of restitutionary\n                    damages. (I add parenthically (as this pertains only to the assessing\n                    registrar), that there could be an issue of double recovery if both compensatory\n                    and restitutionary damages are granted). To the extent stated above, I agree\n                    with the submissions made by the defendant’s counsel that the application\n                    for leave to amend is an abuse of process. 21     Indeed, the present situation is analogous to\n                    the one inWorld Wide Fund and another v. World Wrestling\n                        Federation Entertainment Inc[2008] 1 WLR 445\n                        (‘World Wide Fund’) where the\n                    plaintiffs commenced proceedings against the defendants claiming an injunction\n                    to restrain the defendants from using the plaintiffs’ initials. In October\n                    2001, Jacob J gave summary judgment where the injunction was granted, butrefused the claimants permission to include a claim for\n                        an account of profits. The plaintiffs did not appeal against\n                    Jacob J’s decision. Subsequently, the plaintiffs applied successfully to\n                    amend its pleadings to include a claim underrestitutionary\n                        damages. The Court of Appeal decided that the plaintiffs ought to\n                    have raised the issue ofrestitutionary damagesbefore Jacob J at the same time when the plaintiffs had asked for permission to\n                    include a claim in an account of profits. The failure to do so, coupled with the\n                    subsequent attempt to raise the issue by way of an amendment of its pleadings,\n                    amounted to an abuse of process (per Lord Justice Chadwick at para [74]): In those circumstances the answer to the “crucial question”\n                        posed by Lord Bingham [inJohnson v. Gore Wood &\n                            Co[2002] 2 AC 1]in the passage which I have just\n                        cited is that the fund is seeking to abuse the process of the court by\n                        seeking to raise, in October 2004 (and, by amendment, in March 2005) a claim\n                        forWrotham Parkdamages which it could have\n                        raised in October 2001 and which (but for the fact that it had decided,\n                        then, not to pursue that claim) it should have raised in October 2001. The\n                        abuse, as it seems to me, lies in seeking now to pursue a claim forWrotham Parkdamages in these proceedings\n                        after inviting Jacob J to decide the issue which was before him in\n                        October 2001 (whether to order an account of profits) on the basis that\n                        there would be no claim forWrotham Parkdamages in the proceedings. The course which the fund has adopted is\n                        inconsistent with the underlying interest that there should be finality in\n                        litigation and that a party should not be vexed twice in the same matter: it\n                        is inconsistent with the need for economy and efficiency in the conduct of\n                        litigation, in the interests of the parties and of the public as a whole.\n                        The federation was entitled to proceed on the basis that, a claim to an\n                        award ofWrotham Parkdamages not having been\n                        sought in 2001, such a claim was not being pursued in these proceedings. The\n                        flaw in the judge's reasoning, as it seems to me, lies in his failure to\n                        appreciate that the claim toWrotham Parkdamages (if it were to be raised at all) should have been raised before\n                        Jacob J in conjunction with the claim to an account of profits. 22     In the same vein, I find that the plaintiffs\n                    ought to have raised the question of restitutionary damages before the Judge on\n                    20 July 2009 where both parties have clarified the remedies available to\n                    the plaintiffs, and where the plaintiffs have brought up the issue of an account\n                    of profits before the Judge. 23     The present decision however, does not purport\n                    to assert that an account of profits is thesame\n                        remedyas that of restitutionary damages. Indeed, the desire to\n                    keep the two remedies conceptually distinct is shown when Lord Nicholls said inAttorney General v. Blake[2001]\n                    1 A.C. 268 [House of Lords] at 254 (‘AG v.\n                        Blake’): ...there seems to be no reason, in principle, why the court must in all\n                        circumstances rule out an account of profits as a remedy for breach of\n                        contract. I prefer to avoid the unhappy expression \"restitutionary\n                        damages\". 24     The irony however, is that this statement\n                    shows that the two remedies of restitutionary damages and an account of profits\n                    have often been used in the same context, underlying their common attributes\n                    where the Court has found it fit to use one of these remedies (by looking at the\n                    gain obtained by the wrongdoer) when there is a failure to establish financially\n                    measurable loss. In this regard, Lord Nicholls have pertinently observed that\n                        (AG v. Blakeat 285): Remedies are the law's response to a wrong (or, more precisely, to a cause\n                        of action). When, exceptionally, a just response to a breach of contract so\n                        requires, the court should be able to grant the discretionary remedy of\n                        requiring a defendant to account to the plaintiff for the benefits he has\n                        received from his breach of contract. In the same way as a plaintiff's\n                        interest in performance of a contract may render it just and equitable for\n                        the court to make an order for specific performance or grant an injunction,\n                        so the plaintiff's interest in performance may make it just and equitable\n                        that the defendant should retain no benefit from his breach of\n                        contract...The law recognises that damages are not always a sufficient\n                        remedy for breach of contract. This is the foundation of the court's\n                        jurisdiction to grant the remedies of specific performance and\n                            injunction. Even when awarding damages, the law does\n                            not adhere slavishly to the concept of compensation for financially\n                            measurable loss. When the circumstances require, damages are measured by\n                            reference to the benefit obtained by the wrongdoer. This\n                        applies to interference with property rights. Recently, the like approach\n                        has been adopted to breach of contract. Further, in certain circumstancesan account of profits is ordered in preference to an\n                            award of damages. Sometimes the injured party is given the\n                        choice: either compensatory damages or an account of the wrongdoer's\n                        profits. Breach of confidence is an instance of this. If confidential\n                        information is wrongfully divulged in breach of a non-disclosure agreement,\n                        it would be nothing short of sophistry to say that an account of profits may\n                        be ordered in respect of the equitable wrong but not in respect of the\n                        breach of contract which governs the relationship between the parties. With\n                        the established authorities going thus far, I consider it would be only a\n                        modest step for the law to recognise openly that, exceptionally, an account\n                        of profits may be the most appropriate remedy for breach of contract. [emphasis added] 25     In the English Court of Appeal decision ofExperience Hendrix v. PPX Enterprises Inc[2003] 1 All ER (Comm) 830 (‘Hendrix’), the claim was in respect of the grant of\n                    licenses in breach of a settlement agreement made in relation to the use of\n                    master recordings by Jimi Hendrix. The claimant obtained injunctions to restrain\n                    further releases of the recordings; it had claimed in both restitutionary\n                    damages and an account of profits. The claimant had however, conceded that it\n                    could not show financial loss as a result of the breaches prior to the\n                    injunction. The English Court of Appeal found it appropriate to draw aclose analogyfrom the decision ofAG\n                        v. Blake(where the House of Lords allowed exceptionally for anaccount of profitsto be obtained as a remedy\n                    for breach of contract), a decision described by Lord Justice Mance (at para\n                    [16]) as marking “a new start in this area of law”. Although Lord\n                    Nicholls has decidedAG v. Blakeon the basis of\n                    an award of “account of profits”, the English Court of Appeal inHendrixobserved that the decision ofAG v. Blakehas opened the door for a bolder\n                    approach in awardingrestitutionary damageswhere\n                    the claimant was unable to establish any identifiable financial loss (at\n                    [34]): Since Blake I see no reason why, if the beneficiary of a restrictive\n                        covenant is unaware of its infringement in time to obtain an injunction\n                        immediately, but is able to obtain an injunction for the future after the\n                        defendant by the infringement has obtained some benefit, the appellant\n                        should be precluded from obtaining an injunction and,if\n                            justice requires,a reasonable sum to\n                            compensate for the past infringement, even though he may not be able to\n                            show any financial loss to himself. If compensation on this\n                        basis is available in respect of the permanent deprivation of a right\n                        because the law does not consider that injunctive relief is appropriate,\n                        there seems no justification for refusing it in respect of a temporary\n                        deprivation arising because the infringement has been committed too quickly\n                        for the law to be able to intervene. In either case, though for different\n                        reasons, the compensation awarded would be in substitution for an\n                        injunction. [emphasis added] 26     In addition to the above, the English Court of\n                    Appeal inHendrixadopted an analysis similar to\n                    the awarding of an account of profits inAG v.\n                        Blake, it was found that the defendant had deliberately did what\n                    it had contracted not to do, and that the claimant had a legitimate interest in\n                    preventing the defendant from profiting from the breach. Nevertheless, there\n                    remain some differences between the two remedies. The English Court of Appeal inHendrixawarded restitutionary damages even\n                    though the circumstances were found to be insufficiently\n                    ‘exceptional’ to justify an account of profits. Lord Justice Mance\n                    described (at para [35]) a claim in restitutionary damages as a “lesser\n                    claim” than that of an account of profits, and observed (at para [24])\n                    that Lord Nicholls (inAG v. Blake) did not apply\n                    “the same epithet or qualification” of exceptionality to an award\n                    of restitutionary damages. On the contrary, the High Court inCheong Lay Yong v. Muthukumaran s/o Varthan and another[2010]\n                    3 SLR 16 at [58] stated that restitutionary damages are awarded in\n                    exceptional cases. 27     In addition, the Court of Appeal’s\n                    reference to “compensation” (see[25]above) is consistent with the observation by the Court of\n                    Appeal inWorld Wide Fund(at para [47]) that\n                    restitutionary damages are essentiallycompensatoryin nature (in reliance of Lord Hobhouse’s\n                    dissenting judgment inAG v. Blake). These\n                    observations must of course be read in light of Lord Nicholls’ observation\n                    that (AG v. Blakeat p 283): TheWrotham Park[Wrotham\n                            Park Estate Co Ltd v Parkside Homes Ltd[1974]\n                        1 WLR 798] case, therefore, still shines, rather as a solitary\n                        beacon, showing that in contract as well as tortdamages\n                            are not always narrowly confined to recoupment of financial\n                            loss. In a suitable case damages for breach of contract may\n                        be measured by the benefit gained by the wrongdoer from the breach. The\n                        defendant must make a reasonable payment in respect of the benefit he has\n                        gained. [emphasis added] 28     In addition, there is some suggestion that the\n                    object of an award in restitutionary damages isnot\n                        compensatory(thus inclining it towards a closer position to the\n                    remedy of an account of profits), from the Court of Appeal decision ofFriis and another v. Casetech Trading Pte Ltd and\n                        another[2000] 2 SLR(R) 511 where the decision of Steyn\n                    LJ’s observations inSurrey County Council v Bredero\n                        Homes Ltd[1993] 3 All ER 705 was endorsed with\n                    approval: An award of compensation for breach of contract serves to protect three\n                        separate interests. The starting principle is that the aggrieved party ought\n                        to be compensated for loss of his positive or expectation interests. In\n                        other words, the object is to put the aggrieved party in the same financial\n                        position as if the contract had been fully performed. But the law also\n                        protects the negative interest of the aggrieved party. If the aggrieved\n                        party is unable to establish the value of a loss of bargain he may seek\n                        compensation in respect of his reliance losses. The object of such an award\n                        is to compensate the aggrieved party for expenses incurred and losses\n                        suffered in reliance of the contract. These two complementary principles\n                        share one feature. Both are pure compensatory principles ... There is, however, a third principle which protects the aggrieved party's\n                        restitutionary interest. The object of such an award is not to compensate\n                        the plaintiff for a loss, but to deprive the defendant of the benefit he\n                        gained by the breach of contract. The classic illustration is a claim for\n                        the return of goods sold and delivered where the buyer has repudiated his\n                        obligation to pay the price. It is not traditional to describe a claim for\n                        restitution following a breach of contract as damages. What matters is that\n                        a coherent law of obligations must inevitably extend its protection to cover\n                        certain restitutionary interests. How far that protection should extend is\n                        the essence of the problem before us. 29     Based on the authorities ofAG v. BlakeandHendrix, I find\n                    that the remedies of restitutionary damages and an account of profits are, from\n                    apracticalperspective,similar in so faras these are remedies open to the plaintiff\n                    where the Court acknowledges the need to find anappropriate\n                        and just responseto the defendant’s breaches (by looking\n                    at the gain obtained by the defendant), in the event where the plaintiff is\n                    unable to establish any identifiable financial loss. As observed by the Court of\n                    Appeal inWorld Wide Fundat para [59] (the\n                    references to ‘compensation’ are however, reservedly debatable and\n                    as yet untested by the House of Lords): When the court makes an award of damages on the Wrotham Park basis it does\n                        so because it is satisfied that that is ajust\n                            responseto circumstances in which the compensation which is\n                        the claimant's due cannot be measured (or cannot be measured solely) by\n                        reference to identifiable financial loss. Lord Nicholls's analysis in\n                        Blake's case demonstrates that there are exceptional cases in whichthe just response to circumstances in which the\n                            compensation which is the claimant's due cannot be measured by reference\n                            to identifiable financial loss is an order which deprives the wrongdoer\n                            of all the fruits of his wrong. The circumstances in which an\n                        award of damages on the Wrotham Park basis may be an appropriate response,\n                        and those in which the appropriate response is an account of profits, may\n                        differ in degree. Butthe underlying feature, in both\n                            cases, is that the court recognises the need to compensate the claimant\n                            in circumstances where he cannot demonstrate identifiable financial\n                            loss. To label an award of damages on the Wrotham Park basis\n                        as a “compensatory” remedy and an order for an account of\n                        profits as a “gains-based” remedy does not assist an\n                        understanding of the principles on which the court acts. The two remedies\n                        should, I think, each be seen as a flexible response to the need to\n                        compensate the claimant for the wrong which has been done to him. [emphasis added] 30     In view of the similar aspect between the two\n                    remedies, I find that the plaintiffs’ application for leave to amend is in\n                    substance a backdoor approach to have a second bite at the cherry, where the\n                    plaintiffs have already submitted before the Judge for an alternative remedy in\n                    an account of profits. Allowing the plaintiffs a claim in both general damages\n                    and restitutionary damages would contradict the Final Judgment which had ordered\n                    for an account of profits to bein the alternativeto damages.",
        "Conclusion": "31     For the reasons above, I refuse leave to amend\n                    paragraph 14(f). In view of the attempt tore-litigatethe issue in relation to Gelpag GmbH (see para[18]) above, I grant the plaintiffs\n                    liberty to amend paragraph 14(f) (within 7 days of this Judgment) only to assert\n                    its position that the value of the defendant’s shares in Hua Dian may be a\n                    measure of the general damages suffered by the second and third plaintiffs (the\n                    references to restitutionary damages and the capital investment in Gelpag GmbH\n                    shall not be included). 32     The plaintiffs are to file and serve its\n                    amended Statement of Claim in relation to the amendments allowed in paragraphs\n                    14(d) and (e) within 7 days of this Judgment. The defendant is granted leave to\n                    file and serve its defence (in response to the amendments allowed for in\n                    paragraph 14(d) and (e)) within 14 days of service of the amended statement of\n                    claim. The plaintiffs are granted liberty to reply within 14 days of service of\n                    the amended defence. 33     In view of the delay in bringing the\n                    application to amend, and with regard to the fact that this episode could have\n                    been avoided as the plaintiffs could have easily raised the question of\n                    restitutionary damages when both parties appeared before the Judge to clarify\n                    the remedies available (coupled with the fact that much time has been expended\n                    by counsels in preparing authorities and submissions), I order costs to the\n                    defendant fixed at $2,800 including disbursements.  [note: 1]Annex to\n                                P’s written submissions dated 10 August\n                        10. [note: 2]Annex to P’s written submissions\n                                dated 10 August 10. [note: 3]SeeABB Holdingsat para\n                            [59]-[60]."
    }
}