{
    "case_title": "Mohammed Shahid Late Mahabubur Rahman\n      v\n      Lim Keenly Builders Pte Ltd (Tokio Marine Insurance Singapore Ltd, third\n                party)",
    "ncitation": "[2010] SGHC 142",
    "coram": "Steven Chong JC",
    "sections": {
        "Introduction": "1       The provision of insurance to cover workmen for\n                    claims against injuries and death in the course of their employment is a common\n                    feature of the construction industry. In fact, it is statutorily embodied in\n                    s 23(1) of the Workmen’s Compensation Act (Cap 354,\n                    1998 Rev Ed) (“the Act”) (now s 23(1) of the Work Injury\n                    Compensation Act (Cap 354, 2009 Rev Ed)). The principal purpose of the\n                    insurance is to ensure thatemployersprovide\n                    adequate cover for claims by workmen under the Act. Main contractors and\n                    sub-contractors, as employers, typically arrange insurance policies that they\n                    believe comprehensively cover all eventualities arising from injuries by such\n                    workmen. It is also not uncommon for the main contractor to arrange insurance\n                    policies to cover the workmen employed by its sub-contractors. 2       The question which arises in this dispute is\n                    whether the insurance policy which was arranged by the main contractor\n                    ostensibly to cover all workmen involved in the project, including those\n                    employed by its sub-contractors, coveredclaims for indemnity\n                        by the main contractoragainst its insurer in respect of its\n                    liability at common law, rather than under the Act, to workmen who wereemployed by its sub-contractor. The present\n                    dispute examines the adequacy or lack thereof of insurance policies that are\n                    arranged by main contractors in the belief that they are sufficiently\n                    comprehensive to cover all situations arising from injuries to workmen in the\n                    course of employment of the construction project. It is hoped that this decision\n                    would shed some light on the scope and coverage of such policies so that\n                    contractors and their insurance brokers can review them to determine whether\n                    they in fact cover the intended liabilities and if not, whether steps should be\n                    taken to address the gaps in future.",
        "Background Facts": "3       The plaintiff is a Bangladeshi national who was\n                    injured on 5 November 2007 while working at a factory construction site at\n                    Tuas South Avenue 3 (“the worksite”). At the material time, he was\n                    employed by Utracon Structural System Pte Ltd (“Utracon”) which\n                    was the sub-contractor engaged by the defendant (itself the main contractor\n                    engaged by M/s Kim Teck Leong (Pte) Ltd, the developer/owner of the\n                    worksite) for the post-tensioning works for the concrete flooring at the\n                    worksite. 4       While the plaintiff was working on the\n                    scaffolding at the worksite, the work platform gave way and caused him to fall\n                    through the scaffolding from a height of about nine metres. The plaintiff\n                    sustained serious injuries as a result of the fall and commenced the present\n                    action against the defendant for breach of statutory duties and for\n                    occupier’s liability. The defendant then brought the Third Party\n                    proceedings against Tokio Marine Insurance Singapore Ltd (“the\n                    Insurer”) for an indemnity under the Workmen’s Compensation Policy\n                    No DWCP07S001548 (“the WC Policy”) and/or the\n                    Contractors’ All Risks Policy No DGCR07S004322 (“the CAR\n                    Policy”) for the damages payable to the plaintiff. The Insurer denied\n                    that the indemnity claim is payable under either of the insurance\n                    policies. 5       On the first day of the trial, the plaintiff\n                    settled his claim against the defendant and interlocutory judgment was entered\n                    at 95% liability in favour of the plaintiff. Thereafter the trial continued only\n                    as to the defendant’s indemnity claim against the Insurer. At the close of\n                    the defendant’s case, the defendant clarified that it was not proceeding\n                    under the CAR Policy. The defendant’s claim therefore rests solely under\n                    the WC Policy. 6       The dispute between the parties is essentially a\n                    question of construction of the terms of the WC Policy, the most material of\n                    which is the Operative Clause, which states that: NOW THIS POLICY WITNESSETH that if any workman in the Insured’s\n                        employment shall sustain personal injury by accident or disease caused\n                        during the Period of Insurance and arising out of and in the course of his\n                        employment by the Insured in the Business, the Company will subject to the\n                        terms exceptions conditions and warranties, and any memorandum if\n                        applicable, contained herein or endorsed hereon (all of which are\n                        hereinafter collectively referred to as the Terms of this Policy) indemnify\n                        the Insured against all sums for which the Insured shall be liable to pay\n                        compensation either under the Legislation or at Common Law, and will in\n                        addition pay all costs and expenses incurred by the Insured with the written\n                        consent of the Company. 7       The defendant accepts that to succeed, the claim\n                    must come within the Operative Clause, for it is common ground that the burden\n                    of proof is on it to prove its claim under the WC Policy:Hurst v Evans[1917] 1 KB 352. 8       The parties, however, are at odds as to the true\n                    construction of the Operative Clause, and it will be helpful to set out their\n                    respective submissions, as well as the issues that arise for my\n                    consideration.",
        "The Parties’ Submissions": "9       The defendant submits that, on the true\n                    construction of the Operative Clause, the WC Policy deems the plaintiff to be a\n                    “workman in [the defendant’s] employment” who sustained\n                    personal injury by an accident “arising out of and in the course of his\n                    employment by [the defendant]”, notwithstanding that, at the material\n                    time, the plaintiff was not employed by the defendant but by its sub-contractor,\n                    Utracon. 10     The defendant has raised several interesting\n                    and creative arguments in reliance on other terms of the WC Policy in aid of its\n                    claim: (a)     First, the defendant argues that the\n                        Interpretation Clause in the WC Policy, as well as the definition of the\n                        term “employer” in the Act, support its reading of the\n                        Operative Clause. (b)     Second, the defendant relies on the “Name of the\n                        Insured” Clause under the WC Policy, which refers to the defendant\n                        and all its sub-contractors of all tiers and levels as\n                        “contractor”. It is common ground that Utracon as one of the\n                        sub-contractors was covered as an “Insured” under the WC\n                        Policy. The defendant submits that since the defendant and all its\n                        sub-contractors (including Utracon) are collectively referred to in the\n                        “Name of Insured” Clause as “contractor” in the\n                        singular, it follows, as a matter of definition, that the plaintiff should\n                        be treated as an employee of the defendant for the purposes of the WC Policy\n                        even though he was in fact employed by Utracon. In other words, both the\n                        defendant and Utracon, being defined as the singular\n                        “contractor”, are deemed by the WC Policy to be thesame“Insured”. (c)     Third, the defendant also relies on\n                        the insertion of a “Risk No 001” Clause in the WC\n                        Policy. (d)     Fourth,\n                        the defendant seeks to attach significance to the deletion of 2 Exceptions\n                        in the WC Policy. (e)     Finally, the defendant submits that, since the WC Policy is\n                        ambiguous, it should be interpreted in its favour by applying acontra proferentemconstruction. 11     The Insurer submits that, on the true\n                    construction of the WC Policy, the defendant’s claim for indemnity does\n                    not fall within the Operative Clause. 12     The Insurer accepts that the employees of\n                    Utracon were covered under the WC Policy. However, it submits that the WC Policy\n                    only responds to claims brought by one of the Insured in respect of liability,\n                    at common law or under the Act, incurred bythatInsured to any workman employed bythatInsured.\n                    Accordingly, given that the plaintiff was, at the material time, employed by\n                    Utracon, the WC Policy would only be engaged if the plaintiff had successfully\n                    sued Utracon, and the claim for indemnity against the Insurer was now being\n                    brought by Utracon. Since, however, the claim is being brought by the defendant,\n                    who wasnotthe employer of the plaintiff, the\n                    indemnity claim is not payable. Put simply, the WC Policy covers indemnity\n                    claims brought by the relevant Insured provided the liability of the relevant\n                    Insured arose as a result of a claim by a workman against the relevant Insuredqua employer. The WC Policy does not cover the\n                    relevant Insured, in this case the defendant, against its liability to the\n                    plaintiffqua occupierof the worksite. In other\n                    words, the Insurer submits that, contrary to the defendant’s submissions,\n                    the defendant and Utracon arenotdeemed by the WC\n                    Policy to be the same “Insured”. 13     The Insurer further submits that the clear\n                    position as set out in the Operative Clause is not altered by the “Name\n                    of the Insured” Clause or by the insertion of the “Risk No\n                    001” Clause or by the deletion of the Exceptions. The insertion and the\n                    deletions were to address different purposes and do not change the scope or\n                    ambit of the Operative Clause.",
        "The Issues": "14     A number of issues therefore arise for my\n                    determination, namely: (a)The effect of the definition of\n                            “Employer” in the Act on the construction of the WC\n                            Policy;(b)The effect of the “Name of Insured”\n                            Clause;(c)The effect of the “Risk No 001”\n                            Clause;(d)The effect of the deleted\n                        Exceptions;(e)The applicability of acontra\n                                proferentemconstruction of the WC Policy.15     Before I go on to examine these issues,\n                    however, I would like to say a bit more about the Operative\n                Clause.The Operative Clause16     As stated, the defendant must bring its\n                    indemnity claim within the Operative Clause in order to succeed in this action,\n                    but the main obstacle that stands in the way of the defendant is the undeniable\n                    fact that the plaintiff was not in its employment at the time of the accident.\n                    Instead, he was employed by Utracon.17     The inherent difficulty facing the defendant\n                    is self-evident when a plain reading of the Operative Clause is adopted, for it\n                    reveals that the term “Insured” must be understood as referring to\n                    different entities in order for the defendant’s claim to be\n                    maintained:NOW THIS POLICY WITNESSETH that if any workman [the\n                            plaintiff] in [Utracon’s]\n                        employment shall sustain personal injury by accident or disease caused\n                        during the Period of Insurance and arising out of and in the course of his\n                        employment by [Utracon] in the Business, the\n                        Company will subject to the terms exceptions conditions and warranties, and\n                        any memorandum if applicable, contained herein or endorsed hereon (all of\n                        which are hereinafter collectively referred to as the Terms of this Policy)\n                        indemnify [Lim Keenly (the defendant)] against\n                        all sums for which [Lim Keenly] shall be\n                        liable to pay compensation either under the Legislation or at Common Law,\n                        and will in addition pay all costs and expenses incurred by [Lim Keenly] with the written consent of the\n                        Company.18     It is obvious that the description of the\n                    “Insured” cannot mean different things in different parts of the\n                    same Operative Clause. The description must have one consistent meaning\n                    throughout the clause. Therefore if Utracon is the employer and a claim for\n                    damages is brought by the workman against Utracon, an indemnity claim by Utracon\n                    against the Insurer would fall squarely within the clause. Similarly if a claim\n                    for damages is brought against the defendant, the claim is covered provided the\n                    defendant was the employer of the workman.19     In this connection, it is perhaps apposite to\n                    refer to the defendant’s closing submission where the defendant sought to\n                    explain the scope and purpose of the WC Policy. The defendant submits that\n                    “it is common practice for main contractor [sic] in a building project to arrange for all the necessary\n                    insurance policies. The policies would insure not only the interest of the main\n                    contractor but also the interest of all their sub-contractors.” Indeed\n                    such was the case in the present dispute. The WC Policy that was arranged by the\n                    defendant did insure the interest of sub-contractors as well. There is no\n                    dispute that Utracon is covered by the WC Policy. However that is not the issue\n                    in the present action. The issue instead is whether the defendant is covered for\n                    indemnity claims against the Insurer in respect of its common law liabilities as\n                    occupier to workmen who were not in its employment but were employed by its\n                    sub-contractors.20     It is not in dispute that the plaintiff was\n                    not, at the material time, in the employment of the defendant. Neither is it\n                    disputed that the plaintiff cannot be said to be an employee by reason of any\n                    exercise of control by the defendant over him. Therefore, on a plain and\n                    ordinary reading of the WC Policy, the defendant would not be entitled to an\n                    indemnity from the Insurer in respect of the plaintiff’s successful claim\n                    against the defendant on the basis of occupier’s liability:Awang bin Dollah v Shun Shing Construction & Engineering Co\n                        Ltd[1997] 2 SLR(R) 746 (“Awang bin Dollah”) at [59].21     InAwang bin\n                        Dollah, the Court of Appeal was confronted with a similar issue,\n                    though in that case, the sub-sub-contractor, Quick Start Construction, unlike\n                    the present case, was not an insured under the policy. The Court of Appeal held,\n                    however, that even if the policy had covered Quick Start Construction, the\n                    indemnity claim against the insurer would still not be payable because the\n                    plaintiff’s case succeeded against the main contractor, the defendant, on\n                    the basis ofoccupier’sliability, and not\n                    on the basis ofemployer’sliability. The\n                    plaintiff did not succeed against the defendant on the basis of employer’s\n                    liability because the Court of Appeal had held that the plaintiff was not, at\n                    common law, employed by the defendant, nor was he held to be an employee of the\n                    defendant by reason of any right of control exercised by the defendant over him.\n                    It is pertinent to note that the operative clause of the policy inAwang bin Dollahwas in all material aspects identical\n                    to the Operative Clause at issue here.22Prima facie,\n                    therefore,Awang bin Dollahindicates that the\n                    terms “employment” and “course of employment” are to\n                    be understood as legal terms of art, bearing the specialised meanings they are\n                    understood to convey for the purposes of employer’s and vicarious\n                    liability in tort law rather than some other meaning.23     The defendant must therefore overcome the\n                    plain wording of the Operative Clause by demonstrating that the WC Policy, on\n                    its true construction, provides that the plaintiff was treated as or deemed to\n                    be in the defendant’s employment. In particular, the defendant must show\n                    that, on the true construction of the WC Policy, the term\n                    “Insured” in the Operative Clause shouldnotbe understood as referring to different entities, but should\n                    be consistently construed as referring to the defendant.Definition of “Employer” under the Workmen’s\n                Compensation Act24     The defendant sought to demonstrate this,\n                    first, by relying on the Interpretation Clause in the WC Policy which provides\n                    that:1.    ALL references to “Legislation” in\n                            this Policy shall mean the Workmen’s Compensation Act\n                            (Cap 354), amendments and re-enactments thereof and any regulations\n                            made thereunder.2.    Words used in the Policy shall have the same\n                            meaning as that defined in Legislation.25     The defendant submits that, as the term\n                    “employer” is defined in ss 2, 12(3) and 17 of the Act, these\n                    definitions should be adopted, and, as a result, the defendant can be considered\n                    the “employer” of the plaintiff and should therefore be\n                    indemnified by the Insurer.26     In particular, the defendant relies on\n                    s 17 read with s 12(3) of the Act to achieve this result, the material\n                    portions of which are set out below:Notice to Commissioner and insurer by\n                            employer12.—(1) …(2)     ...(3)     For the purposes of this section,\n                        “employer” shall include the person, if any, referred to in\n                        section 17 as the principal....Liability in case of workmen employed by\n                            contractors17.—(1)     Where any person\n                        (referred to in this section as the principal) in the course of or for the\n                        purpose of his trade or business contracts with any other person (referred\n                        to in this section as the contractor) for the execution by the contractor of\n                        the whole or any part of any work, or for the supply of labour to carry out\n                        any work, undertaken by the principal, the principal shall be liable to pay\n                        to any workman employed in the execution of the work any compensation which\n                        he would have been liable to pay if that workman had been immediately\n                        employed by him.(2)     Where a claim has been made against the\n                        principal for compensation under subsection (1), this Act shall apply as if\n                        references to the principal were substituted for references to the employer,\n                        except that the amount of compensation shall be calculated with reference to\n                        the wages of the workman under the employer by whom he is immediately\n                        employed.(3)     Where the principal is liable to pay\n                        compensation under this section, he shall be entitled to be indemnified by\n                        the person who would have been liable to pay compensation to the workman\n                        independently of this section.(4)     Nothing in this section shall be\n                        construed as preventing a workman from recovering compensation under this\n                        Act from the contractor instead of the principal, and a claim made against a\n                        principal or a contractor, as the case may be, shall not bar subsequent\n                        proceedings under this Act against the other to recover so much of the\n                        compensation as may remain unpaid.(5)     This section shall not apply in any case\n                        where the accident occurred elsewhere than at or about the place where the\n                        principal has undertaken to execute work or which is under his control or\n                        management.27     The defendant submits that, in the\n                    circumstances of this case, it should be regarded as the\n                    “principal” for the purposes of s 17, and that, since\n                    s 12(3) deems a principal to be an “employer”, and since the\n                    WC Policy adopts the same definition of words used in the Act, the plaintiff was\n                    in the defendant’s “employment” when he sustained\n                    “personal injury… arising out of and in the course of his\n                    employment” by the defendant.28     By contending that the WC Policy thereby deems\n                    the plaintiff to be in its employment, the defendant is able to preserve a\n                    sensible meaning to the term “Insured” in the Operative Clause,\n                    since, if the defendant’s contention is accepted, it will consistently\n                    refer to the defendant.29     However, the defendant’s submission that\n                    the WC Policy “deems” the plaintiff to be in the defendant’s\n                    employment by virtue of the Interpretation Clause and the various provisions of\n                    the Act is fraught with difficulties.30     As correctly highlighted by counsel for the\n                    Insurer, the relevant term in the Operative Clause is\n                    “employment”, not “employer”.\n                    “Employment” is not defined in the Act but is a concept (together\n                    with “course of employment”) well understood at common law. It is\n                    difficult to imagine why the parties would wish to define\n                    “employment” and “course of employment” collaterally\n                    by reference to the definition ofemployerin the\n                    Act whenemploymentitself is already well defined\n                    at common law. If the parties had wanted to introduce a different meaning of\n                    “employment” or “course of employment”, they could\n                    have done so expressly. Notwithstanding the Interpretation Clause of the WC\n                    Policy, it is therefore not appropriate to look to the Act for definitions of\n                    terms in the WC Policy which the Act itself does not define.31     This is confirmed byVandyke v Fender and another[1970] 2 QB 292\n                        (“Vandyke v Fender”). InVandyke v Fender, the plaintiff was injured on\n                    his way to work as a result of the negligence of the defendant, his co-worker,\n                    who was driving the car both were travelling in. The plaintiff’s\n                    employers, being vicariously liable to the plaintiff, sought to be indemnified\n                    by their insurers under a policy which provided the employers with an indemnity\n                    against liability for damages and costsif any person under a contract of service… with the insured shall\n                        sustain bodily injury… arising out of and in the course of such\n                        person’s employment by the insured in the business.32     In determining whether the plaintiff had been\n                    injured in the course of his employment, the trial judge had held that the\n                    phrase “arising out of and in the course of his employment” should\n                    be interpreted in the light of the UK National Insurance (Industrial Injuries)\n                    Act 1946 (9 & 10 Geo 6, c 62) (“the Industrial Injuries Act”),\n                    s 9(1) of which had imparted a specific meaning to the phrase “out\n                    of and in the course of his employment”.33     The English Court of Appeal disagreed, holding\n                    (at 305) that s 9(1) had only altered the interpretation of the phrase\n                    “out of and in the course of his employment” for the special\n                    purpose of the Industrial Injuries Act and not for any other purpose.\n                    Essentially, the English Court of Appeal held that the phrase “arising\n                    out of and in the course of his employment” in employer’s liability\n                    policies was to be interpreted as it had long been interpreted at common law,\n                    rather than by adopting a specific statutory definition when that statute did\n                    not purport to change the established common law position. This reasoning\n                    appliesa fortiorito the present case, for the\n                    defendant seeks to rely on the statutory definition of adifferentword,ie\n                        “employer”, in order to interpret the phrase\n                    “arising out of and in the course of hisemployment”.34     Further, s 12(3) of the Act makes clear\n                    that the definition of “employer” it sets forth is specifically\n                    “for the purposes of this section”. In my view, it is not\n                    permissible to extend the definition of “employer” in s 12(3)\n                    of the Act, expressed to be applicable only to s 12, to colour the meaning\n                    of “employment” which is a different term in a different context\n                    under the Operative Clause when the term “employment” can be\n                    objectively determined by reference to the common law:Awang\n                        bin DollahandVandyke v\n                    Fender.35     In any event, s 2 of the Act provides a\n                    definition of “employer” as follows:Interpretation2.—(1) In this Act,unless the context otherwise requires—…\"employer\" includes —(a)    the Government;(b)    any statutory body or authority;(c)    the legal personal representative of a\n                                deceased employer; and(d)    in relation to a person employed for the\n                                purpose of any game or recreation and engaged or paid through a\n                                club, the manager or members of the managing committee of that\n                                club,and where the services of an employee are temporarily lent or let on hire\n                        to another person by the person with whom the employee has entered into a\n                        contract of service or apprenticeship, the latter shall, for the purposes of\n                        this Act, be deemed to continue to be the employer of the employee whilst he\n                        is working for that other person;[emphasis added]36     From s 2, it is clear that the employer\n                    is the person with whom the workman has entered into a contract of service.\n                    Furthermore, the definition of “employer” applies unless thecontext otherwise requires. The reference in\n                    s 12(3) of the Act that the “employer” shall include any\n                    person referred to in s 17 of the Act as the principal is an example of\n                    interpreting the description of “employer” in a different context.\n                    Therefore, the default position (unless the context otherwise requires) under\n                    the Act is that the employer is the person with whom the workman has a contract\n                    of service which, in the present case, is Utracon and not the\n                defendant.Definition of “Insured” in the WC Policy37     In buttressing its submission that the term\n                    “Insured” should be consistently interpreted to refer to the\n                    defendant, emphasis is placed on the fact that the “Name of\n                    Insured” Clause in the WC Policy states:Lim Keenly Builders Pte Ltd &/or their sub-contractors of all tiers\n                        and levelas contractor&/or M/s Kim\n                        Teck Leong (Pte) Ltd &/or the Land Transport Authority as principals for\n                        their respective rights & interests.[emphasis added]38     The defendant submits that, since the parties\n                    have referred to the defendant and the sub-contractor(s) as\n                    “contractor” in the singular (as opposed to the reference to\n                    “principals” in the plural), the “Insured” in the\n                    Operative Clause must therefore refer to the “contractor”,ie boththe defendant and Utracon. Since the\n                    plaintiff was in the employment of Utracon, the defendant submits that he was\n                    therefore also, by virtue of the “Name of Insured” Clause, in the\n                    employment of the defendant, at least for the purposes of the WC\n                Policy.39     There are a number of reasons, however, why\n                    the defendant’s contention cannot be accepted.40     First, this is an extremely strained\n                    interpretation. The defendant is in essence arguing that the plaintiff should be\n                    deemed to be in its employment, not because of any express clause to that\n                    effect, but because the “Name of Insured” Clause implies that the\n                    defendant and Utracon are to be treated as one entity,vizthe “contractor”, which further implies that a\n                    workman in the employment of one can be treated as in the employment of the\n                    other (at least for the purposes of the WC Policy).41     Second, if the defendant’s\n                    interpretation is correct, it would follow that any workman in the\n                    defendant’s employment can also be treated as being in the employment of\n                    Utracon for the purposes of the WC Policy. If, therefore, one of the\n                    defendant’s workmen (“workman A”) was injured as a result of\n                    a tortious act of one of Utracon’s workmen (“workman B”),\n                    and Utracon was found vicariously liable to workman A for workman B’s\n                    tort, Utracon would, on the construction of the WC Policy urged by the\n                    defendant, be able to claim an indemnity from the Insurer, on the basis that\n                    workman A is “any workman in the Insured’s employment” who\n                    sustained a personal injury by an accident “arising out of and in the\n                    course of his employment by the Insured”. This result is so manifestly\n                    contrary to established principles of tort law that it is inconceivable that it\n                    can be achieved via an inadequately-drafted definition clause. In the absence of\n                    plain wording to such effect, I find it impossible to say that this is what the\n                    parties had contemplated all along, which reinforces the inference that the\n                    construction advocated by the defendant is not correct.42     Third, the interpretation argued for by the\n                    defendant requires the defendant and Utracon to be treated as one joint entity,vizthe “contractor”. This\n                    implies that the WC Policy is, on the defendant’s interpretation, a joint\n                    policy rather than a composite policy.43     The difference is explained byMacGillivray on Insurance Law(Nicholas Leigh-Jones Gen\n                    Ed) (London: Sweet & Maxwell, 11thEd, 2008)\n                        (“MacGillivray”) at\n                    paras 1-202 and 1-203:Joint and composite insurance. It has become\n                        commonplace for reasons of commercial convenience to insure the interests of\n                        a number of assured persons under one policy of insurance… The fact\n                        that a number of assureds are insured by one policy does not by itself make\n                        the policy a joint insurance.There cannot be a joint\n                            insurance policy unless the interests of the several persons who are\n                            interested in the subject-matter are joint interests, so that they are\n                            exposed to the same risks and will suffer a joint loss by the occurrence\n                            of an insured peril. So if two persons are joint owners of\n                        property, an insurance to indemnify both against damage to it will afford an\n                        indemnity against their common loss which they will both necessarily have\n                        suffered. The interests of such co-assureds are so inseparably connected\n                        that a loss or benefit must necessarily affect them both…Where the interests of different persons in the same insured\n                        subject-matter are diverse interests, a policy expressed to insure all\n                        interested persons must be construed as a composite policy which is intended\n                        to insure each co-assured separately in respect of his own interests.Not only does the policy wording show that it is\n                            intended to cover the different co-assureds separately for their\n                            respective interests, but perforce the elements of joint risk, joint\n                            interest and joint loss will be absent. It is usual to describe the\n                            co-assureds in a composite policy as being insured “for their\n                            respective rights and interests”, but a policy lacking\n                        that wording may nonetheless be construed as composite…[emphasis added]44     A similar discussion is found in Merkin,Colinvaux’s Law of Insurance(London:\n                    Sweet & Maxwell, 8thEd, 2006) (“Colinvaux”) at para 14-03:Joint and composite policies. Where two or\n                        more persons are insured under a single policy, it is important to determine\n                        whether the policy is joint or composite, in that the former is regarded as\n                        a single contract whereas the latter is a bundle of contracts. The\n                        distinction is based on the nature of the interests of the assureds.If the assureds share a common interest in the\n                            insured subject-matter, e.g. where they are joint owners of\n                        property or partners,the policy is joint. By contrast,\n                            if the parties have different interests, as in the case of a\n                        landlord and tenant or a mortgagor and mortgagee,the\n                            policy is composite…If the parties have separate interests in the insured subject-matter, it\n                        is established thatthe usual wording of co-insurance,\n                            which talks of the parties being insured “for their respective\n                            rights and interests”, will result in a policy covering different\n                            interests being treated as composite only.The following co-insurances have been held to be\n                            composite by their nature: mortgagor and mortgagee, owner of\n                        goods and hirer under a hire-purchase agreement, landlord and tenant,contractor and sub-contractor under a construction\n                            risks policy…[emphasis added]45     There is a clear reference in the “Name\n                    of Insured” clause that the WC Policy is “for their respective\n                    rights & interests”, which appears to militate strongly in favour of\n                    a composite policy. This is clear from the decision of Sir Wilfrid Greene\n                    MR inGeneral Accident Fire and Life Assurance\n                        Corporation Limited v Midland Bank Limited[1940]\n                    2 KB 388 (“Midland Bank”).\n                    InMidland Bank, certain premises rented by Plant\n                    Bros Ltd (“the company”) were insured against loss or damage by\n                    fire. The insurance policy was expressed to be in favour of the company, its\n                    secured creditor and the company’s landlord, “for their respective\n                    rights and interests”, and one issue was whether the insurance policy\n                    was, on its true construction, a joint policy.46     In holding that the policy was, on its true\n                    construction, a composite one, Sir Wilfrid Greene MR stated at 407-408\n                    that:…the reference to the insured in the endorsement… contains\n                        the words “for their respective rights and interests.” How is\n                        that description of the insured and that description of the indemnity to\n                        which they are to be entitled to be fitted into the printed form which uses\n                        the phrase “the insured”?It seems to me\n                            that, wherever the phrase “the insured” appeared in the\n                            printed part of this document, it would be wrong to treat that as\n                            meaning, as a matter of construction, all the three persons named in the\n                            endorsement.The printed words “the\n                            insured” must be construed and qualified by the words “for\n                            their respective rights and interests,”and those\n                        printed words must be given a construction which will fit in with the\n                        essential nature of the contract which is being undertaken.[emphasis added]47     This is not, however, a complete answer to the\n                    defendant’s submission, as the phrase “for their respective rights\n                    & interests” may refer only to, and the WC Policy may only be\n                    composite as between, the “principals” (ieM/s Kim Teck Leong (Pte) Ltd and/or the Land Transport\n                    Authority) on the one hand and the “contractor” (ieLim Keenly Builders Pte Ltd and/or their\n                    sub-contractors of all tiers and level) on the other. In other words, it is\n                    possible that the WC Policy may still be a joint policy as between the defendant\n                    and Utracon.48     This possible construction was raised by the\n                    court during closing submissions. However after due consideration, I have come\n                    to the conclusion that this possibility should be rejected for two\n                    reasons.49     First, it appears that in joint policies, all\n                    insureds must join in any action against the insurer:Lombard\n                        Australia Ltd v NRMA Insurance Ltd[1969] 1 Lloyd’s\n                    Rep 575 (“Lombard Australia”). InLombard Australia, the Court of Appeal of the\n                    Supreme Court of New South Wales held that an insurance policy taken out in the\n                    names of a hire-purchase company and its customer was a composite policy, and\n                    therefore the policy could be enforced by the plaintiff hire-purchase company\n                    against the defendant insurer, without the plaintiff having to join its\n                    customer’s executors (the customer being deceased). Derrington and Ashton,The Law of Liability Insurance(LexisNexis:\n                    Australia, 2ndEd, 2005) at para 2-404 similarly\n                    states that:If the cover provided is joint, then all insured must\n                            join in any action against the insurer, in which case it may\n                        raise any defence that it has against any of them... [emphasis added]50     In the present case, the defendant has not\n                    sought to join Utracon in its indemnity action against the\n                Insurer.51     Second, and more importantly, in principle, it\n                    is impossible to construe the WC Policy as a joint insurance, even as between\n                    the defendant and Utracon. The defendant and Utracon have not jointly suffered\n                    any loss; they have different interests in the subject matter of the insurance;\n                    there is no joint risk and there is no joint element at all:Midland Bank, at 405 (perSir\n                    Wilfrid Greene MR).52     The defendant has submitted that the\n                    distinction between joint and composite policies is limited to insurance on\n                    property, and has no application to liability insurance. It is true thatMidland BankandLombard\n                        Australiawere cases in which the subject-matter of the insurance\n                    policy was property, but there is no reason in principle why the distinction\n                    between joint and composite insurance cannot apply to liability insurance: one\n                    insures againstloss(see the definition of\n                    insurance given by Sir Peter Webster inCallaghan v Dominion\n                        Insurance Co[1997] 2 Lloyd’s Rep 541 at 544),\n                    and both damage to property as well as liability in damages to a claimant are\n                    equally losses which one may insure against.53     My view is reinforced byThe Law of Liability Insurance, paras 2-396 to 2-407, where\n                    there is an extensive and erudite discussion of joint and composite policies as\n                    applied to liability insurance, containing numerous references toMidland Bank and Lombard Australia. I quote, for\n                    instance, para 2-396, which states:The cover provided by a policy will be joint if the interests of the\n                        insured are joint, and several if the interests are several.Where two or more parties are insured under a single policy and\n                            they have other than joint responsibility or duty of care,\n                        then, even though they might be jointly as well as severally liable to a\n                        claimant, the right of the insurer to repudiate the policy as against one of\n                        them for a breach of a condition does not thereby extend to a similar right\n                        against the others.Such a policy should be treated as\n                            being several; and when a policy covers persons of different interests\n                            as a contract that is composite for convenience, it does not cover the\n                            parties jointly.[emphasis added]54     Therefore, the WC Policy is not, on its true\n                    construction, a joint policy but a composite one, and the defendant’s\n                    interpretation of the “Name of Insured” clause,vizthat the defendant and Utracon are one notional\n                    “contractor”, is not permissible. Hence, the term\n                    “contractor” in the “Name of Insured” clause cannot\n                    be “imported” into the Operative Clause, to assist the\n                    defendant’s construction of the term “Insured” in the\n                    Operative Clause to mean that the plaintiff was deemed or to be treated as its\n                    employee.The “Risk No 001” Clause55     The “Risk No 001” Clause\n                    provides as follows:RISK NO 001WORKMEN’S COMPENSATION\n                                            (PROJECT)INSURED EMPLOYEESITEM 001.ON ALL EMPLOYEES OF INSURED AND ALL TIERS\n                                            SUBCONTRACTORSContract\n                                        WagerollS$1,504,000(collectively “the description of employees”)56     It is to be noted that under s 2 of the\n                    Act, “workman” is defined as any person who has entered into a\n                    contract of service with an employer whether by way of manual labour or\n                    otherwise and whether the remuneration is calculated by time or by work done\n                    subject to various exceptions set out therein which do not apply to the present\n                    case.57     The defendant submits that the “Risk No\n                    001” Clause reinforces its interpretation of the WC Policy, insofar as it\n                    states that the “insured employees” are “all employees of\n                    insured and all tiers subcontractors”, which is much wider than the\n                    phrase “any workman in the Insured’s employment” used in the\n                    Operative Clause.58     Consequently, the defendant submits that the\n                    “Risk No 001” Clause demonstrates that workmen in the employment\n                    of Utracon in general, and the plaintiff in particular, should be deemed, under\n                    the WC Policy, to be workmen in the defendant’s employment.59     Such a construction is however at odds with\n                    the defendant’s own evidence. Mr Lye Meng Swee\n                    (“Mr Lye”), formerly the Senior Manager of HSBC Insurance\n                    Brokers (Singapore) Pte Ltd, testified on behalf of the defendant. He was the\n                    insurance broker who arranged the WC Policy on behalf of the defendant. He\n                    agreed under cross-examination that the “Risk No 001” Clause was\n                    inserted to enlarge the scope of the WC Policy, so as to ensure that it would\n                    not be limited to covering claims by workmen, but would also cover claims by any\n                    employee, including a person other than a workman as defined under the Act, of\n                    an Insured:Q… And if you look at page 38 of your\n                            affidavit… it says risk number 1 – “Risk No\n                            001” – do you see the words “INSURED\n                            EMPLOYEES” rather than “workmen”? Do you see\n                            that?AYa. “INSURED EMPLOYEES”,\n                        yes.QAnd would you not agree, therefore, that this was to\n                            comply with your request for extension to employees as\n                        well?AOkay, in the policies, okay, in this policy, you\n                            would not see any word says “workmen”, okay, employees\n                            – it – it just mention\n                        “employees”.QYes, so the operative clause refer to\n                            “workmen”, therefore, the only amendment to the operative\n                            clause is from “workmen” to “employees”. Do\n                            you agree?AIn the operative clause, it mentioned\n                            “workmen”.QYes.AOkay, in the schedule, it mentioned\n                            “employees”.QTherefore, the cover is for\n                                employees and not only workmen. Do you\n                        agree?AThe cover–CtMr –A-is for all\n                            employees.CtOkay.AThat’s – include\n                                workmen.[emphasis added]In other words, the “Risk No 001” Clause was inserted to\n                    expand the definition of a “workman”; it did not otherwise change\n                    the scope of the Operative Clause – in particular, by modifying the\n                    concept of “employment”.Deletion of Exceptions (b) and (c)60     The defendant submits that the deletion of\n                    paras (b) and (c) in the “Exceptions” Clause makes it clear that\n                    the plaintiff is deemed to be in the defendant’s employment by and for the\n                    purposes of the WC Policy.61     Exceptions (b) and (c) state, respectively,\n                    that:The Company shall not be liable in respect of(b)    The Insured’s liability to employees of\n                            independent contractors engaged by the Insured.(c)    any employee of the Insured who is not a\n                            “workman” within the meaning of the\n                        Legislation.62     Exception (b) if undeleted would exclude a\n                    claim by an Insured against the Insurer for indemnity against liability incurred\n                    by it to an employee of independent contractors engaged by the Insured. Since\n                    Exception (b) was deleted, the defendant submits that the intention must have\n                    been to cover claims against an Insured by employees of independent contractors,\n                    such as the plaintiff’s claim for occupier’s liability against the\n                    defendant.63     However the evidence adduced by the defendant\n                    revealed the purpose behind the deletion of Exceptions (b) and (c). Mr Lye\n                    agreed under cross-examination that Exception (c) was deleted because of the\n                    “Risk No 001” Clause, which extended the definition of a\n                    “workman” to include “all employees of insured and all\n                    tiers subcontractors”:QNow… can you look at Extension [sic] (c): “Any employee of the insured\n                            who is a workman within the definition of legislation”\n                            –CtWho is not.AWho – who is not.QWho is not – who is not a\n                        workman.CtYes.QAnd you wanted to cover\n                                employees, is that not correct, not only workmen but also\n                                employees?AYes.QAnd therefore deletion[sic](c) must be deleted. Is that agree\n                                –AYes.[emphasis added]64     Furthermore Mr Lye also accepted that\n                    Exception (b) was deleted to prevent conflict with Endorsement B (see[72]to[79]below):CtThe question by Mr Kuek presupposes that\n                            Exception (b) has not been deleted.AIt has been deleted.CtNo, no. The question presupposes that it has not\n                            been deleted.AOh, suppose that it has not been deleted,\n                            okay.CtYes, so – so that is the premise of the\n                            question.So if it has not been deleted, would it be\n                                inconsistent with Endorsement B, that is his\n                            question.AOh.Insured liability – er,\n                                yes, if it’s not deleted, then it’s\n                                inconsistent.[emphasis added]65     In addition, as the definition of\n                    “Insured” in the “Name of Insured” Clause included\n                    all the sub-contractors involved in the project, it would have been\n                    contradictory for Exception (b) to remain undeleted in the WC\n                Policy.66     It is therefore clear that the deletions of\n                    Exceptions (b) and (c) were to make the WC Policy consistent with the additions\n                    of the “Name of Insured” Clause, the “Risk No 001”\n                    Clause and Endorsement B. As such, they do not take the defendant’s case\n                    any further.Contra Proferentem67     In addition, the defendant submits since the\n                    WC Policy is ambiguous, thecontra proferentemrule should apply, and any ambiguity should be resolved against the Insurer as\n                    the party who drafted it.68     Thecontra\n                        proferentemrule, however, is an aid to the construction of\n                    ambiguous documents: it does not permit the artificial creation of an ambiguity\n                    in order to reach a particular result (Colinvauxat para 3-10, n 67). Even where a clause is ambiguous taken alone, thecontra proferentemrule does not apply if its\n                    meaning becomes clear in the context of the overall policy (Colinvauxat para 3-10, n 69).69     Here, the ambiguity is allegedly created by\n                    the “Name of Insured” Clause, but the ambiguity can be resolved by\n                    considering the entire policy, and thecontra\n                        proferentemrule should not be used to import any such ambiguity\n                    into the Operative Clause and thereby magnify it:Cornish v\n                        The Accident Insurance Company Limited(1889)\n                    23 QBD 453, 456perLindley LJ andMcGeown v Direct Travel Insurance[2003] EWCA Civ 1606 at [13]perAuld LJ.70     Further, if acontra\n                        proferenteminterpretation leads to inconsistency within the\n                    contract, and/or an unreasonable result, that defeats the aim of ascertaining\n                    the true construction of the WC Policy, which is to determine the objective\n                    intention of the parties as understood by a reasonable observer.71     Acontra\n                        proferentemconstruction of the WC Policy, along the lines\n                    advocated by the defendant, runs into these objections, as a consideration of\n                    Endorsement B reveals.Endorsement B72     Before I begin my analysis of the\n                    Insurer’s submission on Endorsement B, I should add that the\n                    defendant’s reliance on the various arguments set out above have not\n                    displaced the plain and ordinary meaning of the Operative Clause: namely, that\n                    the WC Policy only indemnifies any of the Insured, including the defendant,\n                    against liabilities to workmen actually employed by such Insured. It does not\n                    cover indemnity claims in respect of liabilities incurred at common law to\n                    workmen employed by sub-contractors. On these findings, it is sufficient to\n                    dispose of the claim by the defendant.73     Nevertheless, I shall consider the\n                    Insurer’s argument that the addition of Endorsement B effectively\n                    demolishes the defendant’s construction of the WC Policy. Endorsement B\n                    provides,inter alia, as follows:It is hereby understood and agreed that the indemnity herein granted is\n                        intended to cover the legal liability of the Insured to workmen in the\n                        employment of contractors performing work for the Insured while engaged in\n                        the business and occupation in respect of which the within policy is grantedbut only so far as regards Claims under any\n                            Workmen’s Compensation ActCap 354 for the time\n                        being in force in the Republic of Singapore.[emphasis added]74     The Insurer’s submission is simple and\n                    straightforward. It is to be noted that Endorsement B specifically covers\n                    “workmen in the employment of contractors performing work for the\n                    Insured”, but is limited to claims by workmen under the Act. Endorsement\n                    B is intended to be an extension of the WC Policy to cover workmen compensation\n                    claims under the Act by workmen of any contractor whoever may be the employer.\n                    However, according to the defendant, by virtue of the various other clauses of\n                    the WC Policy (egthe Interpretation Clause, the\n                    “Name of Insured” Clause and the “Risk No 001”\n                    Clause, above), Utracon and all other sub-contractors are deemed, together with\n                    the defendant, to collectively be the “contractor” and hence the\n                    “Insured”. If this is right, the Insurer submits, then there is no\n                    point in making a separate provision, via Endorsement B, for “workmen in\n                    the employment of contractors performing work for the Insured” if this is\n                    already achieved by the Operative Clause on the true construction of the WC\n                    Policy.75     Clearly, Endorsement B must have been intended\n                    for a different purpose. According to Mr Lye, Endorsement B is a specific\n                    requirement by the Land Transport Authority (“LTA”). In fact, it\n                    is expressly stated in Memorandum 3 of the WC Policy that Endorsement B is\n                    applicable to the LTA. Under s 17 of the Act, workmen of sub-contractors\n                    have a statutory right of action against the main contractor for workmen’s\n                    compensation as if the workman had been employed by the main\n                contractor.76     Counsel for the Insurer submits that\n                    Endorsement B was added to the WC Policy to enable employees of the LTA to claim\n                    for workmen’s compensation under the Act. The Insurer submits that the\n                    employees of the defendant and its sub-contractors including Utracon need not\n                    rely on Endorsement B since they have a statutory right of action under\n                    s 17 of the Act. As explained inAwang bin\n                        Dollahat [57], the purpose of s 17 of the Act is to enable\n                    the workman to bypass the privity of contract between the main contractor and\n                    the sub-contractor. However in order for s 17 to apply, the workman must be\n                    employed in the execution of works pursuant to a contract between the main\n                    contractor and the sub-contractor for the purposes of carrying out works\n                    undertaken by the main contractor. An employee of the LTA who is injured at the\n                    worksite would not be performing any work pursuant to a sub-contract between the\n                    LTA and the main contractor, and accordingly would not be entitled to rely on\n                    s 17 of the Act to claim for workmen’s compensation against the main\n                    contractor.77     In my view, Endorsement B was not added only\n                    for the benefit of the LTA. After all, Endorsement B plainly refers to the\n                    “Insured”, which, as defined in the “Name of\n                    Insured” Clause, includes a number of different parties. Instead, it is\n                    Endorsement A that was added for the benefit of the LTA (and M/s Kim Teck\n                    Leong (Pte) Ltd), as Endorsement A provides that the Insurer will indemnify the\n                    “principal” against a claim under the Act by any workman employed\n                    by the “Insured or the Insured’s Contractors”. In my\n                    opinion, Endorsement B was added to permit the relevant Insured (including but\n                    not limited to the LTA) to claim an indemnity against the Insurer for\n                    workmen’s compensation paid under the Act to workmen who were not its\n                    employees so long as such workmen were performing work for any of the\n                    contractors or sub-contractors at the time of the accident. Such a claim without\n                    Endorsement B would otherwise not be payable under the Operative\n                Clause.78     However, the extension under Endorsement B\n                    appliesonlyin respect ofworkmen’s compensation claims under the Actby\n                    “workmen in the employment of contractors performing work for the Insured\n                        [iethe defendant]”. Therefore, an\n                    indemnity cannot be obtained in respect ofcommon law\n                        claims, such as occupier’s liability, against the Insured\n                        (iethe defendant) by workmen in the\n                    employment of contractors engaged by the Insured (iethe defendant).79     Technically, however, even though workmen of\n                    sub-contractors (such as the plaintiff) have a statutory right of action against\n                    the defendant under s 17 of the Act, without Endorsement B, the defendant\n                    would not be able to claim an indemnity from the Insurer, since the Operative\n                    Clause refers to a “workman in the Insured’s [iethe defendant’s] employment”. It is not the\n                    workmen of sub-contractors (or of the LTA) who have to rely on Endorsement B in\n                    order to claim an indemnity against the defendant: they rely on their rights at\n                    common law as modified by statute to do so, rather than on an insurance contract\n                    between the defendant and the Insurer which cannot confer any rights on them. It\n                    is the defendant who must rely on Endorsement B in order to claim an indemnity\n                    from the Insurer in the event of a successful claim against it under the Act by\n                    “workmen in the employment of contractors performing work for\n                    [it]”.80     A consideration of Endorsement B therefore\n                    demonstrates that, in the context of the entire WC Policy, the defendant’s\n                    suggested construction cannot be sustained, as it would have the effect of\n                    rendering Endorsement B either otiose or contradictory.Conclusion81     It appears to me that the defendant and its\n                    insurance broker believed that the WC Policy was sufficiently comprehensive to\n                    embrace the present indemnity claim. However genuine their belief may be, the\n                    task of the court is to construe the terms of the insurance policy in order to\n                    determine its scope and whether on its true construction the indemnity claimed\n                    by the defendant is payable. Unfortunately for the defendant, the WC Policy only\n                    responds to indemnity claims brought by any of the Insured in respect of\n                    liability incurred at common law or under the Act to its employees. It does not\n                    respond to common law claims (as opposed to claims under the Act, which are\n                    brought within and covered by the WC Policy as a result of Endorsement B)\n                    brought by non-employees against the Insured as occupier of the worksite. While\n                    this may seem like an anomalous lacuna, as explained by counsel for the Insurer,\n                    it is always possible for the defendant or any insured to procure a policy to\n                    cover the current situation. That could be achieved, for example, by deleting\n                    the proviso ”but only so far as regards Claims under\n                        any Workmen’s Compensation Act Cap 354 for the time being in\n                        force”from Endorsement B. Obviously there are other ways\n                    to arrange insurance to cover the present situation. It is ultimately a question\n                    of pricing,iethe premium.82     In the result, the claim by the defendant\n                    against the Insurer is dismissed with costs to be taxed if not\n                agreed.",
        "The Operative Clause": "16     As stated, the defendant must bring its\n                    indemnity claim within the Operative Clause in order to succeed in this action,\n                    but the main obstacle that stands in the way of the defendant is the undeniable\n                    fact that the plaintiff was not in its employment at the time of the accident.\n                    Instead, he was employed by Utracon. 17     The inherent difficulty facing the defendant\n                    is self-evident when a plain reading of the Operative Clause is adopted, for it\n                    reveals that the term “Insured” must be understood as referring to\n                    different entities in order for the defendant’s claim to be\n                    maintained: NOW THIS POLICY WITNESSETH that if any workman [the\n                            plaintiff] in [Utracon’s]\n                        employment shall sustain personal injury by accident or disease caused\n                        during the Period of Insurance and arising out of and in the course of his\n                        employment by [Utracon] in the Business, the\n                        Company will subject to the terms exceptions conditions and warranties, and\n                        any memorandum if applicable, contained herein or endorsed hereon (all of\n                        which are hereinafter collectively referred to as the Terms of this Policy)\n                        indemnify [Lim Keenly (the defendant)] against\n                        all sums for which [Lim Keenly] shall be\n                        liable to pay compensation either under the Legislation or at Common Law,\n                        and will in addition pay all costs and expenses incurred by [Lim Keenly] with the written consent of the\n                        Company. 18     It is obvious that the description of the\n                    “Insured” cannot mean different things in different parts of the\n                    same Operative Clause. The description must have one consistent meaning\n                    throughout the clause. Therefore if Utracon is the employer and a claim for\n                    damages is brought by the workman against Utracon, an indemnity claim by Utracon\n                    against the Insurer would fall squarely within the clause. Similarly if a claim\n                    for damages is brought against the defendant, the claim is covered provided the\n                    defendant was the employer of the workman. 19     In this connection, it is perhaps apposite to\n                    refer to the defendant’s closing submission where the defendant sought to\n                    explain the scope and purpose of the WC Policy. The defendant submits that\n                    “it is common practice for main contractor [sic] in a building project to arrange for all the necessary\n                    insurance policies. The policies would insure not only the interest of the main\n                    contractor but also the interest of all their sub-contractors.” Indeed\n                    such was the case in the present dispute. The WC Policy that was arranged by the\n                    defendant did insure the interest of sub-contractors as well. There is no\n                    dispute that Utracon is covered by the WC Policy. However that is not the issue\n                    in the present action. The issue instead is whether the defendant is covered for\n                    indemnity claims against the Insurer in respect of its common law liabilities as\n                    occupier to workmen who were not in its employment but were employed by its\n                    sub-contractors. 20     It is not in dispute that the plaintiff was\n                    not, at the material time, in the employment of the defendant. Neither is it\n                    disputed that the plaintiff cannot be said to be an employee by reason of any\n                    exercise of control by the defendant over him. Therefore, on a plain and\n                    ordinary reading of the WC Policy, the defendant would not be entitled to an\n                    indemnity from the Insurer in respect of the plaintiff’s successful claim\n                    against the defendant on the basis of occupier’s liability:Awang bin Dollah v Shun Shing Construction & Engineering Co\n                        Ltd[1997] 2 SLR(R) 746 (“Awang bin Dollah”) at [59]. 21     InAwang bin\n                        Dollah, the Court of Appeal was confronted with a similar issue,\n                    though in that case, the sub-sub-contractor, Quick Start Construction, unlike\n                    the present case, was not an insured under the policy. The Court of Appeal held,\n                    however, that even if the policy had covered Quick Start Construction, the\n                    indemnity claim against the insurer would still not be payable because the\n                    plaintiff’s case succeeded against the main contractor, the defendant, on\n                    the basis ofoccupier’sliability, and not\n                    on the basis ofemployer’sliability. The\n                    plaintiff did not succeed against the defendant on the basis of employer’s\n                    liability because the Court of Appeal had held that the plaintiff was not, at\n                    common law, employed by the defendant, nor was he held to be an employee of the\n                    defendant by reason of any right of control exercised by the defendant over him.\n                    It is pertinent to note that the operative clause of the policy inAwang bin Dollahwas in all material aspects identical\n                    to the Operative Clause at issue here. 22Prima facie,\n                    therefore,Awang bin Dollahindicates that the\n                    terms “employment” and “course of employment” are to\n                    be understood as legal terms of art, bearing the specialised meanings they are\n                    understood to convey for the purposes of employer’s and vicarious\n                    liability in tort law rather than some other meaning. 23     The defendant must therefore overcome the\n                    plain wording of the Operative Clause by demonstrating that the WC Policy, on\n                    its true construction, provides that the plaintiff was treated as or deemed to\n                    be in the defendant’s employment. In particular, the defendant must show\n                    that, on the true construction of the WC Policy, the term\n                    “Insured” in the Operative Clause shouldnotbe understood as referring to different entities, but should\n                    be consistently construed as referring to the defendant.",
        "Definition of “Employer” under the Workmen’s\n                Compensation Act": "24     The defendant sought to demonstrate this,\n                    first, by relying on the Interpretation Clause in the WC Policy which provides\n                    that: 1.    ALL references to “Legislation” in\n                            this Policy shall mean the Workmen’s Compensation Act\n                            (Cap 354), amendments and re-enactments thereof and any regulations\n                            made thereunder. 2.    Words used in the Policy shall have the same\n                            meaning as that defined in Legislation. 25     The defendant submits that, as the term\n                    “employer” is defined in ss 2, 12(3) and 17 of the Act, these\n                    definitions should be adopted, and, as a result, the defendant can be considered\n                    the “employer” of the plaintiff and should therefore be\n                    indemnified by the Insurer. 26     In particular, the defendant relies on\n                    s 17 read with s 12(3) of the Act to achieve this result, the material\n                    portions of which are set out below: Notice to Commissioner and insurer by\n                            employer 12.—(1) … (2)     ... (3)     For the purposes of this section,\n                        “employer” shall include the person, if any, referred to in\n                        section 17 as the principal. ... Liability in case of workmen employed by\n                            contractors 17.—(1)     Where any person\n                        (referred to in this section as the principal) in the course of or for the\n                        purpose of his trade or business contracts with any other person (referred\n                        to in this section as the contractor) for the execution by the contractor of\n                        the whole or any part of any work, or for the supply of labour to carry out\n                        any work, undertaken by the principal, the principal shall be liable to pay\n                        to any workman employed in the execution of the work any compensation which\n                        he would have been liable to pay if that workman had been immediately\n                        employed by him. (2)     Where a claim has been made against the\n                        principal for compensation under subsection (1), this Act shall apply as if\n                        references to the principal were substituted for references to the employer,\n                        except that the amount of compensation shall be calculated with reference to\n                        the wages of the workman under the employer by whom he is immediately\n                        employed. (3)     Where the principal is liable to pay\n                        compensation under this section, he shall be entitled to be indemnified by\n                        the person who would have been liable to pay compensation to the workman\n                        independently of this section. (4)     Nothing in this section shall be\n                        construed as preventing a workman from recovering compensation under this\n                        Act from the contractor instead of the principal, and a claim made against a\n                        principal or a contractor, as the case may be, shall not bar subsequent\n                        proceedings under this Act against the other to recover so much of the\n                        compensation as may remain unpaid. (5)     This section shall not apply in any case\n                        where the accident occurred elsewhere than at or about the place where the\n                        principal has undertaken to execute work or which is under his control or\n                        management. 27     The defendant submits that, in the\n                    circumstances of this case, it should be regarded as the\n                    “principal” for the purposes of s 17, and that, since\n                    s 12(3) deems a principal to be an “employer”, and since the\n                    WC Policy adopts the same definition of words used in the Act, the plaintiff was\n                    in the defendant’s “employment” when he sustained\n                    “personal injury… arising out of and in the course of his\n                    employment” by the defendant. 28     By contending that the WC Policy thereby deems\n                    the plaintiff to be in its employment, the defendant is able to preserve a\n                    sensible meaning to the term “Insured” in the Operative Clause,\n                    since, if the defendant’s contention is accepted, it will consistently\n                    refer to the defendant. 29     However, the defendant’s submission that\n                    the WC Policy “deems” the plaintiff to be in the defendant’s\n                    employment by virtue of the Interpretation Clause and the various provisions of\n                    the Act is fraught with difficulties. 30     As correctly highlighted by counsel for the\n                    Insurer, the relevant term in the Operative Clause is\n                    “employment”, not “employer”.\n                    “Employment” is not defined in the Act but is a concept (together\n                    with “course of employment”) well understood at common law. It is\n                    difficult to imagine why the parties would wish to define\n                    “employment” and “course of employment” collaterally\n                    by reference to the definition ofemployerin the\n                    Act whenemploymentitself is already well defined\n                    at common law. If the parties had wanted to introduce a different meaning of\n                    “employment” or “course of employment”, they could\n                    have done so expressly. Notwithstanding the Interpretation Clause of the WC\n                    Policy, it is therefore not appropriate to look to the Act for definitions of\n                    terms in the WC Policy which the Act itself does not define. 31     This is confirmed byVandyke v Fender and another[1970] 2 QB 292\n                        (“Vandyke v Fender”). InVandyke v Fender, the plaintiff was injured on\n                    his way to work as a result of the negligence of the defendant, his co-worker,\n                    who was driving the car both were travelling in. The plaintiff’s\n                    employers, being vicariously liable to the plaintiff, sought to be indemnified\n                    by their insurers under a policy which provided the employers with an indemnity\n                    against liability for damages and costs if any person under a contract of service… with the insured shall\n                        sustain bodily injury… arising out of and in the course of such\n                        person’s employment by the insured in the business. 32     In determining whether the plaintiff had been\n                    injured in the course of his employment, the trial judge had held that the\n                    phrase “arising out of and in the course of his employment” should\n                    be interpreted in the light of the UK National Insurance (Industrial Injuries)\n                    Act 1946 (9 & 10 Geo 6, c 62) (“the Industrial Injuries Act”),\n                    s 9(1) of which had imparted a specific meaning to the phrase “out\n                    of and in the course of his employment”. 33     The English Court of Appeal disagreed, holding\n                    (at 305) that s 9(1) had only altered the interpretation of the phrase\n                    “out of and in the course of his employment” for the special\n                    purpose of the Industrial Injuries Act and not for any other purpose.\n                    Essentially, the English Court of Appeal held that the phrase “arising\n                    out of and in the course of his employment” in employer’s liability\n                    policies was to be interpreted as it had long been interpreted at common law,\n                    rather than by adopting a specific statutory definition when that statute did\n                    not purport to change the established common law position. This reasoning\n                    appliesa fortiorito the present case, for the\n                    defendant seeks to rely on the statutory definition of adifferentword,ie\n                        “employer”, in order to interpret the phrase\n                    “arising out of and in the course of hisemployment”. 34     Further, s 12(3) of the Act makes clear\n                    that the definition of “employer” it sets forth is specifically\n                    “for the purposes of this section”. In my view, it is not\n                    permissible to extend the definition of “employer” in s 12(3)\n                    of the Act, expressed to be applicable only to s 12, to colour the meaning\n                    of “employment” which is a different term in a different context\n                    under the Operative Clause when the term “employment” can be\n                    objectively determined by reference to the common law:Awang\n                        bin DollahandVandyke v\n                    Fender. 35     In any event, s 2 of the Act provides a\n                    definition of “employer” as follows: Interpretation 2.—(1) In this Act,unless the context otherwise requires— … \"employer\" includes — (a)    the Government; (b)    any statutory body or authority; (c)    the legal personal representative of a\n                                deceased employer; and (d)    in relation to a person employed for the\n                                purpose of any game or recreation and engaged or paid through a\n                                club, the manager or members of the managing committee of that\n                                club, and where the services of an employee are temporarily lent or let on hire\n                        to another person by the person with whom the employee has entered into a\n                        contract of service or apprenticeship, the latter shall, for the purposes of\n                        this Act, be deemed to continue to be the employer of the employee whilst he\n                        is working for that other person; [emphasis added] 36     From s 2, it is clear that the employer\n                    is the person with whom the workman has entered into a contract of service.\n                    Furthermore, the definition of “employer” applies unless thecontext otherwise requires. The reference in\n                    s 12(3) of the Act that the “employer” shall include any\n                    person referred to in s 17 of the Act as the principal is an example of\n                    interpreting the description of “employer” in a different context.\n                    Therefore, the default position (unless the context otherwise requires) under\n                    the Act is that the employer is the person with whom the workman has a contract\n                    of service which, in the present case, is Utracon and not the\n                defendant.",
        "Definition of “Insured” in the WC Policy": "37     In buttressing its submission that the term\n                    “Insured” should be consistently interpreted to refer to the\n                    defendant, emphasis is placed on the fact that the “Name of\n                    Insured” Clause in the WC Policy states: Lim Keenly Builders Pte Ltd &/or their sub-contractors of all tiers\n                        and levelas contractor&/or M/s Kim\n                        Teck Leong (Pte) Ltd &/or the Land Transport Authority as principals for\n                        their respective rights & interests. [emphasis added] 38     The defendant submits that, since the parties\n                    have referred to the defendant and the sub-contractor(s) as\n                    “contractor” in the singular (as opposed to the reference to\n                    “principals” in the plural), the “Insured” in the\n                    Operative Clause must therefore refer to the “contractor”,ie boththe defendant and Utracon. Since the\n                    plaintiff was in the employment of Utracon, the defendant submits that he was\n                    therefore also, by virtue of the “Name of Insured” Clause, in the\n                    employment of the defendant, at least for the purposes of the WC\n                Policy. 39     There are a number of reasons, however, why\n                    the defendant’s contention cannot be accepted. 40     First, this is an extremely strained\n                    interpretation. The defendant is in essence arguing that the plaintiff should be\n                    deemed to be in its employment, not because of any express clause to that\n                    effect, but because the “Name of Insured” Clause implies that the\n                    defendant and Utracon are to be treated as one entity,vizthe “contractor”, which further implies that a\n                    workman in the employment of one can be treated as in the employment of the\n                    other (at least for the purposes of the WC Policy). 41     Second, if the defendant’s\n                    interpretation is correct, it would follow that any workman in the\n                    defendant’s employment can also be treated as being in the employment of\n                    Utracon for the purposes of the WC Policy. If, therefore, one of the\n                    defendant’s workmen (“workman A”) was injured as a result of\n                    a tortious act of one of Utracon’s workmen (“workman B”),\n                    and Utracon was found vicariously liable to workman A for workman B’s\n                    tort, Utracon would, on the construction of the WC Policy urged by the\n                    defendant, be able to claim an indemnity from the Insurer, on the basis that\n                    workman A is “any workman in the Insured’s employment” who\n                    sustained a personal injury by an accident “arising out of and in the\n                    course of his employment by the Insured”. This result is so manifestly\n                    contrary to established principles of tort law that it is inconceivable that it\n                    can be achieved via an inadequately-drafted definition clause. In the absence of\n                    plain wording to such effect, I find it impossible to say that this is what the\n                    parties had contemplated all along, which reinforces the inference that the\n                    construction advocated by the defendant is not correct. 42     Third, the interpretation argued for by the\n                    defendant requires the defendant and Utracon to be treated as one joint entity,vizthe “contractor”. This\n                    implies that the WC Policy is, on the defendant’s interpretation, a joint\n                    policy rather than a composite policy. 43     The difference is explained byMacGillivray on Insurance Law(Nicholas Leigh-Jones Gen\n                    Ed) (London: Sweet & Maxwell, 11thEd, 2008)\n                        (“MacGillivray”) at\n                    paras 1-202 and 1-203: Joint and composite insurance. It has become\n                        commonplace for reasons of commercial convenience to insure the interests of\n                        a number of assured persons under one policy of insurance… The fact\n                        that a number of assureds are insured by one policy does not by itself make\n                        the policy a joint insurance.There cannot be a joint\n                            insurance policy unless the interests of the several persons who are\n                            interested in the subject-matter are joint interests, so that they are\n                            exposed to the same risks and will suffer a joint loss by the occurrence\n                            of an insured peril. So if two persons are joint owners of\n                        property, an insurance to indemnify both against damage to it will afford an\n                        indemnity against their common loss which they will both necessarily have\n                        suffered. The interests of such co-assureds are so inseparably connected\n                        that a loss or benefit must necessarily affect them both… Where the interests of different persons in the same insured\n                        subject-matter are diverse interests, a policy expressed to insure all\n                        interested persons must be construed as a composite policy which is intended\n                        to insure each co-assured separately in respect of his own interests.Not only does the policy wording show that it is\n                            intended to cover the different co-assureds separately for their\n                            respective interests, but perforce the elements of joint risk, joint\n                            interest and joint loss will be absent. It is usual to describe the\n                            co-assureds in a composite policy as being insured “for their\n                            respective rights and interests”, but a policy lacking\n                        that wording may nonetheless be construed as composite… [emphasis added] 44     A similar discussion is found in Merkin,Colinvaux’s Law of Insurance(London:\n                    Sweet & Maxwell, 8thEd, 2006) (“Colinvaux”) at para 14-03: Joint and composite policies. Where two or\n                        more persons are insured under a single policy, it is important to determine\n                        whether the policy is joint or composite, in that the former is regarded as\n                        a single contract whereas the latter is a bundle of contracts. The\n                        distinction is based on the nature of the interests of the assureds.If the assureds share a common interest in the\n                            insured subject-matter, e.g. where they are joint owners of\n                        property or partners,the policy is joint. By contrast,\n                            if the parties have different interests, as in the case of a\n                        landlord and tenant or a mortgagor and mortgagee,the\n                            policy is composite… If the parties have separate interests in the insured subject-matter, it\n                        is established thatthe usual wording of co-insurance,\n                            which talks of the parties being insured “for their respective\n                            rights and interests”, will result in a policy covering different\n                            interests being treated as composite only. The following co-insurances have been held to be\n                            composite by their nature: mortgagor and mortgagee, owner of\n                        goods and hirer under a hire-purchase agreement, landlord and tenant,contractor and sub-contractor under a construction\n                            risks policy… [emphasis added] 45     There is a clear reference in the “Name\n                    of Insured” clause that the WC Policy is “for their respective\n                    rights & interests”, which appears to militate strongly in favour of\n                    a composite policy. This is clear from the decision of Sir Wilfrid Greene\n                    MR inGeneral Accident Fire and Life Assurance\n                        Corporation Limited v Midland Bank Limited[1940]\n                    2 KB 388 (“Midland Bank”).\n                    InMidland Bank, certain premises rented by Plant\n                    Bros Ltd (“the company”) were insured against loss or damage by\n                    fire. The insurance policy was expressed to be in favour of the company, its\n                    secured creditor and the company’s landlord, “for their respective\n                    rights and interests”, and one issue was whether the insurance policy\n                    was, on its true construction, a joint policy. 46     In holding that the policy was, on its true\n                    construction, a composite one, Sir Wilfrid Greene MR stated at 407-408\n                    that: …the reference to the insured in the endorsement… contains\n                        the words “for their respective rights and interests.” How is\n                        that description of the insured and that description of the indemnity to\n                        which they are to be entitled to be fitted into the printed form which uses\n                        the phrase “the insured”?It seems to me\n                            that, wherever the phrase “the insured” appeared in the\n                            printed part of this document, it would be wrong to treat that as\n                            meaning, as a matter of construction, all the three persons named in the\n                            endorsement.The printed words “the\n                            insured” must be construed and qualified by the words “for\n                            their respective rights and interests,”and those\n                        printed words must be given a construction which will fit in with the\n                        essential nature of the contract which is being undertaken. [emphasis added] 47     This is not, however, a complete answer to the\n                    defendant’s submission, as the phrase “for their respective rights\n                    & interests” may refer only to, and the WC Policy may only be\n                    composite as between, the “principals” (ieM/s Kim Teck Leong (Pte) Ltd and/or the Land Transport\n                    Authority) on the one hand and the “contractor” (ieLim Keenly Builders Pte Ltd and/or their\n                    sub-contractors of all tiers and level) on the other. In other words, it is\n                    possible that the WC Policy may still be a joint policy as between the defendant\n                    and Utracon. 48     This possible construction was raised by the\n                    court during closing submissions. However after due consideration, I have come\n                    to the conclusion that this possibility should be rejected for two\n                    reasons. 49     First, it appears that in joint policies, all\n                    insureds must join in any action against the insurer:Lombard\n                        Australia Ltd v NRMA Insurance Ltd[1969] 1 Lloyd’s\n                    Rep 575 (“Lombard Australia”). InLombard Australia, the Court of Appeal of the\n                    Supreme Court of New South Wales held that an insurance policy taken out in the\n                    names of a hire-purchase company and its customer was a composite policy, and\n                    therefore the policy could be enforced by the plaintiff hire-purchase company\n                    against the defendant insurer, without the plaintiff having to join its\n                    customer’s executors (the customer being deceased). Derrington and Ashton,The Law of Liability Insurance(LexisNexis:\n                    Australia, 2ndEd, 2005) at para 2-404 similarly\n                    states that: If the cover provided is joint, then all insured must\n                            join in any action against the insurer, in which case it may\n                        raise any defence that it has against any of them... [emphasis added] 50     In the present case, the defendant has not\n                    sought to join Utracon in its indemnity action against the\n                Insurer. 51     Second, and more importantly, in principle, it\n                    is impossible to construe the WC Policy as a joint insurance, even as between\n                    the defendant and Utracon. The defendant and Utracon have not jointly suffered\n                    any loss; they have different interests in the subject matter of the insurance;\n                    there is no joint risk and there is no joint element at all:Midland Bank, at 405 (perSir\n                    Wilfrid Greene MR). 52     The defendant has submitted that the\n                    distinction between joint and composite policies is limited to insurance on\n                    property, and has no application to liability insurance. It is true thatMidland BankandLombard\n                        Australiawere cases in which the subject-matter of the insurance\n                    policy was property, but there is no reason in principle why the distinction\n                    between joint and composite insurance cannot apply to liability insurance: one\n                    insures againstloss(see the definition of\n                    insurance given by Sir Peter Webster inCallaghan v Dominion\n                        Insurance Co[1997] 2 Lloyd’s Rep 541 at 544),\n                    and both damage to property as well as liability in damages to a claimant are\n                    equally losses which one may insure against. 53     My view is reinforced byThe Law of Liability Insurance, paras 2-396 to 2-407, where\n                    there is an extensive and erudite discussion of joint and composite policies as\n                    applied to liability insurance, containing numerous references toMidland Bank and Lombard Australia. I quote, for\n                    instance, para 2-396, which states: The cover provided by a policy will be joint if the interests of the\n                        insured are joint, and several if the interests are several.Where two or more parties are insured under a single policy and\n                            they have other than joint responsibility or duty of care,\n                        then, even though they might be jointly as well as severally liable to a\n                        claimant, the right of the insurer to repudiate the policy as against one of\n                        them for a breach of a condition does not thereby extend to a similar right\n                        against the others.Such a policy should be treated as\n                            being several; and when a policy covers persons of different interests\n                            as a contract that is composite for convenience, it does not cover the\n                            parties jointly. [emphasis added] 54     Therefore, the WC Policy is not, on its true\n                    construction, a joint policy but a composite one, and the defendant’s\n                    interpretation of the “Name of Insured” clause,vizthat the defendant and Utracon are one notional\n                    “contractor”, is not permissible. Hence, the term\n                    “contractor” in the “Name of Insured” clause cannot\n                    be “imported” into the Operative Clause, to assist the\n                    defendant’s construction of the term “Insured” in the\n                    Operative Clause to mean that the plaintiff was deemed or to be treated as its\n                    employee.",
        "The “Risk No 001” Clause": "55     The “Risk No 001” Clause\n                    provides as follows: RISK NO 001WORKMEN’S COMPENSATION\n                                            (PROJECT)INSURED EMPLOYEESITEM 001.ON ALL EMPLOYEES OF INSURED AND ALL TIERS\n                                            SUBCONTRACTORSContract\n                                        WagerollS$1,504,000   (collectively “the description of employees”) 56     It is to be noted that under s 2 of the\n                    Act, “workman” is defined as any person who has entered into a\n                    contract of service with an employer whether by way of manual labour or\n                    otherwise and whether the remuneration is calculated by time or by work done\n                    subject to various exceptions set out therein which do not apply to the present\n                    case. 57     The defendant submits that the “Risk No\n                    001” Clause reinforces its interpretation of the WC Policy, insofar as it\n                    states that the “insured employees” are “all employees of\n                    insured and all tiers subcontractors”, which is much wider than the\n                    phrase “any workman in the Insured’s employment” used in the\n                    Operative Clause. 58     Consequently, the defendant submits that the\n                    “Risk No 001” Clause demonstrates that workmen in the employment\n                    of Utracon in general, and the plaintiff in particular, should be deemed, under\n                    the WC Policy, to be workmen in the defendant’s employment. 59     Such a construction is however at odds with\n                    the defendant’s own evidence. Mr Lye Meng Swee\n                    (“Mr Lye”), formerly the Senior Manager of HSBC Insurance\n                    Brokers (Singapore) Pte Ltd, testified on behalf of the defendant. He was the\n                    insurance broker who arranged the WC Policy on behalf of the defendant. He\n                    agreed under cross-examination that the “Risk No 001” Clause was\n                    inserted to enlarge the scope of the WC Policy, so as to ensure that it would\n                    not be limited to covering claims by workmen, but would also cover claims by any\n                    employee, including a person other than a workman as defined under the Act, of\n                    an Insured: Q… And if you look at page 38 of your\n                            affidavit… it says risk number 1 – “Risk No\n                            001” – do you see the words “INSURED\n                            EMPLOYEES” rather than “workmen”? Do you see\n                            that? AYa. “INSURED EMPLOYEES”,\n                        yes. QAnd would you not agree, therefore, that this was to\n                            comply with your request for extension to employees as\n                        well? AOkay, in the policies, okay, in this policy, you\n                            would not see any word says “workmen”, okay, employees\n                            – it – it just mention\n                        “employees”. QYes, so the operative clause refer to\n                            “workmen”, therefore, the only amendment to the operative\n                            clause is from “workmen” to “employees”. Do\n                            you agree? AIn the operative clause, it mentioned\n                            “workmen”. QYes. AOkay, in the schedule, it mentioned\n                            “employees”. QTherefore, the cover is for\n                                employees and not only workmen. Do you\n                        agree? AThe cover– CtMr – A-is for all\n                            employees. CtOkay. AThat’s – include\n                                workmen. [emphasis added] In other words, the “Risk No 001” Clause was inserted to\n                    expand the definition of a “workman”; it did not otherwise change\n                    the scope of the Operative Clause – in particular, by modifying the\n                    concept of “employment”.",
        "Deletion of Exceptions (b) and (c)": "60     The defendant submits that the deletion of\n                    paras (b) and (c) in the “Exceptions” Clause makes it clear that\n                    the plaintiff is deemed to be in the defendant’s employment by and for the\n                    purposes of the WC Policy. 61     Exceptions (b) and (c) state, respectively,\n                    that: The Company shall not be liable in respect of (b)    The Insured’s liability to employees of\n                            independent contractors engaged by the Insured. (c)    any employee of the Insured who is not a\n                            “workman” within the meaning of the\n                        Legislation. 62     Exception (b) if undeleted would exclude a\n                    claim by an Insured against the Insurer for indemnity against liability incurred\n                    by it to an employee of independent contractors engaged by the Insured. Since\n                    Exception (b) was deleted, the defendant submits that the intention must have\n                    been to cover claims against an Insured by employees of independent contractors,\n                    such as the plaintiff’s claim for occupier’s liability against the\n                    defendant. 63     However the evidence adduced by the defendant\n                    revealed the purpose behind the deletion of Exceptions (b) and (c). Mr Lye\n                    agreed under cross-examination that Exception (c) was deleted because of the\n                    “Risk No 001” Clause, which extended the definition of a\n                    “workman” to include “all employees of insured and all\n                    tiers subcontractors”: QNow… can you look at Extension [sic] (c): “Any employee of the insured\n                            who is a workman within the definition of legislation”\n                            – CtWho is not. AWho – who is not. QWho is not – who is not a\n                        workman. CtYes. QAnd you wanted to cover\n                                employees, is that not correct, not only workmen but also\n                                employees? AYes. QAnd therefore deletion[sic](c) must be deleted. Is that agree\n                                – AYes. [emphasis added] 64     Furthermore Mr Lye also accepted that\n                    Exception (b) was deleted to prevent conflict with Endorsement B (see[72]to[79]below): CtThe question by Mr Kuek presupposes that\n                            Exception (b) has not been deleted. AIt has been deleted. CtNo, no. The question presupposes that it has not\n                            been deleted. AOh, suppose that it has not been deleted,\n                            okay. CtYes, so – so that is the premise of the\n                            question.So if it has not been deleted, would it be\n                                inconsistent with Endorsement B, that is his\n                            question. AOh.Insured liability – er,\n                                yes, if it’s not deleted, then it’s\n                                inconsistent. [emphasis added] 65     In addition, as the definition of\n                    “Insured” in the “Name of Insured” Clause included\n                    all the sub-contractors involved in the project, it would have been\n                    contradictory for Exception (b) to remain undeleted in the WC\n                Policy. 66     It is therefore clear that the deletions of\n                    Exceptions (b) and (c) were to make the WC Policy consistent with the additions\n                    of the “Name of Insured” Clause, the “Risk No 001”\n                    Clause and Endorsement B. As such, they do not take the defendant’s case\n                    any further.",
        "Contra Proferentem": "67     In addition, the defendant submits since the\n                    WC Policy is ambiguous, thecontra proferentemrule should apply, and any ambiguity should be resolved against the Insurer as\n                    the party who drafted it. 68     Thecontra\n                        proferentemrule, however, is an aid to the construction of\n                    ambiguous documents: it does not permit the artificial creation of an ambiguity\n                    in order to reach a particular result (Colinvauxat para 3-10, n 67). Even where a clause is ambiguous taken alone, thecontra proferentemrule does not apply if its\n                    meaning becomes clear in the context of the overall policy (Colinvauxat para 3-10, n 69). 69     Here, the ambiguity is allegedly created by\n                    the “Name of Insured” Clause, but the ambiguity can be resolved by\n                    considering the entire policy, and thecontra\n                        proferentemrule should not be used to import any such ambiguity\n                    into the Operative Clause and thereby magnify it:Cornish v\n                        The Accident Insurance Company Limited(1889)\n                    23 QBD 453, 456perLindley LJ andMcGeown v Direct Travel Insurance[2003] EWCA Civ 1606 at [13]perAuld LJ. 70     Further, if acontra\n                        proferenteminterpretation leads to inconsistency within the\n                    contract, and/or an unreasonable result, that defeats the aim of ascertaining\n                    the true construction of the WC Policy, which is to determine the objective\n                    intention of the parties as understood by a reasonable observer. 71     Acontra\n                        proferentemconstruction of the WC Policy, along the lines\n                    advocated by the defendant, runs into these objections, as a consideration of\n                    Endorsement B reveals.",
        "Endorsement B": "72     Before I begin my analysis of the\n                    Insurer’s submission on Endorsement B, I should add that the\n                    defendant’s reliance on the various arguments set out above have not\n                    displaced the plain and ordinary meaning of the Operative Clause: namely, that\n                    the WC Policy only indemnifies any of the Insured, including the defendant,\n                    against liabilities to workmen actually employed by such Insured. It does not\n                    cover indemnity claims in respect of liabilities incurred at common law to\n                    workmen employed by sub-contractors. On these findings, it is sufficient to\n                    dispose of the claim by the defendant. 73     Nevertheless, I shall consider the\n                    Insurer’s argument that the addition of Endorsement B effectively\n                    demolishes the defendant’s construction of the WC Policy. Endorsement B\n                    provides,inter alia, as follows: It is hereby understood and agreed that the indemnity herein granted is\n                        intended to cover the legal liability of the Insured to workmen in the\n                        employment of contractors performing work for the Insured while engaged in\n                        the business and occupation in respect of which the within policy is grantedbut only so far as regards Claims under any\n                            Workmen’s Compensation ActCap 354 for the time\n                        being in force in the Republic of Singapore. [emphasis added] 74     The Insurer’s submission is simple and\n                    straightforward. It is to be noted that Endorsement B specifically covers\n                    “workmen in the employment of contractors performing work for the\n                    Insured”, but is limited to claims by workmen under the Act. Endorsement\n                    B is intended to be an extension of the WC Policy to cover workmen compensation\n                    claims under the Act by workmen of any contractor whoever may be the employer.\n                    However, according to the defendant, by virtue of the various other clauses of\n                    the WC Policy (egthe Interpretation Clause, the\n                    “Name of Insured” Clause and the “Risk No 001”\n                    Clause, above), Utracon and all other sub-contractors are deemed, together with\n                    the defendant, to collectively be the “contractor” and hence the\n                    “Insured”. If this is right, the Insurer submits, then there is no\n                    point in making a separate provision, via Endorsement B, for “workmen in\n                    the employment of contractors performing work for the Insured” if this is\n                    already achieved by the Operative Clause on the true construction of the WC\n                    Policy. 75     Clearly, Endorsement B must have been intended\n                    for a different purpose. According to Mr Lye, Endorsement B is a specific\n                    requirement by the Land Transport Authority (“LTA”). In fact, it\n                    is expressly stated in Memorandum 3 of the WC Policy that Endorsement B is\n                    applicable to the LTA. Under s 17 of the Act, workmen of sub-contractors\n                    have a statutory right of action against the main contractor for workmen’s\n                    compensation as if the workman had been employed by the main\n                contractor. 76     Counsel for the Insurer submits that\n                    Endorsement B was added to the WC Policy to enable employees of the LTA to claim\n                    for workmen’s compensation under the Act. The Insurer submits that the\n                    employees of the defendant and its sub-contractors including Utracon need not\n                    rely on Endorsement B since they have a statutory right of action under\n                    s 17 of the Act. As explained inAwang bin\n                        Dollahat [57], the purpose of s 17 of the Act is to enable\n                    the workman to bypass the privity of contract between the main contractor and\n                    the sub-contractor. However in order for s 17 to apply, the workman must be\n                    employed in the execution of works pursuant to a contract between the main\n                    contractor and the sub-contractor for the purposes of carrying out works\n                    undertaken by the main contractor. An employee of the LTA who is injured at the\n                    worksite would not be performing any work pursuant to a sub-contract between the\n                    LTA and the main contractor, and accordingly would not be entitled to rely on\n                    s 17 of the Act to claim for workmen’s compensation against the main\n                    contractor. 77     In my view, Endorsement B was not added only\n                    for the benefit of the LTA. After all, Endorsement B plainly refers to the\n                    “Insured”, which, as defined in the “Name of\n                    Insured” Clause, includes a number of different parties. Instead, it is\n                    Endorsement A that was added for the benefit of the LTA (and M/s Kim Teck\n                    Leong (Pte) Ltd), as Endorsement A provides that the Insurer will indemnify the\n                    “principal” against a claim under the Act by any workman employed\n                    by the “Insured or the Insured’s Contractors”. In my\n                    opinion, Endorsement B was added to permit the relevant Insured (including but\n                    not limited to the LTA) to claim an indemnity against the Insurer for\n                    workmen’s compensation paid under the Act to workmen who were not its\n                    employees so long as such workmen were performing work for any of the\n                    contractors or sub-contractors at the time of the accident. Such a claim without\n                    Endorsement B would otherwise not be payable under the Operative\n                Clause. 78     However, the extension under Endorsement B\n                    appliesonlyin respect ofworkmen’s compensation claims under the Actby\n                    “workmen in the employment of contractors performing work for the Insured\n                        [iethe defendant]”. Therefore, an\n                    indemnity cannot be obtained in respect ofcommon law\n                        claims, such as occupier’s liability, against the Insured\n                        (iethe defendant) by workmen in the\n                    employment of contractors engaged by the Insured (iethe defendant). 79     Technically, however, even though workmen of\n                    sub-contractors (such as the plaintiff) have a statutory right of action against\n                    the defendant under s 17 of the Act, without Endorsement B, the defendant\n                    would not be able to claim an indemnity from the Insurer, since the Operative\n                    Clause refers to a “workman in the Insured’s [iethe defendant’s] employment”. It is not the\n                    workmen of sub-contractors (or of the LTA) who have to rely on Endorsement B in\n                    order to claim an indemnity against the defendant: they rely on their rights at\n                    common law as modified by statute to do so, rather than on an insurance contract\n                    between the defendant and the Insurer which cannot confer any rights on them. It\n                    is the defendant who must rely on Endorsement B in order to claim an indemnity\n                    from the Insurer in the event of a successful claim against it under the Act by\n                    “workmen in the employment of contractors performing work for\n                    [it]”. 80     A consideration of Endorsement B therefore\n                    demonstrates that, in the context of the entire WC Policy, the defendant’s\n                    suggested construction cannot be sustained, as it would have the effect of\n                    rendering Endorsement B either otiose or contradictory.",
        "Conclusion": "81     It appears to me that the defendant and its\n                    insurance broker believed that the WC Policy was sufficiently comprehensive to\n                    embrace the present indemnity claim. However genuine their belief may be, the\n                    task of the court is to construe the terms of the insurance policy in order to\n                    determine its scope and whether on its true construction the indemnity claimed\n                    by the defendant is payable. Unfortunately for the defendant, the WC Policy only\n                    responds to indemnity claims brought by any of the Insured in respect of\n                    liability incurred at common law or under the Act to its employees. It does not\n                    respond to common law claims (as opposed to claims under the Act, which are\n                    brought within and covered by the WC Policy as a result of Endorsement B)\n                    brought by non-employees against the Insured as occupier of the worksite. While\n                    this may seem like an anomalous lacuna, as explained by counsel for the Insurer,\n                    it is always possible for the defendant or any insured to procure a policy to\n                    cover the current situation. That could be achieved, for example, by deleting\n                    the proviso ”but only so far as regards Claims under\n                        any Workmen’s Compensation Act Cap 354 for the time being in\n                        force”from Endorsement B. Obviously there are other ways\n                    to arrange insurance to cover the present situation. It is ultimately a question\n                    of pricing,iethe premium. 82     In the result, the claim by the defendant\n                    against the Insurer is dismissed with costs to be taxed if not\n                agreed."
    }
}