{
    "case_title": "The “Makassar Caraka Jaya Niaga III-39”",
    "ncitation": "[2010] SGHC 306",
    "coram": "Tan Lee Meng J",
    "sections": {
        "Introduction": "1       The appellant, ANL Singapore Ltd\n                    (“ANL”), instituted Admiralty in Rem No 175 of 2009 (“Adm\n                    No 175”) against the owners of the vessel, “Makassar Caraka Jaya Niaga III-39” (the “Makassar”). ANL contended in its Statement of\n                    Claim that the respondent, PT Djakarta Lloyd (Persero) (“PTDL”),\n                    an Indonesian State-owned company, owed it US$719,440.17 for slot fees due and\n                    owing under invoices rendered pursuant to a slot charterparty entitled\n                    “AAX Main Agreement”, which was entered between the parties on\n                    1 January 2008. 2       On 16 May 2009, ANL arrested theMakassar, which was registered in PTDL’s name, as\n                    security for its claim. 3       PTDL intervened in the action and claimed that\n                    although theMakassarwas registered in its name,\n                    it was actually owned by Indonesia (the “State”). PTDL asserted\n                    that it is merely the State-appointed operator of the said vessel. 4       On 24 September 2009, PTDL filed SUM\n                    5039/2009. In this Summons, PTDL sought to have theMakassarreleased and the arrest set aside. It also sought an\n                    order that ANL’s application for default judgment and sale of the vessel\n                    and all further proceedings be stayed in favour of foreign\n                arbitration. 5       On 15 January 2010, the Assistant Registrar\n                    set aside the arrest of theMakassarand ordered\n                    the release of the vessel on the ground that the requirements under s 4 (4)\n                    of the High Court (Admiralty Jurisdiction) Act (Cap 123, 2001 Rev Ed)\n                    (“the Act’) had not been satisfied. He also ordered that\n                    ANL’s application for default judgment and sale of theMakassarand all further proceedings be stayed in favour of\n                    foreign arbitration. 6       Dissatisfied with the Assistant\n                    Registrar’s decisions, ANL filed RA 16 of 2010 for the purpose of\n                    appealing against his decisions. After hearing further arguments on the matter,\n                    I reserved judgment and now set out my final conclusions and the reasons for my\n                    conclusions.",
        "Whether the writs and arrests should be set aside": "7       TheMakassarwas\n                    arrested pursuant to s 3(1)(h) and s 4(4) of the Act. The relevant\n                    part of s 3(1) of the Act provides: 3 —(1) The admiralty jurisdiction of the High Court shall be as\n                        follows, that is to say, jurisdiction to hear and determine any of the\n                        following questions or claims: ….. (h) any claim arising out of any agreement relating to the carriage of\n                        goods in a ship or to the use or hire of a ship; Section 4(4) of the Act provides: In the case …. of any such claim as is mentioned in section 3\n                        (1) (d) to (q),\n                        where — (a)the claim arises in connection with a ship;\n                            and (b)the person who would be liable on the claim in an\n                            action in personam (referred to in this subsection as the relevant\n                            person) was, when the cause of action arose, the owner or charterer of,\n                            or in possession or in control of, the ship, an action in rem may (whether or not the claim gives rise to a maritime\n                        lien on that ship) be brought in the High Court against — (i)that ship, if at the time when the action is\n                            brought the relevant person is either the beneficial owner of that ship\n                            as respects all the shares in it or the charterer of that ship under a\n                            charter by demise; or (ii)any other ship of which, at the time when the\n                            action is brought, the relevant person is thebeneficial owner as respects all the shares in\n                            it. [emphasis added] 8       ANL arrested theMakassaron the basis that PTDL is its beneficial owner. InThe Pangkalan Susu/Permina 3001[1977-1978] SLR(R) 105 (“Pangkalan\n                        Susu”), Wee Chong Jin CJ explained what\n                    “beneficial ownership” entails at [9]: The question is what do the words \"beneficially owned as respects all the\n                        shares therein\" mean in the context of the Act. These words are not defined\n                        in the Act. Apart from authority, we would construe them to refer only to\n                        such ownership of a ship as is vested in a person who has the right to sell,\n                        dispose of or alienate all the shares in that ship. Our construction would\n                        clearly cover the case of a ship owned by a person who, whether he is the\n                        legal owner or not, is in any case the equitable owner of all the shares\n                        therein. It would not, in our opinion, cover the case of a ship which is in\n                        the full possession and control of a person who is not also the equitable\n                        owner of all the shares therein. In our opinion, it would be a misuse of\n                        language to equate full possession and control of a ship with beneficial\n                        ownership as respects all the shares in a ship. The word \"ownership\"\n                        connotes title, legal or equitable whereas the expression \"possession and\n                        control\", however full and complete, is not related to title. Although a\n                        person with only full possession and control of a ship such as a demise\n                        charterer, has thebeneficialuse of her, in\n                        our opinion he does not have the beneficial ownership as respects all the\n                        shares in the ship and the ship is not \"beneficially owned as respects all\n                        the shares therein\" by him within the meaning of s 4(4). 9       The ascertainment of beneficial ownership of a\n                    vessel is a matter of Singapore law as it relates to the admiralty jurisdiction\n                    of the Singapore courts. While the court will, in the case of foreign ships,\n                    take into account relevant aspects of the relevant foreign law for a better\n                    picture of how ships may be owned or transferred in order to determine who has\n                    the beneficial ownership under that foreign law, Singapore law, being thelex fori, cannot be supplanted. 10     To explain the effect of Indonesian law\n                    relevant to the present proceedings, the parties each called an expert witness.\n                    ANL’s expert witness, Mr M Husseyn Umar\n                    (“Mr Husseyn”), has had much experience in legal and\n                    commercial work relating to shipping. He was the former Head of the Legal\n                    Division of the Indonesian Ministry of Sea Communications, a former Director for\n                    Maritime State Enterprises at the Ministry of Communications, a former President\n                    Director of PT Pann Ship Finance and Leasing Corporation, a former President\n                    Director of PT PELNI National Shipping Co, and presently a member of the\n                    Indonesian National Arbitration Board as well as partner of a Jakarta law firm,\n                    M/s Ali Budiadjo Nugroho, Reksodiputro. 11     PTDL’s expert witness was Mr Ari\n                    Wahyudi Hertanto (“Mr Ari”), a lawyer at Syahmirza Irsan\n                    Attorneys at Law, Jakarta. ANL’s counsel, Mr Toh Kian Sing SC\n                    (“Mr Toh”), pointed out that it was not apparent from\n                    Mr Ari’scurriculum vitaethat he had\n                    any special or relevant expertise with respect to the admiralty law issues in\n                    this case. InPacific Recreation Pte Ltd v SY Technology Inc\n                        and another appeal[2008] 2 SLR(R) 491 (“Pacific Recreation”), V K Rajah JA stressed at\n                    [66] that an expert “must show that he is a person specifically skilled\n                    in such foreign law” and at [67] that an expert should also show\n                    “the precise manner, and not merely the general area of inquiry”\n                    in which he or she would be of use to the court. It appears from\n                    Mr Ari’scurriculum vitaethat he\n                    graduated from the University of Indonesia with a law degree in 1998 and a\n                    Masters in Business Law in 2005, that he practised law for a few years before\n                    becoming a partner at his present law firm, and that he taught “General\n                    Theory of State” as well as “Pancasila (Indonesian)\n                    Ideology”. I thus agreed with Mr Toh that there are valid questions\n                    about Mr Ari’s suitability as an expert witness for the purpose of\n                    the present proceedings, which involves a determination of the beneficial\n                    ownership of the vessel. 12     To ascertain who is the beneficial owner of a\n                    vessel, the court may trace the history of ownership of the vessel from the time\n                    of its construction: seeThe Andres Bonifacio[1993] 3 SLR(R) 71. In the present case, it is relevant that in 1989, the\n                    Indonesian government launched a five-year plan called the “Caraka Jaya\n                    III Implementation Program” (“Caraka Jaya III”) to\n                    strengthen the Indonesian national shipping sector. A State-owned company, PT\n                    PANN (Persero) Multi Finance (“PT Pann”), was designated as the\n                    implementing agency for Caraka Jaya III. The Indonesian government obtained two\n                    offshore loans for Caraka Jaya III. It then entered into two subsidiary loan\n                    agreements with PT Pann on 27 September 1993 and 6 October 1993 to sub-loan\n                    the offshore funds to the latter to finance the construction of the vessels in\n                    question. 13     Subsequently, PT Pann faced financial problems\n                    and was unable to complete the construction of the Caraka Jaya III vessels. On 2\n                    September 1996, PTDL was directed by the Indonesian Minister of Finance to take\n                    over the duties and responsibilities of PT Pann. While the relevant shipbuilding\n                    contracts were first entered into between the shipyards and PT Pann, they were\n                    transferred to PTDL with the tacit approval of the shipyards in question. The\n                    Indonesian government provided loans to PTDL to complete the construction of the\n                    vessels. 14     On 25 February 1998, theMakassarwas delivered to PTDL by the shipyard. On\n                    22 October 1998, theMakassarwas registered\n                    in PTDL’s name at the Jakarta registry. 15     Under Singapore law, a registered owner of a\n                    vessel is, without more, its beneficial owner and the party who asserts\n                    otherwise has the burden of rebutting this presumption. The significance of this\n                    presumption of ownership has been reiterated in a number of cases. InThe Kapitan Temkin[1998] 2 SLR(R) 573\n                        (“The Kapitan Temkin”), G P\n                    Selvam J stated at [7]: What is aprima faciecase to establish\n                        jurisdiction depends on the facts of the case…. [T]he certificate of\n                        registration is important documentary evidence in deciding who the\n                        beneficial owners of a ship for purposes of jurisdiction are, especially\n                        when it is produced and relied upon on behalf of the State or a department\n                        which issued the certificate. It is so because the certificate of\n                        registration is also a certificate of ownership…. It is not\n                        conclusive but furnishes at leastprima facieevidence of the registered owner being the true owner, thus resulting in a\n                        shifting of the burden of proof. Whoever, without being registered, claims\n                        ownership must displace thatprima facieevidence\"…. Today the certificate of registration fulfils the dual\n                        function of proclaiming the nationality and ownership of the ship….\n                        In other words the person who is stated as the owner andthe State which issued the certificate would generally be estopped from\n                            asserting a contrary proposition unless the register is rectified before\n                            third parties act on it. Thus even though as a general rule the entry\n                            regarding ownership in the ship registry is not conclusive evidence of\n                            who the beneficial owners of a ship are for the purpose of s 4 of\n                            the High Court (Admiralty Jurisdiction) Act (Cap 123), in most cases it\n                            would be so. …. [T]here must be clear evidence to look\n                        beyond the register and the certificate. [emphasis added] 16     InThe Tian Sheng No\n                        8[2000] 2 Lloyd’s Rep 430, the Hong Kong Court of Final\n                    Appeal made it clear that it is not easy to prove that the registered owner of a\n                    vessel is not its beneficial owner. The Court explained at 433: It is possible that registration is, as a matter of law, not conclusive on\n                        the issue of ownership; conceivably, there are circumstances where it might\n                        be shown that the registered owner was in factnotthe legal and beneficial owner of all the shares in the\n                        ship: The fraudulent procurement of registration would be an example. But,\n                        in the general run of things, registration would be virtually conclusive,\n                        and it would take a wholly exceptional case for it to be otherwise. [emphasis in original] 17     Indonesian law also places much emphasis on\n                    the registration of ownership of a vessel as Art 46(4) of Law No 21 of 1982\n                    concerning Shipping provides as follows: As evidence that a vessel has been registered, the owner of such vessel\n                        shall be given a Certificate of Registration, which shall serve asevidence of ownershipover the vessel. [emphasis added] 18     The effect of Law No 21 of 1992 concerning\n                    Shipping was explained by ANL’s expert, Mr Husseyn, as follows in his\n                    report in his 2ndaffidavit at paras 5.9 and\n                    5.10: 5.9    We reiterate here that Law No 21 of 1992\n                            concerning Shipping, which was in effect at the time of the construction\n                            and registration of both Vessels, in its Article 46 paragraph (4)\n                            explicitly stipulates thatthe Certificate of\n                                Registration over a vessel ie Deed No 1514 and Deed 1516 shall serve\n                                as evidence of ownership over such vessel; 5.10  Consequently, the valid and legitimate owner of a\n                            vessel is the one who is registered in the Certificate of Registration\n                            (currently known as Deed of Registration orGrosse\n                                Akta Pendaftaran) of such vessel. In this case, it can be\n                            clearly concluded that both Vessels are legally and validly owned by\n                            [PTDL] as stated in Deed No 1514 and Deed No 1516. [emphasis in original] 19     PTDL submitted that Law No 21 of 1992\n                    concerning Shipping must be viewed in the context of other Indonesian laws. It\n                    insisted that the vessel was a State asset under Indonesian law because\n                    government funds had been used to purchase it. It added that State assets in the\n                    hands of a State-owned company remained State assets unless a government\n                    regulation has been passed to convert them from State assets to State equity in\n                    the said company. As no government regulation had been passed to effect such a\n                    conversion in the present case, PTDL submitted that the vessel remained a State\n                    property and should not have been arrested by ANL. PTDL’s expert,\n                    Mr Ari, who adopted a rather simplistic position, referred to Law No 19 of\n                    2003 and Law No 1 of 2004. 20     Art 4 of Law No 19 of 2003 provides as\n                    follows: (1)The capital of\n                            State-owned companies that is obtained from the State is separate from\n                            State assets. (2)Capital\n                            injection of the State into State-owned companies is sourced\n                            from: (a) State budget; (b) Reserve capitalisation; (c) Other sources. (3)Every injection of capital by the State into a\n                            State-owned company or limited liability company by way of funds from\n                            the State budget shall be effected via Government\n                        Regulations. (4)Every change in the injection of capital as\n                            described in sub-paragraph (2) above, whether it involves an increase or\n                            decrease in capital injection, and including the change of ownership\n                            structure within any shares of Persero or the limited liability company,\n                            shall be stipulated by Government Regulations. 21     Art 1 of Law No 1 of 2004 provides that\n                    “State property” refers to “any property purchased or\n                    obtained from the [national budget] or acquired from other valid source”.\n                    Furthermore, Art 41 of Law No 1 of 2004 reiterates that the government’s\n                    “equity participation” in any company “shall be stipulated\n                    under a government regulation”. 22     ANL pointed out that Mr Ari’s\n                    reliance on Law No 19 of 2003 and Law No 1 of 2004 was totally misplaced because\n                    these laws were enacted many yearsafterthe\n                    registration of the vessel in 1998. Mr Husseyn explained that Indonesian\n                    legislation does not have retrospective effect unless this has been expressly\n                    provided for in the legislation in question and there was no provision in either\n                    Law No 19 of 2003 or Law No 1 of 2004 for the retrospective application of these\n                    laws. As such, PTDL was not entitled to rely on these laws to support its\n                    assertion that theMakassaris a State\n                    asset. 23     In the face of ANL’s assertion that PTDL\n                    relied on laws that had no retrospective application, the latter clarified that\n                    its case did not depend entirely on laws enacted after the vessel was registered\n                    in 1998. PTDL contended that Law 1 of 1969, Government Regulation 12 of 1969,\n                    and Government Regulation 12 of 1998, which replaced Government Regulation 12 of\n                    1969, also support its case. However, Articles 1 and 2 of the 1969 legislation\n                    merely provide that the State may participate in a limited liability company and\n                    that its investment by way of equity participation is to be stipulated by a\n                    government regulation. Evidently, the 1969 legislation does not support\n                    PTDL’s assertion that theMakassaris State\n                    property. Government Regulation 12 of 1998 did not alter this\n                position. 24     ANL accepted that in relation to theMakassar, the use of State funds, even through loans, to\n                    finance the construction and purchase of the vessel, could and should have\n                    resulted in equity participation in PTDL in the form of shares in the company\n                    under Indonesian law if a Government regulation had been passed. It is\n                    ANL’s case that in regard to the funds loaned to PTDL for the construction\n                    of the vessels under the Caraka Jaya III project, the State had the following\n                    two options: (1)Pass a government regulation to convert the funds\n                            loaned to PTDL into the State’s equity participation in [PTDL];\n                            or(2)Treat the funds loaned to PTDL as loans and\n                            recover them in full from PTDL.25     ANL pointed out that the importance of having\n                    a government regulation to convert the State loan to PTDL into State equity was\n                    on the mind of the Indonesian Minister of Industry and Trade when he wrote to\n                    his colleague, the Minister of Finance in a letter dated 3 September 2002\n                    as follows:[I]n order tostrengthen the legal statusof\n                        24 Caraka Jaya III phase 3 ownership, therefore we suggest you to follow up\n                        the issuance process of the government regulation regarding equity\n                        participation accordance the applicable law.[emphasis added]26     ANL contended that as there was no government\n                    regulation converting the loans to PTDL to equity in the latter, the question of\n                    conversion of the loans into state equity participation in PTDL did not arise.\n                    It submitted that the lack of such a government regulation cannot have the\n                    effect of converting the loans into beneficial ownership of the shares in theMakassar, and especially so when the concept\n                    of beneficial ownership is, as Mr Huseyn pointed out, alien to Indonesian\n                    law. InThe Kapitan Temkin, G P Selvam J found at\n                    [5] that as Ukranian law does not recognise the concept of beneficial ownership,\n                    Ukranian law is of little assistance to the court for the purpose of determining\n                    who is the beneficial owner of a Ukranian vessel. The same line of reasoning\n                    applies to the limits on the usefulness of Indonesian law to determine the issue\n                    of beneficial ownership in this case.27     Mr Husseyn explained in his report in his\n                        2ndaffidavit, at paras 5.28-5.33 that the loan\n                    agreements had nothing to do with ownership of the vessel. Under the terms of\n                    the loan documentation between the Indonesian government and PTDL in 1996, the\n                    former had assumed the role of an unsecured lender as it was content to lend\n                    money to PTDL without any reservation of ownership or the security of a\n                    mortgage. Even PTDL’s expert, Mr Ari, had characterised the loans by\n                    the government to PT Pann under the Caraka III project as “loans”\n                    in para 8 of his report in his 2ndaffidavit although\n                    he classified the loans as “shareholder’s\n                loans”.28     On the question of beneficial ownership, I\n                    accept the evidence of ANL’s expert, Mr Husseyn, that Indonesian law\n                    does not support PTDL’s assertion that theMakassaris a State asset.Correspondence between PTDL and various Indonesian Ministries and\n                Agencies29     PTDL also asserted that its correspondence\n                    with Indonesian Ministries and agencies ought to be taken into account to\n                    determine the beneficial ownership of the vessel.30     To begin with, PTDL pointed out that it wrote\n                    to the Minister of State-owned Enterprises on 27 February 2009 for approval of\n                    its plan to pledge two Caraka Jaya III vessels to obtain a loan of US$3m. On 30\n                    March 2009, the Minister rejected the request to pledge the two vessels and\n                    pointed out that the vessels still bore the status of “Government Aid\n                    Whose Status Has Yet To Be Determined”. PTDL’s counsel, Mr Gan\n                    Seng Chee, argued that if his client is the beneficial owner of the vessels, it\n                    would not have required the Indonesian government’s permission to pledge\n                    the two vessels in question. However, ANL retorted that PTDL had specifically\n                    stated in its letter of 27 February 2009 to the Minister that approval for the\n                    proposed pledge was being sought “from theshareholders” of the company. Furthermore, in its letter\n                    of 11 March 2009 to the said Minister, PTDL’s Board of Commissioners\n                    referred to the earlier letter of 27 February 2009 and stated as follows:The management in [its letter dated 27 February 2009] basicallyrequests for an approval from the Share Holdersto\n                        pledge as collateral 2(two) Caraka Jaya Niaga ships in order to secure a\n                        loan for the sum of USD3,000,000.[emphasis added]31     Mr Husseyn explained that the approval\n                    from the relevant Minister was sought by PTDL as this was required under its own\n                    Articles of Association. In his report in his 1staffidavit, he stated at paras 7.29-7.31 as follows:7.29  The exchange of correspondence between [PTDL] and\n                            the Ministry of State-Owned Companies ... merely reflects the obligation\n                            of [PTDL] to consult and obtain prior approval from its shareholders to\n                            encumber its assets as security in accordance with Article 11 of\n                            Articles of Association as elaborated above.7.30  The position of the Minister of State-Owned\n                            Companies as the shareholders of [PTDL] is stipulated under Article 2\n                            point a of GR No 41/2003, which states that the Minister of State-Owned\n                            Companies shall serve as the representative of Government as the\n                            shareholders ... in a State-Owned Limited Liability [Company]\n                        ...7.31Under Indonesian law, which\n                                does not recognise the concept of beneficial ownership, the\n                                correspondence cannot be construed to impute beneficial ownership of\n                                the vessels in the Ministry of State-Owned\n                            Companies.[emphasis added]32     ANL likened PTDL’s request for approval\n                    of its proposal to pledge the vessels in question to that of a borrower seeking\n                    the consent of a financing bank before entering into a contract for the sale of\n                    the mortgaged vessel or a further mortgage over the vessel. Such approval from\n                    financial institutions providing loans to shipowners is a common feature in ship\n                    financing and does not affect the beneficial ownership of the mortgaged vessel.\n                    In any case, ANL’s counsel rightly pointed out that thePangkakan Susutest of beneficial ownership does not require\n                    that an owner of a vessel must have an absolute or unqualified right to sell,\n                    dispose of or alienate the shares. Otherwise, an owner who has mortgaged his\n                    vessel to a bank cannot be regarded as a beneficial owner of the vessel\n                    registered in his name if the bank must agree before he can dispose of the\n                    vessel.33     PTDL also relied on a letter from the\n                    Indonesian Minister of Finance to his colleague, the Minister of Transportation,\n                    on 14 April 1998, stating that he may approve the latter’s request to\n                    reallocate “the operation” of all Caraka Jaya III phase 3 vessels,\n                    a total of 24 vessels, to PTDL. According to Mr Ari, this letter had\n                    statutory force and gave PTDL a statutory right, and not a mere contractual\n                    right, to operate the vessel.34     While discussing the legal consequences of the\n                    correspondence between the Indonesian Ministry of Finance, Ministry of\n                    State-owned companies and Ministry of Industry and Trade, Mr Husseyn\n                    emphatically denied that the Minister’s letter of 14 April 1998 and other\n                    ministerial letters relied on by PTDL had any statutory force. In his report in\n                    his 2ndaffidavit, he explained as follows:5.36  The …\n                            opinion of Ari Wahyudi Hertanto, is not justifiable and has no legal and\n                            valid basis under Indonesian law…. [A]rticle 7 paragraph (1) of\n                            Law 10 of 2004 concerning Law Making (“Law on Law Making”)\n                            specifically states that the form and hierarchy of Indonesian\n                            [legislation] that carry statutory force are as follows:a)Constitution of the Republic of Indonesia of\n                                1945;b)Laws/Government Regulations in Lieu of\n                                Law;c)Government Regulations;d)Presidential Regulations;e)Regional Government Regulations.5.37  Further Article 7\n                            paragraph (4) of Law on Law Making has broadened the source of\n                            Indonesian legislation by specifically providing as\n                        follows:“Forms of legislation other than as intended\n                                in paragraph (1) above shall be recognized and is legally binding in\n                                so far as such existence is ordered by the legislation of the higher\n                                hierarchy”.Elucidation of Article 7 paragraph (4) on Law on Law Making\n                        provides as follows:“Forms of Legislation as intended in this\n                                paragraph are, inter alia,regulations issued bythe People’s Consultative Assembly and House of\n                                Representatives, Regional Representatives, Supreme Court,\n                                Constitutional Court, Financial Audit Agency, Bank Indonesia,\n                                Ministers ....”.5.38  From the above, it is clear and can be concluded\n                            that the letters from the various Ministries relied upon … ie\n                            Letter in the affidavits of Ari Wahyudi Hertanto … could not, in\n                            any way, be regarded as having statutory force, as this will be …\n                            contrary to the prevailing laws and regulations;5.39  The various letters of Ministers relied upon\n                            … are merely correspondence between the parties which cannot and\n                            does not carry any evidential weight as far as the contents are\n                            concerned.[emphasis in original]35     In relation to Mr Ari’s assertion\n                    that the Minister’s letter of 14 April 1998 gave PTDL a statutory right to\n                    operate the vessel, Mr Husseyn rebutted it as follows in his report in his\n                        2ndaffidavit at para 5.40:…. It is to be noted that [this letter] was only correspondence\n                        between the Minister of Finance and the Minister of Transportation which\n                        cannot and does not carry any evidential weight as far as the contents are\n                        concerned. In any event, the said letter does not specifically assign the\n                        operations of Caraka Jaya III phase 3 vessels to [PTDL]. Above all, the\n                        Minister of Finance does not have the right to assign the operation of both\n                        Vessels ... concerned as the valid and legal owner of both Vessels is\n                        [PTDL].36     As for PTDL’s reliance on a letter dated\n                    31 July 2009, in which the Minister of State-owned Company wrote to PTDL to\n                    point out that theMakassarand another vessel,\n                    thePontianak, are assets “owned by the\n                    State”, ANL contended that this was a self-serving letter written after\n                    the vessel had been arrested.37     I accept the expert opinion of Mr Husseyn\n                    on the effect of the correspondence relied on by PTDL. As such, I find that that\n                    the correspondence relied on by PTDL did not prove that the State is the\n                    beneficial owner of theMakassar. It should not be\n                    overlooked that although PTDL claimed that it was the mere operator of the said\n                    vessel, it furnished no evidence of the contractual documents relating to the\n                    operation of the vessel. Furthermore, although theMakassarwas arrested more than a year ago, the alleged owner of\n                    the vessel, the State has not intervened in these proceedings to assert its\n                    claim to ownership of the same. It is also noteworthy that in response to\n                    queries on the ownership of the vesselafterPTDL\n                    had already intervened in these proceedings and asserted that it was not the\n                    beneficial owner of the vessel, the Indonesian Directorate General of Sea\n                    Communications issued a statement on the ownership of the vessel on 20 October\n                    2009, which confirmed that PTDL is the owner of theMakassarand that this vessel was unencumbered. No mention was\n                    made of the State’s alleged interest in the vessel.Conclusion on beneficial ownership38     To sum up, PTDL clearly failed to displace the\n                    presumption of ownership arising from the registration of the vessel in its\n                    name. On balance, I prefer the more persuasive arguments presented by\n                    ANL’s expert, Mr Husseyn, whose views were not effectively countered\n                    by PTDL’s expert, Mr Ari. For the sake of completeness, it ought to\n                    be noted that there is no room for finding a resulting trust in favour of the\n                    State merely because it had furnished PTDL a loan for the construction of the\n                    vessel. The common intention of the parties to the Loan Agreement to create a\n                    loan for a specified purpose, namely the acquisition of the vessel, rebuts any\n                    possible presumption of a resulting trust arising from the purchase of the\n                    vessel with funds disbursed under the loan.39     For the reasons stated, I hold that PTDL is\n                    the beneficial owner of theMakassarand allowed\n                    the appeal against the Assistant Registrar’s decision to set aside the\n                    writs and the arrest of the vessel.Whether the proceedings should be stayed40     PTDL asserted that the main proceedings should\n                    be stayed in favour of arbitration as the AAX Main Agreement contains\n                    arbitration clauses requiring the parties to resolve their disputes through\n                    arbitration. Clause 17.2 of the said agreement provides:[A]ll disputes or differences arising under the Agreement which cannot be\n                        amicably resolved shall be referred to arbitration in England in accordance\n                        with the Arbitration Act 1996 together with London Maritime Arbitration\n                        Association (LMAA) terms.41     Furthermore, clause 17.4 of the said agreement\n                    provides:Notwithstanding anything in Articles 17.2 and 17.3 to the contrary, if the\n                        dispute or difference arises in relation to an outward liner cargo shipping\n                        service from Australia provided under this Agreement, then(a)    The arbitration shall be held before a single\n                            Arbitrator in Sydney, Australia and shall be conducted (to the extent\n                            that this Article makes no provision) in accordance with the UNCITRAL\n                            Arbitration Rules….42     Section 6 of the International Arbitration Act\n                    (Cap 143A, 2002, Rev Ed) (“IAA”) provides:Enforcement of international arbitration\n                            agreement6 —(1) Notwithstanding Article 8 of the Model Law, where any\n                        party to an arbitration agreement to which this Act applies institutes any\n                        proceedings in any court against any other party to the agreement in respect\n                        of any matter which is the subject of the agreement, any party to the\n                        agreement may, at any time after appearance and before delivering any\n                        pleading or taking any other step in the proceedings, apply to that court to\n                        stay the proceedings so far as the proceedings relate to that matter.(2)The court to which an application has been made in\n                            accordance with subsection (1) shall make an order, upon such terms or\n                            conditions as it may think fit, staying the proceedings so far as the\n                            proceedings relate to the matter, unless it is satisfied that the\n                            arbitration agreement is null and void, inoperative or incapable of\n                            being performed.43     InTjong Very Sumito and\n                        Ors v Antig Investments Pte Ltd[2009] 4 SLR(R) 732\n                        (“Tjong”), the Court of Appeal\n                    reiterated that s 6 of the IAA acknowledges the primacy of the specific\n                    arbitration agreement in question and made it clear at [22] that if there is a\n                    dispute, a stay under s 6 of the IAA is mandatory if there is an applicable\n                    arbitration agreement “unless the party resisting the stay can show that\n                    one of the statutory grounds for refusing a stay exists,ie, that the arbitration agreement is \"null\n                        and void, inoperative or incapable of being performed”. In\n                    the present case, there is no allegation that the arbitration agreement is null\n                    and void, inoperative or incapable of being performed.44     It cannot be overlooked that when ANL arrested\n                    theMakassar, it stated that it was “ready,\n                    willing and able to refer their disputes to arbitration”. ANL now\n                    questions whether there is a “dispute” between the parties to\n                    warrant a stay of proceedings. The word “dispute” is interpreted\n                    broadly and courts will “readily find that a dispute exists unless the\n                    defendant has unequivocally admitted that the claim is due and payable”.\n                    InTjong, the Court of Appeal explained at\n                    [69]:.…(c)    In line with the prevailing philosophy of judicial\n                            non-intervention in arbitration, the court will interpret the word\n                            \"dispute\"broadly…., and will\n                            readily find that adispute exists unless the\n                                defendant has unequivocally admittedthat the claim is\n                            due and payable ….The court should not be astute in searching for\n                            an admission of a claim, and would ordinarily be inclined to find that a\n                            claim is not admitted in all but the clearest of cases.(d)    There is undoubtedly a \"dispute\" referable to\n                            arbitration if the defendant expressly asserts that he denies the\n                            claim….[emphasis in original]45     ANL sought to rely on its correspondence with\n                    PTDL to prove that there is really no dispute as to what is owed by the latter.\n                    It also referred to a Letter of Undertaking dated 5 May 2009, in which PTDL\n                    admitted owing it “an estimated US$2.8m”. However, PTDL claimed\n                    that the letter in question did not unequivocally admit ANL’s claim and\n                    that the letter was, in any case, written on a “without prejudice”\n                    basis. Whether or not PTDL had admitted owing an estimated US$2.8m in the said\n                    correspondence between the parties or in its Letter of Undertaking, it has now\n                    denied that it owed ANL the amount claimed by the latter. PTDL added that if\n                    there was any admission of liability, it had been made by mistake. InTjong, the Court of Appeal dealt with the issue of\n                    prevarication on the alleged debtor’s part and stated at [62]:What about the case where the defendant prevaricates; first making an\n                        admission and then later purporting to deny the claim on the ground that the\n                        admission was mistaken, or fraudulently obtained, or was never made? In such\n                        a case, there might well be a dispute before the court, both over the\n                        substantive claim as well as over whether the defendant can challenge the\n                        alleged earlier admission, and the matter should ordinarily be referred to\n                        arbitration.46     In line with the approach adopted by the Court\n                    of Appeal inTjongand after taking all\n                    circumstances into account, I agreed with the Assistant Registrar that the\n                    parties should resolve their dispute by arbitration. As such, the appeal against\n                    his decision to stay the proceedings in favour of foreign arbitration is\n                    dismissed.Costs47     Each party will bear its own costs for the\n                    appeal. The order on costs below is set aside.",
        "Correspondence between PTDL and various Indonesian Ministries and\n                Agencies": "29     PTDL also asserted that its correspondence\n                    with Indonesian Ministries and agencies ought to be taken into account to\n                    determine the beneficial ownership of the vessel. 30     To begin with, PTDL pointed out that it wrote\n                    to the Minister of State-owned Enterprises on 27 February 2009 for approval of\n                    its plan to pledge two Caraka Jaya III vessels to obtain a loan of US$3m. On 30\n                    March 2009, the Minister rejected the request to pledge the two vessels and\n                    pointed out that the vessels still bore the status of “Government Aid\n                    Whose Status Has Yet To Be Determined”. PTDL’s counsel, Mr Gan\n                    Seng Chee, argued that if his client is the beneficial owner of the vessels, it\n                    would not have required the Indonesian government’s permission to pledge\n                    the two vessels in question. However, ANL retorted that PTDL had specifically\n                    stated in its letter of 27 February 2009 to the Minister that approval for the\n                    proposed pledge was being sought “from theshareholders” of the company. Furthermore, in its letter\n                    of 11 March 2009 to the said Minister, PTDL’s Board of Commissioners\n                    referred to the earlier letter of 27 February 2009 and stated as follows: The management in [its letter dated 27 February 2009] basicallyrequests for an approval from the Share Holdersto\n                        pledge as collateral 2(two) Caraka Jaya Niaga ships in order to secure a\n                        loan for the sum of USD3,000,000. [emphasis added] 31     Mr Husseyn explained that the approval\n                    from the relevant Minister was sought by PTDL as this was required under its own\n                    Articles of Association. In his report in his 1staffidavit, he stated at paras 7.29-7.31 as follows: 7.29  The exchange of correspondence between [PTDL] and\n                            the Ministry of State-Owned Companies ... merely reflects the obligation\n                            of [PTDL] to consult and obtain prior approval from its shareholders to\n                            encumber its assets as security in accordance with Article 11 of\n                            Articles of Association as elaborated above. 7.30  The position of the Minister of State-Owned\n                            Companies as the shareholders of [PTDL] is stipulated under Article 2\n                            point a of GR No 41/2003, which states that the Minister of State-Owned\n                            Companies shall serve as the representative of Government as the\n                            shareholders ... in a State-Owned Limited Liability [Company]\n                        ... 7.31Under Indonesian law, which\n                                does not recognise the concept of beneficial ownership, the\n                                correspondence cannot be construed to impute beneficial ownership of\n                                the vessels in the Ministry of State-Owned\n                            Companies. [emphasis added] 32     ANL likened PTDL’s request for approval\n                    of its proposal to pledge the vessels in question to that of a borrower seeking\n                    the consent of a financing bank before entering into a contract for the sale of\n                    the mortgaged vessel or a further mortgage over the vessel. Such approval from\n                    financial institutions providing loans to shipowners is a common feature in ship\n                    financing and does not affect the beneficial ownership of the mortgaged vessel.\n                    In any case, ANL’s counsel rightly pointed out that thePangkakan Susutest of beneficial ownership does not require\n                    that an owner of a vessel must have an absolute or unqualified right to sell,\n                    dispose of or alienate the shares. Otherwise, an owner who has mortgaged his\n                    vessel to a bank cannot be regarded as a beneficial owner of the vessel\n                    registered in his name if the bank must agree before he can dispose of the\n                    vessel. 33     PTDL also relied on a letter from the\n                    Indonesian Minister of Finance to his colleague, the Minister of Transportation,\n                    on 14 April 1998, stating that he may approve the latter’s request to\n                    reallocate “the operation” of all Caraka Jaya III phase 3 vessels,\n                    a total of 24 vessels, to PTDL. According to Mr Ari, this letter had\n                    statutory force and gave PTDL a statutory right, and not a mere contractual\n                    right, to operate the vessel. 34     While discussing the legal consequences of the\n                    correspondence between the Indonesian Ministry of Finance, Ministry of\n                    State-owned companies and Ministry of Industry and Trade, Mr Husseyn\n                    emphatically denied that the Minister’s letter of 14 April 1998 and other\n                    ministerial letters relied on by PTDL had any statutory force. In his report in\n                    his 2ndaffidavit, he explained as follows: 5.36  The …\n                            opinion of Ari Wahyudi Hertanto, is not justifiable and has no legal and\n                            valid basis under Indonesian law…. [A]rticle 7 paragraph (1) of\n                            Law 10 of 2004 concerning Law Making (“Law on Law Making”)\n                            specifically states that the form and hierarchy of Indonesian\n                            [legislation] that carry statutory force are as follows: a)Constitution of the Republic of Indonesia of\n                                1945; b)Laws/Government Regulations in Lieu of\n                                Law; c)Government Regulations; d)Presidential Regulations; e)Regional Government Regulations. 5.37  Further Article 7\n                            paragraph (4) of Law on Law Making has broadened the source of\n                            Indonesian legislation by specifically providing as\n                        follows: “Forms of legislation other than as intended\n                                in paragraph (1) above shall be recognized and is legally binding in\n                                so far as such existence is ordered by the legislation of the higher\n                                hierarchy”. Elucidation of Article 7 paragraph (4) on Law on Law Making\n                        provides as follows: “Forms of Legislation as intended in this\n                                paragraph are, inter alia,regulations issued bythe People’s Consultative Assembly and House of\n                                Representatives, Regional Representatives, Supreme Court,\n                                Constitutional Court, Financial Audit Agency, Bank Indonesia,\n                                Ministers ....”. 5.38  From the above, it is clear and can be concluded\n                            that the letters from the various Ministries relied upon … ie\n                            Letter in the affidavits of Ari Wahyudi Hertanto … could not, in\n                            any way, be regarded as having statutory force, as this will be …\n                            contrary to the prevailing laws and regulations; 5.39  The various letters of Ministers relied upon\n                            … are merely correspondence between the parties which cannot and\n                            does not carry any evidential weight as far as the contents are\n                            concerned. [emphasis in original] 35     In relation to Mr Ari’s assertion\n                    that the Minister’s letter of 14 April 1998 gave PTDL a statutory right to\n                    operate the vessel, Mr Husseyn rebutted it as follows in his report in his\n                        2ndaffidavit at para 5.40: …. It is to be noted that [this letter] was only correspondence\n                        between the Minister of Finance and the Minister of Transportation which\n                        cannot and does not carry any evidential weight as far as the contents are\n                        concerned. In any event, the said letter does not specifically assign the\n                        operations of Caraka Jaya III phase 3 vessels to [PTDL]. Above all, the\n                        Minister of Finance does not have the right to assign the operation of both\n                        Vessels ... concerned as the valid and legal owner of both Vessels is\n                        [PTDL]. 36     As for PTDL’s reliance on a letter dated\n                    31 July 2009, in which the Minister of State-owned Company wrote to PTDL to\n                    point out that theMakassarand another vessel,\n                    thePontianak, are assets “owned by the\n                    State”, ANL contended that this was a self-serving letter written after\n                    the vessel had been arrested. 37     I accept the expert opinion of Mr Husseyn\n                    on the effect of the correspondence relied on by PTDL. As such, I find that that\n                    the correspondence relied on by PTDL did not prove that the State is the\n                    beneficial owner of theMakassar. It should not be\n                    overlooked that although PTDL claimed that it was the mere operator of the said\n                    vessel, it furnished no evidence of the contractual documents relating to the\n                    operation of the vessel. Furthermore, although theMakassarwas arrested more than a year ago, the alleged owner of\n                    the vessel, the State has not intervened in these proceedings to assert its\n                    claim to ownership of the same. It is also noteworthy that in response to\n                    queries on the ownership of the vesselafterPTDL\n                    had already intervened in these proceedings and asserted that it was not the\n                    beneficial owner of the vessel, the Indonesian Directorate General of Sea\n                    Communications issued a statement on the ownership of the vessel on 20 October\n                    2009, which confirmed that PTDL is the owner of theMakassarand that this vessel was unencumbered. No mention was\n                    made of the State’s alleged interest in the vessel. Conclusion on beneficial ownership 38     To sum up, PTDL clearly failed to displace the\n                    presumption of ownership arising from the registration of the vessel in its\n                    name. On balance, I prefer the more persuasive arguments presented by\n                    ANL’s expert, Mr Husseyn, whose views were not effectively countered\n                    by PTDL’s expert, Mr Ari. For the sake of completeness, it ought to\n                    be noted that there is no room for finding a resulting trust in favour of the\n                    State merely because it had furnished PTDL a loan for the construction of the\n                    vessel. The common intention of the parties to the Loan Agreement to create a\n                    loan for a specified purpose, namely the acquisition of the vessel, rebuts any\n                    possible presumption of a resulting trust arising from the purchase of the\n                    vessel with funds disbursed under the loan. 39     For the reasons stated, I hold that PTDL is\n                    the beneficial owner of theMakassarand allowed\n                    the appeal against the Assistant Registrar’s decision to set aside the\n                    writs and the arrest of the vessel.",
        "Whether the proceedings should be stayed": "40     PTDL asserted that the main proceedings should\n                    be stayed in favour of arbitration as the AAX Main Agreement contains\n                    arbitration clauses requiring the parties to resolve their disputes through\n                    arbitration. Clause 17.2 of the said agreement provides: [A]ll disputes or differences arising under the Agreement which cannot be\n                        amicably resolved shall be referred to arbitration in England in accordance\n                        with the Arbitration Act 1996 together with London Maritime Arbitration\n                        Association (LMAA) terms. 41     Furthermore, clause 17.4 of the said agreement\n                    provides: Notwithstanding anything in Articles 17.2 and 17.3 to the contrary, if the\n                        dispute or difference arises in relation to an outward liner cargo shipping\n                        service from Australia provided under this Agreement, then (a)    The arbitration shall be held before a single\n                            Arbitrator in Sydney, Australia and shall be conducted (to the extent\n                            that this Article makes no provision) in accordance with the UNCITRAL\n                            Arbitration Rules…. 42     Section 6 of the International Arbitration Act\n                    (Cap 143A, 2002, Rev Ed) (“IAA”) provides: Enforcement of international arbitration\n                            agreement 6 —(1) Notwithstanding Article 8 of the Model Law, where any\n                        party to an arbitration agreement to which this Act applies institutes any\n                        proceedings in any court against any other party to the agreement in respect\n                        of any matter which is the subject of the agreement, any party to the\n                        agreement may, at any time after appearance and before delivering any\n                        pleading or taking any other step in the proceedings, apply to that court to\n                        stay the proceedings so far as the proceedings relate to that matter. (2)The court to which an application has been made in\n                            accordance with subsection (1) shall make an order, upon such terms or\n                            conditions as it may think fit, staying the proceedings so far as the\n                            proceedings relate to the matter, unless it is satisfied that the\n                            arbitration agreement is null and void, inoperative or incapable of\n                            being performed. 43     InTjong Very Sumito and\n                        Ors v Antig Investments Pte Ltd[2009] 4 SLR(R) 732\n                        (“Tjong”), the Court of Appeal\n                    reiterated that s 6 of the IAA acknowledges the primacy of the specific\n                    arbitration agreement in question and made it clear at [22] that if there is a\n                    dispute, a stay under s 6 of the IAA is mandatory if there is an applicable\n                    arbitration agreement “unless the party resisting the stay can show that\n                    one of the statutory grounds for refusing a stay exists,ie, that the arbitration agreement is \"null\n                        and void, inoperative or incapable of being performed”. In\n                    the present case, there is no allegation that the arbitration agreement is null\n                    and void, inoperative or incapable of being performed. 44     It cannot be overlooked that when ANL arrested\n                    theMakassar, it stated that it was “ready,\n                    willing and able to refer their disputes to arbitration”. ANL now\n                    questions whether there is a “dispute” between the parties to\n                    warrant a stay of proceedings. The word “dispute” is interpreted\n                    broadly and courts will “readily find that a dispute exists unless the\n                    defendant has unequivocally admitted that the claim is due and payable”.\n                    InTjong, the Court of Appeal explained at\n                    [69]: .… (c)    In line with the prevailing philosophy of judicial\n                            non-intervention in arbitration, the court will interpret the word\n                            \"dispute\"broadly…., and will\n                            readily find that adispute exists unless the\n                                defendant has unequivocally admittedthat the claim is\n                            due and payable ….The court should not be astute in searching for\n                            an admission of a claim, and would ordinarily be inclined to find that a\n                            claim is not admitted in all but the clearest of cases. (d)    There is undoubtedly a \"dispute\" referable to\n                            arbitration if the defendant expressly asserts that he denies the\n                            claim…. [emphasis in original] 45     ANL sought to rely on its correspondence with\n                    PTDL to prove that there is really no dispute as to what is owed by the latter.\n                    It also referred to a Letter of Undertaking dated 5 May 2009, in which PTDL\n                    admitted owing it “an estimated US$2.8m”. However, PTDL claimed\n                    that the letter in question did not unequivocally admit ANL’s claim and\n                    that the letter was, in any case, written on a “without prejudice”\n                    basis. Whether or not PTDL had admitted owing an estimated US$2.8m in the said\n                    correspondence between the parties or in its Letter of Undertaking, it has now\n                    denied that it owed ANL the amount claimed by the latter. PTDL added that if\n                    there was any admission of liability, it had been made by mistake. InTjong, the Court of Appeal dealt with the issue of\n                    prevarication on the alleged debtor’s part and stated at [62]: What about the case where the defendant prevaricates; first making an\n                        admission and then later purporting to deny the claim on the ground that the\n                        admission was mistaken, or fraudulently obtained, or was never made? In such\n                        a case, there might well be a dispute before the court, both over the\n                        substantive claim as well as over whether the defendant can challenge the\n                        alleged earlier admission, and the matter should ordinarily be referred to\n                        arbitration. 46     In line with the approach adopted by the Court\n                    of Appeal inTjongand after taking all\n                    circumstances into account, I agreed with the Assistant Registrar that the\n                    parties should resolve their dispute by arbitration. As such, the appeal against\n                    his decision to stay the proceedings in favour of foreign arbitration is\n                    dismissed.",
        "Costs": "47     Each party will bear its own costs for the\n                    appeal. The order on costs below is set aside."
    }
}