{
    "case_title": "Kong Swee Eng\n      v\n      Rolles Rudolf Jurgen August",
    "ncitation": "[2010] SGHC 300",
    "coram": "Steven Chong J",
    "sections": {
        "Introduction": "1       The present action arose out of an agreement for\n                    the sale and purchase of 3,218,458 ordinary shares (“the S&P\n                    Agreement”) in Golden Oriental Pte Ltd (“the Company”).\n                    These shares (“the Shares”) were sold by the defendant to the\n                    plaintiff pursuant to a Charge dated 9 March 2007 (“the\n                    Charge”) granted by Mr Guo Ze Ming (“Guo”), the former\n                    founder, director and majority shareholder of the Company, in favour of the\n                    defendant and several other shareholders. In brief, the plaintiff in this action\n                    sought to be released from her obligation to complete the sale and purchase and\n                    also for the refund of her deposit of $500,000, on the principal ground that the\n                    Shares that were sold to her were still encumbered by a subsequent charge in\n                    favour of United Overseas Bank Limited (“the UOB charge”) and the\n                    sale was therefore in breach of a condition precedent of the S&P Agreement\n                    which required the Shares to be free from all encumbrances. This dispute has\n                    raised an interesting question of law whether the sale of the Shares by the\n                    defendant pursuant to acontractualas opposed to\n                    astatutorypower of sale had overreached the UOB\n                    charge, such that the plaintiff took the Shares free from the UOB charge and\n                    UOB’s interest in the Shares was transferred to the actual proceeds of the\n                    sale.",
        "The material facts": "",
        "The First Investment Agreement": "2       On 8 March 2007, the defendant together\n                    with three other investors namely, Ms Goh Bee Lan\n                    (“Ms Goh”), Ms Chong Li Pin\n                    (“Ms Chong”) and Mr Wong Tat Hei\n                    (“Mr Wong”) (collectively “the Investors”)\n                    entered into a Sale and Purchase Agreement (“the First Investment\n                    Agreement”) with Guo and the Company, under which, in return for 6% of\n                    the Company’s ordinary shares (“the sale shares”), they\n                    collectively invested $2 million in the following proportions: InvestorContributionNumber of sharesThe\n                                    defendant$1.3\n                                    million390Ms Goh$300,00090Mr Wong$300,00090Ms Chong$100,00030   3       To protect their investment, the Investors\n                    obtained an undertaking that Guo and the Company would use their best endeavours\n                    to procure a listing of the Company’s shares (“the undertaking to\n                    list”) by 31 December 2008 (“the deadline”), and\n                    in the event that the listing was not achieved by then, the Investors were\n                    entitled to exercise a put option requiring Guo and/or the Company to buy the\n                    sale shares back from the Investors at an agreed “put” price\n                    calculated at their respective contributions plus a premium of\n                20%. 4       To further secure the performance of the\n                    Company’s and Guo’s obligations under the First Investment\n                    Agreement, Guo executed the Charge on 9 March 2007 in favour of the\n                    Investors.",
        "The Charge": "5       The Charge was granted by Guo in favour of the\n                    Investors (including the defendant) by way of a fixed charge free from any\n                    security interest, all his present and future rights, title and interest in all\n                    his shares in the Company. Under clause 8, the Investors were entitled to\n                    enforce the Charge upon the Company and/or Guo’s default under the First\n                    Investment Agreement to secure payment and discharge of the Company or\n                    Guo’s indebtedness towards the Investors. A power of sale was specifically\n                    conferred on the Investors under clause 8.2: 8.    ENFORCEMENT OF\n                            SECURITY 8.1    The security hereby\n                            constituted shall become immediately enforceable upon the occurrence of\n                            any non-compliance or non-fulfilment of the Company’s and\n                            [Guo]’s obligations under this Agreement and the Share Sale and\n                            Purchase Agreement, including without limitation the payment and\n                            discharge of the Indebtedness and the fulfilment of obligations under\n                            the Put Option (if\n                            exercised). 8.2    At any time after\n                            the security hereby constituted has become enforceable and after five\n                            (5) Business Days of prior notice in writing to the Vendor, the\n                            [Investors] may, in the name of [Guo] or otherwise: (a)with the assistance of [Guo], sell or dispose\n                                of the Shares or any part thereof at such time or times and in such\n                                manner and for such consideration (whether payable or deliverable\n                                immediately or by instalments) as the [Investors] may think fit in\n                                their sole and absolute discretion; (b)themselves, or by their nominees, exercise at\n                                their sole and absolute discretion with regards to the exercise of\n                                all voting rights and all other powers and rights attaching to or\n                                incidental to all or any of the Shares as if they were the outright\n                                owner thereof; and/or (c)apply any moneys received under or pursuant to\n                                this Agreement in or towards reduction or satisfaction of the\n                                Company’s and [Guo]’s obligations under the Share Sale\n                                and Purchase Agreement, including without limitation the payment and\n                                discharge of the Indebtedness and the fulfilment of obligations\n                                under the Put Option (if exercised), in such manner as the\n                                [Investors] thinks fit in their sole and absolute\n                            discretion. 8.3Any moneys received pursuant to the exercise of\n                            the power of sale described in Clause 8.2 shall be apportioned amongst\n                            the [Investors] proportionately. The [Investors] are hereby authorised\n                            to give a good discharge for any moneys received by them pursuant to the\n                            exercise of the power of sale described in Clause 8.2 and a purchaser\n                            shall not be bound to enquire whether the power of sale has arisen as\n                            herein provided nor be concerned with the manner of application of the\n                            proceeds of sale. Any balance shall be returned to the\n                        Vendor.",
        "The subsequent agreements": "6       Subsequently, on 14 December 2007, the\n                    defendant and two others entered into another sale and purchase agreement with\n                    Guo and the Company (“the Second Investment Agreement”), under\n                    which the defendant invested an additional sum of $1.2 million in return for 150\n                    of the Company’s ordinary shares. Similar to the First Investment\n                    Agreement, there was an undertaking to list under clause 5.1 of the Second\n                    Investment Agreement, failing which the defendant was entitled to exercise a put\n                    option requiring Guo and/or the Company to buy the defendant’s shares back\n                    at the price of $1.2 million, being the defendant’s contribution, plus a\n                    premium of 8%. 7       Barely a week later, on\n                    20 December 2007, the Investors and a few others entered into a\n                    subscription agreement with Guo and the Company (“the Third Investment\n                    Agreement”), under which the Investors made additional investments in the\n                    Company and obtained new shares as follows: InvestorContributionNumber of sharesThe\n                                    defendant$320,00040Ms Goh$120,00015Mr Wong$448,00056Ms Chong$48,0006   The Third Investment Agreement also contained the undertaking to list\n                    and a similar put option whereby Guo and/or the Company were required to buy the\n                    Investors’ shares back at the put prices, calculated as their respective\n                    contributions plus a premium of 8%, in the event that the put option was\n                    exercised upon a failure to list by the deadline. By then, the defendant had\n                    obtained a total of 580 shares in the Company through the three abovementioned\n                    agreements (collectively “the Investment\n                Agreements”). 8       Separately, through a resolution passed on 28\n                    March 2008, each ordinary share in the Company was divided into 1,000\n                    shares, and, as a result, the 580 shares that the defendant had obtained\n                    through the three Investment Agreements became 580,000 ordinary\n                shares.",
        "Guo’s failure to deposit the share certificates": "9       Pursuant to clause 3.3 of the Charge, Guo\n                    was required to deposit the share certificates of all his shares in the Company,\n                    together with duly executed share transfer forms in blank, with The Bank of East\n                    Asia, who were appointed as the escrow agent. However, due to an oversight by\n                    the Investors, this was in fact not done by Guo. On 5 November 2008, after they\n                    had found out about this lapse, the defendant’s solicitors wrote to Guo,\n                    giving him until 11 November 2008 to remedy the situation and deposit\n                    the share certificates and the share transfer forms with the escrow agent, but\n                    Guo did not respond or comply with their request.",
        "Guo and the Company’s failure to list and their subsequent\n                default": "10     As it turned out, the Company failed to\n                    achieve the listing by the deadline, and on 23 January 2009, the\n                    defendant exercised his put options under the respective Investment Agreements\n                    and notified the Company and/or Guo accordingly. Neither the Company nor Guo\n                    complied with the put options. As a result of the non-compliance, the defendant\n                    together with two of the Investors namely Ms Goh and Ms Chong\n                    (collectively “the Creditors”), through their solicitors, declared\n                    on 12 February 2009 that an event of default had occurred under the\n                    Investment Agreements and demanded payment of the following sums due: (a)$1.7 million plus a premium of 20%;\n                        and(b)$1.688 million plus a premium of\n                        8%.These figures were arrived at based on the following calculations of\n                    the sums due under the respective Investment Agreements (see[2]–[3],[6]–[7]above):InvestorInvestment AgreementFirstSecondThirdThe\n                                    defendant$1.3m +\n                                    20%$1.2m +\n                                    8%$320,000 +\n                                    8%Ms Goh$300,000 +\n                                    20%-$120,000 +\n                                    8%Ms Chong$100,000 +\n                                    20%-$48,000 +\n                                    8%Total$1.7m +\n                                    20%$1.2m +\n                                    8%$488,000 +\n                                    8%Originating Summons 228 of 200911     The Creditors decided to take steps to realise\n                    their security under the Charge. However, as Guo had failed to deposit the share\n                    certificates and the share transfer forms with the escrow agent (see[9]above), they realised that they needed the\n                    Court’s assistance in order to enforce the Charge. It was under these\n                    circumstances that the Creditors commenced Originating Summons No 228 of 2009\n                    (“OS 228”) on 25 February 2009 and sought a court order, pursuant\n                    to the Charge, allowing them to transfer and register Guo’s shares in\n                    their names.12     At that time, Guo was the owner of 4,951,475\n                    ordinary shares in the Company. Although the Charge was granted overallof Guo’s shares in the Company (see[5]above), the Creditors sought to have only\n                    4,208,752 of his shares transferred into their names. That was because one of\n                    the Investors, Mr Wong (whom the Charge was also granted in favour of) did\n                    not join them in bringing OS 228 against Guo and the Company. Therefore,\n                    having taken into account Mr Wong’s contribution, the Creditors\n                    sought to transfer (in proportion to their respective contributions under the\n                    First Investment Agreement: see[2]above)\n                    the following:(a)3,218,458 shares to the defendant (1.3 / 2 x\n                            4,951,475);(b)742,721 shares to Ms Goh (0.3 / 2 x\n                            4,951,475); and(c)247,573 shares to Ms Chong (0.1 / 2 x\n                            4,951,475).13     After OS 228 was filed, UOB was granted\n                    leave to intervene after they asserted that Guo had granted them an equitable\n                    charge on 24 January 2009 over 2.5 million of Guo’s shares in\n                    the Company. At the hearing, UOB objected to OS 228 on the ground that the\n                    reliefs sought by the Creditors were tantamount to foreclosure and the\n                    appropriate order should, instead, be a sale of Guo’s shares subject to a\n                    proper valuation of those shares. In doing so, UOB also asserted that the\n                    defendant owed them a duty to ensure a proper valuation of the shares. The\n                    Company was represented at the hearing but (eventually) did not object to the\n                    application.14     After hearing submissions from UOB and the\n                    Creditors, on 21 May 2009, Lee Seiu Kin J (“Lee J”)\n                    ordered (“the Court Order”),inter\n                        alia, that:(a)Guo’s shares be transferred and registered\n                            in the Creditors’ names in the proportions prayed for at[12]above;(b)The Company to take steps to issue new share\n                            certificates according to the proportions above;(c)The Registrar of the Supreme Court to rectify the\n                            share register of the Company to reflect the Creditors as the new legal\n                            owners of those shares;(d)UOB is recognised as having an equitable charge\n                            over 2.5 million of Guo’s shares which ranks lower in priority\n                            than the Charge.The S&P Agreement15     The plaintiff, like the defendant, also became\n                    a shareholder of the Company due to its listing potential. She had started\n                    investing in the Company in May 2007 when she purchased shares of the\n                    Company from Guo. However, unlike the defendant, the plaintiff took an active\n                    part in the business and affairs of the Company. In fact, the plaintiff, at the\n                    request of the directors of the Company, supported the Company through various\n                    loans, which were extended personally and through companies that she controlled,\n                    because she held the view that the Company was a good long term\n                    investment.16     By March 2009, the plaintiff felt that the\n                    management of the Company was becoming too unwieldy given the number of\n                    shareholders involved. At a shareholders’ meeting on 10 March 2009, the\n                    plaintiff offered to purchase all the shares owned by the otherlocalshareholders at $1.80 per share. Just a day ago,\n                    the plaintiff had separately approached the defendant to purchase the\n                    defendant’s shares in the Company, including the 3,218,458 shares which\n                    the defendant was seeking to register in his name by way of OS 228 (see[12]above).17     Four days later, on 13 March 2009, the\n                    defendant accepted the plaintiff’s offer to buy the shares and entered\n                    into the S&P Agreement to sell the 3,218,458 shares charged by Guo, to\n                    the plaintiff for a total consideration of $3,384,000. Pursuant to the terms of\n                    the S&P Agreement, the plaintiff duly paid the deposit of $500,000 to\n                    the defendant. For completeness, I should add that the plaintiff was, at all\n                    material times, fully aware of the UOB charge when she entered into the S&P\n                    Agreement.18     The material terms of the S&P Agreement\n                    are as follows:(B)The Vendor has filed Originating Summons No 228 of\n                            2009/P (hereinafter referred to as the “Originating\n                            Summons”) in the High Court of the Republic of Singapore\n                            (hereinafter referred to as the “High Court”) for orders\n                            to effect the transfer and registration of 3,218,458 ordinary\n                            shares of the Company presently held by Mr. Guo Ze Ming in the name of\n                            the Vendor (hereinafter referred to as “Future Sale\n                            Shares”); and(C)The Purchaser is desirous of purchasing the Future\n                            Sale Shares from the Vendor on the terms and conditions of this\n                            Agreement.IT IS AGREED that:1.    SALE OF FUTURE SALE\n                            SHARES1.1    The Vendor agrees to\n                            sell and the Purchaser agrees to purchase, the Future Sale Shares free\n                            from all encumbrances together with all rights, benefits, title and\n                            interests attaching to them.1.2    The total consideration payable by the Purchaser to the Vendor for the\n                            Future Sale Shares shall be the sum of\n                            S$3,384,000.1.3    The completion\n                            of the sale and purchase of the Future Sale Shares shall take place no\n                            later than one (1) week after the transfer and registration of the\n                            Future Sale Shares in the name of the Vendor, the exact date to be\n                            agreed by the Vendor and the\n                            Purchaser.2.    CONDITIONS\n                            PRECEDENT2.1    Completion of sale\n                            and purchase of the Future Sale Shares shall be conditional uponALLof the following conditions\n                            having been fulfilled or otherwise waived by the Vendor:2.1.1The Purchaser pays to the Vendor a sum of\n                                S$500,000 at the date of execution of this Agreement;2.1.2In relation to the Originating Summons which\n                                is fixed for hearing in the High Court on 31 March 2009 (or on\n                                such other adjourned date), the Company does not object (or if\n                                possible, consents) to the Vendor’s said application for the\n                                transfer and registration of the Future Sale Shares in the name of\n                                the Vendor;2.1.3The Originating Summons for the Future Sale\n                                Shares to be transferred and registered in the name of the Vendor is\n                                granted by the High Court;2.1.4The Company takes all necessary steps to\n                                facilitate the transfer and registration of the Future Sale Shares\n                                in the name of the Vendor; and2.1.5Further to any order granted by the High\n                                Court, the Vendor completes the transfer and registration of the\n                                Future Sale Shares in his name.It is immediately apparent from these terms that\n                    the completion of the S&P Agreement specifically contemplated the defendant\n                    obtaining an order in OS 228 for the transfer and registration of the\n                    Shares in his name.Events leading up to the proceedings19     Immediately after the defendant had obtained\n                    the Court Order in OS 228, the plaintiff as director (she was appointed as\n                    director of the Company on 10 March 2009) issued a notice later in the\n                    evening of 21 May 2009 for an extraordinary general meeting\n                    (“EGM”) to pass various resolutions which included,inter alia, a resolution to allot up to 6,000,000 shares\n                    to herself as part payment of her loans to the Company. The resolutions were not\n                    carried at the EGM held on 6 June 2009.20     In the meantime, the defendant encountered\n                    enormous difficulties with the Company in relation to the issuance of new share\n                    certificates as earlier ordered by Lee J on 21 May 2009.\n                    Eventually on or about 29 June 2009, the defendant filed a further\n                    application in OS 228 for an order for the Registrar of the Supreme Court\n                    to issue the new share certificates instead. The order was duly granted by\n                    Lee J on 30 June 2009. With 3,218,458 of Guo’s shares now\n                    registered in the defendant’s name, the stage was set for completion under\n                    the S&P Agreement (at least so the defendant thought). Therefore, on\n                    6 July 2009, the defendant informed the plaintiff that he was ready,\n                    willing and able to transfer the Shares to her, and proposed for completion to\n                    take place on 8 July 2009.21     However, there came a further twist to this\n                    saga. ComLaw LLC, who had previously represented the Company in OS 228,\n                    filed a winding up petition against the Company on behalf of Rainbow Offshore\n                    Supplies Pte Ltd (“Rainbow Offshore”) on 24 June 2009. This\n                    petition was filed on the basis that Rainbow Offshore had extended a loan of RMB\n                    12 million to the Company. It is not disputed that Rainbow Offshore was, at all\n                    material times, controlled by the plaintiff. Although the defendant initially\n                    opposed the winding up petition in order to investigate the alleged loan, he\n                    eventually decided against it. Consequently, on 14 August 2009, the Company\n                    was ordered to be wound up.22     By various letters dated 8 July,\n                    13 July and 20 July 2009, the plaintiff claimed,inter alia, that she was not obliged to complete the\n                    S&P Agreement because the UOB charge amounted to an encumbrance and\n                    that the commencement of the winding up petition against the Company had\n                    frustrated the S&P Agreement. Thereafter, on 20 July 2009, the\n                    plaintiff commenced the present action against the defendant to recover the\n                    $500,000 deposit paid under the S&P Agreement. In response, the\n                    defendant counterclaimed against the plaintiff for specific performance of the\n                    S&P Agreement and for payment of the balance sum of $2,884,000\n                    ($3,384,000 less $500,000) due under the S&P Agreement, or for damages\n                    arising out of the plaintiff’s breach to be assessed.The issues before this court23     When the trial commenced before me, the\n                    plaintiff raised the following issues as arising from the pleadings for\n                    determination:(a)     Whether the S&P Agreement was\n                        entered into pursuant to the power of sale under the Charge, and whether the\n                        defendant could convey the legal title of the Shares to the plaintiff\n                        pursuant to that power of sale (collectively “the Power of Sale\n                        Issues”).(b)     Whether the defendant’s sale of the Shares to the plaintiff\n                        overreached the UOB Charge such that the plaintiff took the Shares free from\n                        the UOB Charge (“the Overreaching Issue”).(c)     Whether the defendant was in breach of\n                        an implied term of the S&P Agreement not to take steps to diminish or\n                        destroy the value of the Shares.(d)     Whether the S&P Agreement was frustrated by the\n                        winding up of the Company (“the Frustration\n                    Issue”).(e)     Whether the Court Order was procured by fraud on the part of the defendant\n                        (“the Fraud Issue”).(f)     Whether the Company’s objection to the\n                        defendant’s application in OS 228 for the transfer and\n                        registration of the Shares constituted a non-fulfilment of a condition\n                        precedent of the S&P Agreement.24     After the close of the defendant’s case\n                    and in light of the evidence adduced at the trial, counsel for the plaintiff,\n                    Mr Alvin Tan (“Mr Tan”), quite sensibly, decided not to\n                    pursue issues (c) and (f) above.The nature of the defendant’s security interest in the\n                Shares25     Before I address the remaining live issues, it\n                    would be useful for me to clarify the nature of the defendant’s security\n                    interest in the Shares, which had been labelled “Security Charge”.\n                    The immediate question for consideration was whether the security interest was a\n                    charge or an equitable mortgage.26     On this point, it was recently observed by\n                    Judith Prakash J inPower Knight Pte Ltd v Natural Fuel\n                        Pte Ltd (in compulsory liquidation)[2010] 3 SLR 82 (at [23]–[24]), after citingGoode on Legal Problems of Credit and Security(Louise Gullifer\n                    ed) (Sweet & Maxwell, 4th Ed, 2008), that the difference between an\n                    equitable mortgage and charge may depend on the availability of self-help\n                    remedies:23    One of the distinctions between a charge and an\n                            equitable mortgage is that the chargee is not entitled to avail himself\n                            of the self-help remedies of sale, possession or appointment of a\n                            receiver (though he may apply to the court for one of these remedies):Goode, para 1-51 (n 184),Fisher and Lightwood's Law of Mortgage(Wayne Clark ed) (LexisNexis Butterworths, 12th Ed, 2006)\n                                [“Fisher and\n                            Lightwood”], paras 6.1 and 6.3.24    Given that the parties intended that Power Knight\n                            should have all the remedies available to a mortgagee, I am inclined to\n                            regard Power Knight's security interest as an equitable\n                        mortgage.Notwithstanding Prakash J’s observation, self-help\n                    remedies such as the power of sale and the power to appoint a receiver are now\n                    also commonly provided for in charge instruments. As such, as aptly observed inFisher and Lightwoodat para 6.3 andCousins on the Law of Mortgages(Edward\n                    Cousins ed) (Sweet & Maxwell, 2001) (“Cousins”) at para 1-13, the remaining distinction\n                    between a mortgage and a charge appears to be, in principle, that a mortgagee\n                    has the right to foreclosure and to go into possession whereas a chargee does\n                    not.27     However, despite the label, both parties were\n                    content to proceed on the basis that the defendant’s security interest in\n                    the Shares was that of anequitable mortgage. For\n                    good measure, counsel for the defendant, Mr Pradeep Pillai\n                    (“Mr Pillai”), cited two authorities for the proposition that\n                    the deposit of share certificates accompanied by blank transfer forms does give\n                    rise to an equitable mortgage over the relevant shares. Both these authorities,\n                    although dating back some time, still remain good law. The first decision wasHarrold v Plenty[1901] 2 Ch 314 in which Cozens-Hardy J stated\n                    at 316:The only material allegation in the statement of claim is that in March,\n                        1897, the defendant deposited with Harrold the certificate of ten ordinary\n                        shares in a limited company as security for the repayment to Harrold of the\n                        sum of 150l., then owing to him from the defendant, with interest thereon at\n                        the rate of 6l. per cent. per annum.Now, it is plain\n                            that a pledgee is in a very different position from an ordinary\n                            mortgagee. He has only a special property in the thing pledged. He may\n                            obtain a sale, but he cannot obtain a foreclosure. I do not think that\n                            this is properly a case of pledge. A share is a chose in\n                        action. The certificate is merely evidence of title, and whatever may be the\n                        result of the deposit of a bearer bond, such as that which Sir George Jessel\n                        dealt with inCarter v. Wake, I think I cannot\n                        treat the plaintiff as a mere pledgee.The deposit of the\n                            certificate by way of security for the debt, which is admitted, seems to\n                            me to amount to an equitable mortgage, or, in other words, to an\n                            agreement to execute a transfer of the shares by way of\n                            mortgage. The result is that the plaintiff is entitled to a\n                        judgment substantially in the form which would be given if, instead of the\n                        certificate of shares, the document had been a title-deed of real estate or\n                        a policy of assurance.[emphasis added]Similarly, inStubbs v Slater[1910]\n                    1 Ch 632 the court came to the same conclusion that a transaction\n                    under which shares were handed over with a share transfer form executed in blank\n                    to secure a debt was a mortgage that gave the mortgagee the right of foreclosure\n                    (at 638–639):If one asks how they were entitled to sell it is necessary to go back a\n                        step.The plaintiff handed over to the brokers one\n                            certificate for the 390 shares together with a transfer executed by the\n                            plaintiff in blank, in which the numbers of the shares were specified,\n                            but the name of the purchaser and the consideration were, of course, not\n                            specified. It was the ordinary well-known transfer in blank.\n                        Now what is the effect of that? I am astonished that there should be any\n                        doubt about it. So long ago as 1899 Stirling J. inLondon and Midland Bank v Mitchelldealt with a case of\n                        precisely this nature and indicated what was the legal effect of it. That\n                        was a case in which certain shares together with a blank transfer had been\n                        deposited with a bank to secure a debt, and it was held that the bank had\n                        not lost their right against the shares although their simple contract\n                        remedy against the client was lost by reason of the Statute of Limitations.The Court there pointed out that the whole\n                            transaction was a mortgage as to which the bank were entitled to the\n                            ordinary remedy of foreclosure.[emphasis added]28     As already mentioned at[9]above, clause 3.3 of the S&P Agreement\n                    required Guo to deposit the share certificates and blank transfer forms with the\n                    escrow agent. In my view, Guo’s omission to deposit the share certificates\n                    and blank transfer forms did not alter the agreement between the parties or the\n                    nature of the defendant’s security interest in the Shares. In this regard,\n                    the plaintiff has not suggested otherwise. Accordingly, I find that the security\n                    interest created by the Charge in favour of the defendant was that of an\n                    equitable mortgage.The Frustration IssueThe relevance of section 259 of the Companies Act29     In the present case, although the S&P\n                    Agreement was entered into prior to the commencement of the winding up of the\n                    Company, the completion of the sale was scheduled to take placeafterthe commencement of the winding up. Cursorily, the\n                    sale of the Shares may therefore appear to be rendered void by s 259 of the\n                    Companies Act (Cap 50, 2006 Rev Ed) (“Companies Act”),\n                    which reads as follows:Avoidance of dispositions of property,\n                        etc.259. Any disposition of the property of the\n                        company, including things in action, and any transfer of shares or\n                        alteration in the status of the members of the company made after the\n                        commencement of the winding up by the Court shall unless the Court otherwise\n                        orders be void.30     Mr Pillai, however, drew my attention to\n                    the decision of the Supreme Court of Victoria inJordanlane\n                        Pty Ltd v Kimberley Jane Elizabeth Kitching Andrew[2008]\n                    VSC 426 wherein the rationale for s 468 of the Corporations Act 2001\n                    (Cth) (“Corporations Act”) (the Australian equivalent of\n                    s 259 of the Companies Act) was lucidly explained. The primary purpose\n                    behind s 468 of the Corporations Act is to prevent a shareholder from\n                    evading liability as a contributory by transferring shares to some impecunious\n                    person after the commencement of winding up. The Court went on to observe that\n                    such a purpose can be sufficiently served by avoiding the transfer of the shares\n                    only as far asthe companyis concerned.\n                    Accordingly, a purchaser of the shares, such as the plaintiff, cannot avoid\n                    completion in respect of agreements which were entered into prior to the\n                    commencement of winding up, even if the company should subsequently be wound\n                    up.31     Mr Tan quite rightly did not seek to rely\n                    on s 259 of the Companies Act to avoid completion of the S&P\n                    Agreement.Winding up of the Company32     The plaintiff submitted that the S&P\n                    Agreement was frustrated by the winding up of the Company on 14 August\n                    2009, since the subject matter of the S&P Agreement,iethe Shares, were no longer in existence as a result of the\n                    winding up order. No authority was cited in support by Mr Tan other than\n                    his reliance on s 7 of the Sale of Goods Act (Cap 393, 1999 Rev\n                    Ed) (“the Sale of Goods Act”) which provides as follows:Goods perishing before sale but after agreement\n                            to sell7. Where there is an agreement to sell\n                        specific goods and subsequently the goods, without any fault on the\n                        part of the seller or buyer, perish before the risk passes to the\n                        buyer, the agreement is avoided.33     However, notwithstanding his reliance on\n                    s 7 of the Sale of Goods Act, and purportedlyby way of\n                        analogyat that, Mr Tan was unable to identify any authority\n                    that “shares” fell within the rubric of “goods”\n                    under the Sale of Goods Act. The short answer to the plaintiff’s\n                    submission is that the Sale of Goods Act does not apply to shares. This much is\n                    clear from the definition of “goods” itself in s 61(1) of the\n                    Sale of Goods Act:“goods” includes all personal chattels other than\n                        things in action and money; and in particular “goods”\n                        includes emblements, industrial growing crops, and things attached to or\n                        forming part of the land which are agreed to be severed before sale or under\n                        the contract of sale and includes an undivided share in goodsIt is thus apparent on the face of s 7 that the definition of\n                    “goods” under the Sale of Goods Act specifically excludes choses\n                    in action, and there is ample authority to show that shares are merely choses in\n                    action and are therefore, by definition, excluded from the Sale of Goods\n                    Act.34     Further, the definition of goods under\n                    s 61(1) of the Sale of Goods Act is practically identical to the definition\n                    of goods under s 61(1) of the English Sale of Goods Act 1979 (c 54)\n                    (“the UK Act”).Benjamin’s Sale of\n                        Goods(AG Guest et al ed) (Sweet & Maxwell, 7th Ed, 2006)\n                    states thus at para 1-080:[T]he statutory exclusion of things (or choses) in action means that\n                        shares and other securities, debts, bills of exchange and other negotiable\n                        instruments… and other incorporeal property are not capable of being\n                        ‘goods’ for the purposes of the Act.To put the issue beyond any doubt, English case law is clear that the\n                    UK Act does not apply to shares because they are things (or choses) in action,\n                    and this can easily be ascertained from the following two decisions, of which\n                    the first is the House of Lords decision ofCommissioners of\n                        Inland Revenue v Crossman[1937] AC 26, in which Lord\n                    Roche explained at 72:By a sale I mean and understand a transaction which passes the property in\n                        the thing sold. It must always be borne in mind that the Finance Act of 1894\n                        is dealing with all descriptions of property and not expressly with shares,\n                        and I regard the word \"sold\" in s. 7, sub-s. 5, of this Act as having the\n                        same meaning as the word \"sale\" in the Sale of Goods Act, 1893: see s.\n                        1, subs.3, of that Act. Shares with many other kinds of property are,\n                        of course, not within the ambit of the Sale of Goods Act; but I am of\n                        opinion that for the purposes of the Finance Act, 1894, for shares to be\n                        sold the property in them, by which I mean the legal property, must\n                        pass.The other decision isBritish & Commonwealth\n                        Holdings Plc v Quadrex Holdings Inc[1995] CLC 1169 by\n                    the English Court of Appeal (at 1226):I have no doubt that the method proposed by Samuel Montagu is appropriate\n                        in the case of a commodity for which there is an available market. It is\n                        akin to the rule in s. 50(3) and s. 51(3) of the Sale of Goods Act 1979;\n                        although the Act does not apply to a chose in action such as shares in a\n                        company, it merely reflects the common law.Mr Tan did not attempt to make any submission as to why the\n                    position in Singapore should be any different from that in\n                England.35     Mr Pillai, on the other hand, helpfully\n                    referred me to a series of Australian and New Zealand authorities which have\n                    consistently held that the insolvency of a company does not frustrate agreements\n                    for the sale and purchase of shares in the company. The frustration defence was\n                    raised and rejected inEzishop.Net Ltd (in Liq) v Veremu Pty\n                        Ltd[2003] NSWSC 156; 45 ACSR 199 where the\n                    Supreme Court of New South Wales held (at [66]) that:In exercising the judgment the court is required to make as to whether\n                        insolvency and liquidation has brought about the frustration of the\n                        agreement there are a number of matters to be taken into account. First, on\n                        the evidence as to the circumstances in which the agreement was made, I am\n                        satisfied that the prospect of loss of their investment by reason of\n                        insolvency and liquidation was within the contemplation of the defendants\n                        when the agreement was made. Second, I am satisfied that the obligations of\n                        the parties to the agreement are not affected by the event complained of,\n                        nor has it been shown that the event in any relevant way has altered the\n                        situation of the parties, radically or otherwise. Third,it is plain that the event complained of does not result in the\n                            impossibility of performance of the agreement in that the shares (and\n                            the rights and entitlements attaching to them) have been neither\n                            destroyed nor changed. It is not enough to demonstrate that the event\n                            may have had a detrimental effect upon the value of the\n                            shares. According to Lord Radcliffe, it is not hardship or\n                        inconvenience or material loss itself which calls the principles of\n                        frustration into play.[emphasis added]36     Similarly the same defence was also raised and\n                    rejected by the High Court of New Zealand inKoutsojiannis v\n                        Brown[1981–1983] 1 NZCLC 98,081. I only need\n                    quote from the headnote:The doctrine of frustration does not apply to a contract for the purchase\n                        of shares which is unable to be performed because of the company being wound\n                        up. There was in this case no intervening event or change of circumstances\n                        which were so fundamental as to strike at the root of the agreement for the\n                        sale of the shares. The matter must be considered in the light of the\n                        circumstances pertaining at the time when the contract was entered into. The\n                        failure of the company was simply an ordinary business risk which anyone\n                        buying shares in a company must take as regards the future of the company\n                        concerned.37     Mr Tan, when confronted with the force\n                    and weight of the above authorities, conceded that he was unable to distinguish\n                    them from the present case. Accordingly, the legal position is abundantly clear\n                    that the winding up of the Company did not frustrate the S&P Agreement.\n                    There is therefore no need for me to even consider the defendant’s\n                    alternative argument that the frustration, if established, was in any event\n                    self-induced.The Fraud Issue38     On or about 22 June 2010, just prior to\n                    the commencement of the trial, the plaintiff amended the Statement of Claim to\n                    rely on an additional ground of fraud to prevent the defendant from enforcing\n                    the S&P Agreement.39     As can be seen from the terms of the S&P\n                    Agreement at[18]above, it was a condition\n                    precedent for the defendant to procure an order of court for the Shares to be\n                    transferred and registered in the name of the defendant. This was accomplished\n                    by the defendant by way of the Court Order in OS 228. However, the\n                    plaintiff alleged that the defendant was not entitled to rely on the Court Order\n                    because it was procured by way of fraud. It is perhaps relevant to highlight the\n                    fact that there was no appeal against the Court Order and no step has been taken\n                    to set it aside. As such, it is questionable whether the plaintiff ought to be\n                    allowed to even raise this point at this juncture. Nonetheless, I shall consider\n                    the merits or lack thereof of the plaintiff’sfraudargument.40     According to Mr Tan, the defendant had,\n                    in OS 228, “actively misrepresented” to the court that there\n                    was no sale of the Shares when he had in fact entered into the S&P Agreement\n                    with the plaintiff. To establish this, Mr Tan relied on two statements made\n                    by the defendant in OS 228. The first of the two statements can be found in\n                    the defendant’s affidavit filed on 12 May 2009, in which he referred\n                    to UOB’s claim as being “premature”:10.1.3    At the same paragraph, UOB asserts that the\n                            [Creditors] owe a duty to UOB to ensure that there is a proper valuation\n                            of the Subject Shares at the time those shares are disposed of in light\n                            of UOB’s second charge over the Charged Shares.10.1.4    Quite apart from the fact that UOB’s\n                            aforesaid argument is premature, the [Creditors’] principal\n                            position is that there is no duty owed to the UOB as UOB do not hold an\n                            equitable charge over the same shares.The other statement can be found in the defendant’s written\n                    submissions, where he had stated that the application in OS 228 was not to\n                    sanction any sale of the Shares, but was simply to have the Shares registered in\n                    his name. Mr Tan attempted to persuade this court that these two statements\n                    were “active misrepresentations” amounting to fraud. I simply\n                    could not agree with this submission.41     Taking the plaintiff’s case at its\n                    highest, all that the plaintiff can say is that the defendantdid not discloseto the court that the defendant had entered\n                    into the S&P Agreement to sell the Shares to the plaintiff after OS 228\n                    was filed. For such an omission to amount to fraud, in my view, Mr Tan had\n                    to show, first, that there was adutyon the\n                    defendant to disclose that information to the court in OS 228, and the\n                    question of whether there was such a duty to disclose would, in turn, depend on\n                    whether that information was relevant and material to the issues in\n                    OS 228.42     In OS 228, the defendant had sought to\n                    transfer and register the Shares in his name pursuant to the Charge, of which\n                    clause 3.4 expressly provides for the Shares to be transferred to and registered\n                    in the defendant’s name upon an event of default at Guo’s cost and\n                    expense:[Guo] hereby acknowledges and agrees that the [Investors] may at any time\n                        (with or without [Guo’s] assistance) arrangefor\n                            the Shares to be transferred to and registered in the name of the\n                            [Investors] or their nominee(s) at the cost and expense of\n                            [Guo], including but not limited to any stamp duty or legal\n                        fees payable in relation to the transfers of the Shares in the event that\n                        [Guo] fail to perform the relevant obligations of this [Charge] and the\n                        [First Investment Agreement].[emphasis added]The effect of this clause was to allow the Investors, who were\n                    equitable mortgagees, to perfect their security and becomelegalmortgagees over the Shares. Ideally, the defendant would\n                    have been in a position to transfer the Shares to himself had Guo complied with\n                    the obligation to deposit the share certificates and blank transfer forms with\n                    the escrow agent (see[9]above). However, it\n                    was precisely because of Guo’s failure to do so that the defendant had no\n                    choice but to commence OS 228 in order to perfect his security; and it was\n                    on this basis that the court had granted the Court Order in\n                OS 228.43     As such, I fail to see why it would be\n                    material for the court in OS 228 to be informed of the pending sale when\n                    such information had no bearing whatsoever to the issue as to whether the\n                    defendant was entitled to transfer and register the shares in his name under the\n                    Charge. In this connection, Mr Tan submitted that there were twopossibleadvantages to be gained by the defendant by not\n                    disclosing the sale. It was alleged that there would be no need for the\n                    defendant to value the Shares as averred by UOB. It was also suggested that the\n                    defendant would be able to retain any surplus from the sale of the Shares\n                    without having to account to UOB as the subsequent equitable chargee. It is\n                    immediately apparent that neither of these twosupposedreasons has any direct bearing on the plaintiff. They\n                    both concerned, at best, UOB. In my view, neither reason has any merit\n                    whatsoever. First, the Court Order did not dispense with the need for valuation\n                    particularly since the application was not for sanction of the sale. Therefore\n                    if the Shares were sold below valuation, that is a matter to be taken up by UOB\n                    against the defendant. Secondly, as the Court Order was not for sanction of the\n                    sale of the Shares, there can be no question that the defendant was somehow\n                    excused from having to account to UOB or any other party as regards any surplus\n                    proceeds from the sale. Thirdly, it is indeed curious that it was the plaintiff\n                    who raised this objection instead of UOB. Interestingly, UOB, the party whom the\n                    plaintiff had alleged was effectively “defrauded” by the Court\n                    Order, instead of making any similar accusation against the defendant, had in\n                    fact reminded the defendant to “exercise their right of sale as chargees\n                    in line with their duties as chargees in law”. Finally, when Mr Tan\n                    was invited to explain why the Court would not have granted the Court Order if\n                    the pending sale had been disclosed, he was unable to provide any satisfactory\n                    explanation. In the circumstances, I find that there is no conceivable reason\n                    why the Court Order would not have been granted in OS 228 if the court had\n                    been apprised of the defendant’s pending sale of the Shares to the\n                    plaintiff. The plaintiff’s argument on fraud is therefore plainly\n                    misconceived.The Power of Sale Issues44     Mr Tan raised two arguments with respect\n                    to the defendant’s exercise of his power of sale: first, he submitted that\n                    because the defendant’s exercise of his power of sale under the Charge was\n                    defective, the defendant’s sale of the Shares under the S&P Agreement\n                    was thereforeultra vires; and second, even if the\n                    defendant had properly exercised his power of sale under the Charge, being an\n                    equitable mortgagee, he could not convey the legal title other than by way of a\n                    court-sanctioned sale under s 30(2) of the Conveyancing and Law of Property\n                    Act (Cap 61, 1994 Rev Ed) (“CLPA”), which provides that\n                    the court may “direct a sale of the mortgaged property, on such terms as\n                    it thinks fit”.Whether the S&P Agreement was entered into pursuant to the power\n                of sale under the Charge45     The plaintiff sought to show that the\n                    defendant, in exercising his power of sale, had failed to comply with the\n                    requirements under the Charge in two respects.46     First, the plaintiff claimed that the 5-day\n                    notice required to be given under clause 8.2 of the Charge was not given by the\n                    defendant to Guo, and hence the sale was defective. Such a submission is, in my\n                    judgment, based on a complete misunderstanding of the purpose of such notices.\n                    It is trite that such notices are intended to protect the interest of the\n                    mortgagor (seeSingapore Finance Ltd v Ben’s Electrical\n                        Engineering Pte Ltd[1986] SGHC 55). It cannot be\n                    seriously disputed that Guo had to all intents and purposes abandoned any\n                    intention to either contest the enforcement of the Charge or the sale of the\n                    Shares under the S&P Agreement. This is self-evident from Guo’s\n                    complete failure to respond to any of the defendant’s letters in relation\n                    to the S&P Agreement or the Charge. In fact, Guo did not even bother to\n                    enter an appearance in OS 228, after having been served. In any event,\n                    notice of the defendant’s intention to exercise all his rights under the\n                    Charge was in fact given to Guo through the defendant’s solicitors’\n                    letter dated 12 February 2009.47     Secondly, the plaintiff submitted that clause\n                    8.3 of the Charge contemplated a joint exercise of the power of sale byallthe Investors. Since the\n                    S&P Agreement was only concluded with the defendant, the sale could not\n                    have been an exercise of the power of sale under the Charge. The inspiration for\n                    this submission was based on the wording in clause 8.3 which provides that\n                    “all moneys received pursuant to the exercise of the power of sale\n                    described in clause 8.2 shall be apportioned amongst the Chargees\n                    proportionately.” On a plain reading, clause 8.3 merely required that the\n                    proceeds from the sale ofallof Guo’s\n                    mortgaged shares are to be apportioned proportionately among the Investors as\n                    mortgagees. However, the question of apportionment does not arise in the present\n                    case because, by virtue of the Court Order granted in OS 228, Guo's shares\n                    had already been apportioned among the Creditors and the defendant was selling\n                    onlyhisproportion of the shares,ie3,218,458 out of the total 4,208,752 shares mortgaged\n                    by Guo under the Charge.48     For the foregoing reasons, I find that the\n                    defendant’s sale of the Shares under the S&P Agreement was a valid\n                    exercise of the power of sale granted to him under the Charge.Whether the defendant could convey the legal title to the\n                plaintiff49     On this point, Mr Tan relied on two\n                    passages from leading textbooks in support of the proposition that if an\n                    equitable mortgage was not made by deed, then theonlyway that an equitable mortgagee can sell the legal interest\n                    of the mortgaged property is by applying to court for a sale under s 30(2)\n                    of the CLPA. It would then follow that as the defendant had not obtained a\n                    court-sanctioned sale, he could not sell or convey the legal interest in the\n                    Shares to the plaintiff. The first passage is found inFisher\n                        and Lightwoodat para 30.43:In the case of an equitable mortgage not made by deed, there is no\n                        statutory power of sale. If the mortgagee wishes to sell, he must therefore\n                        apply to the court, which will be able to vest in him a legal term of years,\n                        so he can sell as if he were a legal mortgagee.The other passage is fromCousinsat\n                    para 16-121:In the case of other equitable mortgages not made by deed, there is no\n                        statutory power of sale out of court. However, by virtue of section 91(2) of\n                        the [1925 Act], the court itself has the power to order a judicial sale on\n                        the application of the mortgagee or of any interested person and may vest a\n                        legal term of years in the mortgagee so that he can sell as if he were a\n                        legal mortgagee.50     This submission, to my mind, was a complete\n                    non-starter. First, it is certainly correct that if the mortgage was not made by\n                    deed, then the mortgagee has nostatutorypower of\n                    sale. This much is clear from s 24(1)(a) of\n                    the CLPA:Power incident to estate or interest of\n                            mortgagee.24. —(1) A mortgagee,where the mortgage is made by deed, shall have the\n                            following powers, to the like extent as if they had been in\n                        terms conferred by the mortgage deed, but not further:(a) a power, when the mortgage money has become due, to sell, or to\n                            concur with any other person in selling, the mortgaged property, or any\n                            part thereof, either subject to prior charges, or not, and either\n                            together or in lots, by public auction or by private contract, subject\n                            to such conditions respecting title, or evidence of title, or other\n                            matter, as the mortgagee thinks fit, with power to vary any contract for\n                            sale, and to buy in at an auction, or to rescind any contract for sale,\n                            and to resell, without being answerable for any loss occasioned\n                            thereby;[emphasis added]However, what these two passages really meant, in my judgment, was\n                    that, in a situation where the mortgage was not made by deed, an equitable\n                    mortgagee who has nootherpower or mechanism to\n                    convey the legal title out of court would simply have no choice but to apply to\n                    court to sell or convey the legal title. Examples of such mechanisms that allow\n                    the transfer of the legal title out of court can be found in mortgage\n                    instruments and include: the granting of a power of attorney to the equitable\n                    mortgagee to convey the legal interest (Re White Rose\n                        Cottage[1965] 1 Ch 940), or a declaration by the\n                    mortgagor that he holds the legal interest on trust for the mortgagee (London and County Banking Co v\n                    Goddard[1897] 1 Ch 642).51     In any event, the defendant had already become\n                    the legal mortgagee as a result of the Court Order in OS 228 (see[42]above); and as the legal mortgagee having\n                    legal title to the Shares, he was therefore entitled to convey the legal\n                    interest to the plaintiff without the need for a further court-sanctioned\n                    sale.The Overreaching Issue52     I now come to the final issue which, in my\n                    view, was really the central issue of the present dispute.53     The defendant claimed that because the S&P\n                    Agreement was entered into pursuant to a valid exercise of a mortgagee’s\n                    power of sale, the sale of the Shares had therefore overreached the UOB charge\n                    and, as a result, the plaintiff took the Shares free from all encumbrances. The\n                    plaintiff countered that the overreaching effect only applies tostatutorysales by mortgagees as provided for in the\n                    CLPA, and since the Charge and the S&P Agreement were not executed by way of\n                    deed, there was non-compliance with ss 24(1) and 26(1) of the CLPA\n                    with the corresponding result that the UOB charge wasnotoverreached as claimed by the defendant.54     The overreaching effect of a mortgagee\n                    exercising his statutory power of sale is expressed in s 26(1) of the\n                    CLPA:Conveyance receipt, etc., on sale.26. —(1) A mortgagee exercising the\n                        power of sale conferred by this Act may by deed convey the property sold,\n                        for such estate and interest therein as is the subject of the mortgage,freed from all estates, interests and rights to which\n                            the mortgage has priority, but subject to all estates, interests and\n                            rights which have priority to the mortgage.[emphasis added]55     The plaintiff submitted that since neither the\n                    Charge nor the S&P Agreement was executed by way of a deed as required\n                    by s 24(1)(a) and s 26(1) of the CLPA\n                    respectively, the sale under the S&P Agreement could not have had any\n                    overreaching effect. This submission was premised on the proposition that\n                    overreaching is a creature of statute; and if that is correct, then there may be\n                    merit in concluding that an overreaching effect can only be achieved by the\n                    exercise of a statutory power of sale. In such an event, non-compliance with\n                    s 26(1) of the CLPA would certainly be fatal to the defendant’s case.\n                    It is therefore essential to determine whether the same overreaching effect\n                    applies in general law independent of the CLPA.56     Section 26(1) of the CLPA has been\n                    considered in at least three Singapore High Court decisions: seeDBS Finance Ltd v Prime Realty Pte Ltd[1990]\n                    2 SLR(R) 740,Indian Overseas Bank v Cheng Lai\n                        Geok[1991] 2 SLR(R) 574 (“Indian Overseas Bank”) andWin\n                        Supreme Investment (S) Pte Ltd v Joharah bte Abdul Wahab (Sjarikat\n                        Bekerjasama Perumahan Kebangsaan Singapura, third party)[1996] 3 SLR(R) 583 (“Win Supreme\n                        Investment”). From these decisions, it is clear that an\n                    exercise of a mortgagee’s statutory power of sale does overreach\n                    subsequent encumbrances such that a purchaser takes the property free from those\n                    encumbrances. The position, however, is not entirely clear where the exercise of\n                    the power of sale is not statutory but pursuant to a contractual\n                right.57     The plaintiff initially sought to rely on bothIndian Overseas BankandWin Supreme Investmentto demonstrate that there can be no\n                    overreaching effect other than through the operation of s 26(1) of the\n                    CLPA. However when the two decisions are closely examined, it is clear that\n                    neither of them support the plaintiff’s submission. InWin Supreme Investment, Chao Hick Tin J held\n                    (at [21]–[22] and [25]) that the sale by the mortgagee pursuant to\n                    s 26(1) of the CLPA did overreach the rights of the mortgagor and of any\n                    other person who obtained their rights from the mortgagor and subsequent to the\n                    mortgage, which included a lessee of the mortgagor (the lease was entered in\n                    breach of the mortgage). Likewise inIndian Overseas\n                        Bank, after stating that s 26(1) of the CLPA also applied to\n                    registered land, Goh Phai Cheng JC held (at [36]) that the defendant\n                    purchaser had obtained good title of the property free of the four caveats that\n                    were lodged after the mortgage was created. Indeed, there was simply no\n                    suggestion in eitherWin Supreme InvestmentorIndian Overseas Bankthat the overreaching\n                    effect canonlybe achieved by the exercise of the\n                    statutory power of sale under s 26(1) of the CLPA. As, to my knowledge,\n                    there is no direct Singapore authority covering this precise point, it is\n                    essential to trace the historical origin of s 26(1).58     The CLPA is derived from the Conveyancing and\n                    Law of Property Ordinance (Ordinance 6 of 1886) of the Straits Settlements,\n                    which in turn was based on the English Conveyancing and Law of Property Act 1881\n                    (44 & 45 Vict, c 41) (“the 1881 Act”), which in turn\n                    superseded Lord Cranworth’s Act 1860 (23 & 24 Vict, c 145). A\n                    brief history of the statutory power of sale in England was succinctly provided\n                    by Briggs J inHorsham Properties Group Ltd v\n                        Clark[2009] 1 WLR 1255 (at 1260):None the less,from the early 19th century it became\n                            common for the parties to legal mortgages to insert an express power of\n                            sale, until it was rendered unnecessary to do so by the creation of a\n                            statutory power of sale in Lord Cranworth's Act 1860 (23 & 24 Vict,\n                            c 145), repeated in section 19(1) of the Conveyancing Act 1881 (44\n                            & 45 Vict, c 41) and now to be found in section 101(1)(i) of the\n                            LPA. The exercise of that power overreaches any interest of\n                        the mortgagor: see section 2(1)(iii) of the LPA. I shall refer to it as\n                        the statutory power of sale. It becomes exercisable only when the mortgage\n                        money has become due, subject (like everything else in section 101) to any\n                        contrary intention in the mortgage deed: see section 101(4).[emphasis added]59     In this connection, it is pertinent to\n                    highlight that there was no express mention of overreaching in the very first\n                    enactment of the mortgagee’s statutory power of sale in Lord\n                    Cranworth’s Act 1860, of which the 15th section reads as follows:The Person exercising the Power of Sale hereby conferred shall have Power\n                        by Deed to convey or assign to and vest in the Purchaser the Property sold,\n                        for all the Estate and Interest therein, which the Person who created the\n                        Charge had Power to dispose of, except that in the Case of Copyhold\n                        Hereditaments the beneficial Interest only shall be conveyed to and vested\n                        in the Purchaser by such Deed.Subsequently, the overreaching provision first made its appearance in\n                    s 21(1) of the 1881 Act:21.—(1) A mortgagee exercising the power of sale conferred by this\n                        Act shall have power, by deed, to convey the property sold, for such estate\n                        and interest therein as is the subject of the mortgage,freed from all estates, interests, and rights to which the mortgage has\n                            priority, but subject to all estates, interests, and rights\n                        which have priority to the mortgage; except that, in the case of copyhold or\n                        customary land, the legal right to admittance shall not pass by a deed under\n                        this section, unless the deed is sufficient otherwise by law, or is\n                        sufficient by custom, in that behalf.[emphasis added]This overreaching provision was subsequently preserved in\n                    s 104(1) of the Law of Property 1925 Act (15 Geo 5 c 20) (which isin pari\n                        materiawith s 26(1) of the CLPA: seeWin\n                        Supremeat [21]). This therefore raised the interesting\n                    question whether overreaching was created through the 1881 Act.60     Charles Harpum wrote in his seminal article,\n                    “Overreaching, Trustees’ Powers and the Reform of the 1925\n                    Legislation” [1990] CLJ 277, that overreaching had a common law\n                    origin. Reasoning from the provisions of the 1925 Act, he concluded that\n                    overreaching is a necessary concomitant of a power of disposition, and that only\n                    a transaction made by a person within the dispositive powers conferred upon him\n                    will overreach equitable interests in the property. However, it is also clear\n                    that Harpum’s analysis was based primarily on an examination ofdispositions of land by trusteesand it was on that\n                    footing that he surmised that overreaching (at least in cases of dispositions of\n                    land by trustees)must have a common law basis(at 277-278):A number of misconceptions exist about overreaching. The first is that\n                        overreaching is something that occurs only in relation to land. It is\n                        undoubtedly true that the expression “overreaching” gained\n                        currency during the 19th century and appears to have been used in connection\n                        with dispositions of land. That association has been firmly cemented by the\n                        provisions of the Law of Property Act 1925, s.2, which set out the\n                        circumstances in which a conveyance of a legal estate in land will overreach\n                        any equitable interest or power affecting the land.But\n                            overreaching must take place in relation to other forms of property. A\n                            trustee who sells trust investments must necessarily hold the proceeds\n                            of sale on the same trusts as the original investment. It\n                        must also follow from this that the basis of overreaching does not lie in\n                        the statutory provisions of section 2 of the Law of Property Act.It must have a common law basis if it applies to personalty,\n                            and there are clear accounts of the effects of overreaching that\n                            pre-date the 1925 property legislation.[emphasis added]Therefore, it is still not entirely clear, even from Harpum’s\n                    article, whether amortgageehas the same power to\n                    effect an overreaching conveyance under general law.61     In an attempt to persuade this court that a\n                    common law mortgageedoeshave the power to effect\n                    an overreaching conveyance, Mr Pillai referred me to John Baalman’s\n                    commentary,The Singapore Torrens System(The\n                    Government of the State of Singapore, 1961) at p 137:Effect of Sale.Although the mortgagee has only a charge on the land, he is\n                        enabled by s. 57 (2) [of the Land Titles Ordinance, 1956] to pass to a\n                        purchaser the mortgagor’s estate.The result is\n                            much the same as that of a sale by a common law mortgagee. It\n                            extinguishes all subsequent encumbrances to which the land may have been\n                            subject. At common law—“The effect of a sale under the power is to destroy the equity\n                            to redeem, and this means that the rights of the mortgagor and all\n                            subsequent encumbrances are defeated, and their only remedy is against\n                            the purchase money in the hands of the vendor according to their\n                            priorities.”South Eastern Railway Co. v. Jortin(1857)\n                        6 H.L.C. 425; cited byHerring,\n                        C.J., inReg. v. Registrar of Titles, E.P.\n                            Watson[1952] V.L.R. 470, 476.It\n                            will be seen that the effects under common law and under this Ordinance\n                            are virtually equal...[emphasis added]It can be observed from the above passage that Baalman had cited two\n                    authorities for the proposition that overreaching applied at common law:Directors of South Eastern Railway Company v\n                        Jortin(1857) 6 HL Cas 425; 10 ER 1360\n                        (“Jortin’s Case”) and the\n                    Supreme Court of Victoria decision inR v Registrar of Title;\n                        Ex parte Watson[1952] VLR 470 (“Watson’s Case”), both of which were also\n                    relied upon by Mr Pillai in the present case. However, as Herring LJ inWatson’s Casealso citedJortin’s Casefor the same proposition, it is\n                    perhaps useful to begin by examining the judgment inJortin’s Case.62     The issue inJortin’s\n                        Casewas whether the sale by the Exchequer Bill Commissioners\n                    (the “Commissioners”) to the purchasers was valid to give them\n                    good title, free from the respondent’s mortgage. The House of Lords held\n                    that the sale validly overreached the respondent’s mortgage and the\n                    respondent could only look to the Commissioners if there was a surplus from the\n                    proceeds of sale. However, it can also be seen from the judgment of Lord\n                    Cranworth LC that the court had come to that conclusion by direct reference to\n                    the statutory provisions of the Advances for Public Works Act 1842 (5 and 6\n                    Vict, c 9). The relevant provisions, which provided the overreaching\n                    effect, can be found in the judgment at 1363–1364:The 5 and 6 Vict. c. 9, gave (sect. 19) power to the Commissioners, on\n                        sale of any property under the previous statutes, to retain, after payment\n                        of costs, etc., “all the principal monies for the time being\n                        remaining due or owing, or secured by virtue of such mortgage, etc.,\n                        notwithstanding the whole of such principal money, or any instalments\n                        thereof, may not, according to the terms of such mortgage, have become\n                        actually due and payable, together with all interest (if any) for the time\n                        being accrued due,” etc.The 20th section enacted,\n                            that when the Commissioners have sold, etc. “the same public\n                            works, interest, property or effects shall, in respect to, and to the\n                            extent of, the interest or estate so sold or otherwise disposed of, be\n                            held freed and discharged from all claim and demand of the persons,\n                            parties, bodies politic, corporate or collegiate, or companies, by whom\n                            the same were conveyed to the said Commissioners or to their secretary,\n                            and of all persons or bodies claiming under them, and in all\n                        respects as if such persons, etc. making such conveyance or transfer, and\n                        all persons, etc. claiming under them, were in all respects, to such extent\n                        as aforesaid, foreclosed from all equity or right of redemption of or in\n                        respect of the premises so sold or disposed of; provided that nothing herein\n                        contained shall be taken to prejudice the rights, etc. of any persons in\n                        respect of any surplus which may be produced, in consequence of” the\n                        Commissioners entering into possession of or selling the mortgaged\n                        property.[emphasis added]Lord Cranworth LC did pause, however, to add inobiterthat the position in general law appeared to be no\n                    different, because the Commissioners were, in any event, also boundby equityto hold any surplus on trust for those who\n                    were entitled to it (at 1365–1366):[T]he other mortgagees will still have all which they\n                            contracted for; that is, a right to be paid their interest before\n                            anything is paid to the commissioners in discharge of their principal.\n                            This right, however, is one which they can enforce only against the\n                            Commissioners who have in their hands the proceeds of the\n                            sale.I incline to think that this would have been so if\n                            there had been no express enactment upon the subject. But all\n                        doubt is removed, if any existed, by the 20th section of the 5 Vict. sess.\n                        2, c. 9, which enacts, that whenever the Commissioners sell under their\n                        powers, the purchaser shall hold free from all claim on the part of the\n                        bodies corporate under whom the Commissioners derived their title, and of\n                        all persons claiming under such bodies corporate, as if they had been\n                        foreclosed; that is, the Commissioners are to be treated by purchasers as\n                        absolute owners, so far as regarded the interests of those whose rights were\n                        subsequent to the right in respect of which the sale was made, for those are\n                        the persons to whom alone foreclosure could apply....It is hardly necessary to add, that this decision in no way affects the\n                        rights of the Respondent on the money produced by the sale. The\n                        Commissioners, unless there have been some special circumstances affecting\n                        the case,are bound, not only on general principles of\n                            equity, but also by the express provision of the clause in the last Act\n                            to which I have referred, to pay over and distribute any surplus money\n                            in their hands, after satisfying their arrears of interest,\n                        to and among the persons justly entitled to it. With that question, however,\n                        the present Appellants have no concern. They are purchasers under a power of\n                        sale, the exercise of which gave them a good title against the harbour\n                        trustees, and all deriving title under them.[emphasis added]63     Indeed, the position in general law relating\n                    to any surplus of the proceeds of sale supports the Lord Chancellor’s\n                    view. In the decision ofBanner v Berridge(1880-81) LR 18 Ch D 254, Kay J held that a first\n                    mortgagee, after exercising his power of sale, holds any surplus as a\n                    constructive trustee for the second mortgagee (although, on the facts, the\n                    plaintiff there was time-barred from claiming a constructive trust) (at 260,\n                    269–270). Similarly, inWest London Commercial Bank v\n                        Reliance Permanent Building Society(1885) LR 29 Ch D 954, the English Court of Appeal held\n                    that the first mortgagee, who had notice of the second mortgage, was liable, at\n                    general law, to make good to the second mortgagee the surplus that had already\n                    been paid to the mortgagor (at 962):It is conceded that if he exercises his power of sale\n                            as mortgagee, whether under the terms of the mortgage deed or by\n                            statute, he is answerable for the money he receives if he pays it to the\n                            wrong person, that is to say, if he passes over the second mortgagee and\n                            pays it to the mortgagor who has no right to receive it.\n                        Ought we, then, to make any distinction between such a case and the present?\n                        Here the first mortgagees, though they did not concur with the mortgagor in\n                        putting up the property for sale, did concur with him in the conveyance.\n                        Having done so with the knowledge that part of the purchase-money was going\n                        to be applied in violation of a right of which they had had notice, they\n                        are, in my opinion, just as liable as if they had received the whole of the\n                        money. Not being able to give a good receipt for the whole of the money,\n                        they must be held liable for that portion of it for which they could not\n                        give a good receipt, for it was in their power to refuse to concur in the\n                        sale unless the whole of the purchase-money was properly applied.[emphasis added]64     Accordingly, if the law imposes a duty on a\n                    mortgagee, who has realised his security by way of sale, to hold any surplus of\n                    the proceeds on constructive trust for a subsequent mortgagee, it would follow,\n                    in my judgment, that overreaching is simplya necessary\n                        incident of this dutyunder general law.65     InWatson’s\n                        Case, the issue that arose for determination was whether the\n                    common law rule inOtter v Lord Vaux(1856)\n                    6 De GM & G 638; 43 ER 1381 also applied to a statutory\n                    sale by a mortgagee under the Transfer of Land Act 1928 (No 3791) (Vic)\n                    (“Transfer of Land Act”). The rule inOtter v\n                        Lord Vauxwas that a mortgagor could not by purchasing from a\n                    mortgagee exercising a power of sale defeat a subsequent mortgagee’s\n                    interest in the property. This entailed a discussion of the power of sale\n                    conferred upon mortgagees by the Transfer of Land Act, in which Herring CJ\n                    touched on the effect of a mortgagee exercising his power of sale at general law\n                    (at 476):The effect of a sale under the power is to destroy the equity to redeem,\n                        and this means thatthe rights of the mortgagor and all\n                            subsequent encumbrancers are thereupon defeated, and their only remedy\n                            is against the purchase moneys in the hands of the vendor according to\n                            their priority—South Eastern Railway\n                            Coy. v. Jortin(1857), 6 H.L.C. 425, at\n                        p. 435. The destruction of the equity to redeem takes place as soon as\n                        there is a binding contract of sale.[emphasis added]However, as theratio decidendiofWatson’s Casewas that the rule inOtter v Lord Vauxapplied to statutory sales\n                    under the Transfer of Land Act, Herring CJ’s comment on overreaching\n                    does not really add much toJortin’s Case,\n                    although it does lend credence, in my view, to what appears from the cases, to\n                    be the prevailing judicial view that overreaching also applies in general\n                    law.66     That prevailing view recently became\n                    established when the precise issue whether overreaching applies independent of\n                    statute arose for determination in the decision of the Supreme Court of\n                    Queensland inSt George Bank Limited v Perpetual Nominees\n                        Limited[2010] QSC 57 (“St\n                        George Bank”). In that case, the plaintiff of the same\n                    name loaned money (for the purchase and refurbishment of the Sheraton Mirage\n                    Hotel Gold Coast) through a facility secured by first registered mortgages and a\n                    first registered fixed and floating charge. Perpetual Securities\n                    (“Perpetual”) and LJK Securities (“LJK”) held second\n                    and third ranking mortgages and fixed floating charges respectively. Following\n                    the default of the borrower, St George contracted to sell the land as well as\n                    the assets and undertaking of the hotel (“SP Hotel”), assuring the\n                    purchaser, Pearls Australasia Mirage 1 Pty Ltd, (“Pearls”) that\n                    the subsequent charges would be released. However, after St George exercised its\n                    power of sale, Perpetual and LJK refused to release their charges. The question\n                    that arose for determination can be found at [16] of Wilson J’s\n                    judgment:The respective priorities of St George, Perpetual and LJK are not in\n                        issue. The question for determination is whether, upon St George’s\n                        power of sale being exercisable under its mortgages and charges, and upon\n                        completion of the contracts, Pearls will take the property and undertaking\n                        of SP Hotel free of any of the interest of Perpetual and LJK under their\n                        respective securities.67     As for the mortgages held overland, there was no dispute because it was clear, under\n                    s 79 of the Land Title Act 1994 (Qld) (for registered land), s 83 of\n                    the Property Law Act 1974 (Qld) (for unregistered land), and s 350 of the\n                    Land Act 1994 (Qld) (for Land Act land), that lower ranking mortgages will be\n                    overreached when a mortgagee exercised its power of sale. This position is\n                    identical to that of England and Singapore. However, unlike Singapore and\n                    England (where the CLPA and the 1925 Act apply tobothreal and personal property), there is no statutory\n                    provision governing the sale ofpersonalproperty\n                    by a mortgagee in the state of Queensland. Thus, in relation to the assets and\n                    undertaking of SP Hotel, it was necessary for the court “to consider the\n                    position [of overreaching] under the general law, apart from statute”\n                        (St George Bankat [34]).68     Due to the absence of any clear authority,\n                    Wilson J began her analysis by tracing the mortgagee’s power of sale\n                    back to Lord Cranworth’s Act 1860 and examined the decision ofJortin’s Case. Relying on a statement by\n                    Lord Cranworth LC, Wilson J took the position that overreaching\n                    also applied to mortgages in general law, independent of any statute.\n                    Wilson J did so by first characterising the Lord Chancellor’s\n                    statement as a “general observation”, and she then reasoned that\n                    this “general observation” was entirely consistent with a\n                    mortgagee’s duty in general law to hold surplus proceeds on trust for\n                    subsequent mortgagees (at [47]–[49]):47    While the decision\n                            inJortin’s Caseturned on the\n                            priority agreement and the application of particular statutes,it is significant that the Lord Chancellor made this\n                                general observation in the introductory part of his\n                                speech:“Now when a mortgage[e] sells under a power, that sale defeats\n                            the rights of all subsequent incumbrancers, whose remedy then is only\n                            against the money in the hands of the vendors...”48What his Lordship said was\n                                consistent with a mortgagee who exercises its power of sale holding\n                                the surplus proceeds on trust for subsequent mortgagees according to\n                                their priorities, and ultimately for the mortgagor.\n                            Disputes about priorities and the amounts owing to those with an\n                            interest in the proceeds could be determined by equity, by way of orders\n                            for accounts and inquires.49In this way the subsequent\n                                mortgagee’s interest in the property was\n                                “over-reached”: the exercise of the power of sale\n                                defeated the subsequent mortgagees’ interest in the property,\n                                at the same time giving them a beneficial interest in the surplus\n                                proceeds of sale.[emphasis added]Having decided that overreaching applied to mortgages in general law,\n                    Wilson J went on to hold that, in principle, the same should apply tocharges(at [50]):50    In principle, the sequelae of the exercise of power\n                            of sale by an equitable chargee are no different from those of the\n                            exercise of power of sale by equitable mortgagee. So long as the charge\n                            gives the chargee the necessary powers or conveyancing mechanisms, the\n                            chargee may convey the legal interest in the charged property, free of\n                            the interests of subsequent chargees in that property. Upon its doing so\n                            the subsequent chargees (an take) [sic] interest in the surplus proceeds\n                            of sale (if any).69     Although it appeared, in my view, that there\n                    is some ambiguity as to whether the Lord Chancellor’s statement (Jortin’s Caseat 1366) can be taken to be a\n                    “general observation”, I would nonetheless agree with Wilson\n                    J’s finding (having arrived at the same conclusion at[64]above) that the concept of overreaching is\n                    entirely consistent with the duty of a mortgagee exercising his power of sale to\n                    hold the surplus proceeds on trust for a subsequent mortgagee. Overreaching is\n                    therefore a consequence of the exercise of the power of sale by the mortgagee\n                    which destroys the equity of redemption and thereby defeats the claims of the\n                    mortgagor and the subsequent mortgagees. Their remedy lies against the surplus\n                    proceeds arising from such a sale.70     The recent decision inSt\n                        George Bankwas derived from my own research. As it appeared to me to\n                    be a case on point, I invited written submissions from both parties, after the\n                    close of submissions, to address me on its relevance to the dispute before me.\n                    Mr Tan sought to distinguishSt Georgeon the\n                    basis that the statutory regime in the state of Queensland was different from\n                    that in Singapore, principally on two grounds: first, the CLPA applied to both\n                    real and personal property whereas the Queensland Property Law Act 1974 (Qld)\n                    only applied to real property; and second, the notice provisions in these two\n                    statutes were worded differently. These differences, however, were immaterial\n                    because Wilson J’s holding inSt Georgewas that overreaching was not a creature of\n                    statute and applied to personal property at general law, which directly answers\n                    the issue raised before me. Accordingly, I find that the defendant’s sale\n                    of the Shares to the plaintiff had overreached UOB’s charge such that the\n                    plaintiff took the Shares free from the UOB charge.Additional observations71     During the course of the trial, it was the\n                    defendant’s evidence that, subsequent to granting the Charge, Guo had also\n                    granted two other charges, on 12 and 20 December 2007\n                    respectively, in favour of several investors including the defendant, under the\n                    Second and Third Investment Agreements. Although this strictly has no immediate\n                    bearing on the issues that are before me, it may affect UOB’s priority of\n                    entitlement to the surplus of the proceeds because those two charges appear to\n                    rank ahead in time of UOB’s charge. However, no documentary evidence of\n                    these other charges was adduced before me, and even if there were such charges,\n                    this is strictly an issue between those chargees and UOB. I therefore make no\n                    finding on this matter.72     There was also a separate question as to the\n                    exact amount that was secured by the Charge. Mr Pillai had informed me that\n                    the calculation of Guo’s indebtedness to the defendant under the First\n                    Investment Agreement was a complicated exercise and was unable to provide me\n                    with the exact sum that was due to the defendant. However, as this is strictly a\n                    matter between the defendant and subsequent chargees, including UOB, I need not\n                    make a finding on the defendant’s exact entitlement to the proceeds\n                    arising out of the S&P Agreement. It would suffice for me to say that the\n                    defendant is under a duty to account for any surplus to the subsequent\n                    mortgagees/chargees after Guo’s debts to the defendant that are secured by\n                    the Charge have been fully discharged.Conclusion73     It bears mentioning that it was the plaintiff\n                    who had approached the defendant to purchase the Shares mortgaged by Guo. The\n                    plaintiff clearly wanted to take over control of the Company. This was\n                    consistent with both her own investments in the Company and the loans which she\n                    had extended to the Company. However, shortly after the S&P Agreement was\n                    entered into, she realised that the Company was not such an attractive\n                    investment opportunity after all. Thereafter, she became determined to find all\n                    possible avenues to extricate herself from the S&P Agreement. Unfortunately\n                    for the plaintiff, the fact that the Company was no longer a viable investment\n                    does not provide a legitimate excuse not to perform her clear and binding\n                    obligation to complete the sale and purchase of the Shares under the S&P\n                    Agreement.74     By reason of the above findings, I make the\n                    following orders:(a)The plaintiff’s claim is hereby dismissed\n                            with costs.(b)As regards the defendant’s\n                            counterclaim:(i)I declare that the S&P Agreement is\n                                    subsisting and binding upon the plaintiff;(ii)The plaintiff is to pay the sum of\n                                    $2,884,000 to the defendant against the transfer of the Shares;\n                                    and(iii)Interest at 5.33% per annum on the sum\n                                    of $2,884,000 from 14 August 2009 (the date the\n                                    counterclaim was filed) to the date of judgment.(c)As the plaintiff’s claim and the\n                            defendant’s counterclaim are related and have common issues, I\n                            will only allow one set of costs to be paid by the plaintiff to the\n                            defendant to be taxed on a standard basis if not agreed.",
        "Originating Summons 228 of 2009": "11     The Creditors decided to take steps to realise\n                    their security under the Charge. However, as Guo had failed to deposit the share\n                    certificates and the share transfer forms with the escrow agent (see[9]above), they realised that they needed the\n                    Court’s assistance in order to enforce the Charge. It was under these\n                    circumstances that the Creditors commenced Originating Summons No 228 of 2009\n                    (“OS 228”) on 25 February 2009 and sought a court order, pursuant\n                    to the Charge, allowing them to transfer and register Guo’s shares in\n                    their names. 12     At that time, Guo was the owner of 4,951,475\n                    ordinary shares in the Company. Although the Charge was granted overallof Guo’s shares in the Company (see[5]above), the Creditors sought to have only\n                    4,208,752 of his shares transferred into their names. That was because one of\n                    the Investors, Mr Wong (whom the Charge was also granted in favour of) did\n                    not join them in bringing OS 228 against Guo and the Company. Therefore,\n                    having taken into account Mr Wong’s contribution, the Creditors\n                    sought to transfer (in proportion to their respective contributions under the\n                    First Investment Agreement: see[2]above)\n                    the following: (a)3,218,458 shares to the defendant (1.3 / 2 x\n                            4,951,475);(b)742,721 shares to Ms Goh (0.3 / 2 x\n                            4,951,475); and(c)247,573 shares to Ms Chong (0.1 / 2 x\n                            4,951,475).13     After OS 228 was filed, UOB was granted\n                    leave to intervene after they asserted that Guo had granted them an equitable\n                    charge on 24 January 2009 over 2.5 million of Guo’s shares in\n                    the Company. At the hearing, UOB objected to OS 228 on the ground that the\n                    reliefs sought by the Creditors were tantamount to foreclosure and the\n                    appropriate order should, instead, be a sale of Guo’s shares subject to a\n                    proper valuation of those shares. In doing so, UOB also asserted that the\n                    defendant owed them a duty to ensure a proper valuation of the shares. The\n                    Company was represented at the hearing but (eventually) did not object to the\n                    application.14     After hearing submissions from UOB and the\n                    Creditors, on 21 May 2009, Lee Seiu Kin J (“Lee J”)\n                    ordered (“the Court Order”),inter\n                        alia, that:(a)Guo’s shares be transferred and registered\n                            in the Creditors’ names in the proportions prayed for at[12]above;(b)The Company to take steps to issue new share\n                            certificates according to the proportions above;(c)The Registrar of the Supreme Court to rectify the\n                            share register of the Company to reflect the Creditors as the new legal\n                            owners of those shares;(d)UOB is recognised as having an equitable charge\n                            over 2.5 million of Guo’s shares which ranks lower in priority\n                            than the Charge.The S&P Agreement15     The plaintiff, like the defendant, also became\n                    a shareholder of the Company due to its listing potential. She had started\n                    investing in the Company in May 2007 when she purchased shares of the\n                    Company from Guo. However, unlike the defendant, the plaintiff took an active\n                    part in the business and affairs of the Company. In fact, the plaintiff, at the\n                    request of the directors of the Company, supported the Company through various\n                    loans, which were extended personally and through companies that she controlled,\n                    because she held the view that the Company was a good long term\n                    investment.16     By March 2009, the plaintiff felt that the\n                    management of the Company was becoming too unwieldy given the number of\n                    shareholders involved. At a shareholders’ meeting on 10 March 2009, the\n                    plaintiff offered to purchase all the shares owned by the otherlocalshareholders at $1.80 per share. Just a day ago,\n                    the plaintiff had separately approached the defendant to purchase the\n                    defendant’s shares in the Company, including the 3,218,458 shares which\n                    the defendant was seeking to register in his name by way of OS 228 (see[12]above).17     Four days later, on 13 March 2009, the\n                    defendant accepted the plaintiff’s offer to buy the shares and entered\n                    into the S&P Agreement to sell the 3,218,458 shares charged by Guo, to\n                    the plaintiff for a total consideration of $3,384,000. Pursuant to the terms of\n                    the S&P Agreement, the plaintiff duly paid the deposit of $500,000 to\n                    the defendant. For completeness, I should add that the plaintiff was, at all\n                    material times, fully aware of the UOB charge when she entered into the S&P\n                    Agreement.18     The material terms of the S&P Agreement\n                    are as follows:(B)The Vendor has filed Originating Summons No 228 of\n                            2009/P (hereinafter referred to as the “Originating\n                            Summons”) in the High Court of the Republic of Singapore\n                            (hereinafter referred to as the “High Court”) for orders\n                            to effect the transfer and registration of 3,218,458 ordinary\n                            shares of the Company presently held by Mr. Guo Ze Ming in the name of\n                            the Vendor (hereinafter referred to as “Future Sale\n                            Shares”); and(C)The Purchaser is desirous of purchasing the Future\n                            Sale Shares from the Vendor on the terms and conditions of this\n                            Agreement.IT IS AGREED that:1.    SALE OF FUTURE SALE\n                            SHARES1.1    The Vendor agrees to\n                            sell and the Purchaser agrees to purchase, the Future Sale Shares free\n                            from all encumbrances together with all rights, benefits, title and\n                            interests attaching to them.1.2    The total consideration payable by the Purchaser to the Vendor for the\n                            Future Sale Shares shall be the sum of\n                            S$3,384,000.1.3    The completion\n                            of the sale and purchase of the Future Sale Shares shall take place no\n                            later than one (1) week after the transfer and registration of the\n                            Future Sale Shares in the name of the Vendor, the exact date to be\n                            agreed by the Vendor and the\n                            Purchaser.2.    CONDITIONS\n                            PRECEDENT2.1    Completion of sale\n                            and purchase of the Future Sale Shares shall be conditional uponALLof the following conditions\n                            having been fulfilled or otherwise waived by the Vendor:2.1.1The Purchaser pays to the Vendor a sum of\n                                S$500,000 at the date of execution of this Agreement;2.1.2In relation to the Originating Summons which\n                                is fixed for hearing in the High Court on 31 March 2009 (or on\n                                such other adjourned date), the Company does not object (or if\n                                possible, consents) to the Vendor’s said application for the\n                                transfer and registration of the Future Sale Shares in the name of\n                                the Vendor;2.1.3The Originating Summons for the Future Sale\n                                Shares to be transferred and registered in the name of the Vendor is\n                                granted by the High Court;2.1.4The Company takes all necessary steps to\n                                facilitate the transfer and registration of the Future Sale Shares\n                                in the name of the Vendor; and2.1.5Further to any order granted by the High\n                                Court, the Vendor completes the transfer and registration of the\n                                Future Sale Shares in his name.It is immediately apparent from these terms that\n                    the completion of the S&P Agreement specifically contemplated the defendant\n                    obtaining an order in OS 228 for the transfer and registration of the\n                    Shares in his name.Events leading up to the proceedings19     Immediately after the defendant had obtained\n                    the Court Order in OS 228, the plaintiff as director (she was appointed as\n                    director of the Company on 10 March 2009) issued a notice later in the\n                    evening of 21 May 2009 for an extraordinary general meeting\n                    (“EGM”) to pass various resolutions which included,inter alia, a resolution to allot up to 6,000,000 shares\n                    to herself as part payment of her loans to the Company. The resolutions were not\n                    carried at the EGM held on 6 June 2009.20     In the meantime, the defendant encountered\n                    enormous difficulties with the Company in relation to the issuance of new share\n                    certificates as earlier ordered by Lee J on 21 May 2009.\n                    Eventually on or about 29 June 2009, the defendant filed a further\n                    application in OS 228 for an order for the Registrar of the Supreme Court\n                    to issue the new share certificates instead. The order was duly granted by\n                    Lee J on 30 June 2009. With 3,218,458 of Guo’s shares now\n                    registered in the defendant’s name, the stage was set for completion under\n                    the S&P Agreement (at least so the defendant thought). Therefore, on\n                    6 July 2009, the defendant informed the plaintiff that he was ready,\n                    willing and able to transfer the Shares to her, and proposed for completion to\n                    take place on 8 July 2009.21     However, there came a further twist to this\n                    saga. ComLaw LLC, who had previously represented the Company in OS 228,\n                    filed a winding up petition against the Company on behalf of Rainbow Offshore\n                    Supplies Pte Ltd (“Rainbow Offshore”) on 24 June 2009. This\n                    petition was filed on the basis that Rainbow Offshore had extended a loan of RMB\n                    12 million to the Company. It is not disputed that Rainbow Offshore was, at all\n                    material times, controlled by the plaintiff. Although the defendant initially\n                    opposed the winding up petition in order to investigate the alleged loan, he\n                    eventually decided against it. Consequently, on 14 August 2009, the Company\n                    was ordered to be wound up.22     By various letters dated 8 July,\n                    13 July and 20 July 2009, the plaintiff claimed,inter alia, that she was not obliged to complete the\n                    S&P Agreement because the UOB charge amounted to an encumbrance and\n                    that the commencement of the winding up petition against the Company had\n                    frustrated the S&P Agreement. Thereafter, on 20 July 2009, the\n                    plaintiff commenced the present action against the defendant to recover the\n                    $500,000 deposit paid under the S&P Agreement. In response, the\n                    defendant counterclaimed against the plaintiff for specific performance of the\n                    S&P Agreement and for payment of the balance sum of $2,884,000\n                    ($3,384,000 less $500,000) due under the S&P Agreement, or for damages\n                    arising out of the plaintiff’s breach to be assessed.The issues before this court23     When the trial commenced before me, the\n                    plaintiff raised the following issues as arising from the pleadings for\n                    determination:(a)     Whether the S&P Agreement was\n                        entered into pursuant to the power of sale under the Charge, and whether the\n                        defendant could convey the legal title of the Shares to the plaintiff\n                        pursuant to that power of sale (collectively “the Power of Sale\n                        Issues”).(b)     Whether the defendant’s sale of the Shares to the plaintiff\n                        overreached the UOB Charge such that the plaintiff took the Shares free from\n                        the UOB Charge (“the Overreaching Issue”).(c)     Whether the defendant was in breach of\n                        an implied term of the S&P Agreement not to take steps to diminish or\n                        destroy the value of the Shares.(d)     Whether the S&P Agreement was frustrated by the\n                        winding up of the Company (“the Frustration\n                    Issue”).(e)     Whether the Court Order was procured by fraud on the part of the defendant\n                        (“the Fraud Issue”).(f)     Whether the Company’s objection to the\n                        defendant’s application in OS 228 for the transfer and\n                        registration of the Shares constituted a non-fulfilment of a condition\n                        precedent of the S&P Agreement.24     After the close of the defendant’s case\n                    and in light of the evidence adduced at the trial, counsel for the plaintiff,\n                    Mr Alvin Tan (“Mr Tan”), quite sensibly, decided not to\n                    pursue issues (c) and (f) above.The nature of the defendant’s security interest in the\n                Shares25     Before I address the remaining live issues, it\n                    would be useful for me to clarify the nature of the defendant’s security\n                    interest in the Shares, which had been labelled “Security Charge”.\n                    The immediate question for consideration was whether the security interest was a\n                    charge or an equitable mortgage.26     On this point, it was recently observed by\n                    Judith Prakash J inPower Knight Pte Ltd v Natural Fuel\n                        Pte Ltd (in compulsory liquidation)[2010] 3 SLR 82 (at [23]–[24]), after citingGoode on Legal Problems of Credit and Security(Louise Gullifer\n                    ed) (Sweet & Maxwell, 4th Ed, 2008), that the difference between an\n                    equitable mortgage and charge may depend on the availability of self-help\n                    remedies:23    One of the distinctions between a charge and an\n                            equitable mortgage is that the chargee is not entitled to avail himself\n                            of the self-help remedies of sale, possession or appointment of a\n                            receiver (though he may apply to the court for one of these remedies):Goode, para 1-51 (n 184),Fisher and Lightwood's Law of Mortgage(Wayne Clark ed) (LexisNexis Butterworths, 12th Ed, 2006)\n                                [“Fisher and\n                            Lightwood”], paras 6.1 and 6.3.24    Given that the parties intended that Power Knight\n                            should have all the remedies available to a mortgagee, I am inclined to\n                            regard Power Knight's security interest as an equitable\n                        mortgage.Notwithstanding Prakash J’s observation, self-help\n                    remedies such as the power of sale and the power to appoint a receiver are now\n                    also commonly provided for in charge instruments. As such, as aptly observed inFisher and Lightwoodat para 6.3 andCousins on the Law of Mortgages(Edward\n                    Cousins ed) (Sweet & Maxwell, 2001) (“Cousins”) at para 1-13, the remaining distinction\n                    between a mortgage and a charge appears to be, in principle, that a mortgagee\n                    has the right to foreclosure and to go into possession whereas a chargee does\n                    not.27     However, despite the label, both parties were\n                    content to proceed on the basis that the defendant’s security interest in\n                    the Shares was that of anequitable mortgage. For\n                    good measure, counsel for the defendant, Mr Pradeep Pillai\n                    (“Mr Pillai”), cited two authorities for the proposition that\n                    the deposit of share certificates accompanied by blank transfer forms does give\n                    rise to an equitable mortgage over the relevant shares. Both these authorities,\n                    although dating back some time, still remain good law. The first decision wasHarrold v Plenty[1901] 2 Ch 314 in which Cozens-Hardy J stated\n                    at 316:The only material allegation in the statement of claim is that in March,\n                        1897, the defendant deposited with Harrold the certificate of ten ordinary\n                        shares in a limited company as security for the repayment to Harrold of the\n                        sum of 150l., then owing to him from the defendant, with interest thereon at\n                        the rate of 6l. per cent. per annum.Now, it is plain\n                            that a pledgee is in a very different position from an ordinary\n                            mortgagee. He has only a special property in the thing pledged. He may\n                            obtain a sale, but he cannot obtain a foreclosure. I do not think that\n                            this is properly a case of pledge. A share is a chose in\n                        action. The certificate is merely evidence of title, and whatever may be the\n                        result of the deposit of a bearer bond, such as that which Sir George Jessel\n                        dealt with inCarter v. Wake, I think I cannot\n                        treat the plaintiff as a mere pledgee.The deposit of the\n                            certificate by way of security for the debt, which is admitted, seems to\n                            me to amount to an equitable mortgage, or, in other words, to an\n                            agreement to execute a transfer of the shares by way of\n                            mortgage. The result is that the plaintiff is entitled to a\n                        judgment substantially in the form which would be given if, instead of the\n                        certificate of shares, the document had been a title-deed of real estate or\n                        a policy of assurance.[emphasis added]Similarly, inStubbs v Slater[1910]\n                    1 Ch 632 the court came to the same conclusion that a transaction\n                    under which shares were handed over with a share transfer form executed in blank\n                    to secure a debt was a mortgage that gave the mortgagee the right of foreclosure\n                    (at 638–639):If one asks how they were entitled to sell it is necessary to go back a\n                        step.The plaintiff handed over to the brokers one\n                            certificate for the 390 shares together with a transfer executed by the\n                            plaintiff in blank, in which the numbers of the shares were specified,\n                            but the name of the purchaser and the consideration were, of course, not\n                            specified. It was the ordinary well-known transfer in blank.\n                        Now what is the effect of that? I am astonished that there should be any\n                        doubt about it. So long ago as 1899 Stirling J. inLondon and Midland Bank v Mitchelldealt with a case of\n                        precisely this nature and indicated what was the legal effect of it. That\n                        was a case in which certain shares together with a blank transfer had been\n                        deposited with a bank to secure a debt, and it was held that the bank had\n                        not lost their right against the shares although their simple contract\n                        remedy against the client was lost by reason of the Statute of Limitations.The Court there pointed out that the whole\n                            transaction was a mortgage as to which the bank were entitled to the\n                            ordinary remedy of foreclosure.[emphasis added]28     As already mentioned at[9]above, clause 3.3 of the S&P Agreement\n                    required Guo to deposit the share certificates and blank transfer forms with the\n                    escrow agent. In my view, Guo’s omission to deposit the share certificates\n                    and blank transfer forms did not alter the agreement between the parties or the\n                    nature of the defendant’s security interest in the Shares. In this regard,\n                    the plaintiff has not suggested otherwise. Accordingly, I find that the security\n                    interest created by the Charge in favour of the defendant was that of an\n                    equitable mortgage.The Frustration IssueThe relevance of section 259 of the Companies Act29     In the present case, although the S&P\n                    Agreement was entered into prior to the commencement of the winding up of the\n                    Company, the completion of the sale was scheduled to take placeafterthe commencement of the winding up. Cursorily, the\n                    sale of the Shares may therefore appear to be rendered void by s 259 of the\n                    Companies Act (Cap 50, 2006 Rev Ed) (“Companies Act”),\n                    which reads as follows:Avoidance of dispositions of property,\n                        etc.259. Any disposition of the property of the\n                        company, including things in action, and any transfer of shares or\n                        alteration in the status of the members of the company made after the\n                        commencement of the winding up by the Court shall unless the Court otherwise\n                        orders be void.30     Mr Pillai, however, drew my attention to\n                    the decision of the Supreme Court of Victoria inJordanlane\n                        Pty Ltd v Kimberley Jane Elizabeth Kitching Andrew[2008]\n                    VSC 426 wherein the rationale for s 468 of the Corporations Act 2001\n                    (Cth) (“Corporations Act”) (the Australian equivalent of\n                    s 259 of the Companies Act) was lucidly explained. The primary purpose\n                    behind s 468 of the Corporations Act is to prevent a shareholder from\n                    evading liability as a contributory by transferring shares to some impecunious\n                    person after the commencement of winding up. The Court went on to observe that\n                    such a purpose can be sufficiently served by avoiding the transfer of the shares\n                    only as far asthe companyis concerned.\n                    Accordingly, a purchaser of the shares, such as the plaintiff, cannot avoid\n                    completion in respect of agreements which were entered into prior to the\n                    commencement of winding up, even if the company should subsequently be wound\n                    up.31     Mr Tan quite rightly did not seek to rely\n                    on s 259 of the Companies Act to avoid completion of the S&P\n                    Agreement.Winding up of the Company32     The plaintiff submitted that the S&P\n                    Agreement was frustrated by the winding up of the Company on 14 August\n                    2009, since the subject matter of the S&P Agreement,iethe Shares, were no longer in existence as a result of the\n                    winding up order. No authority was cited in support by Mr Tan other than\n                    his reliance on s 7 of the Sale of Goods Act (Cap 393, 1999 Rev\n                    Ed) (“the Sale of Goods Act”) which provides as follows:Goods perishing before sale but after agreement\n                            to sell7. Where there is an agreement to sell\n                        specific goods and subsequently the goods, without any fault on the\n                        part of the seller or buyer, perish before the risk passes to the\n                        buyer, the agreement is avoided.33     However, notwithstanding his reliance on\n                    s 7 of the Sale of Goods Act, and purportedlyby way of\n                        analogyat that, Mr Tan was unable to identify any authority\n                    that “shares” fell within the rubric of “goods”\n                    under the Sale of Goods Act. The short answer to the plaintiff’s\n                    submission is that the Sale of Goods Act does not apply to shares. This much is\n                    clear from the definition of “goods” itself in s 61(1) of the\n                    Sale of Goods Act:“goods” includes all personal chattels other than\n                        things in action and money; and in particular “goods”\n                        includes emblements, industrial growing crops, and things attached to or\n                        forming part of the land which are agreed to be severed before sale or under\n                        the contract of sale and includes an undivided share in goodsIt is thus apparent on the face of s 7 that the definition of\n                    “goods” under the Sale of Goods Act specifically excludes choses\n                    in action, and there is ample authority to show that shares are merely choses in\n                    action and are therefore, by definition, excluded from the Sale of Goods\n                    Act.34     Further, the definition of goods under\n                    s 61(1) of the Sale of Goods Act is practically identical to the definition\n                    of goods under s 61(1) of the English Sale of Goods Act 1979 (c 54)\n                    (“the UK Act”).Benjamin’s Sale of\n                        Goods(AG Guest et al ed) (Sweet & Maxwell, 7th Ed, 2006)\n                    states thus at para 1-080:[T]he statutory exclusion of things (or choses) in action means that\n                        shares and other securities, debts, bills of exchange and other negotiable\n                        instruments… and other incorporeal property are not capable of being\n                        ‘goods’ for the purposes of the Act.To put the issue beyond any doubt, English case law is clear that the\n                    UK Act does not apply to shares because they are things (or choses) in action,\n                    and this can easily be ascertained from the following two decisions, of which\n                    the first is the House of Lords decision ofCommissioners of\n                        Inland Revenue v Crossman[1937] AC 26, in which Lord\n                    Roche explained at 72:By a sale I mean and understand a transaction which passes the property in\n                        the thing sold. It must always be borne in mind that the Finance Act of 1894\n                        is dealing with all descriptions of property and not expressly with shares,\n                        and I regard the word \"sold\" in s. 7, sub-s. 5, of this Act as having the\n                        same meaning as the word \"sale\" in the Sale of Goods Act, 1893: see s.\n                        1, subs.3, of that Act. Shares with many other kinds of property are,\n                        of course, not within the ambit of the Sale of Goods Act; but I am of\n                        opinion that for the purposes of the Finance Act, 1894, for shares to be\n                        sold the property in them, by which I mean the legal property, must\n                        pass.The other decision isBritish & Commonwealth\n                        Holdings Plc v Quadrex Holdings Inc[1995] CLC 1169 by\n                    the English Court of Appeal (at 1226):I have no doubt that the method proposed by Samuel Montagu is appropriate\n                        in the case of a commodity for which there is an available market. It is\n                        akin to the rule in s. 50(3) and s. 51(3) of the Sale of Goods Act 1979;\n                        although the Act does not apply to a chose in action such as shares in a\n                        company, it merely reflects the common law.Mr Tan did not attempt to make any submission as to why the\n                    position in Singapore should be any different from that in\n                England.35     Mr Pillai, on the other hand, helpfully\n                    referred me to a series of Australian and New Zealand authorities which have\n                    consistently held that the insolvency of a company does not frustrate agreements\n                    for the sale and purchase of shares in the company. The frustration defence was\n                    raised and rejected inEzishop.Net Ltd (in Liq) v Veremu Pty\n                        Ltd[2003] NSWSC 156; 45 ACSR 199 where the\n                    Supreme Court of New South Wales held (at [66]) that:In exercising the judgment the court is required to make as to whether\n                        insolvency and liquidation has brought about the frustration of the\n                        agreement there are a number of matters to be taken into account. First, on\n                        the evidence as to the circumstances in which the agreement was made, I am\n                        satisfied that the prospect of loss of their investment by reason of\n                        insolvency and liquidation was within the contemplation of the defendants\n                        when the agreement was made. Second, I am satisfied that the obligations of\n                        the parties to the agreement are not affected by the event complained of,\n                        nor has it been shown that the event in any relevant way has altered the\n                        situation of the parties, radically or otherwise. Third,it is plain that the event complained of does not result in the\n                            impossibility of performance of the agreement in that the shares (and\n                            the rights and entitlements attaching to them) have been neither\n                            destroyed nor changed. It is not enough to demonstrate that the event\n                            may have had a detrimental effect upon the value of the\n                            shares. According to Lord Radcliffe, it is not hardship or\n                        inconvenience or material loss itself which calls the principles of\n                        frustration into play.[emphasis added]36     Similarly the same defence was also raised and\n                    rejected by the High Court of New Zealand inKoutsojiannis v\n                        Brown[1981–1983] 1 NZCLC 98,081. I only need\n                    quote from the headnote:The doctrine of frustration does not apply to a contract for the purchase\n                        of shares which is unable to be performed because of the company being wound\n                        up. There was in this case no intervening event or change of circumstances\n                        which were so fundamental as to strike at the root of the agreement for the\n                        sale of the shares. The matter must be considered in the light of the\n                        circumstances pertaining at the time when the contract was entered into. The\n                        failure of the company was simply an ordinary business risk which anyone\n                        buying shares in a company must take as regards the future of the company\n                        concerned.37     Mr Tan, when confronted with the force\n                    and weight of the above authorities, conceded that he was unable to distinguish\n                    them from the present case. Accordingly, the legal position is abundantly clear\n                    that the winding up of the Company did not frustrate the S&P Agreement.\n                    There is therefore no need for me to even consider the defendant’s\n                    alternative argument that the frustration, if established, was in any event\n                    self-induced.The Fraud Issue38     On or about 22 June 2010, just prior to\n                    the commencement of the trial, the plaintiff amended the Statement of Claim to\n                    rely on an additional ground of fraud to prevent the defendant from enforcing\n                    the S&P Agreement.39     As can be seen from the terms of the S&P\n                    Agreement at[18]above, it was a condition\n                    precedent for the defendant to procure an order of court for the Shares to be\n                    transferred and registered in the name of the defendant. This was accomplished\n                    by the defendant by way of the Court Order in OS 228. However, the\n                    plaintiff alleged that the defendant was not entitled to rely on the Court Order\n                    because it was procured by way of fraud. It is perhaps relevant to highlight the\n                    fact that there was no appeal against the Court Order and no step has been taken\n                    to set it aside. As such, it is questionable whether the plaintiff ought to be\n                    allowed to even raise this point at this juncture. Nonetheless, I shall consider\n                    the merits or lack thereof of the plaintiff’sfraudargument.40     According to Mr Tan, the defendant had,\n                    in OS 228, “actively misrepresented” to the court that there\n                    was no sale of the Shares when he had in fact entered into the S&P Agreement\n                    with the plaintiff. To establish this, Mr Tan relied on two statements made\n                    by the defendant in OS 228. The first of the two statements can be found in\n                    the defendant’s affidavit filed on 12 May 2009, in which he referred\n                    to UOB’s claim as being “premature”:10.1.3    At the same paragraph, UOB asserts that the\n                            [Creditors] owe a duty to UOB to ensure that there is a proper valuation\n                            of the Subject Shares at the time those shares are disposed of in light\n                            of UOB’s second charge over the Charged Shares.10.1.4    Quite apart from the fact that UOB’s\n                            aforesaid argument is premature, the [Creditors’] principal\n                            position is that there is no duty owed to the UOB as UOB do not hold an\n                            equitable charge over the same shares.The other statement can be found in the defendant’s written\n                    submissions, where he had stated that the application in OS 228 was not to\n                    sanction any sale of the Shares, but was simply to have the Shares registered in\n                    his name. Mr Tan attempted to persuade this court that these two statements\n                    were “active misrepresentations” amounting to fraud. I simply\n                    could not agree with this submission.41     Taking the plaintiff’s case at its\n                    highest, all that the plaintiff can say is that the defendantdid not discloseto the court that the defendant had entered\n                    into the S&P Agreement to sell the Shares to the plaintiff after OS 228\n                    was filed. For such an omission to amount to fraud, in my view, Mr Tan had\n                    to show, first, that there was adutyon the\n                    defendant to disclose that information to the court in OS 228, and the\n                    question of whether there was such a duty to disclose would, in turn, depend on\n                    whether that information was relevant and material to the issues in\n                    OS 228.42     In OS 228, the defendant had sought to\n                    transfer and register the Shares in his name pursuant to the Charge, of which\n                    clause 3.4 expressly provides for the Shares to be transferred to and registered\n                    in the defendant’s name upon an event of default at Guo’s cost and\n                    expense:[Guo] hereby acknowledges and agrees that the [Investors] may at any time\n                        (with or without [Guo’s] assistance) arrangefor\n                            the Shares to be transferred to and registered in the name of the\n                            [Investors] or their nominee(s) at the cost and expense of\n                            [Guo], including but not limited to any stamp duty or legal\n                        fees payable in relation to the transfers of the Shares in the event that\n                        [Guo] fail to perform the relevant obligations of this [Charge] and the\n                        [First Investment Agreement].[emphasis added]The effect of this clause was to allow the Investors, who were\n                    equitable mortgagees, to perfect their security and becomelegalmortgagees over the Shares. Ideally, the defendant would\n                    have been in a position to transfer the Shares to himself had Guo complied with\n                    the obligation to deposit the share certificates and blank transfer forms with\n                    the escrow agent (see[9]above). However, it\n                    was precisely because of Guo’s failure to do so that the defendant had no\n                    choice but to commence OS 228 in order to perfect his security; and it was\n                    on this basis that the court had granted the Court Order in\n                OS 228.43     As such, I fail to see why it would be\n                    material for the court in OS 228 to be informed of the pending sale when\n                    such information had no bearing whatsoever to the issue as to whether the\n                    defendant was entitled to transfer and register the shares in his name under the\n                    Charge. In this connection, Mr Tan submitted that there were twopossibleadvantages to be gained by the defendant by not\n                    disclosing the sale. It was alleged that there would be no need for the\n                    defendant to value the Shares as averred by UOB. It was also suggested that the\n                    defendant would be able to retain any surplus from the sale of the Shares\n                    without having to account to UOB as the subsequent equitable chargee. It is\n                    immediately apparent that neither of these twosupposedreasons has any direct bearing on the plaintiff. They\n                    both concerned, at best, UOB. In my view, neither reason has any merit\n                    whatsoever. First, the Court Order did not dispense with the need for valuation\n                    particularly since the application was not for sanction of the sale. Therefore\n                    if the Shares were sold below valuation, that is a matter to be taken up by UOB\n                    against the defendant. Secondly, as the Court Order was not for sanction of the\n                    sale of the Shares, there can be no question that the defendant was somehow\n                    excused from having to account to UOB or any other party as regards any surplus\n                    proceeds from the sale. Thirdly, it is indeed curious that it was the plaintiff\n                    who raised this objection instead of UOB. Interestingly, UOB, the party whom the\n                    plaintiff had alleged was effectively “defrauded” by the Court\n                    Order, instead of making any similar accusation against the defendant, had in\n                    fact reminded the defendant to “exercise their right of sale as chargees\n                    in line with their duties as chargees in law”. Finally, when Mr Tan\n                    was invited to explain why the Court would not have granted the Court Order if\n                    the pending sale had been disclosed, he was unable to provide any satisfactory\n                    explanation. In the circumstances, I find that there is no conceivable reason\n                    why the Court Order would not have been granted in OS 228 if the court had\n                    been apprised of the defendant’s pending sale of the Shares to the\n                    plaintiff. The plaintiff’s argument on fraud is therefore plainly\n                    misconceived.The Power of Sale Issues44     Mr Tan raised two arguments with respect\n                    to the defendant’s exercise of his power of sale: first, he submitted that\n                    because the defendant’s exercise of his power of sale under the Charge was\n                    defective, the defendant’s sale of the Shares under the S&P Agreement\n                    was thereforeultra vires; and second, even if the\n                    defendant had properly exercised his power of sale under the Charge, being an\n                    equitable mortgagee, he could not convey the legal title other than by way of a\n                    court-sanctioned sale under s 30(2) of the Conveyancing and Law of Property\n                    Act (Cap 61, 1994 Rev Ed) (“CLPA”), which provides that\n                    the court may “direct a sale of the mortgaged property, on such terms as\n                    it thinks fit”.Whether the S&P Agreement was entered into pursuant to the power\n                of sale under the Charge45     The plaintiff sought to show that the\n                    defendant, in exercising his power of sale, had failed to comply with the\n                    requirements under the Charge in two respects.46     First, the plaintiff claimed that the 5-day\n                    notice required to be given under clause 8.2 of the Charge was not given by the\n                    defendant to Guo, and hence the sale was defective. Such a submission is, in my\n                    judgment, based on a complete misunderstanding of the purpose of such notices.\n                    It is trite that such notices are intended to protect the interest of the\n                    mortgagor (seeSingapore Finance Ltd v Ben’s Electrical\n                        Engineering Pte Ltd[1986] SGHC 55). It cannot be\n                    seriously disputed that Guo had to all intents and purposes abandoned any\n                    intention to either contest the enforcement of the Charge or the sale of the\n                    Shares under the S&P Agreement. This is self-evident from Guo’s\n                    complete failure to respond to any of the defendant’s letters in relation\n                    to the S&P Agreement or the Charge. In fact, Guo did not even bother to\n                    enter an appearance in OS 228, after having been served. In any event,\n                    notice of the defendant’s intention to exercise all his rights under the\n                    Charge was in fact given to Guo through the defendant’s solicitors’\n                    letter dated 12 February 2009.47     Secondly, the plaintiff submitted that clause\n                    8.3 of the Charge contemplated a joint exercise of the power of sale byallthe Investors. Since the\n                    S&P Agreement was only concluded with the defendant, the sale could not\n                    have been an exercise of the power of sale under the Charge. The inspiration for\n                    this submission was based on the wording in clause 8.3 which provides that\n                    “all moneys received pursuant to the exercise of the power of sale\n                    described in clause 8.2 shall be apportioned amongst the Chargees\n                    proportionately.” On a plain reading, clause 8.3 merely required that the\n                    proceeds from the sale ofallof Guo’s\n                    mortgaged shares are to be apportioned proportionately among the Investors as\n                    mortgagees. However, the question of apportionment does not arise in the present\n                    case because, by virtue of the Court Order granted in OS 228, Guo's shares\n                    had already been apportioned among the Creditors and the defendant was selling\n                    onlyhisproportion of the shares,ie3,218,458 out of the total 4,208,752 shares mortgaged\n                    by Guo under the Charge.48     For the foregoing reasons, I find that the\n                    defendant’s sale of the Shares under the S&P Agreement was a valid\n                    exercise of the power of sale granted to him under the Charge.Whether the defendant could convey the legal title to the\n                plaintiff49     On this point, Mr Tan relied on two\n                    passages from leading textbooks in support of the proposition that if an\n                    equitable mortgage was not made by deed, then theonlyway that an equitable mortgagee can sell the legal interest\n                    of the mortgaged property is by applying to court for a sale under s 30(2)\n                    of the CLPA. It would then follow that as the defendant had not obtained a\n                    court-sanctioned sale, he could not sell or convey the legal interest in the\n                    Shares to the plaintiff. The first passage is found inFisher\n                        and Lightwoodat para 30.43:In the case of an equitable mortgage not made by deed, there is no\n                        statutory power of sale. If the mortgagee wishes to sell, he must therefore\n                        apply to the court, which will be able to vest in him a legal term of years,\n                        so he can sell as if he were a legal mortgagee.The other passage is fromCousinsat\n                    para 16-121:In the case of other equitable mortgages not made by deed, there is no\n                        statutory power of sale out of court. However, by virtue of section 91(2) of\n                        the [1925 Act], the court itself has the power to order a judicial sale on\n                        the application of the mortgagee or of any interested person and may vest a\n                        legal term of years in the mortgagee so that he can sell as if he were a\n                        legal mortgagee.50     This submission, to my mind, was a complete\n                    non-starter. First, it is certainly correct that if the mortgage was not made by\n                    deed, then the mortgagee has nostatutorypower of\n                    sale. This much is clear from s 24(1)(a) of\n                    the CLPA:Power incident to estate or interest of\n                            mortgagee.24. —(1) A mortgagee,where the mortgage is made by deed, shall have the\n                            following powers, to the like extent as if they had been in\n                        terms conferred by the mortgage deed, but not further:(a) a power, when the mortgage money has become due, to sell, or to\n                            concur with any other person in selling, the mortgaged property, or any\n                            part thereof, either subject to prior charges, or not, and either\n                            together or in lots, by public auction or by private contract, subject\n                            to such conditions respecting title, or evidence of title, or other\n                            matter, as the mortgagee thinks fit, with power to vary any contract for\n                            sale, and to buy in at an auction, or to rescind any contract for sale,\n                            and to resell, without being answerable for any loss occasioned\n                            thereby;[emphasis added]However, what these two passages really meant, in my judgment, was\n                    that, in a situation where the mortgage was not made by deed, an equitable\n                    mortgagee who has nootherpower or mechanism to\n                    convey the legal title out of court would simply have no choice but to apply to\n                    court to sell or convey the legal title. Examples of such mechanisms that allow\n                    the transfer of the legal title out of court can be found in mortgage\n                    instruments and include: the granting of a power of attorney to the equitable\n                    mortgagee to convey the legal interest (Re White Rose\n                        Cottage[1965] 1 Ch 940), or a declaration by the\n                    mortgagor that he holds the legal interest on trust for the mortgagee (London and County Banking Co v\n                    Goddard[1897] 1 Ch 642).51     In any event, the defendant had already become\n                    the legal mortgagee as a result of the Court Order in OS 228 (see[42]above); and as the legal mortgagee having\n                    legal title to the Shares, he was therefore entitled to convey the legal\n                    interest to the plaintiff without the need for a further court-sanctioned\n                    sale.The Overreaching Issue52     I now come to the final issue which, in my\n                    view, was really the central issue of the present dispute.53     The defendant claimed that because the S&P\n                    Agreement was entered into pursuant to a valid exercise of a mortgagee’s\n                    power of sale, the sale of the Shares had therefore overreached the UOB charge\n                    and, as a result, the plaintiff took the Shares free from all encumbrances. The\n                    plaintiff countered that the overreaching effect only applies tostatutorysales by mortgagees as provided for in the\n                    CLPA, and since the Charge and the S&P Agreement were not executed by way of\n                    deed, there was non-compliance with ss 24(1) and 26(1) of the CLPA\n                    with the corresponding result that the UOB charge wasnotoverreached as claimed by the defendant.54     The overreaching effect of a mortgagee\n                    exercising his statutory power of sale is expressed in s 26(1) of the\n                    CLPA:Conveyance receipt, etc., on sale.26. —(1) A mortgagee exercising the\n                        power of sale conferred by this Act may by deed convey the property sold,\n                        for such estate and interest therein as is the subject of the mortgage,freed from all estates, interests and rights to which\n                            the mortgage has priority, but subject to all estates, interests and\n                            rights which have priority to the mortgage.[emphasis added]55     The plaintiff submitted that since neither the\n                    Charge nor the S&P Agreement was executed by way of a deed as required\n                    by s 24(1)(a) and s 26(1) of the CLPA\n                    respectively, the sale under the S&P Agreement could not have had any\n                    overreaching effect. This submission was premised on the proposition that\n                    overreaching is a creature of statute; and if that is correct, then there may be\n                    merit in concluding that an overreaching effect can only be achieved by the\n                    exercise of a statutory power of sale. In such an event, non-compliance with\n                    s 26(1) of the CLPA would certainly be fatal to the defendant’s case.\n                    It is therefore essential to determine whether the same overreaching effect\n                    applies in general law independent of the CLPA.56     Section 26(1) of the CLPA has been\n                    considered in at least three Singapore High Court decisions: seeDBS Finance Ltd v Prime Realty Pte Ltd[1990]\n                    2 SLR(R) 740,Indian Overseas Bank v Cheng Lai\n                        Geok[1991] 2 SLR(R) 574 (“Indian Overseas Bank”) andWin\n                        Supreme Investment (S) Pte Ltd v Joharah bte Abdul Wahab (Sjarikat\n                        Bekerjasama Perumahan Kebangsaan Singapura, third party)[1996] 3 SLR(R) 583 (“Win Supreme\n                        Investment”). From these decisions, it is clear that an\n                    exercise of a mortgagee’s statutory power of sale does overreach\n                    subsequent encumbrances such that a purchaser takes the property free from those\n                    encumbrances. The position, however, is not entirely clear where the exercise of\n                    the power of sale is not statutory but pursuant to a contractual\n                right.57     The plaintiff initially sought to rely on bothIndian Overseas BankandWin Supreme Investmentto demonstrate that there can be no\n                    overreaching effect other than through the operation of s 26(1) of the\n                    CLPA. However when the two decisions are closely examined, it is clear that\n                    neither of them support the plaintiff’s submission. InWin Supreme Investment, Chao Hick Tin J held\n                    (at [21]–[22] and [25]) that the sale by the mortgagee pursuant to\n                    s 26(1) of the CLPA did overreach the rights of the mortgagor and of any\n                    other person who obtained their rights from the mortgagor and subsequent to the\n                    mortgage, which included a lessee of the mortgagor (the lease was entered in\n                    breach of the mortgage). Likewise inIndian Overseas\n                        Bank, after stating that s 26(1) of the CLPA also applied to\n                    registered land, Goh Phai Cheng JC held (at [36]) that the defendant\n                    purchaser had obtained good title of the property free of the four caveats that\n                    were lodged after the mortgage was created. Indeed, there was simply no\n                    suggestion in eitherWin Supreme InvestmentorIndian Overseas Bankthat the overreaching\n                    effect canonlybe achieved by the exercise of the\n                    statutory power of sale under s 26(1) of the CLPA. As, to my knowledge,\n                    there is no direct Singapore authority covering this precise point, it is\n                    essential to trace the historical origin of s 26(1).58     The CLPA is derived from the Conveyancing and\n                    Law of Property Ordinance (Ordinance 6 of 1886) of the Straits Settlements,\n                    which in turn was based on the English Conveyancing and Law of Property Act 1881\n                    (44 & 45 Vict, c 41) (“the 1881 Act”), which in turn\n                    superseded Lord Cranworth’s Act 1860 (23 & 24 Vict, c 145). A\n                    brief history of the statutory power of sale in England was succinctly provided\n                    by Briggs J inHorsham Properties Group Ltd v\n                        Clark[2009] 1 WLR 1255 (at 1260):None the less,from the early 19th century it became\n                            common for the parties to legal mortgages to insert an express power of\n                            sale, until it was rendered unnecessary to do so by the creation of a\n                            statutory power of sale in Lord Cranworth's Act 1860 (23 & 24 Vict,\n                            c 145), repeated in section 19(1) of the Conveyancing Act 1881 (44\n                            & 45 Vict, c 41) and now to be found in section 101(1)(i) of the\n                            LPA. The exercise of that power overreaches any interest of\n                        the mortgagor: see section 2(1)(iii) of the LPA. I shall refer to it as\n                        the statutory power of sale. It becomes exercisable only when the mortgage\n                        money has become due, subject (like everything else in section 101) to any\n                        contrary intention in the mortgage deed: see section 101(4).[emphasis added]59     In this connection, it is pertinent to\n                    highlight that there was no express mention of overreaching in the very first\n                    enactment of the mortgagee’s statutory power of sale in Lord\n                    Cranworth’s Act 1860, of which the 15th section reads as follows:The Person exercising the Power of Sale hereby conferred shall have Power\n                        by Deed to convey or assign to and vest in the Purchaser the Property sold,\n                        for all the Estate and Interest therein, which the Person who created the\n                        Charge had Power to dispose of, except that in the Case of Copyhold\n                        Hereditaments the beneficial Interest only shall be conveyed to and vested\n                        in the Purchaser by such Deed.Subsequently, the overreaching provision first made its appearance in\n                    s 21(1) of the 1881 Act:21.—(1) A mortgagee exercising the power of sale conferred by this\n                        Act shall have power, by deed, to convey the property sold, for such estate\n                        and interest therein as is the subject of the mortgage,freed from all estates, interests, and rights to which the mortgage has\n                            priority, but subject to all estates, interests, and rights\n                        which have priority to the mortgage; except that, in the case of copyhold or\n                        customary land, the legal right to admittance shall not pass by a deed under\n                        this section, unless the deed is sufficient otherwise by law, or is\n                        sufficient by custom, in that behalf.[emphasis added]This overreaching provision was subsequently preserved in\n                    s 104(1) of the Law of Property 1925 Act (15 Geo 5 c 20) (which isin pari\n                        materiawith s 26(1) of the CLPA: seeWin\n                        Supremeat [21]). This therefore raised the interesting\n                    question whether overreaching was created through the 1881 Act.60     Charles Harpum wrote in his seminal article,\n                    “Overreaching, Trustees’ Powers and the Reform of the 1925\n                    Legislation” [1990] CLJ 277, that overreaching had a common law\n                    origin. Reasoning from the provisions of the 1925 Act, he concluded that\n                    overreaching is a necessary concomitant of a power of disposition, and that only\n                    a transaction made by a person within the dispositive powers conferred upon him\n                    will overreach equitable interests in the property. However, it is also clear\n                    that Harpum’s analysis was based primarily on an examination ofdispositions of land by trusteesand it was on that\n                    footing that he surmised that overreaching (at least in cases of dispositions of\n                    land by trustees)must have a common law basis(at 277-278):A number of misconceptions exist about overreaching. The first is that\n                        overreaching is something that occurs only in relation to land. It is\n                        undoubtedly true that the expression “overreaching” gained\n                        currency during the 19th century and appears to have been used in connection\n                        with dispositions of land. That association has been firmly cemented by the\n                        provisions of the Law of Property Act 1925, s.2, which set out the\n                        circumstances in which a conveyance of a legal estate in land will overreach\n                        any equitable interest or power affecting the land.But\n                            overreaching must take place in relation to other forms of property. A\n                            trustee who sells trust investments must necessarily hold the proceeds\n                            of sale on the same trusts as the original investment. It\n                        must also follow from this that the basis of overreaching does not lie in\n                        the statutory provisions of section 2 of the Law of Property Act.It must have a common law basis if it applies to personalty,\n                            and there are clear accounts of the effects of overreaching that\n                            pre-date the 1925 property legislation.[emphasis added]Therefore, it is still not entirely clear, even from Harpum’s\n                    article, whether amortgageehas the same power to\n                    effect an overreaching conveyance under general law.61     In an attempt to persuade this court that a\n                    common law mortgageedoeshave the power to effect\n                    an overreaching conveyance, Mr Pillai referred me to John Baalman’s\n                    commentary,The Singapore Torrens System(The\n                    Government of the State of Singapore, 1961) at p 137:Effect of Sale.Although the mortgagee has only a charge on the land, he is\n                        enabled by s. 57 (2) [of the Land Titles Ordinance, 1956] to pass to a\n                        purchaser the mortgagor’s estate.The result is\n                            much the same as that of a sale by a common law mortgagee. It\n                            extinguishes all subsequent encumbrances to which the land may have been\n                            subject. At common law—“The effect of a sale under the power is to destroy the equity\n                            to redeem, and this means that the rights of the mortgagor and all\n                            subsequent encumbrances are defeated, and their only remedy is against\n                            the purchase money in the hands of the vendor according to their\n                            priorities.”South Eastern Railway Co. v. Jortin(1857)\n                        6 H.L.C. 425; cited byHerring,\n                        C.J., inReg. v. Registrar of Titles, E.P.\n                            Watson[1952] V.L.R. 470, 476.It\n                            will be seen that the effects under common law and under this Ordinance\n                            are virtually equal...[emphasis added]It can be observed from the above passage that Baalman had cited two\n                    authorities for the proposition that overreaching applied at common law:Directors of South Eastern Railway Company v\n                        Jortin(1857) 6 HL Cas 425; 10 ER 1360\n                        (“Jortin’s Case”) and the\n                    Supreme Court of Victoria decision inR v Registrar of Title;\n                        Ex parte Watson[1952] VLR 470 (“Watson’s Case”), both of which were also\n                    relied upon by Mr Pillai in the present case. However, as Herring LJ inWatson’s Casealso citedJortin’s Casefor the same proposition, it is\n                    perhaps useful to begin by examining the judgment inJortin’s Case.62     The issue inJortin’s\n                        Casewas whether the sale by the Exchequer Bill Commissioners\n                    (the “Commissioners”) to the purchasers was valid to give them\n                    good title, free from the respondent’s mortgage. The House of Lords held\n                    that the sale validly overreached the respondent’s mortgage and the\n                    respondent could only look to the Commissioners if there was a surplus from the\n                    proceeds of sale. However, it can also be seen from the judgment of Lord\n                    Cranworth LC that the court had come to that conclusion by direct reference to\n                    the statutory provisions of the Advances for Public Works Act 1842 (5 and 6\n                    Vict, c 9). The relevant provisions, which provided the overreaching\n                    effect, can be found in the judgment at 1363–1364:The 5 and 6 Vict. c. 9, gave (sect. 19) power to the Commissioners, on\n                        sale of any property under the previous statutes, to retain, after payment\n                        of costs, etc., “all the principal monies for the time being\n                        remaining due or owing, or secured by virtue of such mortgage, etc.,\n                        notwithstanding the whole of such principal money, or any instalments\n                        thereof, may not, according to the terms of such mortgage, have become\n                        actually due and payable, together with all interest (if any) for the time\n                        being accrued due,” etc.The 20th section enacted,\n                            that when the Commissioners have sold, etc. “the same public\n                            works, interest, property or effects shall, in respect to, and to the\n                            extent of, the interest or estate so sold or otherwise disposed of, be\n                            held freed and discharged from all claim and demand of the persons,\n                            parties, bodies politic, corporate or collegiate, or companies, by whom\n                            the same were conveyed to the said Commissioners or to their secretary,\n                            and of all persons or bodies claiming under them, and in all\n                        respects as if such persons, etc. making such conveyance or transfer, and\n                        all persons, etc. claiming under them, were in all respects, to such extent\n                        as aforesaid, foreclosed from all equity or right of redemption of or in\n                        respect of the premises so sold or disposed of; provided that nothing herein\n                        contained shall be taken to prejudice the rights, etc. of any persons in\n                        respect of any surplus which may be produced, in consequence of” the\n                        Commissioners entering into possession of or selling the mortgaged\n                        property.[emphasis added]Lord Cranworth LC did pause, however, to add inobiterthat the position in general law appeared to be no\n                    different, because the Commissioners were, in any event, also boundby equityto hold any surplus on trust for those who\n                    were entitled to it (at 1365–1366):[T]he other mortgagees will still have all which they\n                            contracted for; that is, a right to be paid their interest before\n                            anything is paid to the commissioners in discharge of their principal.\n                            This right, however, is one which they can enforce only against the\n                            Commissioners who have in their hands the proceeds of the\n                            sale.I incline to think that this would have been so if\n                            there had been no express enactment upon the subject. But all\n                        doubt is removed, if any existed, by the 20th section of the 5 Vict. sess.\n                        2, c. 9, which enacts, that whenever the Commissioners sell under their\n                        powers, the purchaser shall hold free from all claim on the part of the\n                        bodies corporate under whom the Commissioners derived their title, and of\n                        all persons claiming under such bodies corporate, as if they had been\n                        foreclosed; that is, the Commissioners are to be treated by purchasers as\n                        absolute owners, so far as regarded the interests of those whose rights were\n                        subsequent to the right in respect of which the sale was made, for those are\n                        the persons to whom alone foreclosure could apply....It is hardly necessary to add, that this decision in no way affects the\n                        rights of the Respondent on the money produced by the sale. The\n                        Commissioners, unless there have been some special circumstances affecting\n                        the case,are bound, not only on general principles of\n                            equity, but also by the express provision of the clause in the last Act\n                            to which I have referred, to pay over and distribute any surplus money\n                            in their hands, after satisfying their arrears of interest,\n                        to and among the persons justly entitled to it. With that question, however,\n                        the present Appellants have no concern. They are purchasers under a power of\n                        sale, the exercise of which gave them a good title against the harbour\n                        trustees, and all deriving title under them.[emphasis added]63     Indeed, the position in general law relating\n                    to any surplus of the proceeds of sale supports the Lord Chancellor’s\n                    view. In the decision ofBanner v Berridge(1880-81) LR 18 Ch D 254, Kay J held that a first\n                    mortgagee, after exercising his power of sale, holds any surplus as a\n                    constructive trustee for the second mortgagee (although, on the facts, the\n                    plaintiff there was time-barred from claiming a constructive trust) (at 260,\n                    269–270). Similarly, inWest London Commercial Bank v\n                        Reliance Permanent Building Society(1885) LR 29 Ch D 954, the English Court of Appeal held\n                    that the first mortgagee, who had notice of the second mortgage, was liable, at\n                    general law, to make good to the second mortgagee the surplus that had already\n                    been paid to the mortgagor (at 962):It is conceded that if he exercises his power of sale\n                            as mortgagee, whether under the terms of the mortgage deed or by\n                            statute, he is answerable for the money he receives if he pays it to the\n                            wrong person, that is to say, if he passes over the second mortgagee and\n                            pays it to the mortgagor who has no right to receive it.\n                        Ought we, then, to make any distinction between such a case and the present?\n                        Here the first mortgagees, though they did not concur with the mortgagor in\n                        putting up the property for sale, did concur with him in the conveyance.\n                        Having done so with the knowledge that part of the purchase-money was going\n                        to be applied in violation of a right of which they had had notice, they\n                        are, in my opinion, just as liable as if they had received the whole of the\n                        money. Not being able to give a good receipt for the whole of the money,\n                        they must be held liable for that portion of it for which they could not\n                        give a good receipt, for it was in their power to refuse to concur in the\n                        sale unless the whole of the purchase-money was properly applied.[emphasis added]64     Accordingly, if the law imposes a duty on a\n                    mortgagee, who has realised his security by way of sale, to hold any surplus of\n                    the proceeds on constructive trust for a subsequent mortgagee, it would follow,\n                    in my judgment, that overreaching is simplya necessary\n                        incident of this dutyunder general law.65     InWatson’s\n                        Case, the issue that arose for determination was whether the\n                    common law rule inOtter v Lord Vaux(1856)\n                    6 De GM & G 638; 43 ER 1381 also applied to a statutory\n                    sale by a mortgagee under the Transfer of Land Act 1928 (No 3791) (Vic)\n                    (“Transfer of Land Act”). The rule inOtter v\n                        Lord Vauxwas that a mortgagor could not by purchasing from a\n                    mortgagee exercising a power of sale defeat a subsequent mortgagee’s\n                    interest in the property. This entailed a discussion of the power of sale\n                    conferred upon mortgagees by the Transfer of Land Act, in which Herring CJ\n                    touched on the effect of a mortgagee exercising his power of sale at general law\n                    (at 476):The effect of a sale under the power is to destroy the equity to redeem,\n                        and this means thatthe rights of the mortgagor and all\n                            subsequent encumbrancers are thereupon defeated, and their only remedy\n                            is against the purchase moneys in the hands of the vendor according to\n                            their priority—South Eastern Railway\n                            Coy. v. Jortin(1857), 6 H.L.C. 425, at\n                        p. 435. The destruction of the equity to redeem takes place as soon as\n                        there is a binding contract of sale.[emphasis added]However, as theratio decidendiofWatson’s Casewas that the rule inOtter v Lord Vauxapplied to statutory sales\n                    under the Transfer of Land Act, Herring CJ’s comment on overreaching\n                    does not really add much toJortin’s Case,\n                    although it does lend credence, in my view, to what appears from the cases, to\n                    be the prevailing judicial view that overreaching also applies in general\n                    law.66     That prevailing view recently became\n                    established when the precise issue whether overreaching applies independent of\n                    statute arose for determination in the decision of the Supreme Court of\n                    Queensland inSt George Bank Limited v Perpetual Nominees\n                        Limited[2010] QSC 57 (“St\n                        George Bank”). In that case, the plaintiff of the same\n                    name loaned money (for the purchase and refurbishment of the Sheraton Mirage\n                    Hotel Gold Coast) through a facility secured by first registered mortgages and a\n                    first registered fixed and floating charge. Perpetual Securities\n                    (“Perpetual”) and LJK Securities (“LJK”) held second\n                    and third ranking mortgages and fixed floating charges respectively. Following\n                    the default of the borrower, St George contracted to sell the land as well as\n                    the assets and undertaking of the hotel (“SP Hotel”), assuring the\n                    purchaser, Pearls Australasia Mirage 1 Pty Ltd, (“Pearls”) that\n                    the subsequent charges would be released. However, after St George exercised its\n                    power of sale, Perpetual and LJK refused to release their charges. The question\n                    that arose for determination can be found at [16] of Wilson J’s\n                    judgment:The respective priorities of St George, Perpetual and LJK are not in\n                        issue. The question for determination is whether, upon St George’s\n                        power of sale being exercisable under its mortgages and charges, and upon\n                        completion of the contracts, Pearls will take the property and undertaking\n                        of SP Hotel free of any of the interest of Perpetual and LJK under their\n                        respective securities.67     As for the mortgages held overland, there was no dispute because it was clear, under\n                    s 79 of the Land Title Act 1994 (Qld) (for registered land), s 83 of\n                    the Property Law Act 1974 (Qld) (for unregistered land), and s 350 of the\n                    Land Act 1994 (Qld) (for Land Act land), that lower ranking mortgages will be\n                    overreached when a mortgagee exercised its power of sale. This position is\n                    identical to that of England and Singapore. However, unlike Singapore and\n                    England (where the CLPA and the 1925 Act apply tobothreal and personal property), there is no statutory\n                    provision governing the sale ofpersonalproperty\n                    by a mortgagee in the state of Queensland. Thus, in relation to the assets and\n                    undertaking of SP Hotel, it was necessary for the court “to consider the\n                    position [of overreaching] under the general law, apart from statute”\n                        (St George Bankat [34]).68     Due to the absence of any clear authority,\n                    Wilson J began her analysis by tracing the mortgagee’s power of sale\n                    back to Lord Cranworth’s Act 1860 and examined the decision ofJortin’s Case. Relying on a statement by\n                    Lord Cranworth LC, Wilson J took the position that overreaching\n                    also applied to mortgages in general law, independent of any statute.\n                    Wilson J did so by first characterising the Lord Chancellor’s\n                    statement as a “general observation”, and she then reasoned that\n                    this “general observation” was entirely consistent with a\n                    mortgagee’s duty in general law to hold surplus proceeds on trust for\n                    subsequent mortgagees (at [47]–[49]):47    While the decision\n                            inJortin’s Caseturned on the\n                            priority agreement and the application of particular statutes,it is significant that the Lord Chancellor made this\n                                general observation in the introductory part of his\n                                speech:“Now when a mortgage[e] sells under a power, that sale defeats\n                            the rights of all subsequent incumbrancers, whose remedy then is only\n                            against the money in the hands of the vendors...”48What his Lordship said was\n                                consistent with a mortgagee who exercises its power of sale holding\n                                the surplus proceeds on trust for subsequent mortgagees according to\n                                their priorities, and ultimately for the mortgagor.\n                            Disputes about priorities and the amounts owing to those with an\n                            interest in the proceeds could be determined by equity, by way of orders\n                            for accounts and inquires.49In this way the subsequent\n                                mortgagee’s interest in the property was\n                                “over-reached”: the exercise of the power of sale\n                                defeated the subsequent mortgagees’ interest in the property,\n                                at the same time giving them a beneficial interest in the surplus\n                                proceeds of sale.[emphasis added]Having decided that overreaching applied to mortgages in general law,\n                    Wilson J went on to hold that, in principle, the same should apply tocharges(at [50]):50    In principle, the sequelae of the exercise of power\n                            of sale by an equitable chargee are no different from those of the\n                            exercise of power of sale by equitable mortgagee. So long as the charge\n                            gives the chargee the necessary powers or conveyancing mechanisms, the\n                            chargee may convey the legal interest in the charged property, free of\n                            the interests of subsequent chargees in that property. Upon its doing so\n                            the subsequent chargees (an take) [sic] interest in the surplus proceeds\n                            of sale (if any).69     Although it appeared, in my view, that there\n                    is some ambiguity as to whether the Lord Chancellor’s statement (Jortin’s Caseat 1366) can be taken to be a\n                    “general observation”, I would nonetheless agree with Wilson\n                    J’s finding (having arrived at the same conclusion at[64]above) that the concept of overreaching is\n                    entirely consistent with the duty of a mortgagee exercising his power of sale to\n                    hold the surplus proceeds on trust for a subsequent mortgagee. Overreaching is\n                    therefore a consequence of the exercise of the power of sale by the mortgagee\n                    which destroys the equity of redemption and thereby defeats the claims of the\n                    mortgagor and the subsequent mortgagees. Their remedy lies against the surplus\n                    proceeds arising from such a sale.70     The recent decision inSt\n                        George Bankwas derived from my own research. As it appeared to me to\n                    be a case on point, I invited written submissions from both parties, after the\n                    close of submissions, to address me on its relevance to the dispute before me.\n                    Mr Tan sought to distinguishSt Georgeon the\n                    basis that the statutory regime in the state of Queensland was different from\n                    that in Singapore, principally on two grounds: first, the CLPA applied to both\n                    real and personal property whereas the Queensland Property Law Act 1974 (Qld)\n                    only applied to real property; and second, the notice provisions in these two\n                    statutes were worded differently. These differences, however, were immaterial\n                    because Wilson J’s holding inSt Georgewas that overreaching was not a creature of\n                    statute and applied to personal property at general law, which directly answers\n                    the issue raised before me. Accordingly, I find that the defendant’s sale\n                    of the Shares to the plaintiff had overreached UOB’s charge such that the\n                    plaintiff took the Shares free from the UOB charge.Additional observations71     During the course of the trial, it was the\n                    defendant’s evidence that, subsequent to granting the Charge, Guo had also\n                    granted two other charges, on 12 and 20 December 2007\n                    respectively, in favour of several investors including the defendant, under the\n                    Second and Third Investment Agreements. Although this strictly has no immediate\n                    bearing on the issues that are before me, it may affect UOB’s priority of\n                    entitlement to the surplus of the proceeds because those two charges appear to\n                    rank ahead in time of UOB’s charge. However, no documentary evidence of\n                    these other charges was adduced before me, and even if there were such charges,\n                    this is strictly an issue between those chargees and UOB. I therefore make no\n                    finding on this matter.72     There was also a separate question as to the\n                    exact amount that was secured by the Charge. Mr Pillai had informed me that\n                    the calculation of Guo’s indebtedness to the defendant under the First\n                    Investment Agreement was a complicated exercise and was unable to provide me\n                    with the exact sum that was due to the defendant. However, as this is strictly a\n                    matter between the defendant and subsequent chargees, including UOB, I need not\n                    make a finding on the defendant’s exact entitlement to the proceeds\n                    arising out of the S&P Agreement. It would suffice for me to say that the\n                    defendant is under a duty to account for any surplus to the subsequent\n                    mortgagees/chargees after Guo’s debts to the defendant that are secured by\n                    the Charge have been fully discharged.Conclusion73     It bears mentioning that it was the plaintiff\n                    who had approached the defendant to purchase the Shares mortgaged by Guo. The\n                    plaintiff clearly wanted to take over control of the Company. This was\n                    consistent with both her own investments in the Company and the loans which she\n                    had extended to the Company. However, shortly after the S&P Agreement was\n                    entered into, she realised that the Company was not such an attractive\n                    investment opportunity after all. Thereafter, she became determined to find all\n                    possible avenues to extricate herself from the S&P Agreement. Unfortunately\n                    for the plaintiff, the fact that the Company was no longer a viable investment\n                    does not provide a legitimate excuse not to perform her clear and binding\n                    obligation to complete the sale and purchase of the Shares under the S&P\n                    Agreement.74     By reason of the above findings, I make the\n                    following orders:(a)The plaintiff’s claim is hereby dismissed\n                            with costs.(b)As regards the defendant’s\n                            counterclaim:(i)I declare that the S&P Agreement is\n                                    subsisting and binding upon the plaintiff;(ii)The plaintiff is to pay the sum of\n                                    $2,884,000 to the defendant against the transfer of the Shares;\n                                    and(iii)Interest at 5.33% per annum on the sum\n                                    of $2,884,000 from 14 August 2009 (the date the\n                                    counterclaim was filed) to the date of judgment.(c)As the plaintiff’s claim and the\n                            defendant’s counterclaim are related and have common issues, I\n                            will only allow one set of costs to be paid by the plaintiff to the\n                            defendant to be taxed on a standard basis if not agreed.",
        "The S&P Agreement": "15     The plaintiff, like the defendant, also became\n                    a shareholder of the Company due to its listing potential. She had started\n                    investing in the Company in May 2007 when she purchased shares of the\n                    Company from Guo. However, unlike the defendant, the plaintiff took an active\n                    part in the business and affairs of the Company. In fact, the plaintiff, at the\n                    request of the directors of the Company, supported the Company through various\n                    loans, which were extended personally and through companies that she controlled,\n                    because she held the view that the Company was a good long term\n                    investment. 16     By March 2009, the plaintiff felt that the\n                    management of the Company was becoming too unwieldy given the number of\n                    shareholders involved. At a shareholders’ meeting on 10 March 2009, the\n                    plaintiff offered to purchase all the shares owned by the otherlocalshareholders at $1.80 per share. Just a day ago,\n                    the plaintiff had separately approached the defendant to purchase the\n                    defendant’s shares in the Company, including the 3,218,458 shares which\n                    the defendant was seeking to register in his name by way of OS 228 (see[12]above). 17     Four days later, on 13 March 2009, the\n                    defendant accepted the plaintiff’s offer to buy the shares and entered\n                    into the S&P Agreement to sell the 3,218,458 shares charged by Guo, to\n                    the plaintiff for a total consideration of $3,384,000. Pursuant to the terms of\n                    the S&P Agreement, the plaintiff duly paid the deposit of $500,000 to\n                    the defendant. For completeness, I should add that the plaintiff was, at all\n                    material times, fully aware of the UOB charge when she entered into the S&P\n                    Agreement. 18     The material terms of the S&P Agreement\n                    are as follows: (B)The Vendor has filed Originating Summons No 228 of\n                            2009/P (hereinafter referred to as the “Originating\n                            Summons”) in the High Court of the Republic of Singapore\n                            (hereinafter referred to as the “High Court”) for orders\n                            to effect the transfer and registration of 3,218,458 ordinary\n                            shares of the Company presently held by Mr. Guo Ze Ming in the name of\n                            the Vendor (hereinafter referred to as “Future Sale\n                            Shares”); and (C)The Purchaser is desirous of purchasing the Future\n                            Sale Shares from the Vendor on the terms and conditions of this\n                            Agreement. IT IS AGREED that: 1.    SALE OF FUTURE SALE\n                            SHARES 1.1    The Vendor agrees to\n                            sell and the Purchaser agrees to purchase, the Future Sale Shares free\n                            from all encumbrances together with all rights, benefits, title and\n                            interests attaching to them. 1.2    The total consideration payable by the Purchaser to the Vendor for the\n                            Future Sale Shares shall be the sum of\n                            S$3,384,000. 1.3    The completion\n                            of the sale and purchase of the Future Sale Shares shall take place no\n                            later than one (1) week after the transfer and registration of the\n                            Future Sale Shares in the name of the Vendor, the exact date to be\n                            agreed by the Vendor and the\n                            Purchaser. 2.    CONDITIONS\n                            PRECEDENT 2.1    Completion of sale\n                            and purchase of the Future Sale Shares shall be conditional uponALLof the following conditions\n                            having been fulfilled or otherwise waived by the Vendor: 2.1.1The Purchaser pays to the Vendor a sum of\n                                S$500,000 at the date of execution of this Agreement; 2.1.2In relation to the Originating Summons which\n                                is fixed for hearing in the High Court on 31 March 2009 (or on\n                                such other adjourned date), the Company does not object (or if\n                                possible, consents) to the Vendor’s said application for the\n                                transfer and registration of the Future Sale Shares in the name of\n                                the Vendor; 2.1.3The Originating Summons for the Future Sale\n                                Shares to be transferred and registered in the name of the Vendor is\n                                granted by the High Court; 2.1.4The Company takes all necessary steps to\n                                facilitate the transfer and registration of the Future Sale Shares\n                                in the name of the Vendor; and 2.1.5Further to any order granted by the High\n                                Court, the Vendor completes the transfer and registration of the\n                                Future Sale Shares in his name. It is immediately apparent from these terms that\n                    the completion of the S&P Agreement specifically contemplated the defendant\n                    obtaining an order in OS 228 for the transfer and registration of the\n                    Shares in his name.",
        "Events leading up to the proceedings": "19     Immediately after the defendant had obtained\n                    the Court Order in OS 228, the plaintiff as director (she was appointed as\n                    director of the Company on 10 March 2009) issued a notice later in the\n                    evening of 21 May 2009 for an extraordinary general meeting\n                    (“EGM”) to pass various resolutions which included,inter alia, a resolution to allot up to 6,000,000 shares\n                    to herself as part payment of her loans to the Company. The resolutions were not\n                    carried at the EGM held on 6 June 2009. 20     In the meantime, the defendant encountered\n                    enormous difficulties with the Company in relation to the issuance of new share\n                    certificates as earlier ordered by Lee J on 21 May 2009.\n                    Eventually on or about 29 June 2009, the defendant filed a further\n                    application in OS 228 for an order for the Registrar of the Supreme Court\n                    to issue the new share certificates instead. The order was duly granted by\n                    Lee J on 30 June 2009. With 3,218,458 of Guo’s shares now\n                    registered in the defendant’s name, the stage was set for completion under\n                    the S&P Agreement (at least so the defendant thought). Therefore, on\n                    6 July 2009, the defendant informed the plaintiff that he was ready,\n                    willing and able to transfer the Shares to her, and proposed for completion to\n                    take place on 8 July 2009. 21     However, there came a further twist to this\n                    saga. ComLaw LLC, who had previously represented the Company in OS 228,\n                    filed a winding up petition against the Company on behalf of Rainbow Offshore\n                    Supplies Pte Ltd (“Rainbow Offshore”) on 24 June 2009. This\n                    petition was filed on the basis that Rainbow Offshore had extended a loan of RMB\n                    12 million to the Company. It is not disputed that Rainbow Offshore was, at all\n                    material times, controlled by the plaintiff. Although the defendant initially\n                    opposed the winding up petition in order to investigate the alleged loan, he\n                    eventually decided against it. Consequently, on 14 August 2009, the Company\n                    was ordered to be wound up. 22     By various letters dated 8 July,\n                    13 July and 20 July 2009, the plaintiff claimed,inter alia, that she was not obliged to complete the\n                    S&P Agreement because the UOB charge amounted to an encumbrance and\n                    that the commencement of the winding up petition against the Company had\n                    frustrated the S&P Agreement. Thereafter, on 20 July 2009, the\n                    plaintiff commenced the present action against the defendant to recover the\n                    $500,000 deposit paid under the S&P Agreement. In response, the\n                    defendant counterclaimed against the plaintiff for specific performance of the\n                    S&P Agreement and for payment of the balance sum of $2,884,000\n                    ($3,384,000 less $500,000) due under the S&P Agreement, or for damages\n                    arising out of the plaintiff’s breach to be assessed.",
        "The issues before this court": "23     When the trial commenced before me, the\n                    plaintiff raised the following issues as arising from the pleadings for\n                    determination: (a)     Whether the S&P Agreement was\n                        entered into pursuant to the power of sale under the Charge, and whether the\n                        defendant could convey the legal title of the Shares to the plaintiff\n                        pursuant to that power of sale (collectively “the Power of Sale\n                        Issues”). (b)     Whether the defendant’s sale of the Shares to the plaintiff\n                        overreached the UOB Charge such that the plaintiff took the Shares free from\n                        the UOB Charge (“the Overreaching Issue”). (c)     Whether the defendant was in breach of\n                        an implied term of the S&P Agreement not to take steps to diminish or\n                        destroy the value of the Shares. (d)     Whether the S&P Agreement was frustrated by the\n                        winding up of the Company (“the Frustration\n                    Issue”). (e)     Whether the Court Order was procured by fraud on the part of the defendant\n                        (“the Fraud Issue”). (f)     Whether the Company’s objection to the\n                        defendant’s application in OS 228 for the transfer and\n                        registration of the Shares constituted a non-fulfilment of a condition\n                        precedent of the S&P Agreement. 24     After the close of the defendant’s case\n                    and in light of the evidence adduced at the trial, counsel for the plaintiff,\n                    Mr Alvin Tan (“Mr Tan”), quite sensibly, decided not to\n                    pursue issues (c) and (f) above.",
        "The nature of the defendant’s security interest in the\n                Shares": "25     Before I address the remaining live issues, it\n                    would be useful for me to clarify the nature of the defendant’s security\n                    interest in the Shares, which had been labelled “Security Charge”.\n                    The immediate question for consideration was whether the security interest was a\n                    charge or an equitable mortgage. 26     On this point, it was recently observed by\n                    Judith Prakash J inPower Knight Pte Ltd v Natural Fuel\n                        Pte Ltd (in compulsory liquidation)[2010] 3 SLR 82 (at [23]–[24]), after citingGoode on Legal Problems of Credit and Security(Louise Gullifer\n                    ed) (Sweet & Maxwell, 4th Ed, 2008), that the difference between an\n                    equitable mortgage and charge may depend on the availability of self-help\n                    remedies: 23    One of the distinctions between a charge and an\n                            equitable mortgage is that the chargee is not entitled to avail himself\n                            of the self-help remedies of sale, possession or appointment of a\n                            receiver (though he may apply to the court for one of these remedies):Goode, para 1-51 (n 184),Fisher and Lightwood's Law of Mortgage(Wayne Clark ed) (LexisNexis Butterworths, 12th Ed, 2006)\n                                [“Fisher and\n                            Lightwood”], paras 6.1 and 6.3. 24    Given that the parties intended that Power Knight\n                            should have all the remedies available to a mortgagee, I am inclined to\n                            regard Power Knight's security interest as an equitable\n                        mortgage. Notwithstanding Prakash J’s observation, self-help\n                    remedies such as the power of sale and the power to appoint a receiver are now\n                    also commonly provided for in charge instruments. As such, as aptly observed inFisher and Lightwoodat para 6.3 andCousins on the Law of Mortgages(Edward\n                    Cousins ed) (Sweet & Maxwell, 2001) (“Cousins”) at para 1-13, the remaining distinction\n                    between a mortgage and a charge appears to be, in principle, that a mortgagee\n                    has the right to foreclosure and to go into possession whereas a chargee does\n                    not. 27     However, despite the label, both parties were\n                    content to proceed on the basis that the defendant’s security interest in\n                    the Shares was that of anequitable mortgage. For\n                    good measure, counsel for the defendant, Mr Pradeep Pillai\n                    (“Mr Pillai”), cited two authorities for the proposition that\n                    the deposit of share certificates accompanied by blank transfer forms does give\n                    rise to an equitable mortgage over the relevant shares. Both these authorities,\n                    although dating back some time, still remain good law. The first decision wasHarrold v Plenty[1901] 2 Ch 314 in which Cozens-Hardy J stated\n                    at 316: The only material allegation in the statement of claim is that in March,\n                        1897, the defendant deposited with Harrold the certificate of ten ordinary\n                        shares in a limited company as security for the repayment to Harrold of the\n                        sum of 150l., then owing to him from the defendant, with interest thereon at\n                        the rate of 6l. per cent. per annum.Now, it is plain\n                            that a pledgee is in a very different position from an ordinary\n                            mortgagee. He has only a special property in the thing pledged. He may\n                            obtain a sale, but he cannot obtain a foreclosure. I do not think that\n                            this is properly a case of pledge. A share is a chose in\n                        action. The certificate is merely evidence of title, and whatever may be the\n                        result of the deposit of a bearer bond, such as that which Sir George Jessel\n                        dealt with inCarter v. Wake, I think I cannot\n                        treat the plaintiff as a mere pledgee.The deposit of the\n                            certificate by way of security for the debt, which is admitted, seems to\n                            me to amount to an equitable mortgage, or, in other words, to an\n                            agreement to execute a transfer of the shares by way of\n                            mortgage. The result is that the plaintiff is entitled to a\n                        judgment substantially in the form which would be given if, instead of the\n                        certificate of shares, the document had been a title-deed of real estate or\n                        a policy of assurance. [emphasis added] Similarly, inStubbs v Slater[1910]\n                    1 Ch 632 the court came to the same conclusion that a transaction\n                    under which shares were handed over with a share transfer form executed in blank\n                    to secure a debt was a mortgage that gave the mortgagee the right of foreclosure\n                    (at 638–639): If one asks how they were entitled to sell it is necessary to go back a\n                        step.The plaintiff handed over to the brokers one\n                            certificate for the 390 shares together with a transfer executed by the\n                            plaintiff in blank, in which the numbers of the shares were specified,\n                            but the name of the purchaser and the consideration were, of course, not\n                            specified. It was the ordinary well-known transfer in blank.\n                        Now what is the effect of that? I am astonished that there should be any\n                        doubt about it. So long ago as 1899 Stirling J. inLondon and Midland Bank v Mitchelldealt with a case of\n                        precisely this nature and indicated what was the legal effect of it. That\n                        was a case in which certain shares together with a blank transfer had been\n                        deposited with a bank to secure a debt, and it was held that the bank had\n                        not lost their right against the shares although their simple contract\n                        remedy against the client was lost by reason of the Statute of Limitations.The Court there pointed out that the whole\n                            transaction was a mortgage as to which the bank were entitled to the\n                            ordinary remedy of foreclosure. [emphasis added] 28     As already mentioned at[9]above, clause 3.3 of the S&P Agreement\n                    required Guo to deposit the share certificates and blank transfer forms with the\n                    escrow agent. In my view, Guo’s omission to deposit the share certificates\n                    and blank transfer forms did not alter the agreement between the parties or the\n                    nature of the defendant’s security interest in the Shares. In this regard,\n                    the plaintiff has not suggested otherwise. Accordingly, I find that the security\n                    interest created by the Charge in favour of the defendant was that of an\n                    equitable mortgage.",
        "The Frustration Issue": "",
        "The relevance of section 259 of the Companies Act": "29     In the present case, although the S&P\n                    Agreement was entered into prior to the commencement of the winding up of the\n                    Company, the completion of the sale was scheduled to take placeafterthe commencement of the winding up. Cursorily, the\n                    sale of the Shares may therefore appear to be rendered void by s 259 of the\n                    Companies Act (Cap 50, 2006 Rev Ed) (“Companies Act”),\n                    which reads as follows: Avoidance of dispositions of property,\n                        etc. 259. Any disposition of the property of the\n                        company, including things in action, and any transfer of shares or\n                        alteration in the status of the members of the company made after the\n                        commencement of the winding up by the Court shall unless the Court otherwise\n                        orders be void. 30     Mr Pillai, however, drew my attention to\n                    the decision of the Supreme Court of Victoria inJordanlane\n                        Pty Ltd v Kimberley Jane Elizabeth Kitching Andrew[2008]\n                    VSC 426 wherein the rationale for s 468 of the Corporations Act 2001\n                    (Cth) (“Corporations Act”) (the Australian equivalent of\n                    s 259 of the Companies Act) was lucidly explained. The primary purpose\n                    behind s 468 of the Corporations Act is to prevent a shareholder from\n                    evading liability as a contributory by transferring shares to some impecunious\n                    person after the commencement of winding up. The Court went on to observe that\n                    such a purpose can be sufficiently served by avoiding the transfer of the shares\n                    only as far asthe companyis concerned.\n                    Accordingly, a purchaser of the shares, such as the plaintiff, cannot avoid\n                    completion in respect of agreements which were entered into prior to the\n                    commencement of winding up, even if the company should subsequently be wound\n                    up. 31     Mr Tan quite rightly did not seek to rely\n                    on s 259 of the Companies Act to avoid completion of the S&P\n                    Agreement.",
        "Winding up of the Company": "32     The plaintiff submitted that the S&P\n                    Agreement was frustrated by the winding up of the Company on 14 August\n                    2009, since the subject matter of the S&P Agreement,iethe Shares, were no longer in existence as a result of the\n                    winding up order. No authority was cited in support by Mr Tan other than\n                    his reliance on s 7 of the Sale of Goods Act (Cap 393, 1999 Rev\n                    Ed) (“the Sale of Goods Act”) which provides as follows: Goods perishing before sale but after agreement\n                            to sell 7. Where there is an agreement to sell\n                        specific goods and subsequently the goods, without any fault on the\n                        part of the seller or buyer, perish before the risk passes to the\n                        buyer, the agreement is avoided. 33     However, notwithstanding his reliance on\n                    s 7 of the Sale of Goods Act, and purportedlyby way of\n                        analogyat that, Mr Tan was unable to identify any authority\n                    that “shares” fell within the rubric of “goods”\n                    under the Sale of Goods Act. The short answer to the plaintiff’s\n                    submission is that the Sale of Goods Act does not apply to shares. This much is\n                    clear from the definition of “goods” itself in s 61(1) of the\n                    Sale of Goods Act: “goods” includes all personal chattels other than\n                        things in action and money; and in particular “goods”\n                        includes emblements, industrial growing crops, and things attached to or\n                        forming part of the land which are agreed to be severed before sale or under\n                        the contract of sale and includes an undivided share in goods It is thus apparent on the face of s 7 that the definition of\n                    “goods” under the Sale of Goods Act specifically excludes choses\n                    in action, and there is ample authority to show that shares are merely choses in\n                    action and are therefore, by definition, excluded from the Sale of Goods\n                    Act. 34     Further, the definition of goods under\n                    s 61(1) of the Sale of Goods Act is practically identical to the definition\n                    of goods under s 61(1) of the English Sale of Goods Act 1979 (c 54)\n                    (“the UK Act”).Benjamin’s Sale of\n                        Goods(AG Guest et al ed) (Sweet & Maxwell, 7th Ed, 2006)\n                    states thus at para 1-080: [T]he statutory exclusion of things (or choses) in action means that\n                        shares and other securities, debts, bills of exchange and other negotiable\n                        instruments… and other incorporeal property are not capable of being\n                        ‘goods’ for the purposes of the Act. To put the issue beyond any doubt, English case law is clear that the\n                    UK Act does not apply to shares because they are things (or choses) in action,\n                    and this can easily be ascertained from the following two decisions, of which\n                    the first is the House of Lords decision ofCommissioners of\n                        Inland Revenue v Crossman[1937] AC 26, in which Lord\n                    Roche explained at 72: By a sale I mean and understand a transaction which passes the property in\n                        the thing sold. It must always be borne in mind that the Finance Act of 1894\n                        is dealing with all descriptions of property and not expressly with shares,\n                        and I regard the word \"sold\" in s. 7, sub-s. 5, of this Act as having the\n                        same meaning as the word \"sale\" in the Sale of Goods Act, 1893: see s.\n                        1, subs.3, of that Act. Shares with many other kinds of property are,\n                        of course, not within the ambit of the Sale of Goods Act; but I am of\n                        opinion that for the purposes of the Finance Act, 1894, for shares to be\n                        sold the property in them, by which I mean the legal property, must\n                        pass. The other decision isBritish & Commonwealth\n                        Holdings Plc v Quadrex Holdings Inc[1995] CLC 1169 by\n                    the English Court of Appeal (at 1226): I have no doubt that the method proposed by Samuel Montagu is appropriate\n                        in the case of a commodity for which there is an available market. It is\n                        akin to the rule in s. 50(3) and s. 51(3) of the Sale of Goods Act 1979;\n                        although the Act does not apply to a chose in action such as shares in a\n                        company, it merely reflects the common law. Mr Tan did not attempt to make any submission as to why the\n                    position in Singapore should be any different from that in\n                England. 35     Mr Pillai, on the other hand, helpfully\n                    referred me to a series of Australian and New Zealand authorities which have\n                    consistently held that the insolvency of a company does not frustrate agreements\n                    for the sale and purchase of shares in the company. The frustration defence was\n                    raised and rejected inEzishop.Net Ltd (in Liq) v Veremu Pty\n                        Ltd[2003] NSWSC 156; 45 ACSR 199 where the\n                    Supreme Court of New South Wales held (at [66]) that: In exercising the judgment the court is required to make as to whether\n                        insolvency and liquidation has brought about the frustration of the\n                        agreement there are a number of matters to be taken into account. First, on\n                        the evidence as to the circumstances in which the agreement was made, I am\n                        satisfied that the prospect of loss of their investment by reason of\n                        insolvency and liquidation was within the contemplation of the defendants\n                        when the agreement was made. Second, I am satisfied that the obligations of\n                        the parties to the agreement are not affected by the event complained of,\n                        nor has it been shown that the event in any relevant way has altered the\n                        situation of the parties, radically or otherwise. Third,it is plain that the event complained of does not result in the\n                            impossibility of performance of the agreement in that the shares (and\n                            the rights and entitlements attaching to them) have been neither\n                            destroyed nor changed. It is not enough to demonstrate that the event\n                            may have had a detrimental effect upon the value of the\n                            shares. According to Lord Radcliffe, it is not hardship or\n                        inconvenience or material loss itself which calls the principles of\n                        frustration into play. [emphasis added] 36     Similarly the same defence was also raised and\n                    rejected by the High Court of New Zealand inKoutsojiannis v\n                        Brown[1981–1983] 1 NZCLC 98,081. I only need\n                    quote from the headnote: The doctrine of frustration does not apply to a contract for the purchase\n                        of shares which is unable to be performed because of the company being wound\n                        up. There was in this case no intervening event or change of circumstances\n                        which were so fundamental as to strike at the root of the agreement for the\n                        sale of the shares. The matter must be considered in the light of the\n                        circumstances pertaining at the time when the contract was entered into. The\n                        failure of the company was simply an ordinary business risk which anyone\n                        buying shares in a company must take as regards the future of the company\n                        concerned. 37     Mr Tan, when confronted with the force\n                    and weight of the above authorities, conceded that he was unable to distinguish\n                    them from the present case. Accordingly, the legal position is abundantly clear\n                    that the winding up of the Company did not frustrate the S&P Agreement.\n                    There is therefore no need for me to even consider the defendant’s\n                    alternative argument that the frustration, if established, was in any event\n                    self-induced.",
        "The Fraud Issue": "38     On or about 22 June 2010, just prior to\n                    the commencement of the trial, the plaintiff amended the Statement of Claim to\n                    rely on an additional ground of fraud to prevent the defendant from enforcing\n                    the S&P Agreement. 39     As can be seen from the terms of the S&P\n                    Agreement at[18]above, it was a condition\n                    precedent for the defendant to procure an order of court for the Shares to be\n                    transferred and registered in the name of the defendant. This was accomplished\n                    by the defendant by way of the Court Order in OS 228. However, the\n                    plaintiff alleged that the defendant was not entitled to rely on the Court Order\n                    because it was procured by way of fraud. It is perhaps relevant to highlight the\n                    fact that there was no appeal against the Court Order and no step has been taken\n                    to set it aside. As such, it is questionable whether the plaintiff ought to be\n                    allowed to even raise this point at this juncture. Nonetheless, I shall consider\n                    the merits or lack thereof of the plaintiff’sfraudargument. 40     According to Mr Tan, the defendant had,\n                    in OS 228, “actively misrepresented” to the court that there\n                    was no sale of the Shares when he had in fact entered into the S&P Agreement\n                    with the plaintiff. To establish this, Mr Tan relied on two statements made\n                    by the defendant in OS 228. The first of the two statements can be found in\n                    the defendant’s affidavit filed on 12 May 2009, in which he referred\n                    to UOB’s claim as being “premature”: 10.1.3    At the same paragraph, UOB asserts that the\n                            [Creditors] owe a duty to UOB to ensure that there is a proper valuation\n                            of the Subject Shares at the time those shares are disposed of in light\n                            of UOB’s second charge over the Charged Shares. 10.1.4    Quite apart from the fact that UOB’s\n                            aforesaid argument is premature, the [Creditors’] principal\n                            position is that there is no duty owed to the UOB as UOB do not hold an\n                            equitable charge over the same shares. The other statement can be found in the defendant’s written\n                    submissions, where he had stated that the application in OS 228 was not to\n                    sanction any sale of the Shares, but was simply to have the Shares registered in\n                    his name. Mr Tan attempted to persuade this court that these two statements\n                    were “active misrepresentations” amounting to fraud. I simply\n                    could not agree with this submission. 41     Taking the plaintiff’s case at its\n                    highest, all that the plaintiff can say is that the defendantdid not discloseto the court that the defendant had entered\n                    into the S&P Agreement to sell the Shares to the plaintiff after OS 228\n                    was filed. For such an omission to amount to fraud, in my view, Mr Tan had\n                    to show, first, that there was adutyon the\n                    defendant to disclose that information to the court in OS 228, and the\n                    question of whether there was such a duty to disclose would, in turn, depend on\n                    whether that information was relevant and material to the issues in\n                    OS 228. 42     In OS 228, the defendant had sought to\n                    transfer and register the Shares in his name pursuant to the Charge, of which\n                    clause 3.4 expressly provides for the Shares to be transferred to and registered\n                    in the defendant’s name upon an event of default at Guo’s cost and\n                    expense: [Guo] hereby acknowledges and agrees that the [Investors] may at any time\n                        (with or without [Guo’s] assistance) arrangefor\n                            the Shares to be transferred to and registered in the name of the\n                            [Investors] or their nominee(s) at the cost and expense of\n                            [Guo], including but not limited to any stamp duty or legal\n                        fees payable in relation to the transfers of the Shares in the event that\n                        [Guo] fail to perform the relevant obligations of this [Charge] and the\n                        [First Investment Agreement]. [emphasis added] The effect of this clause was to allow the Investors, who were\n                    equitable mortgagees, to perfect their security and becomelegalmortgagees over the Shares. Ideally, the defendant would\n                    have been in a position to transfer the Shares to himself had Guo complied with\n                    the obligation to deposit the share certificates and blank transfer forms with\n                    the escrow agent (see[9]above). However, it\n                    was precisely because of Guo’s failure to do so that the defendant had no\n                    choice but to commence OS 228 in order to perfect his security; and it was\n                    on this basis that the court had granted the Court Order in\n                OS 228. 43     As such, I fail to see why it would be\n                    material for the court in OS 228 to be informed of the pending sale when\n                    such information had no bearing whatsoever to the issue as to whether the\n                    defendant was entitled to transfer and register the shares in his name under the\n                    Charge. In this connection, Mr Tan submitted that there were twopossibleadvantages to be gained by the defendant by not\n                    disclosing the sale. It was alleged that there would be no need for the\n                    defendant to value the Shares as averred by UOB. It was also suggested that the\n                    defendant would be able to retain any surplus from the sale of the Shares\n                    without having to account to UOB as the subsequent equitable chargee. It is\n                    immediately apparent that neither of these twosupposedreasons has any direct bearing on the plaintiff. They\n                    both concerned, at best, UOB. In my view, neither reason has any merit\n                    whatsoever. First, the Court Order did not dispense with the need for valuation\n                    particularly since the application was not for sanction of the sale. Therefore\n                    if the Shares were sold below valuation, that is a matter to be taken up by UOB\n                    against the defendant. Secondly, as the Court Order was not for sanction of the\n                    sale of the Shares, there can be no question that the defendant was somehow\n                    excused from having to account to UOB or any other party as regards any surplus\n                    proceeds from the sale. Thirdly, it is indeed curious that it was the plaintiff\n                    who raised this objection instead of UOB. Interestingly, UOB, the party whom the\n                    plaintiff had alleged was effectively “defrauded” by the Court\n                    Order, instead of making any similar accusation against the defendant, had in\n                    fact reminded the defendant to “exercise their right of sale as chargees\n                    in line with their duties as chargees in law”. Finally, when Mr Tan\n                    was invited to explain why the Court would not have granted the Court Order if\n                    the pending sale had been disclosed, he was unable to provide any satisfactory\n                    explanation. In the circumstances, I find that there is no conceivable reason\n                    why the Court Order would not have been granted in OS 228 if the court had\n                    been apprised of the defendant’s pending sale of the Shares to the\n                    plaintiff. The plaintiff’s argument on fraud is therefore plainly\n                    misconceived.",
        "The Power of Sale Issues": "44     Mr Tan raised two arguments with respect\n                    to the defendant’s exercise of his power of sale: first, he submitted that\n                    because the defendant’s exercise of his power of sale under the Charge was\n                    defective, the defendant’s sale of the Shares under the S&P Agreement\n                    was thereforeultra vires; and second, even if the\n                    defendant had properly exercised his power of sale under the Charge, being an\n                    equitable mortgagee, he could not convey the legal title other than by way of a\n                    court-sanctioned sale under s 30(2) of the Conveyancing and Law of Property\n                    Act (Cap 61, 1994 Rev Ed) (“CLPA”), which provides that\n                    the court may “direct a sale of the mortgaged property, on such terms as\n                    it thinks fit”.",
        "Whether the S&P Agreement was entered into pursuant to the power\n                of sale under the Charge": "45     The plaintiff sought to show that the\n                    defendant, in exercising his power of sale, had failed to comply with the\n                    requirements under the Charge in two respects. 46     First, the plaintiff claimed that the 5-day\n                    notice required to be given under clause 8.2 of the Charge was not given by the\n                    defendant to Guo, and hence the sale was defective. Such a submission is, in my\n                    judgment, based on a complete misunderstanding of the purpose of such notices.\n                    It is trite that such notices are intended to protect the interest of the\n                    mortgagor (seeSingapore Finance Ltd v Ben’s Electrical\n                        Engineering Pte Ltd[1986] SGHC 55). It cannot be\n                    seriously disputed that Guo had to all intents and purposes abandoned any\n                    intention to either contest the enforcement of the Charge or the sale of the\n                    Shares under the S&P Agreement. This is self-evident from Guo’s\n                    complete failure to respond to any of the defendant’s letters in relation\n                    to the S&P Agreement or the Charge. In fact, Guo did not even bother to\n                    enter an appearance in OS 228, after having been served. In any event,\n                    notice of the defendant’s intention to exercise all his rights under the\n                    Charge was in fact given to Guo through the defendant’s solicitors’\n                    letter dated 12 February 2009. 47     Secondly, the plaintiff submitted that clause\n                    8.3 of the Charge contemplated a joint exercise of the power of sale byallthe Investors. Since the\n                    S&P Agreement was only concluded with the defendant, the sale could not\n                    have been an exercise of the power of sale under the Charge. The inspiration for\n                    this submission was based on the wording in clause 8.3 which provides that\n                    “all moneys received pursuant to the exercise of the power of sale\n                    described in clause 8.2 shall be apportioned amongst the Chargees\n                    proportionately.” On a plain reading, clause 8.3 merely required that the\n                    proceeds from the sale ofallof Guo’s\n                    mortgaged shares are to be apportioned proportionately among the Investors as\n                    mortgagees. However, the question of apportionment does not arise in the present\n                    case because, by virtue of the Court Order granted in OS 228, Guo's shares\n                    had already been apportioned among the Creditors and the defendant was selling\n                    onlyhisproportion of the shares,ie3,218,458 out of the total 4,208,752 shares mortgaged\n                    by Guo under the Charge. 48     For the foregoing reasons, I find that the\n                    defendant’s sale of the Shares under the S&P Agreement was a valid\n                    exercise of the power of sale granted to him under the Charge.",
        "Whether the defendant could convey the legal title to the\n                plaintiff": "49     On this point, Mr Tan relied on two\n                    passages from leading textbooks in support of the proposition that if an\n                    equitable mortgage was not made by deed, then theonlyway that an equitable mortgagee can sell the legal interest\n                    of the mortgaged property is by applying to court for a sale under s 30(2)\n                    of the CLPA. It would then follow that as the defendant had not obtained a\n                    court-sanctioned sale, he could not sell or convey the legal interest in the\n                    Shares to the plaintiff. The first passage is found inFisher\n                        and Lightwoodat para 30.43: In the case of an equitable mortgage not made by deed, there is no\n                        statutory power of sale. If the mortgagee wishes to sell, he must therefore\n                        apply to the court, which will be able to vest in him a legal term of years,\n                        so he can sell as if he were a legal mortgagee. The other passage is fromCousinsat\n                    para 16-121: In the case of other equitable mortgages not made by deed, there is no\n                        statutory power of sale out of court. However, by virtue of section 91(2) of\n                        the [1925 Act], the court itself has the power to order a judicial sale on\n                        the application of the mortgagee or of any interested person and may vest a\n                        legal term of years in the mortgagee so that he can sell as if he were a\n                        legal mortgagee. 50     This submission, to my mind, was a complete\n                    non-starter. First, it is certainly correct that if the mortgage was not made by\n                    deed, then the mortgagee has nostatutorypower of\n                    sale. This much is clear from s 24(1)(a) of\n                    the CLPA: Power incident to estate or interest of\n                            mortgagee. 24. —(1) A mortgagee,where the mortgage is made by deed, shall have the\n                            following powers, to the like extent as if they had been in\n                        terms conferred by the mortgage deed, but not further: (a) a power, when the mortgage money has become due, to sell, or to\n                            concur with any other person in selling, the mortgaged property, or any\n                            part thereof, either subject to prior charges, or not, and either\n                            together or in lots, by public auction or by private contract, subject\n                            to such conditions respecting title, or evidence of title, or other\n                            matter, as the mortgagee thinks fit, with power to vary any contract for\n                            sale, and to buy in at an auction, or to rescind any contract for sale,\n                            and to resell, without being answerable for any loss occasioned\n                            thereby; [emphasis added] However, what these two passages really meant, in my judgment, was\n                    that, in a situation where the mortgage was not made by deed, an equitable\n                    mortgagee who has nootherpower or mechanism to\n                    convey the legal title out of court would simply have no choice but to apply to\n                    court to sell or convey the legal title. Examples of such mechanisms that allow\n                    the transfer of the legal title out of court can be found in mortgage\n                    instruments and include: the granting of a power of attorney to the equitable\n                    mortgagee to convey the legal interest (Re White Rose\n                        Cottage[1965] 1 Ch 940), or a declaration by the\n                    mortgagor that he holds the legal interest on trust for the mortgagee (London and County Banking Co v\n                    Goddard[1897] 1 Ch 642). 51     In any event, the defendant had already become\n                    the legal mortgagee as a result of the Court Order in OS 228 (see[42]above); and as the legal mortgagee having\n                    legal title to the Shares, he was therefore entitled to convey the legal\n                    interest to the plaintiff without the need for a further court-sanctioned\n                    sale.",
        "The Overreaching Issue": "52     I now come to the final issue which, in my\n                    view, was really the central issue of the present dispute. 53     The defendant claimed that because the S&P\n                    Agreement was entered into pursuant to a valid exercise of a mortgagee’s\n                    power of sale, the sale of the Shares had therefore overreached the UOB charge\n                    and, as a result, the plaintiff took the Shares free from all encumbrances. The\n                    plaintiff countered that the overreaching effect only applies tostatutorysales by mortgagees as provided for in the\n                    CLPA, and since the Charge and the S&P Agreement were not executed by way of\n                    deed, there was non-compliance with ss 24(1) and 26(1) of the CLPA\n                    with the corresponding result that the UOB charge wasnotoverreached as claimed by the defendant. 54     The overreaching effect of a mortgagee\n                    exercising his statutory power of sale is expressed in s 26(1) of the\n                    CLPA: Conveyance receipt, etc., on sale. 26. —(1) A mortgagee exercising the\n                        power of sale conferred by this Act may by deed convey the property sold,\n                        for such estate and interest therein as is the subject of the mortgage,freed from all estates, interests and rights to which\n                            the mortgage has priority, but subject to all estates, interests and\n                            rights which have priority to the mortgage. [emphasis added] 55     The plaintiff submitted that since neither the\n                    Charge nor the S&P Agreement was executed by way of a deed as required\n                    by s 24(1)(a) and s 26(1) of the CLPA\n                    respectively, the sale under the S&P Agreement could not have had any\n                    overreaching effect. This submission was premised on the proposition that\n                    overreaching is a creature of statute; and if that is correct, then there may be\n                    merit in concluding that an overreaching effect can only be achieved by the\n                    exercise of a statutory power of sale. In such an event, non-compliance with\n                    s 26(1) of the CLPA would certainly be fatal to the defendant’s case.\n                    It is therefore essential to determine whether the same overreaching effect\n                    applies in general law independent of the CLPA. 56     Section 26(1) of the CLPA has been\n                    considered in at least three Singapore High Court decisions: seeDBS Finance Ltd v Prime Realty Pte Ltd[1990]\n                    2 SLR(R) 740,Indian Overseas Bank v Cheng Lai\n                        Geok[1991] 2 SLR(R) 574 (“Indian Overseas Bank”) andWin\n                        Supreme Investment (S) Pte Ltd v Joharah bte Abdul Wahab (Sjarikat\n                        Bekerjasama Perumahan Kebangsaan Singapura, third party)[1996] 3 SLR(R) 583 (“Win Supreme\n                        Investment”). From these decisions, it is clear that an\n                    exercise of a mortgagee’s statutory power of sale does overreach\n                    subsequent encumbrances such that a purchaser takes the property free from those\n                    encumbrances. The position, however, is not entirely clear where the exercise of\n                    the power of sale is not statutory but pursuant to a contractual\n                right. 57     The plaintiff initially sought to rely on bothIndian Overseas BankandWin Supreme Investmentto demonstrate that there can be no\n                    overreaching effect other than through the operation of s 26(1) of the\n                    CLPA. However when the two decisions are closely examined, it is clear that\n                    neither of them support the plaintiff’s submission. InWin Supreme Investment, Chao Hick Tin J held\n                    (at [21]–[22] and [25]) that the sale by the mortgagee pursuant to\n                    s 26(1) of the CLPA did overreach the rights of the mortgagor and of any\n                    other person who obtained their rights from the mortgagor and subsequent to the\n                    mortgage, which included a lessee of the mortgagor (the lease was entered in\n                    breach of the mortgage). Likewise inIndian Overseas\n                        Bank, after stating that s 26(1) of the CLPA also applied to\n                    registered land, Goh Phai Cheng JC held (at [36]) that the defendant\n                    purchaser had obtained good title of the property free of the four caveats that\n                    were lodged after the mortgage was created. Indeed, there was simply no\n                    suggestion in eitherWin Supreme InvestmentorIndian Overseas Bankthat the overreaching\n                    effect canonlybe achieved by the exercise of the\n                    statutory power of sale under s 26(1) of the CLPA. As, to my knowledge,\n                    there is no direct Singapore authority covering this precise point, it is\n                    essential to trace the historical origin of s 26(1). 58     The CLPA is derived from the Conveyancing and\n                    Law of Property Ordinance (Ordinance 6 of 1886) of the Straits Settlements,\n                    which in turn was based on the English Conveyancing and Law of Property Act 1881\n                    (44 & 45 Vict, c 41) (“the 1881 Act”), which in turn\n                    superseded Lord Cranworth’s Act 1860 (23 & 24 Vict, c 145). A\n                    brief history of the statutory power of sale in England was succinctly provided\n                    by Briggs J inHorsham Properties Group Ltd v\n                        Clark[2009] 1 WLR 1255 (at 1260): None the less,from the early 19th century it became\n                            common for the parties to legal mortgages to insert an express power of\n                            sale, until it was rendered unnecessary to do so by the creation of a\n                            statutory power of sale in Lord Cranworth's Act 1860 (23 & 24 Vict,\n                            c 145), repeated in section 19(1) of the Conveyancing Act 1881 (44\n                            & 45 Vict, c 41) and now to be found in section 101(1)(i) of the\n                            LPA. The exercise of that power overreaches any interest of\n                        the mortgagor: see section 2(1)(iii) of the LPA. I shall refer to it as\n                        the statutory power of sale. It becomes exercisable only when the mortgage\n                        money has become due, subject (like everything else in section 101) to any\n                        contrary intention in the mortgage deed: see section 101(4). [emphasis added] 59     In this connection, it is pertinent to\n                    highlight that there was no express mention of overreaching in the very first\n                    enactment of the mortgagee’s statutory power of sale in Lord\n                    Cranworth’s Act 1860, of which the 15th section reads as follows: The Person exercising the Power of Sale hereby conferred shall have Power\n                        by Deed to convey or assign to and vest in the Purchaser the Property sold,\n                        for all the Estate and Interest therein, which the Person who created the\n                        Charge had Power to dispose of, except that in the Case of Copyhold\n                        Hereditaments the beneficial Interest only shall be conveyed to and vested\n                        in the Purchaser by such Deed. Subsequently, the overreaching provision first made its appearance in\n                    s 21(1) of the 1881 Act: 21.—(1) A mortgagee exercising the power of sale conferred by this\n                        Act shall have power, by deed, to convey the property sold, for such estate\n                        and interest therein as is the subject of the mortgage,freed from all estates, interests, and rights to which the mortgage has\n                            priority, but subject to all estates, interests, and rights\n                        which have priority to the mortgage; except that, in the case of copyhold or\n                        customary land, the legal right to admittance shall not pass by a deed under\n                        this section, unless the deed is sufficient otherwise by law, or is\n                        sufficient by custom, in that behalf. [emphasis added] This overreaching provision was subsequently preserved in\n                    s 104(1) of the Law of Property 1925 Act (15 Geo 5 c 20) (which isin pari\n                        materiawith s 26(1) of the CLPA: seeWin\n                        Supremeat [21]). This therefore raised the interesting\n                    question whether overreaching was created through the 1881 Act. 60     Charles Harpum wrote in his seminal article,\n                    “Overreaching, Trustees’ Powers and the Reform of the 1925\n                    Legislation” [1990] CLJ 277, that overreaching had a common law\n                    origin. Reasoning from the provisions of the 1925 Act, he concluded that\n                    overreaching is a necessary concomitant of a power of disposition, and that only\n                    a transaction made by a person within the dispositive powers conferred upon him\n                    will overreach equitable interests in the property. However, it is also clear\n                    that Harpum’s analysis was based primarily on an examination ofdispositions of land by trusteesand it was on that\n                    footing that he surmised that overreaching (at least in cases of dispositions of\n                    land by trustees)must have a common law basis(at 277-278): A number of misconceptions exist about overreaching. The first is that\n                        overreaching is something that occurs only in relation to land. It is\n                        undoubtedly true that the expression “overreaching” gained\n                        currency during the 19th century and appears to have been used in connection\n                        with dispositions of land. That association has been firmly cemented by the\n                        provisions of the Law of Property Act 1925, s.2, which set out the\n                        circumstances in which a conveyance of a legal estate in land will overreach\n                        any equitable interest or power affecting the land.But\n                            overreaching must take place in relation to other forms of property. A\n                            trustee who sells trust investments must necessarily hold the proceeds\n                            of sale on the same trusts as the original investment. It\n                        must also follow from this that the basis of overreaching does not lie in\n                        the statutory provisions of section 2 of the Law of Property Act.It must have a common law basis if it applies to personalty,\n                            and there are clear accounts of the effects of overreaching that\n                            pre-date the 1925 property legislation. [emphasis added] Therefore, it is still not entirely clear, even from Harpum’s\n                    article, whether amortgageehas the same power to\n                    effect an overreaching conveyance under general law. 61     In an attempt to persuade this court that a\n                    common law mortgageedoeshave the power to effect\n                    an overreaching conveyance, Mr Pillai referred me to John Baalman’s\n                    commentary,The Singapore Torrens System(The\n                    Government of the State of Singapore, 1961) at p 137: Effect of Sale. Although the mortgagee has only a charge on the land, he is\n                        enabled by s. 57 (2) [of the Land Titles Ordinance, 1956] to pass to a\n                        purchaser the mortgagor’s estate.The result is\n                            much the same as that of a sale by a common law mortgagee. It\n                            extinguishes all subsequent encumbrances to which the land may have been\n                            subject. At common law— “The effect of a sale under the power is to destroy the equity\n                            to redeem, and this means that the rights of the mortgagor and all\n                            subsequent encumbrances are defeated, and their only remedy is against\n                            the purchase money in the hands of the vendor according to their\n                            priorities.” South Eastern Railway Co. v. Jortin(1857)\n                        6 H.L.C. 425; cited byHerring,\n                        C.J., inReg. v. Registrar of Titles, E.P.\n                            Watson[1952] V.L.R. 470, 476.It\n                            will be seen that the effects under common law and under this Ordinance\n                            are virtually equal... [emphasis added] It can be observed from the above passage that Baalman had cited two\n                    authorities for the proposition that overreaching applied at common law:Directors of South Eastern Railway Company v\n                        Jortin(1857) 6 HL Cas 425; 10 ER 1360\n                        (“Jortin’s Case”) and the\n                    Supreme Court of Victoria decision inR v Registrar of Title;\n                        Ex parte Watson[1952] VLR 470 (“Watson’s Case”), both of which were also\n                    relied upon by Mr Pillai in the present case. However, as Herring LJ inWatson’s Casealso citedJortin’s Casefor the same proposition, it is\n                    perhaps useful to begin by examining the judgment inJortin’s Case. 62     The issue inJortin’s\n                        Casewas whether the sale by the Exchequer Bill Commissioners\n                    (the “Commissioners”) to the purchasers was valid to give them\n                    good title, free from the respondent’s mortgage. The House of Lords held\n                    that the sale validly overreached the respondent’s mortgage and the\n                    respondent could only look to the Commissioners if there was a surplus from the\n                    proceeds of sale. However, it can also be seen from the judgment of Lord\n                    Cranworth LC that the court had come to that conclusion by direct reference to\n                    the statutory provisions of the Advances for Public Works Act 1842 (5 and 6\n                    Vict, c 9). The relevant provisions, which provided the overreaching\n                    effect, can be found in the judgment at 1363–1364: The 5 and 6 Vict. c. 9, gave (sect. 19) power to the Commissioners, on\n                        sale of any property under the previous statutes, to retain, after payment\n                        of costs, etc., “all the principal monies for the time being\n                        remaining due or owing, or secured by virtue of such mortgage, etc.,\n                        notwithstanding the whole of such principal money, or any instalments\n                        thereof, may not, according to the terms of such mortgage, have become\n                        actually due and payable, together with all interest (if any) for the time\n                        being accrued due,” etc.The 20th section enacted,\n                            that when the Commissioners have sold, etc. “the same public\n                            works, interest, property or effects shall, in respect to, and to the\n                            extent of, the interest or estate so sold or otherwise disposed of, be\n                            held freed and discharged from all claim and demand of the persons,\n                            parties, bodies politic, corporate or collegiate, or companies, by whom\n                            the same were conveyed to the said Commissioners or to their secretary,\n                            and of all persons or bodies claiming under them, and in all\n                        respects as if such persons, etc. making such conveyance or transfer, and\n                        all persons, etc. claiming under them, were in all respects, to such extent\n                        as aforesaid, foreclosed from all equity or right of redemption of or in\n                        respect of the premises so sold or disposed of; provided that nothing herein\n                        contained shall be taken to prejudice the rights, etc. of any persons in\n                        respect of any surplus which may be produced, in consequence of” the\n                        Commissioners entering into possession of or selling the mortgaged\n                        property. [emphasis added] Lord Cranworth LC did pause, however, to add inobiterthat the position in general law appeared to be no\n                    different, because the Commissioners were, in any event, also boundby equityto hold any surplus on trust for those who\n                    were entitled to it (at 1365–1366): [T]he other mortgagees will still have all which they\n                            contracted for; that is, a right to be paid their interest before\n                            anything is paid to the commissioners in discharge of their principal.\n                            This right, however, is one which they can enforce only against the\n                            Commissioners who have in their hands the proceeds of the\n                            sale. I incline to think that this would have been so if\n                            there had been no express enactment upon the subject. But all\n                        doubt is removed, if any existed, by the 20th section of the 5 Vict. sess.\n                        2, c. 9, which enacts, that whenever the Commissioners sell under their\n                        powers, the purchaser shall hold free from all claim on the part of the\n                        bodies corporate under whom the Commissioners derived their title, and of\n                        all persons claiming under such bodies corporate, as if they had been\n                        foreclosed; that is, the Commissioners are to be treated by purchasers as\n                        absolute owners, so far as regarded the interests of those whose rights were\n                        subsequent to the right in respect of which the sale was made, for those are\n                        the persons to whom alone foreclosure could apply. ... It is hardly necessary to add, that this decision in no way affects the\n                        rights of the Respondent on the money produced by the sale. The\n                        Commissioners, unless there have been some special circumstances affecting\n                        the case,are bound, not only on general principles of\n                            equity, but also by the express provision of the clause in the last Act\n                            to which I have referred, to pay over and distribute any surplus money\n                            in their hands, after satisfying their arrears of interest,\n                        to and among the persons justly entitled to it. With that question, however,\n                        the present Appellants have no concern. They are purchasers under a power of\n                        sale, the exercise of which gave them a good title against the harbour\n                        trustees, and all deriving title under them. [emphasis added] 63     Indeed, the position in general law relating\n                    to any surplus of the proceeds of sale supports the Lord Chancellor’s\n                    view. In the decision ofBanner v Berridge(1880-81) LR 18 Ch D 254, Kay J held that a first\n                    mortgagee, after exercising his power of sale, holds any surplus as a\n                    constructive trustee for the second mortgagee (although, on the facts, the\n                    plaintiff there was time-barred from claiming a constructive trust) (at 260,\n                    269–270). Similarly, inWest London Commercial Bank v\n                        Reliance Permanent Building Society(1885) LR 29 Ch D 954, the English Court of Appeal held\n                    that the first mortgagee, who had notice of the second mortgage, was liable, at\n                    general law, to make good to the second mortgagee the surplus that had already\n                    been paid to the mortgagor (at 962): It is conceded that if he exercises his power of sale\n                            as mortgagee, whether under the terms of the mortgage deed or by\n                            statute, he is answerable for the money he receives if he pays it to the\n                            wrong person, that is to say, if he passes over the second mortgagee and\n                            pays it to the mortgagor who has no right to receive it.\n                        Ought we, then, to make any distinction between such a case and the present?\n                        Here the first mortgagees, though they did not concur with the mortgagor in\n                        putting up the property for sale, did concur with him in the conveyance.\n                        Having done so with the knowledge that part of the purchase-money was going\n                        to be applied in violation of a right of which they had had notice, they\n                        are, in my opinion, just as liable as if they had received the whole of the\n                        money. Not being able to give a good receipt for the whole of the money,\n                        they must be held liable for that portion of it for which they could not\n                        give a good receipt, for it was in their power to refuse to concur in the\n                        sale unless the whole of the purchase-money was properly applied. [emphasis added] 64     Accordingly, if the law imposes a duty on a\n                    mortgagee, who has realised his security by way of sale, to hold any surplus of\n                    the proceeds on constructive trust for a subsequent mortgagee, it would follow,\n                    in my judgment, that overreaching is simplya necessary\n                        incident of this dutyunder general law. 65     InWatson’s\n                        Case, the issue that arose for determination was whether the\n                    common law rule inOtter v Lord Vaux(1856)\n                    6 De GM & G 638; 43 ER 1381 also applied to a statutory\n                    sale by a mortgagee under the Transfer of Land Act 1928 (No 3791) (Vic)\n                    (“Transfer of Land Act”). The rule inOtter v\n                        Lord Vauxwas that a mortgagor could not by purchasing from a\n                    mortgagee exercising a power of sale defeat a subsequent mortgagee’s\n                    interest in the property. This entailed a discussion of the power of sale\n                    conferred upon mortgagees by the Transfer of Land Act, in which Herring CJ\n                    touched on the effect of a mortgagee exercising his power of sale at general law\n                    (at 476): The effect of a sale under the power is to destroy the equity to redeem,\n                        and this means thatthe rights of the mortgagor and all\n                            subsequent encumbrancers are thereupon defeated, and their only remedy\n                            is against the purchase moneys in the hands of the vendor according to\n                            their priority—South Eastern Railway\n                            Coy. v. Jortin(1857), 6 H.L.C. 425, at\n                        p. 435. The destruction of the equity to redeem takes place as soon as\n                        there is a binding contract of sale. [emphasis added] However, as theratio decidendiofWatson’s Casewas that the rule inOtter v Lord Vauxapplied to statutory sales\n                    under the Transfer of Land Act, Herring CJ’s comment on overreaching\n                    does not really add much toJortin’s Case,\n                    although it does lend credence, in my view, to what appears from the cases, to\n                    be the prevailing judicial view that overreaching also applies in general\n                    law. 66     That prevailing view recently became\n                    established when the precise issue whether overreaching applies independent of\n                    statute arose for determination in the decision of the Supreme Court of\n                    Queensland inSt George Bank Limited v Perpetual Nominees\n                        Limited[2010] QSC 57 (“St\n                        George Bank”). In that case, the plaintiff of the same\n                    name loaned money (for the purchase and refurbishment of the Sheraton Mirage\n                    Hotel Gold Coast) through a facility secured by first registered mortgages and a\n                    first registered fixed and floating charge. Perpetual Securities\n                    (“Perpetual”) and LJK Securities (“LJK”) held second\n                    and third ranking mortgages and fixed floating charges respectively. Following\n                    the default of the borrower, St George contracted to sell the land as well as\n                    the assets and undertaking of the hotel (“SP Hotel”), assuring the\n                    purchaser, Pearls Australasia Mirage 1 Pty Ltd, (“Pearls”) that\n                    the subsequent charges would be released. However, after St George exercised its\n                    power of sale, Perpetual and LJK refused to release their charges. The question\n                    that arose for determination can be found at [16] of Wilson J’s\n                    judgment: The respective priorities of St George, Perpetual and LJK are not in\n                        issue. The question for determination is whether, upon St George’s\n                        power of sale being exercisable under its mortgages and charges, and upon\n                        completion of the contracts, Pearls will take the property and undertaking\n                        of SP Hotel free of any of the interest of Perpetual and LJK under their\n                        respective securities. 67     As for the mortgages held overland, there was no dispute because it was clear, under\n                    s 79 of the Land Title Act 1994 (Qld) (for registered land), s 83 of\n                    the Property Law Act 1974 (Qld) (for unregistered land), and s 350 of the\n                    Land Act 1994 (Qld) (for Land Act land), that lower ranking mortgages will be\n                    overreached when a mortgagee exercised its power of sale. This position is\n                    identical to that of England and Singapore. However, unlike Singapore and\n                    England (where the CLPA and the 1925 Act apply tobothreal and personal property), there is no statutory\n                    provision governing the sale ofpersonalproperty\n                    by a mortgagee in the state of Queensland. Thus, in relation to the assets and\n                    undertaking of SP Hotel, it was necessary for the court “to consider the\n                    position [of overreaching] under the general law, apart from statute”\n                        (St George Bankat [34]). 68     Due to the absence of any clear authority,\n                    Wilson J began her analysis by tracing the mortgagee’s power of sale\n                    back to Lord Cranworth’s Act 1860 and examined the decision ofJortin’s Case. Relying on a statement by\n                    Lord Cranworth LC, Wilson J took the position that overreaching\n                    also applied to mortgages in general law, independent of any statute.\n                    Wilson J did so by first characterising the Lord Chancellor’s\n                    statement as a “general observation”, and she then reasoned that\n                    this “general observation” was entirely consistent with a\n                    mortgagee’s duty in general law to hold surplus proceeds on trust for\n                    subsequent mortgagees (at [47]–[49]): 47    While the decision\n                            inJortin’s Caseturned on the\n                            priority agreement and the application of particular statutes,it is significant that the Lord Chancellor made this\n                                general observation in the introductory part of his\n                                speech: “Now when a mortgage[e] sells under a power, that sale defeats\n                            the rights of all subsequent incumbrancers, whose remedy then is only\n                            against the money in the hands of the vendors...” 48What his Lordship said was\n                                consistent with a mortgagee who exercises its power of sale holding\n                                the surplus proceeds on trust for subsequent mortgagees according to\n                                their priorities, and ultimately for the mortgagor.\n                            Disputes about priorities and the amounts owing to those with an\n                            interest in the proceeds could be determined by equity, by way of orders\n                            for accounts and inquires. 49In this way the subsequent\n                                mortgagee’s interest in the property was\n                                “over-reached”: the exercise of the power of sale\n                                defeated the subsequent mortgagees’ interest in the property,\n                                at the same time giving them a beneficial interest in the surplus\n                                proceeds of sale. [emphasis added] Having decided that overreaching applied to mortgages in general law,\n                    Wilson J went on to hold that, in principle, the same should apply tocharges(at [50]): 50    In principle, the sequelae of the exercise of power\n                            of sale by an equitable chargee are no different from those of the\n                            exercise of power of sale by equitable mortgagee. So long as the charge\n                            gives the chargee the necessary powers or conveyancing mechanisms, the\n                            chargee may convey the legal interest in the charged property, free of\n                            the interests of subsequent chargees in that property. Upon its doing so\n                            the subsequent chargees (an take) [sic] interest in the surplus proceeds\n                            of sale (if any). 69     Although it appeared, in my view, that there\n                    is some ambiguity as to whether the Lord Chancellor’s statement (Jortin’s Caseat 1366) can be taken to be a\n                    “general observation”, I would nonetheless agree with Wilson\n                    J’s finding (having arrived at the same conclusion at[64]above) that the concept of overreaching is\n                    entirely consistent with the duty of a mortgagee exercising his power of sale to\n                    hold the surplus proceeds on trust for a subsequent mortgagee. Overreaching is\n                    therefore a consequence of the exercise of the power of sale by the mortgagee\n                    which destroys the equity of redemption and thereby defeats the claims of the\n                    mortgagor and the subsequent mortgagees. Their remedy lies against the surplus\n                    proceeds arising from such a sale. 70     The recent decision inSt\n                        George Bankwas derived from my own research. As it appeared to me to\n                    be a case on point, I invited written submissions from both parties, after the\n                    close of submissions, to address me on its relevance to the dispute before me.\n                    Mr Tan sought to distinguishSt Georgeon the\n                    basis that the statutory regime in the state of Queensland was different from\n                    that in Singapore, principally on two grounds: first, the CLPA applied to both\n                    real and personal property whereas the Queensland Property Law Act 1974 (Qld)\n                    only applied to real property; and second, the notice provisions in these two\n                    statutes were worded differently. These differences, however, were immaterial\n                    because Wilson J’s holding inSt Georgewas that overreaching was not a creature of\n                    statute and applied to personal property at general law, which directly answers\n                    the issue raised before me. Accordingly, I find that the defendant’s sale\n                    of the Shares to the plaintiff had overreached UOB’s charge such that the\n                    plaintiff took the Shares free from the UOB charge.",
        "Additional observations": "71     During the course of the trial, it was the\n                    defendant’s evidence that, subsequent to granting the Charge, Guo had also\n                    granted two other charges, on 12 and 20 December 2007\n                    respectively, in favour of several investors including the defendant, under the\n                    Second and Third Investment Agreements. Although this strictly has no immediate\n                    bearing on the issues that are before me, it may affect UOB’s priority of\n                    entitlement to the surplus of the proceeds because those two charges appear to\n                    rank ahead in time of UOB’s charge. However, no documentary evidence of\n                    these other charges was adduced before me, and even if there were such charges,\n                    this is strictly an issue between those chargees and UOB. I therefore make no\n                    finding on this matter. 72     There was also a separate question as to the\n                    exact amount that was secured by the Charge. Mr Pillai had informed me that\n                    the calculation of Guo’s indebtedness to the defendant under the First\n                    Investment Agreement was a complicated exercise and was unable to provide me\n                    with the exact sum that was due to the defendant. However, as this is strictly a\n                    matter between the defendant and subsequent chargees, including UOB, I need not\n                    make a finding on the defendant’s exact entitlement to the proceeds\n                    arising out of the S&P Agreement. It would suffice for me to say that the\n                    defendant is under a duty to account for any surplus to the subsequent\n                    mortgagees/chargees after Guo’s debts to the defendant that are secured by\n                    the Charge have been fully discharged.",
        "Conclusion": "73     It bears mentioning that it was the plaintiff\n                    who had approached the defendant to purchase the Shares mortgaged by Guo. The\n                    plaintiff clearly wanted to take over control of the Company. This was\n                    consistent with both her own investments in the Company and the loans which she\n                    had extended to the Company. However, shortly after the S&P Agreement was\n                    entered into, she realised that the Company was not such an attractive\n                    investment opportunity after all. Thereafter, she became determined to find all\n                    possible avenues to extricate herself from the S&P Agreement. Unfortunately\n                    for the plaintiff, the fact that the Company was no longer a viable investment\n                    does not provide a legitimate excuse not to perform her clear and binding\n                    obligation to complete the sale and purchase of the Shares under the S&P\n                    Agreement. 74     By reason of the above findings, I make the\n                    following orders: (a)The plaintiff’s claim is hereby dismissed\n                            with costs.(b)As regards the defendant’s\n                            counterclaim:(i)I declare that the S&P Agreement is\n                                    subsisting and binding upon the plaintiff;(ii)The plaintiff is to pay the sum of\n                                    $2,884,000 to the defendant against the transfer of the Shares;\n                                    and(iii)Interest at 5.33% per annum on the sum\n                                    of $2,884,000 from 14 August 2009 (the date the\n                                    counterclaim was filed) to the date of judgment.(c)As the plaintiff’s claim and the\n                            defendant’s counterclaim are related and have common issues, I\n                            will only allow one set of costs to be paid by the plaintiff to the\n                            defendant to be taxed on a standard basis if not agreed."
    }
}