{
    "case_title": "Lim Weipin and another\n      v\n      Lim Boh Chuan and others",
    "ncitation": "[2010] SGHC 99",
    "coram": "Tan Lee Meng J",
    "sections": {
        "Background": "5       Three brothers, LHC, Mr Lim Boon Kee\n                    (“LBK”) and Mr Lim Boon Wan (“LBW”), who have\n                    all passed away, came to Singapore from Fujian around 1940. 6       In 1947, LBK and LBW set up the partnership,\n                    which traded in iron, steel, copper and brass materials obtained from used cars,\n                    machinery and ships. It is evident from the records filed with the Registry of\n                    Business Names at the material time that LHC was not one of the founding\n                    partners of the partnership. 7       In 1952, a third person joined the partnership.\n                    His name was stated on the registration certificate issued by the Registrar of\n                    Business Names as “Lim Hong Choon alias Lim Tian Siong”. The\n                    plaintiffs claimed that this third partner was in fact LHC and that Siong added\n                    his name as an alias of Lim Hong Choon in order to impersonate him for the\n                    purpose of taking over his shares in the partnership. However, the defendants\n                    contended that the third partner was in fact Siong, whose alias was “Lim\n                    Hong Choon”. 8       At this juncture, it must be noted that the\n                    persons who have actual knowledge of the partnership’s affairs in the 1952\n                    are dead and the plaintiffs’ claim rested on their own speculation as to\n                    why the third partner was named “Lim Hong Choon alias Lim Tian\n                    Siong”. It is also noteworthy that both LHC and Siong used a number of\n                    aliases. Siong was known as “Lim Tian Siong alias Lim Thian Siong alias\n                    Lim Thiam Siong alias Lim Hong Choon”. In its letters, the Inland Revenue\n                    Department addressed him as “Lim Thian Siong alias Lim Hong\n                    Choon”. 9       In 1959, LHC left Singapore and returned to\n                    China for good. 10     On 10 March 1970, another registration\n                    certificate of the partnership was issued by the Registrar of Business Names.\n                    The three partners were stated as LBK, LBW and Siong and their respective\n                    identity card numbers were stated in the said form under their\n                names. 11     LBK died on 11 July 1973, after which\n                    another registration certificate dated 19 July 1973 was issued by the\n                    Registrar of Business Names in respect of the change of members of the\n                    partnership. LBK was named as the withdrawing partner and his estate was listed\n                    as the new partner. 12     On 31 July 1973, LBW and Siong\n                    incorporated the company. Both of them were the subscriber shareholders and\n                    initial directors of the company. The company’s shares were allowed in the\n                    following proportions: 700 for LBW and his family, 700 for LBK’s family\n                    and 600 for Siong. It is common ground that LHC was no longer in Singapore at\n                    the material time and that he did not work in or for the company. 13     Although the plaintiffs claimed that the\n                    partnership was converted to the company, the fact is that the partnership\n                    continued to operate after the company was formed. In fact, on 20 September\n                    1974, one year after the company was formed, the partnership was renamed\n                    “Hup Seng Huat” and it continued to operate on its own and it even\n                    sold a property to the company in 1975. 14     On 26 February 1981, LHC, who had\n                    suffered a stroke in 1974, died intestate in China. No registration certificate\n                    to reflect a change of partners in the partnership was filed after his\n                    death. 15     On 27 June 1983, almost ten years after\n                    the company was formed, the partnership was finally terminated. 16     On 23 August 1983, Siong, who had a\n                    relatively short life, died intestate in Singapore. His wife, GCE, and his\n                    children inherited his assets. GCE passed away intestate on 26 July\n                    1992. 17     In 1994, the company became a public listed\n                    company named Hup Seng Huat Co Ltd. In 2005, the company’s name was\n                    changed to “Hupsteel Limited”\n                (“HupSteel”). 18     On 8 June 2003, LHC’s brother, LBW, who\n                    had been quite generous to the plaintiffs, passed away. 19     The 1stdefendant,\n                    LBC, said that LW tried to borrow a few million dollars from him in 2003. LW\n                    admitted that he asked LBC for a loan and that he told LBC that he owed a few\n                    million dollars to someone in China. LBC contended that after he refused to lend\n                    LW any money, the plaintiffs resorted to intimidation, blackmail and the\n                    institution of the present proceedings. 20     In 2006, the plaintiffs instructed a Chinese\n                    law firm, Beijing Zhong Ji (“BZJ”), to act for them. BZJ sent a\n                    letter to LBC on 12 September 2006, which included the following\n                    paragraphs: As Mr Lim Hong Choon’s son, Lim Tian Siong, disregarded\n                        morality and law, revised and distorted the company registration documents,\n                        passed himself off as his father, and snatched Mr Lim Hong\n                        Choon’s share and property in Chop Hup Seng Huat and Hoe Seng Huat. He\n                        even used the illegal income to establish other company and get a huge sum\n                        of wealth. After Lim Tian Siong … died, Mr Lim Boh Chuan applied\n                        to receive inheritance by judicature channel and became the real occupant of\n                        Lim Tian Siong’s huge sum of illegal wealth …. We hope Mr Lim Boh Chuan and Lim Puay Koon contact our lawyer\n                        ZhangYing within 10 days after [receiving] our letter of demand and to\n                        consult and discuss with each other to get a good way to settle the\n                        historical problem, and to avoid using the media report or judicature\n                        channel to settle the problem, which is disadvantageous for all\n                        parties. 21     LBC instructed Shook Lin & Bok\n                    (“SLB”) to reply to BZJ on 29 September 2006. In its reply,\n                    SLB stated that its client denied the allegations in BZJ’s letter of\n                    12 September 2006. However, BZJ continued to make similar allegations in\n                    their subsequent letters to SLB on 16 October 2006, 14 November 2006\n                    and 21 November 2006. 22     LBC and LPK regarded the allegations in\n                    BZJ’s letters of 12 September 2006, 16 October 2006,\n                    14 November 2006 and 21 November 2006 as defamatory. They applied for\n                    an injunction restraining the plaintiffs from publishing defamatory statements\n                    “similar to the words and meaning contained in 4 letters issued under the\n                    letterhead of the plaintiffs’ Beijing solicitors dated 12 September\n                    2006, 16 October 2006, 14 November 2006 and 21 November\n                    2006”. The injunction was granted by Justice Lai Siu Chiu on\n                    1 December 2006. BZJ declined to accept service of the injunction on the\n                    plaintiffs’ behalf. 23     In July 2008, the plaintiffs instituted\n                    the present action against the defendants.",
        "The Expert Witnesses": "24     The plaintiffs and the defendants called\n                    expert witnesses on Chinese law to testify on a number of issues relating to\n                    Chinese law. 25     The defendants’ expert witness,\n                    Mr Zhang Zhiqiang (“ZZQ”), who is from Jingtian &\n                    Gongcheng Attorneys, was a rather helpful witness. 26     The plaintiffs’ expert witness was\n                    Mdm Zhang Ying (“ZY”), a director of BZJ. In her curriculum\n                    vitae that was furnished to the court, she had stated that English is one of her\n                    “working languages” and that she is able to “provide legal\n                    services in Chinese (Mandarin), English and French”. Remarkably, when\n                    questioned, ZY categorically denied that English was one of her “working\n                    languages” and she insisted on testifying in Mandarin with the assistance\n                    of a court interpreter. 27     ZY did not fulfil her duty to the court as an\n                    expert witness. InPacific Recreation Pte Ltd v Technology\n                        Inc[2008] 2 SLR(R) 491, the Court of Appeal pointed\n                    out (at [60]) that an expert’s duty to the court is of such central\n                    importance that O 40A r 2(h) of the Rules of Court makes it a requirement that\n                    the expert report contains “a statement that the expert understands that\n                    in giving his report, his duty is to the Court and that he complies with that\n                    duty”. The Court of Appeal endorsed (at [73]) GP Selvam J’s\n                    statement inGanapathy Muniandy v Khoo James[2001] SGHC 165 at [12.16] that any special relationship between the party and\n                    his expert must be disclosed in the expert’s report. In the present case,\n                    ZY did not disclose in her report that she and her law firm had acted for the\n                    plaintiffs with respect to the claim against the defendants. When cross-examined\n                    by Mr Davinder Singh SC (“Mr Singh”), the counsel for\n                    the 1stand 2nddefendants, ZY tried to hide this fact. The relevant part of the\n                    cross-examination is as follows: QIf you have any relationship with any party, you\n                            must disclose it. “Yes” or\n                        “no”? AYes…. QHave you at any time before affirming your affidavit\n                            acted for the plaintiffs in connection with the dispute that is\n                            presently in this court? “Yes” or “no”\n                            please. ANo. 28     When questioned further, ZY merely conceded\n                    that her law firm had acted for the plaintiffs. Mr Singh then pointed out\n                    that BZJ’s letter to LBC dated 12 September 2006 had invited the\n                    latter to contact a “Zhang Ying” from the said law firm to discuss\n                    the plaintiffs’ claim. ZY wasted the court’s time by saying that she\n                    needed to see the Chinese version of the said letter before she could know\n                    whether she is the “Zhang Ying” mentioned in the said letter.\n                    After reading the Chinese version of the letter, ZY finally admitted that she\n                    had acted for the plaintiffs with respect to their claim against the defendants.\n                    The relevant part of the proceedings is as follows: QSo, now, are you the Zhang Ying referred to [in the\n                            letter of 12 September 2006]? AYes. QSo contrary to your evidence\n                                earlier, not only did your firm act, you were the one in that firm\n                                who acted for the plaintiffs? AYes…. Q[The 1st plaintiff, LW] gave evidence yesterday that\n                            he instructed your firm.The person in the firm that\n                                he instructed in 2006 was you, correct? AYes. [emphasis added] 29     After admitting that she had acted for the\n                    plaintiffs, ZY revealed that after studying the plaintiffs’ case, she had\n                    written a number of letters to SLB. She testified that she believed that her\n                    accusations against the defendants including that of impersonation, which is the\n                    foundation of the plaintiffs’ claim, are true. 30     Finally, it ought to be noted that when LW\n                    took medical leave for two days in the middle of his cross-examination, ZY met\n                    him for dinner on the day that she herself had been cross-examined. This led\n                    Mr Singh to suggest that she must have met LW to discuss how LW could\n                    tailor his evidence to take into account her own evidence when she knew that LW\n                    was not supposed to discuss his evidence with anyone at that time. 31     Why ZY was called as an expert witness for\n                    this case cannot be readily understood. Her testimony about her involvement with\n                    the plaintiffs’ case certainly undermined her credibility as an impartial\n                    expert witness.",
        "Whether LW and LY are LHC’S children": "32     The plaintiffs are entitled to rely on the Act\n                    to advance their claim against the defendants only if they are LHC’s\n                    children. Rule 3 of s 7 of the Act provides as follows: Subject to the rights of the surviving spouse, if any, the estate…\n                        of an intestate who leaves issue shall be distributed by equal portions per\n                        stirpes to andamongst the childrenof the\n                        person dying intestate and such persons as legally represent those children,\n                        in case any of those children be then dead. [emphasis added] 33     Section 3 of the Act defines a\n                    “child” as follows: In this Act — \"child\" means alegitimatechild andincludes any child adoptedby virtue of an\n                        order of court under any written law for the time being in force in\n                        Singapore, Malaysia or Brunei Darussalam. [emphasis added]",
        "Whether LW is LHC’s adopted son": "34     LW claimed that he was adopted by LHC and his\n                    third wife, Mdm Chen Yan Shi, when he was 5 years old. To support his\n                    claim, he submitted a notarial certificate issued by one Xu Jing Hong from the\n                    Nan’an Notary Public Office (“the notarial certificate”), a\n                    family ancestral book and photographs of LHC’s funeral and LHC’s\n                    mother’s tombstone. The notarial certificate 35     There is some confusion as to what the\n                    notarial certificate purports to say because LW furnished two translated\n                    versions of the certificate to the court. The first translated version is as\n                    follows: This is to certify that the applicant Lin Wei Pin is thefosterson of the related person Lin Feng Chu (Lim\n                        Hong Choon). [emphasis added] 36     The other translated version of the notarial\n                    certificate provides as follows: This is to certify that the applicant Lin Wei Pin is theadoptedson of the related person Lin Feng Chu (Lim\n                        Hong Choon). [emphasis added] 37     The plaintiffs relied onWong Kai Woon alias Wong Kai Boon v Wong Kong Hom alias Ng Kong Hom &\n                        Others[2000] 1 SLR 546 (“Wong Kai Woon”), where notarial certificates were\n                    admitted as evidence. Whatever may have been decided in that case, it cannot be\n                    overlooked that in the present case, the defendants pointed out that there was\n                    no evidence of the authenticity of the notarial certificate submitted by\n                    LW. 38     Furthermore, there was credible evidence from\n                    the defendants’ expert witness, ZZQ, that the notarial certificate is not\n                    in the prescribed form required by Chinese law. In his written opinion, he\n                    explained as follows: Under Chinese law, this document,even if\n                            authentic, shall begiven little or no\n                            evidential value with respect to proving an adoptive\n                            relationshipbetween [LW] and [LHC] in a Chinese\n                        court: (a)    The document entitled “Notarial Deed of\n                            Relative Relationship” does not comply with the prescribed form\n                            under Chinese law. (b)    Under Chinese law, a Notarial Deed of Relative\n                            Relationship which does not comply with the prescribed form shall be\n                            given little or no evidential value in a Chinese court applying Chinese\n                            law; and (c)    The document entitled “Notarial Deed of\n                            Relative Relationship” has not been properly legalized by the\n                            embassy or consulate in accordance with the procedure under Chinese\n                            law. [emphasis added] 39     Elaborating on the third of the\n                    above-mentioned reasons, ZZQ explained the rules regarding use of notarial deeds\n                    of relationshipoutside Chinain the following\n                    succinct terms: Under Article 27 of the Interim Regulations on Notarization,prior to being delivered for use overseas, a\n                        Notarial Deed of Relative Relationship has to be legalized by the competent\n                        authorities of the Chinese Government (ie the Ministry of Foreign Affairs,\n                        or the foreign affairs office of the province, autonomous region or\n                        municipality directly under the Central Government) and the embassy or\n                        consulate of the foreign country in China.The\n                            documententitled “Notarial Deed of Relative\n                        Relationship”produced by the 1st Plaintiff has not been legalized by\n                            the embassy or consulate in accordance with Chinese\n                        law…. [emphasis added] 40     The plaintiffs’ expert witness, ZY, had\n                    no real answer to ZZQ’s assertion regarding the deficiency of the notarial\n                    certificate. The relevant part of the cross-examination of ZY is as\n                    follows: QYou have read the expert evidence of my expert,\n                            right, Zhang Zhiqiang, Right? A(No interpreted answer) QAnd my expert has annexed the [proper form to prove\n                            an adoption], correct? AYes. QMy expert has commented on the effect of not\n                            complying with the form, right? “Yes” or\n                            “no”? ABut then I felt it had nothing to\n                                do with what I have stated in paragraph 7. [emphasis added] 41     In her report at [7], ZY had merely made the\n                    following general statement: In the present case, the notarial certificates as produced by the 1st and\n                        2nd plaintiffs, are the only forms of proof that the 1st and 2nd plaintiffs\n                        may produce to certify their kinship and relationship with the late LIM HONG\n                        CHOON under the Chinese laws during their (sic) 1950s. 42     It follows that ZY did not effectively counter\n                    the assertions of ZZQ as to why the notarial certificate is deficient under\n                    Chinese law. 43     In the plaintiffs’ closing submissions,\n                    it was asserted that “there could never be a notarial certificate of\n                    adoption issued for [LW] as he was adopted in 1959 when … there was no\n                    system in China of a record of adoption”. This misses the point as what\n                    matters is the date of the notarial certificate presented to the court, which\n                    was purportedly issued on 15 October 2004, and not the date of adoption.\n                    ZZQ pointed out that under Chinese law, notarial certificates for adoptions\n                    registered after 1993 had to be in the prescribed form. In regard to the\n                    notarial certificate, I prefer ZZQ’s evidence over that of\n                ZY. 44     Another point canvassed by the plaintiffs is\n                    that the notarial certificate should be admitted under ss 76 and 80 of the\n                    Evidence Act (Cap 97, 1997 Rev Ed) (“EA”).\n                    Sections 76 and 80 of the EA cannot be relied on by LW because they concern\n                    public documents. InSturla v Freccia(1880)\n                    LR 5 App Cas 623 at 643, Lord Blackburn explained that a public document\n                    means “a document that is made for the purpose of the public making use\n                    of it, and being able to refer to it”. LW’s notarial certificate is\n                    intended for his private use. In any case, s 80 of the EA only concerns\n                    original copies of public documents or copies certified “by the legal\n                    keeper thereof” under specified conditions. As has been mentioned, LW\n                    failed to prove the authenticity of the notarial certificate, which is, in any\n                    case, not in the form required by Chinese law. 45     For the reasons already stated, I hold that\n                    the notarial certificate does not establish that LW is LHC’s adopted\n                    son. The ancestral book 46     As for the ancestral book, which was relied on\n                    by the plaintiffs as a record of their family tree, it was most unsatisfactory\n                    that the book was not produced for the perusal of the defendants before the\n                    trial. On thefinalday of the trial, the\n                    plaintiffs suddenly produced what they claimed to be the family’s\n                    ancestral book. After perusing it, the defendants’ expert witness, ZZQ,\n                    was unable to confirm the authenticity of the said book. He also pointed out\n                    that there were inconsistencies between LW’s date of birth in the\n                    ancestral book and in the notarial certificate. There was also an inconsistency\n                    with respect to LY’s date of birth in the ancestral book and in another\n                    document submitted by LY to the court. 47     When cross-examined, LW admitted that he had\n                    no personal knowledge as to who made the entries in the alleged ancestral book.\n                    The following part of the cross-examination of LW merits attention: Q[A]nd so you would take this book whenever a boy is\n                            born to somebody to update it, right? AWell, no, it’s not done this way. What\n                            happened would be thatafter a collection of 10 or\n                                twenty years, maybe thirty years, then there would be a\n                                standardization of all the names and then all these records would be\n                                entered in the book. [emphasis added] 48     If the names in the alleged ancestral book are\n                    updated only after 10, 20 or 30 years, the accuracy of the entries therein\n                    cannot be confirmed when one does not know who gave the instructions for the\n                    updating of the said book, and especially so when it contains discrepancies\n                    relating to the birth of both LW and LY. 49     ZY claimed that ancestral books are often used\n                    by Chinese courts to prove family relationships. She stated as follows in her\n                    expert report annexed to her affidavit of evidence-in-chief\n                    (“AEIC”) at [15]: In Chinese law, the family ancestral book is an important book that\n                        depicts the history and origins of the family... It is compiled by a\n                        specialist in this area and new names shall only be added during a very\n                        formal and grand ritual. The Book is then passed down from generations to\n                        generations. Accordingly, this book is recognised in Chinese law and is\n                        often used in the Chinese Courts to prove blood ties and relationship. Also,\n                        in the Chinese society, ancestral books like these are widely\n                        recognized. 50     However, ZZQ took a totally different view.\n                    When questioned by Mr Singh, he referred to ZY’s opinion and\n                    said: I do not agree with what is [stated by ZY] …. [T]his ancestral book\n                        in China is planned and compiled by every … clan in the social\n                        organization….It is not produced by …\n                            authorities or the government departments to prove … blood\n                            relationship. As such, during the compilation, it is not\n                        constrained by government departments.It also does not\n                            have any requirements in meeting the regulations…. In\n                        the courts, the truth of it has very little strength of evidence .... or\n                        certification.In the Chinese courts, the ancestral book,\n                            as or approved evidence, has to be put together with the other evidence\n                            as a chain of evidence. It has to be judged by the\n                        courts. [emphasis added] 51     In relation to the ancestral book, I prefer\n                    the more balanced approach of ZZQ over ZY’s evidence. I thus find that the\n                    ancestral book, the authenticity of which was rightly challenged by the\n                    defendants, is of no value in proving that LW is LHC’s adopted son or that\n                    LY is LHC’s biological daughter. The photographs 52     LW contended that photographs of him in white\n                    mourning attire at LHC’s funeral and of LHC’s mother’s\n                    tombstone in China corroborate his claim that he is LHC’s adopted\n                    son. 53     The donning of funeral attire by a person does\n                    not, without more, prove that he or she is an adopted or a biological child of\n                    the deceased. LHC died in China and it is highly likely that LW, who took care\n                    of him until he passed away, made the arrangements for LHC’s funeral. It\n                    was open to him to wear white mourning attire. As such, the photograph in\n                    question does not, by itself, establish that LW is LHC’s adopted\n                    son. 54     As for LHC’s mother’s tombstone\n                    (“the tombstone”) in China, LW claims that the fact that his name\n                    appears on the tombstone shows that he is related to LHC. What is engraved on a\n                    tombstone depends on the instructions given to the engraver by the person who\n                    ordered its erection. LW stated in his AEIC at [29] that he was “solely\n                    in charge” of the erection of the tombstone. If this is so, there is\n                    nothing to stop him from instructing the engraver to add his name onto the\n                    tombstone. As such, the fact that his name is found on the tombstone cannot,\n                    without more, prove that he is LHC’s adopted son. 55     In the plaintiffs’ closing submissions,\n                    reliance was placed on s 32(f) of the EA for the admission of the\n                    inscriptions on the tombstone as evidence. The reliance on s 32(f) of the\n                    EA is misplaced for the simple reason that it concerns statements regarding the\n                    “relationship by blood marriage or adoptionbetween\n                        persons deceased”. As LW is claiming that he is related to\n                    the late LHC, s 32(f) of the EA is irrelevant. Foster son or adopted son 56     There is a yet another reason why LW did not\n                    establish that he is LHC’s adopted son. While an adopted child is entitled\n                    under the Act to a share of the deceased’s parent’s estate, a foster\n                    child is outside the ambit of the Act. 57     When cross-examined, LW accepted that he knew\n                    that there is a difference between an adopted son and a foster son. The relevant\n                    part of the cross-examination is as follows: QYou’ve agreed with me that an adopted son is\n                            one who is legitimately part of the family? AThat’s correct…. QAnd would you agree with me that\n                                a foster son is not a legitimate member of the\n                            family? AThat’s\n                            correct. [emphasis added] 58     Despite knowing about the difference between\n                    an adopted son and a foster son, LW referred in his AEIC to himself as a\n                    “foster” son and to LHC as his “foster” father. For\n                    instance, he referred at [4] to a notarial certificate that verifies “thefosterrelationship between Lim Hong Choon and\n                    I”. Furthermore, LW stated in his AEIC at [6] that he had been adopted by\n                    his “foster” parents because his “foster father, being\n                    Hokkien, was interested to look for a boy to ensure continuity in the\n                    family”. Finally, he stated in his AEIC at [33] that he and LY suspected\n                    that “my foster father may have assets in\n                Singapore”. 59     LW tried to distance himself from the use of\n                    the word “foster” in his AEIC, claiming that he does not\n                    understand English. However, this excuse cannot be countenanced as LW admitted\n                    that the AEIC had been translated to him in Mandarin by his counsel,\n                    Mr Irving Choh. 60     I thus find that LW did not prove that he was\n                    an adopted son rather than a foster son. As such, he has no claim to LHC’s\n                    assets under the Act. The family tree chart in LW’s AEIC 61     In their closing submissions, the plaintiffs\n                    relied onWong Kai Woon(supra, at [40]) to support their assertion that the family tree\n                    chart produced by LW to the court is admissible as evidence under s 159 of\n                    the EA to corroborate their claim that they are LHC’s children. Section\n                    159 of the EA, which concerns the use offormerstatements of a witness to corroborate later testimony as to the same fact, is\n                    not applicable in the present case because the family tree chart relied on by\n                    the plaintiffs is not a “former” statement. It appears in\n                    LW’s AEIC and was produced for the sole purpose of supporting his claim to\n                    a share of LHC’s estate. In any case, the chart is inaccurate as it showed\n                    that LHC had four children whereas LW testified that LHC had six\n                    children.",
        "Conclusion": "62     As LW did not establish that he is LHC’s\n                    adopted son, his claim against the defendants is dismissed.",
        "Whether LY is LHC’S biological daughter": "63     LY had merely pleaded that she is LHC’s\n                    biological daughter. This is rather puzzling as she is only entitled to rely on\n                    the Act if she is LHC’slegitimatechild. InAAG v Estate of AAH, deceased[2009] SGCA 56, the Court of Appeal reiterated at [22] and [38(c)]\n                    that the Act excludes an illegitimate child from succeeding to his or her\n                    parent’s intestate estate. 64     LY was born in 1953, several years before her\n                    mother married LHC in 1958. In their Reply to the Defence, the plaintiffs\n                    pleaded as follows: LIM HONG CHOON married his third wife, one named [Chen Yan Shi] in Fujian,\n                        China, sometime in 1958.At that time, the 2nd Plaintiff\n                            was only about four years of age. [emphasis added] 65     It follows that even if LY was LHC’s\n                    biological child, she was not his legitimate child when she was born. When\n                    cross-examined, LW contradicted his pleaded case and claimed that he had\n                    “heard” that LHC married LY’s mother before 1949. Neither he\n                    nor LY offered any proof of this new position and no attempt was made to amend\n                    the plaintiffs’ pleadings regarding the date of the marriage between LHC\n                    and Chen Yen Shi. 66     There was no evidence before the court that LY\n                    was legitimated in any way after her mother married LHC. In his closing\n                    submissions, LY’s counsel referred to s 9(1) of the Legitimacy Act\n                    (Cap 162, 1985 Rev Ed), which provides as follows: Where the parents of an illegitimate person marry or have married one\n                        another, whether before, on or after 18th May 1934 and the father of the\n                        illegitimate person was or is,at the time of the\n                            marriage, domiciled in a country other than Singapore, by the law of\n                            which the illegitimate person became legitimated by virtue of the\n                            subsequent marriage, that person, if living, shall within\n                        Singapore be recognised as having been so legitimated from 17th May 1934 or\n                        from the date of the marriage, whichever last happens, notwithstanding that\n                        his father was not at the time of the birth of that person domiciled in a\n                        country in which legitimation by subsequent marriage was permitted by\n                        law. [emphasis added] 67     Section 9(1) of the Legitimacy Act\n                    requires LY to prove that she was legitimised by virtue of the subsequent\n                    marriage under Chinese law. No evidence of Chinese law on legitimacy was\n                    tendered by her. On this basis alone, LY’s claim against the defendants\n                    may be dismissed. 68     Even if the presumption of similarity of law\n                    applies, and I am not saying that the presumption applies in this case, and\n                    Singapore law is applicable, LY’s case does not go any further.\n                    Section 9(1) of the Legitimacy Act is only relevant where theparentsof an illegitimate child marry. InPrinciples of Family Law in Singapore(Butterworths\n                    Asia, 1997) at pp 608-609, Professor Leong Wai Kum rightly pointed out that\n                    legislation allows a child who was illegitimate at birth as his or her parents\n                    were not married to each other, to acquire legitimate status when the parents\n                    subsequently marry each otherand not, simply on any\n                        subsequent marriage of the mother with any man” (emphasis\n                    added). 69     LY produced a “Certificate of Relative\n                    Relationship” from the Sanbao Villagers Committee, Liucheng Subdistrict\n                    Office, Nan’an City (“the village committee’s\n                    certificate”), which stated that she is LHC’s biological daughter.\n                    The defendants rightly objected to this document as the makers of the document\n                    were not called as witnesses and one does not know the grounds on which the\n                    village committee decided that LY is LHC’s biological daughter. In any\n                    case, the defendants’ expert witness, ZZQ, testified that a village\n                    committee had no authority to determine kindred relationships. He explained as\n                    follows: The document entitled “Certificate of Relative Relationship”\n                        produced by [LY] states that it has been issued by the Residents’\n                        Committee of Fujian Province. According to Article 5 of the Organic Law of\n                        the Residents’ Committees of Fujian Province, the Residents’\n                        Committeedoes not have the authority to prove kindred\n                            relationships. Therefore, even if the document entitled\n                        “Certificate of Relative Relationship” is authentic, it shall\n                        be given little or no evidential value with respect to proving the existence\n                        of a family relationship (father and biological daughter) under Chinese\n                        law. Further, under the Notice of Not Allowing Local Office to Issue\n                    Certificate, a Certificate of Relative Relationship to be delivered for use\n                    overseas shall be issued only by a local notary office. Local residents’\n                    committees of the local offices of civil affairs departments are not authorized\n                    to accept and handle notarizations related to birth and kinship and required by\n                    citizens of China for use overseas. The document entitled “Certificate of\n                    Relative Relationship” produced by LY has not been issued by a local\n                    notary office. 70     According to ZZQ, the village\n                    committee’s certificate is also of no value because it has not complied\n                    with requirements under the Chinese Interim Regulations on Notarization law\n                    regarding the use of certificates of relationship overseas. This rule has\n                    already been discussed earlier on. 71     ZZQ’s evidence, as outlined above, was\n                    not countered by the plaintiffs’ expert witness, ZY, who had wrongly\n                    concluded in her written opinion that LY had produced a notarial certificate to\n                    prove her relationship with LHC when only a village committee’s\n                    certificate had been produced. 72     As for the ancestral book and photographs of\n                    the funeral of LHC and of LHC’s mother’s tombstone, these have been\n                    already been considered earlier on and need not be considered\n                here. 73     As LY did not prove that she is LHC’s\n                    biological daughter and legitimate child, her claim against the defendants is\n                    dismissed.",
        "The Alleged Impersonation": "74     Even if the plaintiffs are LHC’s\n                    children, they are not entitled to any of the shares in the partnership unless\n                    LHC owned shares in the partnership when he died in 1981. 75     The plaintiffs’ case is that Siong had\n                    unlawfully taken over LHC’s shares in the partnership (“LHC’s\n                    shares”) by impersonating him in 1952. They then asserted that LHCs\n                    shares that were in Siong’s hands were converted to the company’s\n                    shares in 1973 and that Siong’s shares in the company that are now in the\n                    defendants’ hands are held on constructive trust for LHC’s children,\n                    including themselves. 76     The plaintiffs made a very serious allegation\n                    against Siong. InYogambikai Nagarajah v Indian Overseas\n                        Bank[1996] 2 SLR(R) 788, the Court of Appeal made it\n                    clear that the standard of proof for allegations of fraud, forgery or criminal\n                    conduct in civil cases is determined in line withHornal v\n                        Neuberger Products Ltd[1957] 1 QB 247, where the\n                    English Court of Appeal approved the following passage from an earlier judgment\n                    of Denning LJ inBater v Bater[1951] P 35 at 37: [I]n civil cases, the case may be proved by a preponderance of probability\n                        but there may be degrees of probability within that standard. The degree\n                        depends on the subject-matter. A civil court, when considering a charge of\n                        fraud, will naturally require for itself a higher degree of probability than\n                        that which it would require when asking if negligence is established. It\n                        does not adopt so high a degree as a criminal court, even when it is\n                        considering a charge of a criminal nature but still it does require a degree\n                        of probability which is commensurate with the occasion. 77     LW outlined his case on Siong’s\n                    impersonation of LHC in 1952 in his AEIC at [35] to [40] as follows: 35    On the forms, I observedsome\n                                irregularities with respect to the signatures. For\n                            instance, in the ACRA form dated 29 August 1952 … against my\n                            father’s name, Lim Hong Choon, there was an additional alias name,\n                            in both Chinese and English characters, of “Lim Tian\n                            Siong”. There was also a cancelled signature. Against the\n                            cancelled signature, the Chinese characters of “Lim Hong\n                            Choon” was re-signed. 36    For the ACRA form dated 10 March 1970\n                            …, my father’s name, “Lim Hong Choon”, was\n                            again signed on the first and second pages of the ACRA forms. In\n                            addition to the name of “Lim Hong Choon”, there was also\n                            an alias name of “Lim Tian Siong” in both Chinese and\n                            English characters. At that time, my father was not in Singapore. It is\n                            impossible that he could have signed. 37    Again, for the ACRA form dated 28 February\n                            1972 …, there is no longer a signature of “Lim Hong\n                            Choon”. Instead, there are two signatures of “Lim Tian\n                            Siong” and in place of Lim Tian Siong’s alias name, there\n                            was my father’s (Lim Hong Choon) name. The irregularities continue\n                            to be spotted in the ACRA forms dated 19 July\n                        1973…. 38From these ACRA\n                            forms,it is clear that in 1952, order to impersonate\n                                my father, LIM TIAN SIONG (deceased) unlawfully adopted the identity\n                                of his father, LIM HONG CHOON (deceased), by adding as an\n                                alias/previous name of “Lim Tian Siong” and added its\n                                Chinese characters against my father’s name on the ACRA\n                                form. 39    This continued in 1970, 1972 and 1973 where LIM\n                            TIAN SIONG (deceased) impersonated the identity of my father again but\n                            this time, by switching the name of my father against his and by adding\n                            “Lim Hong Choon” in its Chinese character as an\n                            alias/previous name against his own name of “Lim Tian\n                            Siong”. 40    Furthermore, it is also clear that LIM TIAN SIONG\n                            (deceased) also cancelled his Chinese signature “LIM TIAN\n                            SIONG” in place with a signature by the name of LIM HONG CHOON in\n                            the ACRA forms. [emphasis added] 78     In regard to proof of the alleged\n                    impersonation by Siong, it has been pointed out that the persons who had any\n                    direct knowledge as to what happened in relationship to the partnership’s\n                    affairs in 1952 are dead. Thus, the plaintiffs had to speculate on whatmighthave happened in 1952 on the basis of\n                    the documents presented by them to the court to prove their allegation of\n                    impersonation of LHC by Siong. It is evident from LW’s AEIC at [35] that\n                    the plaintiffs’ case on impersonation is premised on their non-expert\n                    opinion that there are some irregularities with respect to the signatures of LHC\n                    and Siong in the 1952 certificate. The plaintiffs called a handwriting expert,\n                    Mr Yap Bei Sing (“YBS”), to testify at the trial about the\n                    alleged irregularities. Surprisingly, during the trial, the plaintiffs changed\n                    their mind and decided not to call YBS to testify. No reasons were furnished to\n                    the court for this abrupt change of mind. The defendants asserted that an\n                    adverse inference should be drawn against the plaintiffs for failing to call YBS\n                    to testify after having listed him as a witness in these proceedings. They\n                    relied onTeng Ah Kow and Another v Ho Sek Chiu and\n                        Others[1993] 3 SLR(R) 43, where the court held at [28]\n                    that if a party fails to call a relevant witness without offering any\n                    explanation, the court is entitled to presume that such evidence will be\n                    unfavourable to the said party. In the present case, whether an adverse\n                    inference is drawn or not is quite academic for the simple reason that without\n                    YBS’s evidence, the plaintiffs, on whom the burden of proof lay, had\n                    nothing to corroborate their allegation on the alleged irregularities regarding\n                    the signatures in the 1952 certificate. 79     Leaving aside the plaintiffs’ lack of\n                    proof of irregularities, it is astounding that after having claimed in his AEIC\n                    at [38] that Siong impersonated his father in 1952, LW declared when he was\n                    cross-examined that he did not know whether or not there was any impersonation\n                    of LHC by Siong in 1952. The relevant part of the proceedings is as\n                    follows: QIs it your case that Lim Tian Siong impersonated Lim\n                            Hong Choon in 1952?.... AI do not know how to answer\n                                whether there was impersonation or not. QYour whole case. The only reason we are in court is\n                            because you say that Lim Tian Siong impersonated Lim Hong Choon. So I\n                            want to know since you brought us to court, did he impersonate Lim Hong\n                            Choon in 1952? AWell, what was stated there, in the documents,\n                            … there is a formerly used name, so as to whether there is this\n                            impersonation or not, and is someone behind it. Q…. Was there this impersonation in 1952? Yes\n                            or no? … AWell, I do not know how to explain, because\n                            according to the records there was the former name used by this person.So as to whether this is impersonation or not, I\n                                do not know how to explain. [emphasis added] 80     Mr Singh then made sure that LW\n                    understood what is meant by “impersonation” but LW maintained that\n                    he did not know how to explain whether Siong impersonated LHC in 1952. The\n                    relevant part of the proceedings is as follows: QImpersonation means that A pretends to be B,\n                            correct? AYes. Q…. Now that you have told us your\n                            understanding of the word “impersonation”, now that\n                            I’ve shown you the 1952 documents, please tell us, is it your\n                            evidence that in 1952, in this document at page 33, Lim Tian Siong\n                            impersonated Lim Hong Choon? “Yes” or “no”?\n                            Did he or did he not impersonate Lim Hong Choon? AI do not know how to explain whether this is ---\n                            because the --- impersonation or not. 81     Consistent with what LW had alleged in his\n                    AEIC, the plaintiffs pleaded in their Statement of Claim at [11] that\n                    Siong’s impersonation of LHC commenced in 1952. However, in their Opening\n                    Statement, it was asserted at [6] that Siong impersonated LHC when the latter\n                    left for China in 1959. The relevant part of the Opening Statement is as\n                    follows: After Lim Hong Choon … left for China in\n                            1959, Lim Tian Siong … assumed the identity of Lim\n                        Hong Choon … by impersonating Lim Hong Choon … as a partner of\n                        [Chop Hup Seng Huat]. From 1959, Lim Tian Siong (deceased) took\n                        all the shares belonging to Lim Hong Choon (deceased). [emphasis added] 82     When cross-examined on the inconsistency\n                    between his AEIC and the plaintiffs’ Opening Statement, LW attempted to\n                    salvage his case by saying that what he had really meant in his AEIC at [38] was\n                    that the impersonation beganafter1952. 83     Having testified that he did not know whether\n                    there was any impersonation in 1952 and that the impersonation occurredafter1952, LW appeared rather stressed when\n                    he was further questioned by Mr Singh. Suddenly, he said that he required a\n                    toilet break. When the trial resumed, LW admitted that during the toilet break,\n                    he had telephoned his son, Mr Lim Rong Ching, who had been in court to hear\n                    him give evidence. This led Mr Singh to suggest that LW had engineered the\n                    toilet break to find out how he should answer the question posed to him, a\n                    charge which LW denied. 84     When Mr Singh asked him once again\n                    whether the impersonation began in 1952, LW hesitated for an inordinately long\n                    time before saying that his lawyer will answer the question. When told that he\n                    could not pass the buck, LW decided to say that the impersonation began in 1952\n                    after all and he added that he would leave it to his lawyer to explain his new\n                    position. Thisvolte facedid not help LW as the\n                    new answer contradicted the plaintiffs’ Opening Statement, which claimed\n                    that the impersonation occurred in 1959. 85     In considering whether the very serious\n                    allegation of impersonation by Siong was proven, it must be borne in mind that\n                    apart from the impersonation theory offered by the plaintiffs, there are other\n                    possible explanations as to why the third person who was admitted into the\n                    partnership in 1952 was named “Lim Hong Choon alias Lim Tian\n                    Siong”. 86     To begin with, LW testified that it is a\n                    tradition in his family to use an alias for “connecting with\n                    forefathers”. If this is so, it was not odd for Siong to take his\n                    father’s name as an alias to connect himself to his father or as a mark of\n                    respect to the latter. It should not be overlooked that Siong was a partner of\n                    his uncle, LBW, in another partnership called Hoe Seng Huat (“other\n                    partnership”). In this other partnership’s documents, Siong also\n                    used “Lim Hong Choon” as his alias. When cross-examined, LW said\n                    that he was not making any claim that Siong’s shares in the other\n                    partnership belong to LHC. 87     The plaintiffs had assumed that Siong wanted\n                    to steal his father’s shares by using LHC’s name as an alias but\n                    Mr Singh pointed out that it is also possible that it was LHC who wanted\n                    Siong’s name added as his alias because he wanted to return to China. LY\n                    herself testified that LHC regarded China as his home because he had his wife\n                    and family there. Furthermore, LW conceded that it is possible that LHC and\n                    Siong had both signed the 1952 form in relation to the partnership, in which\n                    case Siong did not impersonate LHC. The relevant part of the proceedings is as\n                    follows: QAny of the following could have happened.Lim Hong Choon could havefilled in this form,\n                            signed under his own name, andasked Lim Tian Siong\n                                to sign under his own name; correct?…. AYes, it’s possible. [emphasis added] 88     Mr Singh submitted that even if LHC had\n                    been a partner in 1952, it cannot be ruled out that he and Siong had settled the\n                    question of ownership of the partnership shares before LHC’s return to\n                    China and one cannot assume that Siong had usurped his father’s shares in\n                    the absence of sufficient proof of this very serious allegation. It should not\n                    be overlooked that LHC, who had to depend on handouts from his brothers and\n                    Siong when he was in China, did not inform the plaintiffs, who were his primary\n                    caregivers in China, that he had shares in the partnership even though he and\n                    the plaintiffs had faced financial hardship and had, according to LW, to eat\n                    “thin porridge”. 89     A relevant question that was not properly\n                    answered by the plaintiffs concerns the persons whom Siong had intended to\n                    deceive by the alleged impersonation. At first, LW said that Siong did not\n                    impersonate “to anyone in particular”. However, his evidence on\n                    this matter shifted after an intense barrage of questions from Mr Singh.\n                    The relevant part of the proceedings is as follows: Q[S]o tell us, who was Lim Tian Siong impersonating\n                            to? In other words, who was he misleading?.... ANot to anyone in\n                                particular. QSo you accept that Lim Tian Siong did not\n                            impersonate to anyone, right? AWell that’s to Lim Hong Choon himself,not to anyone\n                        else…. QDo you remember … we went through the\n                            definition of “impersonation”?.... A pretends to be B to\n                            cheat others. Okay? AYes…. QRight, Who are these others, according to you, who\n                            Lim Tian Siong was trying to mislead by this form? AOf course it ….. was to\n                                mislead this Lim Hong Choon. QMr Lim, so you accept that no one else except\n                            … Lim Hong Choon was misled, right? AAnd also the others as\n                                well…. QSo who are these others? AThe others will refer to those who have the right to\n                            inherit the properties of Lim Hong Choon. [emphasis added] 90     What also merits attention is that LW agreed\n                    that it is possible that LBK and LBW had seen the entries in the 1952\n                    certificate before they signed the document. If this was so, they had seen and\n                    had not objected to the name “Lim Hong Choon alias Lim Tian Song”\n                    in the document. The plaintiffs accepted that LHC’s brother, LBW, was an\n                    honest man and a man of integrity and LY even went so far as to agree that the\n                    three brothers, LHC, LBK and LBW, would not have allowed anyone to cheat any one\n                    of their brothers. It follows that the mystery as to who Siong had tried to\n                    mislead by his alleged impersonation of LHC was not adequately addressed by the\n                    plaintiffs. Furthermore, as Mr Singh pointed out, if Siong’s\n                    objective was to impersonate his father in the records of the partnership in the\n                    1950s to mislead someone, there was no reason for him to continue to use\n                    LHC’s name as an alias in the context of official documents produced some\n                    20 years after the alleged impersonation. Yet the evidence is that he did\n                    so. 91     I will now deal with two other matters raised\n                    by the plaintiffs to support their case of impersonation. First, they pointed\n                    out that the prospectus issued by the company on 22 January 1994 in\n                    conjunction with its public listing, had stated as follows at p 33: Chop Hup Seng Huat, the forerunner of the Company was founded in 1941 as a\n                        partnership by Mr Lim Boon Wan and his two brothers, Mr Lim Boon\n                        Kee and Mr Lim Boon Hong [ie Lim Hong Choon]. 92     Siong’s son, LBC, explained in his AEIC\n                    at [35] that the above-mentioned passage in the prospectus “was meant as\n                    a mark of respect to the older generation and it was felt that it would not be\n                    right to single out LHC by omission”. This is quite different from the\n                    position he had taken in an earlier suit, Suit No 799 of 2006, which is that LHC\n                    transferred his shares in the partnership to Siong in 1959 before he left for\n                    China. In truth, LBC, like the plaintiffs, has no personal knowledge of events\n                    in 1952 or 1959 and his evidence as to what could have occurred in the 1950s,\n                    like that of the plaintiffs and LY, must be viewed as his speculation as to what\n                    might have occurred before he was born. What is clear is that the statement in\n                    the company’s prospectus as to who founded the partnership is inaccurate\n                    and is contrary to the official records maintained by the Accounting and\n                    Corporate Regulatory Authority of Singapore and its predecessor institutions.\n                    The company should be taken to task for printing inaccuracies in its\n                    prospectus. 93     Another point made by LW is that Siong was not\n                    competent to become a partner in 1952 as he was then only 20 years old. This\n                    assertion was not pleaded. In any case, the defendants rightly retorted that\n                    even if Siong was not competent to be a partner in 1952, this does not mean that\n                    his shares in the partnership automatically became LHC’s shares. In any\n                    case, even if the contract of partnership between Siong and his uncles was void\n                    in 1952, this did not mean that he did not become a partner after he reached the\n                    age of majority. I cannot hold that the fact that Siong was 20 years old proves\n                    that he impersonated LHC in 1952 or at any time thereafter. 94     To sum up, although LW and LY made a very\n                    serious allegation against Siong, their case was absolutely confusing and\n                    contradictory and it certainly did not meet the requirement stated inBater v Baterby Denning LJ as “a degree of\n                    probability which is commensurate with the occasion”. Evidently, all the\n                    possibilities discussed above as to what was the reason for the third partner to\n                    be named “Lim Hong Choon alias Lim Tian Siong” involve pure\n                    speculation and are referred to for the sole purpose of pointing out that in the\n                    absence of adequate proof of the serious allegation of impersonation, the court\n                    is in no position to make a finding that Siong had impersonated LHC either in\n                    1952 or at any time thereafter.",
        "The HupSteel shares": "95     For the sake of completeness, it ought to be\n                    noted that whether or not LHC had shares in the partnership, he had none in the\n                    company, which was renamed HupSteel in 2005. 96     Although the records of the company show that\n                    the shares in the company were allotted to “Lim Tian Siong”\n                    without the alias “Lim Hong Choon”, the plaintiffs insisted as\n                    follows in their Reply to the 1stand\n                        2nddefendants’ Defence at [12]: [L]im Tian Siong was only directly/indirectly able to register himself as\n                        an officer/director of Hup Seng Huat Pte Ltd by way of his impersonation and\n                        misrepresentation of LIM HONG CHOON in Chop Hup Seng Huat between 1952 and\n                        1972. 97     LW confirmed that it is his case that the\n                    HupSteel shares are part of LHC’s estate for two reasons. First, he\n                    alleged that the partnership assets were handed over to the company. Secondly,\n                    he claimed that all the shareholders of the company got their shares without\n                    having to pay any money because the partnership was converted to the\n                    company. 98     Contrary to what LW alleged, the\n                    partnership’s assets were not handed over to the company when the latter\n                    was established in 1973. Indeed, in 1975, the company, which wanted to purchase\n                    a property from the partnership, passed the following resolution: Resolved that the company do hereby purchase the property containing an\n                        area of 26,000 square feet from Mr Lim Boon Wan, the trustee of Chop\n                        Hup Seng Huat for $400,000. 99     LW admitted that the above mentioned property\n                    had been sold by the partnership to the company. When cross-examined by\n                    Mr Singh, he answered as follows: QSo … this property was not\n                                injected into the company on incorporation but was purchased almost\n                                two years later from the partnership at $400,000. You see\n                                that? AYes. Q[T]he seller was Lim Boon Wan as trustee of the\n                            partnership. You see that …? AYes…. QAnd it stands to reason that if\n                                the partnership sold any other assets to the company, the monies\n                                would have gone to the trustee as well. AI should think\n                            so. [emphasis added] 100    There was thus no basis for LW’s\n                    assertion that the assets of the partnership were absorbed by the company\n                    without any payment to the partnership. In fact, the partnership operated for\n                    another 10 years after the incorporation of the company before it was terminated\n                    in 1983. 101    LW’s allegation that the shareholders\n                    of the company got their shares free of charge because the company took over the\n                    partnership was also not substantiated. The evidence is that all the\n                    shareholders paid for their shares in cash when the company was incorporated.\n                    Siong paid $60,000 for his 600 shares. He was not a man without financial\n                    resources. Leaving aside his earnings from the partnership, Siong’s income\n                    tax returns at the material time revealed that he had just earned $78,396 from\n                    another partnership. Despite the evidence before him, LW stubbornly insisted\n                    that Siong used partnership money to pay for his shares. The relevant part of\n                    the cross-examination is as follows: QCan you say where the money came from for Lim Tian\n                            Siong to purchase the shares in the company? “Yes” or\n                            “no”? Can you say from your own knowledge? AYes. QTell me, where did it come from? AIt’s from Hup Seng Huat when it converted to a\n                            company instead. 102    When questioned further, LW was forced to\n                    admit he had no evidence that Siong had used partnership money to pay for his\n                    shares. The relevant part of the proceedings is as follows: Q[D]o you have any document which shows that the\n                            shares were subscribed using the monies from the partnership Hup Seng\n                            Huat? “Yes” or “no”? … APersonally, I do not have the\n                                documents to prove but over here, in there, there is evidence\n                                …. QMy question is, show us the evidence that the monies\n                            came from the partnership business. AI do not have … any\n                                evidence to show that the payment was from [the partnership]\n                                …. [emphasis added] 103    Admittedly, the company’s prospectus,\n                    which was issued in conjunction with its public listing in 1994, stated that the\n                    partnership was “converted” to the company. While this may have\n                    helped in projecting the image of the company, the statement is clearly wrong in\n                    the light of the evidence before the court. 104    As the company did not take over the assets\n                    of the partnership and as it was not established that Siong had used the\n                    partnership’s money to buy his shares in the company, Siong’s shares\n                    in the company had nothing do with shares in the partnership. As such, even if\n                    the plaintiffs are LHC’s children, they have no claim whatsoever to\n                    Siong’s shares in the company that are presently in the defendants’\n                    hands.",
        "Time Bar": "105    There is yet another reason why the\n                    plaintiffs’ claim for a part of LHC’s alleged shares in the\n                    partnership fails and this is that their claims are time-barred. 106    The plaintiffs framed their claim against\n                    the defendants as beneficiaries of LHC’s estate. This was confirmed when\n                    LW was cross-examined as follows: QMr Lim, this claim that you are bringing is a\n                            claim to a share or interest in the estate of Lim Hong Choon;\n                            correct? AThat’s correct. Q[Y]our co-plaintiff, Lim Yuyan, her claim too, is to\n                            a share or interest in the estate of Lim Hong Choon? AThat’s correct. 107    Section 23(a) of the Limitation Act\n                    (Cap 163, 1996 Rev Ed) provides for a limitation period of 12 years for\n                    claims such as that brought by the plaintiffs. It provides: 23    Subject to section 22(1), no action\n                        – (a)    in respect of any claim to the personal estate of\n                            a deceased person or to any share or interest in the estate, whether\n                            under a will or on intestacy, shall be brought after the expiration of\n                            12 years from the date when the right to receive the share or interest\n                            accrued. 108    LHC died in 1981. Admittedly, the right to\n                    receive a share or interest in the estate does not accrue until the funeral,\n                    testamentary and administration expenses have been paid: seeRe Estate of Tan Kow Kee[2007] 2 SLR(R) 417 at [24].\n                    In the present case, the funeral expenses had been paid long ago and no one has\n                    asserted that there are testamentary and administration expenses in China or\n                    Singapore. LW said that LHC had no money when he passed away and the house that\n                    LHC lived in belonged to a relative. In these circumstances, it may be assumed\n                    that the limitation period of 12 years provided for under s 23(a) of the\n                    Limitation Act expired long ago unless the plaintiffs can rely on s 22(1)\n                    of the said Act, which provides as follows: No period of limitation prescribed by this Act shall apply to an action by\n                        a beneficiary under a trust, being an action – (a)    in respect of any fraud or fraudulent breach of\n                            trust to which the trustee was a party or privy; or (b)    to recover from the trustee trust property or the\n                            proceeds thereof in the possession of the trustee, or previously\n                            received by the trustee and converted to his own use. 109    In regard to s 22(1) of the Limitation\n                    Act, the plaintiffs did not plead fraud and they did not adduce any evidence to\n                    prove the essential ingredients for a constructive trust, such as the presence\n                    of a fiduciary relationship or unconscionable conduct, so as to be in a position\n                    to rely on this statutory provision. All that LW was in fact telling the court\n                    is that it looked rather suspicious that the third partner who joined the\n                    partnership in 1952 was called “Lim Hong Choon alias Lim Tian\n                    Siong” and that the only explanation for this oddity must be that Siong\n                    impersonated LHC. Much more is required to suggest the existence of a\n                    constructive trust. The court cannot, on the basis of speculation as to what\n                    might have occurred in the 1950s, hold that Siong committed a fraud when, as has\n                    been explained, there are other plausible explanations as to why the third\n                    partner used the name “Lim Tian Siong alias Lim Hong Choon”. I\n                    thus agree with the defendants that the superficial pleading by the plaintiffs\n                    of an alleged impersonation of LHC by Siong is little more than a smokescreen\n                    for what are in effect time-barred claims.",
        "LW’S conduct and evidence at the Trial": "110    At this juncture, it must be noted that the\n                    plaintiffs’ claim against the defendants was seriously undermined by\n                    LW’s own conduct during the trial and by the evidence that he gave. On a\n                    number of occasions, he declined to answer important questions or elaborate on\n                    his answers, saying that he will leave it to his counsel to explain matters.\n                    Often enough, his evidence was peppered with inconsistencies, untrue and\n                    irrelevant statements. 111    LW’s conduct during the trial must be\n                    scrutinized. He was cross-examined on 11th and 12th January 2010. The\n                    cross-examination of LW had to be postponed on 13th January 2010 because\n                    LW’s counsel furnished to the court a medical certificate showing that he\n                    was unfit to attend the trial on that day due to hypertension and\n                    hospitalization. On the following day, LW’s counsel submitted yet another\n                    medical certificate stating that he was unfit to attend court on that day. To\n                    save time, LW’s wife, LY, and their expert witness, ZY, gave evidence\n                    while LW was on medical leave. LY and ZY completed their testimony by the time\n                    LW turned up in court on 15th January 2010. It is the defendants’\n                    case that the medical certificates were obtained by LW to enable LY and ZY to\n                    give evidence and thereafter brief LW on what they said before LW returned to be\n                    cross-examined again. 112    LW gave the court the impression that he had\n                    rested at the Mount Elizabeth Hospital while he was on medical leave for two\n                    days. When cross-examined, he said as follows: QSo would it be right to say that on 13 January,\n                            which was Wednesday, and on 14 January, which was yesterday, Thursday,you spent your entire time resting at the Mt\n                                Elizabeth Hospitaland had met two persons ie the two\n                            ladies you have identified? AYes. [emphasis added] 113    Contrary to what he said, LW did not spend\n                    the “entire time resting” in the hospital on 13 and\n                    14 January 2010. When further questioned, he admitted that on the first\n                    day, he went back to his hotel to “wash” himself although the\n                    hospital room had bathroom facilities. LW said that he stayed in his hotel for\n                    three hours with his wife, who completed giving her oral testimony on that\n                    day. 114    On the next morning, LW obtained another\n                    medical certificate to excuse his absence from the court for yet another day.\n                    Less than one and a half hours after the medical certificate had been presented\n                    to the court, LW checked out of the hospital at around 11.40 am and found time\n                    to visit a temple, after which he went shopping with his wife. Initially, LW\n                    insisted that he had checked out of the hospital in the afternoon at around 1 pm\n                    but he backtracked after he was informed that there was a video-tape of his\n                    movements at the hospital’s check-out counter. The following part of the\n                    proceedings reveals how evasive and incoherent LW was before he finally admitted\n                    that Mr Singh was right: QSo you don’t agree that at 11.40 you were\n                            checking out for the purpose of leaving Mt Elizabeth? Mr Lim,\n                            I ask you to think carefully because I’m telling you that we have\n                            a video, so you think very carefully. AWell, what happened was that this is one place that\n                            I was at. But then I was referred to another department to check on my\n                            heart arteries. And that was a separate place. QLet’s just focus on the first place that you\n                            were at. That first place you were at at 11.40 was to check out;\n                            correct? ANo, I really do not know whether\n                                to say that was actually the same hospital or\n                        not. QMr Lim, did you at 11 o’clockyesterdaymove to another hospital?...So\n                            let’s forget there’s another hospital. Let’s just\n                            focus on one hospital….At that first place at\n                                11.40 am, it had something to do with checking out, do you\n                                agree? AYes. QSo now we know that after\n                                obtaining an adjournment on the faith of the medical certificate\n                                … and not more than two hours later … despite your\n                                degenerated situation of severe hypertension, which had been\n                                diagnosed just two hours earlier, you are now as fit as a fiddle and\n                                walking out of the hospital. Would that be a fair way of putting\n                                it. AI do not know how to say\n                                it. [emphasis added] 115    LW next claimed that after he was discharged\n                    from the hospital, he rested in the hotel until he had to come to court the next\n                    morning. However, Mr Singh asserted that this was untrue because LW had\n                    left the hotel on 14 January 2010 to have dinner with his wife, his son and\n                    his expert witness, ZY, who had just given evidence on that day. When\n                    Mr Singh questioned him about this, the following answers show that LW was\n                    again rather evasive: QAnd then having recovered from your severe\n                            hypertension, you had dinner with your wife, your son who has been in\n                            court, and the expert witness that you had called, Madam Zhang\n                            Ying…. AI did not eat at\n                            all. Q…. Are you saying that at 8.30 pm yesterday\n                            you were not at the Element Chinese Restaurant with your wife, son and\n                            Madam Zhang Ying? AYes,for yesterdayI\n                            was with them,but not the previous\n                            day. QSo you see, Mr Lim, your purpose in getting\n                            these two certificates for the 13th and 14th was to enable your wife and\n                            the expert to give evidence and thereafter brief you before you came\n                            back to the stand. AI disagree. [emphasis added] 116    Apart from the controversy surrounding\n                    LW’s hospitalization, a few examples of his unsatisfactory evidence may be\n                    noted. For a start, LW’s evidence regarding the loan that he had tried to\n                    obtain from LBC in 2003, which is as follows, is quite unbelievable: QDo you agree that you asked my clients for a loan in\n                            the millions? AI\n                            disagree…. Q…. [M]y clients say that some time between\n                            2003 and 2006, you requested a loan from the 1st defendant, Lim Boh\n                            Chuan. Do you agree? AYes, I agree. Q[H]ow much was the amount? AI did not state the amount. And I\n                                only told him how much I owed\n                        people…. QAnd how much did you owe people?\n                                …. AA few million in Singapore\n                                currency. [emphasis added] 117    A question arises as to how LW, who,\n                    together with LY, was described by their counsel as “simple folk from a\n                    rural part of China”, managed to borrow a few million Singapore dollars\n                    in China. More astonishing is his testimony that he had borrowed the few million\n                    dollars from onlyonelender. What collateral did\n                    LW offer to this solitary lender in China for the loan of a few million\n                    Singapore dollars? 118    LW next claimed that although he was unable\n                    to obtain a loan from LBC, he has repaid the few million Singapore dollars that\n                    he had borrowed. How did LW, who had, until the death of LBW in 2003, been\n                    living on monthly hand-outs of $200 - $250 from his Singapore relatives, get a\n                    few million dollars to repay his loan? LW claimed that apart from the monthly\n                    handouts from his Singapore relatives, he had another source of income, namely a\n                    Chinese company, Hui Lei Stone Company Ltd (“Hui Lei”). He said\n                    that he had been receiving payments from Hui Lei since the 1980s. This cannot be\n                    true as he had stated in his AEIC at [22] that Hui Lei began its operations only\n                    in 1999. It is also to be noted that LW stated in his AEIC at [31] that he had\n                    assisted LBW for around 15 years to complete various projects in his hometown\n                    and that it was only after the completion of LHC’s mother’s\n                    graveyard that he decided to start his own business. He stated in his AEIC at\n                    [29] that he completed work on the said graveyard and the road leading to it in\n                    2001. It follows that LW could not have received money from Hui Lei from the\n                    1980s. 119    More startling is the fact that LW misled\n                    the court that he and his son owned Hui Lei. The relevant part of the\n                    cross-examination by Mr Singh, is as follows: QIs [Hui Lei] your business? AYes.A business that belonged to\n                                myself and my son. QIs that the truth, Mr Lim? AYes. QIsn’t this business owned\n                                by Hoe Seng Huat, a Singapore company? ANo. [emphasis added] 120    When LW was asked whether he had documents\n                    to prove that he is one of the owners of Hui Lei, his initial and irrelevant\n                    answer was that he wanted to show the court the medication given to him by the\n                    hospital. Subsequently, his counsel produced a Chinese document that merely\n                    stated that he is a director of Hui Lei. Mr Singh then revealed that in the\n                    official Chinese registry records, Hoe Seng Huat is named as the investor in the\n                    company and that there is no indication that LW owns Hui Lei. When asked to\n                    comment on these revelations, LW gave the following garbled answer: QNow, I would like to show you the search that we\n                            were hoping you would give us but which we had to do on your\n                            behalf…. You will see, Mr Lim, that as I told you and which\n                            you denied, this company is not owned by you, but by Hoe Seng Huat\n                            Hardware Company Private Limited of Singapore. Do you agree or disagree?\n                            … AWell, on paper, yes, it does say that. But then only\n                            the legal representative would be able to say. 121    On the following day, when LW was\n                    re-examined by his own counsel on the ownership of Hui Lei, he claimed for the\n                    first time that Hoe Seng Huat was named as the sole shareholder of Hui Lei for\n                    tax purposes and to make it easier for Hui Lei to obtain import and export\n                    licenses. LW’s new evidence was a contrived afterthought which, if true,\n                    should have been revealed when he was cross-examined by Mr Singh on the\n                    previous day. 122    Finally, although the plaintiffs had pleaded\n                    that they were entitled to two-thirds of LHC’s estate, LW contradicted his\n                    pleadings when he was cross-examined by claiming that he did not say that he\n                    wanted two-thirds and that he had told his lawyer that he wanted to recover what\n                    he deserved or was entitled to. However, when he was re-examined by his own\n                    counsel, Mr Irving Choh, he suddenly disclosed his intention to distribute\n                    to his China siblings their share of LHC’s estate. The relevant part of\n                    the proceedings is as follows: QAnd you were also referred to the fact that …\n                            you and the 2nd plaintiff are claiming a two-third share of the assets\n                            of Lim Hong Choon’s estate? …. AAmong the six of them, five are in China, and of\n                            these, two have passed away. One of them is not very much in contact.And because we have a view to settling this suit\n                                fast, if this is resolved through this suit, when I return to China,\n                                I would distribute. [emphasis added] 123    LW’s claim that he will distribute\n                    what he and his wife receive from LHC’s estate shows how adept he is at\n                    tailoring his evidence to suit his case. When cross-examined by Mr Singh,\n                    LW did not mention that he or LY claimed any part of LHC’s assets on\n                    behalf of his alleged siblings in China. Besides, if, as LW claims, he had three\n                    other siblings in China, the plaintiffs and his siblings in China should be\n                    claiming five-sixths and not two-thirds of LHC’s estate. 124    LW has only himself to blame for severely\n                    denting his own credibility when he was cross-examined by Mr Singh and\n                    re-examined by Mr Choh although it is worth noting that even if he did not\n                    do so, the claim brought by him and LY would have nonetheless have failed for\n                    the reasons already stated.",
        "Defendants’ other defences": "125    The defendants raised a number of other\n                    defences. First, they contended that the plaintiffs’ claim is barred by\n                    laches. Secondly, they asserted that the plaintiffs are not in a position to sue\n                    them because beneficiaries have no equitable or beneficial interest in any\n                    particular asset in an estate which has yet to be administered. Finally, they\n                    pointed out that as the distribution of a deceased person’s personal\n                    estate is, by virtue of s 4 of the Act, regulated by the law of the country\n                    in which he was domiciled at the time of his death and as no evidence had been\n                    adduced with respect to Chinese intestacy law, the plaintiffs have not proven\n                    that they are entitled to any share of LHC’s estate. In view of the\n                    findings which I have made earlier on in this judgment and of the hopelessness\n                    of the plaintiffs’ claim, it is unnecessary for me to consider the other\n                    defences referred to in this paragraph.",
        "Conclusion and Costs": "126    The findings which I have made may be\n                    summarized as follows: (i)     LW is not entitled to rely on the\n                        Act to claim a share of LHC’s estate as he did not prove that he is\n                        LHC’s adopted son. (ii)     LY is also not entitled to rely on the Act to claim a\n                        share of LHC’s estate as she did not prove that she is LHC’s\n                        legitimate daughter. (iii)     If LW is LHC’s adopted son and LY is LHC’s\n                        legitimate daughter, their claim against the defendants is\n                        time-barred. (iv)     It was not proven that Siong impersonated LHC in 1952 or at any time\n                        thereafter. (v)     The shares of the partners of the partnership were not converted to shares\n                        in the company when the company was formed in 1973. As such, even if the\n                        plaintiffs are LHC’s children, they have no claim in respect of\n                        Siong’s shares in the company. 127    For the stated reasons, the\n                    plaintiffs’ claim is dismissed with costs."
    }
}