{
    "case_title": "Sui Southern Gas Co Ltd\n      v\n      Habibullah Coastal Power Co (Pte) Ltd",
    "ncitation": "[2010] SGHC 62",
    "coram": "Judith Prakash J",
    "sections": {
        "Introduction": "1       The plaintiff, Sui Southern Gas Company Limited\n                    (“SSGC”), is a public sector limited company incorporated under\n                    the laws of Pakistan, whose principal business is that of a supplier of gas\n                    throughout the South Pakistan provinces of Sindh and Balochistan. The defendant,\n                    Habibullah Coastal Power Company (Private) Limited (“HCPC”), is a\n                    corporation organised under the laws of Pakistan. 2       By an Amended and Restated Gas Supply Agreement\n                    dated 31 March 1996 (“the Agreement”) between SSGC and HCPC\n                    (collectively “the parties”), relating to a power generation\n                    complex (“the Plant”) in Skeikh Manda near Quetta, in the\n                    Balochistan province of Pakistan, SSGC agreed to supply natural gas to HCPC in\n                    order to allow HCPC to generate electricity at the Plant. Pursuant to a Power\n                    Purchase Agreement with the Pakistan Water and Power Development Authority\n                    (“the Authority”), HCPC agreed to supply all the electricity\n                    produced at the Plant to the Authority. 3       Unfortunately, a dispute arose between SSGC and\n                    HCPC which they referred to arbitration, as required by the Agreement.\n                    Essentially, HCPC claimed that SSGC had breached the terms of the Agreement by\n                    failing to supply sufficient quantities of gas, causing HCPC to suffer a loss\n                    and thereby entitling it to damages under the Agreement. SSGC disputed this\n                    claim and averred that it had at all times complied with its obligations under\n                    the Agreement, and thus it had incurred no liability thereunder. Under the\n                    Agreement, the seat of arbitration was to be in Singapore and English law\n                    governed the conduct of the arbitration. The three-member Arbitral Tribunal\n                    (“the Tribunal”) rendered its award (“the Award”) on\n                    1 December 2008. The Award was in all material respects in HCPC’s\n                    favour. 4       This originating summons was taken out by SSGC\n                    in March 2009, SSGC sought an order that the Award be set aside pursuant to\n                        s 24(b) of the International Arbitration\n                    Act (Cap 143A, 2002 Ed) (“the Act”) and art 34 of the\n                    UNCITRAL Model Law on International Commercial Arbitration (“the Model\n                    Law”) which is set out in the First Schedule to the Act (which by virtue\n                    of s 3 of the Act has the force of law in Singapore). It did so on the\n                    grounds that: (a)     the Award dealt with disputes or\n                        issues not contemplated by or, alternatively, not falling within, the terms\n                        of the submission to arbitration and/or contained decision on matters or\n                        issues beyond the scope of the submission to arbitration, in breach of\n                            art 34(2)(a)(iii), Sch 1 of the\n                        Act (“the scope of submission argument”); (b)     the Award was in conflict with the\n                        public policy of Singapore, in breach of art 34(2)(b)(ii), Sch 1 of the Act (“the public policy\n                        argument”); and (c)     a breach of natural justice had occurred in connection with the\n                        making of the Award by which the rights of SSGC had been prejudiced, in\n                        violation of s 24(b) of the Act\n                        (“the natural justice argument”). 5       However, in written and oral submissions,\n                    counsel for SSGC rightly chose not to rely on the natural justice argument, and\n                    I shall say no more about that aspect of the application. 6       HCPC contested the application. After hearing\n                    the parties, I held that the application was to be dismissed, with costs as\n                    taxed or agreed to be paid by SSGC to HCPC, and the Award upheld because SSGC\n                    had not convinced me that any of its complaints was well-founded. I now set out\n                    the grounds of my decision.",
        "Background": "7       In December 1995, the Government of Pakistan\n                    increased the gas allocation to HCPC (“Gas Allocation”) for the\n                    purposes of allowing HCPC to generate electricity at the Plant, which HCPC would\n                    then supply to the Authority. The Gas Allocation was to be 21 million standard\n                    cubic feet (“MMCF”) of natural gas on a “firm basis”\n                    and an additional 4 MMCF on an “as and when available\n                    basis”. 8       The Agreement was the means by which the Gas\n                    Allocation was to be implemented. Pursuant to arts 3.1 and 3.2 of the Agreement,\n                    SSGC was obliged to supply all of the Plant’s requirements for natural\n                    gas, to the extent of the “Daily Contract Quantity”. Pursuant to\n                    art 1.23 of the Agreement, the “Daily Contract Quantity” was\n                    21 MMCF of natural gas per day, plus the “Additional Allocation\n                    Gas”, subject to availability, of 4 MMCF per day. 9       The delivery of all such quantities of natural\n                    gas was pursuant to the “Delivery Priority”, which was defined in\n                    art 1.25 as: [HCPC’s] right to receive and [SSGC’s] obligation to deliver\n                        Gas on a priority basis, consistent with [HCPC’s] Gas Allocation, such\n                        that deliveries to the [Plant] will be the last non-residential deliveries\n                        on [SSGC’s] pipeline system to be curtailed or reduced in the event of\n                        a reduction or curtailment of deliveries on [SSGC’s] pipeline system;\n                        provided, further, [HCPC] will be the first non-residential customer to have\n                        deliveries restored when the conditions which caused the reduction or\n                        curtailment are abated or remedied. The term “pipeline system” was not, however, defined in\n                    the Agreement, and was one of the disputed matters before the\n                Tribunal. 10     Since 2000, SSGC had on a number of occasions\n                    limited (or “curtailed”) the amount of gas supplied to the Plant,\n                    which caused HCPC to have to burn alternative fuel in order to meet its\n                    obligations to the Authority and, on occasion, to pay liquidated damages to the\n                    Authority. It was as a result of these events that HCPC had claimed damages for\n                    breach of contract against SSGC in the arbitration.",
        "The Award": "11     The Tribunal, in para 4.6 of the Award,\n                    set out a list of 8 issues which it had to determine: (a)SSGC’s obligation to provide gas, on a true\n                            construction of the Agreement;(b)Whether SSGC had complied with that\n                            obligation;(c)To the extent that it did not, whether it had a\n                            contractually permitted excuse in respect of each\n                        curtailment;(d)To the extent that SSGC had not met its\n                            obligation to provide gas or honour its Delivery Priority, whether such\n                            failure was excused by the practical limitation imposed by the pipelines\n                            and equipment SSGC had employed;(e)To the extent that SSGC had not met its\n                            obligation to provide gas, and had no contractually permitted excuse,\n                            whether HCPC was entitled to claim damages;(f)To the extent that SSGC was in breach of its\n                            obligations under the Agreement, whether HCPC was entitled to a defence\n                            of set-off;(g)If SSGC was not in breach of the Agreement,\n                            whether HCPC was in breach of the Agreement by effecting a\n                            set-off;(h)Whether the Tribunal should grant the damages and\n                            declarations sought by HCPC.12     The Tribunal ruled in favour of HCPC, and it\n                    is necessary to set out a summary of the material aspects of the Award which\n                    SSGC sought to impugn. In para 12 of the Award, the Tribunal declared\n                    that:(a)SSGC had breached its obligations to supply the\n                            Daily Contract Quantity pursuant to the Agreement;(b)SSGC was obliged to deliver 21 MMCF per day to\n                            HCPC save where there was a valid circumstance of Force Majeure (invoked\n                            in compliance with the notice provisions of art 13 of the\n                            Agreement), Emergency, or other contractually permitted excuse under\n                            arts 3.2(b), 9.6 and 12 of the\n                            Agreement;(c)SSGC was obliged to deliver an additional 4 MMCF\n                            per day save where there was a valid circumstance of Force Majeure\n                            (invoked in compliance with the notice provisions of art 13 of the\n                            Agreement), Emergency, or other contractually permitted excuse under\n                            arts 3.2(b), 9.6 and 12 of the Agreement,\n                            or where there was insufficient gas in SSGC’s pipeline system (as\n                            defined in para (e) below) to provide the additional 4 MMCF per\n                            day, once residential demand had been satisfied;(d)in circumstances where there was insufficient gas\n                            to satisfy the obligation to provide 25 MMCF per day to HCPC, SSGC was\n                            only entitled to curtail supplies to HCPC:(i)once all other non-residential users on\n                                    the pipeline system had been so curtailed; and(ii)to the extent necessary to supply gas to\n                                    residential customers, such curtailment not relieving SSGC of\n                                    its obligation to supply 21 MMCF per day, and a further 4 MMCF,\n                                    save where such 4 MMCF was not available, having applied the\n                                    Delivery Priority;(e)the terms “pipeline systems” and\n                            “systems” as used in the Agreement encompassed the\n                            entirety of SSGC’s pipeline system, and were not restricted to any\n                            particular province or other geographical area.13     In the Award, the Tribunal expressed a view as\n                    to whether the practical limitations imposed by the pipelines and equipment SSGC\n                    had chosen to employ excused its failure to meet its obligations under the\n                    Agreement (as interpreted by the Tribunal). The Tribunal was satisfied that no\n                    practical limitations excused such failure, and at para 7.3 of the Award,\n                    the Tribunal declared that:On the evidence, the following steps could also be taken to increase the\n                        system’s capacity:(a)as Mr. Ghaznavi admits, operate the system at\n                            a higher pressure;(b)add an extra loop of pipeline between Dadhar and\n                            Abe Gum;(c)add a compressor at RS-1 and Nuttal;(d)make gas from Zamzama field\n                        available;(e)reduce amount of gas transported South to\n                            Karachi;(f)install storage components and\n                        linepacking;(g)stop taking on more customers than it can satisfy\n                            demand for – as it is contractually mandated not to\n                        do.14     SSGC contended that the Award, and in\n                    particular the declaration set out in[12]above, was perverse, as it contained manifestly gross errors of law and imposed\n                    impossible obligations on SSGC. As such, SSGC submitted, the Award should be set\n                    aside.Perversity and irrationality15     In its submissions, SSGC relied heavily on the\n                    contention that the Award was perverse, manifestly unreasonable and irrational,\n                    and should therefore be set aside. SSGC deployed this argument in two\n                    ways.16     In oral arguments before me, SSGC relied on it\n                    as an independent ground on which the Award could be challenged: counsel for\n                    SSGC submitted that the various circuits of the United States courts of appeal\n                    had recognised that a “manifest disregard of the law” could\n                    justify vacating an arbitration award. In support of the submission, counsel\n                    citedMerrill Lynch, Pierce, Fenner & Smith, Inc. v Jack\n                        Bobker808 F 2d, 930 (2ndCir, 1986)\n                    at 933 andArthur H. Williams v Cigna Financial Advisors\n                        Incorporated197 F 3d, 752\n                        (5thCir, 1999) at 757. Counsel for SSGC urged me\n                    to recognise that, while mere errors of law committed by an arbitral tribunal in\n                    the course of rendering an award could not invite the court’s\n                    intervention, the court could nonetheless exercise a supervisory power when the\n                    award was so manifestly unreasonable that no reasonable person could have so\n                    decided.17     In essence, counsel for SSGC was asking me to\n                    recognise that the court could, independently of the Act, set aside arbitral\n                    awards which were “Wednesburyunreasonable” (seeAssociated Provincial Picture\n                        Houses v Wednesbury Corporation[1948]\n                    1 KB 223).18     This contention was untenable as a matter of\n                    principle and authority. Although the court undoubtedly has, on judicial review,\n                    a power to quash an administrative decision when its substantive merits are so\n                    absurd that no sensible person could have made that decision, I was of the view\n                    that no such power is available where the decision in question is made by an\n                    arbitral tribunal. This is because there is no appropriate analogy between\n                    administrative and arbitral decisions. Review forWednesburyunreasonableness or irrationality exists because it\n                    is presumed that, when Parliament gives an administrative decision-maker a\n                    discretion, that discretion is not unfettered; rather, Parliament intends that\n                    that discretion be exercised reasonably: see HWR Wade and CF Forsyth,Administrative Law(Oxford University Press,\n                        9thed, 2004), pp 349 – 365. This\n                    presumption of rationality, however, finds no purchase in the context of private\n                    arbitrations, where parties have contractually agreed to abide by the decision\n                    of the arbitral tribunal. Parties must therefore be held to that agreement, in\n                    the absence of any of the specific grounds for challenging an award set out by\n                    Parliament in the Act. The ability to challenge an award for unreasonableness or\n                    irrationality is not a ground set out in the Act.19     It is settled law that in Singapore, the Act\n                    provides the exclusive means by which a disappointed party to the arbitration\n                    may challenge the eventual award:PT Asuransi Jasa Indonesia\n                        (Persero) v Dexia Bank SA[2007] SLR(R) 513\n                        (“PT Asuransi”) at [54] - [55]\n                    and [57] andSoh Beng Tee & Co Pte Ltd v Fairmount\n                        Development Pte Ltd[2007] 3 SLR(R) 86 at [60] -\n                    [66].20     As Alan Redfern and Martin Hunter,Law and Practice of International Commercial Arbitration(Sweet & Maxwell, 4thed, 2004) point out at\n                    9-35:…there is no provision in the Model Law for any form of appeal from\n                        an arbitral award, on the law or on the facts, orfor any\n                            judicial review of the award on its merits. If the tribunal\n                        has jurisdiction, the correct procedures are followed and the correct\n                        formalities are observed, the award – good, bad or indifferent –\n                        is final and binding on the parties.[emphasis added]21     As the Model Law has the force of law in\n                    Singapore (see[4]), it was not open to me to\n                    set aside the Award on the freestanding ground that its substantive decision on\n                    the merits was outrageous or irrational. The position of the courts in the\n                    United States was adopted against a different legislative and legal background\n                    and could not influence the decision here. Although counsel for SSGC submitted\n                    that a perverse award went beyond a mere mistake of fact or law (against which\n                    there is no right of appeal under the Act), I was of the view that any alleged\n                    perversity of the Award was nonetheless ultimately a question of whether the\n                    Tribunal had committed an error of law (e.g. by subjecting the Agreement to an\n                    irrational construction) and/or an error of fact (e.g. by ignoring or\n                    misunderstanding the factual matrix surrounding the dispute). Such an error of\n                    law or fact, if indeed committed, did not cease to be such even if the error was\n                    gross and manifest.22     Since any alleged perversity or irrationality\n                    of the Award would still, in the final analysis, have involved errors of law or\n                    fact, on the plain wording of the Act and on the authorities cited in[19]and[20]above, there could be no right of appeal against such errors, independent of\n                    s 24 and art 34 of Sch 1 of the Act.23     The main thrust of SSGC’s submissions,\n                    however, was thatbecausethe Award was perverse\n                    or irrational, it wasfor that reasonoutside the\n                    scope of submission to arbitration and contrary to public policy and therefore\n                    subject to challenge under art 34(2)(a)(iii)\n                    and 34(b)(ii) of Sch 1 of the Act. My reasons\n                    for rejecting this contention are set out below.The statutory provisions24     As I explained inABC Co v\n                        XYZ Co Ltd[2003] 3 SLR(R) 546 at [3], art 34,\n                    Sch 1 of the Act deals with the recourse that a party to an arbitration has\n                    when he is not satisfied with an arbitral award. Article 34(1) makes it clear\n                    that recourse to a court against an arbitral award may be madeonlyby an application for setting aside in accordance\n                    with para (2) and para (3) of the article.25     The provisions which SSGC relied on\n                    read:(2)    An arbitral award\n                            may be set aside by the court specified in Article 6 only\n                        if:(a)    the party making the application furnishes\n                                proof that:…(iii)   the award deals with a dispute not\n                                    contemplated by or not falling within the terms of the\n                                    submission to arbitration, or contains decisions on matters\n                                    beyond the scope of the submission to arbitration, provided\n                                    that, if the decisions on matters submitted to arbitration can\n                                    be separated from those not so submitted, only that part of the\n                                    award which contains decisions on matters not submitted to\n                                    arbitration may be set aside; or…(b)    the court finds\n                                that:…(ii)   the award is in conflict with the public\n                                    policy of this State.The scope of submission argument26     SSGC submitted that in reaching the\n                    conclusions that it did in the Award, the Tribunal construed the Agreement so as\n                    to impose impossible obligations on SSGC which could not fit into any possible\n                    and rational interpretation of the Agreement. Consequently, SSGC submitted, the\n                    Award perversely went beyond the Agreement, and dealt with “a dispute not\n                    contemplated by or not falling within the terms of the submission to\n                    arbitration”, or contained “decisions on matters beyond the scope\n                    of the submission to arbitration”.27     SSGC’s complaint was that the Award, by\n                    construing the term “pipeline system” as meaning the entirety of\n                    SSGC’s network of pipes, rather than restricting it by geographical\n                    locality to the Quetta pipeline, imposed an obligation on SSGC to upgrade its\n                    pipeline system by,inter alia, expanding the\n                    pipelines, laying new pipes, diverting additional supplies of gas from\n                    alternative gas fields and reconfiguring the flow of gas supplied by SSGC to\n                    other regions in Pakistan. These, contended SSGC, amounted to “impossible\n                    obligations” as it was physically, administratively and/or economically\n                    impossible for SSGC to carry out these tasks, due to a variety of constraints\n                    including: strict oversight by the Oil and Gas Regulatory Authority of Pakistan\n                    (which would not approve the requisite capital expenditure); the impossibility\n                    of reversing gas flowing southwards to Karachi so as to supply gas northwards to\n                    Quetta; and the physical inability, due to the limited capacity of the existing\n                    pipes, of SSGC to cope with additional demand due to long-term unforeseeable\n                    population growth and short-term spikes in gas consumption by residential users\n                    in the winter months.28     In addition, SSGC contended that the Award was\n                    made in manifest disregard of the applicable principles of English law, insofar\n                    as the Award stated correct principles of English law but did not apply them. In\n                    particular, despite acknowledging that the Agreement had to be construed in the\n                    context of the matrix of facts (including background knowledge available to the\n                    parties at the time of contracting) and business common sense, the Award\n                    allegedly ignored these matters in construing the term “pipeline\n                    system” to mean SSGC’s entire network of pipes, rather than the\n                    Quetta pipeline.29     I did not agree with SSGC that the Award was\n                    outside the scope of the submission to arbitration.The law30     The law in this area was examined by the Court\n                    of Appeal inPT Asuransi, where the appellant\n                    sought to set aside an arbitral award on the ground that it dealt with disputes\n                    or issues not falling within the terms of submission to arbitration, in breach\n                    of art 34(2)(a)(iii), Sch 1 of the Act.\n                    In particular, the appellant contended that three critical findings made during\n                    the arbitration proceedings (“the Second Arbitration”) were\n                    inconsistent with the findings of an earlier arbitration (“the First\n                    Arbitration”) between the same parties, and therefore went beyond the\n                    scope of submission to arbitration.31     At [37] of the Court of Appeal’s\n                    judgment, Chan Sek Keong CJ noted that art 34(2)(a)(iii), Sch 1 of the Act “merely reflects the basic\n                    principle that an arbitral tribunal has no jurisdiction to decide any issue not\n                    referred to it for determination by the parties”. Chan CJ then\n                    quotedLondon and North Western and Great Western Joint\n                        Railway Companies v JH Billington, Limited[1899] AC 79, where Lord Halsbury stated at 81 that:I do not think any lawyer could reasonably contend that, when parties are\n                        referring differences to arbitration, under whatever authority that\n                        reference is made, you could for the first time introducea new difference after the order of arbitration was made…[emphasis by Chan CJ]32     In the course of its judgment, the Court of\n                    Appeal had to consider whether a particular issue (“the June 2001\n                    meeting”) was within the jurisdiction of the tribunal presiding over the\n                    First Arbitration (“the First Tribunal”). Chan CJ applied\n                    Lord Halsbury’s test at [40] of the judgment to hold that the June 2001\n                    meeting, being “a new differencearising\n                    after the First Tribunal had been constituted” (original emphasis), was\n                    not an issue within the original submission to arbitration, as such a new\n                    difference would have been “outside the scope of the submission to\n                    arbitration and accordingly would have beenirrelevant to the\n                        issues requiring determinationin the First Arbitration.”\n                    (original emphasis)33     After holding at [26] of the judgment that the\n                    first critical finding made by the subsequent tribunal (“the Second\n                    Tribunal”) in the course of the Second Arbitration was irrelevant to the\n                    appeal, the Court of Appeal then had to consider whether the second and third\n                    critical findings were within the scope of submission to arbitration of the\n                    Second Tribunal. This, Chan CJ held at [44] of the judgment, required the\n                    court to enter two separate but related enquiries:…first, the ascertainment of the matters that were within the scope\n                        of submission to the Second Tribunal; and second, whether the second and\n                        third critical findings involved such matters.34     Cumulatively, these passages fromPT Asuransimake it clear that the correct approach to\n                    be adopted, in response to a claim that an arbitral award (or part thereof) was\n                    not within the scope of submission to arbitration, is for the court to\n                    ascertain:(a)     the matters which were within the\n                        scope of submission to the arbitral tribunal; and(b)     whether the arbitral award (or the\n                        part being impugned) involved such matters, or whether it was a “new\n                        difference” which would have been “irrelevant to the issues\n                        requiring determination” by the arbitral\n                tribunal.Application35     The matters within the scope of submission\n                    were set out in[11]above, and one such\n                    matter was whether SSGC’s breach of its obligations under the Agreement\n                    was excused by reason of the practical constraints imposed by the equipment SSGC\n                    was utilising.36     Consequently, the Award clearly involved that\n                    matter. As HCPC submitted, theissueof whether\n                    SSGC was required by the Agreement to upgrade or reconfigure its pipeline system\n                    in order to maintain sufficient gas supplies to HCPC, as well as the very\n                    definition of the term “pipeline system”, was well within the\n                    scope of submission to the Tribunal. It could not be said that this issue was anew difference irrelevant to the issues requiring\n                        determinationby the Tribunal, when it was precisely one of the\n                    issues the Tribunal had to, and did, consider.37     SSGC’s argument was not strengthened by\n                    its contention that the Tribunal’s pronouncements on this issue involved a\n                    perverse and irrational construction of the Agreement, and resulted in\n                    impossible obligations being imposed on SSGC. Art 34(2)(a)(iii), Sch 1 of the Act, as Chan CJ explained inPT Asuransi, is concerned with the\n                    jurisdiction of an arbitral tribunal to decide certain matters – it is not\n                    concerned with the substantive correctness of the arbitral tribunal’s\n                    subsequent decision on a matter that was properly within its jurisdiction. If an\n                    issue is firmly within the scope of submission to arbitration, I fail to see how\n                    it can be taken outside the scope of submission to arbitration simply because\n                    the arbitral tribunal comes to a wrong, even manifestly wrong, conclusion on it.\n                    As I emphasised to counsel during the oral argument, the setting aside\n                    provisions of the Model Law relate primarily to ensuring that the process of the\n                    arbitration is fair. They are not concerned with the substantive\n                outcome.38     As for SSGC’s complaint that the Award\n                    was made in manifest disregard of the applicable principles of English law, this\n                    too was unsuccessful. Where an arbitral tribunal correctly states but misapplies\n                    the law, this is an error of law (and does not cease to be such even if the\n                    error is gross or egregious), in respect of which no challenge lies under the\n                    Act:PT Asuransiat [57]. Insofar as SSGC alleged\n                    that the Tribunal ignored “the matrix of facts”, this was an\n                    allegation that the Tribunal committed an error of fact, in respect of which\n                    there is also no remedy under the Act:PT Asuransiat [57]. Neither contention has any effect on the scope of submission to\n                    arbitration.39     In any event, I should emphasise that I was\n                    not at all convinced that the Tribunal had construed the Agreement irrationally\n                    or disregarded the applicable principles of English law. The Tribunal was fully\n                    entitled to prefer HCPC’s contentions to SSGC’s after having had the\n                    benefit of extensive submissions and expert evidence with regard to whether it\n                    was necessary to limit the meaning of the term “pipeline system”\n                    to a particular geographical location, and whether it was possible or feasible\n                    to upgrade and/or reconfigure SSGC’s pipeline system, and it did not\n                    thereby act irrationally, or erroneously disregard the factual matrix\n                    surrounding the dispute. Even assuming, however, that this had been the case, as\n                    I have explained in[37]-[38]above, an irrational decision would not have\n                    deprived the Tribunal of the jurisdiction it plainly had to make that decision,\n                    anda fortioria merely erroneous\n                one.40     It also appeared to me what SSGC was asking me\n                    to do was to delve into the facts and the evidence and the submissions in order\n                    to conclude that the Tribunal had erred in both law and fact. I was not only\n                    disinclined to pursue such a course; I was not empowered to do so. The Act does\n                    not allow appeals.41     For these reasons, I was not persuaded that\n                    the Award was outside the scope of submission to arbitration.The public policy argument42     SSGC canvassed the same arguments in\n                    submitting that the Award contained decisions on matters which were in conflict\n                    with the public policy of Singapore, in breach of art 34(2)(b)(ii), Sch 1 of the Act. In short, SSGC contended\n                    that public policy required that arbitral awards could not be so perverse and\n                    manifestly unreasonable that no reasonable tribunal could conclude that\n                    way.43     I did not accept that the Award could be set\n                    aside on the basis of art 34(2)(b)(ii),\n                    Sch 1 of the Act.The law44     As I stated inVV v\n                        VW[2008] 2 SLR(R) 929 at [17], assertions of breach of\n                    public policy cannot be vague and generalised. It is incumbent on a party\n                    seeking to challenge an award on this ground to identify the public policy which\n                    the award allegedly breaches and to show which part of the award conflicts with\n                    that public policy:John Holland Pty Ltd (formerly known as\n                        John Holland Construction & Engineering Pty Ltd) v Toyo Engineering Corp\n                        (Japan)[2001] 1 SLR(R) 443 at [25].45     No particular public policy of Singapore was\n                    identified by SSGC as having been embarrassed by the Award, and in my judgment,\n                    the public policy argument failed on this threshold point. Indeed, even on the\n                    assumption that SSGC’s criticisms of the Award were well-founded, it is\n                    difficult to see what particular public policy could be so\n                identified.46     Counsel for SSGC submitted that, following the\n                    Court of Appeal’s statements inPT Asuransiat [59], public policy would operate when upholding an arbitral award would\n                    “shock the conscience”, and that it would “shock the\n                    conscience” that the Award required HCPC to be supplied with gas for its\n                    commercial purposes when SSGC lacked sufficient gas to supply to residential\n                    users in order that they could keep themselves warm in winter.47     This contention was misconceived. Paragraphs\n                    5.25 and 5.26 of the Award clearly stated that under the Agreement, residential\n                    users were to have priority over HCPC’s Gas Allocation. Further, a fuller\n                    citation of the relevant paragraphs of the Court of Appeal’s judgment inPT Asuransiwill reveal that the public policy\n                    argument could not succeed:57    …The legislative policy under the Act is to\n                            minimise curial intervention in international arbitrations. Errors of\n                            law or fact made in an arbitral decision,per\n                                se, are final and binding on the parties and may not be\n                            appealed against or set aside by a court except in the situations\n                            prescribed under s 24 of the Act and Art 34 of the Model Law.\n                            While we accept that an arbitral award is final and binding on the\n                            parties under s 19B of the Act, we are of the view that the Act\n                            will be internally inconsistent if the public policy provision in\n                            Art 34 of the Model Law is construed to enlarge the scope of curial\n                            intervention to set aside errors of law or fact. For consistency, such\n                            errors may be set aside only if they are outside the scope of submission\n                            to arbitration. In the present context,errors of law\n                                or fact,per se, do not engage the public policy of Singapore under\n                                Art 34(2)(b)(ii) of the Model Law when they cannot be set aside\n                                under Art 34(2)(a)(iii) of the Model\n                        Law.…59    Although the concept\n                            of public policy of the State is not defined in the Act or the Model\n                            Law, the general consensus of judicial and expert opinion is that public\n                            policy under the Act encompasses a narrow scope. In our view, it should\n                            only operate in instances where the upholding of an arbitral award would\n                            “shock the conscience” (seeDowner\n                                Connect([58]supra) at\n                            [136]), or is “clearly injurious to the public good or …\n                            wholly offensive to the ordinary reasonable and fully informed member of\n                            the public” (seeDeutsche Schachbau v Shell\n                                International Petroleum Co Ltd[1987] 2 Lloyds’ Rep\n                            246 at 254,perSir John Donaldson MR), or\n                            where it violates the forum’s most basic notion of morality and\n                            justice: seeParsons & Whittemore Overseas Co Inc\n                                v Societe Generale de L’Industrie du Papier (RAKTA)508 F 2d, 969 (2ndCir, 1974) at 974. This\n                            would be consistent with the concept of public policy that can be\n                            ascertained from the preparatory materials to the Model Law. As was\n                            highlighted in the Commission Report (A/40/17), at para 297\n                            (referred to inA Guide to the UNCITRAL Model Law on\n                                International Commercial Arbitration: Legislative History and\n                                Commentaryby Howard M Holtzmann and Joseph E Neuhaus\n                            (Kluwer, 1989) at 914):In discussing the term ‘public policy’, it was understood\n                            that it was not equivalent to the political stance or international\n                            policies of a State but comprised thefundamental\n                                notions and principles of justice… It was\n                            understood that the term ‘public policy’, which was used in\n                            the 1958 New York Convention and many other treaties, covered\n                            fundamental principles of law and justice in substantive as well as\n                            procedural respects. Thus, instances such ascorruption,bribery or\n                                fraudand similar serious cases would constitute a ground\n                            for setting aside.[Original emphasis in italics; emphasis added in\n                    bold]48     It is clear, therefore, that in order for SSGC\n                    to have succeeded on the public policy argument, it had to cross a very high\n                    threshold and demonstrate egregious circumstances such as corruption, bribery or\n                    fraud, which would violate the most basic notions of morality and justice.\n                    Nothing of the sort had been pleaded or proved by SSGC, and its ambiguous\n                    contention that the Award was “perverse” or\n                    “irrational” could not, of itself, amount to a breach of public\n                    policy.49     Further, as I have held in[41]above that the Award could not be set aside\n                    under art 34(2)(a)(iii), Sch 1 of the\n                    Act, it follows from [57] ofPT Asuransithat the\n                    Award could not be set aside under art 34(2)(b)(ii), Sch 1 of the Act either.50     Therefore, I did not accept the public policy\n                    argument advanced by SSGC.Conclusion51     In sum, I dismissed SSGC’s application\n                    to set aside the Award because I did not think the Award was perverse and\n                    manifestly unreasonable, and even if it was, there was no provision in the Act\n                    which enabled me to set aside the Award on that groundper\n                        se. Further, I was not convinced that, even if it could be said\n                    that the Award was perverse, SSGC had demonstrated that the Award was outside\n                    the scope of submission to arbitration (and therefore in breach of\n                        art 34(2)(a)(iii), Sch 1 of the Act)\n                    and/or that the Award was in conflict with the public policy of Singapore (and\n                    therefore in breach of art 34(2)(b)(ii),\n                    Sch 1 of the Act).52     In view of my conclusion, since SSGC had\n                    failed in its application, I ordered that it should pay costs to HCPC as taxed\n                    or agreed.",
        "Perversity and irrationality": "15     In its submissions, SSGC relied heavily on the\n                    contention that the Award was perverse, manifestly unreasonable and irrational,\n                    and should therefore be set aside. SSGC deployed this argument in two\n                    ways. 16     In oral arguments before me, SSGC relied on it\n                    as an independent ground on which the Award could be challenged: counsel for\n                    SSGC submitted that the various circuits of the United States courts of appeal\n                    had recognised that a “manifest disregard of the law” could\n                    justify vacating an arbitration award. In support of the submission, counsel\n                    citedMerrill Lynch, Pierce, Fenner & Smith, Inc. v Jack\n                        Bobker808 F 2d, 930 (2ndCir, 1986)\n                    at 933 andArthur H. Williams v Cigna Financial Advisors\n                        Incorporated197 F 3d, 752\n                        (5thCir, 1999) at 757. Counsel for SSGC urged me\n                    to recognise that, while mere errors of law committed by an arbitral tribunal in\n                    the course of rendering an award could not invite the court’s\n                    intervention, the court could nonetheless exercise a supervisory power when the\n                    award was so manifestly unreasonable that no reasonable person could have so\n                    decided. 17     In essence, counsel for SSGC was asking me to\n                    recognise that the court could, independently of the Act, set aside arbitral\n                    awards which were “Wednesburyunreasonable” (seeAssociated Provincial Picture\n                        Houses v Wednesbury Corporation[1948]\n                    1 KB 223). 18     This contention was untenable as a matter of\n                    principle and authority. Although the court undoubtedly has, on judicial review,\n                    a power to quash an administrative decision when its substantive merits are so\n                    absurd that no sensible person could have made that decision, I was of the view\n                    that no such power is available where the decision in question is made by an\n                    arbitral tribunal. This is because there is no appropriate analogy between\n                    administrative and arbitral decisions. Review forWednesburyunreasonableness or irrationality exists because it\n                    is presumed that, when Parliament gives an administrative decision-maker a\n                    discretion, that discretion is not unfettered; rather, Parliament intends that\n                    that discretion be exercised reasonably: see HWR Wade and CF Forsyth,Administrative Law(Oxford University Press,\n                        9thed, 2004), pp 349 – 365. This\n                    presumption of rationality, however, finds no purchase in the context of private\n                    arbitrations, where parties have contractually agreed to abide by the decision\n                    of the arbitral tribunal. Parties must therefore be held to that agreement, in\n                    the absence of any of the specific grounds for challenging an award set out by\n                    Parliament in the Act. The ability to challenge an award for unreasonableness or\n                    irrationality is not a ground set out in the Act. 19     It is settled law that in Singapore, the Act\n                    provides the exclusive means by which a disappointed party to the arbitration\n                    may challenge the eventual award:PT Asuransi Jasa Indonesia\n                        (Persero) v Dexia Bank SA[2007] SLR(R) 513\n                        (“PT Asuransi”) at [54] - [55]\n                    and [57] andSoh Beng Tee & Co Pte Ltd v Fairmount\n                        Development Pte Ltd[2007] 3 SLR(R) 86 at [60] -\n                    [66]. 20     As Alan Redfern and Martin Hunter,Law and Practice of International Commercial Arbitration(Sweet & Maxwell, 4thed, 2004) point out at\n                    9-35: …there is no provision in the Model Law for any form of appeal from\n                        an arbitral award, on the law or on the facts, orfor any\n                            judicial review of the award on its merits. If the tribunal\n                        has jurisdiction, the correct procedures are followed and the correct\n                        formalities are observed, the award – good, bad or indifferent –\n                        is final and binding on the parties. [emphasis added] 21     As the Model Law has the force of law in\n                    Singapore (see[4]), it was not open to me to\n                    set aside the Award on the freestanding ground that its substantive decision on\n                    the merits was outrageous or irrational. The position of the courts in the\n                    United States was adopted against a different legislative and legal background\n                    and could not influence the decision here. Although counsel for SSGC submitted\n                    that a perverse award went beyond a mere mistake of fact or law (against which\n                    there is no right of appeal under the Act), I was of the view that any alleged\n                    perversity of the Award was nonetheless ultimately a question of whether the\n                    Tribunal had committed an error of law (e.g. by subjecting the Agreement to an\n                    irrational construction) and/or an error of fact (e.g. by ignoring or\n                    misunderstanding the factual matrix surrounding the dispute). Such an error of\n                    law or fact, if indeed committed, did not cease to be such even if the error was\n                    gross and manifest. 22     Since any alleged perversity or irrationality\n                    of the Award would still, in the final analysis, have involved errors of law or\n                    fact, on the plain wording of the Act and on the authorities cited in[19]and[20]above, there could be no right of appeal against such errors, independent of\n                    s 24 and art 34 of Sch 1 of the Act. 23     The main thrust of SSGC’s submissions,\n                    however, was thatbecausethe Award was perverse\n                    or irrational, it wasfor that reasonoutside the\n                    scope of submission to arbitration and contrary to public policy and therefore\n                    subject to challenge under art 34(2)(a)(iii)\n                    and 34(b)(ii) of Sch 1 of the Act. My reasons\n                    for rejecting this contention are set out below.",
        "The statutory provisions": "24     As I explained inABC Co v\n                        XYZ Co Ltd[2003] 3 SLR(R) 546 at [3], art 34,\n                    Sch 1 of the Act deals with the recourse that a party to an arbitration has\n                    when he is not satisfied with an arbitral award. Article 34(1) makes it clear\n                    that recourse to a court against an arbitral award may be madeonlyby an application for setting aside in accordance\n                    with para (2) and para (3) of the article. 25     The provisions which SSGC relied on\n                    read: (2)    An arbitral award\n                            may be set aside by the court specified in Article 6 only\n                        if: (a)    the party making the application furnishes\n                                proof that: … (iii)   the award deals with a dispute not\n                                    contemplated by or not falling within the terms of the\n                                    submission to arbitration, or contains decisions on matters\n                                    beyond the scope of the submission to arbitration, provided\n                                    that, if the decisions on matters submitted to arbitration can\n                                    be separated from those not so submitted, only that part of the\n                                    award which contains decisions on matters not submitted to\n                                    arbitration may be set aside; or … (b)    the court finds\n                                that: … (ii)   the award is in conflict with the public\n                                    policy of this State.",
        "The scope of submission argument": "26     SSGC submitted that in reaching the\n                    conclusions that it did in the Award, the Tribunal construed the Agreement so as\n                    to impose impossible obligations on SSGC which could not fit into any possible\n                    and rational interpretation of the Agreement. Consequently, SSGC submitted, the\n                    Award perversely went beyond the Agreement, and dealt with “a dispute not\n                    contemplated by or not falling within the terms of the submission to\n                    arbitration”, or contained “decisions on matters beyond the scope\n                    of the submission to arbitration”. 27     SSGC’s complaint was that the Award, by\n                    construing the term “pipeline system” as meaning the entirety of\n                    SSGC’s network of pipes, rather than restricting it by geographical\n                    locality to the Quetta pipeline, imposed an obligation on SSGC to upgrade its\n                    pipeline system by,inter alia, expanding the\n                    pipelines, laying new pipes, diverting additional supplies of gas from\n                    alternative gas fields and reconfiguring the flow of gas supplied by SSGC to\n                    other regions in Pakistan. These, contended SSGC, amounted to “impossible\n                    obligations” as it was physically, administratively and/or economically\n                    impossible for SSGC to carry out these tasks, due to a variety of constraints\n                    including: strict oversight by the Oil and Gas Regulatory Authority of Pakistan\n                    (which would not approve the requisite capital expenditure); the impossibility\n                    of reversing gas flowing southwards to Karachi so as to supply gas northwards to\n                    Quetta; and the physical inability, due to the limited capacity of the existing\n                    pipes, of SSGC to cope with additional demand due to long-term unforeseeable\n                    population growth and short-term spikes in gas consumption by residential users\n                    in the winter months. 28     In addition, SSGC contended that the Award was\n                    made in manifest disregard of the applicable principles of English law, insofar\n                    as the Award stated correct principles of English law but did not apply them. In\n                    particular, despite acknowledging that the Agreement had to be construed in the\n                    context of the matrix of facts (including background knowledge available to the\n                    parties at the time of contracting) and business common sense, the Award\n                    allegedly ignored these matters in construing the term “pipeline\n                    system” to mean SSGC’s entire network of pipes, rather than the\n                    Quetta pipeline. 29     I did not agree with SSGC that the Award was\n                    outside the scope of the submission to arbitration.",
        "The law": "44     As I stated inVV v\n                        VW[2008] 2 SLR(R) 929 at [17], assertions of breach of\n                    public policy cannot be vague and generalised. It is incumbent on a party\n                    seeking to challenge an award on this ground to identify the public policy which\n                    the award allegedly breaches and to show which part of the award conflicts with\n                    that public policy:John Holland Pty Ltd (formerly known as\n                        John Holland Construction & Engineering Pty Ltd) v Toyo Engineering Corp\n                        (Japan)[2001] 1 SLR(R) 443 at [25]. 45     No particular public policy of Singapore was\n                    identified by SSGC as having been embarrassed by the Award, and in my judgment,\n                    the public policy argument failed on this threshold point. Indeed, even on the\n                    assumption that SSGC’s criticisms of the Award were well-founded, it is\n                    difficult to see what particular public policy could be so\n                identified. 46     Counsel for SSGC submitted that, following the\n                    Court of Appeal’s statements inPT Asuransiat [59], public policy would operate when upholding an arbitral award would\n                    “shock the conscience”, and that it would “shock the\n                    conscience” that the Award required HCPC to be supplied with gas for its\n                    commercial purposes when SSGC lacked sufficient gas to supply to residential\n                    users in order that they could keep themselves warm in winter. 47     This contention was misconceived. Paragraphs\n                    5.25 and 5.26 of the Award clearly stated that under the Agreement, residential\n                    users were to have priority over HCPC’s Gas Allocation. Further, a fuller\n                    citation of the relevant paragraphs of the Court of Appeal’s judgment inPT Asuransiwill reveal that the public policy\n                    argument could not succeed: 57    …The legislative policy under the Act is to\n                            minimise curial intervention in international arbitrations. Errors of\n                            law or fact made in an arbitral decision,per\n                                se, are final and binding on the parties and may not be\n                            appealed against or set aside by a court except in the situations\n                            prescribed under s 24 of the Act and Art 34 of the Model Law.\n                            While we accept that an arbitral award is final and binding on the\n                            parties under s 19B of the Act, we are of the view that the Act\n                            will be internally inconsistent if the public policy provision in\n                            Art 34 of the Model Law is construed to enlarge the scope of curial\n                            intervention to set aside errors of law or fact. For consistency, such\n                            errors may be set aside only if they are outside the scope of submission\n                            to arbitration. In the present context,errors of law\n                                or fact,per se, do not engage the public policy of Singapore under\n                                Art 34(2)(b)(ii) of the Model Law when they cannot be set aside\n                                under Art 34(2)(a)(iii) of the Model\n                        Law. … 59    Although the concept\n                            of public policy of the State is not defined in the Act or the Model\n                            Law, the general consensus of judicial and expert opinion is that public\n                            policy under the Act encompasses a narrow scope. In our view, it should\n                            only operate in instances where the upholding of an arbitral award would\n                            “shock the conscience” (seeDowner\n                                Connect([58]supra) at\n                            [136]), or is “clearly injurious to the public good or …\n                            wholly offensive to the ordinary reasonable and fully informed member of\n                            the public” (seeDeutsche Schachbau v Shell\n                                International Petroleum Co Ltd[1987] 2 Lloyds’ Rep\n                            246 at 254,perSir John Donaldson MR), or\n                            where it violates the forum’s most basic notion of morality and\n                            justice: seeParsons & Whittemore Overseas Co Inc\n                                v Societe Generale de L’Industrie du Papier (RAKTA)508 F 2d, 969 (2ndCir, 1974) at 974. This\n                            would be consistent with the concept of public policy that can be\n                            ascertained from the preparatory materials to the Model Law. As was\n                            highlighted in the Commission Report (A/40/17), at para 297\n                            (referred to inA Guide to the UNCITRAL Model Law on\n                                International Commercial Arbitration: Legislative History and\n                                Commentaryby Howard M Holtzmann and Joseph E Neuhaus\n                            (Kluwer, 1989) at 914): In discussing the term ‘public policy’, it was understood\n                            that it was not equivalent to the political stance or international\n                            policies of a State but comprised thefundamental\n                                notions and principles of justice… It was\n                            understood that the term ‘public policy’, which was used in\n                            the 1958 New York Convention and many other treaties, covered\n                            fundamental principles of law and justice in substantive as well as\n                            procedural respects. Thus, instances such ascorruption,bribery or\n                                fraudand similar serious cases would constitute a ground\n                            for setting aside. [Original emphasis in italics; emphasis added in\n                    bold] 48     It is clear, therefore, that in order for SSGC\n                    to have succeeded on the public policy argument, it had to cross a very high\n                    threshold and demonstrate egregious circumstances such as corruption, bribery or\n                    fraud, which would violate the most basic notions of morality and justice.\n                    Nothing of the sort had been pleaded or proved by SSGC, and its ambiguous\n                    contention that the Award was “perverse” or\n                    “irrational” could not, of itself, amount to a breach of public\n                    policy. 49     Further, as I have held in[41]above that the Award could not be set aside\n                    under art 34(2)(a)(iii), Sch 1 of the\n                    Act, it follows from [57] ofPT Asuransithat the\n                    Award could not be set aside under art 34(2)(b)(ii), Sch 1 of the Act either. 50     Therefore, I did not accept the public policy\n                    argument advanced by SSGC.",
        "Application": "35     The matters within the scope of submission\n                    were set out in[11]above, and one such\n                    matter was whether SSGC’s breach of its obligations under the Agreement\n                    was excused by reason of the practical constraints imposed by the equipment SSGC\n                    was utilising. 36     Consequently, the Award clearly involved that\n                    matter. As HCPC submitted, theissueof whether\n                    SSGC was required by the Agreement to upgrade or reconfigure its pipeline system\n                    in order to maintain sufficient gas supplies to HCPC, as well as the very\n                    definition of the term “pipeline system”, was well within the\n                    scope of submission to the Tribunal. It could not be said that this issue was anew difference irrelevant to the issues requiring\n                        determinationby the Tribunal, when it was precisely one of the\n                    issues the Tribunal had to, and did, consider. 37     SSGC’s argument was not strengthened by\n                    its contention that the Tribunal’s pronouncements on this issue involved a\n                    perverse and irrational construction of the Agreement, and resulted in\n                    impossible obligations being imposed on SSGC. Art 34(2)(a)(iii), Sch 1 of the Act, as Chan CJ explained inPT Asuransi, is concerned with the\n                    jurisdiction of an arbitral tribunal to decide certain matters – it is not\n                    concerned with the substantive correctness of the arbitral tribunal’s\n                    subsequent decision on a matter that was properly within its jurisdiction. If an\n                    issue is firmly within the scope of submission to arbitration, I fail to see how\n                    it can be taken outside the scope of submission to arbitration simply because\n                    the arbitral tribunal comes to a wrong, even manifestly wrong, conclusion on it.\n                    As I emphasised to counsel during the oral argument, the setting aside\n                    provisions of the Model Law relate primarily to ensuring that the process of the\n                    arbitration is fair. They are not concerned with the substantive\n                outcome. 38     As for SSGC’s complaint that the Award\n                    was made in manifest disregard of the applicable principles of English law, this\n                    too was unsuccessful. Where an arbitral tribunal correctly states but misapplies\n                    the law, this is an error of law (and does not cease to be such even if the\n                    error is gross or egregious), in respect of which no challenge lies under the\n                    Act:PT Asuransiat [57]. Insofar as SSGC alleged\n                    that the Tribunal ignored “the matrix of facts”, this was an\n                    allegation that the Tribunal committed an error of fact, in respect of which\n                    there is also no remedy under the Act:PT Asuransiat [57]. Neither contention has any effect on the scope of submission to\n                    arbitration. 39     In any event, I should emphasise that I was\n                    not at all convinced that the Tribunal had construed the Agreement irrationally\n                    or disregarded the applicable principles of English law. The Tribunal was fully\n                    entitled to prefer HCPC’s contentions to SSGC’s after having had the\n                    benefit of extensive submissions and expert evidence with regard to whether it\n                    was necessary to limit the meaning of the term “pipeline system”\n                    to a particular geographical location, and whether it was possible or feasible\n                    to upgrade and/or reconfigure SSGC’s pipeline system, and it did not\n                    thereby act irrationally, or erroneously disregard the factual matrix\n                    surrounding the dispute. Even assuming, however, that this had been the case, as\n                    I have explained in[37]-[38]above, an irrational decision would not have\n                    deprived the Tribunal of the jurisdiction it plainly had to make that decision,\n                    anda fortioria merely erroneous\n                one. 40     It also appeared to me what SSGC was asking me\n                    to do was to delve into the facts and the evidence and the submissions in order\n                    to conclude that the Tribunal had erred in both law and fact. I was not only\n                    disinclined to pursue such a course; I was not empowered to do so. The Act does\n                    not allow appeals. 41     For these reasons, I was not persuaded that\n                    the Award was outside the scope of submission to arbitration.",
        "The public policy argument": "42     SSGC canvassed the same arguments in\n                    submitting that the Award contained decisions on matters which were in conflict\n                    with the public policy of Singapore, in breach of art 34(2)(b)(ii), Sch 1 of the Act. In short, SSGC contended\n                    that public policy required that arbitral awards could not be so perverse and\n                    manifestly unreasonable that no reasonable tribunal could conclude that\n                    way. 43     I did not accept that the Award could be set\n                    aside on the basis of art 34(2)(b)(ii),\n                    Sch 1 of the Act.",
        "Conclusion": "51     In sum, I dismissed SSGC’s application\n                    to set aside the Award because I did not think the Award was perverse and\n                    manifestly unreasonable, and even if it was, there was no provision in the Act\n                    which enabled me to set aside the Award on that groundper\n                        se. Further, I was not convinced that, even if it could be said\n                    that the Award was perverse, SSGC had demonstrated that the Award was outside\n                    the scope of submission to arbitration (and therefore in breach of\n                        art 34(2)(a)(iii), Sch 1 of the Act)\n                    and/or that the Award was in conflict with the public policy of Singapore (and\n                    therefore in breach of art 34(2)(b)(ii),\n                    Sch 1 of the Act). 52     In view of my conclusion, since SSGC had\n                    failed in its application, I ordered that it should pay costs to HCPC as taxed\n                    or agreed."
    }
}