{
    "case_title": "Chua Say Eng (formerly trading as Weng Fatt Construction\n                Engineering)\n      v\n      Lee Wee Lick Terence @ Li Weili Terence",
    "ncitation": "[2010] SGHC 333",
    "coram": "Leo Zhen Wei Lionel AR",
    "sections": {
        "Introduction": "1       In this summons, the defendant, Lee Wee Lick\n                    Terence (“the Defendant”), applied to set aside the adjudication\n                    determination dated 7 July 2010 (“the Adjudication Determination”)\n                    made by Mr Ian de Vaz (“the Adjudicator”) in which the Adjudicator\n                    awarded the plaintiff, Chua Say Eng (“the Plaintiff”), the sum of\n                    $125,450.40. The Adjudication Determination had been made pursuant to an\n                    application by the Plaintiff under s 17 of the Building and Construction\n                    Industry Security of Payment Act (Cap. 30B, 2006 Rev Ed) (“the\n                    SOPA”). 2       This application raises three interesting\n                    issues. First, I have to consider whether the court, in a setting aside\n                    application, should review the adjudicator’s decision as to the validity\n                    of an alleged payment claim. Second, a question arose as to whether service, in\n                    the case of an individual, can be effected by leaving the payment claim at the\n                    last known address of the place of residence of that individual. Third, I have\n                    to determine whether the SOPA prescribes a limitation period within which a\n                    payment claim must be served. Before delving into a discussion of these issues,\n                    it is apposite that I set out the relevant factual background.",
        "Background": "3       The Plaintiff is in the business of building and\n                    renovation works. On 16 August 2008, the Defendant engaged the Plaintiff as\n                    the main contractor for reconstruction works to convert his two-storey house at\n                    1 Pasir Ris Heights (“the Construction Address”) into a\n                    three-storey house (“the Project”) for the sum of $420,000.00\n                    (“the Contract”). Subsequently, the Plaintiff and the Defendant\n                    agreed to increase the scope of the Contract to cater for additional works and\n                    changes in design. As a result, the total contract sum increased to\n                    $542,000.00. 4       On 8 February 2010, the Defendant alleged\n                    that the Plaintiff was in repudiatory breach and gave the Plaintiff ‘Final\n                    Notice’ to provide certain information, undertakings and documents by\n                    13 February 2010, failing which the Defendant would accept the\n                    Plaintiff’s alleged repudiation. By way of letter dated 21 April\n                    2010, the Defendant purported to accept the Plaintiff’s repudiation and\n                    terminated the Contract. In the same letter, the Plaintiff was instructed to\n                    vacate the site of the Project by 12pm on 26 April 2010. 5       In early May 2010, the Plaintiff obtained a\n                    valuation report which expressed the view that the value of the work done as at\n                    1 May 2010 was $350,450.40 (“the Evaluated Amount”).\n                    Accordingly, on 2 June 2010, the Plaintiff served a Payment Claim No. 6\n                    (“the Payment Claim”) on the Defendant claiming a sum of\n                    $140,450.40 for work done from June 2009 to 26 April 2010. This sum\n                    represented the outstanding amount due after deducting the previous payments\n                    made from the Evaluated Amount. Service (of the Payment Claim) was effected by\n                    leaving the Payment Claim under the front door of the Defendant’s\n                    residential address at Block 117, Edgefield Plains #17-316 (“the\n                    Residential Address”) at around 7.30pm, and by depositing the Payment\n                    Claim in the mailbox of the Construction Address at around 6.45pm. 6       As the Contract is silent on when a payment\n                    response should be served, s 11(1)(b) of the SOPA mandates that the payment\n                    response be served within 7 days after the payment claim is served. As the\n                    Payment Claim was served on 2 June 2010, the due date for the relevant\n                    payment response was 9 June 2010. It is common ground that the Defendant\n                    did not serve a payment response on the Plaintiff by 9 June 2010 or at\n                    all.",
        "The Adjudication Determination": "7       Pursuant to s 12(5) of the SOPA, the\n                    dispute settlement period expired on 16 June 2010. On 18 June 2010, in\n                    compliance with s 13(2) of the SOPA, the Plaintiff served the Defendant\n                    with a Notice of Intention to Apply for Adjudication (“the\n                    Notice”) by leaving the Notice under the front door of the Residential\n                    Address at 6.45pm, and by depositing the Notice in the mailbox of the\n                    Construction Address at 7.10pm. 8       On 22 June 2010, the Plaintiff filed an\n                    adjudication application (“the Adjudication Application”) with the\n                    Singapore Mediation Centre (“SMC”). Later that same day, the SMC\n                    served the Adjudication Application on the Defendant at the Residential Address.\n                    Pursuant to s 15(1) of the SOPA, the Defendant must, within 7 days of\n                    receipt of a copy of an adjudication application, lodge an adjudication response\n                    with the SMC. Accordingly, the Defendant had up to 29 June 2010 to lodge an\n                    adjudication response with the SMC. It is again not disputed that the Defendant\n                    did not lodge an Adjudication Response with the SMC by 29 June 2010 or at\n                    all. 9       On 7 July 2010, the Adjudicator released\n                    the Adjudication Determination, which awarded the Plaintiff a sum of\n                    $125,450.40. The Defendant has now applied to set aside the Adjudication\n                    Determination.",
        "Issues": "10     The issues arising out of this application are\n                    as follows: (a)     Whether the Payment Claim was a\n                        valid payment claim under the SOPA; (b)     Whether the Payment Claim was served in accordance with\n                        the SOPA; (c)     Whether the Payment Claim, if it had been served in accordance with the\n                        SOPA, was nevertheless served out of time. I will now\n                    address each of these issues in turn.",
        "My decision": "",
        "Whether the Payment Claim was a valid payment claim under the\n                SOPA": "11     The issue of whether the Payment Claim\n                    constituted a valid payment claim under the SOPA was raised before the\n                    Adjudicator. As such, a preliminary question that needs to be answered is\n                    whether, in a setting aside application, the court ought to be reviewing the\n                    Adjudicator’s decision on such matters. On this point, there appears to be\n                    a possible conflict of authority. InSEF Construction Pte Ltd\n                        v Skoy Connected Pte Ltd[2010] 1 SLR 733\n                        (“SEF Construction”), Judith\n                    Prakash J held that a court hearing a setting aside application under\n                    s 27(5) of the SOPA may only consider issues relating to the\n                    “appointment and conduct of the adjudicator” and not the merits of\n                    the case. At [42] of her Judgment, Prakash J held that: Accordingly, instead of reviewing the merits (in any direct or indirect\n                        fashion), it is my view that the court's role must be limited to supervising\n                        the appointment and conduct of the adjudicator to ensure that the statutory\n                        provisions governing such appointment and conduct are adhered to and that\n                        the process of the adjudication, rather than the substance, is proper. After\n                        all, in any case, even if the adjudicator does make an error of fact or law\n                        in arriving at his adjudication determination, such error can be rectified\n                        or compensated for in subsequent arbitration or court proceedings initiated\n                        in accordance with the contract between the claimant and the respondent and\n                        intended to resolve all contractual disputes that have arisen. More pertinently, Prakash J went on to hold, at [46],\n                    that: Similarly, although the SOP Act requires a payment claim to\n                        be served,whether or not the document purporting to be a\n                            payment claim which has been served by a claimant is actually a payment\n                            claim is an issue for the adjudicator and not the court. In\n                        this respect, I agree entirely with Hodgson JA's reasoning inBrodyn(([32]supra)\n                        at [66]): ... If there is a document served by a claimant on a respondent that\n                            purports to be a payment claim under the Act, questions as to whether\n                            the document complies in all respects with the requirements of the Act\n                            are generally, in my opinion, for the adjudicator to decide. Many of\n                            these questions can involve doubtful questions of act and law; and as I\n                            have indicated earlier, in my opinion the legislature has manifested an\n                            intention that the existence of a determination should not turn on\n                            answers to questions of this kind. However, I do not need to express a\n                            final view on this. [emphasis added] 12     On this reasoning, the issue of whether a\n                    document purporting to be a payment claim is a payment claim under the SOPA\n                    would be a matter for the adjudicator, and not the court. It would logically\n                    follow from this that a court should not consider the issue of the validity of a\n                    payment claim in a setting aside application. However, in the recent case ofSungdo Engineering & Construction (S) Pte Ltd v\n                        Italcor Pte Ltd[2010] 3 SLR 459 (“Sungdo”), Lee Seiu Kin J took the view that since\n                    the validity of a payment claim goes to jurisdiction, the court is not precluded\n                    from examining this issue on judicial review. At [34] of his Grounds of\n                    Decision, Lee J held that: In principle,if the validity of a Payment\n                            Claim goes to jurisdiction, I do not see how a court is precluded from\n                            examining this issue on judicial reviewand I would, with\n                        respect, disagree with this. Notwithstanding this, the 2008 Letter did not\n                        purport to be a payment claim under the Act as nothing therein states that\n                        it is so. ThereforeSEF Constructiondoes not\n                        stand in the way of my decision in the present case. However I should state\n                        that in practice,where a document purports to be a\n                            Payment Claim, then unless the adjudicator has made an unreasonable\n                            finding on the evidence(unreasonableness as inAssociated Provincial Picture Houses, Limited v Wednesbury\n                            Corporation[1948] 1 KB 223),his decision that it satisfies all the requirements of a Payment Claim\n                            may not be interfered with by the courtwhen exercising its\n                        powers of judicial review. This appears to be the offset of the following\n                        passage inBrodyn(at [66]), which was cited\n                        inSEF Constructionat [46]: ... If there is a document served by a claimant on a respondent that\n                            purports to be a payment claim under the Act, question as to whether the\n                            document complies in all respects with the requirements of the Actare generally, in my opinion, for the adjudicator\n                                to decide. Many of these questions can involve doubtful\n                            questions of [f]act and law; and as I have indicated earlier, in my\n                            opinion the legislature has manifested an intention that the existence\n                            of a determination should not turn on answers to questions of this kind.\n                            However, I do not need to express a final view on this. [emphasis added] 13     The court inSEF\n                        Constructionhad followed the decision of the New South Wales\n                    Court of Appeal inBrodyn Pty Ltd v Davenport[2004] NSWCA 394 (“Brodyn”). InBrodyn, Hodgson JA\n                    had opined that the court should only review an adjudicator’s decision as\n                    regards whether the “basic and essential” requirements of the New\n                    South Wales legislation (ie, the Building and\n                    Construction Industry Security of Payment Act 1999 (NSW) (“the NSW\n                    Act”)) were fulfilled. In his opinion, whether a payment claim was served\n                    in accordance with the NSW Act was an issue for the adjudicator and not the\n                    court. Prakash J had affirmed this view at [46] ofSEF\n                        Construction. It may be relevant to note that the approach inBrodynhas been departed from inChase Oyster Bar v Hamo Industries[2010] NSWCA 190 (“Chase\n                    Oyster”). InChase Oyster, the\n                    claimant had failed to serve in time a notice of intention (to apply for\n                    adjudication) as required by the NSW Act. The Court of Appeal held that service\n                    in time of the notice of intention was a requirement which affected the validity\n                    of the adjudication. Departing from the more narrow approach inBrodyn, the court held, at [149], that: The decision inBrodynappears to assume\n                        that there is a distinction between a basic and essential requirement for\n                        the existence of an adjudicator’s determination and a jurisdictional\n                        condition, or jurisdictional fact. However, the decision does not analyse\n                        the relevant requirements of the Act in terms of jurisdiction; the framework\n                        of analysis was restricted by the search for basic and essential conditions\n                        of validity. McDougall J went on to emphasise why strict adherence with the\n                    requirements of the NSW Act was necessary and held, at [208]–[209],\n                    that: Further, theSecurity of Payment Actoperates in a way that has been described as “rough and ready”\n                        or, less kindly, as “Draconian”. It imposes a mandatory regime\n                        regardless of the parties’ contract: s 34. It provides extremely\n                        abbreviated time frames for the exchange of payment claims, payment\n                        schedules, adjudication applications and adjudication responses. It provides\n                        a very limited time for adjudicators to make their decisions on what,\n                        experience shows, are often extremely complex claims involving very\n                        substantial volumes of documents (see, for example, my decision inLaing O’Rourke Australia Construction v H&M\n                            Engineering and Construction[2010] NSWSC 818 at\n                        [8]). TheSecurity of Payment Actgives very\n                        valuable, and commercially important, advantages to builders and\n                        subcontractors. At each stage of the regime for enforcement of the statutory\n                        right to progress payments, theSecurity of Payment\n                            Actlays down clear specifications of time and other\n                        requirements to be observed. It is not difficult to understand that the\n                        availability of those rights should depend on strict observance of the\n                        statutory requirements that are involved in their creation. 14     Therefore, I am of the view that, as held inSungdoandChase\n                        Oyster, the issue of the validity of a payment claim is one that\n                    the courtcanreview. However, as Prakash J\n                    points out inChip Hup Hup Kee Construction Pte Ltd v\n                        Ssangyong Engineering & Construction Co Ltd[2010]\n                    1 SLR 658 at [57], the policy behind the SOPA is that of assisting in\n                    “maintaining cash flow in the [construction] industry while disputes\n                    [are] settled via arbitration or court proceedings” by providing\n                    “a fast track procedure for an interim decision in respect of a disputed\n                    payment claim”. This policy would be frustrated if the court must\n                    invariably look into the parties’ arguments before the adjudicator. As\n                    Prakash J noted inSEF Constructionat\n                    [41]: If the court were to be allowed to look into questions of substance or\n                        quantum including questions like whether a proper payment claim had been\n                        served by the claimant, the procedure is likely to be expensive and\n                        prolonged. One can very easily envisage a situation (in fact such situations\n                        have already occurred) where the dissatisfied respondent first applies to\n                        the court for the adjudication determination to be set aside on the ground\n                        that, for example, the adjudication response should not have been rejected,\n                        and then when that application is rejected by the assistant registrar,\n                        appeals to the judge in chambers and finally when the appeal is\n                        unsuccessful, appeals again to the Court of Appeal. Bearing in mind that the\n                        adjudication process could have been a two-step process involving a review,\n                        that would mean five steps in all before the dispute regarding the\n                        claimant's payment claim is finally disposed of. The more steps there are,\n                        the longer the process will take and the more expensive it will be. Such an\n                        outcome would be contrary to the intention of Parliament that the\n                        adjudication procedure should afford speedyinterimrelief. [emphasis in original] 15     In my view, the approach that best gives\n                    effect to bothSungdoandSEF\n                        Construction(which are admittedly not completely reconcilable)\n                    as well as the policy behind the SOPA is that generally, the court in a setting\n                    aside application should not delve into the details of whether an alleged\n                    payment claim complies with the requirements of the SOPA as long as the\n                    document, on its face,purportsto be a payment\n                    claim under the SOPA. In other words, if the document expressly states that it\n                    is a payment claim under the SOPA or even simply states that it is a payment\n                    claim, then unless the adjudicator has made an unreasonable finding on the\n                    evidence, the court should not interfere with his decision that all the\n                    requirements of the SOPA are fulfilled. In contrast, if the document appears, on\n                    its face, to either be something other than a payment claim (as was the case inSungdo) or to clearly fall afoul of one of the\n                    requirements set out in the SOPA and the Building and Construction Industry\n                    Security of Payment Regulations (Cap. 30B, Rg 1, 2006 Rev Ed)\n                    (“the SOPR”), then the court should examine the document and make\n                    a determination as to whether it actually is a payment claim within the meaning\n                    of s 10. As Lee J alluded to inSungdoat [32]: While I agree that the jurisdiction of the adjudicator is not vested until\n                        his appointment by an ANB, I am, with respect, unable to agree that\n                        jurisdiction is not affected by an invalid Payment Claim or service thereof.\n                        The power of the ANB to appoint an adjudicator arises from the receipt of an\n                        adjudication application from a claimant, and that is predicated by a whole\n                        chain of events initiated by the service of a Payment Claim by the claimant\n                        on the respondent under s 10 of the Act. It must follow thatif the claimant had failed to serve a Payment Claim, or to\n                            serve something that constitutes a Payment Claim, the power to appoint\n                            an adjudicator for that particular claim has not arisen.\n                        [emphasis added] In determining whether a payment claim is a valid one under the SOPA,\n                    the court would have to consider whether the requirements in the SOPA and the\n                    SOPR, in particular s 10(3) of the SOPA and reg 5(2) of the SOPR, are\n                    complied with. In addition, although it is clear that there is no requirement\n                    that a payment claim must contain a statement that it is a payment claim under\n                    the SOPA, the court inSungdoappears to have\n                    imposed a further requirement, namely that for a document to amount to a payment\n                    claim under the SOPA, the party submitting it must intend it to be such. At [20]\n                    of his Grounds of Decision, Lee J stated this further requirement as\n                    follows: Be that as it may, since it is not a requirement under the Act, the\n                        absence of a statement that a document is a Payment Claim does not of itself\n                        preclude that document from being one. But the defendant's contention that\n                        any document that satisfies all the requirements under the Act and the\n                        Regulations as to how it is made and what it must contain would amount to a\n                        Payment Claim is quite another manner. This would mean that a document\n                        containing all such information but also containing the statement \"This is\n                        not a payment claim under the Act\" would be a payment claim under the Act,\n                        which would be contrary to commonsense. To the argument that in such a\n                        situation the claimant is estopped from relying on it as a Payment Claim,\n                        there are two responses. The first is that this argument will not address\n                        the situation where the respondent, out of an abundance of caution, submits\n                        a payment response and therefore has not been prejudiced. The second is a\n                        matter of principle: surely intention must be a necessary element and such a\n                        document cannot be a Payment Claim even if it contains all the prescribed\n                        requirements for one, simply because it was not intended to be one by the\n                        maker of the document. In my view,for a document to\n                            amount to a payment claim under the Act, the party submitted it must\n                            intend it to be such, and I so hold. [emphasis added] 16     Relying onSungdo, the Defendant contended that the Payment Claim was not a\n                    valid payment claim under the SOPA because the Plaintiff did not intend it to be\n                    a payment claim under the SOPA, and in any case, had not communicated such an\n                    intention to the Defendant. However, as discussed above at[15], if a documentpurports, on its face, to be a payment claim, then its validity\n                    as a payment claim under the SOPA is an issue that should be determined by the\n                    adjudicator. I am of the view that the Payment Claim submitted by the Plaintiff\n                    clearlypurportsto be a payment claim under the\n                    SOPA. In the first place, there is no dispute that the Payment Claim complies\n                    with all the requirements prescribed by the SOPA and the SOPR. Second, the title\n                    block of the Payment Claim itself describes the document as “Payment\n                    Claim No. 6”; and the text of the body opens with the line “[w]e\n                    submit our payment claim number 6 for work done from June 2009 to 26 April\n                    2010”. The “amount due/claimed” is then set out, with the\n                    details of the amount claimed separately attached. Third, the cover letter of\n                    the Payment Claim is printed on the Plaintiff’s letterhead, and is signed\n                    and dated. Care was also taken such that every page (of the cover letter and the\n                    attachments) contains the Plaintiff’s stamp and is signed. In my view, the\n                    fact that the Payment Claim complies with all the requirements of the SOPA and\n                    the SOPR, its express title, and the general formality of the Payment Claim\n                    justifies a finding that itpurportedto be a\n                    payment claim under the SOPA. By way of comparison, the document inSungdowas distinctly informal. For starters, it was\n                    titled “Letter from Italcor to Sungdo” and concluded with the\n                    following festive greeting: Finally, we wish you greetings of the season! The informality was enhanced by the fact that the person signing it\n                    was not identified and the date was handwritten. The document also appears to\n                    have been written in response to questions as to whether the work had been\n                    completed. This can be gleaned from the second paragraph of the document, which\n                    states: With regard to your questioning of whether we have done the work, we wish\n                        to assure you that the work in respect of the following invoices have been\n                        done and we claim for payment for such work as follows... Although the words “claim for payment” were used, the\n                    general tenor of the document was more akin to an informal letter than to a\n                    payment claim under the SOPA. Furthermore, inSungdo, Lee J found (at [26]) that the events prior to the\n                    service corroborated a finding that the document was not intended to be a\n                    payment claim under the SOPA. In the present case, the Defendant was not able to\n                    point to any such overt acts by the Plaintiff (which could indicate that the\n                    Payment Claim was not to be treated as a payment claim under the SOPA) other\n                    than the fact that there were two previous claims that were not submitted for\n                    adjudication, namely “Contract Progress Claim No: 4” and\n                    “Contract Progress Claim No. 5”. I note that these claims were\n                    described as progress claims and were neither signed nor dated. Furthermore,\n                    they were not prefaced by a cover letter. As such, I am of the view that the\n                    existence of such previous claims that were not submitted for adjudication has\n                    no bearing on the question of whether the Payment Claim purported to be a\n                    payment claim under the SOPA. 17     In the circumstances, I am not satisfied that\n                    there are any reasonable grounds for interfering with the Adjudicator’s\n                    determination that the Payment Claim was a valid payment claim under the\n                    SOPA.",
        "Whether the Payment Claim was served in accordance with the\n                SOPA": "18     The second issue raises the novel question of\n                    what constitutes effective service of a payment claim on a private individual in\n                    the context of the SOPA. It is perhaps not surprising that this issue does not\n                    seem to have generated controversy in adjudications where the respondent is a\n                    corporate or commercial entity since presumably where such an entity is\n                    involved, there would be proper administrative systems and processes in place to\n                    record when documents are delivered or served on the entity. Hence, the question\n                    of whether a document has been effectively served on the entity or not seldom\n                    arises. 19     The crux of the Defendant’s submission\n                    is that he did not receive the Payment Claim when it was served by the Plaintiff\n                    at the Residential Address. In this regard, the Plaintiff has exhibited\n                    documents from a courier service which indicate that the Payment Claim was\n                    delivered to the Residential Address on 2 June 2010 at approximately 7.30pm\n                    and was “slid under the door” when the courier found that\n                    “nobody was home”. The Defendant does not contest the authenticity\n                    of the documents from the courier service, but claims that his wife or the\n                    domestic helper might have inadvertently disposed of the Payment Claim when it\n                    was slipped under the front door of the Residential Address as the front door\n                    was located near where scrap paper (intended for disposal or recycling) was\n                    stored. The Defendant emphasises the fact that there is no evidence that he\n                    actually received the Payment Claim, and that accordingly, there had not beenpersonal serviceof the Payment Claim as\n                    required by the SOPA. 20     As the treatment of this issue necessarily\n                    involves extensive references to s 37 of the SOPA, it would be helpful to\n                    set out the section in its entirety: Service of documents 37. —(1) Where this Act authorises or requires a document\n                        to be served on a person, whether the expression “serve”,\n                        “lodge”, “provide” or “submit”\n                        or any other expression is used, the document may be served on\n                        the person — (a) by delivering it to the person personally; (b) by leaving it during normal business hours at the usual\n                        place of business of the person; or (c) by sending it by post or facsimile transmission to the usual\n                        or last known place of business of the person. (2) Service of a document that is sent to the usual or last\n                        known place of business of a person under subsection (1) (c) shall be\n                        deemed to have been effected when the document is received at that\n                        place. (3) The provisions of this section are in addition to, and do\n                        not limit or exclude, the provisions of any other law with respect to\n                        the service of documents. 21     The Defendant’s contention is that there\n                    had not been proper service of the Payment Claim since it had not been served in\n                    accordance with any of the methods prescribed in s 37(1) of the SOPA. On\n                    the other hand, the Plaintiff contends that there was effective service because\n                    they had left the Payment Claim at the usual or last known address of the place\n                    of residence of the Defendant and that this complies fully with\n                    s 48A(1)(a)(ii) of the Interpretation Act (Cap. 1, 2002 Rev Ed)\n                    (“Interpretation Act”) which states: Service of documents 48A. —(1) Where a written law\n                        authorises or requires a document to be served on a person, whether the\n                        expression “serve”, “give” or\n                        “send” or any other expression is used, then, unless the\n                        contrary intention appears, the document may be served — (a) in the case of an individual — (i) by delivering it to the individual personally; or (ii) byleaving it at, or by sending it by pre-paid\n                            post to, the usual or last known address of the place of residence or\n                            business of the individual; ... (2) Nothing in subsection (1) — (a) affects the operation of any written law that authorises the service\n                        of a document otherwise than as provided in that subsection... [emphasis added] In my view, the presence of the word “may” in\n                    s 37(1) of the SOPA is indicative of and consonant with the permissive\n                    nature of the section. Furthermore, s 37(3) of the SOPA states that the\n                    provisions of s 37 are “in addition to, and do not limit or\n                    exclude, the provisions of any other law with respect to the service of\n                    documents”. This underscores the fact that the modes of service\n                    stipulated in the SOPA are not exhaustive and that there is clearly scope for\n                    other modes of service of documents as prescribed by “any other\n                    law”, and this would necessarily include the modes of service provided\n                    for in the Interpretation Act. 22     The Defendant drew my attention to the tight\n                    timelines that are imposed following the service of a payment claim and to the\n                    serious consequences that entail a failure to file a payment response, and thus\n                    argued that Parliament must have intended that a payment claim should, like the\n                    originating processes of the Singapore courts, bepersonallyserved. Although I am conscious of the difficulties\n                    that individuals may face if payment claims are not personally served, I am of\n                    the view that itcannothave been\n                    Parliament’s intention that a payment claim must be personally served.\n                    First, s 37(1) itself does not provide exclusively for personal service as\n                    s 37(1)(b) and (c) provide that a payment claim may be served by leaving it\n                    during normal business hours at the usual place of business of the person or by\n                    sending it to the usual or last known place of business of the person. Second,\n                    where personal service of particular documents is required, the relevant\n                    legislation will usually lay out some procedure for substituted service (foreg, O 62 r 5 of the Rules of Court\n                    (Cap. 322, R 5, 2006 Rev Ed) in the case of originating\n                    processes). The absence of such a procedure for substituted service suggests\n                    that Parliament did not intend that payment claims had to be personally served.\n                    Third, as noted above at[14], the SOPA was\n                    enacted primarily for the benefit of persons who have performed construction\n                    work by providing a mechanism to sustain case flow. The efficacy and reach of\n                    the SOPA would be severely undermined if employers who are individuals could\n                    bring themselves out of the reach of the SOPA by simply placing themselves,\n                    deliberately or otherwise, out of sight and reach. 23     Therefore, since the Plaintiff had effected\n                    service of the Payment Claim on the Defendant on 2 June 2010 in a manner\n                    provided for in s 48A(1)(a)(ii) of the Interpretation Act, I find that\n                    there had been valid and regular service of the Payment Claim for the purposes\n                    of the SOPA.",
        "Whether the Payment Claim was served out of time": "24     I turn now to consider the final issue of\n                    whether the Payment Claim was served out of time. The kernel of the\n                    Defendant’s contention on this issue is that the collective effect of\n                    s 10(2) of the SOPA read with reg 5(1) of the SOPR creates a\n                    limitation period for the service of payment claims under the SOPA. In its\n                    submissions, the Defendant relied on commentaries by two local authors to\n                    support its view that there is a limitation period for the service of payment\n                    claims under the SOPA. The first of these commentaries is Philip Chan,Statutory Adjudication in Singapore(Sweet & Maxwell\n                    Asia, 2008) at paras 3.2.8 and 3.2.9: 3.2.8 Therefore, it would appear that if any claimed\n                            amount has not been properly included in a payment claim as prescribed\n                            by s 10(2), it is no longer possible to make a claim that is out of\n                            time. Thus, the time of service of the payment claim is also the\n                            limitation period for the purpose of claiming an amount in a payment\n                            claim. According to s 10(2), this limitation period may be agreed\n                            by the parties under s 10(2)(a) or it may be prescribed under\n                            s 10(2)(b)... 3.2.9 By reg 5(1), the default limitation period\n                            for each claimed amount is marked ‘by the last day of each month\n                            following the month in which the contract is made’. The second commentary relied upon by the Defendant is Chow Kok\n                    Fong,Security of Payments and Construction\n                        Adjudication(LexisNexis, 2005) (“Chow Kok Fong”)\n                    at p 557: TheBuilding and Construction Industry Security of\n                            Payment Regulations 2005(hereinafter the ‘BCISP\n                        Regulations’) prescribe that the default date is ‘the last day\n                        of each month following the month in which the contract is made’. This\n                        effectively allows the claimant one month to prepare and submit the payment\n                        claim... Upon clarification from the Defendant’s counsel, I was given to\n                    understand that the upshot of the Defendant’s position was that if the\n                    Plaintiff wished to claim for work done as at April 2010, the Payment Claim had\n                    to be served by 30 April 2010 and not any later as it would then be\n                    time-barred. 25     Given that the determination of this issue is\n                    likely to hinge heavily on the interpretation of s 10(2) of the SOPA and\n                    reg 5(1) of the SOPR, it would be appropriate to first examine the actual\n                    wording of the relevant provisions. Section 10(2) of the SOPA states\n                    that: Payment claims 10. —(2) A payment claimshallbe served — (a) at such time as specified in or determined in accordance with the\n                        terms of the contract; or (b) where the contract does not contain such provision,at such time as may be prescribed. [emphasis added] The time that is prescribed is found in reg 5(1) of the SOPR,\n                    which states that: Payment claims 5. —(1) Where a contract does not\n                        contain any provision specifying the time at which a payment claim shall be\n                        served or by which such time may be determined, then a payment claim made\n                        under the contractshall be served by the last day of\n                            each monthfollowing the month in which the contract is\n                        made. [emphasis added] 26     In my view, the plain words of s 10(2)\n                    read with reg 5(1) merely stipulatewhenpayment claims are to be served. I do not read the combined effect of the\n                    provisions as supporting the creation of a limitation period that impinges on\n                    thescopeof claims that can be made in a payment\n                    claim. As Chow Kok Fong recognizes at p 131, there is no provision in the\n                    SOPA which expressly prohibits payment claims in which sums are claimed for work\n                    done some months earlier than the month in which the payment claim is served.\n                    The imposition of a limitation period as contended by the Defendant would be a\n                    matter with far reaching consequences. If Parliament had intended that there\n                    should be a limitation period, it could easily have included a provision to that\n                    effect in the SOPA. It is unlikely that Parliament would leave such an important\n                    matter to be dealt with in subsidiary legislation. In this regard, it is\n                    noteworthy that s 13(4) of the NSW Act provides that: 13. —(4) A payment claim may be served\n                        only within: (a) the period determined by or in accordance with the terms of the\n                        construction contract; or (b) the period of 12 months after the construction work to which the claim\n                        relates was last carried out (or the related goods and services to which the\n                        claim relates were last supplied); whichever is the later. Since the SOPA was modelled (at least in part) on the NSW Act, the\n                    fact that the SOPA does not include a provision similar to s 13(4) supports\n                    the conclusion that Parliament did not intend that there should be a limitation\n                    period. Furthermore, under s 13(4) of the NSW Act, a payment claim is only\n                    time barred on the expiry of 12 months after the construction work to which the\n                    payment claim relates was carried out. In contrast, if the Defendant is right,\n                    the limitation period imposed by s 10(2) of the SOPA read with\n                    reg 5(1) of the SOPR would be only 1 month. In my view, it would not be\n                    right to read such a short limitation period, within which a contractor must\n                    submit his payment claim or else have all its rights under the SOPA completely\n                    forfeited, into the statutory regime without clear words to that effect. As the\n                    New South Wales Court of Appeal held inFyntray Constructions\n                        Pty Ltd v Macind Drainage & Hydraulic Services Pty Ltd[2002] NSWCA 238 (“Fyntray”) at [49]: Secondly, whether or not the provisions creating a strict regime where\n                        claimants are not paid, and the provisions requiring adjudication to be\n                        prosecuted expeditiously, point towards the defendant's construction, there\n                        is no express language supporting it.The conclusion that\n                            the significant statutory rights conferred are only capable of being\n                            availed of by claimants within the narrow time period contended for by\n                            the defendant could only be drawn if the language used were\n                            clear. It is certainly possible for statutory rights of a\n                        valuable kind to be granted on the strictest temporal conditions,but in the absence of clear language one would not lightly\n                            arrive at a construction having the result that they could be lost by a\n                            short delay, whether that delay was the result of intentional\n                        behaviour by the claimant, or oversight, or accident, or some intervening\n                        and overriding event. And the clear language necessary is language which one\n                        would expect to exist not in s 14, dealing with responses to payment\n                        schedules, but in s 13, dealing with the conditions which must be\n                        satisfied by payment claims. Section 13(2) states formal requirements for\n                        payment claims.If there were to be a substantive strict\n                            requirement in relation to time, one would expect to find it there. It\n                            is not there. [emphasis added] 27     The express words of reg 5(1) do not\n                    clearly set out a limitation period, but merely state that a payment claim\n                    “shall be served by the last day of each month following the month in\n                    which the contract is made”. In essence, for the Defendant’s\n                    contention to succeed, the court would have to read reg 5(1) as requiring\n                    that a payment claim be served by the last day of each monthin which the work was done. There is simply no basis for reading\n                    reg 5(1) in this manner since reg 5(1) does not even mention the words\n                    “work” or “done”. In my view, the true import of\n                    reg 5(1) is two-fold. First, since reg 5(1) states that the payment\n                    claim must be served by the last day of the each monthfollowing the month in which the contract is made, this means\n                    that no payment claim can be served in the month in which the contract is made.\n                    This is a sensible position since a plaintiff should generally be expected to\n                    complete a certain amount of work before it can make a payment claim. By\n                    disallowing the making of a payment claim in the month in which the contract was\n                    made, reg 5(1) prevents plaintiffs from swiftly serving payment claims\n                    after the completion of merely trivial work. Second, a contract may provide that\n                    a payment claim must be served by, on or after a specified day of the month. For\n                    example, inTorpey Vander Have Pty Ltd v Mass Constructions\n                        Pty Ltd[2002] NSWCA 263 (“Torpey”), the subcontract provided that the subcontractor\n                    was entitled to make progress claims on the 25thday\n                    of each month. AlthoughTorpeyinvolved a progress\n                    claim, a contract could just as easily provide for a payment claim to be served\n                    by, on or after a specified day of the month. There would be utility in\n                    contracting that a payment claim must be served by, on or after a specified day\n                    of the month as this would allow potential defendants to know in advance when a\n                    payment claim might be forthcoming. For the rest of the month, potential\n                    defendants could be assured that they would not be served with payment claims\n                    and that any documents they received would not be taken to be a valid payment\n                    claim. For example, if a contract provides that a payment claim must be served\n                    by the 5thday of each month, a potential defendant\n                    would not have to worry from the 6thday of that\n                    month onwards (until the 1stday of the next month)\n                    that he might be served with a payment claim. In my view, reg 5(1)\n                    clarifies that if the contract does not specify that a payment claim must be\n                    served by, on or after a specified day of the month, then the default position\n                    is that a payment claim must be served “by the last day of the\n                    month” (ie, the payment claim can be served\n                    on any day of the month). 28     Considering that the overarching purpose of\n                    the SOPA is to provide persons who have performed construction work with a\n                    statutory entitlement to a progress payment, I believe that this interpretation,\n                    which places fewer fetters on what constitutes a payment claim, is more in\n                    keeping with the spirit of the SOPA and should be preferred over competing\n                    interpretations. In this regard, it is worth mentioning that s 10(4) of the\n                    SOPA contemplates the possibility of a payment claim including amounts which\n                    were the subject of earlier payment claims (and presumably for work done much\n                    earlier on under the contract). Although s 10(4) relates to amounts subject\n                    toearlier payment claimsand is thus not strictly\n                    relevant to the present application, it does evidence a legislative intent that\n                    amounts for work done in previous months could be included in a payment claim. I\n                    am cognisant that s 10(4) provides a specific mechanism for the inclusion\n                    of such amounts. However, in my view, s 10(4) was meant towidenthe scope of s 10(1) by providing anadded optionof including in a payment claim\n                    amounts which were the subject of earlier payment claims. It does not go so far\n                    as to require thatonly ifprevious payment claims\n                    have been submitted can a plaintiff subsequently claim for the\n                same.",
        "Conclusion": "29     For the foregoing reasons, I am of the view\n                    that this application should be dismissed. I will now hear the parties on\n                    costs."
    }
}