{
    "case_title": "Nirmal Singh s/o Fauja Singh\n      v\n      The Law Society of Singapore",
    "ncitation": "[2010] SGHC 336",
    "coram": "Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1       This was an application by Nirmal Singh s/o\n                    Fauja Singh (“the applicant”) to have his name restored onto the\n                    roll of advocates and solicitors of the Supreme Court of Singapore (“the\n                    Roll”) pursuant to s 102(1) of the Legal Profession Act\n                    (Cap 161, 2001 Rev Ed) (“LPA”). The applicant was 56\n                    years old and this application was his second since he was struck off the Roll\n                    in 1995. We allowed his application and we now give our reasons.",
        "Facts leading up to striking off": "2       The applicant joined the Singapore Police Force\n                    (“SPF”) in 1977 and served as an officer for more than 11 years.\n                    While serving as a Police Officer, he made profitable use of his spare time to\n                    read for an external law degree from the University of London. Through\n                    determination and hard work, he obtained his degree in 1982. Eventually, he was\n                    called to the English Bar. He left the SPF in 1989 and was admitted as an\n                    advocate and solicitor of the Supreme Court of Singapore on 8 November\n                    1989. He began his career as a legal assistant in the firm of Amarjit, Rubin\n                    & Partners. He then joined Assomull, Pereira & Partners, before moving\n                    to the firm of Gurdaib, Cheong & Narmal where he became a partner in July\n                    1993. 3       On 3 September 1993, the applicant was\n                    convicted of three charges of corruption under the Prevention of Corruption Act\n                    (Cap 241, 1993 Rev Ed) (“PCA”) and one charge of\n                    criminal breach of trust (“CBT”) under the Penal Code\n                    (Cap 224, 1985 Rev Ed). The applicant was found to have corruptly\n                    offered gratification of $3,000 to a police officer as an inducement for letting\n                    his client off from police investigations into several housebreaking offences.\n                    In the process, the court also found that the applicant corruptly solicited and\n                    received gratification of $3,000 from his client for his assistance. These three\n                    acts formed the basis of the three corruption convictions. As for the CBT\n                    charge, the court found that the applicant misappropriated an amount of $500\n                    belonging to his firm, Assomull, Pereira & Partners. In total, the applicant\n                    was sentenced to 18 months’ imprisonment and fined a sum of $5,000. He\n                    paid the fine, served the term of imprisonment, and was released, with the\n                    appropriate remission for good conduct, on 19 October 1994. 4       After the applicant’s release, a\n                    Disciplinary Committee of the Law Society of Singapore (“the Law\n                    Society”) was appointed to investigate the applicant’s conduct\n                    pertaining to his criminal convictions. The applicant admitted to the\n                    professional misconduct charges, and the Disciplinary Committee found that\n                    sufficient cause existed for disciplinary action to be taken against him. The\n                    Law Society thereafter applied for an order requiring the applicant to show\n                    cause why he should not be dealt with under s 83(1) of the LPA. At the\n                    conclusion of the show cause proceedings on 1 December 1995, the court of\n                    three judges ordered the applicant be struck off the Roll. 5       On 3 April 2001, and after a lapse of about\n                    5 years, the applicant filed his first application for reinstatement. Upon\n                    consideration of all the facts up until the application, the court of three\n                    judges dismissed that application. The court found the application premature and\n                    that it was not satisfied that the applicant could have been fully reformed and\n                    rehabilitated in that relatively short time period since his striking off.\n                    Moreover, it was not satisfied that the public would be adequately protected if\n                    the applicant was allowed back into legal practice at that point of time. The\n                    full decision of the court can be found atRe Nirmal Singh\n                        s/o Fauja Singh[2001] 2 SLR(R) 494 (“Nirmal Singh 1”).",
        "Applicant’s conduct subsequent to striking off and up to the\n                making of the present application": "6       After the applicant was struck off the Roll, he\n                    had been gainfully employed as a human resource and legal manager in three\n                    different companies: Sin Seng Huat International Group of Companies\n                    (2 January 1996 to 30 June 2004), Midwest Group of Companies\n                    (1 October 2004 – 5 May 2006), and Wei Yang Cosmetics\n                    International Pte Ltd & Antibac Laboratories Pte Ltd (30 May 2006\n                    – Present). The applicant deposed that he was upfront with his three\n                    employers about his past, disclosing to all of them his convictions as well as\n                    the fact that he has been struck off the Roll. In the course of his employment\n                    with them, they gave the applicant substantial administrative and financial\n                    responsibilities, including the handling of money. 7       Other than being gainfully employed, the\n                    applicant also deposed that he sought spiritual help, and in doing so,\n                    volunteered his time to his religious organisations. Since 1996, the applicant\n                    regularly attended his Sikh temple, and as part of his own rehabilitation\n                    efforts, volunteered to serve and cook food and wash dishes for his\n                    congregation. Additionally, since 2001, he had also been involved in the monthly\n                    counting of donations offered by the devotees who pray at the temple. From 2003\n                    onwards, the applicant served as a volunteer with the Sikh Welfare Council,\n                    which runs various community and humanitarian projects. One of these projects\n                    was the counselling of Sikh prisoners, to which the applicant devoted his time\n                    every Saturday since 2005. 8       Even though the applicant had been struck of the\n                    Rolls, it was evident that he still kept in touch with the law. Between 2000 and\n                    2002, the applicant furthered his education and obtained a Master of laws from\n                    the University of London. 9       Since the applicant was struck off the Roll on\n                    1 December 1995, he did not have any further major brushes with the law.\n                    However, in accordance with paragraph 7 of the Law Society of Singapore\n                    Council’s Guidance Note 2 of 2009, the applicant disclosed that he was\n                    issued with two notices for regulatory offences. One notice was from the Land\n                    Transport Authority for the offence of driving in a bus lane during restricted\n                    hours, and another notice was from the Housing Development Board for a parking\n                    offence. In both cases, the applicant deposed that the notices were later\n                    rescinded after he wrote to the respective authorities to explain the\n                    circumstances leading up to those offences. The applicant further disclosed that\n                    he was a respondent in an ongoing civil matter in Punjab where the subject\n                    matter of the dispute concerned the distribution of ancestral property that\n                    belonged to his late father.",
        "Present application": "10     This court’s power to reinstate an\n                    advocate and solicitor back onto the Roll is governed by s 102 of the LPA.\n                    It provides: Replacement on roll of solicitor who has\n                            been struck off 102. —(1) Where the name of a\n                        solicitor has been removed from, or struck off, the roll, the court may, if\n                        it thinks fit, at any time order the Registrar to replace on the roll the\n                        name of the solicitor — (a)    free from conditions; or (b)    subject to such conditions as the court thinks\n                                fit. (2)    Any application\n                            that the name of a solicitor be replaced on the roll shall be made by\n                            originating summons, supported by affidavit, before a court of 3 Judges\n                            of the Supreme Court of whom the Chief Justice shall be\n                        one. (3)    The originating summons\n                            shall be served on the Society which shall — (a)    appear at the\n                                hearing of the application;\n                                and (b)    place before the\n                                court a report which shall include — (i)    copies of the record of any proceedings as\n                                    the result of which the name of the solicitor was removed from\n                                    or struck off the roll; and (ii)   a statement of any facts which have\n                                    occurred since the name of the solicitor was removed from or\n                                    struck off the roll and which, in the opinion of the Council or\n                                    any member of the Council, are relevant to be considered or\n                                    investigated in connection with the application. 11     The decision whether to allow an application\n                    for reinstatement to the Roll is a matter entirely within the court’s\n                    discretion. The considerations which are germane to such an application were\n                    examined in these recent cases, namely,Re Chan Chow\n                        Wang[1983-1984] SLR(R) 55,Re Lim\n                        Cheng Peng[1987] SLR(R) 582,Re Ram\n                        Kishan[1992] 1 SLR(R) 260,Knight\n                        Glenn Jeyasingam v Law Society of Singapore[2007]\n                    3 SLR(R) 704 (“Glenn\n                    Knight”),Narindar Singh Kang v Law Society\n                        of Singapore[2007] 4 SLR(R) 641 (“Narindar”),Gnaguru s/o\n                        Thamboo Mylvaganam v Law Society of Singapore[2008]\n                    3 SLR(R) 1 andKalpanath Singh s/o Ram Raj Singh v\n                        Law Society of Singapore[2009] 4 SLR(R) 1018\n                        (“Kalpanath”). The following\n                    broad principles may be extracted therefrom: (a)    The order for restoration is discretionary and is\n                            to be exercised judicially; (b)    The outcome of each application must necessarily\n                            depend on the precise circumstances of the case itself; precedents are\n                            useful only for the principles they enunciate but not in relation to the\n                            outcome; (c)    The applicant bears the onus of convincing the\n                            court that he has been fully rehabilitated and is now a fit person to be\n                            restored to the roll and that he is a person on whose integrity and\n                            honour reliance may be placed by the public; (d)    The court’s primary duty in the\n                            consideration of the application is in ensuring the protection of the\n                            public and the public confidence in the general reputation of the legal\n                            profession (e)    The court is not bound by the observations of the\n                            Attorney-General and/or the Law Society but their views would be given\n                            due weight and consideration as the Attorney General is charged with the\n                            duty of safeguarding the public interest and the Law Society is one of\n                            the guardians of the legal profession; (f)    The application for restoration is subjected to\n                            stricter scrutiny than an application by a new entrant to the\n                            profession; (g)    There is no fixed time frame for restoration but a\n                            significantly longer period than five years after striking off should\n                            elapse before an applicant applies for reinstatement; and (h)    An applicant will not generally be prevented from\n                            being reinstated unless in the most exceptional or egregious\n                            circumstances. 12     In support of this application, counsel for\n                    the applicant Mr Davinder Singh, S.C. made three main submissions. First, he\n                    submitted that an adequate period of time had lapsed between the time the\n                    applicant was struck off the Roll and the making of this second application.\n                    Secondly, he argued that in the course of the last 14 years, the applicant had\n                    been completely repentant and had awoken to the importance of honour and\n                    principle in relation to the profession. Thirdly, that the reinstatement of the\n                    applicant to the Roll would neither endanger the public nor diminish public\n                    confidence in the general reputation and standing of the legal profession. In\n                    reply, counsel representing the Law Society Mr N Sreenivasan, and\n                    State Counsel Ms Ching Sann representing the Attorney-General, submitted\n                    that there were no objections against the application provided that conditions\n                    were imposed onto his practising certificate restricting,inter alia, his capacity to hold client monies and practising as\n                    a sole proprietor for a pre-determined period of time. 13     Applying the principles set out in[11]above, and having considered all the\n                    circumstances of the case, including the arguments advanced by counsel for the\n                    applicant as well as the positions taken by the Attorney General and the Law\n                    Society, we were satisfied that this was an appropriate case to exercise our\n                    discretion in favour of the applicant. We will now elaborate on the basis of our\n                    decision.",
        "Rehabilitation": "14     In the words of the court inKalpanath(at [19]), the threshold factor which the\n                    court must carefully consider in every application for reinstatement is\n                    “the extent to which the applicant has rehabilitated himself. Nothing\n                    short of full rehabilitation will do”. Therefore, first, we needed to be\n                    satisfied that the applicant was fully rehabilitated and was no longer a danger\n                    or risk to the public if he were to be reinstated onto the Roll. The applicant\n                    was charged and convicted of two types of offences (corruption and criminal\n                    breaches of trust), both of which involved dishonesty. It was therefore vitally\n                    important to the court that he had realised the error of his past ways and\n                    demonstrated by positive acts or conduct that he was not likely to repeat\n                    similar wrongs. 15     In this respect, we noted that when the\n                    applicant secured his subsequent employment after being struck off the Roll (see[6]above) he was upfront with his\n                    employers as to his past wrongdoings. Notwithstanding this disclosure, the\n                    employers believed in him, took him on and even entrusted him with financial\n                    responsibilities involving the handling of money. He did not disappoint them. He\n                    lived up to the high standard expected of him and exhibited qualities of honesty\n                    and integrity. These qualities have been extolled in testimonials written by the\n                    directors of the companies who employed him. The Managing Director of the Sin\n                    Seng Huat International Group of Companies, where the applicant was employed for\n                    a continuous period of eight year after being struck off (and which period also\n                    straddled the time when the applicant first applied for restoration onto the\n                    Roll), recited how the applicant was entrusted with large sums of money, how the\n                    applicant honestly accounted for all monies received from the rentals of the\n                    company’s property in Australia, and how the applicant never breached any\n                    trust reposed in him when he was empowered by the company’s board of\n                    directors to deal with their bankers. Equally notable was the fact that after\n                    the applicant left the employ of this company, the applicant continued to be\n                    entrusted with comparable financial responsibilities and powers in the two\n                    companies he was subsequently employed in until the date of this application. We\n                    were impressed with what the third employer wrote about him and here we need\n                    only quote one paragraph of the employer’s letter: In the course of my dealing [sic] with\n                        Nirmal, I find him to be a humble, responsible and an honest person who\n                        discharges his duties honestly. He is a trustworthy person and has not\n                        breach [sic] the trust which the Company and I\n                        have placed in him. In the course of his duties, Nirmal has received money\n                        and made payments on behalf of the Company and in all these instances he has\n                        acted honestly and with propriety. He has been honest even to the point of\n                        pointing out discrepancies in payments made by the Company to third parties\n                        when he could have ignored them resulting in financial loss to the\n                        Company. 16     The testimonials given by all his employers\n                    were unanimous in their praise for the applicant and all of them vouched for the\n                    applicant’s honesty, responsibility, reliability, trustworthiness and\n                    integrity. It stands to reason and common sense, that in circumstances such as\n                    the present case, one of the best ways to gauge whether a person who had\n                    previously done wrong has reformed is to see how he has conducted himself\n                    post-striking off, particularly in employment where he was entrusted with\n                    responsibilities, financial or otherwise. Testimonials of such employers should\n                    thus carry weight since they would have worked in close proximity with the\n                    applicant and observed his conduct, including his general attitude (such as\n                    whether he is someone who has the tendency to sail close to the wind). In this\n                    case, we had no doubt that the employers, having known of his background, would\n                    understandably be cautious about the applicant’s handling of financial\n                    responsibilities. The fact that he had managed to gain the confidence of the\n                    management of all three companies, which not only did not have any complaint\n                    against him but spoke highly of him as an employee, bore testament to his\n                    rehabilitation. 17     We should also add that besides the character\n                    references of his employers, the applicant had also obtained testimonials from\n                    seven senior members of the Bar, all of whom are of more than twenty years\n                    standing and who knew him well. From 2003, he became involved in community work,\n                    being a volunteer with the Sikh Welfare Council where he took part,inter alia, in fund raising and visiting the sick and\n                    infirm in hospitals. From 2005, he became a volunteer counsellor with the\n                    Singapore Prison Service and devoted his Saturdays to counselling Sikh prisoners\n                    to help them mend their ways and, in so doing, atone for his own past\n                    transgressions. 18     In the premises, we were satisfied that the\n                    applicant had reformed and was unlikely to pose a danger or a risk to the public\n                    if he were to be again accorded a position of trust upon reinstatement onto the\n                    Roll.",
        "Confidence in the profession and public interest": "19     We also found that the applicant’s\n                    reinstatement would not diminish public confidence in the reputation and\n                    standing of the legal profession. In a sense, this point raises the issue as to\n                    how society should view wrongdoings by a professional who holds a position of\n                    trust. Is it correct to say that just because an advocate and solicitor has done\n                    wrong involving dishonesty, he should be damned forever and never again to be\n                    allowed to practise as such? Will that be just? 20     In this regard, we noted that a major campaign\n                    which has been undertaken for a few years now is the Yellow Ribbon project which\n                    aims to give offenders a second chance in society with a call to employers not\n                    to shun such persons. Of course, we recognise that there is a difference between\n                    wrongdoing by an ordinary individual and a professional like an advocate and\n                    solicitor in whom trust is reposed by clients. On the other hand, even for\n                    wrongdoings involving dishonesty there are varying degrees of severity or\n                    gravity, and in turn culpability. All such wrongdoings could well lead to\n                    disbarment. As noted by this court inNarindar(at\n                    [42]), “...there are certain offences which are less serious but which\n                    nevertheless meet the threshold requirement that will result in the advocate and\n                    solicitor concerned being struck off the roll”. While this court takes a\n                    serious view of any wrongdoing involving dishonesty by advocates and solicitors,\n                    we are also mindful that even as between wrongdoings involving dishonesty there\n                    will be differences as to seriousness. Consequently, there is a need to maintain\n                    a sense of proportionality and fairness. Moreover, it would also be in the\n                    interest of society to promote redemption: seeKalpanath(at [23]). Except in the most egregious of offences,\n                    and we did not think that the wrongdoings of the applicant here fell within that\n                    category, this court would not rule out reinstatement of an advocate and\n                    solicitor who have been struck off. What was clear from precedents was that the\n                    greater the severity of the offences committed, the longer would be the\n                    intervening period before this court would consider reinstatement. As observed\n                    by Chan Sek Keong CJ inGlenn Knight(at\n                    [43]): Each case must be decided on its own facts. One of the most important\n                        considerations must be the nature of the transgression that had resulted in\n                        his disbarment in the first place. The transgression, in terms of its\n                        criminality and its gravity, will invariably feature prominently in the\n                        court’s assessment of the adequacy of the period of time that has\n                        lapsed since the applicant has ceased practice. A similar position was also taken, and further explained in the case\n                    ofNarindar(at [44]): Indeed, the natural public expectation would be that an\n                            advocate and solicitor who has committed a particularly serious offence\n                            would have to wait a longer period to be restored to the roll compared\n                            to one who had committed a less serious offence, regardless of whether\n                            or not the same (or a similar) offence was likely to be committed in the\n                            future. We would go so far as to say that this would be an\n                        expectation held by all concerned (including those within the legal\n                        profession itself)simply because it accords with logic,\n                            common sense and justice. [emphasis in original] 21     Accordingly, what would constitute an adequate\n                    intervening period must be ascertained with regard to the severity of the\n                    offences that led to the applicant being struck off. The applicant’s\n                    counsel seemed to suggest during oral submissions before us that the seriousness\n                    of the applicant’s offences was mitigated by the fact that those offences\n                    were committed by the applicant during the relative infancy of his legal\n                    practice. We could not see any merit to this argument. While it is true that the\n                    offences were committed a few months after the applicant was admitted to the Bar\n                    on 8 November 1989, by the time the applicant left the SPF in 1989, he had\n                    served more than 11 years in law enforcement. The applicant was no babe in the\n                    woods and he must have known full well what he was doing, and the consequences\n                    that would follow when he solicited, accepted and offered a bribe to a police\n                    officer. In view of the applicant’s background and the nature of the\n                    offences committed, we had no hesitation in rejecting the argument that the\n                    offences were committed due to his lack of professional experience. Indeed, one\n                    does not need to be a lawyer to know that what the applicant did was wrong. We\n                    would hasten to add that while we were not with him on this point, we were in no\n                    way suggesting that his offence was so severe and the circumstances so\n                    despicable that he should be barred for good. We were of the overall view that,\n                    in the circumstances of this case, 14 years was a sufficiently long intervening\n                    period of time to enable the court to determine if the applicant had truly\n                    reformed and turned over a new leaf or if any public concern would arise if he\n                    were to be restored to the Roll. 22     The matter that caused us to ponder a little\n                    more in our consideration of this case related to the question of public\n                    interest. Would it be perceived that this court had too readily condoned the\n                    offences committed by the applicant some 20 years ago? By any standard, twenty\n                    years (or even fourteen years if we reckon as from the date of striking off)\n                    cannot be said to be an insignificant period in the life of an individual. The\n                    applicant here has paid for the wrongs he had done under both ordinary criminal\n                    law and the disciplinary rules of the profession. Punishment should not be the\n                    sole value of society. Redemption should also have a part to play. A balance has\n                    to be struck. InKalpanath, this court adopted a\n                    broader definition of public interest, one that encourages redemption. There,\n                    this court stated (at [23]): We believe that one... common value [our society may adopt] is forgiving\n                        those who have trespassed against us. We would also concur with Kirby P that\n                        there is a public interest in encouraging the rehabilitation of those who\n                        have gone astray and allowing those who are now reformed, to re-enter\n                        society and contribute to its well-being. Further, we would agree, as\n                        counsel for the Applicant urged this Court during the hearing, that the\n                        Court has,inter alia, a redemptive role\n                        especially in an application for reinstatement to the Roll. 23     In every case of reinstatement, the court has\n                    to resolve the tension between the protective and redemptive elements of public\n                    interest. While the redemptive element is essential, and must be considered in\n                    all cases, the weight to be given to this element must differ from case to case.\n                    For example, the longer the period of disbarment, or the lesser the severity of\n                    the offences committed, the greater will be the weight the redemption element\n                    will be accorded in the mind of this court. In this application, as a\n                    substantial period of time had lapsed since the applicant’s striking off\n                    and since he has shown remarkable rehabilitation, there was correspondingly a\n                    lesser need for this court to exercise its protective role. In turn, it would be\n                    consistent for this court to exercise its redemptive role. All things\n                    considered, we were satisfied that the applicant had been fully rehabilitated\n                    and was fit to be reinstated onto the Roll.",
        "Conditions": "24     We now turn to the conditions which the Law\n                    Society proposed to be imposed on the applicant’s practising certificate\n                    if this court was inclined to reinstate the applicant onto the Roll, and which\n                    proposal was supported by the Attorney-General. In the light of certain comments\n                    which this court made in the course of the oral hearing, and which both the Law\n                    Society and the Attorney-General accepted, the eventual conditions imposed on\n                    the applicant were as follows: (a)that he not practise as a partner or director of\n                            any law practice for a period of 2 years, but not as a sole proprietor\n                            for 5 years;(b)that he not hold or receive client money and/or\n                            trust money for a period of 5 years;(c)that he not act as a signatory to any client or\n                            trust account of a Singapore law practice for a period of 2\n                            years;(d)that, for a period of 2 years, he should be\n                            employed in a law practice with a sole proprietor or director or partner\n                            who should be of at least 12 years standing, and such supervisor shall\n                            notify the Law Society of Singapore that he has undertaken such a\n                            responsibility;(e)all legal work undertaken by him in the law\n                            practice in the said 2 year period is to be overseen by that supervisor;\n                            and(f)that within 6 months hereof, he is to complete at\n                            least 10 hours of ethics training conducted by the Law Society of\n                            Singapore.25     It seemed to us that these conditions were\n                    proposed out of abundance of caution and were intended to serve dual purposes.\n                    First, they were to remove any lingering doubts which the public might entertain\n                    as to the honesty or integrity of the applicant. Second, bearing in mind that\n                    the applicant had been out of touch with practice for a long period of time,\n                    some of the conditions would facilitate his return to the profession in a manner\n                    which would enable him to competently discharge his services to his clients,e.g., supervision for two years. We were\n                    satisfied that these conditions were useful and we endorsed them.Conclusion26     To recap, in relation to his first application\n                    for reinstatement, the court was of the view that the offences committed by the\n                    applicant were grave and there was then an insufficient intervening period to\n                    assess whether he was fully rehabilitated. That application was considered\n                    premature. In the present application, while we again acknowledged the gravity\n                    of the offences, a more substantial period of time had elapsed and also more\n                    material was presented to this court that enabled us to make a better assessment\n                    of his rehabilitation. Having considered how the applicant had conducted himself\n                    in the last 14 years, we were satisfied that the applicant had adequately\n                    demonstrated his full rehabilitation, and we were also satisfied that it would\n                    not be against public interest to reinstate him onto the Roll. Accordingly, we\n                    allowed his application and made no order as to costs.",
        "Conclusion": "26     To recap, in relation to his first application\n                    for reinstatement, the court was of the view that the offences committed by the\n                    applicant were grave and there was then an insufficient intervening period to\n                    assess whether he was fully rehabilitated. That application was considered\n                    premature. In the present application, while we again acknowledged the gravity\n                    of the offences, a more substantial period of time had elapsed and also more\n                    material was presented to this court that enabled us to make a better assessment\n                    of his rehabilitation. Having considered how the applicant had conducted himself\n                    in the last 14 years, we were satisfied that the applicant had adequately\n                    demonstrated his full rehabilitation, and we were also satisfied that it would\n                    not be against public interest to reinstate him onto the Roll. Accordingly, we\n                    allowed his application and made no order as to costs."
    }
}