{
    "case_title": "Public Prosecutor\n      v\n      AOF",
    "ncitation": "[2010] SGHC 366",
    "coram": "Tay Yong Kwang J",
    "sections": {
        "Introduction": "1       The accused was born in November 1975. He is now\n                    35 years old. He was last residing in a one-bedroom rental flat (“the\n                    flat”) in the Ang Mo Kio public housing estate with his wife and three\n                    children. He married his wife in 1992. He divorced her by consent in the Syariah\n                    Court in February 2010 in the matrimonial proceedings commenced by her, while he\n                    was in custody in respect of the present case. Their three children comprise two\n                    daughters (referred to henceforth as C1 and C2) and a son (C3). C1 was born in\n                    March 1993 and is now 17 years old. She is the complainant in the charges\n                    against the accused. C2, born in 1997, is now 13 years old while C3, born in\n                    2001, is now 9 years old.",
        "The charges": "2       The accused, who conducted his own defence\n                    initially, claimed trial to the following five charges: That you, [accused], (1)sometime in 1999, in [the flat], voluntarily had\n                            carnal intercourse against the order of nature with [C1] (DOB: xx March\n                            1993), to wit, by having the said person perform fellatio on you, and\n                            you have thereby committed an offence punishable under section 377 of\n                            the Penal Code, Chapter 224 (1985 Rev Ed). (2)on one occasion in the period from March 2003 to\n                            May 2003, in [the flat], committed rape on [C1] (DOB: xx March 1993),\n                            while she was under the age of 14 years, and you have thereby committed\n                            an offence punishable under section 376(2) of the Penal Code, Chapter\n                            224 (1985 Rev Ed). (3)sometime in June 2003, in [the flat], committed\n                            rape on [C1] (DOB: xx March 1993), while she was under the age of 14\n                            years, and you have thereby committed an offence punishable under\n                            section 376(2) of the Penal Code, Chapter 224 (1985 Rev\n                        Ed). (4)sometime in 2004 (1stoccasion) which was after xx March 2004, in [the flat], committed rape\n                            on [C1] (DOB: xx March 1993), while she was under the age of 14 years,\n                            and you have thereby committed an offence punishable under section\n                            376(2) of the Penal Code, Chapter 224 (1985 Rev Ed). (5)on 29thday of April\n                            2009 at about 2.30pm, in [the flat], used criminal force on [C1]\n                            intending to outrage her modesty, to wit, by undoing one button at the\n                            front of her blouse, and further, in order to facilitate the commission\n                            of the said offence, you voluntarily caused wrongful restraint to the\n                            said [C1], to wit, by grabbing her right wrist with your hand, and you\n                            have thereby committed an offence punishable under section 354A(1) of\n                            the Penal Code, Chapter 224. The date redacted in the first line of the fourth charge set out\n                    above was C1’s date of birth. The last charge was amended by the court at\n                    the conclusion of the prosecution’s case by deleting\n                    “undoing” and substituting the words “attempting to\n                    undo”. Four other charges (alleging fellatio in 2000 and rape in 2004, in\n                    July 2006 and in November 2006 in the flat) were stood down. 3       At the conclusion of the trial, the accused was\n                    convicted on the five charges that the prosecution proceeded on (with the last\n                    charge amended as indicated above). The prosecution then withdrew the remaining\n                    four charges pursuant to section 177 of the CPC (Cap 68) and the accused\n                    was granted a discharge amounting to an acquittal on those four charges\n                    accordingly. 4       As mentioned earlier, the trial commenced with\n                    the accused conducting his own defence and speaking through a Malay interpreter.\n                    After 12 prosecution witnesses had testified (including C1 on 26 August\n                    2010), on Friday, 27 August 2010, the accused informed the court that\n                    his family wished to engage defence counsel for him. This was confirmed by the\n                    accused’s father. The court then adjourned the trial to Monday\n                    30 August 2010 for the family to do so. 5       On 30 August 2010, the present defence\n                    counsel attended court and confirmed that they had been instructed to act for\n                    the accused. They applied for time to study the papers and to take further\n                    instructions. I directed that defence counsel be provided with the necessary\n                    documents and the notes of evidence recorded thus far and adjourned the trial. I\n                    was of the view then that the trial, when it resumed, should carry on from where\n                    it stopped, with no recall of the prosecution witnesses. 6       At the start of the continued hearing, defence\n                    counsel informed the court that, after having perused the notes of evidence and\n                    interviewed defence witnesses, it was necessary to recall four prosecution\n                    witnesses for the purpose of cross-examination only. The prosecution had no\n                    objection to the recall. The four prosecution witnesses recalled were PW 6\n                    (SSSGT Mohamed Lathiff) (“Lathiff”), PW 9 (Dr Cindy Pang), PW\n                    10 (ex-wife of the accused and mother of C1 – hereinafter referred to as\n                    “the mother”) and PW 12 (C1).",
        "The prosecution’s case": "7       The arrest of and the charges against the\n                    accused came about this way. A few days before 29 April 2009, the mother\n                    and the three children moved out of the flat after the mother and the accused\n                    quarrelled. They went to stay with the children’s maternal grandmother in\n                    the Yishun housing estate. Apparently, moving out with the mother after their\n                    parents quarrelled was not new to the children. 8       Sometime past 2pm on 29 April 2009, C1\n                    returned to the flat to collect some items which she needed for school and which\n                    had been left in the flat when she moved out. The accused returned to the flat\n                    and, noticing that C1 was in the bedroom, went in to talk to her, sitting a few\n                    feet away from her. He grabbed her right wrist with his left hand and tried to\n                    undo the first button (the one just below the collar button) of her school\n                    blouse. During the struggle, C1 used her mobile phone to call the mother (with\n                    whom she had agreed to go shopping and whom she had arranged to meet at a fast\n                    food outlet at Ang Mo Kio Central) and informed her that she was leaving the\n                    flat. Unlike an earlier telephone call, the mother noted that C1 was speaking in\n                    a trembling voice and sounded sad. The accused stopped his actions. She then\n                    left the flat quickly and went to meet the mother. 9       The mother noticed that C1 looked like she had\n                    been crying although she had sounded delighted earlier when the mother told her\n                    that she was going to buy her some clothes. Upon questioning, C1 informed her\n                    mother tearfully that the accused wanted to have sex with her again. The mother\n                    was shocked upon hearing the revelation that C1 and the accused had sex before\n                    and asked C1 to swear upon God that she was speaking the truth. When C1 did so,\n                    she brought her to the Ang Mo Kio South neighbourhood police centre\n                    (“NPC”) to lodge a police report. For more details about the\n                    events on 29 April 2009, see also[22]to[24]below. 10     At the NPC, they approached a female officer.\n                    C1 was crying. The female officer tried to calm her down. C1 informed her that\n                    she had been raped by her father. The female officer then telephoned Lathiff of\n                    Ang Mo Kio Police Division who instructed her to lodge a police report for C1\n                    and to ask the mother and C1 to go to the said Police Division to meet him. A\n                    male police officer then typed the report (exhibit P 18) which C1 signed. Under\n                    “Brief details”, it was stated, “Sometime in year 2006, I\n                    was raped by my father one [name of accused, his NRIC no.] at [the flat]. Under\n                    “Date/Time of Incident”, it was stated, “12/07/2006 23:55\n                    – 12/07/2006 23:55”. The date and time of the said report were\n                    stated as “29/04/2009 16:48”. 11     At the Police Division, Lathiff spoke to C1.\n                    Later that evening, PW 7, SI Chandra Seakeran (“the IO”) of\n                    Serious Sexual Crimes Branch (“SSCB”), CID, arrived and also spoke\n                    to C1. The next day, 30 April 2009, the police arrested the accused at the\n                    flat. 12     On 5 May 2009, the accused was examined\n                    by a doctor from Changi General Hospital and found not to be suffering from\n                    erectile dysfunction. On 18 and 25 May 2009, the accused was examined by\n                    Dr Seng Kok Han, a psychiatrist from the Institute of Mental Health, and\n                    found to have no mental illness. The accused informed the psychiatrist that he\n                    never had sexual intercourse or any other sexual activity with C1. He also told\n                    the psychiatrist that although he was not close to C1, they did not have major\n                    conflicts and he did not know why C1 accused him of rape. During the second\n                    session with the psychiatrist, the accused was tearful when he said that he\n                    might plead guilty in order not to get C1 into trouble. 13     On 3 June 2009, C1 was examined by\n                    Dr Cindy Pang of the Department of Obstetrics and Gynaecology, Singapore\n                    General Hospital. C1 informed the doctor that she had her menarche at age 11\n                    (see[19]below for the significance of\n                    this) and provided a general history of the alleged sexual acts between the\n                    accused and her. The doctor noted (exhibit P 11): On examination, the patient appeared calm and looked her age. There were\n                        no signs of peripheral injury. Secondary sexual development was appropriate\n                        for her age. Her hymen was deficient posteriorly, with old tears at the 2\n                        and 9 o’clock position, suggestive of previous penetration. Her anal\n                        tone was normal and there were no fissures seen. Dr Cindy Pang explained that when she interviewed C1, she focused\n                    on the history pertaining to penetration and not on non-penetrative episodes.\n                    She opined that it was unlikely that the tears were caused by sports or dancing\n                    unless there was penetration by some object. In her view, a posteriorly\n                    deficient hymen was not more susceptible to tears as compared to a normal\n                    one. 14     C1 was examined by Dr Lim Choon Guan, a\n                    psychiatrist in the Department of Child and Adolescent Psychiatry, Institute of\n                    Mental Health, on 5 June 2009. She gave the psychiatrist a general history of\n                    the sexual acts allegedly committed by the accused on her. The psychiatrist\n                    noted that C1 was able to give a clear and detailed account of the alleged\n                    events. He also noted that she would become teary-eyed at times but was still\n                    able to hold her composure, that her mood was not depressed and her thoughts\n                    were coherent and logical. C1 was assessed to be functioning in the average\n                    range of intellectual functioning. The psychiatrist opined that C1 was not\n                    suffering from any major mental illness and did not exhibit any symptom of\n                    post-traumatic stress disorder, was fit to testify in court and was aware of the\n                    nature and quality of the acts alleged. C1 was referred for counselling with the\n                    Child Guidance Clinic’s medical social worker but did not turn up for the\n                    appointment on 25 June 2009. The psychiatrist also interviewed the mother\n                    on 5 June 2009. He recorded that she declined the institute’s request\n                    to obtain a report on C1 from her school. 15     C1 testified in open court. I turned down the\n                    prosecution’s application (made at the start of her testimony during the\n                    first hearing and renewed when she was recalled for cross-examination at the\n                    resumed hearing) to allow her to testifyin\n                    camera. However, the usual order prohibiting the publication of her\n                    photograph, name and particulars was made. 16     C1 told the court that the accused started\n                    engaging in sexual acts with her in 1999 when she was 6 years old and still in\n                    kindergarten. The first incident occurred at around midnight in the living room\n                    of the flat when C2 was asleep in the bedroom and the mother was on night shift\n                    work. C3 was not born yet. C1 was sleeping with C2 in the bedroom when the\n                    accused went to wake C1 up and then pulled her to the living room. He told her\n                    to sit next to him on the mattress. C1 was in her pyjama dress. He lay down on\n                    the mattress, wearing only his shorts. The television was on but the house\n                    lights were off. A while later, the accused pulled down his shorts and told C1\n                    to hold his penis. When she did so, the penis was erect. He then asked her to\n                    perform fellatio on him. She complied for a few minutes and noticed\n                    “white liquid” coming out from the penis. At that time, she did\n                    not know what was going on. 17     When C1 was in primary 4, one night sometime\n                    after her birthday in March 2003 and before June 2003, the accused asked her to\n                    watch television with him in the living room. C1 was watching television in the\n                    bedroom then and C2 and C3 were asleep in the bedroom. The mother was on night\n                    shift work. When C1 went out to the living room, the television screen there was\n                    showing a naked man on top of a naked woman. C1 did not understand what was\n                    going on. She sat down next to the accused while he lay on the mattress, wearing\n                    only shorts. He then exposed his penis and told her to hold it. As she did so,\n                    he inserted his finger into her vagina. She felt pain and tried to push his hand\n                    away. He then told her to suck his penis and she complied. After a while, he\n                    made her lie down on the mattress and he removed her panties. He then held her\n                    legs apart and inserted his penis into her vagina. She felt him moving back and\n                    forth. She felt a lot of pain and tried to push him away but he was too strong.\n                    After he ejaculated his “white liquid” on her stomach, he told her\n                    to wash up and go to sleep. She followed all the instructions given to her as\n                    she was afraid of the accused. 18     During the school holidays in June 2003, much\n                    the same thing happened in the living room. C2 and C3 were sleeping in the\n                    bedroom and the mother was working on night shift. The accused had sexual\n                    intercourse with C1 after using his finger to penetrate her vagina while she\n                    held his penis and after asking her to perform fellatio on him. 19     After her birthday in March 2004, the accused\n                    raped C1 twice (one occasion was the subject of the fourth charge set out at[2]above and the other was the subject\n                    of one of the stood down charges). She reached puberty around May that year. One\n                    incident of rape took place before her puberty and the other occurred after her\n                    puberty. The rapes happened in much the same sequence as the earlier ones\n                    described above. 20     C1 was in primary 5 in 2004. That year, there\n                    was sex education conducted in her school. It was then that she realized that\n                    what had happened between her and the accused was wrong. She contemplated\n                    telling the mother about what the accused had done but decided against it as she\n                    did not want the mother to be unhappy. This was because she was afraid that the\n                    mother would confront the accused and he would beat the mother up, as he had\n                    done on other occasions when they quarrelled. She also did not know how to\n                    explain to the mother about the incidents. She did not tell her teachers or her\n                    classmates then as she did not know how to do so and was afraid they would not\n                    believe her. 21     C1 was not close to the accused. They only\n                    communicated with each other regarding her school work. He was very strict with\n                    her and would make her do her school work in front of him, scolding her if she\n                    got the answers wrong and sometimes not allowing her to have dinner until she\n                    completed her school work. C1 felt that the accused treated C2 better than he\n                    treated her. 22     On 29 April 2009, C1 was supposed to go\n                    shopping at Ang Mo Kio Central with the mother after school. They arranged to\n                    meet at the bus stop near the KFC restaurant there. Sometime after 2pm, C1\n                    headed for the flat to pick up some school materials left behind when she moved\n                    out with the mother and the two siblings. She had her own key to the flat. The\n                    accused was not home when she arrived at the flat. While she was in the bedroom,\n                    she received an SMS from the mother asking where she was and what time she would\n                    be leaving the flat. C1 replied that she was already in the flat and was\n                    retrieving some school materials. 23     About ten minutes later, the accused went home\n                    to the flat too. He went into the bedroom and asked C1 about her studies and her\n                    siblings and enquired whether they would be returning home. When C1 sat on the\n                    floor to put on her socks, the accused also sat down a short distance away. He\n                    held her right wrist with his left hand and pulled her towards him. She stood\n                    up. Using his right hand, he attempted to undo the button below the collar\n                    button of her blouse. She protested in Malay, saying that she did not want to do\n                    it, meaning that she did not wish to have sex. The accused replied in Malay,\n                    saying that it was not as if she had not done it before. There was a struggle\n                    and she managed to take out her mobile phone from her skirt’s right\n                    pocket. She warned him that she was going to call the mother and he tried to\n                    close the flip on her mobile phone in order to stop her from doing so. However,\n                    she pressed the redial button and the call went through. C1 asked the mother\n                    where she was and the mother told her that she was on a bus to their agreed\n                    rendezvous point. The mother asked C1 where she was and she replied she was\n                    going out of the flat already. C1 then quickly took her school bag and shoes and\n                    left the flat. The accused did not try to prevent her from doing\n                so. 24     C1 was crying as she walked to meet the\n                    mother. She deliberated on whether to inform the mother about the incident with\n                    the accused in the flat. When they met, she tried to stop crying, only to burst\n                    out in tears again when C3 asked her why she was crying. She managed to utter\n                    only the words, “Daddy, daddy” when the mother asked why she was\n                    crying. The mother then asked her whether the accused had scolded her or beaten\n                    her up. She told the mother in Malay that the accused “wanted to do it\n                    again”. When the mother asked her to elaborate, she used the Malay word\n                    “main” (meaning “play”) to explain that he wanted\n                    sex. The mother asked her whether the accused put his penis into her vagina and\n                    she confirmed that he did. The mother then asked her to swear upon God that what\n                    she was telling her was true. When C1 did so, the mother brought her to the NPC\n                    in a taxi. In the taxi, the mother asked C1 to re-affirm that everything she\n                    said was the truth and C1 did so. The mother asked her whether it was\n                    “sedap” (or nice) and C1 said it was not. She asked this question\n                    to see whether C1 was a willing participant in the sex acts. C1 felt a sense of\n                    relief that she had finally unburdened her secrets to the mother. However, she\n                    also feared that the accused’s family members would not believe her or\n                    would blame her for making a police report against the accused. 25     C1 also testified about another incident that\n                    took place in the flat in 2004 (not the subject of any charge). She claimed that\n                    one day when she and C2 were in the bedroom, the accused went in and asked C2 to\n                    go out as he wanted to help massage C1’s back. After C2 left the bedroom,\n                    the accused closed the room door and latched it. He then asked C1 to perform\n                    fellatio on him. She recalled this incident as it happened a few months after\n                    her puberty and she was having cramps at that time. 26     In 2006, when C1 was in secondary 1, the\n                    accused raped her again. In April that year, she ran away from home. During the\n                    three days away from home before the mother found her, she stayed with Kak Lia,\n                    the god-sister of her friend, Fakir. She had hoped that her running away from\n                    home would show the accused that she did not want to continue having sex with\n                    him. However, she kept the reason to herself. As a result of this incident, the\n                    accused punished C1 by having her “grounded” and did not permit\n                    her to go to school for some time. 27     C1 also tried to avert further sexual\n                    incidents with the accused after the last rape which occurred in 2006. She would\n                    return to the flat after school only if the mother was at home. Otherwise, she\n                    would go to the Ang Mo Kio library and remain there until 8 to 10pm. When she\n                    went to bed, she would lie next to C2 so that if the accused attempted to pull\n                    her away, she would hug C2 and cause her to wake up. 28     C1 claimed that she used to keep two diaries\n                    while she was in primary school. The yellow one was for her general matters\n                    while the purple one, bought when she was in primary 4 or 5, was to record the\n                    sexual abuse by the accused up to 2006. She recorded the dates of the incidents,\n                    what happened on those days and her feelings about them and would refer to the\n                    diary two or three times every fortnight. Unfortunately, both diaries were lost\n                    while she was in secondary 2 or 3, probably thrown away with other books by the\n                    mother during spring cleaning of the flat. 29     C1 further testified that she had told C2 a\n                    little about the sexual abuse while they were staying with their grandmother\n                    during the school holidays sometime in 2007 or 2008. One night, she asked C2\n                    whether she knew the meaning of “sex”. C2 said that it meant the\n                    penis was inside the vagina. C1 then asked her whether she believed that\n                    “daddy” had done that to her. C2 appeared shocked and was a little\n                    incredulous at first. She asked C1 why she did not inform “mummy”\n                    about it. C1 replied that it was not the right time to tell her yet as their\n                    parents were quarrelling and she did not want to add to the mother’s\n                    problems. C2 asked her whether she would like her to help in telling the mother\n                    but C1 said that she would tell the mother when it was time to do\n                so. 30     C1 said that she did not have sex with any\n                    other person besides the accused. When the prosecution asked her to look at the\n                    accused sitting in the prisoners’ dock in court and to confirm in the\n                    presence of her paternal grandparents sitting in the public gallery that the\n                    accused had raped her, she did so without flinching. 31     During the first hearing when the accused was\n                    not represented by defence counsel, he did not challenge or contradict\n                    C1’s testimony at all concerning the alleged sexual incidents. He chose to\n                    question her instead on matters that were of no real consequence to the charges.\n                    The court tried to assist him by suggesting to him that he could perhaps\n                    challenge C1’s evidence by stating that C1 was telling complete lies or\n                    that some incidents took place while the others did not or that the incidents\n                    took place with C1’s consent. After acknowledging that he understood what\n                    the court was telling him, he maintained that he had no questions regarding\n                    C1’s evidence about the alleged incidents. 32     At the resumed hearing, C1 was one of the four\n                    prosecution witnesses recalled for cross-examination. The accused’s\n                    defence counsel put to C1 that her allegations about the incidents of sex were\n                    all false. It was also put to her that she had returned to the flat on 27 and\n                    28 April 2009 as well (immediately before the alleged incident of outrage\n                    of modesty on 29 April 2009) and that the accused was home on those\n                    occasions and that nothing untoward happened on those two days. C1 recalled\n                    returning home a few times before 29 April 2009 to take her things and also\n                    the mother’s belongings but was not sure about the dates. She could not\n                    recall whether the accused was home then. On each of those occasions, she left\n                    the flat after about half an hour or so. Defence counsel also suggested to C1\n                    that she was fabricating the allegations against the accused as he was a strict\n                    father and she wanted to get back at him and send him to prison so that he would\n                    not be able to control her anymore. It was also suggested to C1 that she bore\n                    grudges against the accused as he treated C2 better than he treated C1, had\n                    extra-marital affairs and beat up the mother. C1 was also alleged to have had\n                    sex with her boyfriend(s) and to have had no fear about returning to the flat\n                    when she ran away from home in 2006. She was also said to have discipline\n                    problems before and after April 2009. 33     C1 denied that she was lying about the sexual\n                    assaults and disagreed with the suggestions made by defence counsel. She agreed\n                    that she had lied to the mother on two occasions. When she ran away from home in\n                    2006 and was located by the mother subsequently, C1 lied to her that she had\n                    been staying outdoors when she was actually in Kak Lia’s home. On the\n                    second occasion, when the mother told her to return home and not stay in the\n                    library, she lied that she had to look for materials there. C1 explained that\n                    she did not want to get the friends who sheltered her into trouble as the mother\n                    had made a police report about her disappearance. She did not want to return to\n                    the flat earlier as she was afraid of being alone with the\n                accused. 34     In respect of her relationship with Lathiff,\n                    C1 denied having addressed him as father in Malay. She said that Lathiff only\n                    advised her about school work and her future. In re-examination, the prosecution\n                    very fairly brought to the attention of the court that, on 22 September\n                    2010, in the course of investigations by the Health Sciences Authority into some\n                    possible offences regarding cough syrup allegedly taken out by the mother from\n                    the private clinic where she worked as a nursing assistant, C1 stated in a\n                    statement that she believed that the mother married Lathiff in Batam and that at\n                    first, she called the mother’s new husband “uncle” but\n                    subsequently called him “Baba” (meaning father). She also stated\n                    therein that the mother had known Lathiff since June 2009 when he was the\n                    (initial) investigating officer looking into C1’s police report. When\n                    shown the statement by the prosecution, C1 looked through the entire statement\n                    and then claimed that she did not say those things about the mother and Lathiff.\n                    She claimed that she was working as an event coordinator for a fast food outlet\n                    and was in the midst of a client’s birthday party at the client’s\n                    home when some Health Sciences Authority officers telephoned her and requested\n                    to meet her for five minutes. She agreed and went down to the ground floor of\n                    the block of flats where she hurriedly answered some questions and then signed a\n                    statement after it was read to her as she had to rush back to the party. She\n                    signed as the Health Sciences Authority officers had told her that the statement\n                    could be of help to the mother. She maintained in court that the contents of the\n                    statement were untrue and that she merely called Lathiff uncle and not\n                    father. 35     Both defence counsel and the prosecution\n                    agreed initially that the Health Sciences Authority officers who recorded\n                    C1’s statement be called to testify. However, the next day, the\n                    prosecution informed the court that it was not calling the officers but would\n                    take the position that the statement was indeed made by C1 to the Health\n                    Sciences Authority officers and that reference could be made to the relevant\n                    questions and answers (numbered as 1 to 6) therein on how C1 addressed Lathiff.\n                    The prosecution did not wish to have the statement admitted in evidence as it\n                    was the subject of ongoing investigations. Defence counsel accepted the\n                    prosecution’s position. When C1 returned to the witness stand, she\n                    explained that she was sad and concerned as a daughter that the investigators\n                    were alleging that her mother was involved in the cough syrup matter. She\n                    maintained that she called Lathiff uncle and not father and that she did not\n                    know whether calling him father would be damaging to her mother’s case or\n                    not. She also maintained that she had no reason to fabricate the charges of rape\n                    and sexual abuse by the accused and she did not discuss the case with\n                    Lathiff. 36     In respect of the divorce, the mother\n                    testified that she commenced proceedings in the Syariah Court because she could\n                    not tolerate the abuse by the accused and his financial irresponsibility towards\n                    their family and also because of the allegations that he had raped their\n                    daughter. However, she agreed that the divorce was granted without the court\n                    requiring her to prove her allegations and that the accused merely pronounced\n                    the “talak”. 37     The mother explained that she left the flat\n                    around 4 to 5pm for her night shift work during the marriage. She testified that\n                    she changed primary school for C1 not because C1 had disciplinary problems in\n                    the former school but purely because the former school was further away from the\n                    flat and travelling to and from school cost money (which the family was short\n                    of) while the new school was within walking distance. When C1 was missing from\n                    home, the mother took leave to search for her and when someone finally told her\n                    where C1 was, her only concern was to bring her home and not to question her\n                    about why she had run away from home. 38     The mother was cross-examined about her\n                    relationship with Lathiff, a married man. She was asked whether she had asked\n                    the accused’s sister and her husband to arrange a secret marriage for her\n                    and Lathiff in Batam. The mother claimed that she got to be friends with Lathiff\n                    only some two months after C1’s police report was made. Lathiff called to\n                    ask how she was coping and asked her out for a drink. She admitted that she had\n                    invited Lathiff to the flat and that he had driven her to Ang Mo Kio Central in\n                    a police patrol car before. Lathiff merely advised her children to be obedient\n                    and to study hard. He did not try to coach C1 or C2 concerning their testimony\n                    in court. She and Lathiff denied being in a love relationship. She suggested to\n                    the accused’s sister the secret marriage in Batam merely to anger and hurt\n                    the accused’s family by letting them know that she was marrying someone\n                    better than the accused. There was no marriage at all. In July 2010, she did go\n                    on a one-day shopping trip to Batam with her brother and Lathiff.\n                    Lathiff’s wife was supposed to join them but could not because of work\n                    commitments. 39     Lathiff, who has been transferred to other\n                    duties because of the ongoing investigations regarding the alleged theft of\n                    cough syrup which he was suspected of having abetted, testified that after he\n                    met C1 and the mother on 29 April 2009, he interviewed C1 for about an hour\n                    and spoke to the mother separately. His role was to see whether the allegations\n                    of rape were made out or not. C1 was crying and could hardly speak. After she\n                    calmed down, she narrated her story to Lathiff who then informed SSCB. When the\n                    officers from SSCB arrived later that evening, they took over the investigations\n                    and Lathiff was not involved in the case from then on. It was only some two\n                    months later that he decided to call the mother to befriend her. They did not\n                    know each other before 29 April 2009. He agreed that he had been to the\n                    flat but the children were home on those occasions. He merely counselled them\n                    and told them to be obedient. His contact with the mother and the children was\n                    on a personal basis and had nothing to do with the investigations in this case.\n                    He could not recall whether he had given the mother a lift in a police patrol\n                    car. He met the accused’s sister and her husband at the flat. The mother\n                    told Lathiff that she had informed the accused’s sister and her husband\n                    about their supposed wedding as a ploy to hurt the accused’s\n                    family. 40     C2, now 13, testified that in 2006 (when she\n                    was about 9 years old), the accused went into the bedroom and told her and C3 to\n                    go outside. C1 was asleep and the mother was not home then. C2 was told to close\n                    the room door. C2 did so but felt uneasy. She waited in the living room and did\n                    not dare to open the room door as she was afraid of the accused. He emerged from\n                    the room about half an hour later. When C2 entered the bedroom, C1 was seated on\n                    the bed watching television. Sometime after that day, C2 asked C1 what was going\n                    on in the room that day but received no answer from her. 41     On another occasion at night in 2006, when the\n                    three children were sleeping in the room, C2 was awakened by some movement on\n                    the bed. She saw the accused on top of C1 and turned away as she was afraid of\n                    him. He was not wearing any shirt but C2 could not see if his shorts were on.\n                    The mother was out working that night. Subsequently, the accused left the room.\n                    C2 did not ask C1 nor tell anyone about this incident. 42     One afternoon in 2008, C1 told C2 that on the\n                    occasion in[40]above, the accused touched\n                    her vagina and her body. C2 was shocked to hear this. Both of them cried. C2\n                    told C1 she hated the accused for this and would treat him as an uncle and not\n                    as their father. C1 told her that the mother did not know about all this and\n                    that she would tell her when the time was right.",
        "The case for the accused": "43     The accused was educated up to secondary two.\n                    He started working life as a cleaner and then did sales in a departmental store\n                    for a while. He then returned to cleaning service work. In the three years or so\n                    before his arrest, he was doing odd jobs. 44     The accused said that C1 returned to the flat\n                    on 27 and 28 April 2009 as well. On those days, he was at home. On the\n                    first occasion, he was using his computer in the living room and only asked C1\n                    whether she had come from school. On the second occasion, he was sleeping in the\n                    living room and awoke when C1 was opening the main door to the flat. They did\n                    not speak to each other that day. On 29 April 2009, when he returned to the\n                    flat, he saw C1’s shoes and heard the sound of running water in the\n                    toilet. Subsequently, C1 emerged from the toilet and went into the bedroom. The\n                    accused went into the bedroom, sat down near C1 with her on his right and asked\n                    her about the children, school, her recent examinations and when the family\n                    would be returning to live in the flat. During the conversation, C1’s\n                    mobile phone vibrated and she looked at the SMS. He asked her who the sender was\n                    and she replied that it was the mother asking her to go home quickly. He said,\n                    “OK” and went to the kitchen to make coffee for himself while she\n                    continued packing her books. He then heard her making a call using the\n                    speakerphone function on her mobile phone. The mother said,\n                    “Hello” and the line was then cut off. He next heard her leaving\n                    the flat. 45     The accused said that the mother was probably\n                    angry with him over the family’s finances. She had attempted to divorce\n                    him before but did not go through with it. They had quarrels and fights over\n                    money matters. She also suspected him of having an affair. At the divorce\n                    hearing (which was by video-conference), he decided to pronounce\n                    “talak” to give her what she wanted. Although he was told about\n                    the grounds pleaded by the mother, he was not asked by the court officials\n                    whether he admitted them or not. Nobody testified at the divorce hearing. He was\n                    not represented by counsel. 46     His relationship with C1 was normal. They did\n                    not talk much to each other except about school and school work. The mother was\n                    more involved in C1’s upbringing. He was strict with C1 in respect of her\n                    school work as he wanted a good future for her. He disagreed that he treated C2\n                    better. When C1 returned home after running away, he did not ask her anything as\n                    the mother had told him earlier not to do so and to just let her relax. He\n                    decided to “ground” C1, something he had not done before, as she\n                    was stubborn and had run away from home. The mother tried to enrol her in a\n                    school nearer the flat partly because she wanted to separate C1 from her\n                    previous school mates. When C1 was unwilling to help out with the household\n                    chores, he left her alone and did not do anything to her. It was possible that\n                    C1 was angry with him for having been physically abusive towards the mother and\n                    also because C1 believed that he was having an affair. 47     The accused’s defence to the charges was\n                    a complete denial that any sexual contact took place. When asked by the\n                    prosecution why he did not challenge C1’s allegations during the first\n                    hearing despite the court’s guidance, he said he did not know how to\n                    challenge her evidence. He explained that when he told the psychiatrist (see[12]above) that he might plead guilty\n                    in order not to get C1 into trouble, he meant that his daughter had made a false\n                    report against him and he might choose to admit guilt rather than have her\n                    prosecuted for making a false report. He was “ready to take over her\n                    punishment”. It was not an expression of remorse over what he had\n                    allegedly done to her. He was sad when he heard C1’s testimony in court,\n                    wondering why she was making such allegations and who might be behind\n                    this. 48     The accused’s sister, who used to be\n                    close to the mother, testified that she was told by the mother only in June 2009\n                    that the accused had raped C1. Before that, whenever she went to the flat, the\n                    mother would say that the accused was out working. The mother was afraid that\n                    the accused’s parents would get to know about the case. During the school\n                    holidays in June 2009, the sister stayed at the flat for one week while her\n                    parents were on holiday in Malaysia and the mother therefore could not hide the\n                    fact of the accused’s arrest any longer. The sister was shocked to hear\n                    the news. The mother apologised to her, saying she did not know how to tell the\n                    accused’s parents. Nothing changed after that as the sister continued to\n                    send her children to the flat in the morning for the mother to mind them while\n                    the sister was out working. Eventually, the sister felt that things had changed\n                    as the accused’s belongings were no longer in the flat. 49     In October 2009, the mother informed the\n                    sister that she got to know Lathiff when she went to report the loss of her\n                    identity card at Ang Mo Kio Police Division. The mother said that Lathiff is\n                    married and has four children and wanted to know the sister’s opinion if\n                    the mother were to become Lathiff’s second wife. The mother also asked the\n                    sister to ask her husband to speak to Lathiff about a plan for her to get\n                    married to Lathiff in Batam. 50     The sister’s husband made the\n                    arrangements for them. The plan was to have the marriage during Christmas 2009.\n                    Subsequently, the mother informed the sister that the marriage was cancelled as\n                    she and Lathiff had a misunderstanding. However, in May 2010, the mother told\n                    the sister that she had married Lathiff in Batam. When the sister asked her\n                    whether they had obtained the consent of Lathiff’s first wife, she said\n                    that the first wife did not agree. The mother showed her some photographs, the\n                    wedding ring and the marriage certificate issued in Batam. 51     In March 2010, the accused’s sister and\n                    her husband met Lathiff in the flat. C1 and C3 were at home too. When they were\n                    leaving the flat, the sister offered the mother and Lathiff a lift in her\n                    husband’s car but they declined saying that Lathiff had a police patrol\n                    car there. They waited nearby to see whether that was true and saw Lathiff\n                    leaving with the mother later in a police patrol car driven by\n                Lathiff. 52     The sister testified that the accused’s\n                    three children were close to Lathiff. They spoke often to him over the telephone\n                    and addressed him as “Baba” (meaning father). C1 asked him to buy\n                    chocolate while C2 asked him to buy ice cream. 53     In June 2009, after the sister’s parents\n                    returned from their holiday in Malaysia, the sister arranged a meeting in the\n                    parents’ flat. The mother went with the three children. The sister, her\n                    other brother and the parents were also there. The three children were asked to\n                    go into a bedroom while the adults met in the living room. The mother said that\n                    if the accused was willing to divorce her, she would withdraw this case against\n                    him. 54     The sister agreed with the prosecution that\n                    the mother and C1 never said that the police report made by C1 was false.\n                    Whenever the sister asked C1 whether it was true “what daddy had\n                    done” to her, C1 would reply, “Yes” but would then keep\n                    quiet when probed further about what the acts were. 55     The sister’s husband (she is his second\n                    wife) confirmed the evidence regarding the police patrol car. He also testified\n                    that at the end of 2009, the sister informed him that the mother wanted him to\n                    make preparations for her marriage to Lathiff in Batam. He agreed and asked them\n                    what the date was and was told it was to be in March 2010. Some months later,\n                    the mother and Lathiff told him that they were not able to perform the marriage\n                    there. He heard that they had a break-up in their relationship. However, a few\n                    months later, his wife told him that the mother and Lathiff had married in\n                    Batam. 56     The sister’s husband said that he had\n                    asked the mother for permission to speak to C1 about the case but the mother\n                    refused to allow him to do so. When he saw Lathiff in the flat, it appeared to\n                    him that Lathiff was a strong, influential person whom C1 was afraid of. The\n                    sister’s husband also agreed with the prosecution that he had not heard\n                    the mother or C1 say that C1 made a false police report against the\n                    accused. 57     The final witness for the defence was the\n                    accused’s father. He said that he first knew about his son’s arrest\n                    on 27 June 2009 when the mother and the three children went to his flat.\n                    The mother wanted him to allow her to tell the story without interruption and so\n                    he merely listened to her without asking any questions. The mother said that if\n                    the accused divorced her, she would withdraw all the charges against him. At the\n                    end of her conversation, he asked her whether it was true that the accused had\n                    raped C1. The mother kept quiet and told him he could not ask C1 about this. She\n                    said that it was not necessary as, being her mother, she knew what it was all\n                    about. 58     The accused’s father said that during\n                    the marriage, the mother was very aggressive and cruel towards the accused and\n                    always accused him of being lazy. Each month, she would approach the\n                    accused’s father for financial help as the accused was unemployed. The\n                    accused’s mother would pass her $30 to $50. He did not give the mother any\n                    money. His relationship with her was not good and he did not like to see her.\n                    Before the accused’s arrest, the accused’s father was able to speak\n                    to C1 each time for only about 10 minutes before the mother took her away and\n                    placed her in the accused’s sister’s bedroom. 59     In cross-examination, when asked whether the\n                    mother had said that the allegations against the accused were untrue, the\n                    accused’s father replied that the mother had told him in front of the\n                    accused’s mother and brother that she wanted to send his son (the accused)\n                    to prison. When the question was repeated, he said that the mother had never\n                    said anything to him. He also said that C1 had never said anything to him when\n                    asked whether C1 had said that the allegations against the accused were\n                    untrue.",
        "The decision of the court": "60     As is common in allegations of this nature,\n                    the crucial evidence often comes from the alleged victim only and the court must\n                    be aware of the dangers of convicting solely on that testimony, bearing in mind\n                    the ease with which allegations of sexual assault may be fabricated and the\n                    concomitant difficulty of rebutting such allegations (see the Court of\n                    Appeal’s decision inPP v Mohammed Liton Mohammed Syeed\n                        Mallik[2008] 1 SLR 601). The Court of Appeal in that\n                    case (at [39]) also emphasized that the quality of the testimony must be\n                    consistent with the high standard of proof beyond a reasonable doubt. Where a\n                    reasonable doubt arises in the testimony, it is axiomatic that the accused\n                    should be given the benefit of that doubt. 61     Here, C1 was 17 years old at the time of the\n                    trial. Although an application was made by the prosecution at the commencement\n                    of the trial for her to testifyin camera, I\n                    decided against it as I was of the view it would be better to hear and observe\n                    C1 in open court in the presence of the accused and his family members. I agreed\n                    to revisit the application should circumstances warrant it. When the same\n                    application was made at C1’s recall for cross-examination during the\n                    resumed hearing, I remained of the same view. I had also not noticed anything\n                    during the first hearing that would call for a change of position. 62     C1 appeared to me to be a forthright person,\n                    not given to exaggerations or embellishments. She spoke simply and did not\n                    appear to have been coached or “tutored” (the word used by defence\n                    counsel in reference to Lathiff) in her evidence at all, whether during the\n                    first or the resumed hearing. I was satisfied that she understood the gravity of\n                    what she was saying in court about her father and knew the importance of telling\n                    the truth. Allowance must obviously be given for the fact that some of the\n                    alleged incidents occurred many years ago when she was much younger. It would\n                    therefore not be possible to recall with precision every detail of each\n                    occurrence. 63     C1 did not waver or show any uncertainty when\n                    asked by the prosecution to re-affirm her allegations about the rapes in open\n                    court in the presence of the accused and his family members. She did not hide\n                    her perception that the accused favoured C2 over her although the accused denied\n                    treating C2 better than he treated C1. She frankly acknowledged that the accused\n                    was strict with her school work but denied that she wanted to get rid of him\n                    because of that. She showed no animosity towards the accused in court. Other\n                    than the “grounding” in 2006, for which there was a valid reason,\n                    there was no suggestion that the accused was an impediment to her lifestyle.\n                    Indeed, the accused was at a loss when asked for the reasons why he thought C1\n                    would be making such serious false allegations against him. Far from wanting to\n                    get the accused out of their lives, C1 was concerned that she would exacerbate\n                    the family conflicts if she told the mother about what the accused had done to\n                    her. She was also unsure about how to break the news to the mother or to anyone\n                    else and whether anyone would believe her story. She did not appear to me to be\n                    lying about her ambivalence. She was truly in a dilemma from which she, at that\n                    young age, did not know how to extricate herself. 64     Her account about the events of 29 April\n                    2009 was particularly clear and cogent, probably due to the fact that it was the\n                    most recent incident involving the accused and she was more mature by then. It\n                    was also the trigger event that led to the police report. She had no qualms\n                    returning to the flat alone to collect her things although the accused could be\n                    at home as he had not made any unwelcome overtures to her for several years\n                    already. The mother and C1 did not appear to have colluded in any way about\n                    these events. It was not as if C1 had returned to the flat in order to set a\n                    trap for the accused. After all, as he testified, C1 was also back at the flat\n                    on the two days immediately before that date and nothing happened. C1’s\n                    genuine distress after the confrontation with the accused in the flat was also\n                    noted by the police officers who saw her that day. 65     The accused’s inability to put any\n                    questions to C1 about the alleged sexual assaults during the first hearing was\n                    intriguing. He was not highly educated but was certainly no moron. When invited\n                    by the court to challenge C1’s testimony and to suggest to her that\n                    perhaps she was lying about all or some of the allegations in the charges, he\n                    chose not to do so or to ask her any question regarding the crucial matters. I\n                    therefore agreed with the prosecution that the accused’s subsequent\n                    evidence about all the possible reasons why C1 could be fabricating evidence\n                    against him invited scepticism. It was also strange that he chose to ask about\n                    the family’s well-being only on the third consecutive day (29 April\n                    2009) that he met C1 in the flat. 66     Although C1 may have had some disciplinary\n                    problems at school, she did not seem to be a wayward child intent on getting her\n                    father out of her life. She candidly agreed that she had lied to the mother on\n                    occasions concerning her not returning home after school. She had good reason\n                    not to want to return to the flat where she would be alone with the accused who\n                    seemed to be home most of the time instead of out working. 67     Corroborative evidence may be found in\n                    C2’s testimony. C1 had confided in C2 about the sexual assaults by the\n                    accused and that caused C2 to have such poor regard for their father that he was\n                    downgraded to being an uncle in her eyes. No reason has been proffered by the\n                    accused why C2 would also turn against him unjustly. She certainly did not\n                    appear to have been manipulated by anyone in her evidence despite her\n                    age. 68     Corroborative evidence may also be found in\n                    the medical evidence. What C1 told the doctors was by and large consistent with\n                    her evidence in court. Naturally, while the hymenal tears indicated previous\n                    sexual penetration of the vagina, they did not point to the accused being the\n                    perpetrator. 69     Two issues raised some concern about the\n                    prosecution’s case. The first related to the two diaries that C1 alleged\n                    she kept but were somehow lost around 2007 or 2008. Defence counsel argued that\n                    these diaries did not exist because the mother could not have discarded such\n                    without so much as browsing through them. I did not think C1 was lying about the\n                    loss of the diaries. Perhaps the mother was careless in disposing of them\n                    without much thought. However, as the diaries were missing, I did not place any\n                    weight on C1’s evidence that the alleged sexual assaults were detailed by\n                    her in one of them. 70     The second and much more important matter\n                    concerned the Health Sciences Authority investigation statement (see[34]and[35]above). This was the only time in C1’s testimony in court that she paused\n                    hard and long before answering any questions, including those posed by the\n                    court. Despite her denials about the accuracy of the said statement regarding\n                    how she addressed Lathiff, the prosecution has accepted that she did give the\n                    answers as recorded and that she did refer to Lathiff in more recent times as\n                    “Baba” or father. 71     I noted that her denials came about only after\n                    she had the opportunity to browse through the statement. A quick perusal of the\n                    questions and answers from question 8 onwards would show that the answers\n                    purportedly made by her were clearly detrimental to her mother in the\n                    investigations regarding the cough syrup. I need not rule on the voluntariness\n                    or the accuracy of this statement in this trial in view of the position taken by\n                    the prosecution regarding its own witness’ previous statement. I\n                    highlighted the rest of the contents of this statement merely to explain why I\n                    believed C1 was not willing to acknowledge her own statement. By this time, C1\n                    obviously realized that if her mother were to get into any trouble with the law,\n                    she and her siblings would be left to fend for themselves. She was thus\n                    extremely reluctant to accept the statement as having been made by\n                her. 72     I reconsidered her veracity in the light of\n                    this new development and concluded that while she was not entirely forthright on\n                    this score, she was completely truthful in her testimony regarding the charges.\n                    As explained above, it was perfectly understandable why she sought to disavow\n                    the statement. This of course attracted the criticism that she was capable of\n                    telling an untruth where it suited her purposes. Nevertheless, bearing in mind\n                    the serious charges that the accused faced and the burden on the prosecution to\n                    prove its case beyond reasonable doubt, I still held the firm belief that C1 was\n                    telling the truth about the sexual assaults. This was so even if the mother and\n                    Lathiff were not completely upfront about their relationship. I accepted that\n                    any relationship between them developed only a couple of months or so after the\n                    police report was made by C1. As mentioned earlier, I did not detect any hint\n                    that Lathiff, despite being the apparent father figure to the accused’s\n                    children, had sought in any way to influence C1 or C2 in their testimony in\n                    court. C1’s evidence, when tested with the rest of the evidence adduced in\n                    court, still rang true to me, leaving me with no doubt that she was telling the\n                    truth concerning the alleged sexual assaults. 73     I therefore held that the prosecution had\n                    proved its case against the accused on the five charges beyond reasonable doubt\n                    and I convicted him thereon accordingly. It was obvious that the acts of sexual\n                    intercourse took place without C1’s consent. She did not even know the\n                    nature of the acts until after the sex education lessons in school in\n                    2004.",
        "The sentences": "74     The first four charges concerned offences\n                    governed by the previous Penal Code (Cap 224, 1985 Rev Ed)\n                    (“the old Penal Code”). The fifth charge was the only one that\n                    fell within the present Penal Code (Cap 224, 2008 Rev Ed) (“the\n                    new Penal Code”) which came into force on 1 February 2008. Section\n                    377 of the old Penal Code provides for life imprisonment, or imprisonment of up\n                    to 10 years and liability to a fine. Section 376(2) of the old Penal Code\n                    provides for imprisonment of not less than 8 years and not more than 20 years\n                    and caning of not less than 12 strokes. Section 354A(1) of the new Penal Code\n                    provides for imprisonment of not less than 2 years and not more than 10 years\n                    and mandatory caning. 75     The accused admitted a previous conviction in\n                    May 1995 for possession of a controlled drug under the Misuse of Drugs Act\n                    (Cap 185) for which he was sentenced to 4 months’ imprisonment. He\n                    was then 19 years old. 76     The prosecution highlighted the following\n                    aggravating factors: (a)the accused is C1’s father;(b)the sexual abuse began when C1 was only 6 years\n                            old;(c)the physical and psychological harm suffered by\n                            C1, including the loss of virginity, and the impact on the relationship\n                            within the family; and(d)the accused’s lack of remorse and the\n                            aspersions cast on C1.Based on sentencing principles and precedents and considering that this\n                    case proceeded to trial, the prosecution submitted that the charge under section\n                    377 should carry an imprisonment term above 5 years and the one under section\n                    354A(1) should carry the prescribed minimum imprisonment term with caning. For\n                    each of the three rape charges, the prosecution suggested that imprisonment for\n                    15 years and 12 strokes of the cane would be appropriate and that two of these\n                    imprisonment terms should be ordered to run consecutively.77     In mitigation, defence counsel submitted that\n                    the accused was a simple-minded person earning a meagre income and contributing\n                    to the family in his own small way. He was said not to be incorrigible. There\n                    was no evidence of further drug abuse after 1995. It was also pointed out that\n                    there was no evidence of loss of virginity. On this last point, the prosecution\n                    countered that C1 had testified that she had never penetrated herself nor\n                    allowed anyone else to do so. I accepted that the only one she had sex with\n                    during the material time was the accused.78     Guided by the pronouncements inPP v NF[2006] 4 SLR 849 andPP v UI[2008] 4 SLR 500, I sentenced the\n                    accused as follows:Section 377 charge-5 years’\n                                    imprisonment;Section 376(2)\n                                    charges-12 years’ imprisonment and 12\n                                            strokes of the cane for each of the three\n                                            charges;Section 354A(1)\n                                    charge-2 years’ imprisonment and 1 stroke\n                                            of the cane.I ordered the imprisonment terms for the section 377 charge and two of\n                    the section 376(2) charges to run consecutively with effect from 30 April\n                    2009 (date of arrest) with the other two imprisonment terms to run concurrently\n                    with them. The total imprisonment term was therefore 29 years with effect from\n                    30 April 2009. The accused is to be subject to a maximum of 24 strokes of\n                    the cane. As stated at[3]above, he was\n                    granted a discharge amounting to an acquittal on the remaining four charges\n                    pursuant to section 177 of the CPC (Cap 68).79     I also ordered that the computer seized from\n                    the flat be returned to the accused’s family and that all other exhibits\n                    be disposed of after any appeal has been dealt with by the Court of\n                    Appeal.80     The accused has appealed to the Court of\n                    Appeal against both conviction and sentence."
    }
}