{
    "case_title": "Wong Leong Wei Edward and another\n      v\n      Acclaim Insurance Brokers Pte Ltd and another suit",
    "ncitation": "[2010] SGHC 352",
    "coram": "Steven Chong J",
    "sections": {
        "Introduction": "1       The present case arises out of a dispute between\n                    the defendant, an insurance broking company, and the first plaintiff\n                    (“Edward”) who was the former head of the defendant’s\n                    strategic wealth management (“SWM”) division. Essentially, the\n                    plaintiffs are claiming for commissions and remuneration due to Edward and a\n                    group of financial advisers who formerly worked for the defendant in its SWM\n                    division, while the defendant is claiming for losses arising out of the mass\n                    resignations of the financial advisers and the transfers of its clients from its\n                    SWM division to another insurance broking company, Leadenhall Insurance Brokers\n                    Pte Ltd (“Leadenhall”). The crux of the dispute centres on the\n                    propriety of the resignations by the financial advisers and the transfer of the\n                    clients to Leadenhall. 2       Interestingly, this case has also brought to\n                    focus some unsavoury practices that were apparently rife within the\n                    defendant’s SWM division. At the material time, the defendant’s SWM\n                    division provided financial advisory services in the sale of financial products\n                    such as unit trusts to its clients. The case speaks of the use of so-called\n                    “runners” who would target working-class investors and procure\n                    them to purchase unit trusts from the financial advisers using their otherwise\n                    inactive Central Provident Fund (“CPF”) monies in exchange for\n                    cash-backs. This way, the investors would receive an immediate cash return\n                    simply by using their CPF funds to purchase unit trusts from the defendant.\n                    Under this arrangement, everyone was supposed to benefit,iethe defendant, the financial advisers, the investors, and of\n                    course the all important “runners”; and indeed it worked out just\n                    as planned. At the height of the division’s financial success, Edward, as\n                    its team leader, earned commissions in the tune of some $3 million in less than\n                    one year. One of the advisers reportedly earned about $450,000 in commission in\n                    just four months. Astonishingly, the bulk of this particular adviser’s\n                    clients were predominantly from the Malay community even though she was unable\n                    to speak the Malay language! The defendant also earned attractive commissions.\n                    It seemed like a very lucrative business and it was in the financial interest of\n                    all parties for the business to continue. 3       However, as the saying goes “All good\n                    things must come to an end” and this was precisely what happened in this\n                    case. Some 10 months after the SWM division started its financial advisory\n                    business, there was anen masseresignation of all\n                    the financial advisers to join Leadenhall. Allegations emerged about backdating\n                    of the letters of resignation and the forging of numerous signatures of clients\n                    to facilitate the transfer of their investment accounts to the new company. This\n                    sudden “breakup” was widely reported in the press with both sides\n                    filing police complaints against each other. 4       Eventually, the undesirable features of this\n                    practice came to the attention of the Monetary Authority of Singapore\n                    (“MAS”) and resulted in the complete shutdown of the financial\n                    advisory business of three insurance broking companies, one of which was the\n                    defendant and another was Leadenhall.",
        "Background facts": "5       The defendant is an exempt Financial Adviser\n                    Company under the Financial Advisers Act (Cap 110, 2007 Rev Ed)\n                    (“FAA”). Sometime around April or May 2006, Edward and the\n                    defendant’s managing director, Anthony Lim Gek Seng[note: 1](“Anthony Lim”)\n                    agreed to set up a SWM division under the defendant. However, to relieve the\n                    defendant from the management of this SWM division, it was also agreed that\n                    Edward would incorporate a new company which would be entirely responsible for\n                    the SWM division’s administrative matters,egrecruitment and remuneration of the individual financial\n                    adviser representatives (“FARs”). Under this arrangement, the\n                    defendant would only need to deal with the new company and not the individual\n                    FARs in relation to remuneration. On 29 July 2006, Edward incorporated the\n                    second plaintiff (“Stralos”) for just that purpose. Three days\n                    later, on 1 August 2006, Edward joined the defendant as a Financial\n                    Adviser Manager (“FAM”) and was appointed head of the SWM\n                    division. Under clause 2(II)(c) of Schedule A of the FAM Agreement entered\n                    between Edward and the defendant, it was agreed that any monies due from the\n                    defendant to Edward were to be paid to Stralos. 6       Between August 2006 and July 2007, over 20\n                    individuals joined the defendant’s SWM division as FARs. Under s 12\n                    of the FAA, a FAR can represent only one licensed or exempt Financial Adviser\n                    Company. Therefore, every FAR[note: 2]who joined the defendant’s\n                    SWM division entered into a FAR Agreement with the defendant. In furtherance of\n                    the arrangement that was agreed between Edward and the defendant (see[5]above), each FAR also issued a written notice,\n                    assigning the FAR’s right to receive remuneration under the FAR Agreement\n                    to Stralos; thus permitting Stralos to receive their remuneration from the\n                    defendant on their behalf. 7       At all material times, the defendant was\n                    contracted to distribute and promote unit trust products offered by two\n                    investment platforms: iFAST Financial Pte Ltd (“iFast”) and\n                    Navigator Investment Services Ltd (“Navigator”). After joining the\n                    defendant’s SWM division, each FAR was assigned two unique identifier\n                    Financial Adviser Codes (“FA Codes”), one for iFast and another\n                    one for Navigator, which identified the FAR as a representative of the\n                    defendant. 8       Almost a year after joining the defendant,\n                    Edward organised a staff-incentive cum team-building trip for the SWM division\n                    to Thailand (the “Thailand trip”). The trip was held from 9 to\n                    around 14 July 2007 and was attended by 21 FARs. After the Thailand\n                    trip, 26 of the FARs then joined Leadenhall and obtained new FA Codes from iFast\n                    and Navigator. They later successfully transferred the clients whom they had\n                    been servicing while working for the defendant over to Leadenhall. 9       After learning of the mass exodus, the defendant\n                    took immediate steps to investigate the matter and lodged reports with the\n                    police and the Corrupt Practices Investigations Bureau. Not surprisingly, the\n                    defendant suspected that Edward was the mastermind behind theen masseresignation. As a consequence, the defendant withheld\n                    the commissions and earnings that were otherwise payable to Edward and the FARs.\n                    Edward was subsequently terminated from his position with the defendant by\n                    letter dated 8 August 2007 for allegedly providing cash-backs to clients, in\n                    particular, one Yeo Mui Khee (“Ms Yeo”).",
        "Procedural history": "10     This is a consolidated suit which initially\n                    started as an action in Suit No 781 of 2007 (“Suit 781”) to\n                    recover outstanding commissions and earnings allegedly due to Edward and the\n                    other FARs from the defendant for the period of June and/or July 2007.\n                    Stralos claimed as assignees of the commissions and earnings due from the\n                    defendant to the FARs. It was not disputed that between Stralos and the FARs,\n                    Stralos had already paid to the FARs the commissions and earnings that it was\n                    claiming for. 11     In the case of the FARs, the defendant alleged\n                    that all 24 letters of resignation dated 14 June 2007 were back-dated and hence,\n                    the FARs had failed to comply with the contractual 30-days notice period. The\n                    defendant counterclaimed against Edward for breach of fiduciary duties and\n                    against the FARs for breach of contract for failing to provide proper notices of\n                    resignation. In all, the defendant claimed a total of 18 months of the average\n                    monthly commissions that the defendant had been earning from the sales generated\n                    by the SWM division before the FARs’ mass resignation, six months being\n                    what the defendant would have earned but for the mass resignation and transfer\n                    of the clients (from July until December 2007 when the writ for Suit 781\n                    was filed); and an additional 12 months’ commission for the period that\n                    the defendant would have taken to rebuild another SWM division. Relying on\n                    set-off clauses in the FAM Agreement and FA Agreements, the defendant sought to\n                    set-off its claim for damages against the commissions and earnings due to Edward\n                    and the FARs and consequently against Stralos. 12     Some two years later, Edward commenced a\n                    separate and rather belated action against the defendant in Suit No 106 of 2009\n                    (“Suit 106”) for wrongful termination. As Suit 781 and Suit 106\n                    arose from essentially the same factual matrix, it was agreed for both actions\n                    to be heard and tried together. 13     When the trial began, the plaintiffs’\n                    claims in Suit 781 against the defendant were for the following: (a)the sum of $296,186.26 being commissions and\n                            earnings due to Edward and Stralos; and(b)the sum of $83,306.83 being on-going fees due to\n                            Edward and Stralos.14     Initially, the defendant challenged thelocus standiof Stralos to claim for the\n                    commissions due to the FARs even though it was common ground that from the\n                    outset of the relationship, all commissions and earnings earned by the FARs were\n                    in fact paid by the defendant through Stralos under the assignments (see[6]above). However, during the oral\n                    closing submissions, counsel for the defendant conceded that Stralos had thelocus standias assignees to claim for the\n                    commissions and earnings due to the FARs subject to equities. Consequently,\n                    whether any sum remains due to be paid to Stralos under the assignment would\n                    depend on the quantum of the defendant’s counterclaim. The issue then is\n                    the extent of the set-off which the defendant is entitled to assert against the\n                    FARs.15     During the trial, the parties also agreed on\n                    the quantum of the outstanding commissions and earnings at $291,838.23 subject\n                    to the defendant’s right of equitable set-off. As regards the claim for\n                    commissions and earnings, Edward had already obtained summary judgment on 4 June\n                    2008 against the defendant for the sum of $59,892.13, which was due personally\n                    to him. The balance claim amount of $231,946.10 ($291,838.23 - $59,892.13) was\n                    the quantum due to Stralos subject to the defendant’s right of equitable\n                    set-off against each of the FARs.16     In their written closing submissions, both\n                    Edward and Stralos confirmed that they were withdrawing their claim for the\n                    on-going fees. Since there is no dispute that the aggregate sum of $291,838.23\n                    was due to Edward and Stralos for the commissions and earnings, the only\n                    remaining issue in Suit 781 was the defendant’s counterclaim for damages\n                    and for equitable set-off against Edward and the FARs. The sums ultimately due\n                    to Edward and Stralos, if any, would thus depend on proof of the\n                    defendant’s counterclaim against each of them respectively. A separate\n                    claim in conspiracy by the defendant against Edward and the FARs was abandoned\n                    midway through the trial.17     The defendant alleged that the FARs breached\n                    their contracts of employment in backdating their letters of resignation. The\n                    letters of resignation were dated 14 June 2007. The defendant submitted that\n                    most, if not all, of the letters of resignation were in fact signed sometime in\n                    July 2007.18     In Suit 106, Edward claimed that he did not\n                    engage in any cash-back arrangement with any client and that his wrongful\n                    termination was motivated by the defendant’s desire to ensure that Edward\n                    was no longer able to find alternative employment in the financial advisory\n                    business. The defendant contended that Edward’s termination was lawful as\n                    it was satisfied that Ms Yeo’s complaint was genuine and legitimate. The\n                    defendant also sought to justify the termination on the additional ground that\n                    Edward was in breach of his fiduciary duties in,inter\n                        alia, orchestrating the mass resignation of the FARs and for, at\n                    the very least, assisting in setting up the financial advisory division in\n                    Leadenhall to act for the clients previously serviced by Edward and the FARs\n                    while still under the employment of the defendant. There is no counterclaim by\n                    the defendant in Suit 106.Issues19     The following remaining issues arise for\n                    determination from both Suits:Suit 781(a)Were the letters of resignation by the FARs\n                            backdated?(b)Were the signatures for the transfer forms of the\n                            investment accounts forged and, if so, whether they were forged on the\n                            instructions of or to the knowledge of Edward?(c)If the answer to (a) and/or (b) is in the\n                            affirmative, what then is the measure of loss suffered by the defendant\n                            from such backdating and/or forgery?Suit 106(d)Did Edward engage in any cash-back arrangement\n                            with Ms Yeo to justify his dismissal?(e)Was Edward in breach of his fiduciary duties to\n                            the defendant in connection with theen\n                                masseresignations of the FARs and/or the setting up of\n                            the financial advisory division in Leadenhall?(f)If the dismissal was wrongful, whether the\n                            damages would be limited to the normal notice period?20     It is apparent that all the issues for\n                    determination are largely factual in nature. Accordingly, my decision on these\n                    issues is largely based on my analysis of the objective evidence before me as\n                    well as my assessment of the credibility of the numerous witnesses who testified\n                    at the trial. Although the issues are relatively uncomplicated, the trial\n                    nonetheless raged on for 13 days (originally fixed for 26 days) wherein 15\n                    witnesses testified for the plaintiffs while 16 witnesses testified for the\n                    defendant. Some of the witnesses filed affidavits of evidence-in-chief while\n                    many were subpoenaed.Backdating21     On or about 16 August 2007, the defendant was\n                    informed by Edward that all the FARs had tendered their resignations purportedly\n                    some two months ago on 14 June 2007. All the resignations had\n                    already been purportedly accepted by Edward on behalf of the SWM division of the\n                    defendant. By the time the defendant was informed of the resignations, all the\n                    FARs had already left to join Leadenhall.22     Although their letters of resignation were\n                    dated 14 June 2007, the following witnesses who testified for Edward and\n                    Stralos admitted that the letters were probably backdated:(a)Ganesh Krishnan;[note: 3](b)Kalithasan s/o Chelva Rajah;[note: 4]and(c)Jeremy Tan Shih Hwang (“Jeremy\n                                Tan”).[note: 5]23     The backdating was corroborated by the\n                    following witnesses who testified on behalf of the defendant in response to the\n                    subpoenas:(a)Jeffrey Ong Juinn Ann;[note: 6](b)Mohammed Zahid bin Abdul Rashid;[note: 7](c)Sharin bin Shariman;[note: 8](d)Shobna d/o Asok Kumar;[note: 9](e)Juliana binte Jabbar;[note: 10]and(f)Lester Mah Chwee Chuan,[note: 11]testified that\n                            he clearly remembered that the letters of resignation were not signed on\n                            14 June 2007 and that he was told, presumably by Edward, to ask the\n                            FARs to go to Edward’s office to sign them so that they could all\n                            move to Leadenhall earlier.I found these witnesses’ evidence to be reliable insofar as they\n                    show that their letters of resignation were signed after 14 June 2007.\n                    None of them had any reason or motive to concoct this part of their evidence.\n                    Given my finding that a significant proportion of the letters of resignation\n                    were in fact signed after 14 June 2007, it is an entirely permissible\n                    inference that all the letters must have been similarly backdated since all the\n                    FARs left the defendant for substantially the same reason and all of them\n                    eventually ended up working as FARs at Leadenhall at the same\n                time.24     In this regard, it is also relevant to note\n                    the testimony of Eileen Siaw (“Ms Siaw”) from iFast that the\n                    new Leadenhall FA codes for the FARs were only created on 22 and 23 July 2007.\n                    Ms Siaw’s evidence was that iFast did not receive the letters of\n                    resignation of the FARs from Edward prior to the Thailand trip between 6 and 14\n                    July 2007 (see[8]above). This would suggest\n                    that the resignations must have occurredafterthey had returned from the Thailand trip. If the resignations had taken place on\n                    14 June 2007 as shown on the face of the letters of resignation, there would\n                    have been no reason why the letters were not submitted earlier to iFast for the\n                    new Leadenhall FA codes to be generated.25     Furthermore, since the SWM division in\n                    Leadenhall was only formed around 17 July 2007, it is more likely than\n                    not that the resignations by the FARs only took place around the same\n                    time.26     Edward sought to disprove the backdating on\n                    the basis that there were in fact “push” factors which caused the\n                    FARs to resign. These “push” factors include:(a)the defendant’s decision that the FARs were\n                            to absorb the 2% increase of the GST;(b)the defendant’s decision to withhold\n                            payment of on-going fees which were paid by other similar companies;\n                            and(c)the defendant’s failure to provide\n                            direction and training to the FARs.27     The fact that there were these\n                    “push” factors had nothing to do with the issue and therefore did\n                    not rule out the alleged backdating. This is a separate and independent inquiry.\n                    In this connection, I pause to note that a number of the FARs who resigned had\n                    just joined the SWM division barely a few weeks prior to their resignations.\n                    Clearly, these new FARs did not resign due to the alleged “push”\n                    factors. Instead, their resignations were simply a reaction to join the other\n                    FARs. A number of the FARs also testified that they resigned because Edward had\n                    informed them that they could join Leadenhall on better terms.28     Since it is clear that there was backdating,\n                    it must follow that the FARs had failed to comply with the notice requirement\n                    under their respective contracts of employment. The next issue that arises is\n                    the exact date on which the letters of resignation were signed because it would\n                    determine the quantum in relation to the loss of commissions suffered by the\n                    defendant. However, it was not entirely clear from the evidence when the\n                    backdated letters were actually signed. At the trial, the parties were at\n                    complete odds as to who bore the burden to prove the exact date when the\n                    backdating had occurred and, surprisingly, were unable to provide me with any\n                    assistance whether by way of authorities or submissions.29     In my judgment, the present situation falls\n                    squarely within the scope of s 108 of the Evidence Act (Cap 97, 1997 Rev\n                    Ed) (“EA”), which reads as follows:Burden of proving fact especially within\n                            knowledge108. When any fact is\n                        especially within the knowledge of any person, the burden of proving that\n                        fact is upon him.Illustrations(a) When a person does an act with some intention other than that\n                            which the character and circumstances of the act suggest, the burden of\n                            proving that intention is upon him.(b)Ais charged with travelling on a\n                            railway without a ticket. The burden of proving that he had a ticket is\n                            on him.The application of s 108 of the EA was recently\n                    considered inSurender Singh s/o Jagdish Singh and another\n                        (administrators of the estate of Narindar Kaur d/o Sarwan Singh, deceased) v\n                        Li Man Kay and others[2010] 1 SLR 428\n                    (at [217] and [219]):217 Section 108 of the Evidence Act states that when any fact (whether\n                        affirmative or negative) is especially within the knowledge of any person,\n                        the burden of proving that fact is upon him. This is an exception to the\n                        general rule contained in s 103 of the Evidence Act, that the burden is on\n                        the party who asserts a fact. Section 108 of the Evidence Act applies only\n                        to those matters which are supposed to be within the knowledge of a\n                        defendant. It cannot apply when the fact or facts are such that they are\n                        capable of being known also by a person other than the defendant (seeSarkar's Law of Evidence([141]supra) vol 2 at p 1672)....219 In a similar vein, Ratanlal and Dhirajlal,Law of Evidence(at pp 1133-1134) and Woodroffe\n                        & Ali,Law of Evidence([141] supra) (vol\n                        3 at p 4223) notes that s 108 of the Evidence Act is:... designed to meet certain exceptional cases in which it would be\n                            impossible, or at any rate disproportionately difficult, for the\n                            [plaintiff] to establish facts which are 'especially' within the\n                            knowledge of the [defendant] and which [the defendant] could prove\n                            without difficulty or inconvenience. When any fact is within special\n                            knowledge of any person, the burden of proving that fact is upon him.\n                            The word ‘especially’ stresses that. It means facts that are\n                            pre-eminently or exceptionally within his knowledge.and also that the section:... must be considered in a commonsense way; and the balance of\n                            convenience and the disproportion of the labour, that would be involved\n                            in finding out and proving certain facts, balanced against the\n                            triviality of the issue at stake, and the case with which the\n                            [defendant] could prove them, must be taken into consideration.30     As the actual date of the resignation is a\n                    matter within the special knowledge of the FARs and it was practically\n                    impossible for the defendant to prove it, the burden must be on the plaintiffs\n                    to identify the precise date when the backdating occurred. As the plaintiffs\n                    have failed to adduce any reliable evidence as to the exact date when the\n                    backdating occurred (this is hardly surprising since their case is that the\n                    backdating did not occur), I am entitled to draw an adverse inference against\n                    them and presume that the backdating occurred on 14 July 2007, taking\n                    into account the dates when the FARs returned from the Thailand trip, when their\n                    new iFast Codes were created, and when Leadenhall’s new SWM division was\n                    set up. Finally, even without relying on the adverse inference, I find that by\n                    reason of the backdating (irrespective of when the backdating actually\n                    occurred), each of the FARs was in breach of contract in failing to give the\n                    requisite 30-days notice as required by the FA Agreements.31     By reason of their breaches in backdating the\n                    letters of resignation, I find that the defendant is entitled to claim loss of\n                    commission from each of the FARs that it would otherwise have earned during the\n                    30-days notice period. Initially, the defendant pleaded losses arising from both\n                    iFast and Navigator platforms but subsequently amended its counterclaim to\n                    delete all references to Navigator while reserving its rights to bring such a\n                    claim at a later date. As a result, the claim has only been quantified in\n                    respect of loss of commissions for the iFast platform. This was agreed by both\n                    parties to be $23,182.02 per month. This is the commission that the defendant\n                    would have earned from all the FARs in respect of the iFast platform if they had\n                    not backdated their letters of resignation.Forgery32     The defendant alleged that many of the consent\n                    forms signed by the clients to authorise the transfer of their investment\n                    accounts to Leadenhall were forged. The defendant claimed damages arising from\n                    the forgeries: the premise being that but for the forgeries, the investment\n                    accounts would have remained with the defendant and as such the defendant would\n                    have continued to earn the commissions. As mentioned above at[31], the defendant withdrew its claim in respect\n                    of the losses suffered from the Navigator platform. This was because the\n                    defendant encountered difficulties in obtaining the relevant transfer forms from\n                    Navigator in time for forensic analysis to be conducted. As a result, during the\n                    trial, the defendant only sought to prove that the signatures on the iFast\n                    transfer forms were forgeries and that this was engineered by Edward. The\n                    defendant’s case on the forgery was, however, unusual in the following\n                    respects.33     First, the defendant relied exclusively on the\n                    evidence of an expert witness from the Health Sciences Authority\n                    (“HSA”), Mr Yap Bei Sing (“Mr Yap”), since none\n                    of the clients whose signatures were allegedly forged appeared at the trial to\n                    complain about the alleged forgery or the consequent transfer of their\n                    investment accounts to Leadenhall. Although Mr Yap purportedly identified\n                    most of the signatures given to him for analysis as being\n                    “unlikely” to have been signed by the particular client, he had to\n                    qualify his findings because, for each signature he was asked to compare, he was\n                    only given one specimen signature for comparison when, ideally, he would have\n                    preferred five to 10 specimens to take into account the natural variations that\n                    would inevitably arise between an individual’s signatures.34     Additionally, there was no credible evidence\n                    to link Edward to the alleged forgeries in any way, whether he had personally\n                    forged the signatures or instructed others to carry out the forgeries. Further,\n                    there is no reliable evidence that any of the FARs had committed the forgeries\n                    and, if so, which of the alleged forgeries were to be attributed to them. I say\n                    no credible or reliable evidence was adduced because I found the evidence of\n                    Eric Yong Chung Syn[note: 12](“Eric Yong”) who testified for the defendant that he saw two\n                    FARs, Ho Rui Xia Cindy and Chen Anning Clair, forging signatures to be\n                    inherently unreliable. Eric Yong was one of the FARs involved in the mass\n                    resignation. He rejoined the defendant in October 2007 and worked there\n                    until the SWM division was shut down (see[4]above). During Eric Yong’s cross-examination, I found him to be an\n                    extremely unreliable witness on the stand: he adopted a very cavalier attitude\n                    when answering questions posed to him and was remarkably economical with the\n                    truth. Even counsel for the defendant had to concede that this particular\n                    witness, who testified on the defendant’s behalf, was “not\n                    forthright in his evidence”.[note: 13]35     As I found the evidence on the alleged\n                    forgeries to be inconclusive, I make no finding on this matter. This is because,\n                    in any event, it would not have improved the defendant’s case against\n                    Edward or the FARs for reasons that I will elaborate upon in a later part of my\n                    judgment regarding the defendant’s claim for loss of commissions (see[54]below).Wrongful terminationWhether the defendant was entitled to dismiss Edward on the ground of\n                misconduct by making cash-back payments to clients36     Edward’s letter of termination dated 8\n                    August 2007 reads as follows:RE: Notice of TerminationIn our letters dated 12thJuly 2007 addressed\n                        to Mr S. Ravi and you, we have highlighted to you that the MAS has received\n                        feedback from the public that Acclaim Strategic Wealth Management is\n                        involved in cashback arrangements and other activities which are not in\n                        compliance with the Financial Advisers Act.We have recently received an official complaint from an investor that you\n                        have been personally involved in a transaction which involved cashback\n                        arrangement with a client. In this regard, you were involved in an activity\n                        which is not in compliance with the Financial Advisers Act.In view of the serious nature of this complaint, you are hereby notified\n                        that we are terminating both your appointments as Head of Acclaim Strategic\n                        Wealth Management and as a Financial Adviser Manager with immediate\n                        effect.The Company expressly reserves all their rights against you.37     It is clear that the termination was based on\n                    an “official complaint” from an investor that Edward was\n                    personally involved in a cash-back arrangement and that such act was in breach\n                    of the FAA. Further, the defendant also claimed that such cash-back arrangement\n                    constituted a breach of clause 14.2 of the FAM Agreement which provides as\n                    follows:14.2Provided always that the Company shall have the\n                            absolute discretion to terminate this Agreement forthwith in writing and\n                            without adhering to the thirty (30) days notice requirement in the event\n                            the FA Manager:-...(c)by any act or omission including any breach of\n                                law, brings discredit to the reputation and integrity of the\n                                Company, or is guilty of any conduct or other serious offence, which\n                                is prejudicial to the reputation, standing or interest of the\n                                Company;(d)is in breach of any circular, instruction,\n                                ruling or directive issued by the Company, the Monetary Authority of\n                                Singapore or other relevant authority.38     The complaint was made by Ms Yeo. The salient\n                    parts of the complaint state,inter alia, as\n                    follows:Complaint lodged against Financial Adviser Manager\n                            – Edward WongI, Yeo Mui Khee, NRI S7420693Z, is (sic)\n                        making the following statement which is true and to the best of my\n                        knowledge....5)My initial investment was S$50,000.00 which was in\n                            either end Nov or beginning Dec 2006....7)On my initial investment of S$50,000.00, Kevin gave\n                            me back S$500 in cash being 1% of the invested amount.8)I did an add-on of S$30,000.00 which I later again\n                            got back S$300 in cash from Kevin.9)I did my first switch and a\n                                2ndadd-on of S$20,000.00 sometime in end\n                            Dec 2006 and asked for an advancement, but Jeremy Tan mentioned that he\n                            needs to seeks (sic) clearance from Edward\n                            Wong before he can release it. Couple of hours later, Jeremy said that\n                            Edward Wong is agreeable to only giving me S$800 in cash first which was\n                            for my current invested amount. The balance S$200 for my add-on, he will\n                            give it to Kevin later when the funds are being transferred\n                        out.10)Sometimes (sic) in\n                            Feb 2007, Kevin Yeo had an accident and I went to Edward Wong’s\n                            office in Ubi to iron out all the accounts payable due to him. Edward\n                            Wong said that he had paid in full whatever that is due to Kevin Yeo and\n                            there are no outstanding payments to him.11)In the same meeting, Edward Wong mentioned that,\n                            if I do further switch and recommend friends to him for investments, he\n                            will gave (sic) me the entire 2% of the\n                            invested amount as commission....13)Sometime, in April/May 2007, I contacted Jeremy\n                            Tan to initiate a fund switch. For this switch that I did, I received\n                            S$2,000.00 immediately upon signing the switch form as promised by\n                            Edward Wong during my meeting with him in Feb 2007. I met up with Jeremy\n                            Tan at Great World City and he passed the money to me.39     When the trial commenced, it was not clear\n                    whether Ms Yeo would testify as the defendant had not been able to serve the\n                    subpoena on her. At that stage, the only evidence on the alleged cash-back\n                    arrangement was an unsigned statement by Ms Yeo as well as the testimony of\n                    Anthony Lim and Jennifer Chiow Lay Hoon,[note: 14]the Compliance Manager of the defendant\n                    who interviewed Ms Yeo on the complaint.40     Prior to the oral testimony of Ms Yeo, I\n                    entertained some doubts as to the veracity of the complaint especially since\n                    there was no evidence that the defendant had sought any explanation from Edward\n                    after the complaint was lodged. Instead, the defendant’s only attempt to\n                    verify Ms Yeo’s complaint was limited to checking that the investment\n                    amounts mentioned in the complaint (see[38]above) were accurate and corresponded with its records, which, in my view, may\n                    not have necessarily led to the conclusion that Edward was actually involved in\n                    giving cash-backs. However, after hearing Ms Yeo’s evidence on the witness\n                    stand and taking into account the corroborative evidence of another FAR namely\n                    Jeremy Tan (who was called as a witness by Edward), I am satisfied that, despite\n                    the plaintiffs’ unconvincing attempt to attach significance to the fact\n                    that the complaint was unsigned, there is sufficient evidence before me to prove\n                    that Edward did engage in paying cash-backs to Ms Yeo.41     Ms Yeo testified that she had met Edward to\n                    claim outstanding commissions which were due to her brother. At that same\n                    meeting, Edward informed her that if she did a switch on her investment as well\n                    as add a further investment of $20,000, she would receive cash-back payments of\n                    $800 and $2,000. Her evidence corresponded with Jeremy Tan’s testimony\n                    that Edward did hand him two sums of $800 and $2,000 to pass to Ms Yeo, which he\n                    duly did as instructed. Jeremy Tan told the court that he was not informed of\n                    the reasons for the two payments. Although Edward’s case was that he did\n                    not hand over any money to Jeremy Tan for onward transmission to Ms Yeo, this\n                    part of Jeremy Tan’s evidence went notably unchallenged. Having had the\n                    opportunity to assess both Ms Yeo and Jeremy Tan on the witness stand, I found\n                    them to be truthful and credible witnesses and there has been no suggestion that\n                    any of them had a reason or motive to fabricate the evidence in order to\n                    implicate Edward.42     Further, although Edward was dismissed on the\n                    ground that he was involved in paying cash-back, there was no correspondence\n                    from him to the defendant denying the allegation. In cross-examination, he\n                    explained that his inaction was because, in his view, the complaint was\n                    “trumped up” and false. I found his explanation to be quite\n                    unbelievable given the circumstances. If he genuinely believed that the\n                    complaint was false, one would have expected him to take immediate steps to\n                    challenge the legitimacy of the complaint particularly since (by his own\n                    evidence) he would not be able to find alternative employment as a financial\n                    adviser with this “albatross” around\n                    his neck. Tellingly, Edward only decided to challenge the complaint some two\n                    years later by bringing the action in Suit 106 for wrongful\n                dismissal.43     Based on the corroborative evidence of the two\n                    witnesses. Ms Yeo and Jeremy Tan, together with the undisputed subsequent\n                    conduct of Edward, I find that Edward did make the two cash-back payments of\n                    $800 and $2,000 to Ms Yeo.Whether the defendant was entitled to dismiss Edward on the ground of\n                breach of duty of good faith and fidelity44     Even if my finding above that the defendant\n                    was entitled to terminate Edward from his position based on his involvement in\n                    making cash-back payments is wrong, I am of the opinion that the defendant was\n                    entitled to terminate Edward for breach of his duty of good faith and fidelity\n                    owed to the defendant, even though this ground was not raised in the letter of\n                    termination (see[36]above). I reiterate\n                    the position in law that I recently held inAldabe Fermin v\n                        Standard Chartered Bank[2010] 3 SLR 722\n                        (“Aldabe Fermin”) at [45],\n                    which is that at common law, a party is entitled to justify the termination of a\n                    contract on grounds other than the one furnished when the contract was\n                    terminated. There are exceptions to this rule, as I pointed out inAldabe Ferminat [48] (citingAmixco\n                        Asia (Pte) Ltd v Bank Bumiputra Malaysia Bhd[1992]\n                    2 SLR(R) 65): the general rule does not apply (a) first, if the party\n                    in breach could have put right the situation if given the opportunity to do so;\n                    or (b) second, if the innocent party by its conduct has waived its right to\n                    raise or is estopped from raising other grounds; or (c) third, if the innocent\n                    party is precluded by statute from raising new grounds. As Edward’s case\n                    was that all the grounds raised by the defendant for dismissing him were utter\n                    fabrications, unsurprisingly, no argument was raised by him on this particular\n                    point.45     The defendant’s case was that Edward, by\n                    engineering theen masseresignation of the FARs\n                    was in breach of his contractual and/or fiduciary duties. Although a substantial\n                    portion of parties’ submissions was addressed towards the question whether\n                    Edward was a fiduciary in relation to the defendant, I found it unnecessary and\n                    unhelpful to restrict the question so narrowly. The law is clear that a term\n                    will be implied into all employment relationships such that an employee owes his\n                    or her employer a duty of good faith and fidelity: seeRickshaw Investments Ltd and another v Nicolai Baron von Uexkull[2007] 1 SLR(R) 377 at [83] andMan Financial (S)\n                        Pte Ltd v Wong Bark Chuan David[2008] 1 SLR(R) 663 at\n                    [193]). Some examples of how this duty of good faith and fidelity translates\n                    into practice were given in the High Court decision ofAsiawerks Global Investment Group Pte Ltd v Ismail bin Syed Ahmad and\n                        another[2004] 1 SLR(R) 234 at [61]:There can be no denying that all employees are expected to serve their\n                        employers diligently, honestly and loyally. What this duty translates into\n                        factually depends on the circumstances such as the nature of the work.Employees should not be engaged in other business or\n                            employment during their working hours without the approval of their\n                            employers.They should certainly not be\n                            diverting business opportunities that they got wind of only because of\n                            their employment status and during the subsistence of the employment,\n                            whether or not such information amounted to confidential information\n                            within the meaning of the law.[emphasis added]In my view, such a duty applied to the present case without the need\n                    to delve into the question whether Edward was a fiduciary. Ultimately, what is\n                    required in the final analysis is the precise examination of the facts and\n                    circumstances such as the nature of the employment to determine the exact scope\n                    of the duty being owed. In any event, I am also prepared to find that Edward\n                    held a fiduciary position in relation to the defendant based on the nature of\n                    his duties as FAM and head of the SWM division. Under\n                        cross-examination,[note: 15]he expressly admitted that, as FAM,\n                    he received and held monies on behalf of the defendant as a trustee and that,\n                    under the FAM Agreement, he owed specific duties of honesty, integrity and\n                    loyalty to the defendant,egto recommend\n                    “introducers” only for the defendant; and not to represent or be\n                    connected with any other licensed or exempt Financial Adviser\n                Company.46     Therefore, by virtue of the duties of good\n                    faith and loyalty owed by Edward to the defendant, whether as a fiduciary or as\n                    a mere employee, I find that although Edward was certainly free to leave the\n                    defendant to join Leadenhall on his own accord after serving the appropriate\n                    notice period, he wasnotentitled to have\n                    instigated the mass exodus of the FARs to Leadenhall or to have instructed the\n                    FARs to transfer their clients to Leadenhallwhile he was\n                        still employed by the defendant. Although I have refrained from\n                    making a finding that the iFast transfer forms were actually forged (see[35]above), I am nonetheless satisfied\n                    that Edward had indeed instructed the FARs to transfer their clients over to\n                    Leadenhall for the simple reason that there would have been no reason for him to\n                    entice them to join Leadenhall if they were not bringing their clients along.\n                    Furthermore, it was clear from the evidence of Mr Ling Herng Wee Henry, director\n                    and shareholder of Leadenhall, that Edward was also actively involved together\n                    with his father, Allan Wong Mun Toong (“Allan Wong”) in the\n                    setting up of the SWM division of Leadenhall while he was still under the employ\n                    of the defendant.47     During oral closing submissions, counsel for\n                    the plaintiffs argued that Edward did not breach any duties of good faith owed\n                    to the defendant because there was an implied understanding between Edward and\n                    the defendant that Edward and the FARs were allowed to leave as a team and take\n                    their clients with them. In my view, such an implied understanding, even if\n                    founded, certainly did not extend to absolve Edward’s actions in the\n                    present case. The entire backdating exercise was clandestinely conducted under\n                    the cover of secrecy, and Edward had withheld the FARs’ resignation\n                    letters from the defendant until he had ensured that all the FARs had left to\n                    join Leadenhall. All this was, to me, a plain indication that they were well\n                    aware that what they were doing was illegitimate or, at the very least,\n                    improper. How this can be consistent with a duty of good faith, as argued by the\n                    plaintiffs’ counsel, was plainly beyond me.If the dismissal was wrongful, whether the damages would be limited\n                to the normal notice period48     Counsel for Edward also argued that, in the\n                    event that this court finds Edward’s dismissal to be wrongful, Edward\n                    would be entitled, on the authority ofMalik and Mahmud v\n                        Bank of Credit and Commerce International SA (In Compulsory\n                        Liquidation)[1998] 1 AC 20 (“Malik v BCCI”), to claim for damages arising from the\n                    handicap he suffered in the labour market as a result of his wrongful dismissal.\n                    It was claimed that after the defendant had dismissed Edward for making\n                    cash-back payments, he was no longer able to secure a position as a FAM and thus\n                    ended up as a training consultant at Leadenhall earning $3,000 per month since\n                    15 September 2007. As I have already made a positive finding that\n                    Edward was indeed involved in cash-back payments, I need not, strictly, consider\n                    this issue. However, as this point was argued before me by counsel for Edward at\n                    some length, I would make a few observations onMalik v\n                        BCCI.49     The proposition for whichMalik v BCCIstood for was succinctly stated by G P\n                    Selvam J inArul Chandran v Gartshore and\n                        others[2000] 1 SLR(R) 436 (“Arul Chandran”) (at [20]) as follows:This case made it possible to recover financial loss, that is special\n                        damages, where breach of a contract damages one's reputation which in turn\n                        causes foreseeable financial loss to the claimant. The claim is subject to\n                        the established limiting principles of remoteness causation and\n                        mitigation.G P Selvam J then went on to state the facts and the procedural\n                    history ofMalik v BCCIthat culminated in the\n                    House of Lords’ decision (Arul Chandranat [21] and [22]):21    TheMalikcase arose\n                            out of a contract of employment and the disastrous collapse of the\n                            infamous bank - Bank of Credit and Commerce International SA (BCCI)\n                            (\"the bank\"). Malik was the head of deposit accounts and customer\n                            services at a branch office of the bank. When the bank was ordered to be\n                            wound up he was dismissed by the provisional liquidators on the ground\n                            of redundancy. He brought an action asserting that he had lost more than\n                            his job. He said that by reason of the corrupt and/or dishonest manner\n                            in which the bank operated and the consequential collapse of the bank he\n                            was at a handicap on the labour market because he was stigmatised by\n                            reason of his employment by the bank. He claimed 50,000 based on some\n                            “table of service”. His claim was based on an implied term\n                            in his contract of employment that “the employer will not,\n                            without reasonable and proper cause, conduct itself in a manner\n                            calculated or likely to destroy or seriously damage the relationship of\n                            confidence and trust between employer and employee”. The\n                            liquidators rejected the claim.22 On appeal, Evans-Lombe J refused to imply the term contended for. The\n                        judge foundAddis v Gramophone Co Ltd([12]supra) the principal stumbling block. On\n                        appeal the Court of Appeal was prepared to imply a term to the effect that\n                        the bank was under a duty not, without reasonable and proper cause, to\n                        conduct itself in a manner calculated or likely to destroy or seriously\n                        damage the relationship of confidence and trust between employer and\n                        employee. Nevertheless, “stigma damage” as a head of\n                        compensation was not recoverable in law. Once againAddis\n                            v Gramophone Co Ltdprovided the justification for the\n                        decision. Malik appealed to the House of Lords. His appeal was allowed. The\n                        House of Lords ruled that the bank had broken its implied obligation of\n                        trust and confidence.Accordingly Malik was entitled to\n                            damages for the financial loss suffered by him upon proof and to the\n                            extent that his future employment prospects were prejudiced by the\n                            stigma of his employment with the egregious employer.[emphasis added]50     In the words of Lord Nicholls of Birkenhead,\n                    who delivered one of the two written judgments of the House of Lords inMalik v BCCI(at 37?38), such a claim was\n                    founded on the term of trust and confidence that is implied into every\n                    employment contract:Employers may be under no common law obligation, through the medium of an\n                        implied contractual term of general application, to take steps to improve\n                        their employees' future job prospects. But failure to improve is one thing,\n                        positively to damage is another. Employment, and job prospects, are matters\n                        of vital concern to most people. Jobs of all descriptions are less secure\n                        than formerly, people change jobs more frequently, and the job market is not\n                        always buoyant. Everyone knows this. An employment contract creates a close\n                        personal relationship, where there is often a disparity of power between the\n                        parties. Frequently the employee is vulnerable. Although the underlying\n                        purpose of the trust and confidence term is to protect the employment\n                        relationship,there can be nothing unfairly onerous or\n                            unreasonable in requiring an employer who breaches the trust and\n                            confidence term to be liable if he thereby causes continuing financial\n                            loss of a nature that was reasonably foreseeable. Employers\n                        must take care not to damage their employees' future employment prospects,\n                        by harsh and oppressive behaviour or by any other form of conduct which is\n                        unacceptable today as falling below the standards set by the implied trust\n                        and confidence term.[emphasis added]It was also made clear that any such claim would be for proven\n                    financial loss, and not for injury to reputation, which is separately protected\n                    by the law of defamation (at 40–41):Sometimes, in practice, the distinction between damage to reputation and\n                        financial loss can become blurred. Damage to the reputation of professional\n                        persons, or persons carrying on a business, frequently causes financial\n                        loss. None the less, the distinction is fundamentally sound, and when\n                        awarding damages for breach of contract courts take care to confine the\n                        damages to their proper ambit: making good financial loss.51     It is thus apparent fromMalik v BCCIthat a claimant will be entitled to damages from a\n                    former employer if he or she can prove that the former employer was in breach of\n                    the implied term of trust and confidence and which resulted in loss of future\n                    employment prospects. Lord Nicholls cautioned however that it may not always be\n                    easy to prove such a claim (at 42):[O]ne of the assumed facts in the present case is that the employer was\n                        conducting a dishonest and corrupt business. I would like to think this will\n                        rarely happen in practice. Thirdly, there are many circumstances in which an\n                        employee's reputation may suffer from his having been associated with an\n                        unsuccessful business, or an unsuccessful department within a business. In\n                        the ordinary way this will not found a claim of the nature made in the\n                        present case, even if the business or department was run with gross\n                        incompetence. A key feature in the present case is the assumed fact that the\n                        business was dishonest or corrupt. Finally, although the implied term that\n                        the business will not be conducted dishonestly is a term which avails all\n                        employees, proof of consequential handicap in the labour market may well be\n                        much more difficult for some classes of employees than others. An employer\n                        seeking to employ a messenger, for instance, might be wholly unconcerned by\n                        an applicant's former employment in a dishonest business, whereas he might\n                        take a different view if he were seeking a senior executive.52     Therefore, on the authority ofMalik v BCCI, I accept the submission by Edward’s\n                    counsel that, in principle, if it can be shown that the defendant had wrongfully\n                    dismissed Edward in a manner that was dishonest or illegitimate which amounted\n                    to a breach of the implied term of trust and confidence, and as a direct result\n                    of that wrongful dismissal it can be proven that Edward suffered a real and\n                    provable financial loss, in my view, Edward would be entitled to claim against\n                    the defendant for such loss beyond the contractual notice period. However, as I\n                    have already made clear that the defendant was entitled to terminate Edward from\n                    his position on not one but two separate grounds, I find that there is no merit\n                    to his claim which I dismiss accordingly.53     I would add that even if I had found that the\n                    defendant had wrongfully dismissed Edward, I find that his claim that he had\n                    suffered a loss of employment prospects to be altogether contrived. The only\n                    evidence produced by Edward to show that he had difficulties obtaining a job as\n                    a FAM after his dismissal was a rejection letter from Leadenhall which was\n                    signed by his own father, Allan Wong, who was then working for Leadenhall and\n                    had interviewed Edward in his application to join Leadenhall. In that letter,\n                    Allan Wong had stated that because Edward “was terminated by Acclaim on\n                    8.8.07 due to alleged cashback”, Leadenhall would not be accepting his\n                    “application unless the issue is resolved”. However, given the\n                    involvement of Edward and Allan Wong in the setting up of the SWM division of\n                    Leadenhall  (see[46]above) and Allan\n                    Wong’s key role in facilitating the exodus as the interviewer and\n                    recruiter for all the FARs who joined Leadenhall, I found the letter to be\n                    highly suspect and ascribed no weight whatsoever to it.Loss of commissions54     Having found that the defendant was entitled\n                    to the sum of $23,182.02 for the FARs’ failure to give the required 30\n                    days’ notice before resigning (see[31]above), the only issue remaining is whether the defendant\n                    could succeed in its claim for a further 17 months of commissions (see[11]above) arising from the mass resignation and\n                    the subsequent transfer of clients to Leadenhall.55     In my judgment, this particular claim must\n                    fail for the simple reason that the defendant has failed to prove that the mass\n                    resignation and the subsequent transfer of clients to Leadenhall would not have\n                    occurred but for the alleged forgeries or Edward’s breach of his duties to\n                    the defendant. First, it was undisputed that if Edward and the FARs had validly\n                    served the defendant 30 days’ notice before resigning, they were\n                    perfectly entitled to leave the defendant to join Leadenhall upon the expiry of\n                    that notice period. Second, it was the defendant’s own case that all the\n                    SWM division’s clients were effectively driven by “runners”\n                    (see[2]above) who were working in\n                    collaboration with Edward. Although counsel for the defendant attempted to argue\n                    that the FARs and the clients would not have left the defendant but for\n                    Edward’s directions, the evidence before me pointed to the conclusion that\n                    upon Edward leaving the defendant, it was inevitable that the FARs would have\n                    joined him and the clients would have been instructed by the\n                    “runners” to transfer their investment accounts to Leadenhall and\n                    therefore would have left the defendant in any event. There is simply no\n                    evidence to show that the clients would have remained with the defendant after\n                    the departure of Edward and the FARs. Indeed, none of the clients have appeared\n                    in court to complain about the transfers or the alleged forgeries. Therefore, in\n                    the present circumstances, at best, all that the defendant can show is that the\n                    forgeries, if proven, or Edward’s breach of his duties simply facilitated\n                    the transfers which would inevitably have taken place at a later\n                date.56     Although the defendant may feel aggrieved at\n                    the way the resignations were carried out by Edward and the FARs, it has to be\n                    noted that the defendant had no SWM division to speak of before Edward came\n                    onboard. The SWM division was, in fact, from the outset, set up and managed\n                    entirely by Edward. With the exception of Jeremy Tan, all the FARs in the\n                    defendant’s SWM division were personally recruited by Edward. There was\n                    also no suggestion that the clients who transferred over to Leadenhall were\n                    pre-existing clients who had been procured by the defendant before the SWM\n                    division was formed by Edward. If anything, the defendant benefited greatly from\n                    the commissions that Edward and his FARs brought in during the period when\n                    Edward was head of its SWM division. In my view, the defendant was entitled to\n                    no more than the sum that I have already awarded in respect of the breaches of\n                    contract by the FARs in failing to provide the required 30 days’ notice\n                    before resigning.Conclusion57     Accordingly, my orders are as follows:(a)     The defendant to pay the judgement\n                        debt in the sum of $59,892.13 granted to the first plaintiff in Suit 781 by\n                        way of summary judgment dated 4 June 2008 forthwith without any deduction or\n                        set-off.(b)     Judgment in favour of second plaintiff in Suit 781 in the sum of\n                        $231,946.10.(c)     The defendant’s counterclaim in Suit 781 succeeds only to the extent\n                        of $$23,182.02 which is to be set-off against the judgment sum due to the\n                        second plaintiff.(d)     The plaintiff’s claim in Suit 106 is hereby\n                    dismissed.(e)     Interest\n                        at 5.33% per annum on $59,892.13 and $208,763.99 ($231,946.10 - $23,182.02)\n                        in favour of the first and second plaintiff respectively from the date of\n                        the writ to the date of judgment.(f)     As for costs, the plaintiff substantially succeeded in\n                        Suit 781 but failed in his action in Suit 106. The defendant only succeeded\n                        in a small fraction of its counterclaim which was essentially the defence in\n                        Suit 106. In the light of my findings, I order that each party should bear\n                        its own costs for both proceedings.[note: 1]DW-1[note: 2]Except one who\n                                was already a FAR of the defendant when he joined the SWM\n                                division.[note: 3]PW-12[note: 4]PW-14[note: 5]PW-15[note: 6]DW-5[note: 7]DW-8[note: 8]DW-9[note: 9]DW-10[note: 10]DW-16[note: 11]DW-13[note: 12]DW-12[note: 13]Defendant’s Written Closing Submissions at\n                            [218][note: 14]DW-2[note: 15]Notes of Evidence Day 1 pg\n                                65-69",
        "Issues": "19     The following remaining issues arise for\n                    determination from both Suits: Suit 781(a)Were the letters of resignation by the FARs\n                            backdated?(b)Were the signatures for the transfer forms of the\n                            investment accounts forged and, if so, whether they were forged on the\n                            instructions of or to the knowledge of Edward?(c)If the answer to (a) and/or (b) is in the\n                            affirmative, what then is the measure of loss suffered by the defendant\n                            from such backdating and/or forgery?Suit 106(d)Did Edward engage in any cash-back arrangement\n                            with Ms Yeo to justify his dismissal?(e)Was Edward in breach of his fiduciary duties to\n                            the defendant in connection with theen\n                                masseresignations of the FARs and/or the setting up of\n                            the financial advisory division in Leadenhall?(f)If the dismissal was wrongful, whether the\n                            damages would be limited to the normal notice period?20     It is apparent that all the issues for\n                    determination are largely factual in nature. Accordingly, my decision on these\n                    issues is largely based on my analysis of the objective evidence before me as\n                    well as my assessment of the credibility of the numerous witnesses who testified\n                    at the trial. Although the issues are relatively uncomplicated, the trial\n                    nonetheless raged on for 13 days (originally fixed for 26 days) wherein 15\n                    witnesses testified for the plaintiffs while 16 witnesses testified for the\n                    defendant. Some of the witnesses filed affidavits of evidence-in-chief while\n                    many were subpoenaed.Backdating21     On or about 16 August 2007, the defendant was\n                    informed by Edward that all the FARs had tendered their resignations purportedly\n                    some two months ago on 14 June 2007. All the resignations had\n                    already been purportedly accepted by Edward on behalf of the SWM division of the\n                    defendant. By the time the defendant was informed of the resignations, all the\n                    FARs had already left to join Leadenhall.22     Although their letters of resignation were\n                    dated 14 June 2007, the following witnesses who testified for Edward and\n                    Stralos admitted that the letters were probably backdated:(a)Ganesh Krishnan;[note: 3](b)Kalithasan s/o Chelva Rajah;[note: 4]and(c)Jeremy Tan Shih Hwang (“Jeremy\n                                Tan”).[note: 5]23     The backdating was corroborated by the\n                    following witnesses who testified on behalf of the defendant in response to the\n                    subpoenas:(a)Jeffrey Ong Juinn Ann;[note: 6](b)Mohammed Zahid bin Abdul Rashid;[note: 7](c)Sharin bin Shariman;[note: 8](d)Shobna d/o Asok Kumar;[note: 9](e)Juliana binte Jabbar;[note: 10]and(f)Lester Mah Chwee Chuan,[note: 11]testified that\n                            he clearly remembered that the letters of resignation were not signed on\n                            14 June 2007 and that he was told, presumably by Edward, to ask the\n                            FARs to go to Edward’s office to sign them so that they could all\n                            move to Leadenhall earlier.I found these witnesses’ evidence to be reliable insofar as they\n                    show that their letters of resignation were signed after 14 June 2007.\n                    None of them had any reason or motive to concoct this part of their evidence.\n                    Given my finding that a significant proportion of the letters of resignation\n                    were in fact signed after 14 June 2007, it is an entirely permissible\n                    inference that all the letters must have been similarly backdated since all the\n                    FARs left the defendant for substantially the same reason and all of them\n                    eventually ended up working as FARs at Leadenhall at the same\n                time.24     In this regard, it is also relevant to note\n                    the testimony of Eileen Siaw (“Ms Siaw”) from iFast that the\n                    new Leadenhall FA codes for the FARs were only created on 22 and 23 July 2007.\n                    Ms Siaw’s evidence was that iFast did not receive the letters of\n                    resignation of the FARs from Edward prior to the Thailand trip between 6 and 14\n                    July 2007 (see[8]above). This would suggest\n                    that the resignations must have occurredafterthey had returned from the Thailand trip. If the resignations had taken place on\n                    14 June 2007 as shown on the face of the letters of resignation, there would\n                    have been no reason why the letters were not submitted earlier to iFast for the\n                    new Leadenhall FA codes to be generated.25     Furthermore, since the SWM division in\n                    Leadenhall was only formed around 17 July 2007, it is more likely than\n                    not that the resignations by the FARs only took place around the same\n                    time.26     Edward sought to disprove the backdating on\n                    the basis that there were in fact “push” factors which caused the\n                    FARs to resign. These “push” factors include:(a)the defendant’s decision that the FARs were\n                            to absorb the 2% increase of the GST;(b)the defendant’s decision to withhold\n                            payment of on-going fees which were paid by other similar companies;\n                            and(c)the defendant’s failure to provide\n                            direction and training to the FARs.27     The fact that there were these\n                    “push” factors had nothing to do with the issue and therefore did\n                    not rule out the alleged backdating. This is a separate and independent inquiry.\n                    In this connection, I pause to note that a number of the FARs who resigned had\n                    just joined the SWM division barely a few weeks prior to their resignations.\n                    Clearly, these new FARs did not resign due to the alleged “push”\n                    factors. Instead, their resignations were simply a reaction to join the other\n                    FARs. A number of the FARs also testified that they resigned because Edward had\n                    informed them that they could join Leadenhall on better terms.28     Since it is clear that there was backdating,\n                    it must follow that the FARs had failed to comply with the notice requirement\n                    under their respective contracts of employment. The next issue that arises is\n                    the exact date on which the letters of resignation were signed because it would\n                    determine the quantum in relation to the loss of commissions suffered by the\n                    defendant. However, it was not entirely clear from the evidence when the\n                    backdated letters were actually signed. At the trial, the parties were at\n                    complete odds as to who bore the burden to prove the exact date when the\n                    backdating had occurred and, surprisingly, were unable to provide me with any\n                    assistance whether by way of authorities or submissions.29     In my judgment, the present situation falls\n                    squarely within the scope of s 108 of the Evidence Act (Cap 97, 1997 Rev\n                    Ed) (“EA”), which reads as follows:Burden of proving fact especially within\n                            knowledge108. When any fact is\n                        especially within the knowledge of any person, the burden of proving that\n                        fact is upon him.Illustrations(a) When a person does an act with some intention other than that\n                            which the character and circumstances of the act suggest, the burden of\n                            proving that intention is upon him.(b)Ais charged with travelling on a\n                            railway without a ticket. The burden of proving that he had a ticket is\n                            on him.The application of s 108 of the EA was recently\n                    considered inSurender Singh s/o Jagdish Singh and another\n                        (administrators of the estate of Narindar Kaur d/o Sarwan Singh, deceased) v\n                        Li Man Kay and others[2010] 1 SLR 428\n                    (at [217] and [219]):217 Section 108 of the Evidence Act states that when any fact (whether\n                        affirmative or negative) is especially within the knowledge of any person,\n                        the burden of proving that fact is upon him. This is an exception to the\n                        general rule contained in s 103 of the Evidence Act, that the burden is on\n                        the party who asserts a fact. Section 108 of the Evidence Act applies only\n                        to those matters which are supposed to be within the knowledge of a\n                        defendant. It cannot apply when the fact or facts are such that they are\n                        capable of being known also by a person other than the defendant (seeSarkar's Law of Evidence([141]supra) vol 2 at p 1672)....219 In a similar vein, Ratanlal and Dhirajlal,Law of Evidence(at pp 1133-1134) and Woodroffe\n                        & Ali,Law of Evidence([141] supra) (vol\n                        3 at p 4223) notes that s 108 of the Evidence Act is:... designed to meet certain exceptional cases in which it would be\n                            impossible, or at any rate disproportionately difficult, for the\n                            [plaintiff] to establish facts which are 'especially' within the\n                            knowledge of the [defendant] and which [the defendant] could prove\n                            without difficulty or inconvenience. When any fact is within special\n                            knowledge of any person, the burden of proving that fact is upon him.\n                            The word ‘especially’ stresses that. It means facts that are\n                            pre-eminently or exceptionally within his knowledge.and also that the section:... must be considered in a commonsense way; and the balance of\n                            convenience and the disproportion of the labour, that would be involved\n                            in finding out and proving certain facts, balanced against the\n                            triviality of the issue at stake, and the case with which the\n                            [defendant] could prove them, must be taken into consideration.30     As the actual date of the resignation is a\n                    matter within the special knowledge of the FARs and it was practically\n                    impossible for the defendant to prove it, the burden must be on the plaintiffs\n                    to identify the precise date when the backdating occurred. As the plaintiffs\n                    have failed to adduce any reliable evidence as to the exact date when the\n                    backdating occurred (this is hardly surprising since their case is that the\n                    backdating did not occur), I am entitled to draw an adverse inference against\n                    them and presume that the backdating occurred on 14 July 2007, taking\n                    into account the dates when the FARs returned from the Thailand trip, when their\n                    new iFast Codes were created, and when Leadenhall’s new SWM division was\n                    set up. Finally, even without relying on the adverse inference, I find that by\n                    reason of the backdating (irrespective of when the backdating actually\n                    occurred), each of the FARs was in breach of contract in failing to give the\n                    requisite 30-days notice as required by the FA Agreements.31     By reason of their breaches in backdating the\n                    letters of resignation, I find that the defendant is entitled to claim loss of\n                    commission from each of the FARs that it would otherwise have earned during the\n                    30-days notice period. Initially, the defendant pleaded losses arising from both\n                    iFast and Navigator platforms but subsequently amended its counterclaim to\n                    delete all references to Navigator while reserving its rights to bring such a\n                    claim at a later date. As a result, the claim has only been quantified in\n                    respect of loss of commissions for the iFast platform. This was agreed by both\n                    parties to be $23,182.02 per month. This is the commission that the defendant\n                    would have earned from all the FARs in respect of the iFast platform if they had\n                    not backdated their letters of resignation.Forgery32     The defendant alleged that many of the consent\n                    forms signed by the clients to authorise the transfer of their investment\n                    accounts to Leadenhall were forged. The defendant claimed damages arising from\n                    the forgeries: the premise being that but for the forgeries, the investment\n                    accounts would have remained with the defendant and as such the defendant would\n                    have continued to earn the commissions. As mentioned above at[31], the defendant withdrew its claim in respect\n                    of the losses suffered from the Navigator platform. This was because the\n                    defendant encountered difficulties in obtaining the relevant transfer forms from\n                    Navigator in time for forensic analysis to be conducted. As a result, during the\n                    trial, the defendant only sought to prove that the signatures on the iFast\n                    transfer forms were forgeries and that this was engineered by Edward. The\n                    defendant’s case on the forgery was, however, unusual in the following\n                    respects.33     First, the defendant relied exclusively on the\n                    evidence of an expert witness from the Health Sciences Authority\n                    (“HSA”), Mr Yap Bei Sing (“Mr Yap”), since none\n                    of the clients whose signatures were allegedly forged appeared at the trial to\n                    complain about the alleged forgery or the consequent transfer of their\n                    investment accounts to Leadenhall. Although Mr Yap purportedly identified\n                    most of the signatures given to him for analysis as being\n                    “unlikely” to have been signed by the particular client, he had to\n                    qualify his findings because, for each signature he was asked to compare, he was\n                    only given one specimen signature for comparison when, ideally, he would have\n                    preferred five to 10 specimens to take into account the natural variations that\n                    would inevitably arise between an individual’s signatures.34     Additionally, there was no credible evidence\n                    to link Edward to the alleged forgeries in any way, whether he had personally\n                    forged the signatures or instructed others to carry out the forgeries. Further,\n                    there is no reliable evidence that any of the FARs had committed the forgeries\n                    and, if so, which of the alleged forgeries were to be attributed to them. I say\n                    no credible or reliable evidence was adduced because I found the evidence of\n                    Eric Yong Chung Syn[note: 12](“Eric Yong”) who testified for the defendant that he saw two\n                    FARs, Ho Rui Xia Cindy and Chen Anning Clair, forging signatures to be\n                    inherently unreliable. Eric Yong was one of the FARs involved in the mass\n                    resignation. He rejoined the defendant in October 2007 and worked there\n                    until the SWM division was shut down (see[4]above). During Eric Yong’s cross-examination, I found him to be an\n                    extremely unreliable witness on the stand: he adopted a very cavalier attitude\n                    when answering questions posed to him and was remarkably economical with the\n                    truth. Even counsel for the defendant had to concede that this particular\n                    witness, who testified on the defendant’s behalf, was “not\n                    forthright in his evidence”.[note: 13]35     As I found the evidence on the alleged\n                    forgeries to be inconclusive, I make no finding on this matter. This is because,\n                    in any event, it would not have improved the defendant’s case against\n                    Edward or the FARs for reasons that I will elaborate upon in a later part of my\n                    judgment regarding the defendant’s claim for loss of commissions (see[54]below).Wrongful terminationWhether the defendant was entitled to dismiss Edward on the ground of\n                misconduct by making cash-back payments to clients36     Edward’s letter of termination dated 8\n                    August 2007 reads as follows:RE: Notice of TerminationIn our letters dated 12thJuly 2007 addressed\n                        to Mr S. Ravi and you, we have highlighted to you that the MAS has received\n                        feedback from the public that Acclaim Strategic Wealth Management is\n                        involved in cashback arrangements and other activities which are not in\n                        compliance with the Financial Advisers Act.We have recently received an official complaint from an investor that you\n                        have been personally involved in a transaction which involved cashback\n                        arrangement with a client. In this regard, you were involved in an activity\n                        which is not in compliance with the Financial Advisers Act.In view of the serious nature of this complaint, you are hereby notified\n                        that we are terminating both your appointments as Head of Acclaim Strategic\n                        Wealth Management and as a Financial Adviser Manager with immediate\n                        effect.The Company expressly reserves all their rights against you.37     It is clear that the termination was based on\n                    an “official complaint” from an investor that Edward was\n                    personally involved in a cash-back arrangement and that such act was in breach\n                    of the FAA. Further, the defendant also claimed that such cash-back arrangement\n                    constituted a breach of clause 14.2 of the FAM Agreement which provides as\n                    follows:14.2Provided always that the Company shall have the\n                            absolute discretion to terminate this Agreement forthwith in writing and\n                            without adhering to the thirty (30) days notice requirement in the event\n                            the FA Manager:-...(c)by any act or omission including any breach of\n                                law, brings discredit to the reputation and integrity of the\n                                Company, or is guilty of any conduct or other serious offence, which\n                                is prejudicial to the reputation, standing or interest of the\n                                Company;(d)is in breach of any circular, instruction,\n                                ruling or directive issued by the Company, the Monetary Authority of\n                                Singapore or other relevant authority.38     The complaint was made by Ms Yeo. The salient\n                    parts of the complaint state,inter alia, as\n                    follows:Complaint lodged against Financial Adviser Manager\n                            – Edward WongI, Yeo Mui Khee, NRI S7420693Z, is (sic)\n                        making the following statement which is true and to the best of my\n                        knowledge....5)My initial investment was S$50,000.00 which was in\n                            either end Nov or beginning Dec 2006....7)On my initial investment of S$50,000.00, Kevin gave\n                            me back S$500 in cash being 1% of the invested amount.8)I did an add-on of S$30,000.00 which I later again\n                            got back S$300 in cash from Kevin.9)I did my first switch and a\n                                2ndadd-on of S$20,000.00 sometime in end\n                            Dec 2006 and asked for an advancement, but Jeremy Tan mentioned that he\n                            needs to seeks (sic) clearance from Edward\n                            Wong before he can release it. Couple of hours later, Jeremy said that\n                            Edward Wong is agreeable to only giving me S$800 in cash first which was\n                            for my current invested amount. The balance S$200 for my add-on, he will\n                            give it to Kevin later when the funds are being transferred\n                        out.10)Sometimes (sic) in\n                            Feb 2007, Kevin Yeo had an accident and I went to Edward Wong’s\n                            office in Ubi to iron out all the accounts payable due to him. Edward\n                            Wong said that he had paid in full whatever that is due to Kevin Yeo and\n                            there are no outstanding payments to him.11)In the same meeting, Edward Wong mentioned that,\n                            if I do further switch and recommend friends to him for investments, he\n                            will gave (sic) me the entire 2% of the\n                            invested amount as commission....13)Sometime, in April/May 2007, I contacted Jeremy\n                            Tan to initiate a fund switch. For this switch that I did, I received\n                            S$2,000.00 immediately upon signing the switch form as promised by\n                            Edward Wong during my meeting with him in Feb 2007. I met up with Jeremy\n                            Tan at Great World City and he passed the money to me.39     When the trial commenced, it was not clear\n                    whether Ms Yeo would testify as the defendant had not been able to serve the\n                    subpoena on her. At that stage, the only evidence on the alleged cash-back\n                    arrangement was an unsigned statement by Ms Yeo as well as the testimony of\n                    Anthony Lim and Jennifer Chiow Lay Hoon,[note: 14]the Compliance Manager of the defendant\n                    who interviewed Ms Yeo on the complaint.40     Prior to the oral testimony of Ms Yeo, I\n                    entertained some doubts as to the veracity of the complaint especially since\n                    there was no evidence that the defendant had sought any explanation from Edward\n                    after the complaint was lodged. Instead, the defendant’s only attempt to\n                    verify Ms Yeo’s complaint was limited to checking that the investment\n                    amounts mentioned in the complaint (see[38]above) were accurate and corresponded with its records, which, in my view, may\n                    not have necessarily led to the conclusion that Edward was actually involved in\n                    giving cash-backs. However, after hearing Ms Yeo’s evidence on the witness\n                    stand and taking into account the corroborative evidence of another FAR namely\n                    Jeremy Tan (who was called as a witness by Edward), I am satisfied that, despite\n                    the plaintiffs’ unconvincing attempt to attach significance to the fact\n                    that the complaint was unsigned, there is sufficient evidence before me to prove\n                    that Edward did engage in paying cash-backs to Ms Yeo.41     Ms Yeo testified that she had met Edward to\n                    claim outstanding commissions which were due to her brother. At that same\n                    meeting, Edward informed her that if she did a switch on her investment as well\n                    as add a further investment of $20,000, she would receive cash-back payments of\n                    $800 and $2,000. Her evidence corresponded with Jeremy Tan’s testimony\n                    that Edward did hand him two sums of $800 and $2,000 to pass to Ms Yeo, which he\n                    duly did as instructed. Jeremy Tan told the court that he was not informed of\n                    the reasons for the two payments. Although Edward’s case was that he did\n                    not hand over any money to Jeremy Tan for onward transmission to Ms Yeo, this\n                    part of Jeremy Tan’s evidence went notably unchallenged. Having had the\n                    opportunity to assess both Ms Yeo and Jeremy Tan on the witness stand, I found\n                    them to be truthful and credible witnesses and there has been no suggestion that\n                    any of them had a reason or motive to fabricate the evidence in order to\n                    implicate Edward.42     Further, although Edward was dismissed on the\n                    ground that he was involved in paying cash-back, there was no correspondence\n                    from him to the defendant denying the allegation. In cross-examination, he\n                    explained that his inaction was because, in his view, the complaint was\n                    “trumped up” and false. I found his explanation to be quite\n                    unbelievable given the circumstances. If he genuinely believed that the\n                    complaint was false, one would have expected him to take immediate steps to\n                    challenge the legitimacy of the complaint particularly since (by his own\n                    evidence) he would not be able to find alternative employment as a financial\n                    adviser with this “albatross” around\n                    his neck. Tellingly, Edward only decided to challenge the complaint some two\n                    years later by bringing the action in Suit 106 for wrongful\n                dismissal.43     Based on the corroborative evidence of the two\n                    witnesses. Ms Yeo and Jeremy Tan, together with the undisputed subsequent\n                    conduct of Edward, I find that Edward did make the two cash-back payments of\n                    $800 and $2,000 to Ms Yeo.Whether the defendant was entitled to dismiss Edward on the ground of\n                breach of duty of good faith and fidelity44     Even if my finding above that the defendant\n                    was entitled to terminate Edward from his position based on his involvement in\n                    making cash-back payments is wrong, I am of the opinion that the defendant was\n                    entitled to terminate Edward for breach of his duty of good faith and fidelity\n                    owed to the defendant, even though this ground was not raised in the letter of\n                    termination (see[36]above). I reiterate\n                    the position in law that I recently held inAldabe Fermin v\n                        Standard Chartered Bank[2010] 3 SLR 722\n                        (“Aldabe Fermin”) at [45],\n                    which is that at common law, a party is entitled to justify the termination of a\n                    contract on grounds other than the one furnished when the contract was\n                    terminated. There are exceptions to this rule, as I pointed out inAldabe Ferminat [48] (citingAmixco\n                        Asia (Pte) Ltd v Bank Bumiputra Malaysia Bhd[1992]\n                    2 SLR(R) 65): the general rule does not apply (a) first, if the party\n                    in breach could have put right the situation if given the opportunity to do so;\n                    or (b) second, if the innocent party by its conduct has waived its right to\n                    raise or is estopped from raising other grounds; or (c) third, if the innocent\n                    party is precluded by statute from raising new grounds. As Edward’s case\n                    was that all the grounds raised by the defendant for dismissing him were utter\n                    fabrications, unsurprisingly, no argument was raised by him on this particular\n                    point.45     The defendant’s case was that Edward, by\n                    engineering theen masseresignation of the FARs\n                    was in breach of his contractual and/or fiduciary duties. Although a substantial\n                    portion of parties’ submissions was addressed towards the question whether\n                    Edward was a fiduciary in relation to the defendant, I found it unnecessary and\n                    unhelpful to restrict the question so narrowly. The law is clear that a term\n                    will be implied into all employment relationships such that an employee owes his\n                    or her employer a duty of good faith and fidelity: seeRickshaw Investments Ltd and another v Nicolai Baron von Uexkull[2007] 1 SLR(R) 377 at [83] andMan Financial (S)\n                        Pte Ltd v Wong Bark Chuan David[2008] 1 SLR(R) 663 at\n                    [193]). Some examples of how this duty of good faith and fidelity translates\n                    into practice were given in the High Court decision ofAsiawerks Global Investment Group Pte Ltd v Ismail bin Syed Ahmad and\n                        another[2004] 1 SLR(R) 234 at [61]:There can be no denying that all employees are expected to serve their\n                        employers diligently, honestly and loyally. What this duty translates into\n                        factually depends on the circumstances such as the nature of the work.Employees should not be engaged in other business or\n                            employment during their working hours without the approval of their\n                            employers.They should certainly not be\n                            diverting business opportunities that they got wind of only because of\n                            their employment status and during the subsistence of the employment,\n                            whether or not such information amounted to confidential information\n                            within the meaning of the law.[emphasis added]In my view, such a duty applied to the present case without the need\n                    to delve into the question whether Edward was a fiduciary. Ultimately, what is\n                    required in the final analysis is the precise examination of the facts and\n                    circumstances such as the nature of the employment to determine the exact scope\n                    of the duty being owed. In any event, I am also prepared to find that Edward\n                    held a fiduciary position in relation to the defendant based on the nature of\n                    his duties as FAM and head of the SWM division. Under\n                        cross-examination,[note: 15]he expressly admitted that, as FAM,\n                    he received and held monies on behalf of the defendant as a trustee and that,\n                    under the FAM Agreement, he owed specific duties of honesty, integrity and\n                    loyalty to the defendant,egto recommend\n                    “introducers” only for the defendant; and not to represent or be\n                    connected with any other licensed or exempt Financial Adviser\n                Company.46     Therefore, by virtue of the duties of good\n                    faith and loyalty owed by Edward to the defendant, whether as a fiduciary or as\n                    a mere employee, I find that although Edward was certainly free to leave the\n                    defendant to join Leadenhall on his own accord after serving the appropriate\n                    notice period, he wasnotentitled to have\n                    instigated the mass exodus of the FARs to Leadenhall or to have instructed the\n                    FARs to transfer their clients to Leadenhallwhile he was\n                        still employed by the defendant. Although I have refrained from\n                    making a finding that the iFast transfer forms were actually forged (see[35]above), I am nonetheless satisfied\n                    that Edward had indeed instructed the FARs to transfer their clients over to\n                    Leadenhall for the simple reason that there would have been no reason for him to\n                    entice them to join Leadenhall if they were not bringing their clients along.\n                    Furthermore, it was clear from the evidence of Mr Ling Herng Wee Henry, director\n                    and shareholder of Leadenhall, that Edward was also actively involved together\n                    with his father, Allan Wong Mun Toong (“Allan Wong”) in the\n                    setting up of the SWM division of Leadenhall while he was still under the employ\n                    of the defendant.47     During oral closing submissions, counsel for\n                    the plaintiffs argued that Edward did not breach any duties of good faith owed\n                    to the defendant because there was an implied understanding between Edward and\n                    the defendant that Edward and the FARs were allowed to leave as a team and take\n                    their clients with them. In my view, such an implied understanding, even if\n                    founded, certainly did not extend to absolve Edward’s actions in the\n                    present case. The entire backdating exercise was clandestinely conducted under\n                    the cover of secrecy, and Edward had withheld the FARs’ resignation\n                    letters from the defendant until he had ensured that all the FARs had left to\n                    join Leadenhall. All this was, to me, a plain indication that they were well\n                    aware that what they were doing was illegitimate or, at the very least,\n                    improper. How this can be consistent with a duty of good faith, as argued by the\n                    plaintiffs’ counsel, was plainly beyond me.If the dismissal was wrongful, whether the damages would be limited\n                to the normal notice period48     Counsel for Edward also argued that, in the\n                    event that this court finds Edward’s dismissal to be wrongful, Edward\n                    would be entitled, on the authority ofMalik and Mahmud v\n                        Bank of Credit and Commerce International SA (In Compulsory\n                        Liquidation)[1998] 1 AC 20 (“Malik v BCCI”), to claim for damages arising from the\n                    handicap he suffered in the labour market as a result of his wrongful dismissal.\n                    It was claimed that after the defendant had dismissed Edward for making\n                    cash-back payments, he was no longer able to secure a position as a FAM and thus\n                    ended up as a training consultant at Leadenhall earning $3,000 per month since\n                    15 September 2007. As I have already made a positive finding that\n                    Edward was indeed involved in cash-back payments, I need not, strictly, consider\n                    this issue. However, as this point was argued before me by counsel for Edward at\n                    some length, I would make a few observations onMalik v\n                        BCCI.49     The proposition for whichMalik v BCCIstood for was succinctly stated by G P\n                    Selvam J inArul Chandran v Gartshore and\n                        others[2000] 1 SLR(R) 436 (“Arul Chandran”) (at [20]) as follows:This case made it possible to recover financial loss, that is special\n                        damages, where breach of a contract damages one's reputation which in turn\n                        causes foreseeable financial loss to the claimant. The claim is subject to\n                        the established limiting principles of remoteness causation and\n                        mitigation.G P Selvam J then went on to state the facts and the procedural\n                    history ofMalik v BCCIthat culminated in the\n                    House of Lords’ decision (Arul Chandranat [21] and [22]):21    TheMalikcase arose\n                            out of a contract of employment and the disastrous collapse of the\n                            infamous bank - Bank of Credit and Commerce International SA (BCCI)\n                            (\"the bank\"). Malik was the head of deposit accounts and customer\n                            services at a branch office of the bank. When the bank was ordered to be\n                            wound up he was dismissed by the provisional liquidators on the ground\n                            of redundancy. He brought an action asserting that he had lost more than\n                            his job. He said that by reason of the corrupt and/or dishonest manner\n                            in which the bank operated and the consequential collapse of the bank he\n                            was at a handicap on the labour market because he was stigmatised by\n                            reason of his employment by the bank. He claimed 50,000 based on some\n                            “table of service”. His claim was based on an implied term\n                            in his contract of employment that “the employer will not,\n                            without reasonable and proper cause, conduct itself in a manner\n                            calculated or likely to destroy or seriously damage the relationship of\n                            confidence and trust between employer and employee”. The\n                            liquidators rejected the claim.22 On appeal, Evans-Lombe J refused to imply the term contended for. The\n                        judge foundAddis v Gramophone Co Ltd([12]supra) the principal stumbling block. On\n                        appeal the Court of Appeal was prepared to imply a term to the effect that\n                        the bank was under a duty not, without reasonable and proper cause, to\n                        conduct itself in a manner calculated or likely to destroy or seriously\n                        damage the relationship of confidence and trust between employer and\n                        employee. Nevertheless, “stigma damage” as a head of\n                        compensation was not recoverable in law. Once againAddis\n                            v Gramophone Co Ltdprovided the justification for the\n                        decision. Malik appealed to the House of Lords. His appeal was allowed. The\n                        House of Lords ruled that the bank had broken its implied obligation of\n                        trust and confidence.Accordingly Malik was entitled to\n                            damages for the financial loss suffered by him upon proof and to the\n                            extent that his future employment prospects were prejudiced by the\n                            stigma of his employment with the egregious employer.[emphasis added]50     In the words of Lord Nicholls of Birkenhead,\n                    who delivered one of the two written judgments of the House of Lords inMalik v BCCI(at 37?38), such a claim was\n                    founded on the term of trust and confidence that is implied into every\n                    employment contract:Employers may be under no common law obligation, through the medium of an\n                        implied contractual term of general application, to take steps to improve\n                        their employees' future job prospects. But failure to improve is one thing,\n                        positively to damage is another. Employment, and job prospects, are matters\n                        of vital concern to most people. Jobs of all descriptions are less secure\n                        than formerly, people change jobs more frequently, and the job market is not\n                        always buoyant. Everyone knows this. An employment contract creates a close\n                        personal relationship, where there is often a disparity of power between the\n                        parties. Frequently the employee is vulnerable. Although the underlying\n                        purpose of the trust and confidence term is to protect the employment\n                        relationship,there can be nothing unfairly onerous or\n                            unreasonable in requiring an employer who breaches the trust and\n                            confidence term to be liable if he thereby causes continuing financial\n                            loss of a nature that was reasonably foreseeable. Employers\n                        must take care not to damage their employees' future employment prospects,\n                        by harsh and oppressive behaviour or by any other form of conduct which is\n                        unacceptable today as falling below the standards set by the implied trust\n                        and confidence term.[emphasis added]It was also made clear that any such claim would be for proven\n                    financial loss, and not for injury to reputation, which is separately protected\n                    by the law of defamation (at 40–41):Sometimes, in practice, the distinction between damage to reputation and\n                        financial loss can become blurred. Damage to the reputation of professional\n                        persons, or persons carrying on a business, frequently causes financial\n                        loss. None the less, the distinction is fundamentally sound, and when\n                        awarding damages for breach of contract courts take care to confine the\n                        damages to their proper ambit: making good financial loss.51     It is thus apparent fromMalik v BCCIthat a claimant will be entitled to damages from a\n                    former employer if he or she can prove that the former employer was in breach of\n                    the implied term of trust and confidence and which resulted in loss of future\n                    employment prospects. Lord Nicholls cautioned however that it may not always be\n                    easy to prove such a claim (at 42):[O]ne of the assumed facts in the present case is that the employer was\n                        conducting a dishonest and corrupt business. I would like to think this will\n                        rarely happen in practice. Thirdly, there are many circumstances in which an\n                        employee's reputation may suffer from his having been associated with an\n                        unsuccessful business, or an unsuccessful department within a business. In\n                        the ordinary way this will not found a claim of the nature made in the\n                        present case, even if the business or department was run with gross\n                        incompetence. A key feature in the present case is the assumed fact that the\n                        business was dishonest or corrupt. Finally, although the implied term that\n                        the business will not be conducted dishonestly is a term which avails all\n                        employees, proof of consequential handicap in the labour market may well be\n                        much more difficult for some classes of employees than others. An employer\n                        seeking to employ a messenger, for instance, might be wholly unconcerned by\n                        an applicant's former employment in a dishonest business, whereas he might\n                        take a different view if he were seeking a senior executive.52     Therefore, on the authority ofMalik v BCCI, I accept the submission by Edward’s\n                    counsel that, in principle, if it can be shown that the defendant had wrongfully\n                    dismissed Edward in a manner that was dishonest or illegitimate which amounted\n                    to a breach of the implied term of trust and confidence, and as a direct result\n                    of that wrongful dismissal it can be proven that Edward suffered a real and\n                    provable financial loss, in my view, Edward would be entitled to claim against\n                    the defendant for such loss beyond the contractual notice period. However, as I\n                    have already made clear that the defendant was entitled to terminate Edward from\n                    his position on not one but two separate grounds, I find that there is no merit\n                    to his claim which I dismiss accordingly.53     I would add that even if I had found that the\n                    defendant had wrongfully dismissed Edward, I find that his claim that he had\n                    suffered a loss of employment prospects to be altogether contrived. The only\n                    evidence produced by Edward to show that he had difficulties obtaining a job as\n                    a FAM after his dismissal was a rejection letter from Leadenhall which was\n                    signed by his own father, Allan Wong, who was then working for Leadenhall and\n                    had interviewed Edward in his application to join Leadenhall. In that letter,\n                    Allan Wong had stated that because Edward “was terminated by Acclaim on\n                    8.8.07 due to alleged cashback”, Leadenhall would not be accepting his\n                    “application unless the issue is resolved”. However, given the\n                    involvement of Edward and Allan Wong in the setting up of the SWM division of\n                    Leadenhall  (see[46]above) and Allan\n                    Wong’s key role in facilitating the exodus as the interviewer and\n                    recruiter for all the FARs who joined Leadenhall, I found the letter to be\n                    highly suspect and ascribed no weight whatsoever to it.Loss of commissions54     Having found that the defendant was entitled\n                    to the sum of $23,182.02 for the FARs’ failure to give the required 30\n                    days’ notice before resigning (see[31]above), the only issue remaining is whether the defendant\n                    could succeed in its claim for a further 17 months of commissions (see[11]above) arising from the mass resignation and\n                    the subsequent transfer of clients to Leadenhall.55     In my judgment, this particular claim must\n                    fail for the simple reason that the defendant has failed to prove that the mass\n                    resignation and the subsequent transfer of clients to Leadenhall would not have\n                    occurred but for the alleged forgeries or Edward’s breach of his duties to\n                    the defendant. First, it was undisputed that if Edward and the FARs had validly\n                    served the defendant 30 days’ notice before resigning, they were\n                    perfectly entitled to leave the defendant to join Leadenhall upon the expiry of\n                    that notice period. Second, it was the defendant’s own case that all the\n                    SWM division’s clients were effectively driven by “runners”\n                    (see[2]above) who were working in\n                    collaboration with Edward. Although counsel for the defendant attempted to argue\n                    that the FARs and the clients would not have left the defendant but for\n                    Edward’s directions, the evidence before me pointed to the conclusion that\n                    upon Edward leaving the defendant, it was inevitable that the FARs would have\n                    joined him and the clients would have been instructed by the\n                    “runners” to transfer their investment accounts to Leadenhall and\n                    therefore would have left the defendant in any event. There is simply no\n                    evidence to show that the clients would have remained with the defendant after\n                    the departure of Edward and the FARs. Indeed, none of the clients have appeared\n                    in court to complain about the transfers or the alleged forgeries. Therefore, in\n                    the present circumstances, at best, all that the defendant can show is that the\n                    forgeries, if proven, or Edward’s breach of his duties simply facilitated\n                    the transfers which would inevitably have taken place at a later\n                date.56     Although the defendant may feel aggrieved at\n                    the way the resignations were carried out by Edward and the FARs, it has to be\n                    noted that the defendant had no SWM division to speak of before Edward came\n                    onboard. The SWM division was, in fact, from the outset, set up and managed\n                    entirely by Edward. With the exception of Jeremy Tan, all the FARs in the\n                    defendant’s SWM division were personally recruited by Edward. There was\n                    also no suggestion that the clients who transferred over to Leadenhall were\n                    pre-existing clients who had been procured by the defendant before the SWM\n                    division was formed by Edward. If anything, the defendant benefited greatly from\n                    the commissions that Edward and his FARs brought in during the period when\n                    Edward was head of its SWM division. In my view, the defendant was entitled to\n                    no more than the sum that I have already awarded in respect of the breaches of\n                    contract by the FARs in failing to provide the required 30 days’ notice\n                    before resigning.Conclusion57     Accordingly, my orders are as follows:(a)     The defendant to pay the judgement\n                        debt in the sum of $59,892.13 granted to the first plaintiff in Suit 781 by\n                        way of summary judgment dated 4 June 2008 forthwith without any deduction or\n                        set-off.(b)     Judgment in favour of second plaintiff in Suit 781 in the sum of\n                        $231,946.10.(c)     The defendant’s counterclaim in Suit 781 succeeds only to the extent\n                        of $$23,182.02 which is to be set-off against the judgment sum due to the\n                        second plaintiff.(d)     The plaintiff’s claim in Suit 106 is hereby\n                    dismissed.(e)     Interest\n                        at 5.33% per annum on $59,892.13 and $208,763.99 ($231,946.10 - $23,182.02)\n                        in favour of the first and second plaintiff respectively from the date of\n                        the writ to the date of judgment.(f)     As for costs, the plaintiff substantially succeeded in\n                        Suit 781 but failed in his action in Suit 106. The defendant only succeeded\n                        in a small fraction of its counterclaim which was essentially the defence in\n                        Suit 106. In the light of my findings, I order that each party should bear\n                        its own costs for both proceedings.[note: 1]DW-1[note: 2]Except one who\n                                was already a FAR of the defendant when he joined the SWM\n                                division.[note: 3]PW-12[note: 4]PW-14[note: 5]PW-15[note: 6]DW-5[note: 7]DW-8[note: 8]DW-9[note: 9]DW-10[note: 10]DW-16[note: 11]DW-13[note: 12]DW-12[note: 13]Defendant’s Written Closing Submissions at\n                            [218][note: 14]DW-2[note: 15]Notes of Evidence Day 1 pg\n                                65-69",
        "Backdating": "21     On or about 16 August 2007, the defendant was\n                    informed by Edward that all the FARs had tendered their resignations purportedly\n                    some two months ago on 14 June 2007. All the resignations had\n                    already been purportedly accepted by Edward on behalf of the SWM division of the\n                    defendant. By the time the defendant was informed of the resignations, all the\n                    FARs had already left to join Leadenhall. 22     Although their letters of resignation were\n                    dated 14 June 2007, the following witnesses who testified for Edward and\n                    Stralos admitted that the letters were probably backdated: (a)Ganesh Krishnan;[note: 3](b)Kalithasan s/o Chelva Rajah;[note: 4]and(c)Jeremy Tan Shih Hwang (“Jeremy\n                                Tan”).[note: 5]23     The backdating was corroborated by the\n                    following witnesses who testified on behalf of the defendant in response to the\n                    subpoenas:(a)Jeffrey Ong Juinn Ann;[note: 6](b)Mohammed Zahid bin Abdul Rashid;[note: 7](c)Sharin bin Shariman;[note: 8](d)Shobna d/o Asok Kumar;[note: 9](e)Juliana binte Jabbar;[note: 10]and(f)Lester Mah Chwee Chuan,[note: 11]testified that\n                            he clearly remembered that the letters of resignation were not signed on\n                            14 June 2007 and that he was told, presumably by Edward, to ask the\n                            FARs to go to Edward’s office to sign them so that they could all\n                            move to Leadenhall earlier.I found these witnesses’ evidence to be reliable insofar as they\n                    show that their letters of resignation were signed after 14 June 2007.\n                    None of them had any reason or motive to concoct this part of their evidence.\n                    Given my finding that a significant proportion of the letters of resignation\n                    were in fact signed after 14 June 2007, it is an entirely permissible\n                    inference that all the letters must have been similarly backdated since all the\n                    FARs left the defendant for substantially the same reason and all of them\n                    eventually ended up working as FARs at Leadenhall at the same\n                time.24     In this regard, it is also relevant to note\n                    the testimony of Eileen Siaw (“Ms Siaw”) from iFast that the\n                    new Leadenhall FA codes for the FARs were only created on 22 and 23 July 2007.\n                    Ms Siaw’s evidence was that iFast did not receive the letters of\n                    resignation of the FARs from Edward prior to the Thailand trip between 6 and 14\n                    July 2007 (see[8]above). This would suggest\n                    that the resignations must have occurredafterthey had returned from the Thailand trip. If the resignations had taken place on\n                    14 June 2007 as shown on the face of the letters of resignation, there would\n                    have been no reason why the letters were not submitted earlier to iFast for the\n                    new Leadenhall FA codes to be generated.25     Furthermore, since the SWM division in\n                    Leadenhall was only formed around 17 July 2007, it is more likely than\n                    not that the resignations by the FARs only took place around the same\n                    time.26     Edward sought to disprove the backdating on\n                    the basis that there were in fact “push” factors which caused the\n                    FARs to resign. These “push” factors include:(a)the defendant’s decision that the FARs were\n                            to absorb the 2% increase of the GST;(b)the defendant’s decision to withhold\n                            payment of on-going fees which were paid by other similar companies;\n                            and(c)the defendant’s failure to provide\n                            direction and training to the FARs.27     The fact that there were these\n                    “push” factors had nothing to do with the issue and therefore did\n                    not rule out the alleged backdating. This is a separate and independent inquiry.\n                    In this connection, I pause to note that a number of the FARs who resigned had\n                    just joined the SWM division barely a few weeks prior to their resignations.\n                    Clearly, these new FARs did not resign due to the alleged “push”\n                    factors. Instead, their resignations were simply a reaction to join the other\n                    FARs. A number of the FARs also testified that they resigned because Edward had\n                    informed them that they could join Leadenhall on better terms.28     Since it is clear that there was backdating,\n                    it must follow that the FARs had failed to comply with the notice requirement\n                    under their respective contracts of employment. The next issue that arises is\n                    the exact date on which the letters of resignation were signed because it would\n                    determine the quantum in relation to the loss of commissions suffered by the\n                    defendant. However, it was not entirely clear from the evidence when the\n                    backdated letters were actually signed. At the trial, the parties were at\n                    complete odds as to who bore the burden to prove the exact date when the\n                    backdating had occurred and, surprisingly, were unable to provide me with any\n                    assistance whether by way of authorities or submissions.29     In my judgment, the present situation falls\n                    squarely within the scope of s 108 of the Evidence Act (Cap 97, 1997 Rev\n                    Ed) (“EA”), which reads as follows:Burden of proving fact especially within\n                            knowledge108. When any fact is\n                        especially within the knowledge of any person, the burden of proving that\n                        fact is upon him.Illustrations(a) When a person does an act with some intention other than that\n                            which the character and circumstances of the act suggest, the burden of\n                            proving that intention is upon him.(b)Ais charged with travelling on a\n                            railway without a ticket. The burden of proving that he had a ticket is\n                            on him.The application of s 108 of the EA was recently\n                    considered inSurender Singh s/o Jagdish Singh and another\n                        (administrators of the estate of Narindar Kaur d/o Sarwan Singh, deceased) v\n                        Li Man Kay and others[2010] 1 SLR 428\n                    (at [217] and [219]):217 Section 108 of the Evidence Act states that when any fact (whether\n                        affirmative or negative) is especially within the knowledge of any person,\n                        the burden of proving that fact is upon him. This is an exception to the\n                        general rule contained in s 103 of the Evidence Act, that the burden is on\n                        the party who asserts a fact. Section 108 of the Evidence Act applies only\n                        to those matters which are supposed to be within the knowledge of a\n                        defendant. It cannot apply when the fact or facts are such that they are\n                        capable of being known also by a person other than the defendant (seeSarkar's Law of Evidence([141]supra) vol 2 at p 1672)....219 In a similar vein, Ratanlal and Dhirajlal,Law of Evidence(at pp 1133-1134) and Woodroffe\n                        & Ali,Law of Evidence([141] supra) (vol\n                        3 at p 4223) notes that s 108 of the Evidence Act is:... designed to meet certain exceptional cases in which it would be\n                            impossible, or at any rate disproportionately difficult, for the\n                            [plaintiff] to establish facts which are 'especially' within the\n                            knowledge of the [defendant] and which [the defendant] could prove\n                            without difficulty or inconvenience. When any fact is within special\n                            knowledge of any person, the burden of proving that fact is upon him.\n                            The word ‘especially’ stresses that. It means facts that are\n                            pre-eminently or exceptionally within his knowledge.and also that the section:... must be considered in a commonsense way; and the balance of\n                            convenience and the disproportion of the labour, that would be involved\n                            in finding out and proving certain facts, balanced against the\n                            triviality of the issue at stake, and the case with which the\n                            [defendant] could prove them, must be taken into consideration.30     As the actual date of the resignation is a\n                    matter within the special knowledge of the FARs and it was practically\n                    impossible for the defendant to prove it, the burden must be on the plaintiffs\n                    to identify the precise date when the backdating occurred. As the plaintiffs\n                    have failed to adduce any reliable evidence as to the exact date when the\n                    backdating occurred (this is hardly surprising since their case is that the\n                    backdating did not occur), I am entitled to draw an adverse inference against\n                    them and presume that the backdating occurred on 14 July 2007, taking\n                    into account the dates when the FARs returned from the Thailand trip, when their\n                    new iFast Codes were created, and when Leadenhall’s new SWM division was\n                    set up. Finally, even without relying on the adverse inference, I find that by\n                    reason of the backdating (irrespective of when the backdating actually\n                    occurred), each of the FARs was in breach of contract in failing to give the\n                    requisite 30-days notice as required by the FA Agreements.31     By reason of their breaches in backdating the\n                    letters of resignation, I find that the defendant is entitled to claim loss of\n                    commission from each of the FARs that it would otherwise have earned during the\n                    30-days notice period. Initially, the defendant pleaded losses arising from both\n                    iFast and Navigator platforms but subsequently amended its counterclaim to\n                    delete all references to Navigator while reserving its rights to bring such a\n                    claim at a later date. As a result, the claim has only been quantified in\n                    respect of loss of commissions for the iFast platform. This was agreed by both\n                    parties to be $23,182.02 per month. This is the commission that the defendant\n                    would have earned from all the FARs in respect of the iFast platform if they had\n                    not backdated their letters of resignation.Forgery32     The defendant alleged that many of the consent\n                    forms signed by the clients to authorise the transfer of their investment\n                    accounts to Leadenhall were forged. The defendant claimed damages arising from\n                    the forgeries: the premise being that but for the forgeries, the investment\n                    accounts would have remained with the defendant and as such the defendant would\n                    have continued to earn the commissions. As mentioned above at[31], the defendant withdrew its claim in respect\n                    of the losses suffered from the Navigator platform. This was because the\n                    defendant encountered difficulties in obtaining the relevant transfer forms from\n                    Navigator in time for forensic analysis to be conducted. As a result, during the\n                    trial, the defendant only sought to prove that the signatures on the iFast\n                    transfer forms were forgeries and that this was engineered by Edward. The\n                    defendant’s case on the forgery was, however, unusual in the following\n                    respects.33     First, the defendant relied exclusively on the\n                    evidence of an expert witness from the Health Sciences Authority\n                    (“HSA”), Mr Yap Bei Sing (“Mr Yap”), since none\n                    of the clients whose signatures were allegedly forged appeared at the trial to\n                    complain about the alleged forgery or the consequent transfer of their\n                    investment accounts to Leadenhall. Although Mr Yap purportedly identified\n                    most of the signatures given to him for analysis as being\n                    “unlikely” to have been signed by the particular client, he had to\n                    qualify his findings because, for each signature he was asked to compare, he was\n                    only given one specimen signature for comparison when, ideally, he would have\n                    preferred five to 10 specimens to take into account the natural variations that\n                    would inevitably arise between an individual’s signatures.34     Additionally, there was no credible evidence\n                    to link Edward to the alleged forgeries in any way, whether he had personally\n                    forged the signatures or instructed others to carry out the forgeries. Further,\n                    there is no reliable evidence that any of the FARs had committed the forgeries\n                    and, if so, which of the alleged forgeries were to be attributed to them. I say\n                    no credible or reliable evidence was adduced because I found the evidence of\n                    Eric Yong Chung Syn[note: 12](“Eric Yong”) who testified for the defendant that he saw two\n                    FARs, Ho Rui Xia Cindy and Chen Anning Clair, forging signatures to be\n                    inherently unreliable. Eric Yong was one of the FARs involved in the mass\n                    resignation. He rejoined the defendant in October 2007 and worked there\n                    until the SWM division was shut down (see[4]above). During Eric Yong’s cross-examination, I found him to be an\n                    extremely unreliable witness on the stand: he adopted a very cavalier attitude\n                    when answering questions posed to him and was remarkably economical with the\n                    truth. Even counsel for the defendant had to concede that this particular\n                    witness, who testified on the defendant’s behalf, was “not\n                    forthright in his evidence”.[note: 13]35     As I found the evidence on the alleged\n                    forgeries to be inconclusive, I make no finding on this matter. This is because,\n                    in any event, it would not have improved the defendant’s case against\n                    Edward or the FARs for reasons that I will elaborate upon in a later part of my\n                    judgment regarding the defendant’s claim for loss of commissions (see[54]below).Wrongful terminationWhether the defendant was entitled to dismiss Edward on the ground of\n                misconduct by making cash-back payments to clients36     Edward’s letter of termination dated 8\n                    August 2007 reads as follows:RE: Notice of TerminationIn our letters dated 12thJuly 2007 addressed\n                        to Mr S. Ravi and you, we have highlighted to you that the MAS has received\n                        feedback from the public that Acclaim Strategic Wealth Management is\n                        involved in cashback arrangements and other activities which are not in\n                        compliance with the Financial Advisers Act.We have recently received an official complaint from an investor that you\n                        have been personally involved in a transaction which involved cashback\n                        arrangement with a client. In this regard, you were involved in an activity\n                        which is not in compliance with the Financial Advisers Act.In view of the serious nature of this complaint, you are hereby notified\n                        that we are terminating both your appointments as Head of Acclaim Strategic\n                        Wealth Management and as a Financial Adviser Manager with immediate\n                        effect.The Company expressly reserves all their rights against you.37     It is clear that the termination was based on\n                    an “official complaint” from an investor that Edward was\n                    personally involved in a cash-back arrangement and that such act was in breach\n                    of the FAA. Further, the defendant also claimed that such cash-back arrangement\n                    constituted a breach of clause 14.2 of the FAM Agreement which provides as\n                    follows:14.2Provided always that the Company shall have the\n                            absolute discretion to terminate this Agreement forthwith in writing and\n                            without adhering to the thirty (30) days notice requirement in the event\n                            the FA Manager:-...(c)by any act or omission including any breach of\n                                law, brings discredit to the reputation and integrity of the\n                                Company, or is guilty of any conduct or other serious offence, which\n                                is prejudicial to the reputation, standing or interest of the\n                                Company;(d)is in breach of any circular, instruction,\n                                ruling or directive issued by the Company, the Monetary Authority of\n                                Singapore or other relevant authority.38     The complaint was made by Ms Yeo. The salient\n                    parts of the complaint state,inter alia, as\n                    follows:Complaint lodged against Financial Adviser Manager\n                            – Edward WongI, Yeo Mui Khee, NRI S7420693Z, is (sic)\n                        making the following statement which is true and to the best of my\n                        knowledge....5)My initial investment was S$50,000.00 which was in\n                            either end Nov or beginning Dec 2006....7)On my initial investment of S$50,000.00, Kevin gave\n                            me back S$500 in cash being 1% of the invested amount.8)I did an add-on of S$30,000.00 which I later again\n                            got back S$300 in cash from Kevin.9)I did my first switch and a\n                                2ndadd-on of S$20,000.00 sometime in end\n                            Dec 2006 and asked for an advancement, but Jeremy Tan mentioned that he\n                            needs to seeks (sic) clearance from Edward\n                            Wong before he can release it. Couple of hours later, Jeremy said that\n                            Edward Wong is agreeable to only giving me S$800 in cash first which was\n                            for my current invested amount. The balance S$200 for my add-on, he will\n                            give it to Kevin later when the funds are being transferred\n                        out.10)Sometimes (sic) in\n                            Feb 2007, Kevin Yeo had an accident and I went to Edward Wong’s\n                            office in Ubi to iron out all the accounts payable due to him. Edward\n                            Wong said that he had paid in full whatever that is due to Kevin Yeo and\n                            there are no outstanding payments to him.11)In the same meeting, Edward Wong mentioned that,\n                            if I do further switch and recommend friends to him for investments, he\n                            will gave (sic) me the entire 2% of the\n                            invested amount as commission....13)Sometime, in April/May 2007, I contacted Jeremy\n                            Tan to initiate a fund switch. For this switch that I did, I received\n                            S$2,000.00 immediately upon signing the switch form as promised by\n                            Edward Wong during my meeting with him in Feb 2007. I met up with Jeremy\n                            Tan at Great World City and he passed the money to me.39     When the trial commenced, it was not clear\n                    whether Ms Yeo would testify as the defendant had not been able to serve the\n                    subpoena on her. At that stage, the only evidence on the alleged cash-back\n                    arrangement was an unsigned statement by Ms Yeo as well as the testimony of\n                    Anthony Lim and Jennifer Chiow Lay Hoon,[note: 14]the Compliance Manager of the defendant\n                    who interviewed Ms Yeo on the complaint.40     Prior to the oral testimony of Ms Yeo, I\n                    entertained some doubts as to the veracity of the complaint especially since\n                    there was no evidence that the defendant had sought any explanation from Edward\n                    after the complaint was lodged. Instead, the defendant’s only attempt to\n                    verify Ms Yeo’s complaint was limited to checking that the investment\n                    amounts mentioned in the complaint (see[38]above) were accurate and corresponded with its records, which, in my view, may\n                    not have necessarily led to the conclusion that Edward was actually involved in\n                    giving cash-backs. However, after hearing Ms Yeo’s evidence on the witness\n                    stand and taking into account the corroborative evidence of another FAR namely\n                    Jeremy Tan (who was called as a witness by Edward), I am satisfied that, despite\n                    the plaintiffs’ unconvincing attempt to attach significance to the fact\n                    that the complaint was unsigned, there is sufficient evidence before me to prove\n                    that Edward did engage in paying cash-backs to Ms Yeo.41     Ms Yeo testified that she had met Edward to\n                    claim outstanding commissions which were due to her brother. At that same\n                    meeting, Edward informed her that if she did a switch on her investment as well\n                    as add a further investment of $20,000, she would receive cash-back payments of\n                    $800 and $2,000. Her evidence corresponded with Jeremy Tan’s testimony\n                    that Edward did hand him two sums of $800 and $2,000 to pass to Ms Yeo, which he\n                    duly did as instructed. Jeremy Tan told the court that he was not informed of\n                    the reasons for the two payments. Although Edward’s case was that he did\n                    not hand over any money to Jeremy Tan for onward transmission to Ms Yeo, this\n                    part of Jeremy Tan’s evidence went notably unchallenged. Having had the\n                    opportunity to assess both Ms Yeo and Jeremy Tan on the witness stand, I found\n                    them to be truthful and credible witnesses and there has been no suggestion that\n                    any of them had a reason or motive to fabricate the evidence in order to\n                    implicate Edward.42     Further, although Edward was dismissed on the\n                    ground that he was involved in paying cash-back, there was no correspondence\n                    from him to the defendant denying the allegation. In cross-examination, he\n                    explained that his inaction was because, in his view, the complaint was\n                    “trumped up” and false. I found his explanation to be quite\n                    unbelievable given the circumstances. If he genuinely believed that the\n                    complaint was false, one would have expected him to take immediate steps to\n                    challenge the legitimacy of the complaint particularly since (by his own\n                    evidence) he would not be able to find alternative employment as a financial\n                    adviser with this “albatross” around\n                    his neck. Tellingly, Edward only decided to challenge the complaint some two\n                    years later by bringing the action in Suit 106 for wrongful\n                dismissal.43     Based on the corroborative evidence of the two\n                    witnesses. Ms Yeo and Jeremy Tan, together with the undisputed subsequent\n                    conduct of Edward, I find that Edward did make the two cash-back payments of\n                    $800 and $2,000 to Ms Yeo.Whether the defendant was entitled to dismiss Edward on the ground of\n                breach of duty of good faith and fidelity44     Even if my finding above that the defendant\n                    was entitled to terminate Edward from his position based on his involvement in\n                    making cash-back payments is wrong, I am of the opinion that the defendant was\n                    entitled to terminate Edward for breach of his duty of good faith and fidelity\n                    owed to the defendant, even though this ground was not raised in the letter of\n                    termination (see[36]above). I reiterate\n                    the position in law that I recently held inAldabe Fermin v\n                        Standard Chartered Bank[2010] 3 SLR 722\n                        (“Aldabe Fermin”) at [45],\n                    which is that at common law, a party is entitled to justify the termination of a\n                    contract on grounds other than the one furnished when the contract was\n                    terminated. There are exceptions to this rule, as I pointed out inAldabe Ferminat [48] (citingAmixco\n                        Asia (Pte) Ltd v Bank Bumiputra Malaysia Bhd[1992]\n                    2 SLR(R) 65): the general rule does not apply (a) first, if the party\n                    in breach could have put right the situation if given the opportunity to do so;\n                    or (b) second, if the innocent party by its conduct has waived its right to\n                    raise or is estopped from raising other grounds; or (c) third, if the innocent\n                    party is precluded by statute from raising new grounds. As Edward’s case\n                    was that all the grounds raised by the defendant for dismissing him were utter\n                    fabrications, unsurprisingly, no argument was raised by him on this particular\n                    point.45     The defendant’s case was that Edward, by\n                    engineering theen masseresignation of the FARs\n                    was in breach of his contractual and/or fiduciary duties. Although a substantial\n                    portion of parties’ submissions was addressed towards the question whether\n                    Edward was a fiduciary in relation to the defendant, I found it unnecessary and\n                    unhelpful to restrict the question so narrowly. The law is clear that a term\n                    will be implied into all employment relationships such that an employee owes his\n                    or her employer a duty of good faith and fidelity: seeRickshaw Investments Ltd and another v Nicolai Baron von Uexkull[2007] 1 SLR(R) 377 at [83] andMan Financial (S)\n                        Pte Ltd v Wong Bark Chuan David[2008] 1 SLR(R) 663 at\n                    [193]). Some examples of how this duty of good faith and fidelity translates\n                    into practice were given in the High Court decision ofAsiawerks Global Investment Group Pte Ltd v Ismail bin Syed Ahmad and\n                        another[2004] 1 SLR(R) 234 at [61]:There can be no denying that all employees are expected to serve their\n                        employers diligently, honestly and loyally. What this duty translates into\n                        factually depends on the circumstances such as the nature of the work.Employees should not be engaged in other business or\n                            employment during their working hours without the approval of their\n                            employers.They should certainly not be\n                            diverting business opportunities that they got wind of only because of\n                            their employment status and during the subsistence of the employment,\n                            whether or not such information amounted to confidential information\n                            within the meaning of the law.[emphasis added]In my view, such a duty applied to the present case without the need\n                    to delve into the question whether Edward was a fiduciary. Ultimately, what is\n                    required in the final analysis is the precise examination of the facts and\n                    circumstances such as the nature of the employment to determine the exact scope\n                    of the duty being owed. In any event, I am also prepared to find that Edward\n                    held a fiduciary position in relation to the defendant based on the nature of\n                    his duties as FAM and head of the SWM division. Under\n                        cross-examination,[note: 15]he expressly admitted that, as FAM,\n                    he received and held monies on behalf of the defendant as a trustee and that,\n                    under the FAM Agreement, he owed specific duties of honesty, integrity and\n                    loyalty to the defendant,egto recommend\n                    “introducers” only for the defendant; and not to represent or be\n                    connected with any other licensed or exempt Financial Adviser\n                Company.46     Therefore, by virtue of the duties of good\n                    faith and loyalty owed by Edward to the defendant, whether as a fiduciary or as\n                    a mere employee, I find that although Edward was certainly free to leave the\n                    defendant to join Leadenhall on his own accord after serving the appropriate\n                    notice period, he wasnotentitled to have\n                    instigated the mass exodus of the FARs to Leadenhall or to have instructed the\n                    FARs to transfer their clients to Leadenhallwhile he was\n                        still employed by the defendant. Although I have refrained from\n                    making a finding that the iFast transfer forms were actually forged (see[35]above), I am nonetheless satisfied\n                    that Edward had indeed instructed the FARs to transfer their clients over to\n                    Leadenhall for the simple reason that there would have been no reason for him to\n                    entice them to join Leadenhall if they were not bringing their clients along.\n                    Furthermore, it was clear from the evidence of Mr Ling Herng Wee Henry, director\n                    and shareholder of Leadenhall, that Edward was also actively involved together\n                    with his father, Allan Wong Mun Toong (“Allan Wong”) in the\n                    setting up of the SWM division of Leadenhall while he was still under the employ\n                    of the defendant.47     During oral closing submissions, counsel for\n                    the plaintiffs argued that Edward did not breach any duties of good faith owed\n                    to the defendant because there was an implied understanding between Edward and\n                    the defendant that Edward and the FARs were allowed to leave as a team and take\n                    their clients with them. In my view, such an implied understanding, even if\n                    founded, certainly did not extend to absolve Edward’s actions in the\n                    present case. The entire backdating exercise was clandestinely conducted under\n                    the cover of secrecy, and Edward had withheld the FARs’ resignation\n                    letters from the defendant until he had ensured that all the FARs had left to\n                    join Leadenhall. All this was, to me, a plain indication that they were well\n                    aware that what they were doing was illegitimate or, at the very least,\n                    improper. How this can be consistent with a duty of good faith, as argued by the\n                    plaintiffs’ counsel, was plainly beyond me.If the dismissal was wrongful, whether the damages would be limited\n                to the normal notice period48     Counsel for Edward also argued that, in the\n                    event that this court finds Edward’s dismissal to be wrongful, Edward\n                    would be entitled, on the authority ofMalik and Mahmud v\n                        Bank of Credit and Commerce International SA (In Compulsory\n                        Liquidation)[1998] 1 AC 20 (“Malik v BCCI”), to claim for damages arising from the\n                    handicap he suffered in the labour market as a result of his wrongful dismissal.\n                    It was claimed that after the defendant had dismissed Edward for making\n                    cash-back payments, he was no longer able to secure a position as a FAM and thus\n                    ended up as a training consultant at Leadenhall earning $3,000 per month since\n                    15 September 2007. As I have already made a positive finding that\n                    Edward was indeed involved in cash-back payments, I need not, strictly, consider\n                    this issue. However, as this point was argued before me by counsel for Edward at\n                    some length, I would make a few observations onMalik v\n                        BCCI.49     The proposition for whichMalik v BCCIstood for was succinctly stated by G P\n                    Selvam J inArul Chandran v Gartshore and\n                        others[2000] 1 SLR(R) 436 (“Arul Chandran”) (at [20]) as follows:This case made it possible to recover financial loss, that is special\n                        damages, where breach of a contract damages one's reputation which in turn\n                        causes foreseeable financial loss to the claimant. The claim is subject to\n                        the established limiting principles of remoteness causation and\n                        mitigation.G P Selvam J then went on to state the facts and the procedural\n                    history ofMalik v BCCIthat culminated in the\n                    House of Lords’ decision (Arul Chandranat [21] and [22]):21    TheMalikcase arose\n                            out of a contract of employment and the disastrous collapse of the\n                            infamous bank - Bank of Credit and Commerce International SA (BCCI)\n                            (\"the bank\"). Malik was the head of deposit accounts and customer\n                            services at a branch office of the bank. When the bank was ordered to be\n                            wound up he was dismissed by the provisional liquidators on the ground\n                            of redundancy. He brought an action asserting that he had lost more than\n                            his job. He said that by reason of the corrupt and/or dishonest manner\n                            in which the bank operated and the consequential collapse of the bank he\n                            was at a handicap on the labour market because he was stigmatised by\n                            reason of his employment by the bank. He claimed 50,000 based on some\n                            “table of service”. His claim was based on an implied term\n                            in his contract of employment that “the employer will not,\n                            without reasonable and proper cause, conduct itself in a manner\n                            calculated or likely to destroy or seriously damage the relationship of\n                            confidence and trust between employer and employee”. The\n                            liquidators rejected the claim.22 On appeal, Evans-Lombe J refused to imply the term contended for. The\n                        judge foundAddis v Gramophone Co Ltd([12]supra) the principal stumbling block. On\n                        appeal the Court of Appeal was prepared to imply a term to the effect that\n                        the bank was under a duty not, without reasonable and proper cause, to\n                        conduct itself in a manner calculated or likely to destroy or seriously\n                        damage the relationship of confidence and trust between employer and\n                        employee. Nevertheless, “stigma damage” as a head of\n                        compensation was not recoverable in law. Once againAddis\n                            v Gramophone Co Ltdprovided the justification for the\n                        decision. Malik appealed to the House of Lords. His appeal was allowed. The\n                        House of Lords ruled that the bank had broken its implied obligation of\n                        trust and confidence.Accordingly Malik was entitled to\n                            damages for the financial loss suffered by him upon proof and to the\n                            extent that his future employment prospects were prejudiced by the\n                            stigma of his employment with the egregious employer.[emphasis added]50     In the words of Lord Nicholls of Birkenhead,\n                    who delivered one of the two written judgments of the House of Lords inMalik v BCCI(at 37?38), such a claim was\n                    founded on the term of trust and confidence that is implied into every\n                    employment contract:Employers may be under no common law obligation, through the medium of an\n                        implied contractual term of general application, to take steps to improve\n                        their employees' future job prospects. But failure to improve is one thing,\n                        positively to damage is another. Employment, and job prospects, are matters\n                        of vital concern to most people. Jobs of all descriptions are less secure\n                        than formerly, people change jobs more frequently, and the job market is not\n                        always buoyant. Everyone knows this. An employment contract creates a close\n                        personal relationship, where there is often a disparity of power between the\n                        parties. Frequently the employee is vulnerable. Although the underlying\n                        purpose of the trust and confidence term is to protect the employment\n                        relationship,there can be nothing unfairly onerous or\n                            unreasonable in requiring an employer who breaches the trust and\n                            confidence term to be liable if he thereby causes continuing financial\n                            loss of a nature that was reasonably foreseeable. Employers\n                        must take care not to damage their employees' future employment prospects,\n                        by harsh and oppressive behaviour or by any other form of conduct which is\n                        unacceptable today as falling below the standards set by the implied trust\n                        and confidence term.[emphasis added]It was also made clear that any such claim would be for proven\n                    financial loss, and not for injury to reputation, which is separately protected\n                    by the law of defamation (at 40–41):Sometimes, in practice, the distinction between damage to reputation and\n                        financial loss can become blurred. Damage to the reputation of professional\n                        persons, or persons carrying on a business, frequently causes financial\n                        loss. None the less, the distinction is fundamentally sound, and when\n                        awarding damages for breach of contract courts take care to confine the\n                        damages to their proper ambit: making good financial loss.51     It is thus apparent fromMalik v BCCIthat a claimant will be entitled to damages from a\n                    former employer if he or she can prove that the former employer was in breach of\n                    the implied term of trust and confidence and which resulted in loss of future\n                    employment prospects. Lord Nicholls cautioned however that it may not always be\n                    easy to prove such a claim (at 42):[O]ne of the assumed facts in the present case is that the employer was\n                        conducting a dishonest and corrupt business. I would like to think this will\n                        rarely happen in practice. Thirdly, there are many circumstances in which an\n                        employee's reputation may suffer from his having been associated with an\n                        unsuccessful business, or an unsuccessful department within a business. In\n                        the ordinary way this will not found a claim of the nature made in the\n                        present case, even if the business or department was run with gross\n                        incompetence. A key feature in the present case is the assumed fact that the\n                        business was dishonest or corrupt. Finally, although the implied term that\n                        the business will not be conducted dishonestly is a term which avails all\n                        employees, proof of consequential handicap in the labour market may well be\n                        much more difficult for some classes of employees than others. An employer\n                        seeking to employ a messenger, for instance, might be wholly unconcerned by\n                        an applicant's former employment in a dishonest business, whereas he might\n                        take a different view if he were seeking a senior executive.52     Therefore, on the authority ofMalik v BCCI, I accept the submission by Edward’s\n                    counsel that, in principle, if it can be shown that the defendant had wrongfully\n                    dismissed Edward in a manner that was dishonest or illegitimate which amounted\n                    to a breach of the implied term of trust and confidence, and as a direct result\n                    of that wrongful dismissal it can be proven that Edward suffered a real and\n                    provable financial loss, in my view, Edward would be entitled to claim against\n                    the defendant for such loss beyond the contractual notice period. However, as I\n                    have already made clear that the defendant was entitled to terminate Edward from\n                    his position on not one but two separate grounds, I find that there is no merit\n                    to his claim which I dismiss accordingly.53     I would add that even if I had found that the\n                    defendant had wrongfully dismissed Edward, I find that his claim that he had\n                    suffered a loss of employment prospects to be altogether contrived. The only\n                    evidence produced by Edward to show that he had difficulties obtaining a job as\n                    a FAM after his dismissal was a rejection letter from Leadenhall which was\n                    signed by his own father, Allan Wong, who was then working for Leadenhall and\n                    had interviewed Edward in his application to join Leadenhall. In that letter,\n                    Allan Wong had stated that because Edward “was terminated by Acclaim on\n                    8.8.07 due to alleged cashback”, Leadenhall would not be accepting his\n                    “application unless the issue is resolved”. However, given the\n                    involvement of Edward and Allan Wong in the setting up of the SWM division of\n                    Leadenhall  (see[46]above) and Allan\n                    Wong’s key role in facilitating the exodus as the interviewer and\n                    recruiter for all the FARs who joined Leadenhall, I found the letter to be\n                    highly suspect and ascribed no weight whatsoever to it.Loss of commissions54     Having found that the defendant was entitled\n                    to the sum of $23,182.02 for the FARs’ failure to give the required 30\n                    days’ notice before resigning (see[31]above), the only issue remaining is whether the defendant\n                    could succeed in its claim for a further 17 months of commissions (see[11]above) arising from the mass resignation and\n                    the subsequent transfer of clients to Leadenhall.55     In my judgment, this particular claim must\n                    fail for the simple reason that the defendant has failed to prove that the mass\n                    resignation and the subsequent transfer of clients to Leadenhall would not have\n                    occurred but for the alleged forgeries or Edward’s breach of his duties to\n                    the defendant. First, it was undisputed that if Edward and the FARs had validly\n                    served the defendant 30 days’ notice before resigning, they were\n                    perfectly entitled to leave the defendant to join Leadenhall upon the expiry of\n                    that notice period. Second, it was the defendant’s own case that all the\n                    SWM division’s clients were effectively driven by “runners”\n                    (see[2]above) who were working in\n                    collaboration with Edward. Although counsel for the defendant attempted to argue\n                    that the FARs and the clients would not have left the defendant but for\n                    Edward’s directions, the evidence before me pointed to the conclusion that\n                    upon Edward leaving the defendant, it was inevitable that the FARs would have\n                    joined him and the clients would have been instructed by the\n                    “runners” to transfer their investment accounts to Leadenhall and\n                    therefore would have left the defendant in any event. There is simply no\n                    evidence to show that the clients would have remained with the defendant after\n                    the departure of Edward and the FARs. Indeed, none of the clients have appeared\n                    in court to complain about the transfers or the alleged forgeries. Therefore, in\n                    the present circumstances, at best, all that the defendant can show is that the\n                    forgeries, if proven, or Edward’s breach of his duties simply facilitated\n                    the transfers which would inevitably have taken place at a later\n                date.56     Although the defendant may feel aggrieved at\n                    the way the resignations were carried out by Edward and the FARs, it has to be\n                    noted that the defendant had no SWM division to speak of before Edward came\n                    onboard. The SWM division was, in fact, from the outset, set up and managed\n                    entirely by Edward. With the exception of Jeremy Tan, all the FARs in the\n                    defendant’s SWM division were personally recruited by Edward. There was\n                    also no suggestion that the clients who transferred over to Leadenhall were\n                    pre-existing clients who had been procured by the defendant before the SWM\n                    division was formed by Edward. If anything, the defendant benefited greatly from\n                    the commissions that Edward and his FARs brought in during the period when\n                    Edward was head of its SWM division. In my view, the defendant was entitled to\n                    no more than the sum that I have already awarded in respect of the breaches of\n                    contract by the FARs in failing to provide the required 30 days’ notice\n                    before resigning.Conclusion57     Accordingly, my orders are as follows:(a)     The defendant to pay the judgement\n                        debt in the sum of $59,892.13 granted to the first plaintiff in Suit 781 by\n                        way of summary judgment dated 4 June 2008 forthwith without any deduction or\n                        set-off.(b)     Judgment in favour of second plaintiff in Suit 781 in the sum of\n                        $231,946.10.(c)     The defendant’s counterclaim in Suit 781 succeeds only to the extent\n                        of $$23,182.02 which is to be set-off against the judgment sum due to the\n                        second plaintiff.(d)     The plaintiff’s claim in Suit 106 is hereby\n                    dismissed.(e)     Interest\n                        at 5.33% per annum on $59,892.13 and $208,763.99 ($231,946.10 - $23,182.02)\n                        in favour of the first and second plaintiff respectively from the date of\n                        the writ to the date of judgment.(f)     As for costs, the plaintiff substantially succeeded in\n                        Suit 781 but failed in his action in Suit 106. The defendant only succeeded\n                        in a small fraction of its counterclaim which was essentially the defence in\n                        Suit 106. In the light of my findings, I order that each party should bear\n                        its own costs for both proceedings.[note: 1]DW-1[note: 2]Except one who\n                                was already a FAR of the defendant when he joined the SWM\n                                division.[note: 3]PW-12[note: 4]PW-14[note: 5]PW-15[note: 6]DW-5[note: 7]DW-8[note: 8]DW-9[note: 9]DW-10[note: 10]DW-16[note: 11]DW-13[note: 12]DW-12[note: 13]Defendant’s Written Closing Submissions at\n                            [218][note: 14]DW-2[note: 15]Notes of Evidence Day 1 pg\n                                65-69",
        "Forgery": "32     The defendant alleged that many of the consent\n                    forms signed by the clients to authorise the transfer of their investment\n                    accounts to Leadenhall were forged. The defendant claimed damages arising from\n                    the forgeries: the premise being that but for the forgeries, the investment\n                    accounts would have remained with the defendant and as such the defendant would\n                    have continued to earn the commissions. As mentioned above at[31], the defendant withdrew its claim in respect\n                    of the losses suffered from the Navigator platform. This was because the\n                    defendant encountered difficulties in obtaining the relevant transfer forms from\n                    Navigator in time for forensic analysis to be conducted. As a result, during the\n                    trial, the defendant only sought to prove that the signatures on the iFast\n                    transfer forms were forgeries and that this was engineered by Edward. The\n                    defendant’s case on the forgery was, however, unusual in the following\n                    respects. 33     First, the defendant relied exclusively on the\n                    evidence of an expert witness from the Health Sciences Authority\n                    (“HSA”), Mr Yap Bei Sing (“Mr Yap”), since none\n                    of the clients whose signatures were allegedly forged appeared at the trial to\n                    complain about the alleged forgery or the consequent transfer of their\n                    investment accounts to Leadenhall. Although Mr Yap purportedly identified\n                    most of the signatures given to him for analysis as being\n                    “unlikely” to have been signed by the particular client, he had to\n                    qualify his findings because, for each signature he was asked to compare, he was\n                    only given one specimen signature for comparison when, ideally, he would have\n                    preferred five to 10 specimens to take into account the natural variations that\n                    would inevitably arise between an individual’s signatures. 34     Additionally, there was no credible evidence\n                    to link Edward to the alleged forgeries in any way, whether he had personally\n                    forged the signatures or instructed others to carry out the forgeries. Further,\n                    there is no reliable evidence that any of the FARs had committed the forgeries\n                    and, if so, which of the alleged forgeries were to be attributed to them. I say\n                    no credible or reliable evidence was adduced because I found the evidence of\n                    Eric Yong Chung Syn[note: 12](“Eric Yong”) who testified for the defendant that he saw two\n                    FARs, Ho Rui Xia Cindy and Chen Anning Clair, forging signatures to be\n                    inherently unreliable. Eric Yong was one of the FARs involved in the mass\n                    resignation. He rejoined the defendant in October 2007 and worked there\n                    until the SWM division was shut down (see[4]above). During Eric Yong’s cross-examination, I found him to be an\n                    extremely unreliable witness on the stand: he adopted a very cavalier attitude\n                    when answering questions posed to him and was remarkably economical with the\n                    truth. Even counsel for the defendant had to concede that this particular\n                    witness, who testified on the defendant’s behalf, was “not\n                    forthright in his evidence”.[note: 13] 35     As I found the evidence on the alleged\n                    forgeries to be inconclusive, I make no finding on this matter. This is because,\n                    in any event, it would not have improved the defendant’s case against\n                    Edward or the FARs for reasons that I will elaborate upon in a later part of my\n                    judgment regarding the defendant’s claim for loss of commissions (see[54]below).",
        "Wrongful termination": "",
        "Whether the defendant was entitled to dismiss Edward on the ground of\n                misconduct by making cash-back payments to clients": "36     Edward’s letter of termination dated 8\n                    August 2007 reads as follows: RE: Notice of Termination In our letters dated 12thJuly 2007 addressed\n                        to Mr S. Ravi and you, we have highlighted to you that the MAS has received\n                        feedback from the public that Acclaim Strategic Wealth Management is\n                        involved in cashback arrangements and other activities which are not in\n                        compliance with the Financial Advisers Act. We have recently received an official complaint from an investor that you\n                        have been personally involved in a transaction which involved cashback\n                        arrangement with a client. In this regard, you were involved in an activity\n                        which is not in compliance with the Financial Advisers Act. In view of the serious nature of this complaint, you are hereby notified\n                        that we are terminating both your appointments as Head of Acclaim Strategic\n                        Wealth Management and as a Financial Adviser Manager with immediate\n                        effect. The Company expressly reserves all their rights against you. 37     It is clear that the termination was based on\n                    an “official complaint” from an investor that Edward was\n                    personally involved in a cash-back arrangement and that such act was in breach\n                    of the FAA. Further, the defendant also claimed that such cash-back arrangement\n                    constituted a breach of clause 14.2 of the FAM Agreement which provides as\n                    follows: 14.2Provided always that the Company shall have the\n                            absolute discretion to terminate this Agreement forthwith in writing and\n                            without adhering to the thirty (30) days notice requirement in the event\n                            the FA Manager:- ... (c)by any act or omission including any breach of\n                                law, brings discredit to the reputation and integrity of the\n                                Company, or is guilty of any conduct or other serious offence, which\n                                is prejudicial to the reputation, standing or interest of the\n                                Company; (d)is in breach of any circular, instruction,\n                                ruling or directive issued by the Company, the Monetary Authority of\n                                Singapore or other relevant authority. 38     The complaint was made by Ms Yeo. The salient\n                    parts of the complaint state,inter alia, as\n                    follows: Complaint lodged against Financial Adviser Manager\n                            – Edward Wong I, Yeo Mui Khee, NRI S7420693Z, is (sic)\n                        making the following statement which is true and to the best of my\n                        knowledge. ... 5)My initial investment was S$50,000.00 which was in\n                            either end Nov or beginning Dec 2006. ... 7)On my initial investment of S$50,000.00, Kevin gave\n                            me back S$500 in cash being 1% of the invested amount. 8)I did an add-on of S$30,000.00 which I later again\n                            got back S$300 in cash from Kevin. 9)I did my first switch and a\n                                2ndadd-on of S$20,000.00 sometime in end\n                            Dec 2006 and asked for an advancement, but Jeremy Tan mentioned that he\n                            needs to seeks (sic) clearance from Edward\n                            Wong before he can release it. Couple of hours later, Jeremy said that\n                            Edward Wong is agreeable to only giving me S$800 in cash first which was\n                            for my current invested amount. The balance S$200 for my add-on, he will\n                            give it to Kevin later when the funds are being transferred\n                        out. 10)Sometimes (sic) in\n                            Feb 2007, Kevin Yeo had an accident and I went to Edward Wong’s\n                            office in Ubi to iron out all the accounts payable due to him. Edward\n                            Wong said that he had paid in full whatever that is due to Kevin Yeo and\n                            there are no outstanding payments to him. 11)In the same meeting, Edward Wong mentioned that,\n                            if I do further switch and recommend friends to him for investments, he\n                            will gave (sic) me the entire 2% of the\n                            invested amount as commission. ... 13)Sometime, in April/May 2007, I contacted Jeremy\n                            Tan to initiate a fund switch. For this switch that I did, I received\n                            S$2,000.00 immediately upon signing the switch form as promised by\n                            Edward Wong during my meeting with him in Feb 2007. I met up with Jeremy\n                            Tan at Great World City and he passed the money to me. 39     When the trial commenced, it was not clear\n                    whether Ms Yeo would testify as the defendant had not been able to serve the\n                    subpoena on her. At that stage, the only evidence on the alleged cash-back\n                    arrangement was an unsigned statement by Ms Yeo as well as the testimony of\n                    Anthony Lim and Jennifer Chiow Lay Hoon,[note: 14]the Compliance Manager of the defendant\n                    who interviewed Ms Yeo on the complaint. 40     Prior to the oral testimony of Ms Yeo, I\n                    entertained some doubts as to the veracity of the complaint especially since\n                    there was no evidence that the defendant had sought any explanation from Edward\n                    after the complaint was lodged. Instead, the defendant’s only attempt to\n                    verify Ms Yeo’s complaint was limited to checking that the investment\n                    amounts mentioned in the complaint (see[38]above) were accurate and corresponded with its records, which, in my view, may\n                    not have necessarily led to the conclusion that Edward was actually involved in\n                    giving cash-backs. However, after hearing Ms Yeo’s evidence on the witness\n                    stand and taking into account the corroborative evidence of another FAR namely\n                    Jeremy Tan (who was called as a witness by Edward), I am satisfied that, despite\n                    the plaintiffs’ unconvincing attempt to attach significance to the fact\n                    that the complaint was unsigned, there is sufficient evidence before me to prove\n                    that Edward did engage in paying cash-backs to Ms Yeo. 41     Ms Yeo testified that she had met Edward to\n                    claim outstanding commissions which were due to her brother. At that same\n                    meeting, Edward informed her that if she did a switch on her investment as well\n                    as add a further investment of $20,000, she would receive cash-back payments of\n                    $800 and $2,000. Her evidence corresponded with Jeremy Tan’s testimony\n                    that Edward did hand him two sums of $800 and $2,000 to pass to Ms Yeo, which he\n                    duly did as instructed. Jeremy Tan told the court that he was not informed of\n                    the reasons for the two payments. Although Edward’s case was that he did\n                    not hand over any money to Jeremy Tan for onward transmission to Ms Yeo, this\n                    part of Jeremy Tan’s evidence went notably unchallenged. Having had the\n                    opportunity to assess both Ms Yeo and Jeremy Tan on the witness stand, I found\n                    them to be truthful and credible witnesses and there has been no suggestion that\n                    any of them had a reason or motive to fabricate the evidence in order to\n                    implicate Edward. 42     Further, although Edward was dismissed on the\n                    ground that he was involved in paying cash-back, there was no correspondence\n                    from him to the defendant denying the allegation. In cross-examination, he\n                    explained that his inaction was because, in his view, the complaint was\n                    “trumped up” and false. I found his explanation to be quite\n                    unbelievable given the circumstances. If he genuinely believed that the\n                    complaint was false, one would have expected him to take immediate steps to\n                    challenge the legitimacy of the complaint particularly since (by his own\n                    evidence) he would not be able to find alternative employment as a financial\n                    adviser with this “albatross” around\n                    his neck. Tellingly, Edward only decided to challenge the complaint some two\n                    years later by bringing the action in Suit 106 for wrongful\n                dismissal. 43     Based on the corroborative evidence of the two\n                    witnesses. Ms Yeo and Jeremy Tan, together with the undisputed subsequent\n                    conduct of Edward, I find that Edward did make the two cash-back payments of\n                    $800 and $2,000 to Ms Yeo.",
        "Whether the defendant was entitled to dismiss Edward on the ground of\n                breach of duty of good faith and fidelity": "44     Even if my finding above that the defendant\n                    was entitled to terminate Edward from his position based on his involvement in\n                    making cash-back payments is wrong, I am of the opinion that the defendant was\n                    entitled to terminate Edward for breach of his duty of good faith and fidelity\n                    owed to the defendant, even though this ground was not raised in the letter of\n                    termination (see[36]above). I reiterate\n                    the position in law that I recently held inAldabe Fermin v\n                        Standard Chartered Bank[2010] 3 SLR 722\n                        (“Aldabe Fermin”) at [45],\n                    which is that at common law, a party is entitled to justify the termination of a\n                    contract on grounds other than the one furnished when the contract was\n                    terminated. There are exceptions to this rule, as I pointed out inAldabe Ferminat [48] (citingAmixco\n                        Asia (Pte) Ltd v Bank Bumiputra Malaysia Bhd[1992]\n                    2 SLR(R) 65): the general rule does not apply (a) first, if the party\n                    in breach could have put right the situation if given the opportunity to do so;\n                    or (b) second, if the innocent party by its conduct has waived its right to\n                    raise or is estopped from raising other grounds; or (c) third, if the innocent\n                    party is precluded by statute from raising new grounds. As Edward’s case\n                    was that all the grounds raised by the defendant for dismissing him were utter\n                    fabrications, unsurprisingly, no argument was raised by him on this particular\n                    point. 45     The defendant’s case was that Edward, by\n                    engineering theen masseresignation of the FARs\n                    was in breach of his contractual and/or fiduciary duties. Although a substantial\n                    portion of parties’ submissions was addressed towards the question whether\n                    Edward was a fiduciary in relation to the defendant, I found it unnecessary and\n                    unhelpful to restrict the question so narrowly. The law is clear that a term\n                    will be implied into all employment relationships such that an employee owes his\n                    or her employer a duty of good faith and fidelity: seeRickshaw Investments Ltd and another v Nicolai Baron von Uexkull[2007] 1 SLR(R) 377 at [83] andMan Financial (S)\n                        Pte Ltd v Wong Bark Chuan David[2008] 1 SLR(R) 663 at\n                    [193]). Some examples of how this duty of good faith and fidelity translates\n                    into practice were given in the High Court decision ofAsiawerks Global Investment Group Pte Ltd v Ismail bin Syed Ahmad and\n                        another[2004] 1 SLR(R) 234 at [61]: There can be no denying that all employees are expected to serve their\n                        employers diligently, honestly and loyally. What this duty translates into\n                        factually depends on the circumstances such as the nature of the work.Employees should not be engaged in other business or\n                            employment during their working hours without the approval of their\n                            employers.They should certainly not be\n                            diverting business opportunities that they got wind of only because of\n                            their employment status and during the subsistence of the employment,\n                            whether or not such information amounted to confidential information\n                            within the meaning of the law. [emphasis added] In my view, such a duty applied to the present case without the need\n                    to delve into the question whether Edward was a fiduciary. Ultimately, what is\n                    required in the final analysis is the precise examination of the facts and\n                    circumstances such as the nature of the employment to determine the exact scope\n                    of the duty being owed. In any event, I am also prepared to find that Edward\n                    held a fiduciary position in relation to the defendant based on the nature of\n                    his duties as FAM and head of the SWM division. Under\n                        cross-examination,[note: 15]he expressly admitted that, as FAM,\n                    he received and held monies on behalf of the defendant as a trustee and that,\n                    under the FAM Agreement, he owed specific duties of honesty, integrity and\n                    loyalty to the defendant,egto recommend\n                    “introducers” only for the defendant; and not to represent or be\n                    connected with any other licensed or exempt Financial Adviser\n                Company. 46     Therefore, by virtue of the duties of good\n                    faith and loyalty owed by Edward to the defendant, whether as a fiduciary or as\n                    a mere employee, I find that although Edward was certainly free to leave the\n                    defendant to join Leadenhall on his own accord after serving the appropriate\n                    notice period, he wasnotentitled to have\n                    instigated the mass exodus of the FARs to Leadenhall or to have instructed the\n                    FARs to transfer their clients to Leadenhallwhile he was\n                        still employed by the defendant. Although I have refrained from\n                    making a finding that the iFast transfer forms were actually forged (see[35]above), I am nonetheless satisfied\n                    that Edward had indeed instructed the FARs to transfer their clients over to\n                    Leadenhall for the simple reason that there would have been no reason for him to\n                    entice them to join Leadenhall if they were not bringing their clients along.\n                    Furthermore, it was clear from the evidence of Mr Ling Herng Wee Henry, director\n                    and shareholder of Leadenhall, that Edward was also actively involved together\n                    with his father, Allan Wong Mun Toong (“Allan Wong”) in the\n                    setting up of the SWM division of Leadenhall while he was still under the employ\n                    of the defendant. 47     During oral closing submissions, counsel for\n                    the plaintiffs argued that Edward did not breach any duties of good faith owed\n                    to the defendant because there was an implied understanding between Edward and\n                    the defendant that Edward and the FARs were allowed to leave as a team and take\n                    their clients with them. In my view, such an implied understanding, even if\n                    founded, certainly did not extend to absolve Edward’s actions in the\n                    present case. The entire backdating exercise was clandestinely conducted under\n                    the cover of secrecy, and Edward had withheld the FARs’ resignation\n                    letters from the defendant until he had ensured that all the FARs had left to\n                    join Leadenhall. All this was, to me, a plain indication that they were well\n                    aware that what they were doing was illegitimate or, at the very least,\n                    improper. How this can be consistent with a duty of good faith, as argued by the\n                    plaintiffs’ counsel, was plainly beyond me.",
        "If the dismissal was wrongful, whether the damages would be limited\n                to the normal notice period": "48     Counsel for Edward also argued that, in the\n                    event that this court finds Edward’s dismissal to be wrongful, Edward\n                    would be entitled, on the authority ofMalik and Mahmud v\n                        Bank of Credit and Commerce International SA (In Compulsory\n                        Liquidation)[1998] 1 AC 20 (“Malik v BCCI”), to claim for damages arising from the\n                    handicap he suffered in the labour market as a result of his wrongful dismissal.\n                    It was claimed that after the defendant had dismissed Edward for making\n                    cash-back payments, he was no longer able to secure a position as a FAM and thus\n                    ended up as a training consultant at Leadenhall earning $3,000 per month since\n                    15 September 2007. As I have already made a positive finding that\n                    Edward was indeed involved in cash-back payments, I need not, strictly, consider\n                    this issue. However, as this point was argued before me by counsel for Edward at\n                    some length, I would make a few observations onMalik v\n                        BCCI. 49     The proposition for whichMalik v BCCIstood for was succinctly stated by G P\n                    Selvam J inArul Chandran v Gartshore and\n                        others[2000] 1 SLR(R) 436 (“Arul Chandran”) (at [20]) as follows: This case made it possible to recover financial loss, that is special\n                        damages, where breach of a contract damages one's reputation which in turn\n                        causes foreseeable financial loss to the claimant. The claim is subject to\n                        the established limiting principles of remoteness causation and\n                        mitigation. G P Selvam J then went on to state the facts and the procedural\n                    history ofMalik v BCCIthat culminated in the\n                    House of Lords’ decision (Arul Chandranat [21] and [22]): 21    TheMalikcase arose\n                            out of a contract of employment and the disastrous collapse of the\n                            infamous bank - Bank of Credit and Commerce International SA (BCCI)\n                            (\"the bank\"). Malik was the head of deposit accounts and customer\n                            services at a branch office of the bank. When the bank was ordered to be\n                            wound up he was dismissed by the provisional liquidators on the ground\n                            of redundancy. He brought an action asserting that he had lost more than\n                            his job. He said that by reason of the corrupt and/or dishonest manner\n                            in which the bank operated and the consequential collapse of the bank he\n                            was at a handicap on the labour market because he was stigmatised by\n                            reason of his employment by the bank. He claimed 50,000 based on some\n                            “table of service”. His claim was based on an implied term\n                            in his contract of employment that “the employer will not,\n                            without reasonable and proper cause, conduct itself in a manner\n                            calculated or likely to destroy or seriously damage the relationship of\n                            confidence and trust between employer and employee”. The\n                            liquidators rejected the claim. 22 On appeal, Evans-Lombe J refused to imply the term contended for. The\n                        judge foundAddis v Gramophone Co Ltd([12]supra) the principal stumbling block. On\n                        appeal the Court of Appeal was prepared to imply a term to the effect that\n                        the bank was under a duty not, without reasonable and proper cause, to\n                        conduct itself in a manner calculated or likely to destroy or seriously\n                        damage the relationship of confidence and trust between employer and\n                        employee. Nevertheless, “stigma damage” as a head of\n                        compensation was not recoverable in law. Once againAddis\n                            v Gramophone Co Ltdprovided the justification for the\n                        decision. Malik appealed to the House of Lords. His appeal was allowed. The\n                        House of Lords ruled that the bank had broken its implied obligation of\n                        trust and confidence.Accordingly Malik was entitled to\n                            damages for the financial loss suffered by him upon proof and to the\n                            extent that his future employment prospects were prejudiced by the\n                            stigma of his employment with the egregious employer. [emphasis added] 50     In the words of Lord Nicholls of Birkenhead,\n                    who delivered one of the two written judgments of the House of Lords inMalik v BCCI(at 37?38), such a claim was\n                    founded on the term of trust and confidence that is implied into every\n                    employment contract: Employers may be under no common law obligation, through the medium of an\n                        implied contractual term of general application, to take steps to improve\n                        their employees' future job prospects. But failure to improve is one thing,\n                        positively to damage is another. Employment, and job prospects, are matters\n                        of vital concern to most people. Jobs of all descriptions are less secure\n                        than formerly, people change jobs more frequently, and the job market is not\n                        always buoyant. Everyone knows this. An employment contract creates a close\n                        personal relationship, where there is often a disparity of power between the\n                        parties. Frequently the employee is vulnerable. Although the underlying\n                        purpose of the trust and confidence term is to protect the employment\n                        relationship,there can be nothing unfairly onerous or\n                            unreasonable in requiring an employer who breaches the trust and\n                            confidence term to be liable if he thereby causes continuing financial\n                            loss of a nature that was reasonably foreseeable. Employers\n                        must take care not to damage their employees' future employment prospects,\n                        by harsh and oppressive behaviour or by any other form of conduct which is\n                        unacceptable today as falling below the standards set by the implied trust\n                        and confidence term. [emphasis added] It was also made clear that any such claim would be for proven\n                    financial loss, and not for injury to reputation, which is separately protected\n                    by the law of defamation (at 40–41): Sometimes, in practice, the distinction between damage to reputation and\n                        financial loss can become blurred. Damage to the reputation of professional\n                        persons, or persons carrying on a business, frequently causes financial\n                        loss. None the less, the distinction is fundamentally sound, and when\n                        awarding damages for breach of contract courts take care to confine the\n                        damages to their proper ambit: making good financial loss. 51     It is thus apparent fromMalik v BCCIthat a claimant will be entitled to damages from a\n                    former employer if he or she can prove that the former employer was in breach of\n                    the implied term of trust and confidence and which resulted in loss of future\n                    employment prospects. Lord Nicholls cautioned however that it may not always be\n                    easy to prove such a claim (at 42): [O]ne of the assumed facts in the present case is that the employer was\n                        conducting a dishonest and corrupt business. I would like to think this will\n                        rarely happen in practice. Thirdly, there are many circumstances in which an\n                        employee's reputation may suffer from his having been associated with an\n                        unsuccessful business, or an unsuccessful department within a business. In\n                        the ordinary way this will not found a claim of the nature made in the\n                        present case, even if the business or department was run with gross\n                        incompetence. A key feature in the present case is the assumed fact that the\n                        business was dishonest or corrupt. Finally, although the implied term that\n                        the business will not be conducted dishonestly is a term which avails all\n                        employees, proof of consequential handicap in the labour market may well be\n                        much more difficult for some classes of employees than others. An employer\n                        seeking to employ a messenger, for instance, might be wholly unconcerned by\n                        an applicant's former employment in a dishonest business, whereas he might\n                        take a different view if he were seeking a senior executive. 52     Therefore, on the authority ofMalik v BCCI, I accept the submission by Edward’s\n                    counsel that, in principle, if it can be shown that the defendant had wrongfully\n                    dismissed Edward in a manner that was dishonest or illegitimate which amounted\n                    to a breach of the implied term of trust and confidence, and as a direct result\n                    of that wrongful dismissal it can be proven that Edward suffered a real and\n                    provable financial loss, in my view, Edward would be entitled to claim against\n                    the defendant for such loss beyond the contractual notice period. However, as I\n                    have already made clear that the defendant was entitled to terminate Edward from\n                    his position on not one but two separate grounds, I find that there is no merit\n                    to his claim which I dismiss accordingly. 53     I would add that even if I had found that the\n                    defendant had wrongfully dismissed Edward, I find that his claim that he had\n                    suffered a loss of employment prospects to be altogether contrived. The only\n                    evidence produced by Edward to show that he had difficulties obtaining a job as\n                    a FAM after his dismissal was a rejection letter from Leadenhall which was\n                    signed by his own father, Allan Wong, who was then working for Leadenhall and\n                    had interviewed Edward in his application to join Leadenhall. In that letter,\n                    Allan Wong had stated that because Edward “was terminated by Acclaim on\n                    8.8.07 due to alleged cashback”, Leadenhall would not be accepting his\n                    “application unless the issue is resolved”. However, given the\n                    involvement of Edward and Allan Wong in the setting up of the SWM division of\n                    Leadenhall  (see[46]above) and Allan\n                    Wong’s key role in facilitating the exodus as the interviewer and\n                    recruiter for all the FARs who joined Leadenhall, I found the letter to be\n                    highly suspect and ascribed no weight whatsoever to it.",
        "Loss of commissions": "54     Having found that the defendant was entitled\n                    to the sum of $23,182.02 for the FARs’ failure to give the required 30\n                    days’ notice before resigning (see[31]above), the only issue remaining is whether the defendant\n                    could succeed in its claim for a further 17 months of commissions (see[11]above) arising from the mass resignation and\n                    the subsequent transfer of clients to Leadenhall. 55     In my judgment, this particular claim must\n                    fail for the simple reason that the defendant has failed to prove that the mass\n                    resignation and the subsequent transfer of clients to Leadenhall would not have\n                    occurred but for the alleged forgeries or Edward’s breach of his duties to\n                    the defendant. First, it was undisputed that if Edward and the FARs had validly\n                    served the defendant 30 days’ notice before resigning, they were\n                    perfectly entitled to leave the defendant to join Leadenhall upon the expiry of\n                    that notice period. Second, it was the defendant’s own case that all the\n                    SWM division’s clients were effectively driven by “runners”\n                    (see[2]above) who were working in\n                    collaboration with Edward. Although counsel for the defendant attempted to argue\n                    that the FARs and the clients would not have left the defendant but for\n                    Edward’s directions, the evidence before me pointed to the conclusion that\n                    upon Edward leaving the defendant, it was inevitable that the FARs would have\n                    joined him and the clients would have been instructed by the\n                    “runners” to transfer their investment accounts to Leadenhall and\n                    therefore would have left the defendant in any event. There is simply no\n                    evidence to show that the clients would have remained with the defendant after\n                    the departure of Edward and the FARs. Indeed, none of the clients have appeared\n                    in court to complain about the transfers or the alleged forgeries. Therefore, in\n                    the present circumstances, at best, all that the defendant can show is that the\n                    forgeries, if proven, or Edward’s breach of his duties simply facilitated\n                    the transfers which would inevitably have taken place at a later\n                date. 56     Although the defendant may feel aggrieved at\n                    the way the resignations were carried out by Edward and the FARs, it has to be\n                    noted that the defendant had no SWM division to speak of before Edward came\n                    onboard. The SWM division was, in fact, from the outset, set up and managed\n                    entirely by Edward. With the exception of Jeremy Tan, all the FARs in the\n                    defendant’s SWM division were personally recruited by Edward. There was\n                    also no suggestion that the clients who transferred over to Leadenhall were\n                    pre-existing clients who had been procured by the defendant before the SWM\n                    division was formed by Edward. If anything, the defendant benefited greatly from\n                    the commissions that Edward and his FARs brought in during the period when\n                    Edward was head of its SWM division. In my view, the defendant was entitled to\n                    no more than the sum that I have already awarded in respect of the breaches of\n                    contract by the FARs in failing to provide the required 30 days’ notice\n                    before resigning.",
        "Conclusion": "57     Accordingly, my orders are as follows: (a)     The defendant to pay the judgement\n                        debt in the sum of $59,892.13 granted to the first plaintiff in Suit 781 by\n                        way of summary judgment dated 4 June 2008 forthwith without any deduction or\n                        set-off. (b)     Judgment in favour of second plaintiff in Suit 781 in the sum of\n                        $231,946.10. (c)     The defendant’s counterclaim in Suit 781 succeeds only to the extent\n                        of $$23,182.02 which is to be set-off against the judgment sum due to the\n                        second plaintiff. (d)     The plaintiff’s claim in Suit 106 is hereby\n                    dismissed. (e)     Interest\n                        at 5.33% per annum on $59,892.13 and $208,763.99 ($231,946.10 - $23,182.02)\n                        in favour of the first and second plaintiff respectively from the date of\n                        the writ to the date of judgment. (f)     As for costs, the plaintiff substantially succeeded in\n                        Suit 781 but failed in his action in Suit 106. The defendant only succeeded\n                        in a small fraction of its counterclaim which was essentially the defence in\n                        Suit 106. In the light of my findings, I order that each party should bear\n                        its own costs for both proceedings.  [note: 1]DW-1 [note: 2]Except one who\n                                was already a FAR of the defendant when he joined the SWM\n                                division. [note: 3]PW-12 [note: 4]PW-14 [note: 5]PW-15 [note: 6]DW-5 [note: 7]DW-8 [note: 8]DW-9 [note: 9]DW-10 [note: 10]DW-16 [note: 11]DW-13 [note: 12]DW-12 [note: 13]Defendant’s Written Closing Submissions at\n                            [218] [note: 14]DW-2 [note: 15]Notes of Evidence Day 1 pg\n                                65-69"
    }
}