{
    "case_title": "Soh Eng Beng (as executor and trustee of the Estate of Soh Kim Poo,\n                deceased)\n      v\n      Soh Eng Koon",
    "ncitation": "[2010] SGHC 257",
    "coram": "Belinda Ang Saw Ean J",
    "sections": {
        "The Will": "2       The dispute before me relates to clause 5\n                    of the Will. It is, however, helpful to set out clauses 4 to 6 in their\n                    entirety, so that the provision in issue can be considered in its\n                    context: 4.    I devise and\n                            bequeath myhalf (1/2) shareof the\n                            property known asNo 25 Lorong 4 Geylang,\n                                Singaporeto my son,SOH ENG\n                                TAI(NRIC No. [xxx])\n                            absolutely. 5    I devise and\n                            bequeath my half (1/2) share of the property known as31C Lorong 34 Geylang, Singaporeto my following\n                            children: - (a)SOH ENG GUAN(NRIC No. [xxx]) –\n                            35% (b)SOH ENG KOON(NRIC No. [xxx]) –\n                            35% (c)SOH LAI YING(NRIC No. [xxx]) –\n                            30% 6    I devise and bequeath the rest and residue of my\n                            property of whatsoever nature and wheresoever situated to all my living\n                            children as at the date of my death in equal shares. [emphasis in bold and capital letters in original] 3       The testator died on 16 May 2002. The\n                    beneficiaries under the Will are his ten children, namely: (a)Soh Eng Beng (“the\n                            Applicant”);(b)Soh Eng Chee;(c)Soh Eng Cheong;(d)Soh Eng Guan;(e)Soh Eng Koon (“the\n                            Respondent”);(f)Soh Eng Moh;(g)Soh Eng Tai;(h)Soh Lai Yim;(i)Soh Siew Geok; and(j)Soh Siew Kiow.4       It is common ground that the name of the third\n                    beneficiary, “Soh Lai Ying”, in clause 5 of the Will was\n                    incorrectly spelt as “Ying”, and that it ought rightly to be\n                    “Yim”. Hence, the name of the third beneficiary in clause 5\n                    should read as “Soh Lai Yim”. It is also common ground that at all\n                    material times, the registered owners of No 31C Lorong 34 Geylang, Singapore\n                    (“the Property”) were the testator and Soh Eng Guan as tenants in\n                    common in unequal shares, with the testator holding 4/5 (80%) share in the\n                    Property and Soh Eng Guan, the remaining 1/5 (20%) share.The rival contentions5       Mr Roland Tong for the Applicant argues\n                    that, upon the proper construction of clause 5 of the Will, the presence of\n                    the phrase “my half (1/2) share of the property” conveys the\n                    natural meaning that the testator intended to bequeath one-half of hisentireinterest in the Property, which he co-owned with\n                    Soh Eng Guan as tenants in common, to the three persons named in the\n                    clause to receive the bequeath in the percentage share enumerated against\n                    their respective names. The remaining part of his interest in the Property falls\n                    into the residue of the estate to be distributed in accordance with\n                    clause 6 of the Will.6       In opposition, Mr Mark Goh, who was\n                    instructed as counsel for the Respondent, argues that the Applicant’s\n                    construction of the specific bequest in clause 5 is wrong. The testator\n                    intended to bequeath hisentireinterest in the\n                    Property (iehis 4/5 share) to the three named\n                    beneficiaries. Had the testator intended any part of the Property to be part of\n                    the residuary estate, the testator (so the argument ran) would not have taken\n                    pains to single out the Property from the rest of his estate in the first place.\n                    According to Mr Goh, the Applicant’s interpretation of clause 5\n                    would give rise to a whimsical and capricious situation in that the three named\n                    beneficiaries would stand to inherit an additional share each in the\n                    testator’s remaining interest in the Property under clause 6.\n                    Mr Goh cites para 429 fromHalsbury’s Laws of\n                        Englandvol 50 (Butterworths, 4th Edition) which is different\n                    from the 2005 Reissue Edition. Be that as it may, there is para 483 in the\n                    2005 Reissue Edition which,inter alia, provides\n                    that where there is ambiguity in the ascertainment of the intention of the\n                    testator, the principle that arises is that the court would not attribute to him\n                    a capricious or unreasonable intention to his dispositions, where the words of\n                    his will can be read otherwise. If the testator’s intention was to give\n                    his interest in the Property to all his ten children, Mr Goh argues that\n                    the testator could have easily named all his ten children in clause 5. He\n                    could also indicate the share each child is to receive. Mr Goh concludes\n                    that the phrase “my half (1/2) share of the property” in\n                    clause 5 was an inadvertent mistake on the part of the draftsman of the\n                    Will. Clause 5 should rightly read as “my share of the property”,\n                    after deleting the word “half (1/2)” from the\n                clause.7       Apart from the interpretation of clause 5\n                    of the Will argued for by Mr Goh, the Respondent has an alternative claim\n                    for the sum of $243,106, being the amount he contributed to the testator’s\n                    purchase of the Property. It was made clear that this alternative claim only\n                    arises if the court favours the Applicant’s construction of clause 5\n                    of the Will.The construction issue8       The starting point when construing any will is\n                    to determine the intention of the testator by giving the words of the will the\n                    meaning that they naturally bear, having regard to the context of the will as a\n                    whole. Little assistance in construing a will is likely to be gained by\n                    consideration of how other judges have interpreted similar wording in other\n                    cases. Textual analysis looks at the language used in the Will and the approach\n                    involves different textual methods of interpretation. If there is some\n                    uncertainty or ambiguity in the will, then it is necessary to have recourse to\n                    extrinsic evidence in aid of interpretation.9       The key submission from both sides is based on\n                    the word “half (1/2)”in clause 5. Specifically, the issue for\n                    the Respondent is whether clause 5 contains an inaccurate description of\n                    the testator’s actual interest in the Property, or as Mr Tong argues,\n                    the word “half (1/2)” is significant. It must be read as a word of\n                    restriction to limit the specific bequeath to only one-half of the\n                    testator’s interest.10     It is clear from the schedule under\n                    s 41(2) of the Estate Duty Act (Cap 96, 1997 Rev Ed) that was\n                    annexed to the Grant of Probate that the testator died leaving (i) immovable\n                    properties - (a) half share in No 25 Lorong 4 Geylang, Singapore and (b) 4/5\n                    (80%) share in No 31C Lorong 34, Geylang, Singapore; (ii) stocks and shares in\n                    various public and private companies in Singapore and Malaysia; and (iii) cash\n                    in hand and in bank accounts in Singapore and Malaysia.11     This leads me to the Will. There are two\n                    specific bequests of immoveable properties in the Will. They are contained in\n                    clauses 4 and 5. In clause 4, the testator made a specific bequest of the\n                    whole of his interest in the property known as No 25 Lorong 4 Geylang to his\n                    son, Soh Eng Tai, absolutely. In relation to this property, the testator was a\n                    co-owner in equal shares of the property with one of his sons, and the\n                    clause correctly described the testator’s interest in the property.\n                    The fact remains that the testator’s intention under clause 4 was to\n                    dispose of his entire interest in the property to Soh Eng Tai. The specific\n                    bequest of the second immoveable property is found in clause 5. This time\n                    the property in question is No 31C Lorong 34, Geylang (“the\n                    Property”) and the bequest is divided among three named beneficiaries.\n                    The rest of the estate is described in clause 6 as the\n                    “residue”. Clause 6 sets out for whom the residuary estate would\n                    be divided.12     With the scheme of the Will as set out in[11]in mind, I turn to the opening\n                    words of clause 5. On a textual approach to construing the will and without\n                    reference at this stage to extrinsic evidence in aid of interpretation, it is\n                    clear from the language of clause 5 that the testator was aware that he was\n                    not the sole owner of the Property in that he shared it with his son, Soh Eng\n                    Guan. This is evident from his reference to part ownership of the Property. The\n                    testator has also in clause 5 identified the persons to whom he really\n                    wanted to benefit by the bequest. In clause 5, the testator divided the\n                    bequest among three named beneficiaries in the following proportion: Soh Eng\n                    Guan (35%); Soh Eng Koon (35%) and Soh Lai Yim (30%). The percentages add up to\n                    100%. The cumulative effect of these indicators as described are consistent with\n                    the testator’s primary wish to give away what he owned (ie, his entire interest as co-owner of the Property) in the same\n                    way as he had intended in clause 4 in respect of the other Geylang\n                    property. The use of clause 4 as a matter of construction lends credence to\n                    the argument that the purpose of clause 5 is to bequeath what belonged to\n                    the testator to three named beneficiaries. I am further persuaded that this is\n                    the correct interpretation of the Will by the fact that the properties in\n                    clauses 4 and 5 were the only two immovable properties which the testator owned.\n                    The rest of his assets consisted of cash and stocks. The scheme of the Will\n                    strongly suggests that the testator had intended to dispose of his immovable\n                    properties in the same fashionieby way of a\n                    specific gift to named children rather than to leave the immovable properties to\n                    be distributed as part of the residuary estate.13     The phrase - “my\n                    half (1/2) share of the property”\n                    - is descriptive in nature. Besides the address, the\n                    testator’s part ownership in the Property was particularised to complete\n                    the description of the Property. Instead of referencing the co-ownership that\n                    was in unequal shares, the draftsman stated it to be in equal shares. I disagree\n                    with Mr Tong that the phrase contains words of restriction to cut down by\n                    limiting the bequest to one-half of the testator’s interest in the\n                    Property. Mr Tong’s argument has merit if the draftsman had phrased\n                    clause 5 as: “I devise and bequeath half (1/2)myshare of the property ...” (emphasis added), and not\n                    as it appears in clause 5, namely, “I devise and bequeathmyhalf (1/2) share of the property ...”\n                    (emphasis added). In my view, and I so find and hold, the reference to\n                    “my half (1/2) share of the property” is a misdescription of the\n                    testator’s interest as co-owner of the Property.14     Another way of arriving at the conclusion (and\n                    to test, at the same time, its correctness) that the testator intended to\n                    bequeath his entire interest in the Property to the named beneficiaries is via\n                    the useful canon of construction of documents, ‘falsa\n                        demonstratio non nocet cum de corpore constat’which\n                    translates as a false description does not vitiate when there is no doubt as to\n                    the subject matter. The false description must merely be added onto that which\n                    is otherwise true. John G. Ross Martyn, Stuart Bridge & Mika Oldham,Theobald on Wills, (Sweet & Maxwell,\n                        16thEd, 2001) at para 23-01 explains the\n                    maxim in the following manner:The principle offalsa demonstratio non\n                            nocetmeans that if, on considering the language of a will\n                        with the aid of any admissible extrinsic evidence, the court comes to the\n                        conclusion that the testator intended to pass something and can determine\n                        what that something is, then the fact that the testator gave it a wrong\n                        description in his will does not prevent the will taking effect in regard to\n                        the subject matter intended by the testator. The principle may be applied in\n                        whatever part of the description the error occurred. The principle offalsa demonstratioalso applies to a wrong\n                        description of a person in a will.15     Thefalsa\n                        demonstratioprinciple does not apply if the description fits the\n                    property so that any enlargement of the meaning by extrinsic evidence to include\n                    some other property is excluded. Francis Barlowet al,\n                        Williams on Wills, (Butterworths, 9thEd, 2008) at para 58.3 explains the exclusion of thefalsa demonstratioprinciple thus:Additional words are not rejected as importing a false description if they\n                        can be read as words of restriction.16     I have already explained in[12]and[13]above that the draftsman’s use of the word “half (1/2)” was\n                    not to describe a limited interest that was intended to pass by specific\n                    bequeath to the three named beneficiaries. It is possible to reject the word\n                    “half (1/2)” as afalsa\n                    demonstratio. The misdescription of the part of his interest in the\n                    Property did not prevent the Will taking effect in regard to Property in\n                    question, and the specific bequeath in clause 5 is not\n                vitiated.17     The conclusion which I have thus far reached\n                    on the wording of the Will is confirmed by the evidence as to what the testator\n                    meant and intended by clause 5 of his Will. The evidence shows that the\n                    testator wanted to part with his interest in the Property. The misdescription of\n                    the testator’s interest is a mistake; one that was likely to be made in\n                    the circumstances in which the Will was drawn up and executed. I now turn to the\n                    evidence relating to the drafting of the Will.18     On the cover page of the Will is the name of\n                    the law firm of Messrs Viyay & Co. Mr Tong informed the court that he\n                    had contacted Mr Narayanan Vijya Kumar (“Mr Vijya”), for\n                    his assistance in relation the Will drawn up by his firm. Mr Vijya filed an\n                    affidavit on 27thApril 2010. Unfortunately, the\n                    matters deposed in his affidavit were vague and, in fact, raised more questions\n                    than answers and his affidavit evidence did not assist in resolving the dispute\n                    before the court. I, therefore, allowed Mr Tong’s application to\n                    cross-examine Mr Vijya on his affidavit.19     In the witness box, Mr Vijya disclosed\n                    that, at the material time, he was in India as his mother suddenly suffered a\n                    stroke, and as his testimony unfolded, it became clear that his secretary, one\n                    Helen Tan (“Helen”), took the testator’s instructions on his\n                    will and it was she who drew up the draft that was sent to the testator’s\n                    son, Soh Eng Beng, for the testator’s consideration. There were apparently\n                    amendments to the draft. Presumably, the amendments were attended to by Helen.\n                    In his affidavit, Mr Vijya deposed that he has no record of any documents\n                    or file relating to the Will. In cross-examination, Mr Vijya confirmed that\n                    no attendance notes were taken by Helen or anyone else. As shown on the Will,\n                    Helen and her colleague, Zalinah Kamis, witnessed the testator’s execution\n                    of the Will after Helen explained the contents of the Will in Hokkien to the\n                    testator. From Mr Vijya’s evidence, we learn that\n                    Mr Vijya’s friend, Mr Lukshumayeh, an advocate & solicitor,\n                    who would help out Mr Vijya’s firm in his absence, has no\n                    recollection of his involvement with this Will. I think it is fair to conclude\n                    that after taking the testator’s instructions, Helen drew up the Will,\n                    explained in the Hokkien dialect the contents of the Will to the testator who\n                    signed it thereafter in her presence and that of her colleague.20     In arguing for the interpretation subscribed\n                    by the Applicant’s, Mr Tong submits that there is no evidence that\n                    the testator meant to give his entire share in the Property to the three named\n                    beneficiaries, and that there was further, no evidence that Helen Tan did not\n                    take his instructions properly, or had made a mistake in the drafting of the\n                    Will. Therefore, clause 5 should thus be interpreted in such a way that\n                    half of the testator’s interest in the Property be divided among the three\n                    named beneficiaries, and the remaining half to go towards the residuary estate\n                    to be divided equally among the testator’s ten children.21     I concluded for the reasons given that the\n                    testator’s interest in the Property was misdescribed in clause 5. As\n                    the testator had indeed owned a half-share in the property known as No. 25\n                    Lorong 4 Geylang, which was the subject matter in clause 4 of the Will, it\n                    would not be implausible for the draftsman to have copied the wording of\n                    clause 4 for clause 5, and to have simply changed the address of the\n                    property in question before typing out the names of the three beneficiaries and\n                    their respective shares in percentage terms. I noticed that the words\n                    “half (1/2) share” were in bold print in clause 4 but not in\n                    clause 5. The significance of that, if any, is a matter of speculation. Be\n                    that as it may, we now know it was Helen who drew up the Will. The likelihood of\n                    a mistake being committed was all the more probable without the apparent benefit\n                    of legal supervision or review of her work which on the face of the document\n                    contained an error in the spelling of the name of Soh Lai Yim. The other\n                    mistake, as I have found, is in the description of the testator’s share as\n                    co-owner of the Property.Conclusion22     For the reasons stated, the Will is construed\n                    as contended for by the Respondent. Since the construction issue is resolved in\n                    favour of the Respondent, the issue of rectification no longer remains a\n                    “live” issue save for the misspelling of the name of the third\n                    beneficiary which ought to be spelt as “Soh Lai Yim” and not\n                    “Soh Lai Ying”. However, since I have concluded that the primary\n                    wish of the testator in clause 5 of the Will is to bequeath his entire\n                    interest in the Property, the misdescription of the testator’s interest is\n                    best removed. I therefore order clause 5 be rectified to the extent that\n                    the word “half” be deleted from clause 5, such that it\n                    reads:I devise and bequeath my share of the property known as31C Lorong 34 Geylang, Singaporeto my following children:\n                        -(a)   SOH ENG GUAN (NRIC No. [xxx]) – 35%(b)   SOH ENG KOON (NRIC No. [xxx]) – 35%(c)   SOH LAI YIM (NRIC No. [xxx]) – 30%.On costs, I order that the estate pays the Respondent’s costs of\n                    OS 48/2010 and Summons No 1566 of 2010 to be taxed, if not agreed.23     It remains to be said that these proceedings\n                    highlight some professional shortcomings, and it is appropriate that I draw\n                    attention to the timely reminder by Chan Sek Keong CJ inChee Mu Lin Muriel v Chee Ka Lin Caroline[2010] SGCA 27 (“Chee\n                        Muriel”)at [60]:... solicitors who undertake the task of preparing wills and/or witnessing\n                        the execution of wills must take the necessary precautions or steps in order\n                        to fulfil their duties to their clients. The precautions are not complicated\n                        nor are they time consuming. In any case, as solicitors, they must do what\n                        is required, however complicated or difficult the task may be. The central\n                        task is to ensure that the terms of the will reflect the wishes of the\n                        testator.24     Some of the precautions noted by Chan CJ\n                    in [60] “as a matter of good professional practice, if not professional\n                    prudence”, is that “the solicitor should make a contemporary\n                    written record of his or her attendances on the testator so that he or she would\n                    be able to recall exactly what had transpired during the meeting or\n                    meetings”.25     It is also helpful to close this discourse on\n                    the proper discharge of professional responsibilities in drawing up a Will by\n                    quoting an apt warning inLow Ah Cheow and others v Ng Hock\n                        Guan[2009] 3 SLR(R) 1079 at [73], which was cited inChee Muriel(at [61]):The preparation of a will involves serious professional responsibilities,\n                        which solicitors must uncompromisingly observe and discharge. Regrettably,\n                        it seems to us that, all too often nowadays, solicitors appear to consider\n                        the preparation of a will to be no more than a routine exercise in form\n                        filling. This iswrong. Before preparing a\n                        will, the solicitor concerned ought to have a thorough discussion with the\n                        testator on all the possible legal issues and potential complications that\n                        might arise in the implementation of the terms of the will. The solicitor\n                        ought to painstakingly and accurately document his discussions with and his\n                        instructions from the testator. He should also confirm with the testator,\n                        prior to the execution of the will, that the contents of the will as drafted\n                        accurately express the latter’s intention. A translation, if required,\n                        must be thoroughly and competently done. Half measures or the cutting of\n                        corners in the discharge of these serious professional responsibilities will\n                        not do.[emphasis in original]",
        "The rival contentions": "5       Mr Roland Tong for the Applicant argues\n                    that, upon the proper construction of clause 5 of the Will, the presence of\n                    the phrase “my half (1/2) share of the property” conveys the\n                    natural meaning that the testator intended to bequeath one-half of hisentireinterest in the Property, which he co-owned with\n                    Soh Eng Guan as tenants in common, to the three persons named in the\n                    clause to receive the bequeath in the percentage share enumerated against\n                    their respective names. The remaining part of his interest in the Property falls\n                    into the residue of the estate to be distributed in accordance with\n                    clause 6 of the Will. 6       In opposition, Mr Mark Goh, who was\n                    instructed as counsel for the Respondent, argues that the Applicant’s\n                    construction of the specific bequest in clause 5 is wrong. The testator\n                    intended to bequeath hisentireinterest in the\n                    Property (iehis 4/5 share) to the three named\n                    beneficiaries. Had the testator intended any part of the Property to be part of\n                    the residuary estate, the testator (so the argument ran) would not have taken\n                    pains to single out the Property from the rest of his estate in the first place.\n                    According to Mr Goh, the Applicant’s interpretation of clause 5\n                    would give rise to a whimsical and capricious situation in that the three named\n                    beneficiaries would stand to inherit an additional share each in the\n                    testator’s remaining interest in the Property under clause 6.\n                    Mr Goh cites para 429 fromHalsbury’s Laws of\n                        Englandvol 50 (Butterworths, 4th Edition) which is different\n                    from the 2005 Reissue Edition. Be that as it may, there is para 483 in the\n                    2005 Reissue Edition which,inter alia, provides\n                    that where there is ambiguity in the ascertainment of the intention of the\n                    testator, the principle that arises is that the court would not attribute to him\n                    a capricious or unreasonable intention to his dispositions, where the words of\n                    his will can be read otherwise. If the testator’s intention was to give\n                    his interest in the Property to all his ten children, Mr Goh argues that\n                    the testator could have easily named all his ten children in clause 5. He\n                    could also indicate the share each child is to receive. Mr Goh concludes\n                    that the phrase “my half (1/2) share of the property” in\n                    clause 5 was an inadvertent mistake on the part of the draftsman of the\n                    Will. Clause 5 should rightly read as “my share of the property”,\n                    after deleting the word “half (1/2)” from the\n                clause. 7       Apart from the interpretation of clause 5\n                    of the Will argued for by Mr Goh, the Respondent has an alternative claim\n                    for the sum of $243,106, being the amount he contributed to the testator’s\n                    purchase of the Property. It was made clear that this alternative claim only\n                    arises if the court favours the Applicant’s construction of clause 5\n                    of the Will.",
        "The construction issue": "8       The starting point when construing any will is\n                    to determine the intention of the testator by giving the words of the will the\n                    meaning that they naturally bear, having regard to the context of the will as a\n                    whole. Little assistance in construing a will is likely to be gained by\n                    consideration of how other judges have interpreted similar wording in other\n                    cases. Textual analysis looks at the language used in the Will and the approach\n                    involves different textual methods of interpretation. If there is some\n                    uncertainty or ambiguity in the will, then it is necessary to have recourse to\n                    extrinsic evidence in aid of interpretation. 9       The key submission from both sides is based on\n                    the word “half (1/2)”in clause 5. Specifically, the issue for\n                    the Respondent is whether clause 5 contains an inaccurate description of\n                    the testator’s actual interest in the Property, or as Mr Tong argues,\n                    the word “half (1/2)” is significant. It must be read as a word of\n                    restriction to limit the specific bequeath to only one-half of the\n                    testator’s interest. 10     It is clear from the schedule under\n                    s 41(2) of the Estate Duty Act (Cap 96, 1997 Rev Ed) that was\n                    annexed to the Grant of Probate that the testator died leaving (i) immovable\n                    properties - (a) half share in No 25 Lorong 4 Geylang, Singapore and (b) 4/5\n                    (80%) share in No 31C Lorong 34, Geylang, Singapore; (ii) stocks and shares in\n                    various public and private companies in Singapore and Malaysia; and (iii) cash\n                    in hand and in bank accounts in Singapore and Malaysia. 11     This leads me to the Will. There are two\n                    specific bequests of immoveable properties in the Will. They are contained in\n                    clauses 4 and 5. In clause 4, the testator made a specific bequest of the\n                    whole of his interest in the property known as No 25 Lorong 4 Geylang to his\n                    son, Soh Eng Tai, absolutely. In relation to this property, the testator was a\n                    co-owner in equal shares of the property with one of his sons, and the\n                    clause correctly described the testator’s interest in the property.\n                    The fact remains that the testator’s intention under clause 4 was to\n                    dispose of his entire interest in the property to Soh Eng Tai. The specific\n                    bequest of the second immoveable property is found in clause 5. This time\n                    the property in question is No 31C Lorong 34, Geylang (“the\n                    Property”) and the bequest is divided among three named beneficiaries.\n                    The rest of the estate is described in clause 6 as the\n                    “residue”. Clause 6 sets out for whom the residuary estate would\n                    be divided. 12     With the scheme of the Will as set out in[11]in mind, I turn to the opening\n                    words of clause 5. On a textual approach to construing the will and without\n                    reference at this stage to extrinsic evidence in aid of interpretation, it is\n                    clear from the language of clause 5 that the testator was aware that he was\n                    not the sole owner of the Property in that he shared it with his son, Soh Eng\n                    Guan. This is evident from his reference to part ownership of the Property. The\n                    testator has also in clause 5 identified the persons to whom he really\n                    wanted to benefit by the bequest. In clause 5, the testator divided the\n                    bequest among three named beneficiaries in the following proportion: Soh Eng\n                    Guan (35%); Soh Eng Koon (35%) and Soh Lai Yim (30%). The percentages add up to\n                    100%. The cumulative effect of these indicators as described are consistent with\n                    the testator’s primary wish to give away what he owned (ie, his entire interest as co-owner of the Property) in the same\n                    way as he had intended in clause 4 in respect of the other Geylang\n                    property. The use of clause 4 as a matter of construction lends credence to\n                    the argument that the purpose of clause 5 is to bequeath what belonged to\n                    the testator to three named beneficiaries. I am further persuaded that this is\n                    the correct interpretation of the Will by the fact that the properties in\n                    clauses 4 and 5 were the only two immovable properties which the testator owned.\n                    The rest of his assets consisted of cash and stocks. The scheme of the Will\n                    strongly suggests that the testator had intended to dispose of his immovable\n                    properties in the same fashionieby way of a\n                    specific gift to named children rather than to leave the immovable properties to\n                    be distributed as part of the residuary estate. 13     The phrase - “my\n                    half (1/2) share of the property”\n                    - is descriptive in nature. Besides the address, the\n                    testator’s part ownership in the Property was particularised to complete\n                    the description of the Property. Instead of referencing the co-ownership that\n                    was in unequal shares, the draftsman stated it to be in equal shares. I disagree\n                    with Mr Tong that the phrase contains words of restriction to cut down by\n                    limiting the bequest to one-half of the testator’s interest in the\n                    Property. Mr Tong’s argument has merit if the draftsman had phrased\n                    clause 5 as: “I devise and bequeath half (1/2)myshare of the property ...” (emphasis added), and not\n                    as it appears in clause 5, namely, “I devise and bequeathmyhalf (1/2) share of the property ...”\n                    (emphasis added). In my view, and I so find and hold, the reference to\n                    “my half (1/2) share of the property” is a misdescription of the\n                    testator’s interest as co-owner of the Property. 14     Another way of arriving at the conclusion (and\n                    to test, at the same time, its correctness) that the testator intended to\n                    bequeath his entire interest in the Property to the named beneficiaries is via\n                    the useful canon of construction of documents, ‘falsa\n                        demonstratio non nocet cum de corpore constat’which\n                    translates as a false description does not vitiate when there is no doubt as to\n                    the subject matter. The false description must merely be added onto that which\n                    is otherwise true. John G. Ross Martyn, Stuart Bridge & Mika Oldham,Theobald on Wills, (Sweet & Maxwell,\n                        16thEd, 2001) at para 23-01 explains the\n                    maxim in the following manner: The principle offalsa demonstratio non\n                            nocetmeans that if, on considering the language of a will\n                        with the aid of any admissible extrinsic evidence, the court comes to the\n                        conclusion that the testator intended to pass something and can determine\n                        what that something is, then the fact that the testator gave it a wrong\n                        description in his will does not prevent the will taking effect in regard to\n                        the subject matter intended by the testator. The principle may be applied in\n                        whatever part of the description the error occurred. The principle offalsa demonstratioalso applies to a wrong\n                        description of a person in a will. 15     Thefalsa\n                        demonstratioprinciple does not apply if the description fits the\n                    property so that any enlargement of the meaning by extrinsic evidence to include\n                    some other property is excluded. Francis Barlowet al,\n                        Williams on Wills, (Butterworths, 9thEd, 2008) at para 58.3 explains the exclusion of thefalsa demonstratioprinciple thus: Additional words are not rejected as importing a false description if they\n                        can be read as words of restriction. 16     I have already explained in[12]and[13]above that the draftsman’s use of the word “half (1/2)” was\n                    not to describe a limited interest that was intended to pass by specific\n                    bequeath to the three named beneficiaries. It is possible to reject the word\n                    “half (1/2)” as afalsa\n                    demonstratio. The misdescription of the part of his interest in the\n                    Property did not prevent the Will taking effect in regard to Property in\n                    question, and the specific bequeath in clause 5 is not\n                vitiated. 17     The conclusion which I have thus far reached\n                    on the wording of the Will is confirmed by the evidence as to what the testator\n                    meant and intended by clause 5 of his Will. The evidence shows that the\n                    testator wanted to part with his interest in the Property. The misdescription of\n                    the testator’s interest is a mistake; one that was likely to be made in\n                    the circumstances in which the Will was drawn up and executed. I now turn to the\n                    evidence relating to the drafting of the Will. 18     On the cover page of the Will is the name of\n                    the law firm of Messrs Viyay & Co. Mr Tong informed the court that he\n                    had contacted Mr Narayanan Vijya Kumar (“Mr Vijya”), for\n                    his assistance in relation the Will drawn up by his firm. Mr Vijya filed an\n                    affidavit on 27thApril 2010. Unfortunately, the\n                    matters deposed in his affidavit were vague and, in fact, raised more questions\n                    than answers and his affidavit evidence did not assist in resolving the dispute\n                    before the court. I, therefore, allowed Mr Tong’s application to\n                    cross-examine Mr Vijya on his affidavit. 19     In the witness box, Mr Vijya disclosed\n                    that, at the material time, he was in India as his mother suddenly suffered a\n                    stroke, and as his testimony unfolded, it became clear that his secretary, one\n                    Helen Tan (“Helen”), took the testator’s instructions on his\n                    will and it was she who drew up the draft that was sent to the testator’s\n                    son, Soh Eng Beng, for the testator’s consideration. There were apparently\n                    amendments to the draft. Presumably, the amendments were attended to by Helen.\n                    In his affidavit, Mr Vijya deposed that he has no record of any documents\n                    or file relating to the Will. In cross-examination, Mr Vijya confirmed that\n                    no attendance notes were taken by Helen or anyone else. As shown on the Will,\n                    Helen and her colleague, Zalinah Kamis, witnessed the testator’s execution\n                    of the Will after Helen explained the contents of the Will in Hokkien to the\n                    testator. From Mr Vijya’s evidence, we learn that\n                    Mr Vijya’s friend, Mr Lukshumayeh, an advocate & solicitor,\n                    who would help out Mr Vijya’s firm in his absence, has no\n                    recollection of his involvement with this Will. I think it is fair to conclude\n                    that after taking the testator’s instructions, Helen drew up the Will,\n                    explained in the Hokkien dialect the contents of the Will to the testator who\n                    signed it thereafter in her presence and that of her colleague. 20     In arguing for the interpretation subscribed\n                    by the Applicant’s, Mr Tong submits that there is no evidence that\n                    the testator meant to give his entire share in the Property to the three named\n                    beneficiaries, and that there was further, no evidence that Helen Tan did not\n                    take his instructions properly, or had made a mistake in the drafting of the\n                    Will. Therefore, clause 5 should thus be interpreted in such a way that\n                    half of the testator’s interest in the Property be divided among the three\n                    named beneficiaries, and the remaining half to go towards the residuary estate\n                    to be divided equally among the testator’s ten children. 21     I concluded for the reasons given that the\n                    testator’s interest in the Property was misdescribed in clause 5. As\n                    the testator had indeed owned a half-share in the property known as No. 25\n                    Lorong 4 Geylang, which was the subject matter in clause 4 of the Will, it\n                    would not be implausible for the draftsman to have copied the wording of\n                    clause 4 for clause 5, and to have simply changed the address of the\n                    property in question before typing out the names of the three beneficiaries and\n                    their respective shares in percentage terms. I noticed that the words\n                    “half (1/2) share” were in bold print in clause 4 but not in\n                    clause 5. The significance of that, if any, is a matter of speculation. Be\n                    that as it may, we now know it was Helen who drew up the Will. The likelihood of\n                    a mistake being committed was all the more probable without the apparent benefit\n                    of legal supervision or review of her work which on the face of the document\n                    contained an error in the spelling of the name of Soh Lai Yim. The other\n                    mistake, as I have found, is in the description of the testator’s share as\n                    co-owner of the Property.",
        "Conclusion": "22     For the reasons stated, the Will is construed\n                    as contended for by the Respondent. Since the construction issue is resolved in\n                    favour of the Respondent, the issue of rectification no longer remains a\n                    “live” issue save for the misspelling of the name of the third\n                    beneficiary which ought to be spelt as “Soh Lai Yim” and not\n                    “Soh Lai Ying”. However, since I have concluded that the primary\n                    wish of the testator in clause 5 of the Will is to bequeath his entire\n                    interest in the Property, the misdescription of the testator’s interest is\n                    best removed. I therefore order clause 5 be rectified to the extent that\n                    the word “half” be deleted from clause 5, such that it\n                    reads: I devise and bequeath my share of the property known as31C Lorong 34 Geylang, Singaporeto my following children:\n                        - (a)   SOH ENG GUAN (NRIC No. [xxx]) – 35% (b)   SOH ENG KOON (NRIC No. [xxx]) – 35% (c)   SOH LAI YIM (NRIC No. [xxx]) – 30%. On costs, I order that the estate pays the Respondent’s costs of\n                    OS 48/2010 and Summons No 1566 of 2010 to be taxed, if not agreed. 23     It remains to be said that these proceedings\n                    highlight some professional shortcomings, and it is appropriate that I draw\n                    attention to the timely reminder by Chan Sek Keong CJ inChee Mu Lin Muriel v Chee Ka Lin Caroline[2010] SGCA 27 (“Chee\n                        Muriel”)at [60]: ... solicitors who undertake the task of preparing wills and/or witnessing\n                        the execution of wills must take the necessary precautions or steps in order\n                        to fulfil their duties to their clients. The precautions are not complicated\n                        nor are they time consuming. In any case, as solicitors, they must do what\n                        is required, however complicated or difficult the task may be. The central\n                        task is to ensure that the terms of the will reflect the wishes of the\n                        testator. 24     Some of the precautions noted by Chan CJ\n                    in [60] “as a matter of good professional practice, if not professional\n                    prudence”, is that “the solicitor should make a contemporary\n                    written record of his or her attendances on the testator so that he or she would\n                    be able to recall exactly what had transpired during the meeting or\n                    meetings”. 25     It is also helpful to close this discourse on\n                    the proper discharge of professional responsibilities in drawing up a Will by\n                    quoting an apt warning inLow Ah Cheow and others v Ng Hock\n                        Guan[2009] 3 SLR(R) 1079 at [73], which was cited inChee Muriel(at [61]): The preparation of a will involves serious professional responsibilities,\n                        which solicitors must uncompromisingly observe and discharge. Regrettably,\n                        it seems to us that, all too often nowadays, solicitors appear to consider\n                        the preparation of a will to be no more than a routine exercise in form\n                        filling. This iswrong. Before preparing a\n                        will, the solicitor concerned ought to have a thorough discussion with the\n                        testator on all the possible legal issues and potential complications that\n                        might arise in the implementation of the terms of the will. The solicitor\n                        ought to painstakingly and accurately document his discussions with and his\n                        instructions from the testator. He should also confirm with the testator,\n                        prior to the execution of the will, that the contents of the will as drafted\n                        accurately express the latter’s intention. A translation, if required,\n                        must be thoroughly and competently done. Half measures or the cutting of\n                        corners in the discharge of these serious professional responsibilities will\n                        not do. [emphasis in original]"
    }
}