{
    "case_title": "Re Soo Ngak Hee",
    "ncitation": "[2010] SGHC 256",
    "coram": "Judith Prakash J",
    "sections": {
        "Introduction": "1       This matter came before me on the application of\n                    Mr Soo Ngak Hee (the “Applicant”) for a declaration that his\n                    younger brother, Mr Soh Ngak Wee (“SNW”) be presumed dead. The\n                    application was made on the basis that SNW had disappeared and had not been seen\n                    by any member of his family since April 2001. I granted the application and now\n                    wish to give the reasons for my decision.",
        "Facts": "2       The facts stated in this judgment are taken from\n                    the affidavits filed by the following members of SNW’s family: his mother,\n                    Mdm Ong Ah Kiau, his sisters Ms Soh Geok Cheng and Ms Soh Moey\n                    Khia, and the Applicant himself. 3       SNW was born on 19 November 1953. After\n                    completing his education, he worked as a manual labourer. Prior to the year\n                    2000, SNW was working in a shipyard and, for a while, he was living in rented\n                    accommodation with a friend. He was not married. Sometime in 2000, SNW suffered\n                    a stroke and fell and had trouble walking thereafter. As a result, he lost his\n                    job and did not manage to find another one. He then moved back to live with his\n                    parents. From then on, he was unemployed and was supported by his\n                    siblings. 4       A few months after losing his job, on\n                    28 October 2000, SNW was admitted to the Institute of Mental Health by the\n                    police when he was found making a lot of noise in a public place. He was\n                    apparently stressed and depressed about a prospective change of residence. The\n                    Applicant took SNW out of the hospital three days later as the family felt that\n                    he would be better off at home. About two months later, SNW and his parents\n                    moved to Block 264, Jurong East Street 24, #04-521, Singapore (“the\n                    flat”). The flat is held in the joint names of Mdm Ong and\n                    SNW. 5       On 14 March 2001, Mdm Ong and SNW made\n                    joint wills. This was done at SNW’s suggestion. In both wills, Ms Soh\n                    Geok Cheng was appointed sole Executrix and Trustee. In his will, SNW stated\n                    that upon his death, his share in the flat should be given to Mdm Ong but\n                    that if Mdm Ong should predecease him, then the flat should be given to\n                    Ms Soh Geok Cheng. Mdm Ong’s will stated that upon her death,\n                    the flat should be given to SNW but if he should predecease her, then it should\n                    go to Ms Soh Geok Cheng. 6       According to Mdm Ong, SNW left home on\n                    14 April 2001 at about 7.30am and did not return that night or thereafter.\n                    Subsequent checks revealed that he had not taken any of his personal belongings\n                    with him, including his passport. He had with him only the clothes on his back,\n                    his IC and whatever little cash he then had in his wallet. 7       A week after SNW’s disappearance,\n                    Mdm Ong contacted the Applicant and told him that SNW had been missing for\n                    a week. The Applicant began searching for SNW. Acting on a tip from two of\n                    SNW’s friends, the Applicant visited the Jalan Bahar cemetery. SNW had a\n                    vegetable plot there which he tended daily. The Applicant did not find SNW at\n                    the cemetery although he noted that the latter’s motorcycle had been\n                    abandoned there. The Applicant walked around the cemetery for a few hours but\n                    there was no trace of SNW. 8       SNW did not return home or contact any of his\n                    siblings over the next few weeks. On 24 May 2001, the Applicant made a police\n                    report about SNW having gone missing. The police refused to accept the report\n                    until they had confirmed that SNW was not in prison, in any hospital or the\n                    Institute of Mental Health. The police made immediate checks with these\n                    institutions and then informed the Applicant that SNW could not be located in\n                    any of them. Until today, the police have not been able to trace\n                SNW. 9       In July 2007, the Applicant placed an\n                    advertisement in the Lian He Zao Bao newspaper in an attempt to trace SNW. There\n                    was no response to this advertisement. The Applicant also returned to the\n                    cemetery about seven years after SNW’s disappearance. He found that the\n                    land had been cleared for redevelopment and the motorcycle had\n                    disappeared. 10     In his affidavit made in July 2010, the\n                    Applicant stated that there were no further avenues that he could pursue to\n                    search for SNW. None of the members of SNW’s family had had any contact\n                    with SNW for the past nine years. They had absolutely no knowledge of his\n                    whereabouts. 11     The Applicant was of the view that it was\n                    abnormal for SNW to have ceased contact with his siblings and his parents\n                    (SNW’s father died only in 2009). SNW had relied on his family for\n                    financial support and was close to Mdm Ong. There were no family quarrels\n                    and thus it was very strange that he had not contacted them in the previous nine\n                    years and had not enquired about Mdm Ong to whom he was close. This opinion\n                    was echoed by SNW’s two sisters who both described him as being a quiet\n                    and home-loving person. 12     The Applicant explained the reason for the\n                    application. As Mdm Ong is now 84 years old, the Applicant wished to obtain\n                    an order for presumption of death so that in the event of her demise, the flat\n                    would not be left in limbo with SNW as the permanently absent owner of the\n                    flat. 13     On the above facts, the question that I had to\n                    answer was whether there was sufficient evidence for me to make an order that\n                    SNW be presumed to be dead.",
        "The Evidence Act": "14     There are two sections in the Evidence Act\n                    (Cap 97, 1997 Rev Ed) (“the Act”) which deal with the\n                    presumption of death,viz, ss 109 and 110.\n                    These provide: Burden of proving death of person known to have been\n                            alive within 30 years 109.    When the question\n                            is whether a man is alive or dead, and it is shown that he was alive\n                            within 30 years, the burden of proving that he is dead is on the person\n                            who affirms it. Burden of proving that person is alive who has not been\n                            heard of for 7 years 110.    When the question\n                            is whether a man is alive or dead, and it is proved that he has not been\n                            heard of for 7 years by those who would naturally have heard of him if\n                            he had been alive, the burden of proving that he is alive is shifted to\n                            the person who affirms it. 15     InRe Wong Sook Mun\n                        Christina[2005] 3 SLR(R) 329;\n                    [2005] SGHC 100 (“Christina\n                    Wong”), the High Court held that s 110 is a proviso to\n                    s 109. Section 109 applies to impose the burden of proof on an applicant\n                    who asserts that a person is dead, if that person has been alive within the past\n                    30 years (as in the present case). However, if such person has not been heard of\n                    for seven years by those who would naturally have heard of him, s 110 would\n                    then apply to shift the burden of proof back to any person who asserts that the\n                    person concerned is still alive. If there is no one interested in asserting that\n                    the person concerned is alive, however, s 110 can apply in order to\n                    establish the presumption of the fact of death, though not to establish the\n                    particular time of death:Christina Wongat [14] -\n                    [19].Christina Wongfollowed the approach taken\n                    in the Malaysian case ofRe Osman bin Bachit[1997] 4 MLJ 445 (“Osman bin\n                        Bachit”). 16     Therefore, in a case where the alleged\n                    deceased has not been heard of for seven years by persons who would naturally\n                    have heard of him, an applicant for a declaration of death can rely on\n                    s 110 to invoke the presumption of death because the presumption of\n                    continuance of life which s 109 contains would have ended. 17     On a plain reading of s 110, there are\n                    two elements required to shift the burden of proof to one who asserts\n                    continuance of life: (a)The person must not have been heard of for seven\n                            years; and(b)The person must not have been heard of by those\n                            who would naturally have heard of him if he had been\n                        alive.These elements were also referred to inChristina\n                        WongandOsman bin Bachit. The\n                    question that arises is whether there is a third element,ie, that the applicant must show that sufficient steps have been\n                    taken to ascertain whether the person is alive. This requirement does not appear\n                    on the wording of s 110 but is a common law principle that was read into\n                    s 110 inChristina Wong(at [30]) to prevent\n                    the section being abused as “a device of convenience” where proof\n                    of a person’s death by another means exists.Are the requirements satisfied?18     The first requirement that the alleged\n                    deceased must have not been heard of for seven years was clearly satisfied in\n                    this case: SNW had been missing for more than nine years.19     The second requirement was that SNW should not\n                    have been heard of by those who would naturally have heard of him, if he had\n                    been alive. The category of “those who would naturally have heard\n                    of” the deceased if he had been alive would usually comprise persons\n                    related to the deceased “by virtue of blood or marital ties:Christina Wongat [23]. InOsman bin\n                        Bachit(at 448) the court referred to the English case ofDoe d’France v Andrews(1850)\n                    15 QBD 756 and held that such persons would be “close relatives\n                    or neighbours”.20     In the situation where the alleged deceased\n                    had an estranged relationship with his family such that he would want nothing to\n                    do with them, however, the family would not fall into the category of persons\n                    who would “naturally have heard of” him. Such was the case inChristina Wongwhere the judge found that\n                    there had been an “irreparable rent in the fabric of familial\n                    relations” (at [23]). There, the applicant’s father was totally\n                    estranged from his wife and children in Singapore and, from his conduct,\n                    appeared to want to have nothing more to do with them. Thus, the court held that\n                    the applicant and her family could not fall into the category of persons\n                    mentioned in s 110. That being the case, s 110 could not be used to\n                    assist the applicant inChristina\n                Wong.21     The circumstances here were different. I was\n                    satisfied that SNW had good relationship with his parents and siblings prior to\n                    his disappearance. He was especially close to his mother and was living with\n                    her. He was on good terms with the Applicant and his sisters and depended on\n                    them financially. There were no family quarrels prior to SNW’s\n                    disappearance. He was not married and did not have any girlfriends and was not\n                    close to his relatives outside the immediate family circle. I was satisfied that\n                    the evidence established, on a balance of probabilities, that if SNW was alive\n                    he would contact his siblings and parents. This was clearly a case where there\n                    were people who would naturally have heard of the alleged deceased if he had\n                    been alive, yet they had not heard of him for more than seven years. The second\n                    requirement was therefore established.22     The next point was whether I should go on to\n                    consider if the Applicant had fulfilled the third requirement posited inChristina Wong, that of making sufficient\n                    enquiries to ascertain whether SNW was alive. This was a common law requirement\n                    as can be seen from the case ofChard v Chard (Orse.\n                        Northcott), Haye, Winstanley, Lord and Norris[1956] P 259 where Sachs J stated at 270 and 272:I respectfully agree with Harman J.’s conclusion inIn re Watkins[1953] 1 W.L.R. 1323 that,\n                        where no statue applies, there is no “magic” in the mere fact\n                        of a period of seven years elapsing without there being positive evidence of\n                        a person being alive. It is, generally speaking, a matter in each case of\n                        taking the facts as a whole and of balancing, as a jury would, the\n                        respective probabilities of life continuing and having ceased.[...]My view is thus that in matters where no statute lays down an applicable\n                        rule, the issue of whether a person is, or is not to be presumed dead, is\n                        generally speaking one of fact and not subject to a presumption of\n                        law.To that there is an exception which can be assumed without affecting the\n                        present case. By virtue of a long sequence of judicial statements, which\n                        either assert or assume such a rule, it appears accepted that there is a\n                        convenient presumption of law applicable to certain cases of seven\n                        years’ absence where no statue applies. That presumption in its modern\n                        shape takes effect (without examining its terms too exactly) substantially\n                        as follows. Where as regards “A.B.” there is no acceptable\n                        affirmative evidence that he was alive at some time during a continuous\n                        period of seven years or more, then if it can be proved first, that there\n                        are persons who would be likely to have heard of him over that period,\n                        secondly that those persons have not heard of him, and thirdly that all due\n                        inquiries have been made appropriate to the circumstances,\n                        “A.B.” will be presumed to have died at some time within that\n                        period. (Such a presumption would, of course be one of law, and could not be\n                        one of fact, because there can hardly be a logical inference from any\n                        particular set of facts that a man had not died within 2,555 days but had\n                        died within 2,560.)23     InChristina\n                        Wong, Andrew Phang JC (as he then was) recognised that the\n                    third requirement was not statutorily imposed in Singapore but considered that\n                    it should be adhered to as a matter set down by common law:30    In any event, however, it was clear to me that, on\n                            the facts of the present case, the applicant had not taken sufficient\n                            steps to ascertain whether or not her father was still alive. It is true\n                            that, on a literal construction of s 110 itself, it might be argued\n                            that that provision does not include this particular requirement. At\n                            common law, however, it appears clear that this is indeed a requirement\n                            [...] It appears to me that both logic and common sense (as well as the\n                            common law from which the present provision was in fact derived) suggest\n                            that such a requirement ought to be incorporated as part of s 110\n                            itself, and this view appears to have been confirmed in the Malaysian\n                            context (see the Malaysian High Court decision ofRe\n                                Gun Soon Thin[1997] 2 MLJ 351 at 359). Such an\n                            approach acknowledges that the operation of s 110 is not one-sided,\n                            so to speak. Indeed, an extreme example occurs where it is sought to\n                            invoke s 110 where another method for proving the death of a\n                            particular individual clearly exists. Such a use of s 110 as a\n                            device of convenience may in fact border on abuse and cannot be\n                            permitted, as the Singapore High Court decision ofLim Ah Khee v Legal Representative of the Estate of Ong Koh\n                                Tee,deceased[1994]\n                            2 SLR 769 clearly illustrates.24     With due respect, I do not find it necessary\n                    to add the third requirement as a compulsory requirement which has to be\n                    fulfilled before a court can hold that the burden of proving that an alleged\n                    deceased person is still alive has shifted to those asserting that fact. To me,\n                    it would all depend on the circumstances before the court as to whether it\n                    should require any particular applicant to fulfil the third requirement before\n                    applying the presumption. InChristina Wong, the\n                    second requirement of s 110 had not been fulfilled so it was not possible\n                    to invoke the aid of that section and the applicant had to in fact prove her\n                    father’s death. In those circumstances, clearly all due and sufficient\n                    steps and inquiries needed to be made to establish that fact. To the extent that\n                    the judgment inChristina Wongimplies that such\n                    inquiries are invariably necessary before s 110 can be invoked, I consider\n                    the holding to beobiter.25     I was, in any case, satisfied that the\n                    Applicant here had made sufficient inquiries and taken sufficient steps to\n                    establish whether SNW was still alive. He did the following:(a)     When he knew that SNW had gone\n                        missing, he contacted the two friends he knew that SNW had, and asked them\n                        if they had been in touch with him, and if they knew where he could be. They\n                        replied that they had not heard from him, but suggested he search in Jalan\n                        Bahar cemetery, which was where SNW went regularly to tend his vegetable\n                        plot. Sometime in late April 2001/early May 2001, the Applicant searched the\n                        whole perimeter of the cemetery, to no avail. He only found SNW’s\n                        motorcycle.(b)     The\n                        Applicant lodged a police report on SNW’s disappearance on 24 May\n                        2001. The police ran a check on their computer network to search for records\n                        of SNW in the hospitals, prisons and the Institute of Mental Health. Their\n                        check did not yield any positive results. The police have not been able to\n                        locate SNW to date.(c)     The Applicant placed a missing person advertisement in the Chinese\n                        daily newspaper, “Lianhe Zaobao”, on 14 July 2007 but no\n                        responses were received.(d)     The Applicant also returned to the cemetery in 2008 to\n                        search for SNW but found the motorcycle gone and the land cleared for\n                        redevelopment.(e)     An Internet search on the Google search engine did not give any positive\n                        hits.26     I agreed with counsel’s submission that\n                    the Applicant and his family had done all that could reasonably be expected to\n                    be done in this regard, given their knowledge of SNW’s acquaintances,\n                    routine and habits. There were no other leads they could follow. The situation\n                    here was quite different from that inChristina\n                        Wongwhere the alleged deceased had emigrated to the United\n                    States and where the judge held that various efforts made to trace him in the\n                    United States were token efforts and insufficient.27     I was also buttressed in my decision by the\n                    English case ofBullock v Bullock[1960]\n                    1 WLR 975 wherenoefforts were made by\n                    the wife to look for the husband yet the court proceeded to make a declaration\n                    that the husband be presumed dead. In that case, the wife had gone to court and\n                    obtained a committal order against the husband in relation to a matrimonial\n                    dispute. The police were enlisted to search for the husband, and failed to find\n                    him. The court held that the applicant wife had made sufficient inquiries to\n                    find her husband by going to court and enlisting the police to find her husband,\n                    and that she could “be excused for not having any hope of succeeding\n                    where the police have failed” (perCollingwood J at 982). I would simply add that the sufficiency of the steps\n                    taken to locate an alleged deceased must always be a question of what is\n                    reasonable in the circumstances of the case having regard to the characteristics\n                    of the alleged deceased, the circumstances in which he disappeared and the\n                    circumstances relating to his relationships with friends and\n                family.Conclusion28     The facts before me showed that SNW appeared\n                    depressed at the time of his disappearance. A year earlier, he had suffered a\n                    stroke which caused him difficulty in walking and to lose his job. He was unable\n                    to find another job and was forced to move back to live with his parents and to\n                    depend financially on his siblings. He had made a will about a month before he\n                    disappeared and it is possible that he was preparing for his death. In any\n                    event, his sudden disappearance from the home which he jointly owned, without\n                    taking any of his personal belongings or his passport and without any cause to\n                    leave, was inexplicable. He had no financial resources which would have allowed\n                    him to live on his own. Yet for nine years after his disappearance, nothing more\n                    was heard of him. It appeared to me, on a balance of probabilities, that he must\n                    have died sometime during that period.",
        "Are the requirements satisfied?": "18     The first requirement that the alleged\n                    deceased must have not been heard of for seven years was clearly satisfied in\n                    this case: SNW had been missing for more than nine years. 19     The second requirement was that SNW should not\n                    have been heard of by those who would naturally have heard of him, if he had\n                    been alive. The category of “those who would naturally have heard\n                    of” the deceased if he had been alive would usually comprise persons\n                    related to the deceased “by virtue of blood or marital ties:Christina Wongat [23]. InOsman bin\n                        Bachit(at 448) the court referred to the English case ofDoe d’France v Andrews(1850)\n                    15 QBD 756 and held that such persons would be “close relatives\n                    or neighbours”. 20     In the situation where the alleged deceased\n                    had an estranged relationship with his family such that he would want nothing to\n                    do with them, however, the family would not fall into the category of persons\n                    who would “naturally have heard of” him. Such was the case inChristina Wongwhere the judge found that\n                    there had been an “irreparable rent in the fabric of familial\n                    relations” (at [23]). There, the applicant’s father was totally\n                    estranged from his wife and children in Singapore and, from his conduct,\n                    appeared to want to have nothing more to do with them. Thus, the court held that\n                    the applicant and her family could not fall into the category of persons\n                    mentioned in s 110. That being the case, s 110 could not be used to\n                    assist the applicant inChristina\n                Wong. 21     The circumstances here were different. I was\n                    satisfied that SNW had good relationship with his parents and siblings prior to\n                    his disappearance. He was especially close to his mother and was living with\n                    her. He was on good terms with the Applicant and his sisters and depended on\n                    them financially. There were no family quarrels prior to SNW’s\n                    disappearance. He was not married and did not have any girlfriends and was not\n                    close to his relatives outside the immediate family circle. I was satisfied that\n                    the evidence established, on a balance of probabilities, that if SNW was alive\n                    he would contact his siblings and parents. This was clearly a case where there\n                    were people who would naturally have heard of the alleged deceased if he had\n                    been alive, yet they had not heard of him for more than seven years. The second\n                    requirement was therefore established. 22     The next point was whether I should go on to\n                    consider if the Applicant had fulfilled the third requirement posited inChristina Wong, that of making sufficient\n                    enquiries to ascertain whether SNW was alive. This was a common law requirement\n                    as can be seen from the case ofChard v Chard (Orse.\n                        Northcott), Haye, Winstanley, Lord and Norris[1956] P 259 where Sachs J stated at 270 and 272: I respectfully agree with Harman J.’s conclusion inIn re Watkins[1953] 1 W.L.R. 1323 that,\n                        where no statue applies, there is no “magic” in the mere fact\n                        of a period of seven years elapsing without there being positive evidence of\n                        a person being alive. It is, generally speaking, a matter in each case of\n                        taking the facts as a whole and of balancing, as a jury would, the\n                        respective probabilities of life continuing and having ceased. [...] My view is thus that in matters where no statute lays down an applicable\n                        rule, the issue of whether a person is, or is not to be presumed dead, is\n                        generally speaking one of fact and not subject to a presumption of\n                        law. To that there is an exception which can be assumed without affecting the\n                        present case. By virtue of a long sequence of judicial statements, which\n                        either assert or assume such a rule, it appears accepted that there is a\n                        convenient presumption of law applicable to certain cases of seven\n                        years’ absence where no statue applies. That presumption in its modern\n                        shape takes effect (without examining its terms too exactly) substantially\n                        as follows. Where as regards “A.B.” there is no acceptable\n                        affirmative evidence that he was alive at some time during a continuous\n                        period of seven years or more, then if it can be proved first, that there\n                        are persons who would be likely to have heard of him over that period,\n                        secondly that those persons have not heard of him, and thirdly that all due\n                        inquiries have been made appropriate to the circumstances,\n                        “A.B.” will be presumed to have died at some time within that\n                        period. (Such a presumption would, of course be one of law, and could not be\n                        one of fact, because there can hardly be a logical inference from any\n                        particular set of facts that a man had not died within 2,555 days but had\n                        died within 2,560.) 23     InChristina\n                        Wong, Andrew Phang JC (as he then was) recognised that the\n                    third requirement was not statutorily imposed in Singapore but considered that\n                    it should be adhered to as a matter set down by common law: 30    In any event, however, it was clear to me that, on\n                            the facts of the present case, the applicant had not taken sufficient\n                            steps to ascertain whether or not her father was still alive. It is true\n                            that, on a literal construction of s 110 itself, it might be argued\n                            that that provision does not include this particular requirement. At\n                            common law, however, it appears clear that this is indeed a requirement\n                            [...] It appears to me that both logic and common sense (as well as the\n                            common law from which the present provision was in fact derived) suggest\n                            that such a requirement ought to be incorporated as part of s 110\n                            itself, and this view appears to have been confirmed in the Malaysian\n                            context (see the Malaysian High Court decision ofRe\n                                Gun Soon Thin[1997] 2 MLJ 351 at 359). Such an\n                            approach acknowledges that the operation of s 110 is not one-sided,\n                            so to speak. Indeed, an extreme example occurs where it is sought to\n                            invoke s 110 where another method for proving the death of a\n                            particular individual clearly exists. Such a use of s 110 as a\n                            device of convenience may in fact border on abuse and cannot be\n                            permitted, as the Singapore High Court decision ofLim Ah Khee v Legal Representative of the Estate of Ong Koh\n                                Tee,deceased[1994]\n                            2 SLR 769 clearly illustrates. 24     With due respect, I do not find it necessary\n                    to add the third requirement as a compulsory requirement which has to be\n                    fulfilled before a court can hold that the burden of proving that an alleged\n                    deceased person is still alive has shifted to those asserting that fact. To me,\n                    it would all depend on the circumstances before the court as to whether it\n                    should require any particular applicant to fulfil the third requirement before\n                    applying the presumption. InChristina Wong, the\n                    second requirement of s 110 had not been fulfilled so it was not possible\n                    to invoke the aid of that section and the applicant had to in fact prove her\n                    father’s death. In those circumstances, clearly all due and sufficient\n                    steps and inquiries needed to be made to establish that fact. To the extent that\n                    the judgment inChristina Wongimplies that such\n                    inquiries are invariably necessary before s 110 can be invoked, I consider\n                    the holding to beobiter. 25     I was, in any case, satisfied that the\n                    Applicant here had made sufficient inquiries and taken sufficient steps to\n                    establish whether SNW was still alive. He did the following: (a)     When he knew that SNW had gone\n                        missing, he contacted the two friends he knew that SNW had, and asked them\n                        if they had been in touch with him, and if they knew where he could be. They\n                        replied that they had not heard from him, but suggested he search in Jalan\n                        Bahar cemetery, which was where SNW went regularly to tend his vegetable\n                        plot. Sometime in late April 2001/early May 2001, the Applicant searched the\n                        whole perimeter of the cemetery, to no avail. He only found SNW’s\n                        motorcycle. (b)     The\n                        Applicant lodged a police report on SNW’s disappearance on 24 May\n                        2001. The police ran a check on their computer network to search for records\n                        of SNW in the hospitals, prisons and the Institute of Mental Health. Their\n                        check did not yield any positive results. The police have not been able to\n                        locate SNW to date. (c)     The Applicant placed a missing person advertisement in the Chinese\n                        daily newspaper, “Lianhe Zaobao”, on 14 July 2007 but no\n                        responses were received. (d)     The Applicant also returned to the cemetery in 2008 to\n                        search for SNW but found the motorcycle gone and the land cleared for\n                        redevelopment. (e)     An Internet search on the Google search engine did not give any positive\n                        hits. 26     I agreed with counsel’s submission that\n                    the Applicant and his family had done all that could reasonably be expected to\n                    be done in this regard, given their knowledge of SNW’s acquaintances,\n                    routine and habits. There were no other leads they could follow. The situation\n                    here was quite different from that inChristina\n                        Wongwhere the alleged deceased had emigrated to the United\n                    States and where the judge held that various efforts made to trace him in the\n                    United States were token efforts and insufficient. 27     I was also buttressed in my decision by the\n                    English case ofBullock v Bullock[1960]\n                    1 WLR 975 wherenoefforts were made by\n                    the wife to look for the husband yet the court proceeded to make a declaration\n                    that the husband be presumed dead. In that case, the wife had gone to court and\n                    obtained a committal order against the husband in relation to a matrimonial\n                    dispute. The police were enlisted to search for the husband, and failed to find\n                    him. The court held that the applicant wife had made sufficient inquiries to\n                    find her husband by going to court and enlisting the police to find her husband,\n                    and that she could “be excused for not having any hope of succeeding\n                    where the police have failed” (perCollingwood J at 982). I would simply add that the sufficiency of the steps\n                    taken to locate an alleged deceased must always be a question of what is\n                    reasonable in the circumstances of the case having regard to the characteristics\n                    of the alleged deceased, the circumstances in which he disappeared and the\n                    circumstances relating to his relationships with friends and\n                family.",
        "Conclusion": "28     The facts before me showed that SNW appeared\n                    depressed at the time of his disappearance. A year earlier, he had suffered a\n                    stroke which caused him difficulty in walking and to lose his job. He was unable\n                    to find another job and was forced to move back to live with his parents and to\n                    depend financially on his siblings. He had made a will about a month before he\n                    disappeared and it is possible that he was preparing for his death. In any\n                    event, his sudden disappearance from the home which he jointly owned, without\n                    taking any of his personal belongings or his passport and without any cause to\n                    leave, was inexplicable. He had no financial resources which would have allowed\n                    him to live on his own. Yet for nine years after his disappearance, nothing more\n                    was heard of him. It appeared to me, on a balance of probabilities, that he must\n                    have died sometime during that period."
    }
}