{
    "case_title": "Cooperatieve Centrale Raiffeisen-Boerenleenbank BA (trading as Rabobank\n                International), Singapore Branch\n      v\n      Motorola Electronics Pte Ltd",
    "ncitation": "[2010] SGHC 70",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "Introduction": "1       This case is a unique situation where the law of\n                    set-off meets the law of assignment, involving a curious creature known as a\n                        ‘tripartitecontractual set off\n                    agreement’ and the notion of a ‘silent assignment’ that was\n                    manifested in a facultative agreement to assign. Commercial men, either due to\n                    lack of foresight or diligence or good legal advice or whatever, sometimes fail\n                    to appreciate or underestimate the risks involved in the transactions they enter\n                    into or the omissions they make in relation thereto. With specific reference to\n                    the law of assignment, this case is an example of what can go wrong when no\n                    timely notice of assignment to the debtor is given by the assignee of a\n                    debt. 2       In this dispute, Motorola Electronics Pte Ltd\n                    (“the defendant”) is a company incorporated in Singapore and\n                    carries on the business of manufacturing and selling telecommunications\n                    equipment. Both the defendant and another Singapore company called Motorola\n                    Trading Center Pte Ltd (‘MTC’) are wholly-owned subsidiaries of\n                    Motorola Inc., a company listed on the New York Stock Exchange of the United\n                    States of America. 3       Cooperatieve Centrale Raiffeisen-Boerenleenbank\n                    B.A. (“the plaintiff”) is the Singapore branch of a bank\n                    incorporated in the Netherlands and it carries on banking business generally\n                    including the provision of corporate and investment banking\n                services. 4       The plaintiff claimed against the defendant the\n                    sum of US$5,178,212.41, which represented the total net value of receivables\n                    under invoices which were issued by Jurong Hi-Tech (‘JHT’) to the\n                    defendant, and which had been subsequently assigned by Jurong Hi-Tech Industries\n                    Pte Ltd (‘JHTI’) to the plaintiff. JHT is a sole proprietorship\n                    owned by JHTI. JHTI was a company engaged in the assembly of printed circuit\n                    boards and electronics and the manufacture of plastic and metal precision\n                    components. JHTI has been under judicial management since 20 February 2009.\n                    Both JHT and JHTI were subsidiaries of a listed entity called Jurong\n                    Technologies Industrial Corporation which itself is under judicial\n                    management.",
        "The Facts": "5       JHTI had been manufacturing electronic products\n                    for the defendant since 2003. The products include printed circuit board\n                    assemblies and modules which were used in the manufacture of Motorola\n                    telecommunications equipment. The defendant’s position was that since\n                    2003, the defendant would set-off on a monthly basis, amounts due to it for the\n                    materials it supplied to JHTI, against amounts it owed to JHTI for electronic\n                    products which JHTI had manufactured for the defendant. 6       On 28 July 2004, the defendant and JHTI\n                    entered into an agreement known as the Manufacturing and Assembly Agreement\n                    (“MAA”), under which JHTI agreed to manufacture electronic\n                    products for the defendant using materials and components purchased from the\n                    defendant and/or other suppliers approved by the defendant. 7       Under cl 2.1 of the MAA, JHTI would\n                    purchase all materials and components required for manufacturing from suppliers\n                    as so notified by the defendant. Notwithstanding this clause, the defendant\n                    reserved the right to require JHTI to purchase requisite materials from the\n                    defendant directly, under the same clause. 8       Clause 11.2 of the MAA which is a set-off\n                    provision states: Where Materials are purchased directly from Motorola [the defendant],\n                        Motorola shall have the right to offset payments due to it against amounts\n                        payable to the Contractor [JHTI] for such Materials. The payment shall be\n                        made in arrears against correct invoices issued by the Contractor for the\n                        same. 9       On 5 July 2005, MTC began to supply\n                    materials to, as well as purchase electronics products from, JHTI. MTC\n                    specialises in the “buy-sell” business of Motorola whereby MTC\n                    would buy raw materials in order to sell them to suppliers (such as JHTI in the\n                    present case) that manufacture electronic products. The products are then sold\n                    to various Motorola companies around the world. 10     The defendant’s position was that since\n                    5 July 2005, sums owing by the defendant and MTC were set off on a monthly\n                    basis (which typically took place in the last 10 days of each month) against\n                    sums owing by JHTI to the defendant and MTC; specifically, the accounts\n                    receivable of MTC arising from the sale of raw materials to JHTI were set off\n                    against the accounts payable of MTC and the defendant. 11     On 28 March 2006, Motorola Inc. and JHTI\n                    entered into a Manufacturing Services Agreement (‘MSA’) for JHTI to\n                    manufacture Motorola products. Under cll 6b and 6c of the MSA, JHTI was required\n                    to purchase materials from Motorola Inc. for the manufacture of Motorola\n                    products. There was no set-off provision in the MSA. The defendant submitted\n                    that the defendant and MTC were parties to the MSA as cl 2 therein\n                    stated: “Affiliate” means any corporation or other entity that\n                        controls, is controlled by, or is under common control with a party. A\n                        corporation or other entity shall be deemed to control another if it owns or\n                        controls more than fifty percent (50%) of the voting stock or other\n                        ownership interest of the corporation or entity. References herein to\n                        Motorola and Company shall be deemed to include references to their\n                        Affiliates unless otherwise specified or the context otherwise\n                        requires. 12     On 15 February 2007, the plaintiff and\n                    JHTI entered into a Master Receivables Purchase Agreement (‘MRPA’)\n                    to provide receivable financing facilities of up to US$20m to JHTI. The\n                    “Debtor” referred to in the agreement was the defendant, where the\n                    sums owing by the defendant to JHTI were the subject matter of the receivables\n                    under MRPA. Clause 2 of the MRPA stated: Subject to the terms and conditions of this Agreement, the Bank [the\n                        plaintiff] may from time to time be offered Receivables by the Company\n                        [JHTI] serving a Purchase Request [found in Schedule 1 of the MRPA] on the\n                        Bank and the Bank at its sole discretion may agree to acquire any of those\n                        Receivables. 13     Under cl 4 of the MRPA, the plaintiff would\n                    purchase receivables by its acceptance of the purchase request through the\n                    acceptance form in Schedule 2 of the document. Under cl 5.2, if a purchased\n                    receivable was unpaid, the plaintiff could look to JHTI for payment. Under cl\n                    11(c), JHTI represented itself as the legal and beneficial owner of each\n                    receivable offered for purchase and that JHTI had not assigned andinter alia, created any encumbrance over each receivable\n                    offered. 14     On or about 12 September 2008, the\n                    plaintiff decided to cease its commercial relationship with JHTI. On\n                    7 October 2008, the plaintiff decided not to accept from JHTI new purchase\n                    requests or grant further new drawings or allow a rollover of existing loans to\n                    the latter. On 13 November 2008, the plaintiff cancelled the receivables\n                    financing facilities extended to JHTI under the MRPA. 15     The plaintiff notified the defendant in\n                    writing of the assignments of the purchased receivables by way of a letter dated\n                    17 November 2008. It was not in dispute that the defendant received this\n                    letter on 25 November 2008. The letter dated 17 November 2008 had\n                    enclosed notifications of assignments variously dated between 31 July 2008\n                    and 29 September 2008. 16     The plaintiff wrote on 4 December 2008 to\n                    the defendant setting out the sums that were owing pursuant to the\n                    notifications. 17     The defendant acknowledged receipt of the\n                    letter dated 17 November 2008 in a letter dated 8 December 2008 to the\n                    plaintiff. 18     Subsequently, the plaintiff sent a letter\n                    dated 17 December 2008 to the defendant to enclose copies of further\n                    notifications because the plaintiff’s earlier letter dated\n                    17 November 2008 had omitted two notifications of the assignments of\n                    receivables dated 28 July 2008 and 18 August 2008.",
        "The evidence": "19     The defendant’s position was that the\n                    assignment of receivables between the plaintiff and JHTI was subject to an\n                    express or implied tripartite contractual set-off agreement between JHT, MTC and\n                    the defendant. The agreement was to set off sums owing by the defendant and MTC\n                    to JHTI, being payment for the sale by JHTI of electronic products, against sums\n                    owing by JHTI to the defendant and MTC, being payment for materials and\n                    components supplied by them to JHTI. Specifically, the defendant contended that\n                    the invoices which formed the subject matter of the assignment were part of a\n                    set-off which had taken place on 22 October 2008 and 21 November 2008,\n                    between the defendant, MTC and JHTI. 20     The plaintiff’s response was that there\n                    was no evidence to support the finding of such an agreement, express or implied\n                    and, that such an agreement was unsustainable in law specifically due to lack of\n                    mutuality. The plaintiff’s case 21     Tan Wah Yam (“Tan”) was/is the\n                    plaintiff’s chief credit analyst. Tan gave evidence that pursuant to the\n                    MRPA in [12], JHTI would from time to time present invoices (together with\n                    purchase requests) to the plaintiff for the purchase of receivables from the\n                    defendant. The plaintiff would purchase such receivables by way of credit\n                    advices accepting the respective purchase requests. 22     On 11 November 2008, Richard Lee Seow\n                    Hong (“Richard”), (the plaintiff’s managing-director for\n                    relationship management from August 2005 to September 2009) contacted Lim Buay\n                    Eng (“Pauline”), the Asia region credit director of the defendant\n                    (and an old contact of Richard). The ‘principal purpose’ of this\n                    call was to enquire who in the defendant’s organisation should the\n                    plaintiff’s notifications of assignment be sent. Richard recalled touching\n                    base with Pauline generally on the receivables due to JHTI from the defendant.\n                    In that conversation, Pauline had enquired what facilities had been granted,\n                    what were the amounts of the facilities and probed further into details of the\n                    facilities. Richard did not reveal very much for reasons of banker-customer\n                    confidentiality. 23     The plaintiff decided to give express notice\n                    of assignments to the defendant by its letters dated 17 November 2008 and\n                    17 December 2008. However, as the 17 November 2008 letter ‘had\n                    inadvertently omitted’ the two notifications of assignments dated\n                    28 July 2008 and 18 August 2008, the same were forwarded to the\n                    defendant in the plaintiff’s subsequent letter dated 17 December\n                    2008. 24     Richard recalled making two follow-up\n                    telephone calls to Pauline in November 2008. On 24 November, Pauline\n                    informed him that he could attention the notifications to one Ng Beng Chong\n                    (“Ng”), the then financial controller of the defendant (who has\n                    since left). 25     Richard’s position was that Ng had\n                    informed him in a telephone conversation that Ng was unaware of the assignments;\n                    and that Ng told him the defendant had no issues paying the monies due to JHTI\n                    into its bank account with the plaintiff so long as JHTI instructed accordingly.\n                    Ng informed Richard that a set-off arrangement was in place. After the\n                    conversation, Richard called JHTI’s finance director, Chung Siang Joon\n                    (“Chung”). Chung denied there was any set-off arrangement and told\n                    Richard that it was the defendant who had recently started imposing a set-off\n                    arrangement on its suppliers. Richard further contended that Chung had said that\n                    JHTI had been resisting, and would continue to resist all such set-off attempts\n                    from the defendant. 26     The plaintiff’s position was that in a\n                    meeting on 25 November 2008 between Tan, Richard, and representatives of\n                    JHTI, JHTI had informed the plaintiff that since October 2008, the defendant had\n                    liquidity problems and had stopped making payments on the receivables due to\n                    JHTI, and had unilaterally imposed a set-off arrangement to offset all\n                    receivables due to and from JHTI against the defendant. The plaintiff insisted\n                    in that meeting that no set-off was allowed as the assigned receivables belonged\n                    to the plaintiff. 27     On 3 December 2008, Tan and Richard had a\n                    meeting with JHTI’s representatives. Chung confirmed to the plaintiff that\n                    the defendant had not made payment as the defendant was at that time in\n                    discussions with JHTI on the set-off issue. The plaintiff reiterated in that\n                    meeting that no set-off was allowed as the assigned receivables belonged to the\n                    plaintiff. 28     On 5 December 2008, Tan, William Hendriks\n                    (the plaintiff’s then regional head) and Richard met with JHTI’s\n                    Chairperson Joyce Lin (“Joyce”). The plaintiff contended that\n                    Joyce explained that since about October 2008, the defendant had imposed the\n                    set-off arrangement on its suppliers due to the credit crunch. The plaintiff\n                    further contended that Joyce had assured their representatives that JHTI had not\n                    agreed to the defendant’s demands on the set-off\n                arrangement. 29     On 9 December 2008, Joyce informed Tan\n                    and Richard in a meeting that there may have been a mistake and that there was a\n                    set-off arrangement with the defendant. 30     The plaintiff’s position was that in\n                    none of the meetings (on 25 November, 3, 5 and 9 December 2008) had\n                    they been informed that the set-off arrangement involved MTC. The defendant’s case 31     Coimbatore Sahasranaman Lakshmanan\n                    (“Lakshmanan”) has been the finance manager of MTC since 2005.\n                    Prior to 2005, he was the cost accountant in the defendant company. At the\n                    defendant company, Lakshmanan had overseen the accounts payables and\n                    inter-company receivables of the defendant. Since 2005, Lakshmanan had been\n                    overseeing MTC’s accounts receivable and accounts payable. He testified\n                    that his scope of responsibility extended to overseeing the defendant-related\n                    accounting transactions. (N/E 125). Luo Chen (“Chen”) is the\n                    accounting manager of Motorola (China) Electronics Pte Ltd who took over the\n                    JHTI account from an ex-employee of the defendant Ng Cheng Soon, in October\n                    2008. Since then, Chen has been involved in three broad processes which involved\n                    the defendant, MTC and JHTI. The processes are the external reconciliation\n                    process, the internal reconciliation process, and the external set-off\n                    process. 32     Lakshmanan adduced evidence to show\n                    MTC’s involvement in forming a tripartite contractual set-off agreement\n                    since 5 July 2005. In his AEIC (at exhibit ‘CSL-12’),\n                    Lakshmanan produced a summary of records of payments that had been made by MTC\n                    to JHTI. 33     The monthly set-offs were either mutual (sums\n                    owing by the defendant to JHTI were set off against the sums owing by JHTI to\n                    the defendant), or cross-entity set-offs (sums owing by the defendant to JHTI\n                    were set off against the sums owing by JHTI to MTC). The cross-entity set-offs\n                    formed the bulk of the monthly set-offs. 34     Every month, Chen would send an email to Chai\n                    Lee, JHTI’s accountant, attaching a reconciliation statement that listed\n                    all outstanding invoices issued by JHTI to the defendant and MTC and outstanding\n                    invoices issued by the defendant and MTC to JHTI. Chai Lee would go through the\n                    statement, and if any inconsistencies arose, he would contact Chen. (The\n                    reconciliation statement for August 2008 was shown in exhibit\n                    ‘CSL-4’ of Lakshmanan’s AEIC). 35     After this external reconciliation process,\n                    all the invoices for which payment had fallen due from JHTI, MTC and the\n                    defendant would be removed from the reconciliation statement and put in a\n                    separate set-off statement. Before this set-off statement was sent to Chai Lee,\n                    a debit note would be raised by the defendant internally while a credit note\n                    would be raised by MTC internally, for the cross-entity set-offs to be\n                    approved. 36     A debit note request form would be raised by\n                    the defendant to set off amounts owing by the defendant to JHTI against amounts\n                    owing by JHTI to MTC. Chen testified that in order to simplify the procedure\n                    internally within the defendant’s organisation, he removed this\n                    requirement to have a debit note request form such that it had no effect on the\n                    external set-off arrangement with JHTI (see N/E 250). 37     A credit note would be raised by MTC for every\n                    set-off for accounting purposes. To set off sums owing by the defendant to JHTI\n                    against sums owing by JHTI to MTC, MTC would issue a credit note to JHTI. MTC\n                    would transfer to the defendant the sums owing by JHTI to MTC, such that JHTI\n                    would then be owing the said sums to the defendant. The said sums were then set\n                    off against monies owing by the defendant to JHTI. 38     The set-offs had to be approved by Lakshmanan,\n                    Ng and John Kozlowski (the overall financial controller of Motorola’s\n                    businesses in Asia). The monthly set-offs were reflected internally in the MTC\n                    accounts receivables set-off statement. This statement listed all invoices and\n                    credit notes issued by MTC to JHTI. An example of such statements for the months\n                    of April to December 2008 were exhibited in Chen’s AEIC. Once the\n                    statement, debit and credit notes had been approved, the set-off statements\n                    would be sent to Chai Lee. 39     The details of the invoices issued by JHTI to\n                    the defendant and MTC, and those issued by the defendant and MTC to JHTI, were\n                    stored in the Motorola database. Chen would extract the information from the\n                    database and compile a table which summarised the set-offs to be effected\n                    between the defendant, MTC and JHTI for a particular month. 40     Chen would upload the monthly reconciliation\n                    statement onto Motorola’s Accounts Payables Inquiry Application\n                    (‘APIA’) for JHTI to have access to the details of invoices which\n                    had been set off. The sample statement for October 2008 in exhibit\n                    ‘LC-14’ of Chen’s AEIC showed the set-offs between sums due\n                    and payable under invoices issued by MTC to JHTI, against sums due and payable\n                    under invoices issued by JHTI to the defendant. 41     On 22 October 2008, Chen emailed Ng and\n                    Lakshmanan to seek approval for the set-off of US$4,694,848.57 owed by JHTI to\n                    MTC against US$4,694,848.57 owed by the defendant to JHTI. The approval of the\n                    set-off was exhibited in ‘LC-4’ of Chen’s AEIC. MTC issued a\n                    credit invoice no. 1260000986 dated 22 October 2008 to JHTI, as shown in\n                    exhibit ‘LC-7’ of Chen’s AEIC. 42     On 17 November 2008, Chen emailed Ng and\n                    Lakshmanan to seek approval for the set off of US$1,761,942.26 owed by the\n                    defendant to JHTI, and the sum of US$826,408.03 owed by MTC to JHTI, against the\n                    sum of US$2,588,350.29 owed by JHTI to MTC. The approval of the set-off was\n                    shown in exhibit ‘LC-6’ of Chen’s AEIC for which MTC issued\n                    credit invoice no. 1260001070 dated 22 October 2008 to JHTI. 43     Pauline testified that she received a call\n                    from Richard on 11 November 2008 during which Richard enquired to whom the\n                    plaintiff should direct the notifications of assignment when they were sent to\n                    the defendant. Richard had informed Pauline that there had been an assignment of\n                    invoices issued by JHT to the defendant. However, he did not provide any details\n                    as to the amount owing under the invoices or any particulars of the invoices\n                    that had been assigned. Pauline informed Richard that the appropriate person to\n                    direct the notifications to could be Ng but she would have to check. Although\n                    the telephone records produced by the plaintiff (at PB89) revealed that the call\n                    lasted six minutes and thirty seconds, Pauline claimed (at N/E 330) that this\n                    aspect was all that she could remember of that conversation. 44     Richard called Pauline again on\n                    14 November 2008 to confirm the addressee of the notifications. Pauline\n                    again said she would check and let him know. Richard responded that he would\n                    nevertheless still send the notifications to Motorola on 17 November\n                    2008. 45     Pauline testified that she had no recollection\n                    of telephone conversations with Richard other than the two conversations on 11\n                    and 14 November 2008. However, the telephone records showed that on\n                    24 November 2004, there was a three minute call at 4.49pm. Pauline’s\n                    response was that she had no recollection of nor records of such a\n                    conversation. 46     The defendant took the position that it was\n                    not liable to make payment under invoices numbered 90075199, 90075207 and\n                    90075249 totalling US$17,359.20 as those had been erroneously addressed to the\n                    defendant when they related to purchase orders that were made by other companies\n                    in the Motorola Group. The defendant contended that MTC had already set off with\n                    JHTI on 29 December 2008 the sums due under the three\n                invoices.",
        "The Issues": "47     The issues that arise for determination\n                    are; (i)Was there sufficient evidence to establish a\n                            tripartite set-off agreement between JHTI, MTC and the\n                        defendant?(ii)Was such a tripartite set-off agreement\n                            unsustainable in law for a lack of mutuality?(iii)Was the “silent assignment” taken\n                            by the plaintiff subject to an equity?48     In answering the third issue first, it is\n                    necessary to determine the relevant date of the notice which fixed the date from\n                    which the plaintiff as assignee took the assignment subject to pre-existing\n                    equities.The findingsNature of the plaintiff’s assignment49     Before going into the findings on the\n                    substantive issues, it is useful to understand the nature of the assignment\n                    involved. At law, there are two recognisedformsof assignment. The first form of assignment is by way of an equitable\n                    assignment. No notice is required, and the assignment need not be in writing so\n                    long as the intentions of the parties are clear. It is necessary for the\n                    assignee of an equitable assignment to recover the debt in the assignor’s\n                    name. One rationale for this requirement is to protect the debtor from being\n                    exposed to double action for the same debt. This requirement has been\n                    liberalised in several jurisdictions such as New Zealand (seeCommercial Factors Ltd v Maxwell Printing Ltd[1994]\n                    1 NZLR 724 (“Commercial\n                    Factors”) where it was held that this requirement can be\n                    dispensed with as there was no practical possibility of the debtor facing a\n                    claim from the insolvent assignor in that case).50     To counter this procedural bar of having to\n                    add the assignor as a party to the action to recover the debt, the statutoryformof assignment was created. Section 4(8)\n                    of the Civil Law Act Cap 43 (1999 Rev Ed) (“the Civil Law Act”)\n                    provides that:Assignment of debts and choses in\n                            action effectual to pass right and remedy(8) Anyabsoluteassignment bywritingunder the hand of the assignor, not\n                        purporting to be by way of charge only, of any debt or other legal chose in\n                        action of whichexpress notice in writing has been given\n                            to the debtor, trustee or other person from whom the assignor\n                        would have been entitled to receive or claim such debt or chose in action,\n                        shall be and be deemed to have been effectual in law,subject to all equities which would have been entitled to priority over\n                            the right of the assigneeunder the law as it existed before\n                        23rd July 1909, to pass and transfer the legal right to such debt or chose\n                        in action, from the date of such notice, and\n                        all legal and other remedies for the same, and the power to give a good\n                        discharge for the same, without the concurrence of the assignor. [emphasis\n                        added]51     The plaintiff’s assertion that it had a\n                    “silent assignment” was a convenient commercial label that added\n                    nothing to thesubstanceof the assignment. It\n                    however highlighted the risks that the plaintiff undertook in the receivables\n                    arrangement with JHTI. An analysis of the terms of the factoring agreement\n                        (vizthe MRPA) revealed that it did not exist\n                    as an assignment in itself but was anagreementto\n                    assign. The MRPA is a form of facultative agreement (see Salinger on Factoring,\n                    Sweet & Maxwell 2006 4thed at page 140),\n                    where the assignor offers debts for the assignee to purchase (see the purchase\n                    request in Schedule 1 of the MRPA), and where the assignee has the option to\n                    purchase the debt by signing an acceptance (see Acceptance form in Schedule 2 of\n                    MRPA), or if the assignee deems the offered debt to be non-commercially viable,\n                    to decline to accept the debt (see cl 2 of the MRPA which gives the assignee the\n                    ‘sole discretion’ to agree to acquire offered debts). The\n                    assignee’s option to accept or decline debts offered presents it with the\n                    flexibility to choose only debts that it deemed as good debts; the\n                    presupposition is that the assignee has done its due diligence in ascertaining\n                    the commercial viability of the debt offered before acceptance.52     In a “silent assignment”, no\n                    notice is given to the debtor. As such, an equitable assignment is created upon\n                    acceptance (see s 4 of the MRPA). As clarified by Hans Tjio inFactoring and Stamp Duty in Singapore and Malaysia,\n                    [1994] SJLS 183 at 186, the act that assigns the debt is the\n                    acceptance of the factor, not the master agreement itself. The MRPA itself\n                    cannot be a statutory assignment, as a requirement of a statutory assignment is\n                    for there to be an absolute assignment of the debt. An absolute assignment\n                    requires an immediate transfer of the assignor’s entire interest in the\n                    chose in action, and this cannot be achieved by a mere agreement to assign\n                    offered debts as and when the assignor chooses to submit a purchase\n                    request.53     I pause here to highlight the importance of\n                    giving notice, in both equitable and statutory assignment, before I address the\n                    substantive issue of notice. Receipt of the notice of assignment by the debtor\n                    prevents the discharge of the debt by the debtor’s payment to the assignor\n                    (seeWilliam Brandt’s Sons & Co v Dunlop Rubber Co\n                        Ltd[1905] AC 454) and it fixes the rights of the\n                    parties in relation to the debtor’s countervailing rights, primarily the\n                    right to set off its debts against debts owed by the assignor to the\n                    debtor.Was there sufficient evidence to establish an implied contractual\n                set-off agreement?54     Counsel for the plaintiff argued that there\n                    was insufficient evidence of a tripartite contractual set-off agreement.\n                    Specifically, although cl 11.2 of the MAA provided a set-off provision, the\n                    MAA was only made between JHTI and the defendant, without MTC’s\n                    involvement. Further, this set-off provision was arguably insufficient and could\n                    not be compared to an independent and express set-off agreement, which was not\n                    the case here. In addition, although the defendant, MTC, and JHTI were arguably,\n                    parties to the MSA by way of cl 2’s definition of\n                    ‘affiliates’, the MSA did not have a set-off\n                provision.55     Counsel’s arguments required the Court\n                    toartificiallyanalyse each piece of evidence inisolation. Although I find that there was noexpressset-off agreement in existence, I note\n                    that in inferring the existence of a set-off agreement, the Court must look at\n                    the evidence inits totalityto determine the true\n                    course of dealings between the parties. The case ofCommercial Factorsis informative for its closely analogous\n                    factual matrix. It is persuasive authority that a contractual set-off agreement\n                    can beimpliedfrom the surrounding circumstances\n                    and conduct of the parties and that such a contract is an equity that the\n                    assignee takes subject to.56     In that case, Export had assigned moneys owed\n                    to it by Maxwell to Commercial Factors (assignee), pursuant to a factoring\n                    agreement. The invoices relied on by Commercial Factors were issued between\n                    6 May 1991 and 30 September 1991. Prior to this period of time, there\n                    had been a flow of work between Maxwell, Export and IPL Publishing\n                    (Export’s associated company). Maxwell had been paying for work done by\n                    Export on 90 day terms. Specifically, before April 1991, there was an\n                    arrangement between Export and Maxwell to exchange cheques on the 90 days for\n                    amounts owing between them on the 20thof each month.\n                    The High Court observed the general rule that, (per Hammond J at 738):As to what is required to establish a contractual set-off, it can be\n                        explicit; it may arise by custom (Bamford v\n                            Harris(1816) 1 Stark 343; or it may be inferred from conduct\n                            (Wallis v Bastard(1853) 4 De GM & G\n                        251).57     The Court inferred from the evidence that the\n                    cheque-swapping arrangement had amounted to a contractual set-off agreement, and\n                    found that this agreement was an equity that the assignee had taken subject to\n                    (per Hammond J at 739):It will be recalled that the evidence was that there was to be no exchange\n                        of cheques or settlement between the parties without the compliance of the\n                        other party. Further, if I ask myself the question: could either party have\n                        sued in contract on that arrangement?, the answer I think would have to be\n                        \"Yes\". And, if one party had attempted to resile back to a 30-day\n                        arrangement, I think that would have provided a defence, at least without\n                        further negotiations.That contractual set-off arose prior to the May invoices, which is the\n                        important date for present purposes.…the effect of the arrangement was that the assigned invoices from\n                        May 1991 onwards were always subject to Maxwell's pre-existing right as\n                        debtor to refuse to pay the same if Export failed to pay Maxwell for their\n                        outstanding debts.58     Having considered the New Zealand position, it\n                    would be appropriate at this juncture to consider the English position in\n                    inferring a contractual set-off agreement.The English Position59     InDownam v Matthews Ch.\n                        Prec. 580[1721], ‘A’ a clothier and ‘B’\n                    a dyer had mutual dealings for several years without payment of money from\n                    either side. When B died, the administrators of his estate sought against A sums\n                    of money allegedly due by A to B. The Court (at page 582) found there to be\n                    an agreement to set off arising from the course of dealings:…where it appeared that themutual\n                            dealingbetween the intestate and the plaintiffs [party A]\n                        were carried on for several years in this manner, without payment of money\n                        on either side, it was astrong presumptive argument of\n                            an agreement to this purpose, and that without such liberty\n                        of retaining against each other, they would not have continued on their\n                        dealings; but if it had been insisted upon by either party, that the other\n                        should not be allowed to set off his debt out of what was owing by him to\n                        the other, as they could, that this would have soon broke off all dealings\n                        between them;…[emphasis added]60     More recently, inPaul\n                        Smith Ltd v H & S International Holding Inc[1991]\n                    2 AC 127, the plaintiff had based its Order 14 application on a no\n                    set-off clause in an agreement between the defendants and itself. The English\n                    Commercial Court considered that a set-off agreement inferred from a course of\n                    dealing between the parties may even be strong enough to override the no set-off\n                    provision, thereby giving rise to a disputable claim unsuitable for summary\n                    determination. Steyn J said at page 131:…the affidavit of Mr Dobson…shows convincingly that there\n                        was a course of dealing between the parties which in one respect at least\n                        varied the “no set-off” clause. By course of dealing it was\n                        agreed that the defendants would be entitled to set off the purchase price\n                        of goods sold to the plaintiffs against the royalties. It may be said that\n                        this is a variation of the “no set-off” clause only quoad the\n                        purchase price of the goods. On the other hand, it seems to me arguable that\n                        the course of conduct, which on any view had an impact on the “no\n                        set-off” clause, in fact had the consequence of deleting it\n                        altogether. The claim…is therefore…a genuinely disputable\n                        claim.61     Indeed, the English authorities have set alowevidential threshold in implying a\n                    contractual set-off agreement. It has been held thatslight\n                        evidenceof the agreement is sufficient to imply such an\n                    agreement. The rationale of this position is that the law encourages contractual\n                    set-offs in order to prevent multiplicity of suits and circuity of action. InJeffs v Wood[1723] 2 P WMS 128\n                    the then Master of the Roles, Sir Joseph Jekyll said at page 129:It is true, stoppage [the old term for set-off] is no payment at law,\n                        nor is it, of itself, a payment in equity, but then a very slender agreement\n                        for discounting or allowing the one debt out of the other, will make it a\n                        payment, because this prevents circuity of action and multiplicity of suits,\n                        which is not favoured in law, much less in equity.……the least evidence of an agreement for a\n                            stoppage will do…and in these cases equity will\n                        take hold of a very slight thing to do both parties right. And it is still\n                        more reasonable, that where the matter of the mutual demand is concerning\n                        the same thing, there the Court should interpose, and make the balance only\n                        payable.[emphasis added]62     InLundy v\n                        McCulla(1865) 11 Gr. 368, it was held that:In the view of equity the setting off one demand against another between\n                        the same parties is extremely just; and where there is any technical\n                        difficulty in the way of its being done without an agreement, the courtaccepts slighter evidence of such an agreement than\n                            is usually required in order to establish disputed\n                        facts.[emphasis added]63     The English authorities’ marked\n                    readiness to assist in finding an implied contractual set-off agreement from the\n                    circumstances and conduct of the parties can be seen from the decision ofWallis v Bastard(1853)\n                    4 De GM & G 251, where Lord Cranwoth LC said\n                    at p 257:This much, however, I think may be stated as a very safe proposition, that\n                        the principle of set-off is quite consistent with natural equity, and that\n                        where it can be adopted,it is an arrangement which this\n                            Court will be very ready to assist, while it will look to any\n                        circumstances that occurred at the time when persons became reciprocally\n                        indebted, in order to say that a set-off did in fact take place. In the\n                        present case, from the circumstance that possession was taken in 1842 by the\n                        mortgagee, and that no claim was made for interest by either party, I infer\n                        that,whether expressed or not, it was the agreement\n                            perfectly understood between the parties that the one debt should wipe\n                            off a portion of the other debt; in effect, that there should\n                        pro tanto be a set-off. I do not, therefore, feel called upon to speculate\n                        as to the exact course this Court would have pursued if the parties had, in\n                        the year 1842, adversely asserted against each other their mutual rights;\n                        but not having done so, they must be understood, like reasonable persons, to\n                        have adopted an arrangement perfectly obvious and in conformity with what\n                        ought to have been done. [emphasis added]64     Arguably, these English cases are not\n                    conclusively authoritative as they deal with the inference of a bilateral, as\n                    opposed to a tripartite set-off agreement. Nonetheless, whether the set-off\n                    agreement is bilateral or tripartite, the basis of such agreements iscontractual. In this regard I refer to the textbook of\n                    Philip R. Wood,English and International Set OffSweet & Maxwell 1989 which commented at para 5-17,\n                    page 154:A contract to set off must satisfy the normal contractual rules as to\n                        formation of contract,eg. offer and\n                        acceptance and communication of the acceptance, as to whether an offer is\n                        merely an invitation to treat, and as to certainty of terms and contractual\n                        intention.65     Further, it was stated in Treitel on The Law\n                    of Contract (12thed, Sweet & Maxwell) at\n                    page 186, para 4-021:The question of contractual intention is, in the last resort, one of fact.\n                        In deciding it, a distinction must be drawn between implied and express\n                        agreements. Claims based onimpliedagreements\n                        are approached on the basis that “contracts are not lightly to be\n                        implied” and that the court must therefore be able to\n                        “conclude with confidence that…the parties intended to create\n                        contractual relations”. The burden of proof on this issue is on the\n                        proponent of the implied contract… .66     There is an English decision where the court\n                    found there to be sufficient evidence of atripartiteset-off agreement. InLatreefers\n                        Inc (In Liquidation) v Tangent Shipping Co Ltd[2000] BCLC 805, there was a debt owed by Tangent to Latreefers, while\n                    at the same time, Latreefers owed a debt of a larger sum to Latstrand. Tangent\n                    was at the material time the subsidiary of Latstrand, while both Latsrand and\n                    Latreefers were subsidiaries of Latmar. Latmar was in turn a subsidiary of\n                    Latvian. The Court identified the real issue as whether there was evidence of an\n                    agreement to set off the debt owed by Tangent to Latreefers against\n                    Latreefers’ debt owed to Latstrand (Tangent’s parent company). It\n                    was found that there was evidence of the set off agreement.67     I note that the court made the above findingwithoutthe benefit of extrinsic evidence such\n                    as reconciliation statements and records of invoices. The court found there to\n                    be sufficient evidence from the correspondence between Latreefers’\n                    solicitors and Latmar’s accountant, as well as the affidavits of\n                    Tangent’s solicitors, Latmar’s solicitor, and Latmar’s\n                    managing director. Nonetheless, each case rests on its own facts and I proceed\n                    to consider the evidence in this case.The evidence68     In the present case, the MSA dated\n                    28 March 2006 made between JHTI and Motorola Inc at [11] for JHTI to\n                    provide manufacturing services to Motorola Inc., has to be read with the\n                    ‘‘full and final settlement of accounts payable” dated\n                    22 June 2007 (AB 69). The letter had referred to the ‘on going’\n                    reconciliation exercise between Motorola Inc. and JHTI in respect of services\n                    and products provided by JHTI. I note that the definition of\n                    ‘affiliates’ in the MSA covered the defendant and MTC.69     There were records of invoices of JHTI’s\n                    accounts payables representing the sums owed by JHTI to MTC which ranged from\n                    23 August 2005 to 3 October 2009. This should beread togetherwith the records of invoices of JHTI’s\n                    accounts payables representing the sums owed by JHTI to the defendants from\n                    December 2004 to March 2009.70     The defendant had provided comprehensive\n                    set-off statements that evidenced set-offs on 22 October 2008 and\n                    21 November 2008, attached to the correspondence between Chai Lee and Chen\n                    dated 25 October 2008. Those comprehensive set-off statements had dedicated\n                    columns and accounting figures for: (i) offsetting JHTI’s accounts\n                    receivable from MTC against JHTI’s accounts payable to MTC, (ii)\n                    offsetting JHTI accounts payable to Motorola Electronics (the defendant) against\n                    JHTI accounts receivable from MTC, (iii) offsetting JHTI’s accounts\n                    receivable from Motorola Electronics against JHTI’s accounts payable to\n                    Motorola Electronics, and (iv) a net offsetting amount.71     The evidence of columns (i) and (ii) was\n                    further supported by Chen’s testimony (N/E 222), where he explained that\n                    the Motorola APIA extract (see [40]) in his exhibit ‘LC-17’ showed\n                    invoices from 8 August 2008 to 22 September 2008 that represented the\n                    sums set off between MTC and JHTI; while the APIA extract in his exhibit\n                    ‘LC-16’ showed invoices from 14 August 2008 to 24 November\n                    2008 that represented the set-off between the defendant, MTC, and JHTI. Those\n                    two extracts parallel the above items (i) and (ii) respectively, presenting a\n                    practice pursuant to an existing reconciliation system.72     Indeed, exhibit ‘LC-15’ in\n                    Chen’s AEIC showed that as far as Motorola was concerned, MTC’s\n                    accounts receivable had been set off against the defendant’s accounts\n                    payable for October 2008 – the invoices beginning with ‘13000’\n                    were MTC’s accounts receivable invoices to JHTI, and the invoices\n                    beginning with ‘900’ were JHTI’s receivables as recorded in\n                    the defendant’s accounts payable (N/E 255 and 258).73     In addition, the approval for the tripartite\n                    set-offs on 22 October 2008 and 17 November 2008 were exhibited in\n                    ‘LC-4’ and ‘LC-6’ of Chen’s AEIC. The\n                    correspondence between Chen and Chai Lee dated 28 October 2008 clearly\n                    stated that for due invoices as of 23 October 2008, it was a\n                        “net receivable” from Motorola\n                    to JHT. This presupposed that the set-off had already been\n                effected.74     There were also records of the correspondence\n                    between Chen and Ng dated 22 October 2008 reflecting that a sum of\n                    $5,348,520.20 of JHTI’s accounts payable to the defendant were to be\n                    offset against JHTI’s accounts receivable from MTC, with attached credit\n                    notes as evidence of such set-off (where the phrase OU_SGP represented the\n                    defendant, and OU_BUY_SELL represented MTC). The correspondence dated\n                    17 November 2008 showed that a sum of $1,761,942.26 of JHTI’s\n                    accounts payable to the defendant were to be offset against JHTI’s\n                    accounts receivable from MTC.75     In this regard I reject the plaintiff’s\n                    submission that there was no evidence of the credit and debit notes.\n                    Lakshmanan’s and Chen’s evidence (in their respective AEICs) on the\n                    debit and credit notes was further corroborated by the debit note request form,\n                    and credit note request form, both dated 24 June 2008 annexed to Ng Cheng\n                    Soon’s email to Ng to inform the latter of the amount to be offset, as\n                    well as Lakshmanan’s reply email to approve the set-off. Further evidence\n                    was to be found in the credit note request forms dated 22 October 2008 and\n                    17 November 2008.76     The plaintiff also submitted that Lakshmanan\n                    had agreed during cross-examination that three letters dated 22 June 2007\n                    (AB 69–74) constituted three separate bilateral agreements executed by the\n                    specific Motorola companies and JHTI, and was not evidence of a ‘broader\n                    agreement’. However, the plaintiff’s counsel had extracted this\n                    answer from Lakshmanan in thecontextof finding a\n                    tripartiteexpressagreement. The\n                    plaintiff’s counsel had asked Lakshmanan (at N/E 135):So you do not see, in any of the three agreements that I’ve just\n                        shown you, more than one Motorola company entering into a settlement\n                        agreement of accounts payable with JHTI and JHTCin the\n                            same agreement; do you accept? It’s all separate for\n                        each of the Motorola companies.77     In that context, Lakshmanan’s answer\n                    that the three letters were not evidence of a broader agreement was merely an\n                    admission that none of the three letters expressly incorporated the three\n                    parties (JTHI, MTC and the defendant) in the same agreement. Lakshmanan’s\n                    answer had no bearing on theinferenceof an\n                    agreement, by reading the three letters in totality with other extrinsic\n                    evidence presented to the court.78     In the light of the evidence adduced read\n                    together with the set-off provision under cl 11.2 of the MAA between the\n                    defendant and JHTI as well as the MSA which was a contract between,inter alia, JHTI, MTC and the defendant, I have no doubt\n                    that the defendant has discharged its burden of proof on a balance of\n                    probabilities. Based on thetotalityof the\n                    evidence before me, I find there to be more than sufficient evidence to imply a\n                    tripartite contractual set-off agreement, and that there had been set-offs\n                    exercised on 22 October 2008 and 21 November 2008pursuantto this tripartite agreement. The evidence, especially\n                    through the reconciliation statements and invoice records, convincingly\n                    establishes aconsensus ad idem asmanifested by\n                    the course of dealings where MTC and the defendant would supply materials to\n                    JHTI for manufacturing and sale, such that the amounts owing to one another\n                    would be set off. This tripartite agreement without doubt existed with effect\n                    from October 2008. Although it may have existed from 2005, it is not necessary\n                    for present purposes to look so far back into the parties’ course of\n                    dealings.79     In addition, I find that the plaintiff has no\n                    claim on the three invoices numbered 99075199, 90075207 and 90075249. Those\n                    corresponded with the references ERS-MOT2008090074-308915,\n                    ERS-MOT2008090080-308912 and ERS-MOT2008090093-309368 respectively and the\n                    records showed that the purchase order numbers for the references had the\n                    inclusion of ‘MTC’ at the end of each purchase order number. This\n                    indicated that the purchase orders were issued by MTC. It is not in dispute that\n                    the MRPA signed between the plaintiff and JHTI only covered choses in action\n                    owed by the defendant. It was not the plaintiff’s pleaded case and neither\n                    was there evidence, that the above references had been forged by the defendant.\n                    I therefore find that the defendant is not liable to pay invoices numbered\n                    99075199, 90075207 and 90075249.80     Given that there is more than sufficient\n                    evidence to establish the existence of an implied tripartite agreement to set\n                    off, there was no necessity for the defendant to call JHTI’s personnel as\n                    witnesses to establish the same. I note that the plaintiff itself had relied on\n                    statements made by JHTI’s personnel (see [25] to [28]) but did not call\n                    them as witnesses. The plaintiff had contended that several representatives from\n                    JHTI had informed the former that there was no set-off arrangement in existence,\n                    that the defendant had unilaterally imposed the set-off agreement since October\n                    2008 and that JHTI had refused to agree to a set-off arrangement. As the court\n                    pointed out to counsel for the plaintiff, there was no proprietary right to\n                    witnesses by litigants. If the defendant chose not to call representatives of\n                    JHTI to testify, the plaintiff could have done so but it did not. Whatever that\n                    was said by JHTI’s personnel to Tan and/or Richard was therefore hearsay\n                    and inadmissible.81     I also reject as inadmissible, the two email\n                    threads (between the defendant and JHTI) obtained by the plaintiff from the\n                    judicial managers of JHTI. Similarly, I reject the report of the judicial\n                    managers (at 2PB 879) as they were not called to testify.Was the tripartite contractual set-off agreement\n                    unsustainable in law for lack of mutuality?Requirement of Mutuality82     As a general rule, there must be mutuality\n                    between the two claims to be set off. For example, a debt owed by B to A cannot\n                    be set off against a debt owed by A to C, even if B and C are related companies:Bank of Credit and Commerce International (Overseas) Ltd\n                        (In Liquidation) v Habib Bank Ltd[1999] 1 WLR 42.Prima facie, as the plaintiff argued, there was no\n                    mutuality between the debt owed by the defendant to JHT and the debt owed by JHT\n                    to MTC, notwithstanding that the defendant and MTC are related\n                companies.83     The purpose of the requirement of mutuality is\n                    to ensure that, in the situation where B owes a debt to A (an insolvent entity)\n                    and A owes a debt to C, the insolvent’s estate is not deprived of an asset\n                    (a claim by A against B) which belongs to the insolvent and which should be\n                    available for division amongst secured creditors; and to ensure that B is not\n                    unjustly enriched by an asset not belonging to the insolvent; (see Philip R.\n                    Wood,English and International Set-Off(1989) at\n                    para 14-5, page 769).84     However, in the absence of insolvency, the\n                    requirement of mutuality can be overridden by the existence of acontractual set-off agreement. As observed inGoode on Legal Problems of Credit and Security(Sweet\n                    & Maxwell 2008 4thEd) at page 285,\n                    para 7-21:The ordinary requirement of mutuality may be overridden by theagreementof the parties, so that, for example, a\n                        parent company may agree to allow debts due from its subsidiaries to be\n                        set-off against its own credit balance,…and set-off may be effected\n                        in any manner provided by the contract without the need of legal\n                        proceedings. [emphasis added].85     The same view was expressed in Philip R. Wood,English and International Set-Off(1989) at\n                    page 168 para 5-70:Where the claims arenot mutual, the\n                        relevant partiesmay validly agreethat the\n                        claims may nevertheless be set off provided that insolvency has not\n                        intervened.[emphasis added]86     A leading commentator in this area of law has\n                    observed in Rory Derham,The Law of Set-Off(Oxford 2004), at page 467 that:In the absence ofan agency or trust\n                        relationship which brings about mutuality in equity, oralternatively, before bankruptcy or liquidation, of a set-off agreement\n                            between the parties, A’s right to sue B may not be set\n                        off against A’s indebtedness to C. This applies where B and C are\n                        related companies, and also where C is a director of company B or is the\n                        beneficial owner of company B. [emphasis added]87     Indeed, this principle has much historical\n                    pedigree. In the case ofFreeman v. Lomas(1851)\n                    9 Hare 109, Turner VC held (at 114) that where there is an absence of\n                    mutuality because the cross-demands in that case had existed in separate rights\n                    (where a legatee claimed his legacy and the executor sought to set off a private\n                    debt owed to the executor by the legatee), then an agreement whether express or\n                    implied, may confer a right of set-off and slight circumstances would be\n                    sufficient to warrant the court in presuming such an agreement.88     Langley J. had decided inLatreefers Inc (In Liquidation) v Tangent Shipping Co\n                        Ltd(supra[66]) that there was sufficient evidence to\n                    establish an agreement to set off a debt owed by Tangent to Latreefers, against\n                    a debt owed by Latreefers to Latstrand, where Latstrand was the parent company\n                    of Tangent. The loan given by Latstrand to Latreefers had fully discharged\n                    Tangent’s indebtedness under a prior loan given by Latreefers to Tangent.\n                    The direct effect of this decision is that the requirement of mutuality can be\n                    overridden by a contractual set-off agreement.89     I therefore disagree with the\n                    plaintiff’s argument that the contractual set-off agreement is\n                    unsustainable in law due to want of mutuality. This submission is at odds with\n                    commercial reality where associated companies (such as the defendant and MTC in\n                    the present case) agree amongst themselves to allocate their debts and assets in\n                    line with their commercial strategies and objectives. It contradicts authorities\n                    which allow the requirement of mutuality to be overridden by agreement in the\n                    absence of insolvency. I note that the exercised set offs on 22 October\n                    2008 and 21 November 2008 were pursuant to a contractual agreement that\n                    existed at least from October 2008 and took place prior to JHTI’s judicial\n                    management on 20 February 2009. In any case, although it is not an issue\n                    here, it should be noted that the decision inAltus\n                        Technologies Pte Ltd (under judicial management) v Oversea-Chinese Banking\n                        Corp Ltd[2009] 4 SLR(R) 296, has clarified that\n                    contractual set-offs can be exercised in judicial management as thepari passuprinciple applies not in judicial management,\n                    but in winding-up.90     Given that I have found the existence of a\n                    contractual set-off agreement, and that the requirement of mutuality can be\n                    overridden by such agreement in the absence of insolvency, it is not necessary\n                    for me to analyse whether there was an equitable set-off on the facts, and\n                    whether there was a requirement of mutuality for such equitable\n                set-off.Notice of Assignment91     It is a well settled principle of law that the\n                    assignee of a debt takes subject to equities that existed prior to the notice of\n                    assignment being given to the debtor, as the assignee takes the chose in action\n                    as it is and cannot be in a better position than the assignor (see The Jarguh\n                    Sawit [1998] 1 SLR(R) 648 at para [64];Pacrim\n                        Investments Pte Ltd v Tan Mui Keow Claire and another[2005] 1 SLR(R) 141 at para [20];Hongkong and Shanghai Banking Corp Ltd v United Overseas Bank\n                        Ltd[1992] 1 SLR(R) 579 at para  [48] andBrice v Bannister(1878)\n                    3 QBD 569).The assignee takes precisely the same interest and is\n                    subject to the same liabilities as the assignor (Mangles v\n                        Dixon(1852) 3 HLC 702, 10 ER 278). The assignee takes\n                    subject to a contractual set-off agreement, provided that the agreement was madepriorto notice of assignment given to the\n                    debtor (seeRoxburghe v Cox(1881) 17 Ch. D.\n                    520; see Salinger on Factoring (Sweet & Maxwell 2006) at\n                    page 211).92     This principle applies to an equitable\n                    assignment as well as to a statutory assignment, as expressly provided for in s\n                    4(8) of the Civil Law Act. However, this rule can be excluded or modified by the\n                    terms of the contract between the debtor and assignor, where the debtor agrees\n                    that he will not raise the set-off against the assignee (Re\n                        Agra and Masterman’s Bank(1867) L.R. 2 Ch. App.\n                    391)93     Having found that there were set-offs on\n                    22 October 2008 and 21 November 2008 exercised pursuant to a\n                    pre-existing contractual set-off agreement, the next inquiry would be to\n                    determine the date of notification of assignment. The relevant date to determine\n                    effective notice is the date on which the notice is received by the debtor and\n                    not that on which it is sent:Johnstone v Cox(1881) 16 Ch.D. 17. As such, I find that the equitable assignment had\n                    been perfected into a statutory assignment with thewrittennotification letter received by the defendant on\n                    25 November 2008. However, before this perfection, Pauline had received\n                    calls from Richard on 11 and 14 November 2008. The telephone records showed\n                    that there had been a conversation on 24 November 2008. It is possible that\n                    any of those conversations could constitute notice of the equitable assignment\n                    (before its perfection to a statutory assignment) as there is no requirement at\n                    law for the notice to be in written form.94     As to what constitutes sufficient notice to\n                    the debtor, Lord Macnaghten held inWilliam Brandt’s\n                        Sons & Co v Dunlop Rubber Co(supra[53]) at 462:The language is immaterial if the meaning is plain. All that is necessary\n                        is that the debtor should be given to understand thatthe\n                            debthas been made over by the creditor to some third person.\n                        If the debtor ignores such a notice, he does so at his peril. [emphasis\n                        added]95     The issue of notice was considered inJames Talcott Ltd v John Lewis & Co Ltd and North\n                        American DressCo Ltd [1940] 3 All E.R. 592, where the\n                    notice given to the debtor stated:To facilitate our accountancy and banking arrangements, it has been agreed\n                        that this invoice be transferred to and payment in London funds should be\n                        made to James Talcott, Ltd., 6-8, Sackville Street, London, W.1. Errors in\n                        this invoice must be notified to James Talcott, Ltd., immediately.96     On the general point of adequacy of notice,\n                    Mackinnon LJ quotedDenney, Gasquet & Metcalfe v\n                        Conklin[1913] 3 KB 177 (at 180):The language is immaterial if the meaning is plain, but that plain meaning\n                        must be thatthe debtand the right to receive\n                        it have been transferred to the third party. It is not merely that I have\n                        made some arrangement by which I request another to pay this money to the\n                        third party as my agent. The question is whether this stamped clause put\n                        upon the invoices did amount to a plain intimation to the first defendants\n                        that the right to receive this money had been transferred to the plaintiffs.\n                        [emphasis added]97     Mackinnon LJ further emphasized on the\n                    need for the notice to be plain and unambiguous, it is insufficient if the\n                    language of the notice is equally capable of a contrary interpretation:I think that this notice stamped on the invoice was ambiguous. I think\n                        that it is equally consistent with being merely a request to pay to the\n                        plaintiffs, as agents of the creditor to receive the money, and it does not\n                        indicate sufficiently clearly that there has been an assignment ofthe debtto the plaintiffs so that they should\n                        become the real creditors of the first defendants, be the only persons\n                        entitled to be paid the money. [emphasis added]98     A fundamental presupposition implicit in the\n                    above proposition is that the relevant assigned debt must have first been\n                    sufficientlyidentified. References to\n                        ‘the debt’ (as emphasized in the\n                    above passages) presuppose that the relevant debt has been adequately\n                    identified. Once identified, there must be sufficient notice to inform the\n                    debtor that the relevant debt can be effectively discharged by making payment to\n                    the assignee.99     There are cases that have determined the\n                    adequacy of notice for the purposes of theDearle v.\n                        Hallrule, although it must be remembered that the rationale\n                    behind this rule concerns the allocation of priorities as between competing\n                    assignees whereas in our present case, we are concerned with the relevant notice\n                    that fixed dates from which the assignee takes the assignment subject to\n                    equities. For notices relevant to theDearle v\n                        Hallrule, the notice must be clear and distinct (Bence v Shearman[1898] 2 Ch 582). There must be\n                    proof that the mind of the debtor has been brought to an ‘intelligent\n                    apprehension of the assignment’ so that the reasonable man, or an ordinary\n                    man of business, would act upon the information and would regulate his conduct\n                    by it; and constructive notice would not suffice (Lloyd v\n                        Banks(1868) LR 3 Ch App 488 at 490).100    In the absence of any other evidence and in\n                    the face of Pauline’s testimony that she had no recollection of having had\n                    any conversation on 24 November and that no substantive matters were\n                    discussed in Richard’s call on 14 November 2008, the plaintiff has\n                    failed to discharge its evidential burden to show that there had been adequate\n                    notice of assignment given to the defendant on either of the two dates. Although\n                    there were telephone records to show the two calls were indeed made, the\n                    plaintiff failed to adduce further evidence of the substance of the\n                    conversations that took place. Needless to say, themerefact that a telephone conversation took place does not\n                    equate tonoticeof assignment having been\n                    given.101    As regards the telephone conversation on\n                    11 November 2008, it was Pauline’s evidence that Richard had told her\n                    that there had been an assignment of invoices issued by JHTI to the defendant.\n                    The telephone records showed that the duration of this conversation exceeded 6\n                    minutes. However, what constitutes adequate notice must depend on the context of\n                    each case. Here, Richard testified that the principal purpose of his callwas to enquire to whom he should attention the\n                        Notifications towhen sending them to the defendant. Although\n                    this is not to be a legal test of any form, it does show that even the plaintiff\n                    itself had not intended for this telephone conversation to be a notification of\n                    the assignment. Richard admitted hedid not reveal\n                        muchin this conversation due to banker-customer confidentiality\n                    and he had only been “touching base with the defendantgenerally on the receivables due” to JHTI. There were\n                    hundreds of invoices involved between JHTI and the defendant, a general\n                    information that invoices had been assigned is vague and/or ambiguous as it\n                    leaves the debtor (defendant here) none the wiser as towhich\n                        invoiceshad been assigned. The relevant choses in action that\n                    had been assigned were not sufficiently identified. As such, I find that the\n                    telephone conversation on 11 November 2008 did not constitute sufficient\n                    notice.102    Arguably, a lot could have been said in that\n                    6 minute conversation. In any case however, even if I find that the conversation\n                    on 11 November 2008 was adequate notice of the equitable assignment, the\n                    plaintiff would still take its assignment subject to the invoices which had been\n                    set off on 21 November 2008. Thedue datefor\n                    invoices numbered 1300064025, 1300063914, 1300063912 was 11 November 2008,\n                    while the invoices’ date was 28 August 2008. Thedue datesfor the rest of the invoices which had been set off on\n                    21 November 2008 were allpriorto\n                    11 November 2008, save for invoice number 1300064200 where the due date was\n                    12 November 2008. Even though the actual debiting (set-off) had taken place\n                    after the notice on 21 November 2008, the relevant debts hadaccrued prior tothe notice. The plaintiff has to take\n                    subject to this equity which had existed prior to its notice.103    As was observed by Rory Derham inThe Law of Set-Off(3rded.\n                    Oxford University Press, 2003) at page 787, para 17.12, the general\n                    rule is that there must be an existing debt owing by the assignor to the debtor\n                    before notice; if a debt accrues only after notice pursuant to a contract\n                    entered before notice, the debt cannot be set off;Business\n                        Computers Ltd v. Anglo-African Leasing Ltd[1977] 1 WLR 578\n                    at 585. However, if a debt has accrued prior to notice, the assignee takes\n                    subject to an agreement to set off this debt, even if the actual debit of the\n                    debt took place after the notice;The Law of\n                        Set-Offat page 808, para 17.41.104    This principle has been reiterated in Philip\n                    R. Wood,English and International Set-Off(1989)\n                    at para 16-33, page 861:Where the assignor and the debtor agree that the claims shall be set off\n                        … and the assignor assigns the claim owing to him to an assignee, the\n                        assignee should take subject to this contract and exercise the same solvent\n                        set-off against the assignee that he could have exercised against the\n                        assignor in the absence of the assignment, provided that the agreement was\n                        made prior to notice to the debtor of the assignment and provided (probably)\n                        that both the assigned claim and the cross-claim wereincurred before such notice. [emphasis added]105    The plaintiff therefore takes its assignment\n                    subject to invoice number 1300064200 which due date was 12 November 2008\n                    and where the set-off took place on 21 November 2008. Where a chose in\n                    action thataccrues afternotice of assignment had\n                    been given, it can still be subject to set-off provided that there was anagreementmade between the debtor and the\n                    assignorpriorto the notice of assignment to\n                    set-off the last accrued chose in action against the cross debt, and provided\n                    that the chose in action arose from a contract entered into prior to the notice.\n                    InWatson v Mid Wales Railway Co(1867) LR 2 CP\n                    593 (“Watson”), the maker of a bond\n                    granted a lease to the original bondholder. The original bondholder had assigned\n                    the bond. The lease was granted after the making of the bond but before the\n                    notice of assignment had been given to the maker. It was held that the rent that\n                    hadaccrued due afterthe notice of assignment\n                    could not be set off against the assignee, unless it could beinferredfrom the evidence that there was an agreement between\n                    the maker and the original bondholder to set-off the rent against the\n                    debt.106    It was held inWatsonthat if there were sufficient facts to support theinferenceof a contractual set-off agreement,\n                    the agreement would be an equity that the assignee had taken subject to.\n                    However, the Court there found there were insufficient facts to support such an\n                    inference. It was held at page 600 that:…if there is to beimplied, orfairly to be presumed from the transaction, an\n                            agreement, or an understanding amounting to a contract, that\n                        the one shall go in liquidation of the other, and the balance only be\n                        considered as the debt between the parties,then each\n                            party has a right to demand that the one claim shall not be enforced\n                            independently of the other. But there is no such thing\n                        here…there is nothing to support the inference that the one was\n                        contracted with any reference to the other, or that there was any agreement\n                        that the defendants should only pay the balance of the two. [emphasis\n                        added]107    I find that there had not been sufficient\n                    notice of the assignment given in the 11 November 2008 telephone\n                    conversation. The requisite notice was given on 25 November 2008 when the\n                    defendant received the plaintiff’s letter dated 17 November 2008. In\n                    any case, the existence of the set-off agreement predated the alleged date of\n                    notice. Even if the 11 November 2008 conversation had been sufficient\n                    notice, the plaintiff takes subject to the debts that hadaccruedprior to the notice on 11 November 2008. The\n                    plaintiff also takes subject to the invoice which had accrued on\n                    12 November, as there had been a pre-existing set-off agreement madepriorto the notice (on 11 November 2008)\n                    to set off that debt.The letter dated 17 December 2008108    Although notice of the assigned receivables\n                    had been given on 25 November 2008 pursuant to the letter dated\n                    17 November 2008, the notice for the assignments that had taken place on\n                    28 July 2008 and 18 August 2008 came at a later date, via the\n                    17 December 2008 letter from the plaintiff. By Tan’s own admission\n                    (and para 20 of the plaintiff’s opening statement), the letter dated\n                    17 November 2008 had omitted two notifications of the assignments of\n                    receivables dated 28 July 2008 and 18 August 2008. The plaintiff sent a\n                    subsequent letter dated 17 December 2008 with the attached\n                    notifications.109    It was held inVan Lynn\n                        Developments Ltd v Pelias Construction Co Ltd[1969]\n                    1 QB 613 (“Van Lynn”) that\n                    it is not necessary to state the date of assignment to constitute sufficient\n                    notice, per Lord Denning MR at 613:It seems to me to be unnecessary that it should give the date of the\n                        assignment so long as it makes it plain that there has in fact been an\n                        assignment so that the debtor knows to whom he has to pay the debt in the\n                        future.110    The decision ofVan\n                        Lynncan be distinguished because in that case, there had only\n                    been one lump sum debt involved. As such, there was no need to specify the date\n                    of assignment to identify the relevant assignment. In the present case, there\n                    wereseveralassignments made atdifferentdates. As such, the plaintiff’s omission\n                    to include the two notifications in the 17 November 2008 letter was\n                    insufficient notice. Indeed, Lord Denning had implicitly accepted (at\n                    page 612) the requirement to specifically identify the relevant assignment\n                    when he endorsed the principle that there is no valid notice if awrongdate of assignment had been given:There is the case ofStanley v. English Fibres\n                            Industries Ltd., which was accepted and applied by this court\n                        inW. F. Harrison & Co. Ltd. v. Burke.\n                        Those cases show that, if a notice of assignment purports to identify the\n                        assignment by giving the date of the assignment, and that date is a wrong\n                        date, then the notice is bad. The short ground of those decisions was that\n                        the notice with a wrong date was a notice of a non-existing document.\n                        Assuming those cases to be correct, they leave open the question whether it\n                        is necessary to give the date of the assignment.111    As such, I find that the proper notice of\n                    the two assignments dated 28 July 2008 and 18 August 2008 had been\n                    given only by the plaintiff’s letter dated 17 December\n                2008.Conclusion112    It follows from my findings that the\n                    plaintiff’s claim is dismissed with costs to the defendant to be taxed\n                    unless otherwise agreed.113    In regard to costs, the defendant had made\n                    an Offer to Settle to the plaintiff on 6 January 2010 pursuant to Order 22A of\n                    the Rules of Court (Cap 322, R 5, 2006 Rev Ed) (“the Rules”) in the following\n                    terms:(a)the plaintiff to discontinue this suit with no\n                            order as to costs with the Notice of Discontinuance to be filed and\n                            served within seven days of the date of acceptance of the Offer to\n                            Settle;(b)each party would bear its own costs of this suit\n                            save where the court had ordered otherwise prior to the Offer To\n                            Settle;(c)the terms of the Offer To Settle would constitute\n                            a full and final settlement of all the plaintiff’s claims made in this\n                            suit.114    As the plaintiff did not accept the\n                    defendant’s Offer To Settle and its claim is dismissed, the plaintiff has failed\n                    to obtain a judgment more favourable than the terms of the defendant’s Offer to\n                    Settle. The defendant is consequently entitled, under Order 22A rule 9(3) of the\n                    Rules, to costs on a standard basis up to and including 6 January 2010 and\n                    thereafter to costs on an indemnity basis, and I so order.",
        "The findings": "Nature of the plaintiff’s assignment 49     Before going into the findings on the\n                    substantive issues, it is useful to understand the nature of the assignment\n                    involved. At law, there are two recognisedformsof assignment. The first form of assignment is by way of an equitable\n                    assignment. No notice is required, and the assignment need not be in writing so\n                    long as the intentions of the parties are clear. It is necessary for the\n                    assignee of an equitable assignment to recover the debt in the assignor’s\n                    name. One rationale for this requirement is to protect the debtor from being\n                    exposed to double action for the same debt. This requirement has been\n                    liberalised in several jurisdictions such as New Zealand (seeCommercial Factors Ltd v Maxwell Printing Ltd[1994]\n                    1 NZLR 724 (“Commercial\n                    Factors”) where it was held that this requirement can be\n                    dispensed with as there was no practical possibility of the debtor facing a\n                    claim from the insolvent assignor in that case). 50     To counter this procedural bar of having to\n                    add the assignor as a party to the action to recover the debt, the statutoryformof assignment was created. Section 4(8)\n                    of the Civil Law Act Cap 43 (1999 Rev Ed) (“the Civil Law Act”)\n                    provides that: Assignment of debts and choses in\n                            action effectual to pass right and remedy (8) Anyabsoluteassignment bywritingunder the hand of the assignor, not\n                        purporting to be by way of charge only, of any debt or other legal chose in\n                        action of whichexpress notice in writing has been given\n                            to the debtor, trustee or other person from whom the assignor\n                        would have been entitled to receive or claim such debt or chose in action,\n                        shall be and be deemed to have been effectual in law,subject to all equities which would have been entitled to priority over\n                            the right of the assigneeunder the law as it existed before\n                        23rd July 1909, to pass and transfer the legal right to such debt or chose\n                        in action, from the date of such notice, and\n                        all legal and other remedies for the same, and the power to give a good\n                        discharge for the same, without the concurrence of the assignor. [emphasis\n                        added] 51     The plaintiff’s assertion that it had a\n                    “silent assignment” was a convenient commercial label that added\n                    nothing to thesubstanceof the assignment. It\n                    however highlighted the risks that the plaintiff undertook in the receivables\n                    arrangement with JHTI. An analysis of the terms of the factoring agreement\n                        (vizthe MRPA) revealed that it did not exist\n                    as an assignment in itself but was anagreementto\n                    assign. The MRPA is a form of facultative agreement (see Salinger on Factoring,\n                    Sweet & Maxwell 2006 4thed at page 140),\n                    where the assignor offers debts for the assignee to purchase (see the purchase\n                    request in Schedule 1 of the MRPA), and where the assignee has the option to\n                    purchase the debt by signing an acceptance (see Acceptance form in Schedule 2 of\n                    MRPA), or if the assignee deems the offered debt to be non-commercially viable,\n                    to decline to accept the debt (see cl 2 of the MRPA which gives the assignee the\n                    ‘sole discretion’ to agree to acquire offered debts). The\n                    assignee’s option to accept or decline debts offered presents it with the\n                    flexibility to choose only debts that it deemed as good debts; the\n                    presupposition is that the assignee has done its due diligence in ascertaining\n                    the commercial viability of the debt offered before acceptance. 52     In a “silent assignment”, no\n                    notice is given to the debtor. As such, an equitable assignment is created upon\n                    acceptance (see s 4 of the MRPA). As clarified by Hans Tjio inFactoring and Stamp Duty in Singapore and Malaysia,\n                    [1994] SJLS 183 at 186, the act that assigns the debt is the\n                    acceptance of the factor, not the master agreement itself. The MRPA itself\n                    cannot be a statutory assignment, as a requirement of a statutory assignment is\n                    for there to be an absolute assignment of the debt. An absolute assignment\n                    requires an immediate transfer of the assignor’s entire interest in the\n                    chose in action, and this cannot be achieved by a mere agreement to assign\n                    offered debts as and when the assignor chooses to submit a purchase\n                    request. 53     I pause here to highlight the importance of\n                    giving notice, in both equitable and statutory assignment, before I address the\n                    substantive issue of notice. Receipt of the notice of assignment by the debtor\n                    prevents the discharge of the debt by the debtor’s payment to the assignor\n                    (seeWilliam Brandt’s Sons & Co v Dunlop Rubber Co\n                        Ltd[1905] AC 454) and it fixes the rights of the\n                    parties in relation to the debtor’s countervailing rights, primarily the\n                    right to set off its debts against debts owed by the assignor to the\n                    debtor.",
        "Was there sufficient evidence to establish an implied contractual\n                set-off agreement?": "54     Counsel for the plaintiff argued that there\n                    was insufficient evidence of a tripartite contractual set-off agreement.\n                    Specifically, although cl 11.2 of the MAA provided a set-off provision, the\n                    MAA was only made between JHTI and the defendant, without MTC’s\n                    involvement. Further, this set-off provision was arguably insufficient and could\n                    not be compared to an independent and express set-off agreement, which was not\n                    the case here. In addition, although the defendant, MTC, and JHTI were arguably,\n                    parties to the MSA by way of cl 2’s definition of\n                    ‘affiliates’, the MSA did not have a set-off\n                provision. 55     Counsel’s arguments required the Court\n                    toartificiallyanalyse each piece of evidence inisolation. Although I find that there was noexpressset-off agreement in existence, I note\n                    that in inferring the existence of a set-off agreement, the Court must look at\n                    the evidence inits totalityto determine the true\n                    course of dealings between the parties. The case ofCommercial Factorsis informative for its closely analogous\n                    factual matrix. It is persuasive authority that a contractual set-off agreement\n                    can beimpliedfrom the surrounding circumstances\n                    and conduct of the parties and that such a contract is an equity that the\n                    assignee takes subject to. 56     In that case, Export had assigned moneys owed\n                    to it by Maxwell to Commercial Factors (assignee), pursuant to a factoring\n                    agreement. The invoices relied on by Commercial Factors were issued between\n                    6 May 1991 and 30 September 1991. Prior to this period of time, there\n                    had been a flow of work between Maxwell, Export and IPL Publishing\n                    (Export’s associated company). Maxwell had been paying for work done by\n                    Export on 90 day terms. Specifically, before April 1991, there was an\n                    arrangement between Export and Maxwell to exchange cheques on the 90 days for\n                    amounts owing between them on the 20thof each month.\n                    The High Court observed the general rule that, (per Hammond J at 738): As to what is required to establish a contractual set-off, it can be\n                        explicit; it may arise by custom (Bamford v\n                            Harris(1816) 1 Stark 343; or it may be inferred from conduct\n                            (Wallis v Bastard(1853) 4 De GM & G\n                        251). 57     The Court inferred from the evidence that the\n                    cheque-swapping arrangement had amounted to a contractual set-off agreement, and\n                    found that this agreement was an equity that the assignee had taken subject to\n                    (per Hammond J at 739): It will be recalled that the evidence was that there was to be no exchange\n                        of cheques or settlement between the parties without the compliance of the\n                        other party. Further, if I ask myself the question: could either party have\n                        sued in contract on that arrangement?, the answer I think would have to be\n                        \"Yes\". And, if one party had attempted to resile back to a 30-day\n                        arrangement, I think that would have provided a defence, at least without\n                        further negotiations. That contractual set-off arose prior to the May invoices, which is the\n                        important date for present purposes. …the effect of the arrangement was that the assigned invoices from\n                        May 1991 onwards were always subject to Maxwell's pre-existing right as\n                        debtor to refuse to pay the same if Export failed to pay Maxwell for their\n                        outstanding debts. 58     Having considered the New Zealand position, it\n                    would be appropriate at this juncture to consider the English position in\n                    inferring a contractual set-off agreement. The English Position 59     InDownam v Matthews Ch.\n                        Prec. 580[1721], ‘A’ a clothier and ‘B’\n                    a dyer had mutual dealings for several years without payment of money from\n                    either side. When B died, the administrators of his estate sought against A sums\n                    of money allegedly due by A to B. The Court (at page 582) found there to be\n                    an agreement to set off arising from the course of dealings: …where it appeared that themutual\n                            dealingbetween the intestate and the plaintiffs [party A]\n                        were carried on for several years in this manner, without payment of money\n                        on either side, it was astrong presumptive argument of\n                            an agreement to this purpose, and that without such liberty\n                        of retaining against each other, they would not have continued on their\n                        dealings; but if it had been insisted upon by either party, that the other\n                        should not be allowed to set off his debt out of what was owing by him to\n                        the other, as they could, that this would have soon broke off all dealings\n                        between them;…[emphasis added] 60     More recently, inPaul\n                        Smith Ltd v H & S International Holding Inc[1991]\n                    2 AC 127, the plaintiff had based its Order 14 application on a no\n                    set-off clause in an agreement between the defendants and itself. The English\n                    Commercial Court considered that a set-off agreement inferred from a course of\n                    dealing between the parties may even be strong enough to override the no set-off\n                    provision, thereby giving rise to a disputable claim unsuitable for summary\n                    determination. Steyn J said at page 131: …the affidavit of Mr Dobson…shows convincingly that there\n                        was a course of dealing between the parties which in one respect at least\n                        varied the “no set-off” clause. By course of dealing it was\n                        agreed that the defendants would be entitled to set off the purchase price\n                        of goods sold to the plaintiffs against the royalties. It may be said that\n                        this is a variation of the “no set-off” clause only quoad the\n                        purchase price of the goods. On the other hand, it seems to me arguable that\n                        the course of conduct, which on any view had an impact on the “no\n                        set-off” clause, in fact had the consequence of deleting it\n                        altogether. The claim…is therefore…a genuinely disputable\n                        claim. 61     Indeed, the English authorities have set alowevidential threshold in implying a\n                    contractual set-off agreement. It has been held thatslight\n                        evidenceof the agreement is sufficient to imply such an\n                    agreement. The rationale of this position is that the law encourages contractual\n                    set-offs in order to prevent multiplicity of suits and circuity of action. InJeffs v Wood[1723] 2 P WMS 128\n                    the then Master of the Roles, Sir Joseph Jekyll said at page 129: It is true, stoppage [the old term for set-off] is no payment at law,\n                        nor is it, of itself, a payment in equity, but then a very slender agreement\n                        for discounting or allowing the one debt out of the other, will make it a\n                        payment, because this prevents circuity of action and multiplicity of suits,\n                        which is not favoured in law, much less in equity. … …the least evidence of an agreement for a\n                            stoppage will do…and in these cases equity will\n                        take hold of a very slight thing to do both parties right. And it is still\n                        more reasonable, that where the matter of the mutual demand is concerning\n                        the same thing, there the Court should interpose, and make the balance only\n                        payable.[emphasis added] 62     InLundy v\n                        McCulla(1865) 11 Gr. 368, it was held that: In the view of equity the setting off one demand against another between\n                        the same parties is extremely just; and where there is any technical\n                        difficulty in the way of its being done without an agreement, the courtaccepts slighter evidence of such an agreement than\n                            is usually required in order to establish disputed\n                        facts.[emphasis added] 63     The English authorities’ marked\n                    readiness to assist in finding an implied contractual set-off agreement from the\n                    circumstances and conduct of the parties can be seen from the decision ofWallis v Bastard(1853)\n                    4 De GM & G 251, where Lord Cranwoth LC said\n                    at p 257: This much, however, I think may be stated as a very safe proposition, that\n                        the principle of set-off is quite consistent with natural equity, and that\n                        where it can be adopted,it is an arrangement which this\n                            Court will be very ready to assist, while it will look to any\n                        circumstances that occurred at the time when persons became reciprocally\n                        indebted, in order to say that a set-off did in fact take place. In the\n                        present case, from the circumstance that possession was taken in 1842 by the\n                        mortgagee, and that no claim was made for interest by either party, I infer\n                        that,whether expressed or not, it was the agreement\n                            perfectly understood between the parties that the one debt should wipe\n                            off a portion of the other debt; in effect, that there should\n                        pro tanto be a set-off. I do not, therefore, feel called upon to speculate\n                        as to the exact course this Court would have pursued if the parties had, in\n                        the year 1842, adversely asserted against each other their mutual rights;\n                        but not having done so, they must be understood, like reasonable persons, to\n                        have adopted an arrangement perfectly obvious and in conformity with what\n                        ought to have been done. [emphasis added] 64     Arguably, these English cases are not\n                    conclusively authoritative as they deal with the inference of a bilateral, as\n                    opposed to a tripartite set-off agreement. Nonetheless, whether the set-off\n                    agreement is bilateral or tripartite, the basis of such agreements iscontractual. In this regard I refer to the textbook of\n                    Philip R. Wood,English and International Set OffSweet & Maxwell 1989 which commented at para 5-17,\n                    page 154: A contract to set off must satisfy the normal contractual rules as to\n                        formation of contract,eg. offer and\n                        acceptance and communication of the acceptance, as to whether an offer is\n                        merely an invitation to treat, and as to certainty of terms and contractual\n                        intention. 65     Further, it was stated in Treitel on The Law\n                    of Contract (12thed, Sweet & Maxwell) at\n                    page 186, para 4-021: The question of contractual intention is, in the last resort, one of fact.\n                        In deciding it, a distinction must be drawn between implied and express\n                        agreements. Claims based onimpliedagreements\n                        are approached on the basis that “contracts are not lightly to be\n                        implied” and that the court must therefore be able to\n                        “conclude with confidence that…the parties intended to create\n                        contractual relations”. The burden of proof on this issue is on the\n                        proponent of the implied contract… . 66     There is an English decision where the court\n                    found there to be sufficient evidence of atripartiteset-off agreement. InLatreefers\n                        Inc (In Liquidation) v Tangent Shipping Co Ltd[2000] BCLC 805, there was a debt owed by Tangent to Latreefers, while\n                    at the same time, Latreefers owed a debt of a larger sum to Latstrand. Tangent\n                    was at the material time the subsidiary of Latstrand, while both Latsrand and\n                    Latreefers were subsidiaries of Latmar. Latmar was in turn a subsidiary of\n                    Latvian. The Court identified the real issue as whether there was evidence of an\n                    agreement to set off the debt owed by Tangent to Latreefers against\n                    Latreefers’ debt owed to Latstrand (Tangent’s parent company). It\n                    was found that there was evidence of the set off agreement. 67     I note that the court made the above findingwithoutthe benefit of extrinsic evidence such\n                    as reconciliation statements and records of invoices. The court found there to\n                    be sufficient evidence from the correspondence between Latreefers’\n                    solicitors and Latmar’s accountant, as well as the affidavits of\n                    Tangent’s solicitors, Latmar’s solicitor, and Latmar’s\n                    managing director. Nonetheless, each case rests on its own facts and I proceed\n                    to consider the evidence in this case. The evidence 68     In the present case, the MSA dated\n                    28 March 2006 made between JHTI and Motorola Inc at [11] for JHTI to\n                    provide manufacturing services to Motorola Inc., has to be read with the\n                    ‘‘full and final settlement of accounts payable” dated\n                    22 June 2007 (AB 69). The letter had referred to the ‘on going’\n                    reconciliation exercise between Motorola Inc. and JHTI in respect of services\n                    and products provided by JHTI. I note that the definition of\n                    ‘affiliates’ in the MSA covered the defendant and MTC. 69     There were records of invoices of JHTI’s\n                    accounts payables representing the sums owed by JHTI to MTC which ranged from\n                    23 August 2005 to 3 October 2009. This should beread togetherwith the records of invoices of JHTI’s\n                    accounts payables representing the sums owed by JHTI to the defendants from\n                    December 2004 to March 2009. 70     The defendant had provided comprehensive\n                    set-off statements that evidenced set-offs on 22 October 2008 and\n                    21 November 2008, attached to the correspondence between Chai Lee and Chen\n                    dated 25 October 2008. Those comprehensive set-off statements had dedicated\n                    columns and accounting figures for: (i) offsetting JHTI’s accounts\n                    receivable from MTC against JHTI’s accounts payable to MTC, (ii)\n                    offsetting JHTI accounts payable to Motorola Electronics (the defendant) against\n                    JHTI accounts receivable from MTC, (iii) offsetting JHTI’s accounts\n                    receivable from Motorola Electronics against JHTI’s accounts payable to\n                    Motorola Electronics, and (iv) a net offsetting amount. 71     The evidence of columns (i) and (ii) was\n                    further supported by Chen’s testimony (N/E 222), where he explained that\n                    the Motorola APIA extract (see [40]) in his exhibit ‘LC-17’ showed\n                    invoices from 8 August 2008 to 22 September 2008 that represented the\n                    sums set off between MTC and JHTI; while the APIA extract in his exhibit\n                    ‘LC-16’ showed invoices from 14 August 2008 to 24 November\n                    2008 that represented the set-off between the defendant, MTC, and JHTI. Those\n                    two extracts parallel the above items (i) and (ii) respectively, presenting a\n                    practice pursuant to an existing reconciliation system. 72     Indeed, exhibit ‘LC-15’ in\n                    Chen’s AEIC showed that as far as Motorola was concerned, MTC’s\n                    accounts receivable had been set off against the defendant’s accounts\n                    payable for October 2008 – the invoices beginning with ‘13000’\n                    were MTC’s accounts receivable invoices to JHTI, and the invoices\n                    beginning with ‘900’ were JHTI’s receivables as recorded in\n                    the defendant’s accounts payable (N/E 255 and 258). 73     In addition, the approval for the tripartite\n                    set-offs on 22 October 2008 and 17 November 2008 were exhibited in\n                    ‘LC-4’ and ‘LC-6’ of Chen’s AEIC. The\n                    correspondence between Chen and Chai Lee dated 28 October 2008 clearly\n                    stated that for due invoices as of 23 October 2008, it was a\n                        “net receivable” from Motorola\n                    to JHT. This presupposed that the set-off had already been\n                effected. 74     There were also records of the correspondence\n                    between Chen and Ng dated 22 October 2008 reflecting that a sum of\n                    $5,348,520.20 of JHTI’s accounts payable to the defendant were to be\n                    offset against JHTI’s accounts receivable from MTC, with attached credit\n                    notes as evidence of such set-off (where the phrase OU_SGP represented the\n                    defendant, and OU_BUY_SELL represented MTC). The correspondence dated\n                    17 November 2008 showed that a sum of $1,761,942.26 of JHTI’s\n                    accounts payable to the defendant were to be offset against JHTI’s\n                    accounts receivable from MTC. 75     In this regard I reject the plaintiff’s\n                    submission that there was no evidence of the credit and debit notes.\n                    Lakshmanan’s and Chen’s evidence (in their respective AEICs) on the\n                    debit and credit notes was further corroborated by the debit note request form,\n                    and credit note request form, both dated 24 June 2008 annexed to Ng Cheng\n                    Soon’s email to Ng to inform the latter of the amount to be offset, as\n                    well as Lakshmanan’s reply email to approve the set-off. Further evidence\n                    was to be found in the credit note request forms dated 22 October 2008 and\n                    17 November 2008. 76     The plaintiff also submitted that Lakshmanan\n                    had agreed during cross-examination that three letters dated 22 June 2007\n                    (AB 69–74) constituted three separate bilateral agreements executed by the\n                    specific Motorola companies and JHTI, and was not evidence of a ‘broader\n                    agreement’. However, the plaintiff’s counsel had extracted this\n                    answer from Lakshmanan in thecontextof finding a\n                    tripartiteexpressagreement. The\n                    plaintiff’s counsel had asked Lakshmanan (at N/E 135): So you do not see, in any of the three agreements that I’ve just\n                        shown you, more than one Motorola company entering into a settlement\n                        agreement of accounts payable with JHTI and JHTCin the\n                            same agreement; do you accept? It’s all separate for\n                        each of the Motorola companies. 77     In that context, Lakshmanan’s answer\n                    that the three letters were not evidence of a broader agreement was merely an\n                    admission that none of the three letters expressly incorporated the three\n                    parties (JTHI, MTC and the defendant) in the same agreement. Lakshmanan’s\n                    answer had no bearing on theinferenceof an\n                    agreement, by reading the three letters in totality with other extrinsic\n                    evidence presented to the court. 78     In the light of the evidence adduced read\n                    together with the set-off provision under cl 11.2 of the MAA between the\n                    defendant and JHTI as well as the MSA which was a contract between,inter alia, JHTI, MTC and the defendant, I have no doubt\n                    that the defendant has discharged its burden of proof on a balance of\n                    probabilities. Based on thetotalityof the\n                    evidence before me, I find there to be more than sufficient evidence to imply a\n                    tripartite contractual set-off agreement, and that there had been set-offs\n                    exercised on 22 October 2008 and 21 November 2008pursuantto this tripartite agreement. The evidence, especially\n                    through the reconciliation statements and invoice records, convincingly\n                    establishes aconsensus ad idem asmanifested by\n                    the course of dealings where MTC and the defendant would supply materials to\n                    JHTI for manufacturing and sale, such that the amounts owing to one another\n                    would be set off. This tripartite agreement without doubt existed with effect\n                    from October 2008. Although it may have existed from 2005, it is not necessary\n                    for present purposes to look so far back into the parties’ course of\n                    dealings. 79     In addition, I find that the plaintiff has no\n                    claim on the three invoices numbered 99075199, 90075207 and 90075249. Those\n                    corresponded with the references ERS-MOT2008090074-308915,\n                    ERS-MOT2008090080-308912 and ERS-MOT2008090093-309368 respectively and the\n                    records showed that the purchase order numbers for the references had the\n                    inclusion of ‘MTC’ at the end of each purchase order number. This\n                    indicated that the purchase orders were issued by MTC. It is not in dispute that\n                    the MRPA signed between the plaintiff and JHTI only covered choses in action\n                    owed by the defendant. It was not the plaintiff’s pleaded case and neither\n                    was there evidence, that the above references had been forged by the defendant.\n                    I therefore find that the defendant is not liable to pay invoices numbered\n                    99075199, 90075207 and 90075249. 80     Given that there is more than sufficient\n                    evidence to establish the existence of an implied tripartite agreement to set\n                    off, there was no necessity for the defendant to call JHTI’s personnel as\n                    witnesses to establish the same. I note that the plaintiff itself had relied on\n                    statements made by JHTI’s personnel (see [25] to [28]) but did not call\n                    them as witnesses. The plaintiff had contended that several representatives from\n                    JHTI had informed the former that there was no set-off arrangement in existence,\n                    that the defendant had unilaterally imposed the set-off agreement since October\n                    2008 and that JHTI had refused to agree to a set-off arrangement. As the court\n                    pointed out to counsel for the plaintiff, there was no proprietary right to\n                    witnesses by litigants. If the defendant chose not to call representatives of\n                    JHTI to testify, the plaintiff could have done so but it did not. Whatever that\n                    was said by JHTI’s personnel to Tan and/or Richard was therefore hearsay\n                    and inadmissible. 81     I also reject as inadmissible, the two email\n                    threads (between the defendant and JHTI) obtained by the plaintiff from the\n                    judicial managers of JHTI. Similarly, I reject the report of the judicial\n                    managers (at 2PB 879) as they were not called to testify.",
        "Was the tripartite contractual set-off agreement\n                    unsustainable in law for lack of mutuality?": "Requirement of Mutuality 82     As a general rule, there must be mutuality\n                    between the two claims to be set off. For example, a debt owed by B to A cannot\n                    be set off against a debt owed by A to C, even if B and C are related companies:Bank of Credit and Commerce International (Overseas) Ltd\n                        (In Liquidation) v Habib Bank Ltd[1999] 1 WLR 42.Prima facie, as the plaintiff argued, there was no\n                    mutuality between the debt owed by the defendant to JHT and the debt owed by JHT\n                    to MTC, notwithstanding that the defendant and MTC are related\n                companies. 83     The purpose of the requirement of mutuality is\n                    to ensure that, in the situation where B owes a debt to A (an insolvent entity)\n                    and A owes a debt to C, the insolvent’s estate is not deprived of an asset\n                    (a claim by A against B) which belongs to the insolvent and which should be\n                    available for division amongst secured creditors; and to ensure that B is not\n                    unjustly enriched by an asset not belonging to the insolvent; (see Philip R.\n                    Wood,English and International Set-Off(1989) at\n                    para 14-5, page 769). 84     However, in the absence of insolvency, the\n                    requirement of mutuality can be overridden by the existence of acontractual set-off agreement. As observed inGoode on Legal Problems of Credit and Security(Sweet\n                    & Maxwell 2008 4thEd) at page 285,\n                    para 7-21: The ordinary requirement of mutuality may be overridden by theagreementof the parties, so that, for example, a\n                        parent company may agree to allow debts due from its subsidiaries to be\n                        set-off against its own credit balance,…and set-off may be effected\n                        in any manner provided by the contract without the need of legal\n                        proceedings. [emphasis added]. 85     The same view was expressed in Philip R. Wood,English and International Set-Off(1989) at\n                    page 168 para 5-70: Where the claims arenot mutual, the\n                        relevant partiesmay validly agreethat the\n                        claims may nevertheless be set off provided that insolvency has not\n                        intervened.[emphasis added] 86     A leading commentator in this area of law has\n                    observed in Rory Derham,The Law of Set-Off(Oxford 2004), at page 467 that: In the absence ofan agency or trust\n                        relationship which brings about mutuality in equity, oralternatively, before bankruptcy or liquidation, of a set-off agreement\n                            between the parties, A’s right to sue B may not be set\n                        off against A’s indebtedness to C. This applies where B and C are\n                        related companies, and also where C is a director of company B or is the\n                        beneficial owner of company B. [emphasis added] 87     Indeed, this principle has much historical\n                    pedigree. In the case ofFreeman v. Lomas(1851)\n                    9 Hare 109, Turner VC held (at 114) that where there is an absence of\n                    mutuality because the cross-demands in that case had existed in separate rights\n                    (where a legatee claimed his legacy and the executor sought to set off a private\n                    debt owed to the executor by the legatee), then an agreement whether express or\n                    implied, may confer a right of set-off and slight circumstances would be\n                    sufficient to warrant the court in presuming such an agreement. 88     Langley J. had decided inLatreefers Inc (In Liquidation) v Tangent Shipping Co\n                        Ltd(supra[66]) that there was sufficient evidence to\n                    establish an agreement to set off a debt owed by Tangent to Latreefers, against\n                    a debt owed by Latreefers to Latstrand, where Latstrand was the parent company\n                    of Tangent. The loan given by Latstrand to Latreefers had fully discharged\n                    Tangent’s indebtedness under a prior loan given by Latreefers to Tangent.\n                    The direct effect of this decision is that the requirement of mutuality can be\n                    overridden by a contractual set-off agreement. 89     I therefore disagree with the\n                    plaintiff’s argument that the contractual set-off agreement is\n                    unsustainable in law due to want of mutuality. This submission is at odds with\n                    commercial reality where associated companies (such as the defendant and MTC in\n                    the present case) agree amongst themselves to allocate their debts and assets in\n                    line with their commercial strategies and objectives. It contradicts authorities\n                    which allow the requirement of mutuality to be overridden by agreement in the\n                    absence of insolvency. I note that the exercised set offs on 22 October\n                    2008 and 21 November 2008 were pursuant to a contractual agreement that\n                    existed at least from October 2008 and took place prior to JHTI’s judicial\n                    management on 20 February 2009. In any case, although it is not an issue\n                    here, it should be noted that the decision inAltus\n                        Technologies Pte Ltd (under judicial management) v Oversea-Chinese Banking\n                        Corp Ltd[2009] 4 SLR(R) 296, has clarified that\n                    contractual set-offs can be exercised in judicial management as thepari passuprinciple applies not in judicial management,\n                    but in winding-up. 90     Given that I have found the existence of a\n                    contractual set-off agreement, and that the requirement of mutuality can be\n                    overridden by such agreement in the absence of insolvency, it is not necessary\n                    for me to analyse whether there was an equitable set-off on the facts, and\n                    whether there was a requirement of mutuality for such equitable\n                set-off.",
        "Notice of Assignment": "91     It is a well settled principle of law that the\n                    assignee of a debt takes subject to equities that existed prior to the notice of\n                    assignment being given to the debtor, as the assignee takes the chose in action\n                    as it is and cannot be in a better position than the assignor (see The Jarguh\n                    Sawit [1998] 1 SLR(R) 648 at para [64];Pacrim\n                        Investments Pte Ltd v Tan Mui Keow Claire and another[2005] 1 SLR(R) 141 at para [20];Hongkong and Shanghai Banking Corp Ltd v United Overseas Bank\n                        Ltd[1992] 1 SLR(R) 579 at para  [48] andBrice v Bannister(1878)\n                    3 QBD 569).The assignee takes precisely the same interest and is\n                    subject to the same liabilities as the assignor (Mangles v\n                        Dixon(1852) 3 HLC 702, 10 ER 278). The assignee takes\n                    subject to a contractual set-off agreement, provided that the agreement was madepriorto notice of assignment given to the\n                    debtor (seeRoxburghe v Cox(1881) 17 Ch. D.\n                    520; see Salinger on Factoring (Sweet & Maxwell 2006) at\n                    page 211). 92     This principle applies to an equitable\n                    assignment as well as to a statutory assignment, as expressly provided for in s\n                    4(8) of the Civil Law Act. However, this rule can be excluded or modified by the\n                    terms of the contract between the debtor and assignor, where the debtor agrees\n                    that he will not raise the set-off against the assignee (Re\n                        Agra and Masterman’s Bank(1867) L.R. 2 Ch. App.\n                    391) 93     Having found that there were set-offs on\n                    22 October 2008 and 21 November 2008 exercised pursuant to a\n                    pre-existing contractual set-off agreement, the next inquiry would be to\n                    determine the date of notification of assignment. The relevant date to determine\n                    effective notice is the date on which the notice is received by the debtor and\n                    not that on which it is sent:Johnstone v Cox(1881) 16 Ch.D. 17. As such, I find that the equitable assignment had\n                    been perfected into a statutory assignment with thewrittennotification letter received by the defendant on\n                    25 November 2008. However, before this perfection, Pauline had received\n                    calls from Richard on 11 and 14 November 2008. The telephone records showed\n                    that there had been a conversation on 24 November 2008. It is possible that\n                    any of those conversations could constitute notice of the equitable assignment\n                    (before its perfection to a statutory assignment) as there is no requirement at\n                    law for the notice to be in written form. 94     As to what constitutes sufficient notice to\n                    the debtor, Lord Macnaghten held inWilliam Brandt’s\n                        Sons & Co v Dunlop Rubber Co(supra[53]) at 462: The language is immaterial if the meaning is plain. All that is necessary\n                        is that the debtor should be given to understand thatthe\n                            debthas been made over by the creditor to some third person.\n                        If the debtor ignores such a notice, he does so at his peril. [emphasis\n                        added] 95     The issue of notice was considered inJames Talcott Ltd v John Lewis & Co Ltd and North\n                        American DressCo Ltd [1940] 3 All E.R. 592, where the\n                    notice given to the debtor stated: To facilitate our accountancy and banking arrangements, it has been agreed\n                        that this invoice be transferred to and payment in London funds should be\n                        made to James Talcott, Ltd., 6-8, Sackville Street, London, W.1. Errors in\n                        this invoice must be notified to James Talcott, Ltd., immediately. 96     On the general point of adequacy of notice,\n                    Mackinnon LJ quotedDenney, Gasquet & Metcalfe v\n                        Conklin[1913] 3 KB 177 (at 180): The language is immaterial if the meaning is plain, but that plain meaning\n                        must be thatthe debtand the right to receive\n                        it have been transferred to the third party. It is not merely that I have\n                        made some arrangement by which I request another to pay this money to the\n                        third party as my agent. The question is whether this stamped clause put\n                        upon the invoices did amount to a plain intimation to the first defendants\n                        that the right to receive this money had been transferred to the plaintiffs.\n                        [emphasis added] 97     Mackinnon LJ further emphasized on the\n                    need for the notice to be plain and unambiguous, it is insufficient if the\n                    language of the notice is equally capable of a contrary interpretation: I think that this notice stamped on the invoice was ambiguous. I think\n                        that it is equally consistent with being merely a request to pay to the\n                        plaintiffs, as agents of the creditor to receive the money, and it does not\n                        indicate sufficiently clearly that there has been an assignment ofthe debtto the plaintiffs so that they should\n                        become the real creditors of the first defendants, be the only persons\n                        entitled to be paid the money. [emphasis added] 98     A fundamental presupposition implicit in the\n                    above proposition is that the relevant assigned debt must have first been\n                    sufficientlyidentified. References to\n                        ‘the debt’ (as emphasized in the\n                    above passages) presuppose that the relevant debt has been adequately\n                    identified. Once identified, there must be sufficient notice to inform the\n                    debtor that the relevant debt can be effectively discharged by making payment to\n                    the assignee. 99     There are cases that have determined the\n                    adequacy of notice for the purposes of theDearle v.\n                        Hallrule, although it must be remembered that the rationale\n                    behind this rule concerns the allocation of priorities as between competing\n                    assignees whereas in our present case, we are concerned with the relevant notice\n                    that fixed dates from which the assignee takes the assignment subject to\n                    equities. For notices relevant to theDearle v\n                        Hallrule, the notice must be clear and distinct (Bence v Shearman[1898] 2 Ch 582). There must be\n                    proof that the mind of the debtor has been brought to an ‘intelligent\n                    apprehension of the assignment’ so that the reasonable man, or an ordinary\n                    man of business, would act upon the information and would regulate his conduct\n                    by it; and constructive notice would not suffice (Lloyd v\n                        Banks(1868) LR 3 Ch App 488 at 490). 100    In the absence of any other evidence and in\n                    the face of Pauline’s testimony that she had no recollection of having had\n                    any conversation on 24 November and that no substantive matters were\n                    discussed in Richard’s call on 14 November 2008, the plaintiff has\n                    failed to discharge its evidential burden to show that there had been adequate\n                    notice of assignment given to the defendant on either of the two dates. Although\n                    there were telephone records to show the two calls were indeed made, the\n                    plaintiff failed to adduce further evidence of the substance of the\n                    conversations that took place. Needless to say, themerefact that a telephone conversation took place does not\n                    equate tonoticeof assignment having been\n                    given. 101    As regards the telephone conversation on\n                    11 November 2008, it was Pauline’s evidence that Richard had told her\n                    that there had been an assignment of invoices issued by JHTI to the defendant.\n                    The telephone records showed that the duration of this conversation exceeded 6\n                    minutes. However, what constitutes adequate notice must depend on the context of\n                    each case. Here, Richard testified that the principal purpose of his callwas to enquire to whom he should attention the\n                        Notifications towhen sending them to the defendant. Although\n                    this is not to be a legal test of any form, it does show that even the plaintiff\n                    itself had not intended for this telephone conversation to be a notification of\n                    the assignment. Richard admitted hedid not reveal\n                        muchin this conversation due to banker-customer confidentiality\n                    and he had only been “touching base with the defendantgenerally on the receivables due” to JHTI. There were\n                    hundreds of invoices involved between JHTI and the defendant, a general\n                    information that invoices had been assigned is vague and/or ambiguous as it\n                    leaves the debtor (defendant here) none the wiser as towhich\n                        invoiceshad been assigned. The relevant choses in action that\n                    had been assigned were not sufficiently identified. As such, I find that the\n                    telephone conversation on 11 November 2008 did not constitute sufficient\n                    notice. 102    Arguably, a lot could have been said in that\n                    6 minute conversation. In any case however, even if I find that the conversation\n                    on 11 November 2008 was adequate notice of the equitable assignment, the\n                    plaintiff would still take its assignment subject to the invoices which had been\n                    set off on 21 November 2008. Thedue datefor\n                    invoices numbered 1300064025, 1300063914, 1300063912 was 11 November 2008,\n                    while the invoices’ date was 28 August 2008. Thedue datesfor the rest of the invoices which had been set off on\n                    21 November 2008 were allpriorto\n                    11 November 2008, save for invoice number 1300064200 where the due date was\n                    12 November 2008. Even though the actual debiting (set-off) had taken place\n                    after the notice on 21 November 2008, the relevant debts hadaccrued prior tothe notice. The plaintiff has to take\n                    subject to this equity which had existed prior to its notice. 103    As was observed by Rory Derham inThe Law of Set-Off(3rded.\n                    Oxford University Press, 2003) at page 787, para 17.12, the general\n                    rule is that there must be an existing debt owing by the assignor to the debtor\n                    before notice; if a debt accrues only after notice pursuant to a contract\n                    entered before notice, the debt cannot be set off;Business\n                        Computers Ltd v. Anglo-African Leasing Ltd[1977] 1 WLR 578\n                    at 585. However, if a debt has accrued prior to notice, the assignee takes\n                    subject to an agreement to set off this debt, even if the actual debit of the\n                    debt took place after the notice;The Law of\n                        Set-Offat page 808, para 17.41. 104    This principle has been reiterated in Philip\n                    R. Wood,English and International Set-Off(1989)\n                    at para 16-33, page 861: Where the assignor and the debtor agree that the claims shall be set off\n                        … and the assignor assigns the claim owing to him to an assignee, the\n                        assignee should take subject to this contract and exercise the same solvent\n                        set-off against the assignee that he could have exercised against the\n                        assignor in the absence of the assignment, provided that the agreement was\n                        made prior to notice to the debtor of the assignment and provided (probably)\n                        that both the assigned claim and the cross-claim wereincurred before such notice. [emphasis added] 105    The plaintiff therefore takes its assignment\n                    subject to invoice number 1300064200 which due date was 12 November 2008\n                    and where the set-off took place on 21 November 2008. Where a chose in\n                    action thataccrues afternotice of assignment had\n                    been given, it can still be subject to set-off provided that there was anagreementmade between the debtor and the\n                    assignorpriorto the notice of assignment to\n                    set-off the last accrued chose in action against the cross debt, and provided\n                    that the chose in action arose from a contract entered into prior to the notice.\n                    InWatson v Mid Wales Railway Co(1867) LR 2 CP\n                    593 (“Watson”), the maker of a bond\n                    granted a lease to the original bondholder. The original bondholder had assigned\n                    the bond. The lease was granted after the making of the bond but before the\n                    notice of assignment had been given to the maker. It was held that the rent that\n                    hadaccrued due afterthe notice of assignment\n                    could not be set off against the assignee, unless it could beinferredfrom the evidence that there was an agreement between\n                    the maker and the original bondholder to set-off the rent against the\n                    debt. 106    It was held inWatsonthat if there were sufficient facts to support theinferenceof a contractual set-off agreement,\n                    the agreement would be an equity that the assignee had taken subject to.\n                    However, the Court there found there were insufficient facts to support such an\n                    inference. It was held at page 600 that: …if there is to beimplied, orfairly to be presumed from the transaction, an\n                            agreement, or an understanding amounting to a contract, that\n                        the one shall go in liquidation of the other, and the balance only be\n                        considered as the debt between the parties,then each\n                            party has a right to demand that the one claim shall not be enforced\n                            independently of the other. But there is no such thing\n                        here…there is nothing to support the inference that the one was\n                        contracted with any reference to the other, or that there was any agreement\n                        that the defendants should only pay the balance of the two. [emphasis\n                        added] 107    I find that there had not been sufficient\n                    notice of the assignment given in the 11 November 2008 telephone\n                    conversation. The requisite notice was given on 25 November 2008 when the\n                    defendant received the plaintiff’s letter dated 17 November 2008. In\n                    any case, the existence of the set-off agreement predated the alleged date of\n                    notice. Even if the 11 November 2008 conversation had been sufficient\n                    notice, the plaintiff takes subject to the debts that hadaccruedprior to the notice on 11 November 2008. The\n                    plaintiff also takes subject to the invoice which had accrued on\n                    12 November, as there had been a pre-existing set-off agreement madepriorto the notice (on 11 November 2008)\n                    to set off that debt.",
        "The letter dated 17 December 2008": "108    Although notice of the assigned receivables\n                    had been given on 25 November 2008 pursuant to the letter dated\n                    17 November 2008, the notice for the assignments that had taken place on\n                    28 July 2008 and 18 August 2008 came at a later date, via the\n                    17 December 2008 letter from the plaintiff. By Tan’s own admission\n                    (and para 20 of the plaintiff’s opening statement), the letter dated\n                    17 November 2008 had omitted two notifications of the assignments of\n                    receivables dated 28 July 2008 and 18 August 2008. The plaintiff sent a\n                    subsequent letter dated 17 December 2008 with the attached\n                    notifications. 109    It was held inVan Lynn\n                        Developments Ltd v Pelias Construction Co Ltd[1969]\n                    1 QB 613 (“Van Lynn”) that\n                    it is not necessary to state the date of assignment to constitute sufficient\n                    notice, per Lord Denning MR at 613: It seems to me to be unnecessary that it should give the date of the\n                        assignment so long as it makes it plain that there has in fact been an\n                        assignment so that the debtor knows to whom he has to pay the debt in the\n                        future. 110    The decision ofVan\n                        Lynncan be distinguished because in that case, there had only\n                    been one lump sum debt involved. As such, there was no need to specify the date\n                    of assignment to identify the relevant assignment. In the present case, there\n                    wereseveralassignments made atdifferentdates. As such, the plaintiff’s omission\n                    to include the two notifications in the 17 November 2008 letter was\n                    insufficient notice. Indeed, Lord Denning had implicitly accepted (at\n                    page 612) the requirement to specifically identify the relevant assignment\n                    when he endorsed the principle that there is no valid notice if awrongdate of assignment had been given: There is the case ofStanley v. English Fibres\n                            Industries Ltd., which was accepted and applied by this court\n                        inW. F. Harrison & Co. Ltd. v. Burke.\n                        Those cases show that, if a notice of assignment purports to identify the\n                        assignment by giving the date of the assignment, and that date is a wrong\n                        date, then the notice is bad. The short ground of those decisions was that\n                        the notice with a wrong date was a notice of a non-existing document.\n                        Assuming those cases to be correct, they leave open the question whether it\n                        is necessary to give the date of the assignment. 111    As such, I find that the proper notice of\n                    the two assignments dated 28 July 2008 and 18 August 2008 had been\n                    given only by the plaintiff’s letter dated 17 December\n                2008.",
        "Conclusion": "112    It follows from my findings that the\n                    plaintiff’s claim is dismissed with costs to the defendant to be taxed\n                    unless otherwise agreed. 113    In regard to costs, the defendant had made\n                    an Offer to Settle to the plaintiff on 6 January 2010 pursuant to Order 22A of\n                    the Rules of Court (Cap 322, R 5, 2006 Rev Ed) (“the Rules”) in the following\n                    terms: (a)the plaintiff to discontinue this suit with no\n                            order as to costs with the Notice of Discontinuance to be filed and\n                            served within seven days of the date of acceptance of the Offer to\n                            Settle;(b)each party would bear its own costs of this suit\n                            save where the court had ordered otherwise prior to the Offer To\n                            Settle;(c)the terms of the Offer To Settle would constitute\n                            a full and final settlement of all the plaintiff’s claims made in this\n                            suit.114    As the plaintiff did not accept the\n                    defendant’s Offer To Settle and its claim is dismissed, the plaintiff has failed\n                    to obtain a judgment more favourable than the terms of the defendant’s Offer to\n                    Settle. The defendant is consequently entitled, under Order 22A rule 9(3) of the\n                    Rules, to costs on a standard basis up to and including 6 January 2010 and\n                    thereafter to costs on an indemnity basis, and I so order."
    }
}