{
    "case_title": "Dorey Donna Marie\n      v\n      Lee Kit Su (Lee Yee Wai Eva, Intervener)",
    "ncitation": "[2010] SGHC 57",
    "coram": "Judith Prakash J",
    "sections": {
        "Introduction": "1       The plaintiff and defendant (collectively,\n                    “the couple”) were divorced in 2007. At the ancillary stage, the\n                    plaintiff made a claim for,inter alia, a share of\n                    the net proceeds from the sale of a property known as 16A Jervois Lane, #01-05,\n                    Clydesville, Singapore 159192 (“the Property”). She alleged that\n                    the Property had been the matrimonial home of the couple, and as such, she was\n                    entitled to a share of the net sale proceeds. On 22 August 2008, the\n                    defendant’s aunt (“the intervener”) succeeded in her\n                    application to be joined as a party to the suit. The intervener prosecuted a\n                    claim for all the net proceeds on the basis that the Property had been bought\n                    with a loan extended by her to the couple.",
        "Facts": "2       The couple were married on 7 January 1991.\n                    Their first child was born in 1993. Their second child was born in 1995. Up\n                    until 1995, the couple had been living in rented premises. In that year, they\n                    purchased the Property for $1,944,639.82 (inclusive of stamp and legal fees).\n                    They moved into the Property and lived there with their two children until 2005,\n                    when their relationship broke down, causing them to establish separate\n                    households. After the Property was vacated by the family, it was rented out, and\n                    eventually sold on 17 May 2007 for a net sum of\n                $1,561,911.06. 3       The facts given above at[2]are undisputed. However, two vastly different accounts were\n                    presented regarding the circumstances in which the plaintiff and defendant came\n                    to purchase the Property.",
        "The plaintiff’s evidence": "4       According to the plaintiff, in 1995, she and the\n                    defendant had been viewing properties in Singapore within a price range of\n                    $500,000 to $750,000. Their second child was almost due and they wanted to move\n                    out of the Orchard Road area where they were staying at that point of time. On\n                    9 July 1995, the couple had lunch with the intervener and her husband, the\n                    defendant’s uncle, during which an invitation was extended to view the\n                    Property. The couple agreed to accompany their uncle and aunt not suspecting\n                    anything out of the ordinary, as the older couple were very active in the\n                    property market and frequently bought properties and rented them\n                out. 5       After viewing the Property, the couple were\n                    informed that the intervener and her husband were in the process of purchasing\n                    the Property for them. The intervener and her husband had only asked the couple\n                    to view the Property in order to confirm that the Property was to their liking.\n                    They told the couple that as 1 per cent of the purchase price as an option fee\n                    had already been paid, the couple only had a few days to decide if they wanted\n                    to accept the gift of the Property. 6       The next day, on 10 July 1995, the couple\n                    signed the acceptance form attached to the option to purchase. The option was\n                    exercised on 14 July 1995. The intervener and her husband handled all\n                    aspects of the conveyance thereafter, even though all the transfer documents\n                    were completed in favour of the couple. The entire purchase price of the\n                    Property was paid for by the intervener and her husband. They also paid the\n                    legal fees, and all the maintenance fees, property tax and incidental expenses\n                    associated with the Property prior to the completion of the conveyance. Their\n                    control over the conveyance even extended to making arrangements to vary the\n                    completion date of the conveyance without the knowledge of the couple. The\n                    couple had no contact with the solicitors handling the conveyance until they\n                    found out about the deferment of the completion date and had to issue\n                    instructions to revert to the original date, following a discussion with the\n                    vendors. On 22 September 1995, the intervener and her husband formally\n                    presented the couple with the Property as a gift. All necessary documentation,\n                    records, and keys were also handed over on that day. 7       According to the plaintiff, she and the\n                    defendant were aware that other family members who had received generous gifts\n                    from the intervener and her husband were gossiped about amongst their relatives\n                    in Singapore. They were also concerned that the defendant’s father would\n                    lose face by their acceptance of such a generous gift from the\n                    intervener’s husband, who was his brother. The couple therefore decided to\n                    take financial responsibility for at least some of the value of the gifted\n                    property, in a bid to maintain a good relationship with the defendant’s\n                    family. 8       The couple had a discussion with the intervener\n                    and her husband. They decided to make voluntary “honour payments”\n                    approximating the downpayment on the Property, on the suggestion of the\n                    intervener and her husband. Therefore, between 24 July 1995 and\n                    29 January 2001, the couple made payments amounting to $331,387.47. A\n                    cheque for $1,387.47 went towards maintenance fees and property taxes payable on\n                    the Property. The balance of the sum of $331,387.47 was paid towards the\n                    downpayment of $376,000. The amount and timing of all the “honour\n                    payments” were at the discretion of the couple. 9       Initially, cheques were issued in favour of the\n                    intervener’s husband. However, from December 1995 onwards, payments were\n                    made to the intervener. This was because the intervener’s husband directed\n                    that payment should be made to the intervener instead of to himself. Therefore,\n                    the couple issued cheques to the intervener even though the gift was known to\n                    stem from the intervener’s husband, and not the intervener\n                herself. 10     Throughout the six years during which the\n                    couple made “honour payments”, the intervener’s husband\n                    reminded them that it was not necessary to reimburse him up to the sum of the\n                    downpayment for the property. He often commented that what the couple had paid\n                    was more than sufficient and they should stop making payments. Of their own\n                    volition, however, they continued to make payments as they were short of their\n                    own personal target figure. 11     Although the last cheque cashed by the\n                    intervener was on 29 January 2001, the couple had issued another cheque for\n                    $10,000 to her in March 2001. When asked, the intervener and her husband told\n                    the couple that they would not be cashing the cheque drawn in March 2001. When\n                    the couple visited the intervener and her husband, they were told that they had\n                    “over-proven” that they were honourable and proud people. The\n                    intervener and her husband wanted them to from then on simply accept the gift\n                    graciously, as it had been originally intended. The intervener’s husband\n                    indicated that he had more money than he knew what to do with and wanted to\n                    share it with those that he cared for while he was still alive and not getting\n                    any younger. The intervener’s husband even pleaded with the couple to just\n                    be gracious and accept the property without any strings attached. After\n                    discussion, the couple agreed. It was a result of this acceptance that no\n                    further honour payments were made and the March 2001 cheque was subsequently\n                    destroyed by the intervener and her husband. 12     The Property was placed on the open market for\n                    sale on 16 January 2007. On 8 February 2007, the couple granted an\n                    option on the Property to a third party. That option was exercised on the same\n                    day. The plaintiff maintained that throughout the whole process, the defendant\n                    had been discussing the sale with the intervener’s husband. However, the\n                    intervener and her husband never raised the issue of the repayment of the\n                    purported loan. The first time that the plaintiff heard about the loan was on\n                    21 May 2007, shortly after an attempted mediation between her and the\n                    defendant had failed.",
        "The intervener’s evidence": "13     The intervener’s evidence, as\n                    corroborated by her husband and the defendant, was that no such gift had\n                    occurred. 14     According to the intervener, she was aware\n                    that the couple had been staying in rented premises throughout their marriage.\n                    Each time the couple renewed their lease, or rented new premises, the rent would\n                    increase. The intervener therefore took it upon herself to suggest that she\n                    would loan them money in order that they could buy an apartment. She told them\n                    that they could repay her in interest-free instalments. 15     In 1995, the intervener was looking for real\n                    estate to invest in when she came across the Property. She asked the couple to\n                    view the Property with her. She had the intention of helping them to purchase\n                    the Property if they liked it. She had also determined that in the event that\n                    the couple did not like the Property, she would purchase it for herself as she\n                    had already paid the 1 per cent booking fee. 16     As the couple liked the Property, she told\n                    them that she would instruct her solicitors to exercise the option under their\n                    names. She loaned them the sum of $1,944,649.82 to purchase the Property. These\n                    moneys, which were paid out of the intervener and her husband’s joint\n                    account, were forwarded directly to the solicitors to pay for the purchase of\n                    the Property. The intervener’s husband was aware of the agreement to loan\n                    to the money to the couple, but he was not part of the transaction. The money\n                    transferred to the solicitors for the purchase of the Property had been banked\n                    into the joint account by the intervener to pay for the transaction. The\n                    intervener’s husband never made any representations regarding the\n                    necessity of reimbursing himself or the intervener for the loan. 17     The intervener denied that she and her husband\n                    were fond of making generous gifts to their relatives. The only gifts admitted\n                    to were the gift of a car to the ex-chairman of their company to reward him for\n                    his loyalty and good service, the gift of a car to her niece so that she could\n                    take her grandmother on outings, and the gift of a Singapore Island Country Club\n                    membership to the defendant. 18     The intervener was very fond of the defendant\n                    because she had brought him up from a very young age when his mother passed\n                    away. Nonetheless, she maintained that she had no intention that the moneys\n                    should be treated as a gift. It was due to the fact that the intervener treated\n                    the defendant as family, that she told him that he could repay her as and when\n                    he had the funds. It was also for this reason that the intervener dispensed with\n                    the need for formal documentation. However, the intervener and the defendant\n                    agreed that if the Property were sold before the couple had completed repaying\n                    her, the sale proceeds would first be used to repay the outstanding amount of\n                    the loan. If there were any profits after that, the couple could keep them.\n                    There was no discussion of making “honour payments”. Neither was\n                    there a formal presentation of the Property as a gift to the\n                couple. 19     Consequent to the arrangements made, the\n                    couple made a first payment of $25,000 to the intervener on 24 July 1995.\n                    Thereafter, they paid various amounts on various dates between 1995 and 2001.\n                    The payments amounted to a total sum of $329,387.47. 20     About late 2000 or early 2001, the intervener\n                    noticed that the couple had difficulty repaying her. After speaking to the\n                    defendant, she agreed to a moratorium of the payments. A 5-year period was\n                    mentioned in passing as the defendant conveyed that it would take him at least\n                    that long to regain his financial footing. Nonetheless, when the couple were\n                    able to afford it, the payments were to start again. The intervener agreed to\n                    the moratorium because she did not want the defendant to feel stressed or\n                    pressured over having to continue making payment. 21     In early 2007, the defendant informed the\n                    intervener that the plaintiff had commenced divorce proceedings against him and\n                    was claiming 75 per cent of the Property. The intervener was concerned that the\n                    balance moneys owed to her would not be repaid. She therefore instructed her\n                    solicitors to write to the couple to remind them of her interest in the\n                    Property. Subsequently, the plaintiff informed her that the plaintiff regarded\n                    the moneys as a gift and not a loan.",
        "The issue": "22     The sole issue to be decided was whether the\n                    intervener gifted the plaintiff and the defendant with the moneys used for the\n                    purchase of the Property.",
        "My decision": "23     I held that the moneys provided by the\n                    intervener were not meant as a gift but as a loan to the plaintiff and\n                    defendant. I set out my reasons below. 24     A gift is a gratuitous transfer of the\n                    ownership of property. The donor has to display a clear intention to transfer\n                    his interest in the object that is being given (see Michael Bridge,Personal Property Law, 3rded., (Oxford, 2006) at 96). As held inYeo Gim Tong Michael v\n                        Tianzon Lolita[1996] 1 SLR(R) 633 at [11]: Where a gift is made, the donor normally has no intention to claim any\n                        interest or share in it and his intention is that the recipient should take\n                        the gift absolutely – that must be his intention, at any rate, at the\n                        time of the gift. On the facts, I was satisfied that there was no such intention.\n                    Rather, the intervener transferred the money used to pay for the Property on the\n                    understanding that it would be repaid.",
        "Schedule of payments": "25     While there was no written agreement\n                    evidencing the loan, the intervener had kept a schedule of payment listing\n                    details such as the amounts paid, the date of payment, the cheque number and the\n                    balance payment due. I accepted the intervener’s evidence that the moneys\n                    used to purchase the Property were provided by her alone and that the schedule\n                    was kept concurrently with the payments made by the couple. The existence of the\n                    schedule indicated that the intervener intended and expected that the moneys\n                    used to purchase the Property would be repaid. Furthermore, the entries in the\n                    schedule indicated fairly regular payment on the part of the couple. The only\n                    extended break in the payments made was from 2001 onwards, when the intervener\n                    granted a debt moratorium, out of her concern for the defendant, her nephew, who\n                    in her view, was facing some financial difficulties at that time. Evidence was\n                    given by an employee of the intervener, one Ms Lim Suay Moi, that it was\n                    her responsibility to keep the schedule and that she had updated the entries in\n                    her own handwriting as and when payments were made. She denied the allegation of\n                    the plaintiff that the evidence regarding the contemporaneous updating of the\n                    schedule was given on the instructions of the intervener or her husband. I saw\n                    no reason to doubt the veracity of Ms Lim’s evidence. 26     It ought to be noted that the plaintiff had\n                    also kept a schedule of the payments made. In fact, the schedule was titled\n                        “Capital Paymentsto Uncle Eu Seng\n                    & Auntie Eva” [emphasis added]. The plaintiff is an accountant and,\n                    as such, must understand the meaning of “capital payments”. These\n                    facts strongly suggested that there was no confusion in the plaintiff’s\n                    mind that the moneys extended were a loan and not a gift. The moneys paid by the\n                    couple were not “honour payments” as the plaintiff had alleged.\n                    The couple was well aware that the Property was bought with the proceeds of a\n                    loan and not a gift. Whilst the plaintiff had alleged that it was the\n                    couple’s intention to repay the “downpayment” which she\n                    specified was the sum of $376,000, it is significant that at the time of\n                    purchase there had not been a downpayment in that amount. The intervener had\n                    paid first a one percent option fee, then nine percent on acceptance (total\n                    $188,000) and then, on completion, the remaining 90% of the price. Further, the\n                    plaintiff’s schedule makes no mention of the agreed downpayment. It only\n                    records the payments made and does not mention the balance due.",
        "Gifts to other persons": "27     The plaintiff submitted that the gift of the\n                    Property was in keeping with other similar gifts of substantial value that the\n                    intervener and her husband had made to relatives. In particular, the plaintiff\n                    alleged that the intervener and her husband had given the defendant’s\n                    brother an apartment in Hong Kong. I rejected her submissions on this point.\n                    First, the defendant’s brother had filed an affidavit denying that the\n                    property in question was gifted to him by either the intervener or her husband.\n                    The plaintiff had not adduced any evidence to prove that the property in Hong\n                    Kong, or any other real property held by any other person for that matter, had\n                    been a gift from the intervener or her husband. Second, the only gifts given by\n                    the intervener or her husband that were proven on the evidence were (a) a Lexus\n                    car to reward the ex-chairman of a company for loyalty and good service, (b)\n                    another car to a niece, and (c) a Singapore Island Country Club membership to\n                    the defendant. These gifts were, comparatively, much smaller in value than the\n                    Property and did not support the conclusion that the intervener or her husband\n                    had been in the habit of making gifts of such substantial value that the gift of\n                    the Property would not be out of the ordinary.",
        "Probative value of affidavits filed by persons other than the\n                plaintiff, the defendant, the intervener and her husband": "28     The plaintiff relied on the evidence in\n                    affidavits filed by persons such as: (a)Maria Buttler, the close personal friend of the\n                            plaintiff and the defendant;(b)Robert J Dorey and Jeanne M Dorey, the\n                            plaintiff’s parents;(c)Robert M Dorey, the plaintiff’s\n                            brother;(d)Debra Dorey and Christina Gray, the\n                            plaintiff’s sisters; and(e)Thomas Ventser, godfather to the\n                            plaintiff’s and defendant’s child.In each of these affidavits, it was asserted that the moneys used to\n                    purchase the Property had been a gift. However, these affidavits were filed by\n                    persons who had no firsthand knowledge of the circumstances in which the\n                    intervener provided moneys for the purchase of the Property. As such, I regarded\n                    the evidence given in such affidavits to be of little probative\n                value.Renovations and credit lines29     The plaintiff made much of the fact that when\n                    she and the defendant had entered into loan agreements with third party\n                    financial institutions using the Property as security collateral for the loans,\n                    they did not declare the existence of a loan by the intervener during the\n                    application process. She reasoned that if there had been a loan by the\n                    intervener, it surely would have been disclosed then.30     On the evidence given, the loan given by the\n                    intervener was interest free, and payable as and when the couple were able. The\n                    couple could dispose of the Property in any manner they liked. The only\n                    restriction was that if the Property were to be sold, the couple would use the\n                    proceeds to repay the intervener for the part of the loan that remained as yet\n                    unpaid, and only thereafter would they pocket the surplus. There was no\n                    requirement that other creditors who took the Property as security had to be\n                    informed of the loan given by the intervener. In the light of these\n                    circumstances, that the couple had not disclosed the loan in the application\n                    process for the loans they took in 1996 and 2002 respectively was not fatal to\n                    finding that the moneys used to purchase the Property had been provided on the\n                    basis of a loan. In fact, their lack of disclosure was understandable since such\n                    disclosure might have prevented them from having their loan applications\n                    approved.The couple’s house-hunting budget31     The plaintiff argued that as the purchase\n                    price of the Property far exceeded the couple’s original house-hunting\n                    budget of $500,000 to $750,000, they could not have accepted the Property on the\n                    basis of anything other than a gift. I did not find that point to be persuasive.\n                    The loan was being extended on very favourable terms to the couple. It was\n                    interest free and payable as and when the couple were able. It is not\n                    inconceivable that given these terms, the couple would find the Property to be\n                    within their means even if the purchase price was beyond their original\n                    budget.Negotiations relating to the division of matrimonial assets32     The plaintiff also argued that the lack of\n                    mention of the loan during negotiations between herself and the defendant\n                    relating to the division of matrimonial assets supported the conclusion that the\n                    moneys extended by the intervener were a gift. In my view, whether or not the\n                    couple expressly mentioned the loan during negotiations concerning the division\n                    of matrimonial assets is not material because whether or not the loan was\n                    mentioned, it would have been understood that any division of the sale proceeds\n                    of the Property could only take place after the debt towards the intervener had\n                    been satisfied.Lack of objection to the sale33     The plaintiff submitted that if there were\n                    indeed a loan, and the intervener had an interest in the sale of the Property,\n                    she would have lodged a caveat to protect her interest. That the intervener did\n                    not object to the sale was, according to the plaintiff, evidence supporting the\n                    case that there had indeed been no loan. The plaintiff also alleged that it was\n                    more than coincidence that the intervener only made her application after a\n                    mediation session between the plaintiff and the defendant had failed. What was\n                    implied was that the intervener’s application had been taken out for\n                    strategic or punitive purposes in support of and for the benefit of the\n                    defendant.34     However, given that the plaintiff had not\n                    adduced credible evidence to show that the intervener was aware that the\n                    Property was to be sold, I accepted the intervener’s explanation that she\n                    had not objected to the sale of the Property because she was not aware that the\n                    Property had been placed on the open market. The plaintiff suggested that the\n                    intervener ought to have been aware of the sale on the basis that the intervener\n                    and her husband sold the unit they owned in the same development within the same\n                    week that the couple sold their apartment. Neither the intervener nor her\n                    husband, however, was the owner of the unit. It had merely been purchased by a\n                    holding company in which the intervener had shares. I found it unlikely that the\n                    intervener would have known of the sale of the Property just because a holding\n                    company in which she had shares had sold an apartment in the same development in\n                    the same week. It was also not proven that discussions had taken place between\n                    the defendant and the intervener or her husband where the sale of the Property\n                    had been mentioned.Timing of the intervener’s application to be joined as a\n                party35     The plaintiff alleged that the\n                    intervener’s application was motivated by a failed mediation session\n                    between the couple concerning the relocation of the plaintiff and her two\n                    children to Australia. I found that there was no support for the proposition\n                    that the intervener’s application to be joined as a party was motivated by\n                    anything other than the desire to recover the loan she had given. There was no\n                    evidence to show that the intervener intended to strategically recover the net\n                    proceeds of the Property only to transfer them to the defendant in circumvention\n                    of the process of the division of matrimonial assets. Neither was there evidence\n                    that the intervener’s action had been brought to put pressure on the\n                    plaintiff regarding ancillary matters to the divorce suit. In fact, although as\n                    evidence that there was no loan, the plaintiff pointed to the defendant’s\n                    letter, which asked the intervener to waive half the amount of the loan, the\n                    intervener’s decision to nonetheless bring a claim for the entire net\n                    proceeds of the sale of the Property buttressed the finding that the\n                    intervener’s claim was not motivated by a desire to assist the\n                    defendant.Conclusion36     For the foregoing reasons, I found that the\n                    money for the purchase of the Property was provided by the intervener as a loan\n                    to the plaintiff and defendant and held that the net proceeds of the sale of the\n                    Property had to be released to her. Costs were fixed at $8,000 plus reasonable\n                    disbursements, to be paid by the plaintiff to the intervener.",
        "Renovations and credit lines": "29     The plaintiff made much of the fact that when\n                    she and the defendant had entered into loan agreements with third party\n                    financial institutions using the Property as security collateral for the loans,\n                    they did not declare the existence of a loan by the intervener during the\n                    application process. She reasoned that if there had been a loan by the\n                    intervener, it surely would have been disclosed then. 30     On the evidence given, the loan given by the\n                    intervener was interest free, and payable as and when the couple were able. The\n                    couple could dispose of the Property in any manner they liked. The only\n                    restriction was that if the Property were to be sold, the couple would use the\n                    proceeds to repay the intervener for the part of the loan that remained as yet\n                    unpaid, and only thereafter would they pocket the surplus. There was no\n                    requirement that other creditors who took the Property as security had to be\n                    informed of the loan given by the intervener. In the light of these\n                    circumstances, that the couple had not disclosed the loan in the application\n                    process for the loans they took in 1996 and 2002 respectively was not fatal to\n                    finding that the moneys used to purchase the Property had been provided on the\n                    basis of a loan. In fact, their lack of disclosure was understandable since such\n                    disclosure might have prevented them from having their loan applications\n                    approved.",
        "The couple’s house-hunting budget": "31     The plaintiff argued that as the purchase\n                    price of the Property far exceeded the couple’s original house-hunting\n                    budget of $500,000 to $750,000, they could not have accepted the Property on the\n                    basis of anything other than a gift. I did not find that point to be persuasive.\n                    The loan was being extended on very favourable terms to the couple. It was\n                    interest free and payable as and when the couple were able. It is not\n                    inconceivable that given these terms, the couple would find the Property to be\n                    within their means even if the purchase price was beyond their original\n                    budget.",
        "Negotiations relating to the division of matrimonial assets": "32     The plaintiff also argued that the lack of\n                    mention of the loan during negotiations between herself and the defendant\n                    relating to the division of matrimonial assets supported the conclusion that the\n                    moneys extended by the intervener were a gift. In my view, whether or not the\n                    couple expressly mentioned the loan during negotiations concerning the division\n                    of matrimonial assets is not material because whether or not the loan was\n                    mentioned, it would have been understood that any division of the sale proceeds\n                    of the Property could only take place after the debt towards the intervener had\n                    been satisfied.",
        "Lack of objection to the sale": "33     The plaintiff submitted that if there were\n                    indeed a loan, and the intervener had an interest in the sale of the Property,\n                    she would have lodged a caveat to protect her interest. That the intervener did\n                    not object to the sale was, according to the plaintiff, evidence supporting the\n                    case that there had indeed been no loan. The plaintiff also alleged that it was\n                    more than coincidence that the intervener only made her application after a\n                    mediation session between the plaintiff and the defendant had failed. What was\n                    implied was that the intervener’s application had been taken out for\n                    strategic or punitive purposes in support of and for the benefit of the\n                    defendant. 34     However, given that the plaintiff had not\n                    adduced credible evidence to show that the intervener was aware that the\n                    Property was to be sold, I accepted the intervener’s explanation that she\n                    had not objected to the sale of the Property because she was not aware that the\n                    Property had been placed on the open market. The plaintiff suggested that the\n                    intervener ought to have been aware of the sale on the basis that the intervener\n                    and her husband sold the unit they owned in the same development within the same\n                    week that the couple sold their apartment. Neither the intervener nor her\n                    husband, however, was the owner of the unit. It had merely been purchased by a\n                    holding company in which the intervener had shares. I found it unlikely that the\n                    intervener would have known of the sale of the Property just because a holding\n                    company in which she had shares had sold an apartment in the same development in\n                    the same week. It was also not proven that discussions had taken place between\n                    the defendant and the intervener or her husband where the sale of the Property\n                    had been mentioned.",
        "Timing of the intervener’s application to be joined as a\n                party": "35     The plaintiff alleged that the\n                    intervener’s application was motivated by a failed mediation session\n                    between the couple concerning the relocation of the plaintiff and her two\n                    children to Australia. I found that there was no support for the proposition\n                    that the intervener’s application to be joined as a party was motivated by\n                    anything other than the desire to recover the loan she had given. There was no\n                    evidence to show that the intervener intended to strategically recover the net\n                    proceeds of the Property only to transfer them to the defendant in circumvention\n                    of the process of the division of matrimonial assets. Neither was there evidence\n                    that the intervener’s action had been brought to put pressure on the\n                    plaintiff regarding ancillary matters to the divorce suit. In fact, although as\n                    evidence that there was no loan, the plaintiff pointed to the defendant’s\n                    letter, which asked the intervener to waive half the amount of the loan, the\n                    intervener’s decision to nonetheless bring a claim for the entire net\n                    proceeds of the sale of the Property buttressed the finding that the\n                    intervener’s claim was not motivated by a desire to assist the\n                    defendant.",
        "Conclusion": "36     For the foregoing reasons, I found that the\n                    money for the purchase of the Property was provided by the intervener as a loan\n                    to the plaintiff and defendant and held that the net proceeds of the sale of the\n                    Property had to be released to her. Costs were fixed at $8,000 plus reasonable\n                    disbursements, to be paid by the plaintiff to the intervener."
    }
}