{
    "case_title": "The “Catur Samudra”",
    "ncitation": "[2010] SGHC 18",
    "coram": "Steven Chong JC",
    "sections": {
        "Introduction": "1       This case raises novel and interesting issues of\n                    statutory construction relating to the admiralty jurisdiction of the High Court.\n                    It concerns the arrest of a vessel owned by a company which had agreed to\n                    guarantee the liabilities of a related company as charterer under a separate and\n                    independent charterparty. The dispute requires an examination of the scope of\n                    the “sister ship” arrest rule and in particular whether a ship\n                    owned by a guarantor can constitute a “sister ship” for the\n                    purpose of the High Court (Admiralty Jurisdiction) Act (Cap 123, 2001 Rev\n                    Ed) (“HCAJA”). Specifically it would entail an examination of two\n                    issues: (a)whether a claim under a guarantee would be a\n                            claim arising out of an agreement relating to the use or hire of a\n                            vessel; and(b)whether the party who would be liable in personam\n                            under the guarantee was in possession or in control of the vessel at the\n                            time when the cause of action arose.2       Over the last 50 years or so since the\n                    International Convention Relating to the Arrest of Seagoing Ships (“the\n                    1952 Arrest Convention”) came into force in 1952, the provisions of the\n                    HCAJA and its equivalent in other jurisdictions such as the UK, Hong Kong and\n                    Australia have been the subject of intense judicial scrutiny. It has generated\n                    numerous judicial decisions on the scope and width of the right of arrest.\n                    During this period, the law on this area has never been static and is constantly\n                    evolving. To illustrate the dynamic nature of admiralty law, at one time it was\n                    decided by none other than the House of Lords that the “sister\n                    ship” arrest rule was only restricted to ships in common ownership by the\n                    same defendant: seeThe Eschersheim[1976]\n                    2 Lloyd’s Rep 1 (“The\n                        Eschersheim”). The Court of Appeal inThe Permina 108[1977] 1 MLJ 49 (“The Permina 108”) declined to followThe Eschersheimwhen it allowed the arrest of a vessel\n                    owned by a charterer even though it had no common ownership with the vessel\n                    under which the cause of action arose. Eventually, other jurisdictions including\n                    the UK adopted ThePermina 108in preference toThe Eschersheim: see the UK decision inThe Span Terza[1982] 1 Lloyd’s Rep\n                    225, the Hong Kong decision inThe Sextum[1982]\n                    HKLR 356, and the New Zealand decision inThe Fua\n                        Kavenga[1987] 1 NZLR 550 (“The\n                        Fua Kavenga”).3       The evolving nature of this branch of the law is\n                    hardly surprising given that the right of arrest in the hands of creditors can\n                    be an effective tool (in many instances the only way) to secure payment and the\n                    use of the ship (free from arrest) is the principal source to generate operating\n                    income for the owners. Shipowners and claimants are therefore constantly seeking\n                    to re-define the boundaries. However, the two issues before me have not\n                    specifically been the subject of judicial pronouncement by the courts in any of\n                    the leading maritime nations. The only decision which has dealt with a similar\n                    situation was the decision of the High Court of New Zealand inThe Fua Kavenga. For the reasons set out below, I have\n                    declined to follow it. On close scrutiny ofThe Fua\n                        Kavenga, although the case concerned the right of arrest of a\n                    vessel arising from a similar claim under a guarantee, the two issues before me\n                    were not specifically considered. Having said that, even if they had been\n                    considered, I would nonetheless have arrived at the same outcome. In the result,\n                    I set aside the writ of summons and, consequently, the arrest of the vessel. I\n                    now give my reasons for so doing.Background facts4       The plaintiff is the registered owner of the\n                    vesselMahakam. The defendant is PT Humpuss\n                    Intermoda Transportasi Tbk (“HIT”), a company incorporated and\n                    registered under the laws of Indonesia and has been listed on the Jakarta Stock\n                    Exchange since 24 November 1997. It is also listed on the Surabaya Stock\n                    Exchange.5       Pursuant to a Memorandum of Agreement dated\n                    11 December 2007, the plaintiff purchased theMahakamfrom Heritage Maritime Ltd, SA\n                    (“Heritage”) for a total consideration of US$67m. On the same day,\n                    pursuant to a Bareboat Charterparty (“Bareboat C/P”) under an\n                    amended BARECON 2001 form, theMahakamwas leased\n                    back by the plaintiff to Heritage for a period of 60 months. Essentially, this\n                    was a sale and lease back arrangement.6       It was a condition precedent under the Bareboat\n                    C/P for HIT to execute a guarantee in favour of the plaintiff to secure the due\n                    performance and payment of Heritage’s obligations under the charterparty.\n                    Clause 36 of the Bareboat C/P provides, inter alia, as follows:Notwithstanding anything to the contrary in this Charter, the obligation\n                        of the Owners to charter the Vessel to the Charterers under this Charter is\n                        subject to and conditional upon the following (other than Clause 36.14) and\n                        the obligation of the Charterers to take the Vessel on charter from the\n                        Owners under this Charter is subject to and conditional upon Clauses 36.11,\n                        36.13 and 36.14 being true and accurate at the Delivery Date:-…36.11 each of the\n                            parties thereto having executed and delivered in agreed\n                        form:36.11.1 the Sellers’ Credit Agreement; and36.11.2 the Charter Assignment together with the duly signed notice of\n                            assignment from the Charterers to any sub-charterer36.11.3the duly executed guarantee to be provided\n                                by the Guarantor[emphasis added]7       The guarantee was duly executed by HIT on\n                    11 December 2007, the same day the Bareboat C/P was signed.8       Heritage is a wholly-owned subsidiary of Humpuss\n                    Sea Transport Pte Ltd (“HST”), a company incorporated in\n                    Singapore. HST is in turn a wholly-owned subsidiary of HIT.9       Under the terms of the Bareboat C/P, Heritage\n                    agreed and/or undertook,inter alia, to:(a)pay charterhire at US$38,500 per day monthly in\n                            advance on the first day of every calendar month;(b)maintain and repair theMahakam;(c)keep theMahakaminsured; and(d)pay interest on such charterhire from the date of\n                            such failure to the date of actual payment at the rate of 2% above\n                            LIBOR.10     Pursuant to the Bareboat C/P, theMahakamwas delivered to Heritage on 13 December\n                    2007. Thereafter, the charterparty proceeded without any significant incident\n                    until April 2009. On 16 April 2009, Heritage defaulted on the payment of\n                    the charterhire. Heritage failed to pay charterhire for the period from\n                    16 April 2009 till 15 June 2009.11     On 22 June 2009, the plaintiff issued a\n                    notice to Heritage to terminate the Bareboat C/P pursuant to cl. 46.2. The\n                    notice of termination required Heritage to redeliver theMahakamto the plaintiff and it was so redelivered on\n                    23 June 2009.Other legal proceedings12     After Heritage defaulted on the Bareboat C/P,\n                    the plaintiff commenced various proceedings against HIT, HST and Heritage. In\n                    May 2009, the plaintiff commenced an action in New York against Heritage and HIT\n                    seeking damages for breach of the Bareboat C/P. In the New York proceedings, the\n                    plaintiff obtained anex-parteorder to restrain\n                    Heritage and HIT from dealing with property in the hands of specific garnishee\n                    intermediary banks up to a limit of US$2,247,117.72. This attachment is commonly\n                    referred to as the Rule B Order. However, the total sum which was attached\n                    pursuant to the New York Rule B Order was only US$352,500.44.13     In June 2009 the plaintiff obtained a further\n                    Rule B Order in Connecticut against HIT, HST, Heritage and Genuine Maritime\n                    Limited, which is another wholly-owned subsidiary of HST. The sum actually\n                    caught by the Connecticut Rule B Order amounted to only US$70,000. Arising from\n                    the severe downturn in the freight market, many banks in New York were inundated\n                    with multiple Rule B Orders on a daily basis. In October 2009, the Second\n                    Circuit Court of Appeals of the Southern District of New York issued its\n                    decision inShipping Corporation of India v Jaldhi Pte\n                        Ltd. 585 F.3d 58, 71 (2d Cir.2009). The court held that Rule B\n                    Orders are not available to attach electronic fund transfers in the possession\n                    of intermediary banks for processing. Arising from this decision, many New York\n                    Rule B Orders have since been discharged. Indeed on 8 December 2009, the\n                    New York Rule B Order which was obtained by the plaintiff against HIT and\n                    Heritage was set aside. However, the Connecticut Rule B Order remains in\n                    place.14     On 12 June 2009, the plaintiff arrested\n                    theMahakamin Malaysia in respect of their claim\n                    against Heritage under the Bareboat C/P. TheMahakamwas eventually redelivered to the plaintiff and she was\n                    released from arrest on 24 June 2009. It was agreed between the plaintiff\n                    and Heritage that the claim under the Bareboat C/P would be referred to\n                    arbitration in London pursuant to cl 30 and 54 of the Bareboat C/P. Indeed\n                    on or about 31 August 2009, the plaintiff served their Points of Claim\n                    against Heritage for unpaid charterhire under the Bareboat C/P in the London\n                    arbitration.Invocation of admiralty jurisdiction15     On 5 September 2009, the plaintiff arrested\n                    theCatur Samudrain the present proceedings. It\n                    is not in dispute that theCatur Samudrais owned\n                    by HIT.16     It is clear from the indorsement of claim that\n                    the plaintiff’s claim against HIT in this action is solely under the\n                    guarantee dated 11 December 2007 for payment of outstanding charterhire due\n                    and owing by Heritage and for damages for breaches of the Bareboat C/P. The\n                    total amount claimed is stated to be US$30,777,566.44.17     The admiralty jurisdiction of the High Court\n                    has been invoked by the plaintiff against theCatur\n                        Samudraon the following basis:(a)     The plaintiff’s claim against\n                        HIT under the guarantee is brought under s 3(1)(h) of the HCAJA being a claim arising out of an agreement\n                        relating to the use or hire of theMahakam.(b)     At the time when the cause of action arose against HIT under the\n                        guarantee, HIT was in possession or in control of theMahakam.18     On 14 October 2009, HIT filed an\n                    application for,inter alia, the following\n                    orders:(a)the writ of summons filed in this action be\n                            struck out and/or set aside pursuant to O 18 r 19 of the Rules\n                            of Court (Cap 322, R 5, 2006 Rev Ed) and/or the inherent jurisdiction of\n                            the court;(b)the warrant of arrest obtained by the plaintiff\n                            in this action and the arrest of HIT’s vessel in this action by\n                            the plaintiff be set aside;(c)the plaintiff do pay HIT damages for the wrongful\n                            arrest of the vessel; and(d)the costs of the action herein and this\n                            application be paid by the plaintiff to HIT.19     HIT’s application is founded on the\n                    following grounds:(a)there was improper invocation of the admiralty\n                            jurisdiction of the court by the plaintiff over HIT’s vessel,Catur Samudra;(b)the writ of summons disclosed no reasonable cause\n                            of action and/or is scandalous, frivolous or vexatious and/or otherwise\n                            an abuse of the process of the court;(c)the plaintiff failed to disclose or made\n                            insufficient disclosure of material facts in the affidavit in support of\n                            the warrant of arrest; and(d)the plaintiff’s arrest of theCatur Samudrawas maliciously\n                        procured.20     When the application came before me, counsel\n                    for HIT confirmed that they were only proceeding on the sole ground that the\n                    admiralty jurisdiction was wrongly invoked against theCatur\n                        Samudra. Specifically, HIT’s jurisdictional challenge was\n                    premised on two grounds:(a)the plaintiff’s claim under the guarantee\n                            does not fall within s 3(1)(h) of the\n                            HCAJA; and(b)HIT was not in possession or in control of theMahakamat the time when the cause of\n                            action arose.21     Counsel for HIT confirmed that they were not\n                    relying on non-disclosure or that the writ of summons did not disclose any\n                    reasonable or arguable cause of action. However, it was apparent that the\n                    plaintiff was not aware prior to the hearing that HIT was no longer relying on\n                    these two alternative arguments. The plaintiff had prepared extensive\n                    submissions to deal with both points. It is good practice and professional\n                    courtesy to inform the opposing party in advance of the hearing if a party\n                    should decide to abandon any point or issue which arises from the application.\n                    This practice should be encouraged as it will save time and costs for all\n                    parties including the court.Burden of proof22     It is well settled and not in dispute that the\n                    burden of proof is on the plaintiff to satisfy all the jurisdictional\n                    requirements laid down in s 4(4) of the HCAJA in order to successfully\n                    invoke the admiralty jurisdiction against theCatur\n                        Samudra: seeThe Maritime Trader[1981] 2 Lloyd’s Rep 153 (“The Maritime\n                        Trader”) at 157 andThe Andres\n                        Bonifacio[1991] 2 MLJ 371 (“The Andres Bonifacio”).23     It is also trite that the plaintiff must\n                    satisfy the burden of proof on a balance of probabilities: seeThe Aventicum[1978] 1 Lloyd’s Rep 184 at 190\n                    andThe Alexandrea[2002] 3 SLR 56 at[18]. Equally, it is not in dispute that\n                    the question of admiralty jurisdiction must be decided based on the affidavit\n                    evidence before the court and should not be tried as an issue (save for\n                    exceptional circumstances which do not apply here):It follows as a matter of principle that any question of jurisdiction,\n                        such as the question in the present motions, must be dealt with on the\n                        motions, and cannot be dealt with as an issue in the actions- per Goff L J inThe I Congresco[1977] 1 Lloyd’s Rep 536 at 559.24     In order to invoke the admiralty jurisdiction\n                    of the High Court against theCatur Samudra, four\n                    conditions under s 4(4) of the HCAJA must first be satisfied (seeThe Permina 108[1977] 1 MLJ 43 at 45 andThe Inai Selasih[2005] 4 SLR 1 at\n                    [6]). These conditions are:(a)The claim is mentioned in section 3 (1) (d)\n                            to (q);(b)The claim arises in connection with the\n                            ship;(c)The person who would be liable on the claim in an\n                            action in personam (referred to in this subsection as the relevant\n                            person) was, when the cause of action arose, the owner or charterer of,\n                            or in possession or in control of, the ship;(d)At the time when the action is brought, the\n                            relevant person is the beneficial owner as respect all the shares in the\n                            other ship against which an action in rem is brought.25     As regards sub-para (a), HIT denies that the\n                    claim under the guarantee falls within s 3(1)(h). There is no dispute that the requirements under sub-paras\n                    (b) and (d) are satisfied. As regards sub-para (c), this condition may be\n                    further broken into two sub-conditions:(i)     That the person proceeded against,ie, HIT, must either be the owner or\n                        charterer of, or in possession or in control of theMahakamat the time when the cause of action arose. The\n                        plaintiff alleged that HIT was in possession or in control of theMahakam. This is disputed by HIT;(ii)     That HIT is the person who would be\n                        liable to the plaintiff under the guarantee in an action in personam. This\n                        requirement is not disputed since HIT was indeed the party who executed the\n                        guarantee.First issue - Whether the plaintiff’s claim under the guarantee\n                issued by HIT would be a claim arising out of an agreement relating to the\n                charterparty in respect of theMahakam26     Counsel for the plaintiff advanced the\n                    following arguments that the claim under the guarantee falls within the scope of\n                        s 3(1)(h) of the HCAJA:(a)     The provisions of the HCAJA\n                        including s 3(1)(h) are to be given a\n                        “broad and liberal construction.” –The Antonis P Lemos[1985] AC 711\n                            (“The Antonis P\n                            Lemos”),The\n                            Indriani[1996] 1 SLR 305 (“The Indriani“) andThe\n                            Mara[2000] 4 SLR 156 (“The Mara“) were cited in support.(b)     The guarantee issued by HIT would\n                        constitute an agreement relating to the charterparty of theMahakamas the provision of the guarantee was stated\n                        to be a condition precedent to the Bareboat C/P. Initially,The Fua Kavengawas cited in support. Subsequently,\n                        the decision of the Federal Court of Canada,National\n                            Bank Leasing v Merlac Marine Inc(1992) 52 Federal Trial\n                        Reports 15 (“National Bank\n                        Leasing”) was also cited in aid of this\n                        construction.(c)     The Bareboat C/P in respect of theMahakamwas specifically referred to in the guarantee.27     On the other hand, counsel for HIT put forward\n                    the following rival contentions:(a)     There are two connecting phrases in\n                            s 3(1)(h) of the HCAJA. While\n                        “arising out of” has been given a wide and liberal\n                        construction, the other connecting phrase “relating to” is\n                        more relevant. The courts have consistently applied a narrow and restricted\n                        interpretation of the phrase “relating to”.The Fua Kavengashould not be followed since the court did\n                        not address this vital difference.(b)     The guarantee was for the financial protection of the\n                        plaintiff and was strictly unnecessary for the use or hire of theMahakam.(c)     The identification of theMahakamin the guarantee is not\n                decisive.28     Section 3(1)(h)\n                    of the HCAJA reads as follows:3.—(1) The admiralty jurisdiction of the High Court shall be as\n                        follows, that is to say, jurisdiction to hear and determine any of the\n                        following questions or claims:…(h) any claim arising out of any agreement\n                                relating to thecarriage of goods in a ship\n                            or to the use or hire of a ship; [emphasis added]29     It is apparent that there are two connecting\n                    phrases which govern the proper construction of s 3(1)(h),ie, “arising out\n                    of” and “relating to”.Effect of the expression “arising out of”30     For many years, it was considered to be\n                    settled law that a claim in tort falls within the UK equivalent of\n                        s 3(1)(h): seeThe St\n                        Elefterio[1957] P 179 at 183:[t]he words…are…wide enough to cover claims whether in\n                        contract or in tort arising out of any agreement relating to the carriage of\n                        goods in a ship.31     About 30 years later, counsel for the\n                    shipowners, Mark Saville QC (now Lord Saville) inThe Antonis\n                        P Lemossought to venture into unchartered waters in submitting\n                    that s 20(2)(h) of the UK Supreme Court Act\n                    1981 (inpari materiawith s 3(1)(h) of the HCAJA) only applied to claims of a purely\n                    contractual nature. After reviewing the relevant authorities, the House of Lords\n                    inThe Antonis P Lemosheld that the expression\n                    “arising out of” should be given its wider meaning of\n                    “connected with” and not the narrower meaning of “arising\n                    under”. InThe Antonis P Lemos, the claim\n                    was brought by the sub-sub-charterer against the shipowner in the tort of\n                    negligence for failing to ensure that the draft of the vessel did not exceed 32\n                    feet upon arrival at the port of discharge which thereby caused additional\n                    expenses to lighten the vessel. Accordingly, the effect of the holding is that\n                        s 20(2)(h) of the UK Act is wide enough\n                    to encompass a claim in tort even though there was no direct contractual\n                    relationship between the sub-sub charterer and the shipowner. However, it is\n                    relevant to highlight that inThe Antonio P Lemos,\n                    the claim in tort arose from a sub-sub charter. There can be no dispute that a\n                    sub-sub-charter like any other charterparty is an agreement relating to the use\n                    or hire of a vessel.32The MaraandThe Indrianicited by the plaintiff do not\n                    assist either. In both cases, the courts were concerned with the interpretation\n                    of the expression “arising out of”. InThe\n                        Mara, the Court of Appeal held that a claim for contractual\n                    compensation in respect of personal injuries payable under a collective\n                    agreement was a claim arising out of loss of life or personal injury under\n                        s 3(1)(f) of the HCAJA. InThe Indriani, consistent with the broad and liberal\n                    application of “arising out of” under s 3(1)(h), the Court of Appeal affirmed the decision of the\n                    lower court that a claim for malicious falsehood arising from the issuance of a\n                    clean bill of lading was a claim arising out of an agreement relating to the use\n                    or hire of a vessel. It could hardly be disputed that a claim under a bill of\n                    lading was indeed a claim arising out of an agreement relating to the use or\n                    hire of the vessel. While the courts have leaned towards a broad interpretation\n                    of the expression “arising out of” to enlarge the types of claims\n                    as falling within s 3(1)(h), they have,\n                    however, adopted a narrow interpretation to restrict the claims only under\n                    agreements which are in themselves related to the use or hire of a\n                    vessel.Ambit of the expression “relating to” – Direct\n                Connection Test33     In the present case, counsel for the defendant\n                    rightly focussed on the more relevant expression “relating to”.\n                    The House of Lord inGatoil International Inc v\n                        Arkwright-Boston Manufacturers Mutual Insurance Co[1985] AC 255\n                        (“The Sandrina”) reviewed the\n                    previous authorities and formulated the test that to constitute “an\n                    agreement relating to the use or hire of a ship” the agreement must have\n                    some “reasonably direct connection with such activities” (at 271).\n                    InThe Sandrina, the contract of insurance\n                    arranged by the shipowner for cargo shipped onboard the vessel was found to lack\n                    the “direct connection” and hence outside the ambit of\n                        s 20(2)(h) of the UK act. For the same\n                    reason, an agreement for salvage services inThe\n                        Eschersheimwas found to fall within the UK equivalent of\n                        s 3(1)(h) because the rendering of\n                    salvage services directly involved the use of a salvage vessel Similarly, the\n                    agreement for mooring and unmooring services inThe Queen of\n                        the South[1968] 1 All ER 1163 (“The\n                        Queen of the South”) directly involved the use of motor\n                    boats in providing the services.34     In deciding on the scope of the expression\n                    “relating to”, it is useful to refer to decisions where claims\n                    which have some appearance of a connection with the use or hire of a vessel were\n                    nevertheless held to fall outside the equivalent of s 3(1)(h):(a)     InThe\n                            Tesaba[1982] 1 Lloyd's Rep 397 (“The Tesaba”), the claim by the salvors\n                        against the shipowner was for failure to use best endeavours to ensure that\n                        cargo interests provide security prior to the release of the cargo in breach\n                        of the salvage agreement.(b)     InThe Sandrina, the claim\n                        was by the cargo insurers for unpaid premiums for insurance arranged by the\n                        shipowner on the cargo carried onboard the vessel.(c)     InThe\n                            Aifanourios(1980) SC 346(“The Aifanourios”), the claim was by the\n                        P&I insurers for unpaid release calls in respect of the vessel payable\n                        by the shipowner.(d)     InThe Bumbesti[1999]\n                        2 Lloyd’s Rep 481 (“The\n                            Bumbesti”), the claim was to enforce an arbitration\n                        award arising from a breach of a charterparty.(e)     Finally, a claim for outstanding hire payable\n                        under an agreement for the hire of containers previously held to be within\n                        the equivalent of s 3(1)(h) inThe Sonia S[1983] 2 Lloyd’s Rep 63\n                        was observed inThe Sandrinato have been\n                        wrongly decided and should be overruled.35     In each of the above cases, the claims were\n                    made under agreements which by themselves were not agreements relating to the\n                    use or hire of a vessel. This is to be contrasted withThe\n                        EschersheimandThe Queen of the\n                        Southwhere the claims were based on agreements which directly\n                    related to the use or hire of a vessel. In the present case, the guarantee is\n                    not an agreement which in itself relates to the use or hire of theMahakam. The sole purpose of the guarantee was to\n                    provide financial protection to the plaintiff against the risk of default by\n                    Heritage under the Bareboat C/P. In similar vein, inThe\n                        Aifanourios, although it was clear that the insurance of a vessel\n                    is a matter directed to the convenience and protection of the owner, it was held\n                    to be outside the scope of the equivalent of s 3(1)(h) because it was “... not essential for the operation of\n                    the vessel as such” (per Lord Wylie at 350). Equally, in each of these\n                    cases, the claims were based on separate agreements which were one step removed\n                    from the agreement for the use or hire of a vessel. The claims were based on\n                    agreements which wereindirectlyrelated to the\n                    use or hire of the vessels.36     This is consistent with the approach adopted\n                    by Aikens J inThe Bumbestiat 487 –\n                    488:(2) However, thatagreement to refer disputes is not,\n                            itself, an “agreement in relation to the use or hire of a\n                            ship”. This is because\n                        the arbitration agreement, whether it is the individual reference or the\n                        general agreement to refer, is a contract that is distinct from the\n                        principal contract, i.e. the bareboat charter-party in this\n                        case…(3) … The agreement to refer to arbitration individual disputes\n                        that have arisen out of a charter-party, or the agreement to refer future\n                        disputes in general that arise out of a charter-party, must be agreements\n                        that areindirectly“in relation to the\n                        use or hire of a ship”. But, in my view, they are not agreements that\n                        aresufficiently directly“in relation\n                        to the use or hire of a ship”The arbitration agreement is, at least, one step removed\n                            from the “use or hire” of a ship. The breach of contract\n                            relied upon to found the present claim has nothing to do with the use or\n                            hire of the ship; it concerns the implied term to fulfil any\n                        award made pursuant to the agreement to refer disputes. In my view the\n                        breach of the contract relied on when suing on an award does not have the\n                        “reasonably direct connection with” the use or hire of the\n                        ship that Lord Keith held in theGatoilcase\n                        was necessary to found jurisdiction...[emphasis in bold italics added]37     The plaintiff relied on the fact that under\n                    the Bareboat C/P, it was a condition precedent for HIT to execute the guarantee.\n                    On this basis, it was submitted that the guarantee must be an agreement relating\n                    to the Bareboat C/P since without the guarantee, there would have been no\n                    Bareboat C/P of theMahakam. In my view, an\n                    agreement which in itself is not an agreement intrinsically related to the use\n                    or hire of a vessel cannot be transformed into such an agreement simply by\n                    characterising it as a term or condition precedent of the charterparty. This\n                    would have the effect of altering the “direct connection” test\n                    into a “but for” test. If such a test is to be adopted, it would\n                    mean that an agreement for example to lease a building or to sell shares in a\n                    company which are framed as condition precedents to a charterparty wouldipso factobecome an agreement relating to the\n                    use or hire of a vessel. Such a submission would enlarge the admiralty\n                    jurisdiction of the High Court to cover claims which were never contemplated to\n                    have the right of arrest. Similarly, it is not uncommon for shipowners to insist\n                    on the incorporation of an arbitration agreement in the charterparty. In this\n                    way, it could be said that “but for” the arbitration agreement,\n                    the shipowner would not enter into the charterparty. However, as pointed out inThe Bumbesti, a claim to enforce an\n                    arbitration award arising out of the charterparty is at best a claim which isindirectlyrelated to the use or hire of the\n                    vessel.38     In the course of the hearing before me, I\n                    enquired from counsel for the plaintiff whether there is any authority that a\n                    claim brought under a collateral or separate agreement independent of the\n                    charterparty or bill of lading has been held to fall within\n                        s 3(1)(h). Initially, TheFua Kavengawas the only authority cited. Subsequently\n                    after the hearing and before I rendered my oral judgment, the plaintiff’s\n                    counsel also citedNational Bank Leasingin their\n                    further arguments. In setting aside the writ and the warrant of arrest, I\n                    informed the parties that I will explain why I have declined to follow these two\n                    decisions in my written grounds.39     InThe Fua\n                        Kavenga, the court dealt with several issues of admiralty\n                    jurisdiction in addition to sovereign immunity andres\n                        judicata. The main discussion on admiralty jurisdiction was\n                    whether New Zealand should adopt the UK approach of “sister ship”\n                    arrest inThe Eschersheimor the Singapore\n                    position inThe Permina 108. After analysing the\n                    conflicting views, the court preferred and adoptedThe\n                        Permina 108. Smellie J referred toThe\n                        Antonis P Lemosthat the expression “arising out\n                    of” (which is found in the New Zealand equivalent in s 4(1) of the\n                    Admiralty Act, 1973) is to be construed widely as “connected\n                    with”. AlthoughThe Sandrinawas also\n                    cited, there was no analysis in the judgment why despite the narrow\n                    interpretation of the relevant expression “relating to”, the claim\n                    under the guarantee was nevertheless found to be a claim relating to the use or\n                    hire of a vessel. This was not disputed by counsel for the plaintiff during the\n                    hearing. It seems to me that Smellie J after citingThe\n                        Antonis P Lemosas authority for the wide interpretation of the\n                    expression “arising out of” assumed that the broad interpretation\n                    should govern the entire sub-section without addressing how that was to be\n                    reconciled with the narrower expression of “relating\n                to”.40     InNational Bank\n                        Leasing, the Federal Court of Canada had to consider whether a\n                    claim under a Guarantee Bond which guaranteed the performance of a charterer\n                    fell within its jurisdiction.41     The Federal Court held that it had\n                    jurisdiction because the claim arose out of an agreement relating to the use or\n                    hire of a ship by charterparty within the meaning of s 22(2)(i) of the Federal Court Act, RSC 1985. It is apparent\n                    that the Canadian provision is practically identical to s 3(1)(h) of the HCAJA. In arriving at its decision, the\n                    Federal Court did not refer to and consequently did not consider any of the\n                    leading UK authorities on point. Instead, the Federal Court, after referring to\n                    the statement of claim that “the possible liability of the\n                    defendant… under the Lease Guarantee Bond [arises] out of the\n                    default...under the charterparty”, held that the claim “arises out\n                    of an agreement (the Lease Guarantee Bond) relating to the use or hire of a ship\n                    (as governed by the charterparty)”(at[6]). The Federal Court also observed that the claim under the\n                    Lease Guarantee Bond was inseparably linked to the charterparty. This appears to\n                    be akin to the “but for” test. The decision was therefore bereft\n                    of any serious analysis of the relevant narrow expression “relating\n                    to” and does not provide any useful assistance to the present\n                    case.42     The Australian approach of the “direct\n                    connection” test inPort of Geelong Authority v The\n                        Bass Reefer(1992) Federal Court Reports 374 (“The Bass Reefer”) is instructive. In that case,\n                    the plaintiff port authority, entered into a leasing agreement with the\n                    defendant shipowner. Under the agreement, the plaintiff agreed to provide some\n                    land for the defendant’s ships to handle container cargo and a priority\n                    berthing licence to the defendant. The plaintiff brought an in rem claim against\n                    the defendant’s ship for outstanding fees under the agreement. The court\n                    held that both claims fell outside the ambit of the equivalent\n                        s 3(1)(h). It held at 381 to 382:I ask myself, therefore, whether the agreement for lease in this case\n                        relevantly relates to the carriage of goods by the defendant ship or to its\n                        use or hire. I apply the test asto whether there is a\n                            strong argument for the existence of a reasonably direct connection\n                            between either of these agreements and those activities. I am\n                        satisfied that there is not. So far as connection with the carriage of goods\n                        by the defendant ship, it is not unreasonable to bear in mind that the\n                        decision in Gatoil rejected the contention that the contract of insurance of\n                        goods so carried was sufficiently connected. In the present case, so far as\n                        the lease is concerned, its purpose and effect, as previously indicated, was\n                        to provide a conveniently close area for the receipt of cargo from the ship\n                        and the assembly of cargo to be taken on board the ship. It might\n                        conceivably be said that these procedures had a connection with the\n                        operations of loading and unloading cargo to and from the ship. I express no\n                        concluded view as to that. However, I am satisfied that there is no\n                        reasonably direct connection between them and the actual carriage of goods\n                        by the ship. There is even less connection, in my view, between those\n                        activities and the use or hire of the ship.The licence\n                            agreement, the main feature of which was to provide priority berthing\n                            for the ship at the nominated berth has, in my opinion, no reasonably\n                            direct connection with the carriage of goods by the ship.\n                        Although the licence agreement has the effect of providing a regular berth\n                        for the ship, the effect of this is to provide a facility, at best, for use\n                        by the ship. It does not have any significant connection with the use of the\n                        ship itself. Finally, I can see no significant connection between the\n                        licence agreement and the hire of the ship.[emphasis added]43     The claims were held to be outside the\n                    provision because the lease agreement had little to do with the carriage of\n                    goods by the defendant’s ship or its use and hire. In the present case,\n                    the guarantee provided by HIT was strictly not for or related to the use or hire\n                    of theMahakam. It seems to me that if a claim is\n                    brought under an agreement which is collateral or ancillary to the contract of\n                    carriage, that collateral or ancillary agreement must also be intrinsically\n                    related to the use or hire of a vessel. If the collateral agreement is not\n                    intrinsically an agreement relating to the use or hire of a vessel such as a\n                    contract of insurance, container leasing agreement, an arbitration agreement in\n                    the charterparty or the guarantee in the present case, it would fall outside the\n                    purview of s 3(1)(h).44     In determining whether a claim can be\n                    considered to fall under s 3(1)(h), it would\n                    be useful to pose the question, “How did the claim arise?” The\n                    answer in this case would be “under the guarantee”. The next\n                    relevant question would be, “Did the guarantee relate to the use or hire\n                    of theMahakam?” The answer to that would\n                    be in the negative. This approach was adopted by Sheen J inThe Stella Nova[1981] Com L R 200, which I found\n                    it to be a usefulindiciumfor the direct\n                    connection test.45     In the course of the hearing, I also invited\n                    the parties to address me on the UK decision ofThe\n                        Zeus[1888] 13 PD 188. In that case, the charterparty\n                    provided that the vessel was to proceed to a port to load a full and complete\n                    cargo of coal from a colliery against a guarantee from the colliery to pay\n                    demurrage to the ship owner if the loading was not completed within 48 hours\n                    upon arrival. The court held that although the term demurrage was used in the\n                    colliery guarantee, the claim was not based on an agreement relating to the use\n                    or hire of the vessel. Significantly, the court held (at 190) that\n                    “unless it can be established that the agreement is one in relation to\n                    the use or hire of a ship the fact that the word “demurrage” is\n                    used is immaterial.” Counsel for the plaintiff sought to distinguishThe Zeuson the basis that unlike the present\n                    case, the provision of the guarantee was not a condition precedent to the\n                    charterparty. Although it may not have been expressed as a condition precedent,\n                    it was nonetheless specifically provided in the charterparty itself that the\n                    loading of the vessel was on condition of the colliery guarantee annexed to the\n                    charterparty. The decisive reason why the colliery guarantee inThe Zeuswas held not to be an agreement relating to the\n                    use or hire of a ship was not because of the manner in which the condition was\n                    expressed, but rather because the guarantee in itself did not relate to the use\n                    or hire of a ship. Interestingly,The Zeuswas\n                    decided almost a century before the “direct connection” test was\n                    expounded inThe Sandrina.46     Finally, I will deal with the\n                    plaintiff’s remaining submission that in cases where the agreements were\n                    held to be outside s 3(1)(h) of the HCAJA,\n                    typically the vessels were not referred to in the agreements unlike the present\n                    case where the Bareboat C/P of theMahakamwas\n                    expressly referred to in the recital of the guarantee. From my analysis of the\n                    relevant authorities, I do not regard this distinction to be material, much less\n                    critical. InThe Eschersheim, andThe Queen of the South, the vessels were both not\n                    specifically mentioned in the agreements and yet they were held to be within the\n                    UK equivalent of s 3(1)(h). However, inThe Zeus,The\n                        AifanouriosandThe Bumbesti, by\n                    way of illustrations, the vessels were referred to in the agreements but they\n                    were still held to be outside the ambit of the provision. The express reference\n                    of the vessels in the agreements is therefore clearly not decisive. InThe EschersheimandThe Queen of the\n                        South, the agreements in themselves related to the use or hire of\n                    the vessels even though the vessels were not named in the agreements. On the\n                    other hand, inThe Zeus,The\n                        AifanouriosandThe Bumbesti,\n                    despite the express reference of the vessels in the agreements, they were held\n                    to be outside the provision simply because those agreements were one step\n                    removed from the agreements which related to the use or hire of the vessel and\n                    hence lacked the requisite “direct connection”.Second issue – whether HIT was in possession or control of theMahakamat the time when the cause of action under\n                the guarantee arose47     This issue arises for determination under\n                        s 4(4)(b) of the HCAJA. At the time when\n                    the cause of action accrued against HIT under the guarantee, it is not essential\n                    that HIT must be the owner of theMahakam. This\n                    requirement is equally satisfied so long as HIT was either the charterer or in\n                    possession or in control of theMahakamat the\n                    time when the cause of action arose.48     It is therefore apposite to embark on the\n                    analysis by first determining when the cause of action against HIT\n                    accrued.49     The principal claim by the plaintiff against\n                    Heritage under the Bareboat C/P was for outstanding arrears of charterhire due\n                    and owing since 16 April 2009. The Bareboat C/P was eventually terminated\n                    on 22 June 2009 due to non-payment of the charterhire and for other\n                    breaches of the Bareboat C/P. As the guarantee issued by HIT was to secure the\n                    performance and payment of Heritage’s obligations under the Bareboat C/P,\n                    it is safe to conclude that the cause of action accrued no earlier than\n                    16 April 2009. This was not disputed by the plaintiff. Therefore, the\n                    inquiry as to whether HIT was in possession or in control of theMahakamshould be directed during this time\n                    frame.To lift or not to lift the corporate veil50     The plaintiff relies on the following\n                    materials to show that HIT was in possession or in control of theMahakamat the time when the cause of action\n                    arose:(a)     Heritage is a shell corporation\n                        through which HIT conducts its business and it has no separate independent\n                        identity from HIT.(b)     HIT uses Heritage as their “paying/receiving agent” in\n                        order to insulate itself from creditors.(c)     Heritage is essentially the “chartering\n                        arm” of HIT.(d)     HIT makes, receives, approves and/or directs payments on behalf of\n                        its wholly owned subsidiaries including Heritage.(e)     HIT and Heritage share common\n                        ownership, operations and/or premises.(f)     Heritage is the wholly owned subsidiary of HST which is\n                        in turn a wholly owned subsidiary of HIT(g)     Both HIT and Heritage have at least one common\n                        director and authorised signatory in Bobby Andika.(h)     Agus Darjanto as a common director to\n                        both HIT and Heritage signed the guarantee and the Bareboat C/P on behalf of\n                        both parties.(i)     HIT took over possession and control of theMahakamin or about June 2009 when they provided their crew\n                        to take over theMahakamat Belawan, Indonesia\n                        from the crew supplied by the previous managers of\n                Heritage.51     On the basis of the above matters, counsel for\n                    the plaintiff submitted that “Heritage and PT Humpus should properly be\n                    considered as a single economic unit with no corporate distinction between them,\n                    thus rendering each liable for the debts of the other.”52     It seems to me that the plaintiff was\n                    effectively inviting the court to lift the corporate veil in order to show that\n                    HIT was in reality the charterers of theMahakamunder the Bareboat C/P. These same matters were also referred to in the\n                    affidavit filed by Fredrik Platou in support of the warrant of arrest. In the\n                    same affidavit, the plaintiff alleged that HIT is the alter ego of Heritage. In\n                    the light of these assertions, it would appear that the plaintiff was seeking to\n                    lift the corporate veil in order to show that HIT was in truth the charterers of\n                    theMahakam. On this basis, HIT prepared\n                    substantial submissions to respond to the plaintiff’s perceived attempt to\n                    lift the corporate veil.53     However, on a plain reading of the indorsement\n                    in the writ of summons, it was clear that the plaintiff’s claim against\n                    HIT was solely based on the guarantee. There is no separate or alternative claim\n                    against HIT under the Bareboat C/P. Accordingly, at the commencement of the\n                    hearing, I sought clarification from the plaintiff’s counsel whether she\n                    was seeking to lift the corporate veil. She confirmed that the claim as indorsed\n                    in the writ of summons is based solely on the guarantee and that she was not\n                    attempting to lift the corporate veil in spite of the assertions in the\n                    affidavit in support of the warrant of arrest.54     Implicit in the plaintiff’s confirmation\n                    is their acknowledgment that the materials which they were relying on do not\n                    justify the lifting of the corporate veil. It is plainly inconsistent and\n                    incongruous for the plaintiff to rely on the same materials to show that HIT was\n                    in possession or in control of theMahakamhaving\n                    accepted that Heritage was the bareboat charterers of theMahakamat all material times. As earlier observed, the\n                    plaintiff has commenced London arbitration proceedings against Heritage for the\n                    outstanding charterhire under the Bareboat C/P.55     The establishment of one-ship companies within\n                    a group of companies is a well-known and legitimate practice in the shipping\n                    industry: seeThe Evpo Agnic[1988] 2\n                    Lloyd’s Rep 411 at 415 (“The Evpo\n                        Agnic”). There have been numerous unsuccessful attempts to\n                    lift the corporate veil in the context of one-ship companies with common\n                    shareholdings and/or directors: seeThe Evpo\n                    Agnic,The Maritime Trader,The Neptune[1986] HKLR 345,The Andres Bonifacio,The\n                        Interippu[1990] SGHC 131 (“The\n                        Interippu”) andThe Skaw\n                        Prince[1994] 3 SLR 379. The court may be minded to\n                    lift the corporate veil if there are exceptional circumstances which indicate\n                    the presence of a façade or sham set up to deceive or to perpetrate a fraud: seeThe Aventicum,The Saudi\n                        Prince[1982] 2 Lloyd’s Rep 255 andWin Line (UK) Ltd v Masterpart (Singapore) Pte Ltd[2000]\n                    2 SLR 98 at 116-117.56     None of the exceptional circumstances exist in\n                    the present case to warrant the piercing of the corporate veil. No allegation of\n                    fraud was raised by the plaintiff. That explains why the plaintiff did not\n                    attempt to lift the corporate veil. After all, the plaintiff chose and agreed to\n                    enter into the Bareboat C/P with Heritage with full knowledge that Heritage is\n                    related to HIT. In fact, the plaintiff accepted the guarantee from HIT on that\n                    basis.Person “in possession or in control” of the\n                vessel57     Section 4(4)(b)\n                    of the HCAJA refers to 3 different entities:(a)owner;(b)charterer; and(c)person in possession or in control58     These different entities concern parties with\n                    substantive as opposed to nominal or formal interest in relation to the ship:\n                    seeThe Ohm Mariana[1993] 2 SLR 698 at\n                    710 (“The Ohm\n                Mariana”).59     Under Singapore law, an owner refers to the\n                    beneficial owner who is vested with the right of sale: seeThe Ohm Mariana. It is not restricted only to the registered\n                    owners as was found to be the case inThe Evpo\n                        Agnic. Charterer would include voyage, time, demise or even slot\n                    charterers. Each of these charterers would have legally enforceable rights in\n                    relation to the employment of the ship. By the same token, a named charterer\n                    under a sham charterparty is not a charterer within the meaning of\n                        s 4(4)(b) of the HCAJA as the sham\n                    charterparty does not give rise to any legally enforceable rightsquacharterer: seeThe Inai\n                        Selasih.60     Similarly as rightly observed by Chao JC\n                    (as he then was) inThe Interippu, the term\n                    “in possession or in control” must mean possession or control\n                    “as an independent legal right”. Chao JC stated that:I am afraid there is hardly any evidence to show that Corporate Shipping\n                        were in possession or control of “Engineer 103”. The fact that\n                        H H Wong was managing “Engineer 103” does not necessarily mean\n                        that Corporate Shipping were therefore in control or possession of\n                        “Engineer 103”. After all, H H Wong was at the relevant time a\n                        director of both companies, one being the holding company and the other a\n                        subsidiary company. Something more than just a common shareholding or\n                        manager/director is required to sustain a claim of “possession or\n                        control”, otherwise, it would sweep aside the entire concept of\n                        corporate structures and entities. I am inclined to accept the submission of\n                        the Defendants that the term “in possession or in control” in\n                        section 4(4) must mean possession or control as an independent legal right;\n                        or at least the possession or control must be pursuant to a specific\n                        arrangement.61     It does not refer to physical possession or\n                    controlper se. Such a person would include a\n                    demise charterer (seeThe Span Terza[1982]\n                    1 Lloyd’s Rep 225 at 227), a salvor in possession (seeThe Evpo Agnicat 414), a purchaser under a\n                    conditional sale agreement (seeThe Permina 3001[1977] 1 MLJ 141 at 144), and a person who is in a position of a\n                    demise charterer albeit not under a demise charter (seeThe\n                        Evpo Agnicat 414). It would also cover a mortgagee in possession\n                    who has taken over the vessel following the default of the mortgagor. The common\n                    denominator is that each of them has legally enforceable rights as regards\n                    possession or control of the vessel.62     The matters relied on are largely material in\n                    relation to an attempt to lift the corporate veil which the plaintiff conceded\n                    they were not seeking to do. In any event, none of them either singly or\n                    collectively would justify the veil to be pierced. Based on the evidence before\n                    me, Heritage has substantial assets in excess of US$30m. It maintains its own\n                    bank accounts with Bank Negara Indonesia, CMIB Bank and BNP Paribas. The fact\n                    that it does not maintain its own employees is not remarkable in itself. It is\n                    not uncommon for wholly owned subsidiaries to share and use office premises and\n                    employees with their parents or the ultimate holding company. The plaintiff also\n                    referred to various emails to suggest that HIT had paid the ship management fees\n                    for theMahakamand had arranged to pay various\n                    expenses on behalf of Heritage. However, the evidence suggest otherwise. While\n                    HIT may have been involved in the payment process, the evidence indicate that\n                    the payments were made from Heritage’s bank accounts.63     Even if HIT has control over Heritage directly\n                    or through HST, it is strictly irrelevant for the present purposes since it is a\n                    fundamental principle of company law that a shareholder has no property, legal\n                    or equitable, in the assets of the company: seeThe Maritime\n                        Traderat 157 andThe Interippuat\n                    6. Furthermore, having control over Heritage does not translate into\n                    “possession or control” over theMahakam.64     The plaintiff also relied on the Ship\n                    Management Agreement dated 14 December 2007 under which HIT was appointed\n                    by Heritage to manage theMahakam. In July 2008,\n                    Heritage appointed an independent company, Seaquestsandigan Pte Ltd\n                    (“Seaquestsandigan”) to take over the management of the vessel\n                    from HIT. Accordingly, HIT were not even the ship managers of the vessel in\n                    April 2009 when the cause of action accrued. The plaintiff alleged that\n                    Seaquestsandigan’s appointment was limited only to the technical and\n                    crewing responsibilities and that all other management duties remained with HIT.\n                    Even accepting the plaintiff’s submission, the management of theMahakampursuant to an appointment by Heritage does not\n                    vest any legally enforceable rights on HIT as regards possession or control over\n                    theMahakam. It would be wrong to treat ship\n                    managers as being “in possession or in control” of a vessel. Their\n                    responsibilities over the vessel arise by reason of their appointment by the\n                    principal. If the managers should exercise any rights of control or possession\n                    over the vessel, it would be on behalf of their principal and not as an\n                    independent legal right. The appointment can be terminated by the principal just\n                    as in this case when Heritage appointed Seaquestsandigan to take over from HIT\n                    in July 2008.65     Further, the plaintiff submitted that the\n                    supply of crew by HIT for theMahakamat Belawan,\n                    Indonesia in June 2009 amounted to taking possession or control over the vessel.\n                    According to the affidavit of Capt Thanabalasingam s/o Balakrishnan, the crew\n                    was supplied by HIT following his request on behalf of Heritage after\n                    Seaquestsandigan removed their crew from theMahakamupon the termination of their ship management agreement.\n                    The supply of crew was therefore not to enable HIT to take over physical\n                    possession or control of theMahakamfrom\n                    Seaquestsandigan or even Heritage, but rather to enable the vessel to be manned\n                    at the request of Heritage after Seaquestsandigan removed their\n                crew.66     The plaintiff also relied on the decision of\n                    the Federal Court of Australia inMalaysia Shipyard and\n                        Engineering Sdn Bhd v Iron Shortland[1995] FCA 1565\n                        (“Iron Shortland”). In that case\n                    the claimant sought and succeeded in lifting the corporate veil to show that the\n                    parent company, Capeco Maritime NV (“Capeco Maritime”) was the\n                    beneficial owner of the two vessels,Iron\n                        ShortlandandNewcastle Prideeven\n                    though they were registered in the names of their wholly owned subsidiaries. The\n                    finding was based on the evidence presented by the claimant. Having found that\n                    Capeco Maritime was the beneficial owner of the vessel, the court observed that\n                    the “evidence at least establishes that Capeco Maritime was in possession\n                    or control of theNewcastle Pride”. The\n                    facts are therefore entirely different from the present case. First, the\n                    plaintiff concedes that they are not seeking to lift the corporate veil. In any\n                    event, the lifting of the corporate veil in theIron\n                        Shortlandwas based on the specific evidence presented in that\n                    case. Secondly, as Capeco Maritime was found to be the beneficial owner of the\n                    vessel,a fortiorithey would be in possession or\n                    in control of the vessel.67     Finally, the plaintiff also relied onThe Fua Kavenga. Any inquiry as to whether a\n                    person was “in possession or in control” of a vessel is primarily\n                    a question of fact taking into account the applicable legal principles. As such,\n                    the mere fact that a person who had provided a guarantee was found to be\n                    “in possession or in control” of a vessel in one case does not\n                    mean that all guarantors would likewise be treated in the same way. Each case\n                    must necessarily be decided on its own facts.The Fua\n                        Kavengadoes not provide any useful guidance on this issue. In\n                    fact, counsel for the plaintiff accepted that this issue was not properly\n                    considered. The court appeared to have accepted that the guarantor inThe Fua Kavengawas “in possession or in\n                    control” of the vessel because the chartererers were “in a variety\n                    of ways the agent or alter ego of the (guarantor)”: at 567. Furthermore,\n                    Smellie J also referred to the submission by counsel on the lifting of the\n                    corporate veil without any indication whether the veil would be lifted on the\n                    evidence before him. Given that there was no analysis as to why the guarantor\n                    was determined to be a person “in possession or in control” of the\n                    vessel and since there is no issue for the lifting of the corporate veil in the\n                    instant case unlikeThe Fua Kavenga, with respect,\n                    I do not find the decision to be instructive.Conclusion68     I therefore hold that the plaintiff has failed\n                    to satisfy me on the two jurisdictional issues raised by HIT. Failure to satisfy\n                    either would be fatal. In the result, the admiralty jurisdiction of the High\n                    Court was improperly invoked against HIT’s vessel,Catur Samudra. Accordingly, it is axiomatic that the writ of\n                    summons and the warrant of arrest must be set aside which I so ordered on\n                    21 December 2009. HIT is awarded costs of the action as well as the\n                    application to be taxed if not agreed.69     HIT has a remaining prayer for damages for\n                    wrongful arrest. When I delivered my oral judgment, I provisionally indicated\n                    subject to full arguments from both parties that this was perhaps not an\n                    appropriate case for damages to be awarded. I, however, adjourned the prayer\n                    with liberty to HIT to restore it for hearing before me within 14 days from the\n                    date of the oral decision. 14 days have since elapsed and HIT has elected not to\n                    proceed with the claim for wrongful arrest.",
        "Background facts": "4       The plaintiff is the registered owner of the\n                    vesselMahakam. The defendant is PT Humpuss\n                    Intermoda Transportasi Tbk (“HIT”), a company incorporated and\n                    registered under the laws of Indonesia and has been listed on the Jakarta Stock\n                    Exchange since 24 November 1997. It is also listed on the Surabaya Stock\n                    Exchange. 5       Pursuant to a Memorandum of Agreement dated\n                    11 December 2007, the plaintiff purchased theMahakamfrom Heritage Maritime Ltd, SA\n                    (“Heritage”) for a total consideration of US$67m. On the same day,\n                    pursuant to a Bareboat Charterparty (“Bareboat C/P”) under an\n                    amended BARECON 2001 form, theMahakamwas leased\n                    back by the plaintiff to Heritage for a period of 60 months. Essentially, this\n                    was a sale and lease back arrangement. 6       It was a condition precedent under the Bareboat\n                    C/P for HIT to execute a guarantee in favour of the plaintiff to secure the due\n                    performance and payment of Heritage’s obligations under the charterparty.\n                    Clause 36 of the Bareboat C/P provides, inter alia, as follows: Notwithstanding anything to the contrary in this Charter, the obligation\n                        of the Owners to charter the Vessel to the Charterers under this Charter is\n                        subject to and conditional upon the following (other than Clause 36.14) and\n                        the obligation of the Charterers to take the Vessel on charter from the\n                        Owners under this Charter is subject to and conditional upon Clauses 36.11,\n                        36.13 and 36.14 being true and accurate at the Delivery Date:- … 36.11 each of the\n                            parties thereto having executed and delivered in agreed\n                        form: 36.11.1 the Sellers’ Credit Agreement; and 36.11.2 the Charter Assignment together with the duly signed notice of\n                            assignment from the Charterers to any sub-charterer 36.11.3the duly executed guarantee to be provided\n                                by the Guarantor [emphasis added] 7       The guarantee was duly executed by HIT on\n                    11 December 2007, the same day the Bareboat C/P was signed. 8       Heritage is a wholly-owned subsidiary of Humpuss\n                    Sea Transport Pte Ltd (“HST”), a company incorporated in\n                    Singapore. HST is in turn a wholly-owned subsidiary of HIT. 9       Under the terms of the Bareboat C/P, Heritage\n                    agreed and/or undertook,inter alia, to: (a)pay charterhire at US$38,500 per day monthly in\n                            advance on the first day of every calendar month;(b)maintain and repair theMahakam;(c)keep theMahakaminsured; and(d)pay interest on such charterhire from the date of\n                            such failure to the date of actual payment at the rate of 2% above\n                            LIBOR.10     Pursuant to the Bareboat C/P, theMahakamwas delivered to Heritage on 13 December\n                    2007. Thereafter, the charterparty proceeded without any significant incident\n                    until April 2009. On 16 April 2009, Heritage defaulted on the payment of\n                    the charterhire. Heritage failed to pay charterhire for the period from\n                    16 April 2009 till 15 June 2009.11     On 22 June 2009, the plaintiff issued a\n                    notice to Heritage to terminate the Bareboat C/P pursuant to cl. 46.2. The\n                    notice of termination required Heritage to redeliver theMahakamto the plaintiff and it was so redelivered on\n                    23 June 2009.Other legal proceedings12     After Heritage defaulted on the Bareboat C/P,\n                    the plaintiff commenced various proceedings against HIT, HST and Heritage. In\n                    May 2009, the plaintiff commenced an action in New York against Heritage and HIT\n                    seeking damages for breach of the Bareboat C/P. In the New York proceedings, the\n                    plaintiff obtained anex-parteorder to restrain\n                    Heritage and HIT from dealing with property in the hands of specific garnishee\n                    intermediary banks up to a limit of US$2,247,117.72. This attachment is commonly\n                    referred to as the Rule B Order. However, the total sum which was attached\n                    pursuant to the New York Rule B Order was only US$352,500.44.13     In June 2009 the plaintiff obtained a further\n                    Rule B Order in Connecticut against HIT, HST, Heritage and Genuine Maritime\n                    Limited, which is another wholly-owned subsidiary of HST. The sum actually\n                    caught by the Connecticut Rule B Order amounted to only US$70,000. Arising from\n                    the severe downturn in the freight market, many banks in New York were inundated\n                    with multiple Rule B Orders on a daily basis. In October 2009, the Second\n                    Circuit Court of Appeals of the Southern District of New York issued its\n                    decision inShipping Corporation of India v Jaldhi Pte\n                        Ltd. 585 F.3d 58, 71 (2d Cir.2009). The court held that Rule B\n                    Orders are not available to attach electronic fund transfers in the possession\n                    of intermediary banks for processing. Arising from this decision, many New York\n                    Rule B Orders have since been discharged. Indeed on 8 December 2009, the\n                    New York Rule B Order which was obtained by the plaintiff against HIT and\n                    Heritage was set aside. However, the Connecticut Rule B Order remains in\n                    place.14     On 12 June 2009, the plaintiff arrested\n                    theMahakamin Malaysia in respect of their claim\n                    against Heritage under the Bareboat C/P. TheMahakamwas eventually redelivered to the plaintiff and she was\n                    released from arrest on 24 June 2009. It was agreed between the plaintiff\n                    and Heritage that the claim under the Bareboat C/P would be referred to\n                    arbitration in London pursuant to cl 30 and 54 of the Bareboat C/P. Indeed\n                    on or about 31 August 2009, the plaintiff served their Points of Claim\n                    against Heritage for unpaid charterhire under the Bareboat C/P in the London\n                    arbitration.Invocation of admiralty jurisdiction15     On 5 September 2009, the plaintiff arrested\n                    theCatur Samudrain the present proceedings. It\n                    is not in dispute that theCatur Samudrais owned\n                    by HIT.16     It is clear from the indorsement of claim that\n                    the plaintiff’s claim against HIT in this action is solely under the\n                    guarantee dated 11 December 2007 for payment of outstanding charterhire due\n                    and owing by Heritage and for damages for breaches of the Bareboat C/P. The\n                    total amount claimed is stated to be US$30,777,566.44.17     The admiralty jurisdiction of the High Court\n                    has been invoked by the plaintiff against theCatur\n                        Samudraon the following basis:(a)     The plaintiff’s claim against\n                        HIT under the guarantee is brought under s 3(1)(h) of the HCAJA being a claim arising out of an agreement\n                        relating to the use or hire of theMahakam.(b)     At the time when the cause of action arose against HIT under the\n                        guarantee, HIT was in possession or in control of theMahakam.18     On 14 October 2009, HIT filed an\n                    application for,inter alia, the following\n                    orders:(a)the writ of summons filed in this action be\n                            struck out and/or set aside pursuant to O 18 r 19 of the Rules\n                            of Court (Cap 322, R 5, 2006 Rev Ed) and/or the inherent jurisdiction of\n                            the court;(b)the warrant of arrest obtained by the plaintiff\n                            in this action and the arrest of HIT’s vessel in this action by\n                            the plaintiff be set aside;(c)the plaintiff do pay HIT damages for the wrongful\n                            arrest of the vessel; and(d)the costs of the action herein and this\n                            application be paid by the plaintiff to HIT.19     HIT’s application is founded on the\n                    following grounds:(a)there was improper invocation of the admiralty\n                            jurisdiction of the court by the plaintiff over HIT’s vessel,Catur Samudra;(b)the writ of summons disclosed no reasonable cause\n                            of action and/or is scandalous, frivolous or vexatious and/or otherwise\n                            an abuse of the process of the court;(c)the plaintiff failed to disclose or made\n                            insufficient disclosure of material facts in the affidavit in support of\n                            the warrant of arrest; and(d)the plaintiff’s arrest of theCatur Samudrawas maliciously\n                        procured.20     When the application came before me, counsel\n                    for HIT confirmed that they were only proceeding on the sole ground that the\n                    admiralty jurisdiction was wrongly invoked against theCatur\n                        Samudra. Specifically, HIT’s jurisdictional challenge was\n                    premised on two grounds:(a)the plaintiff’s claim under the guarantee\n                            does not fall within s 3(1)(h) of the\n                            HCAJA; and(b)HIT was not in possession or in control of theMahakamat the time when the cause of\n                            action arose.21     Counsel for HIT confirmed that they were not\n                    relying on non-disclosure or that the writ of summons did not disclose any\n                    reasonable or arguable cause of action. However, it was apparent that the\n                    plaintiff was not aware prior to the hearing that HIT was no longer relying on\n                    these two alternative arguments. The plaintiff had prepared extensive\n                    submissions to deal with both points. It is good practice and professional\n                    courtesy to inform the opposing party in advance of the hearing if a party\n                    should decide to abandon any point or issue which arises from the application.\n                    This practice should be encouraged as it will save time and costs for all\n                    parties including the court.Burden of proof22     It is well settled and not in dispute that the\n                    burden of proof is on the plaintiff to satisfy all the jurisdictional\n                    requirements laid down in s 4(4) of the HCAJA in order to successfully\n                    invoke the admiralty jurisdiction against theCatur\n                        Samudra: seeThe Maritime Trader[1981] 2 Lloyd’s Rep 153 (“The Maritime\n                        Trader”) at 157 andThe Andres\n                        Bonifacio[1991] 2 MLJ 371 (“The Andres Bonifacio”).23     It is also trite that the plaintiff must\n                    satisfy the burden of proof on a balance of probabilities: seeThe Aventicum[1978] 1 Lloyd’s Rep 184 at 190\n                    andThe Alexandrea[2002] 3 SLR 56 at[18]. Equally, it is not in dispute that\n                    the question of admiralty jurisdiction must be decided based on the affidavit\n                    evidence before the court and should not be tried as an issue (save for\n                    exceptional circumstances which do not apply here):It follows as a matter of principle that any question of jurisdiction,\n                        such as the question in the present motions, must be dealt with on the\n                        motions, and cannot be dealt with as an issue in the actions- per Goff L J inThe I Congresco[1977] 1 Lloyd’s Rep 536 at 559.24     In order to invoke the admiralty jurisdiction\n                    of the High Court against theCatur Samudra, four\n                    conditions under s 4(4) of the HCAJA must first be satisfied (seeThe Permina 108[1977] 1 MLJ 43 at 45 andThe Inai Selasih[2005] 4 SLR 1 at\n                    [6]). These conditions are:(a)The claim is mentioned in section 3 (1) (d)\n                            to (q);(b)The claim arises in connection with the\n                            ship;(c)The person who would be liable on the claim in an\n                            action in personam (referred to in this subsection as the relevant\n                            person) was, when the cause of action arose, the owner or charterer of,\n                            or in possession or in control of, the ship;(d)At the time when the action is brought, the\n                            relevant person is the beneficial owner as respect all the shares in the\n                            other ship against which an action in rem is brought.25     As regards sub-para (a), HIT denies that the\n                    claim under the guarantee falls within s 3(1)(h). There is no dispute that the requirements under sub-paras\n                    (b) and (d) are satisfied. As regards sub-para (c), this condition may be\n                    further broken into two sub-conditions:(i)     That the person proceeded against,ie, HIT, must either be the owner or\n                        charterer of, or in possession or in control of theMahakamat the time when the cause of action arose. The\n                        plaintiff alleged that HIT was in possession or in control of theMahakam. This is disputed by HIT;(ii)     That HIT is the person who would be\n                        liable to the plaintiff under the guarantee in an action in personam. This\n                        requirement is not disputed since HIT was indeed the party who executed the\n                        guarantee.First issue - Whether the plaintiff’s claim under the guarantee\n                issued by HIT would be a claim arising out of an agreement relating to the\n                charterparty in respect of theMahakam26     Counsel for the plaintiff advanced the\n                    following arguments that the claim under the guarantee falls within the scope of\n                        s 3(1)(h) of the HCAJA:(a)     The provisions of the HCAJA\n                        including s 3(1)(h) are to be given a\n                        “broad and liberal construction.” –The Antonis P Lemos[1985] AC 711\n                            (“The Antonis P\n                            Lemos”),The\n                            Indriani[1996] 1 SLR 305 (“The Indriani“) andThe\n                            Mara[2000] 4 SLR 156 (“The Mara“) were cited in support.(b)     The guarantee issued by HIT would\n                        constitute an agreement relating to the charterparty of theMahakamas the provision of the guarantee was stated\n                        to be a condition precedent to the Bareboat C/P. Initially,The Fua Kavengawas cited in support. Subsequently,\n                        the decision of the Federal Court of Canada,National\n                            Bank Leasing v Merlac Marine Inc(1992) 52 Federal Trial\n                        Reports 15 (“National Bank\n                        Leasing”) was also cited in aid of this\n                        construction.(c)     The Bareboat C/P in respect of theMahakamwas specifically referred to in the guarantee.27     On the other hand, counsel for HIT put forward\n                    the following rival contentions:(a)     There are two connecting phrases in\n                            s 3(1)(h) of the HCAJA. While\n                        “arising out of” has been given a wide and liberal\n                        construction, the other connecting phrase “relating to” is\n                        more relevant. The courts have consistently applied a narrow and restricted\n                        interpretation of the phrase “relating to”.The Fua Kavengashould not be followed since the court did\n                        not address this vital difference.(b)     The guarantee was for the financial protection of the\n                        plaintiff and was strictly unnecessary for the use or hire of theMahakam.(c)     The identification of theMahakamin the guarantee is not\n                decisive.28     Section 3(1)(h)\n                    of the HCAJA reads as follows:3.—(1) The admiralty jurisdiction of the High Court shall be as\n                        follows, that is to say, jurisdiction to hear and determine any of the\n                        following questions or claims:…(h) any claim arising out of any agreement\n                                relating to thecarriage of goods in a ship\n                            or to the use or hire of a ship; [emphasis added]29     It is apparent that there are two connecting\n                    phrases which govern the proper construction of s 3(1)(h),ie, “arising out\n                    of” and “relating to”.Effect of the expression “arising out of”30     For many years, it was considered to be\n                    settled law that a claim in tort falls within the UK equivalent of\n                        s 3(1)(h): seeThe St\n                        Elefterio[1957] P 179 at 183:[t]he words…are…wide enough to cover claims whether in\n                        contract or in tort arising out of any agreement relating to the carriage of\n                        goods in a ship.31     About 30 years later, counsel for the\n                    shipowners, Mark Saville QC (now Lord Saville) inThe Antonis\n                        P Lemossought to venture into unchartered waters in submitting\n                    that s 20(2)(h) of the UK Supreme Court Act\n                    1981 (inpari materiawith s 3(1)(h) of the HCAJA) only applied to claims of a purely\n                    contractual nature. After reviewing the relevant authorities, the House of Lords\n                    inThe Antonis P Lemosheld that the expression\n                    “arising out of” should be given its wider meaning of\n                    “connected with” and not the narrower meaning of “arising\n                    under”. InThe Antonis P Lemos, the claim\n                    was brought by the sub-sub-charterer against the shipowner in the tort of\n                    negligence for failing to ensure that the draft of the vessel did not exceed 32\n                    feet upon arrival at the port of discharge which thereby caused additional\n                    expenses to lighten the vessel. Accordingly, the effect of the holding is that\n                        s 20(2)(h) of the UK Act is wide enough\n                    to encompass a claim in tort even though there was no direct contractual\n                    relationship between the sub-sub charterer and the shipowner. However, it is\n                    relevant to highlight that inThe Antonio P Lemos,\n                    the claim in tort arose from a sub-sub charter. There can be no dispute that a\n                    sub-sub-charter like any other charterparty is an agreement relating to the use\n                    or hire of a vessel.32The MaraandThe Indrianicited by the plaintiff do not\n                    assist either. In both cases, the courts were concerned with the interpretation\n                    of the expression “arising out of”. InThe\n                        Mara, the Court of Appeal held that a claim for contractual\n                    compensation in respect of personal injuries payable under a collective\n                    agreement was a claim arising out of loss of life or personal injury under\n                        s 3(1)(f) of the HCAJA. InThe Indriani, consistent with the broad and liberal\n                    application of “arising out of” under s 3(1)(h), the Court of Appeal affirmed the decision of the\n                    lower court that a claim for malicious falsehood arising from the issuance of a\n                    clean bill of lading was a claim arising out of an agreement relating to the use\n                    or hire of a vessel. It could hardly be disputed that a claim under a bill of\n                    lading was indeed a claim arising out of an agreement relating to the use or\n                    hire of the vessel. While the courts have leaned towards a broad interpretation\n                    of the expression “arising out of” to enlarge the types of claims\n                    as falling within s 3(1)(h), they have,\n                    however, adopted a narrow interpretation to restrict the claims only under\n                    agreements which are in themselves related to the use or hire of a\n                    vessel.Ambit of the expression “relating to” – Direct\n                Connection Test33     In the present case, counsel for the defendant\n                    rightly focussed on the more relevant expression “relating to”.\n                    The House of Lord inGatoil International Inc v\n                        Arkwright-Boston Manufacturers Mutual Insurance Co[1985] AC 255\n                        (“The Sandrina”) reviewed the\n                    previous authorities and formulated the test that to constitute “an\n                    agreement relating to the use or hire of a ship” the agreement must have\n                    some “reasonably direct connection with such activities” (at 271).\n                    InThe Sandrina, the contract of insurance\n                    arranged by the shipowner for cargo shipped onboard the vessel was found to lack\n                    the “direct connection” and hence outside the ambit of\n                        s 20(2)(h) of the UK act. For the same\n                    reason, an agreement for salvage services inThe\n                        Eschersheimwas found to fall within the UK equivalent of\n                        s 3(1)(h) because the rendering of\n                    salvage services directly involved the use of a salvage vessel Similarly, the\n                    agreement for mooring and unmooring services inThe Queen of\n                        the South[1968] 1 All ER 1163 (“The\n                        Queen of the South”) directly involved the use of motor\n                    boats in providing the services.34     In deciding on the scope of the expression\n                    “relating to”, it is useful to refer to decisions where claims\n                    which have some appearance of a connection with the use or hire of a vessel were\n                    nevertheless held to fall outside the equivalent of s 3(1)(h):(a)     InThe\n                            Tesaba[1982] 1 Lloyd's Rep 397 (“The Tesaba”), the claim by the salvors\n                        against the shipowner was for failure to use best endeavours to ensure that\n                        cargo interests provide security prior to the release of the cargo in breach\n                        of the salvage agreement.(b)     InThe Sandrina, the claim\n                        was by the cargo insurers for unpaid premiums for insurance arranged by the\n                        shipowner on the cargo carried onboard the vessel.(c)     InThe\n                            Aifanourios(1980) SC 346(“The Aifanourios”), the claim was by the\n                        P&I insurers for unpaid release calls in respect of the vessel payable\n                        by the shipowner.(d)     InThe Bumbesti[1999]\n                        2 Lloyd’s Rep 481 (“The\n                            Bumbesti”), the claim was to enforce an arbitration\n                        award arising from a breach of a charterparty.(e)     Finally, a claim for outstanding hire payable\n                        under an agreement for the hire of containers previously held to be within\n                        the equivalent of s 3(1)(h) inThe Sonia S[1983] 2 Lloyd’s Rep 63\n                        was observed inThe Sandrinato have been\n                        wrongly decided and should be overruled.35     In each of the above cases, the claims were\n                    made under agreements which by themselves were not agreements relating to the\n                    use or hire of a vessel. This is to be contrasted withThe\n                        EschersheimandThe Queen of the\n                        Southwhere the claims were based on agreements which directly\n                    related to the use or hire of a vessel. In the present case, the guarantee is\n                    not an agreement which in itself relates to the use or hire of theMahakam. The sole purpose of the guarantee was to\n                    provide financial protection to the plaintiff against the risk of default by\n                    Heritage under the Bareboat C/P. In similar vein, inThe\n                        Aifanourios, although it was clear that the insurance of a vessel\n                    is a matter directed to the convenience and protection of the owner, it was held\n                    to be outside the scope of the equivalent of s 3(1)(h) because it was “... not essential for the operation of\n                    the vessel as such” (per Lord Wylie at 350). Equally, in each of these\n                    cases, the claims were based on separate agreements which were one step removed\n                    from the agreement for the use or hire of a vessel. The claims were based on\n                    agreements which wereindirectlyrelated to the\n                    use or hire of the vessels.36     This is consistent with the approach adopted\n                    by Aikens J inThe Bumbestiat 487 –\n                    488:(2) However, thatagreement to refer disputes is not,\n                            itself, an “agreement in relation to the use or hire of a\n                            ship”. This is because\n                        the arbitration agreement, whether it is the individual reference or the\n                        general agreement to refer, is a contract that is distinct from the\n                        principal contract, i.e. the bareboat charter-party in this\n                        case…(3) … The agreement to refer to arbitration individual disputes\n                        that have arisen out of a charter-party, or the agreement to refer future\n                        disputes in general that arise out of a charter-party, must be agreements\n                        that areindirectly“in relation to the\n                        use or hire of a ship”. But, in my view, they are not agreements that\n                        aresufficiently directly“in relation\n                        to the use or hire of a ship”The arbitration agreement is, at least, one step removed\n                            from the “use or hire” of a ship. The breach of contract\n                            relied upon to found the present claim has nothing to do with the use or\n                            hire of the ship; it concerns the implied term to fulfil any\n                        award made pursuant to the agreement to refer disputes. In my view the\n                        breach of the contract relied on when suing on an award does not have the\n                        “reasonably direct connection with” the use or hire of the\n                        ship that Lord Keith held in theGatoilcase\n                        was necessary to found jurisdiction...[emphasis in bold italics added]37     The plaintiff relied on the fact that under\n                    the Bareboat C/P, it was a condition precedent for HIT to execute the guarantee.\n                    On this basis, it was submitted that the guarantee must be an agreement relating\n                    to the Bareboat C/P since without the guarantee, there would have been no\n                    Bareboat C/P of theMahakam. In my view, an\n                    agreement which in itself is not an agreement intrinsically related to the use\n                    or hire of a vessel cannot be transformed into such an agreement simply by\n                    characterising it as a term or condition precedent of the charterparty. This\n                    would have the effect of altering the “direct connection” test\n                    into a “but for” test. If such a test is to be adopted, it would\n                    mean that an agreement for example to lease a building or to sell shares in a\n                    company which are framed as condition precedents to a charterparty wouldipso factobecome an agreement relating to the\n                    use or hire of a vessel. Such a submission would enlarge the admiralty\n                    jurisdiction of the High Court to cover claims which were never contemplated to\n                    have the right of arrest. Similarly, it is not uncommon for shipowners to insist\n                    on the incorporation of an arbitration agreement in the charterparty. In this\n                    way, it could be said that “but for” the arbitration agreement,\n                    the shipowner would not enter into the charterparty. However, as pointed out inThe Bumbesti, a claim to enforce an\n                    arbitration award arising out of the charterparty is at best a claim which isindirectlyrelated to the use or hire of the\n                    vessel.38     In the course of the hearing before me, I\n                    enquired from counsel for the plaintiff whether there is any authority that a\n                    claim brought under a collateral or separate agreement independent of the\n                    charterparty or bill of lading has been held to fall within\n                        s 3(1)(h). Initially, TheFua Kavengawas the only authority cited. Subsequently\n                    after the hearing and before I rendered my oral judgment, the plaintiff’s\n                    counsel also citedNational Bank Leasingin their\n                    further arguments. In setting aside the writ and the warrant of arrest, I\n                    informed the parties that I will explain why I have declined to follow these two\n                    decisions in my written grounds.39     InThe Fua\n                        Kavenga, the court dealt with several issues of admiralty\n                    jurisdiction in addition to sovereign immunity andres\n                        judicata. The main discussion on admiralty jurisdiction was\n                    whether New Zealand should adopt the UK approach of “sister ship”\n                    arrest inThe Eschersheimor the Singapore\n                    position inThe Permina 108. After analysing the\n                    conflicting views, the court preferred and adoptedThe\n                        Permina 108. Smellie J referred toThe\n                        Antonis P Lemosthat the expression “arising out\n                    of” (which is found in the New Zealand equivalent in s 4(1) of the\n                    Admiralty Act, 1973) is to be construed widely as “connected\n                    with”. AlthoughThe Sandrinawas also\n                    cited, there was no analysis in the judgment why despite the narrow\n                    interpretation of the relevant expression “relating to”, the claim\n                    under the guarantee was nevertheless found to be a claim relating to the use or\n                    hire of a vessel. This was not disputed by counsel for the plaintiff during the\n                    hearing. It seems to me that Smellie J after citingThe\n                        Antonis P Lemosas authority for the wide interpretation of the\n                    expression “arising out of” assumed that the broad interpretation\n                    should govern the entire sub-section without addressing how that was to be\n                    reconciled with the narrower expression of “relating\n                to”.40     InNational Bank\n                        Leasing, the Federal Court of Canada had to consider whether a\n                    claim under a Guarantee Bond which guaranteed the performance of a charterer\n                    fell within its jurisdiction.41     The Federal Court held that it had\n                    jurisdiction because the claim arose out of an agreement relating to the use or\n                    hire of a ship by charterparty within the meaning of s 22(2)(i) of the Federal Court Act, RSC 1985. It is apparent\n                    that the Canadian provision is practically identical to s 3(1)(h) of the HCAJA. In arriving at its decision, the\n                    Federal Court did not refer to and consequently did not consider any of the\n                    leading UK authorities on point. Instead, the Federal Court, after referring to\n                    the statement of claim that “the possible liability of the\n                    defendant… under the Lease Guarantee Bond [arises] out of the\n                    default...under the charterparty”, held that the claim “arises out\n                    of an agreement (the Lease Guarantee Bond) relating to the use or hire of a ship\n                    (as governed by the charterparty)”(at[6]). The Federal Court also observed that the claim under the\n                    Lease Guarantee Bond was inseparably linked to the charterparty. This appears to\n                    be akin to the “but for” test. The decision was therefore bereft\n                    of any serious analysis of the relevant narrow expression “relating\n                    to” and does not provide any useful assistance to the present\n                    case.42     The Australian approach of the “direct\n                    connection” test inPort of Geelong Authority v The\n                        Bass Reefer(1992) Federal Court Reports 374 (“The Bass Reefer”) is instructive. In that case,\n                    the plaintiff port authority, entered into a leasing agreement with the\n                    defendant shipowner. Under the agreement, the plaintiff agreed to provide some\n                    land for the defendant’s ships to handle container cargo and a priority\n                    berthing licence to the defendant. The plaintiff brought an in rem claim against\n                    the defendant’s ship for outstanding fees under the agreement. The court\n                    held that both claims fell outside the ambit of the equivalent\n                        s 3(1)(h). It held at 381 to 382:I ask myself, therefore, whether the agreement for lease in this case\n                        relevantly relates to the carriage of goods by the defendant ship or to its\n                        use or hire. I apply the test asto whether there is a\n                            strong argument for the existence of a reasonably direct connection\n                            between either of these agreements and those activities. I am\n                        satisfied that there is not. So far as connection with the carriage of goods\n                        by the defendant ship, it is not unreasonable to bear in mind that the\n                        decision in Gatoil rejected the contention that the contract of insurance of\n                        goods so carried was sufficiently connected. In the present case, so far as\n                        the lease is concerned, its purpose and effect, as previously indicated, was\n                        to provide a conveniently close area for the receipt of cargo from the ship\n                        and the assembly of cargo to be taken on board the ship. It might\n                        conceivably be said that these procedures had a connection with the\n                        operations of loading and unloading cargo to and from the ship. I express no\n                        concluded view as to that. However, I am satisfied that there is no\n                        reasonably direct connection between them and the actual carriage of goods\n                        by the ship. There is even less connection, in my view, between those\n                        activities and the use or hire of the ship.The licence\n                            agreement, the main feature of which was to provide priority berthing\n                            for the ship at the nominated berth has, in my opinion, no reasonably\n                            direct connection with the carriage of goods by the ship.\n                        Although the licence agreement has the effect of providing a regular berth\n                        for the ship, the effect of this is to provide a facility, at best, for use\n                        by the ship. It does not have any significant connection with the use of the\n                        ship itself. Finally, I can see no significant connection between the\n                        licence agreement and the hire of the ship.[emphasis added]43     The claims were held to be outside the\n                    provision because the lease agreement had little to do with the carriage of\n                    goods by the defendant’s ship or its use and hire. In the present case,\n                    the guarantee provided by HIT was strictly not for or related to the use or hire\n                    of theMahakam. It seems to me that if a claim is\n                    brought under an agreement which is collateral or ancillary to the contract of\n                    carriage, that collateral or ancillary agreement must also be intrinsically\n                    related to the use or hire of a vessel. If the collateral agreement is not\n                    intrinsically an agreement relating to the use or hire of a vessel such as a\n                    contract of insurance, container leasing agreement, an arbitration agreement in\n                    the charterparty or the guarantee in the present case, it would fall outside the\n                    purview of s 3(1)(h).44     In determining whether a claim can be\n                    considered to fall under s 3(1)(h), it would\n                    be useful to pose the question, “How did the claim arise?” The\n                    answer in this case would be “under the guarantee”. The next\n                    relevant question would be, “Did the guarantee relate to the use or hire\n                    of theMahakam?” The answer to that would\n                    be in the negative. This approach was adopted by Sheen J inThe Stella Nova[1981] Com L R 200, which I found\n                    it to be a usefulindiciumfor the direct\n                    connection test.45     In the course of the hearing, I also invited\n                    the parties to address me on the UK decision ofThe\n                        Zeus[1888] 13 PD 188. In that case, the charterparty\n                    provided that the vessel was to proceed to a port to load a full and complete\n                    cargo of coal from a colliery against a guarantee from the colliery to pay\n                    demurrage to the ship owner if the loading was not completed within 48 hours\n                    upon arrival. The court held that although the term demurrage was used in the\n                    colliery guarantee, the claim was not based on an agreement relating to the use\n                    or hire of the vessel. Significantly, the court held (at 190) that\n                    “unless it can be established that the agreement is one in relation to\n                    the use or hire of a ship the fact that the word “demurrage” is\n                    used is immaterial.” Counsel for the plaintiff sought to distinguishThe Zeuson the basis that unlike the present\n                    case, the provision of the guarantee was not a condition precedent to the\n                    charterparty. Although it may not have been expressed as a condition precedent,\n                    it was nonetheless specifically provided in the charterparty itself that the\n                    loading of the vessel was on condition of the colliery guarantee annexed to the\n                    charterparty. The decisive reason why the colliery guarantee inThe Zeuswas held not to be an agreement relating to the\n                    use or hire of a ship was not because of the manner in which the condition was\n                    expressed, but rather because the guarantee in itself did not relate to the use\n                    or hire of a ship. Interestingly,The Zeuswas\n                    decided almost a century before the “direct connection” test was\n                    expounded inThe Sandrina.46     Finally, I will deal with the\n                    plaintiff’s remaining submission that in cases where the agreements were\n                    held to be outside s 3(1)(h) of the HCAJA,\n                    typically the vessels were not referred to in the agreements unlike the present\n                    case where the Bareboat C/P of theMahakamwas\n                    expressly referred to in the recital of the guarantee. From my analysis of the\n                    relevant authorities, I do not regard this distinction to be material, much less\n                    critical. InThe Eschersheim, andThe Queen of the South, the vessels were both not\n                    specifically mentioned in the agreements and yet they were held to be within the\n                    UK equivalent of s 3(1)(h). However, inThe Zeus,The\n                        AifanouriosandThe Bumbesti, by\n                    way of illustrations, the vessels were referred to in the agreements but they\n                    were still held to be outside the ambit of the provision. The express reference\n                    of the vessels in the agreements is therefore clearly not decisive. InThe EschersheimandThe Queen of the\n                        South, the agreements in themselves related to the use or hire of\n                    the vessels even though the vessels were not named in the agreements. On the\n                    other hand, inThe Zeus,The\n                        AifanouriosandThe Bumbesti,\n                    despite the express reference of the vessels in the agreements, they were held\n                    to be outside the provision simply because those agreements were one step\n                    removed from the agreements which related to the use or hire of the vessel and\n                    hence lacked the requisite “direct connection”.Second issue – whether HIT was in possession or control of theMahakamat the time when the cause of action under\n                the guarantee arose47     This issue arises for determination under\n                        s 4(4)(b) of the HCAJA. At the time when\n                    the cause of action accrued against HIT under the guarantee, it is not essential\n                    that HIT must be the owner of theMahakam. This\n                    requirement is equally satisfied so long as HIT was either the charterer or in\n                    possession or in control of theMahakamat the\n                    time when the cause of action arose.48     It is therefore apposite to embark on the\n                    analysis by first determining when the cause of action against HIT\n                    accrued.49     The principal claim by the plaintiff against\n                    Heritage under the Bareboat C/P was for outstanding arrears of charterhire due\n                    and owing since 16 April 2009. The Bareboat C/P was eventually terminated\n                    on 22 June 2009 due to non-payment of the charterhire and for other\n                    breaches of the Bareboat C/P. As the guarantee issued by HIT was to secure the\n                    performance and payment of Heritage’s obligations under the Bareboat C/P,\n                    it is safe to conclude that the cause of action accrued no earlier than\n                    16 April 2009. This was not disputed by the plaintiff. Therefore, the\n                    inquiry as to whether HIT was in possession or in control of theMahakamshould be directed during this time\n                    frame.To lift or not to lift the corporate veil50     The plaintiff relies on the following\n                    materials to show that HIT was in possession or in control of theMahakamat the time when the cause of action\n                    arose:(a)     Heritage is a shell corporation\n                        through which HIT conducts its business and it has no separate independent\n                        identity from HIT.(b)     HIT uses Heritage as their “paying/receiving agent” in\n                        order to insulate itself from creditors.(c)     Heritage is essentially the “chartering\n                        arm” of HIT.(d)     HIT makes, receives, approves and/or directs payments on behalf of\n                        its wholly owned subsidiaries including Heritage.(e)     HIT and Heritage share common\n                        ownership, operations and/or premises.(f)     Heritage is the wholly owned subsidiary of HST which is\n                        in turn a wholly owned subsidiary of HIT(g)     Both HIT and Heritage have at least one common\n                        director and authorised signatory in Bobby Andika.(h)     Agus Darjanto as a common director to\n                        both HIT and Heritage signed the guarantee and the Bareboat C/P on behalf of\n                        both parties.(i)     HIT took over possession and control of theMahakamin or about June 2009 when they provided their crew\n                        to take over theMahakamat Belawan, Indonesia\n                        from the crew supplied by the previous managers of\n                Heritage.51     On the basis of the above matters, counsel for\n                    the plaintiff submitted that “Heritage and PT Humpus should properly be\n                    considered as a single economic unit with no corporate distinction between them,\n                    thus rendering each liable for the debts of the other.”52     It seems to me that the plaintiff was\n                    effectively inviting the court to lift the corporate veil in order to show that\n                    HIT was in reality the charterers of theMahakamunder the Bareboat C/P. These same matters were also referred to in the\n                    affidavit filed by Fredrik Platou in support of the warrant of arrest. In the\n                    same affidavit, the plaintiff alleged that HIT is the alter ego of Heritage. In\n                    the light of these assertions, it would appear that the plaintiff was seeking to\n                    lift the corporate veil in order to show that HIT was in truth the charterers of\n                    theMahakam. On this basis, HIT prepared\n                    substantial submissions to respond to the plaintiff’s perceived attempt to\n                    lift the corporate veil.53     However, on a plain reading of the indorsement\n                    in the writ of summons, it was clear that the plaintiff’s claim against\n                    HIT was solely based on the guarantee. There is no separate or alternative claim\n                    against HIT under the Bareboat C/P. Accordingly, at the commencement of the\n                    hearing, I sought clarification from the plaintiff’s counsel whether she\n                    was seeking to lift the corporate veil. She confirmed that the claim as indorsed\n                    in the writ of summons is based solely on the guarantee and that she was not\n                    attempting to lift the corporate veil in spite of the assertions in the\n                    affidavit in support of the warrant of arrest.54     Implicit in the plaintiff’s confirmation\n                    is their acknowledgment that the materials which they were relying on do not\n                    justify the lifting of the corporate veil. It is plainly inconsistent and\n                    incongruous for the plaintiff to rely on the same materials to show that HIT was\n                    in possession or in control of theMahakamhaving\n                    accepted that Heritage was the bareboat charterers of theMahakamat all material times. As earlier observed, the\n                    plaintiff has commenced London arbitration proceedings against Heritage for the\n                    outstanding charterhire under the Bareboat C/P.55     The establishment of one-ship companies within\n                    a group of companies is a well-known and legitimate practice in the shipping\n                    industry: seeThe Evpo Agnic[1988] 2\n                    Lloyd’s Rep 411 at 415 (“The Evpo\n                        Agnic”). There have been numerous unsuccessful attempts to\n                    lift the corporate veil in the context of one-ship companies with common\n                    shareholdings and/or directors: seeThe Evpo\n                    Agnic,The Maritime Trader,The Neptune[1986] HKLR 345,The Andres Bonifacio,The\n                        Interippu[1990] SGHC 131 (“The\n                        Interippu”) andThe Skaw\n                        Prince[1994] 3 SLR 379. The court may be minded to\n                    lift the corporate veil if there are exceptional circumstances which indicate\n                    the presence of a façade or sham set up to deceive or to perpetrate a fraud: seeThe Aventicum,The Saudi\n                        Prince[1982] 2 Lloyd’s Rep 255 andWin Line (UK) Ltd v Masterpart (Singapore) Pte Ltd[2000]\n                    2 SLR 98 at 116-117.56     None of the exceptional circumstances exist in\n                    the present case to warrant the piercing of the corporate veil. No allegation of\n                    fraud was raised by the plaintiff. That explains why the plaintiff did not\n                    attempt to lift the corporate veil. After all, the plaintiff chose and agreed to\n                    enter into the Bareboat C/P with Heritage with full knowledge that Heritage is\n                    related to HIT. In fact, the plaintiff accepted the guarantee from HIT on that\n                    basis.Person “in possession or in control” of the\n                vessel57     Section 4(4)(b)\n                    of the HCAJA refers to 3 different entities:(a)owner;(b)charterer; and(c)person in possession or in control58     These different entities concern parties with\n                    substantive as opposed to nominal or formal interest in relation to the ship:\n                    seeThe Ohm Mariana[1993] 2 SLR 698 at\n                    710 (“The Ohm\n                Mariana”).59     Under Singapore law, an owner refers to the\n                    beneficial owner who is vested with the right of sale: seeThe Ohm Mariana. It is not restricted only to the registered\n                    owners as was found to be the case inThe Evpo\n                        Agnic. Charterer would include voyage, time, demise or even slot\n                    charterers. Each of these charterers would have legally enforceable rights in\n                    relation to the employment of the ship. By the same token, a named charterer\n                    under a sham charterparty is not a charterer within the meaning of\n                        s 4(4)(b) of the HCAJA as the sham\n                    charterparty does not give rise to any legally enforceable rightsquacharterer: seeThe Inai\n                        Selasih.60     Similarly as rightly observed by Chao JC\n                    (as he then was) inThe Interippu, the term\n                    “in possession or in control” must mean possession or control\n                    “as an independent legal right”. Chao JC stated that:I am afraid there is hardly any evidence to show that Corporate Shipping\n                        were in possession or control of “Engineer 103”. The fact that\n                        H H Wong was managing “Engineer 103” does not necessarily mean\n                        that Corporate Shipping were therefore in control or possession of\n                        “Engineer 103”. After all, H H Wong was at the relevant time a\n                        director of both companies, one being the holding company and the other a\n                        subsidiary company. Something more than just a common shareholding or\n                        manager/director is required to sustain a claim of “possession or\n                        control”, otherwise, it would sweep aside the entire concept of\n                        corporate structures and entities. I am inclined to accept the submission of\n                        the Defendants that the term “in possession or in control” in\n                        section 4(4) must mean possession or control as an independent legal right;\n                        or at least the possession or control must be pursuant to a specific\n                        arrangement.61     It does not refer to physical possession or\n                    controlper se. Such a person would include a\n                    demise charterer (seeThe Span Terza[1982]\n                    1 Lloyd’s Rep 225 at 227), a salvor in possession (seeThe Evpo Agnicat 414), a purchaser under a\n                    conditional sale agreement (seeThe Permina 3001[1977] 1 MLJ 141 at 144), and a person who is in a position of a\n                    demise charterer albeit not under a demise charter (seeThe\n                        Evpo Agnicat 414). It would also cover a mortgagee in possession\n                    who has taken over the vessel following the default of the mortgagor. The common\n                    denominator is that each of them has legally enforceable rights as regards\n                    possession or control of the vessel.62     The matters relied on are largely material in\n                    relation to an attempt to lift the corporate veil which the plaintiff conceded\n                    they were not seeking to do. In any event, none of them either singly or\n                    collectively would justify the veil to be pierced. Based on the evidence before\n                    me, Heritage has substantial assets in excess of US$30m. It maintains its own\n                    bank accounts with Bank Negara Indonesia, CMIB Bank and BNP Paribas. The fact\n                    that it does not maintain its own employees is not remarkable in itself. It is\n                    not uncommon for wholly owned subsidiaries to share and use office premises and\n                    employees with their parents or the ultimate holding company. The plaintiff also\n                    referred to various emails to suggest that HIT had paid the ship management fees\n                    for theMahakamand had arranged to pay various\n                    expenses on behalf of Heritage. However, the evidence suggest otherwise. While\n                    HIT may have been involved in the payment process, the evidence indicate that\n                    the payments were made from Heritage’s bank accounts.63     Even if HIT has control over Heritage directly\n                    or through HST, it is strictly irrelevant for the present purposes since it is a\n                    fundamental principle of company law that a shareholder has no property, legal\n                    or equitable, in the assets of the company: seeThe Maritime\n                        Traderat 157 andThe Interippuat\n                    6. Furthermore, having control over Heritage does not translate into\n                    “possession or control” over theMahakam.64     The plaintiff also relied on the Ship\n                    Management Agreement dated 14 December 2007 under which HIT was appointed\n                    by Heritage to manage theMahakam. In July 2008,\n                    Heritage appointed an independent company, Seaquestsandigan Pte Ltd\n                    (“Seaquestsandigan”) to take over the management of the vessel\n                    from HIT. Accordingly, HIT were not even the ship managers of the vessel in\n                    April 2009 when the cause of action accrued. The plaintiff alleged that\n                    Seaquestsandigan’s appointment was limited only to the technical and\n                    crewing responsibilities and that all other management duties remained with HIT.\n                    Even accepting the plaintiff’s submission, the management of theMahakampursuant to an appointment by Heritage does not\n                    vest any legally enforceable rights on HIT as regards possession or control over\n                    theMahakam. It would be wrong to treat ship\n                    managers as being “in possession or in control” of a vessel. Their\n                    responsibilities over the vessel arise by reason of their appointment by the\n                    principal. If the managers should exercise any rights of control or possession\n                    over the vessel, it would be on behalf of their principal and not as an\n                    independent legal right. The appointment can be terminated by the principal just\n                    as in this case when Heritage appointed Seaquestsandigan to take over from HIT\n                    in July 2008.65     Further, the plaintiff submitted that the\n                    supply of crew by HIT for theMahakamat Belawan,\n                    Indonesia in June 2009 amounted to taking possession or control over the vessel.\n                    According to the affidavit of Capt Thanabalasingam s/o Balakrishnan, the crew\n                    was supplied by HIT following his request on behalf of Heritage after\n                    Seaquestsandigan removed their crew from theMahakamupon the termination of their ship management agreement.\n                    The supply of crew was therefore not to enable HIT to take over physical\n                    possession or control of theMahakamfrom\n                    Seaquestsandigan or even Heritage, but rather to enable the vessel to be manned\n                    at the request of Heritage after Seaquestsandigan removed their\n                crew.66     The plaintiff also relied on the decision of\n                    the Federal Court of Australia inMalaysia Shipyard and\n                        Engineering Sdn Bhd v Iron Shortland[1995] FCA 1565\n                        (“Iron Shortland”). In that case\n                    the claimant sought and succeeded in lifting the corporate veil to show that the\n                    parent company, Capeco Maritime NV (“Capeco Maritime”) was the\n                    beneficial owner of the two vessels,Iron\n                        ShortlandandNewcastle Prideeven\n                    though they were registered in the names of their wholly owned subsidiaries. The\n                    finding was based on the evidence presented by the claimant. Having found that\n                    Capeco Maritime was the beneficial owner of the vessel, the court observed that\n                    the “evidence at least establishes that Capeco Maritime was in possession\n                    or control of theNewcastle Pride”. The\n                    facts are therefore entirely different from the present case. First, the\n                    plaintiff concedes that they are not seeking to lift the corporate veil. In any\n                    event, the lifting of the corporate veil in theIron\n                        Shortlandwas based on the specific evidence presented in that\n                    case. Secondly, as Capeco Maritime was found to be the beneficial owner of the\n                    vessel,a fortiorithey would be in possession or\n                    in control of the vessel.67     Finally, the plaintiff also relied onThe Fua Kavenga. Any inquiry as to whether a\n                    person was “in possession or in control” of a vessel is primarily\n                    a question of fact taking into account the applicable legal principles. As such,\n                    the mere fact that a person who had provided a guarantee was found to be\n                    “in possession or in control” of a vessel in one case does not\n                    mean that all guarantors would likewise be treated in the same way. Each case\n                    must necessarily be decided on its own facts.The Fua\n                        Kavengadoes not provide any useful guidance on this issue. In\n                    fact, counsel for the plaintiff accepted that this issue was not properly\n                    considered. The court appeared to have accepted that the guarantor inThe Fua Kavengawas “in possession or in\n                    control” of the vessel because the chartererers were “in a variety\n                    of ways the agent or alter ego of the (guarantor)”: at 567. Furthermore,\n                    Smellie J also referred to the submission by counsel on the lifting of the\n                    corporate veil without any indication whether the veil would be lifted on the\n                    evidence before him. Given that there was no analysis as to why the guarantor\n                    was determined to be a person “in possession or in control” of the\n                    vessel and since there is no issue for the lifting of the corporate veil in the\n                    instant case unlikeThe Fua Kavenga, with respect,\n                    I do not find the decision to be instructive.Conclusion68     I therefore hold that the plaintiff has failed\n                    to satisfy me on the two jurisdictional issues raised by HIT. Failure to satisfy\n                    either would be fatal. In the result, the admiralty jurisdiction of the High\n                    Court was improperly invoked against HIT’s vessel,Catur Samudra. Accordingly, it is axiomatic that the writ of\n                    summons and the warrant of arrest must be set aside which I so ordered on\n                    21 December 2009. HIT is awarded costs of the action as well as the\n                    application to be taxed if not agreed.69     HIT has a remaining prayer for damages for\n                    wrongful arrest. When I delivered my oral judgment, I provisionally indicated\n                    subject to full arguments from both parties that this was perhaps not an\n                    appropriate case for damages to be awarded. I, however, adjourned the prayer\n                    with liberty to HIT to restore it for hearing before me within 14 days from the\n                    date of the oral decision. 14 days have since elapsed and HIT has elected not to\n                    proceed with the claim for wrongful arrest.",
        "Other legal proceedings": "12     After Heritage defaulted on the Bareboat C/P,\n                    the plaintiff commenced various proceedings against HIT, HST and Heritage. In\n                    May 2009, the plaintiff commenced an action in New York against Heritage and HIT\n                    seeking damages for breach of the Bareboat C/P. In the New York proceedings, the\n                    plaintiff obtained anex-parteorder to restrain\n                    Heritage and HIT from dealing with property in the hands of specific garnishee\n                    intermediary banks up to a limit of US$2,247,117.72. This attachment is commonly\n                    referred to as the Rule B Order. However, the total sum which was attached\n                    pursuant to the New York Rule B Order was only US$352,500.44. 13     In June 2009 the plaintiff obtained a further\n                    Rule B Order in Connecticut against HIT, HST, Heritage and Genuine Maritime\n                    Limited, which is another wholly-owned subsidiary of HST. The sum actually\n                    caught by the Connecticut Rule B Order amounted to only US$70,000. Arising from\n                    the severe downturn in the freight market, many banks in New York were inundated\n                    with multiple Rule B Orders on a daily basis. In October 2009, the Second\n                    Circuit Court of Appeals of the Southern District of New York issued its\n                    decision inShipping Corporation of India v Jaldhi Pte\n                        Ltd. 585 F.3d 58, 71 (2d Cir.2009). The court held that Rule B\n                    Orders are not available to attach electronic fund transfers in the possession\n                    of intermediary banks for processing. Arising from this decision, many New York\n                    Rule B Orders have since been discharged. Indeed on 8 December 2009, the\n                    New York Rule B Order which was obtained by the plaintiff against HIT and\n                    Heritage was set aside. However, the Connecticut Rule B Order remains in\n                    place. 14     On 12 June 2009, the plaintiff arrested\n                    theMahakamin Malaysia in respect of their claim\n                    against Heritage under the Bareboat C/P. TheMahakamwas eventually redelivered to the plaintiff and she was\n                    released from arrest on 24 June 2009. It was agreed between the plaintiff\n                    and Heritage that the claim under the Bareboat C/P would be referred to\n                    arbitration in London pursuant to cl 30 and 54 of the Bareboat C/P. Indeed\n                    on or about 31 August 2009, the plaintiff served their Points of Claim\n                    against Heritage for unpaid charterhire under the Bareboat C/P in the London\n                    arbitration.",
        "Invocation of admiralty jurisdiction": "15     On 5 September 2009, the plaintiff arrested\n                    theCatur Samudrain the present proceedings. It\n                    is not in dispute that theCatur Samudrais owned\n                    by HIT. 16     It is clear from the indorsement of claim that\n                    the plaintiff’s claim against HIT in this action is solely under the\n                    guarantee dated 11 December 2007 for payment of outstanding charterhire due\n                    and owing by Heritage and for damages for breaches of the Bareboat C/P. The\n                    total amount claimed is stated to be US$30,777,566.44. 17     The admiralty jurisdiction of the High Court\n                    has been invoked by the plaintiff against theCatur\n                        Samudraon the following basis: (a)     The plaintiff’s claim against\n                        HIT under the guarantee is brought under s 3(1)(h) of the HCAJA being a claim arising out of an agreement\n                        relating to the use or hire of theMahakam. (b)     At the time when the cause of action arose against HIT under the\n                        guarantee, HIT was in possession or in control of theMahakam. 18     On 14 October 2009, HIT filed an\n                    application for,inter alia, the following\n                    orders: (a)the writ of summons filed in this action be\n                            struck out and/or set aside pursuant to O 18 r 19 of the Rules\n                            of Court (Cap 322, R 5, 2006 Rev Ed) and/or the inherent jurisdiction of\n                            the court;(b)the warrant of arrest obtained by the plaintiff\n                            in this action and the arrest of HIT’s vessel in this action by\n                            the plaintiff be set aside;(c)the plaintiff do pay HIT damages for the wrongful\n                            arrest of the vessel; and(d)the costs of the action herein and this\n                            application be paid by the plaintiff to HIT.19     HIT’s application is founded on the\n                    following grounds:(a)there was improper invocation of the admiralty\n                            jurisdiction of the court by the plaintiff over HIT’s vessel,Catur Samudra;(b)the writ of summons disclosed no reasonable cause\n                            of action and/or is scandalous, frivolous or vexatious and/or otherwise\n                            an abuse of the process of the court;(c)the plaintiff failed to disclose or made\n                            insufficient disclosure of material facts in the affidavit in support of\n                            the warrant of arrest; and(d)the plaintiff’s arrest of theCatur Samudrawas maliciously\n                        procured.20     When the application came before me, counsel\n                    for HIT confirmed that they were only proceeding on the sole ground that the\n                    admiralty jurisdiction was wrongly invoked against theCatur\n                        Samudra. Specifically, HIT’s jurisdictional challenge was\n                    premised on two grounds:(a)the plaintiff’s claim under the guarantee\n                            does not fall within s 3(1)(h) of the\n                            HCAJA; and(b)HIT was not in possession or in control of theMahakamat the time when the cause of\n                            action arose.21     Counsel for HIT confirmed that they were not\n                    relying on non-disclosure or that the writ of summons did not disclose any\n                    reasonable or arguable cause of action. However, it was apparent that the\n                    plaintiff was not aware prior to the hearing that HIT was no longer relying on\n                    these two alternative arguments. The plaintiff had prepared extensive\n                    submissions to deal with both points. It is good practice and professional\n                    courtesy to inform the opposing party in advance of the hearing if a party\n                    should decide to abandon any point or issue which arises from the application.\n                    This practice should be encouraged as it will save time and costs for all\n                    parties including the court.Burden of proof22     It is well settled and not in dispute that the\n                    burden of proof is on the plaintiff to satisfy all the jurisdictional\n                    requirements laid down in s 4(4) of the HCAJA in order to successfully\n                    invoke the admiralty jurisdiction against theCatur\n                        Samudra: seeThe Maritime Trader[1981] 2 Lloyd’s Rep 153 (“The Maritime\n                        Trader”) at 157 andThe Andres\n                        Bonifacio[1991] 2 MLJ 371 (“The Andres Bonifacio”).23     It is also trite that the plaintiff must\n                    satisfy the burden of proof on a balance of probabilities: seeThe Aventicum[1978] 1 Lloyd’s Rep 184 at 190\n                    andThe Alexandrea[2002] 3 SLR 56 at[18]. Equally, it is not in dispute that\n                    the question of admiralty jurisdiction must be decided based on the affidavit\n                    evidence before the court and should not be tried as an issue (save for\n                    exceptional circumstances which do not apply here):It follows as a matter of principle that any question of jurisdiction,\n                        such as the question in the present motions, must be dealt with on the\n                        motions, and cannot be dealt with as an issue in the actions- per Goff L J inThe I Congresco[1977] 1 Lloyd’s Rep 536 at 559.24     In order to invoke the admiralty jurisdiction\n                    of the High Court against theCatur Samudra, four\n                    conditions under s 4(4) of the HCAJA must first be satisfied (seeThe Permina 108[1977] 1 MLJ 43 at 45 andThe Inai Selasih[2005] 4 SLR 1 at\n                    [6]). These conditions are:(a)The claim is mentioned in section 3 (1) (d)\n                            to (q);(b)The claim arises in connection with the\n                            ship;(c)The person who would be liable on the claim in an\n                            action in personam (referred to in this subsection as the relevant\n                            person) was, when the cause of action arose, the owner or charterer of,\n                            or in possession or in control of, the ship;(d)At the time when the action is brought, the\n                            relevant person is the beneficial owner as respect all the shares in the\n                            other ship against which an action in rem is brought.25     As regards sub-para (a), HIT denies that the\n                    claim under the guarantee falls within s 3(1)(h). There is no dispute that the requirements under sub-paras\n                    (b) and (d) are satisfied. As regards sub-para (c), this condition may be\n                    further broken into two sub-conditions:(i)     That the person proceeded against,ie, HIT, must either be the owner or\n                        charterer of, or in possession or in control of theMahakamat the time when the cause of action arose. The\n                        plaintiff alleged that HIT was in possession or in control of theMahakam. This is disputed by HIT;(ii)     That HIT is the person who would be\n                        liable to the plaintiff under the guarantee in an action in personam. This\n                        requirement is not disputed since HIT was indeed the party who executed the\n                        guarantee.First issue - Whether the plaintiff’s claim under the guarantee\n                issued by HIT would be a claim arising out of an agreement relating to the\n                charterparty in respect of theMahakam26     Counsel for the plaintiff advanced the\n                    following arguments that the claim under the guarantee falls within the scope of\n                        s 3(1)(h) of the HCAJA:(a)     The provisions of the HCAJA\n                        including s 3(1)(h) are to be given a\n                        “broad and liberal construction.” –The Antonis P Lemos[1985] AC 711\n                            (“The Antonis P\n                            Lemos”),The\n                            Indriani[1996] 1 SLR 305 (“The Indriani“) andThe\n                            Mara[2000] 4 SLR 156 (“The Mara“) were cited in support.(b)     The guarantee issued by HIT would\n                        constitute an agreement relating to the charterparty of theMahakamas the provision of the guarantee was stated\n                        to be a condition precedent to the Bareboat C/P. Initially,The Fua Kavengawas cited in support. Subsequently,\n                        the decision of the Federal Court of Canada,National\n                            Bank Leasing v Merlac Marine Inc(1992) 52 Federal Trial\n                        Reports 15 (“National Bank\n                        Leasing”) was also cited in aid of this\n                        construction.(c)     The Bareboat C/P in respect of theMahakamwas specifically referred to in the guarantee.27     On the other hand, counsel for HIT put forward\n                    the following rival contentions:(a)     There are two connecting phrases in\n                            s 3(1)(h) of the HCAJA. While\n                        “arising out of” has been given a wide and liberal\n                        construction, the other connecting phrase “relating to” is\n                        more relevant. The courts have consistently applied a narrow and restricted\n                        interpretation of the phrase “relating to”.The Fua Kavengashould not be followed since the court did\n                        not address this vital difference.(b)     The guarantee was for the financial protection of the\n                        plaintiff and was strictly unnecessary for the use or hire of theMahakam.(c)     The identification of theMahakamin the guarantee is not\n                decisive.28     Section 3(1)(h)\n                    of the HCAJA reads as follows:3.—(1) The admiralty jurisdiction of the High Court shall be as\n                        follows, that is to say, jurisdiction to hear and determine any of the\n                        following questions or claims:…(h) any claim arising out of any agreement\n                                relating to thecarriage of goods in a ship\n                            or to the use or hire of a ship; [emphasis added]29     It is apparent that there are two connecting\n                    phrases which govern the proper construction of s 3(1)(h),ie, “arising out\n                    of” and “relating to”.Effect of the expression “arising out of”30     For many years, it was considered to be\n                    settled law that a claim in tort falls within the UK equivalent of\n                        s 3(1)(h): seeThe St\n                        Elefterio[1957] P 179 at 183:[t]he words…are…wide enough to cover claims whether in\n                        contract or in tort arising out of any agreement relating to the carriage of\n                        goods in a ship.31     About 30 years later, counsel for the\n                    shipowners, Mark Saville QC (now Lord Saville) inThe Antonis\n                        P Lemossought to venture into unchartered waters in submitting\n                    that s 20(2)(h) of the UK Supreme Court Act\n                    1981 (inpari materiawith s 3(1)(h) of the HCAJA) only applied to claims of a purely\n                    contractual nature. After reviewing the relevant authorities, the House of Lords\n                    inThe Antonis P Lemosheld that the expression\n                    “arising out of” should be given its wider meaning of\n                    “connected with” and not the narrower meaning of “arising\n                    under”. InThe Antonis P Lemos, the claim\n                    was brought by the sub-sub-charterer against the shipowner in the tort of\n                    negligence for failing to ensure that the draft of the vessel did not exceed 32\n                    feet upon arrival at the port of discharge which thereby caused additional\n                    expenses to lighten the vessel. Accordingly, the effect of the holding is that\n                        s 20(2)(h) of the UK Act is wide enough\n                    to encompass a claim in tort even though there was no direct contractual\n                    relationship between the sub-sub charterer and the shipowner. However, it is\n                    relevant to highlight that inThe Antonio P Lemos,\n                    the claim in tort arose from a sub-sub charter. There can be no dispute that a\n                    sub-sub-charter like any other charterparty is an agreement relating to the use\n                    or hire of a vessel.32The MaraandThe Indrianicited by the plaintiff do not\n                    assist either. In both cases, the courts were concerned with the interpretation\n                    of the expression “arising out of”. InThe\n                        Mara, the Court of Appeal held that a claim for contractual\n                    compensation in respect of personal injuries payable under a collective\n                    agreement was a claim arising out of loss of life or personal injury under\n                        s 3(1)(f) of the HCAJA. InThe Indriani, consistent with the broad and liberal\n                    application of “arising out of” under s 3(1)(h), the Court of Appeal affirmed the decision of the\n                    lower court that a claim for malicious falsehood arising from the issuance of a\n                    clean bill of lading was a claim arising out of an agreement relating to the use\n                    or hire of a vessel. It could hardly be disputed that a claim under a bill of\n                    lading was indeed a claim arising out of an agreement relating to the use or\n                    hire of the vessel. While the courts have leaned towards a broad interpretation\n                    of the expression “arising out of” to enlarge the types of claims\n                    as falling within s 3(1)(h), they have,\n                    however, adopted a narrow interpretation to restrict the claims only under\n                    agreements which are in themselves related to the use or hire of a\n                    vessel.Ambit of the expression “relating to” – Direct\n                Connection Test33     In the present case, counsel for the defendant\n                    rightly focussed on the more relevant expression “relating to”.\n                    The House of Lord inGatoil International Inc v\n                        Arkwright-Boston Manufacturers Mutual Insurance Co[1985] AC 255\n                        (“The Sandrina”) reviewed the\n                    previous authorities and formulated the test that to constitute “an\n                    agreement relating to the use or hire of a ship” the agreement must have\n                    some “reasonably direct connection with such activities” (at 271).\n                    InThe Sandrina, the contract of insurance\n                    arranged by the shipowner for cargo shipped onboard the vessel was found to lack\n                    the “direct connection” and hence outside the ambit of\n                        s 20(2)(h) of the UK act. For the same\n                    reason, an agreement for salvage services inThe\n                        Eschersheimwas found to fall within the UK equivalent of\n                        s 3(1)(h) because the rendering of\n                    salvage services directly involved the use of a salvage vessel Similarly, the\n                    agreement for mooring and unmooring services inThe Queen of\n                        the South[1968] 1 All ER 1163 (“The\n                        Queen of the South”) directly involved the use of motor\n                    boats in providing the services.34     In deciding on the scope of the expression\n                    “relating to”, it is useful to refer to decisions where claims\n                    which have some appearance of a connection with the use or hire of a vessel were\n                    nevertheless held to fall outside the equivalent of s 3(1)(h):(a)     InThe\n                            Tesaba[1982] 1 Lloyd's Rep 397 (“The Tesaba”), the claim by the salvors\n                        against the shipowner was for failure to use best endeavours to ensure that\n                        cargo interests provide security prior to the release of the cargo in breach\n                        of the salvage agreement.(b)     InThe Sandrina, the claim\n                        was by the cargo insurers for unpaid premiums for insurance arranged by the\n                        shipowner on the cargo carried onboard the vessel.(c)     InThe\n                            Aifanourios(1980) SC 346(“The Aifanourios”), the claim was by the\n                        P&I insurers for unpaid release calls in respect of the vessel payable\n                        by the shipowner.(d)     InThe Bumbesti[1999]\n                        2 Lloyd’s Rep 481 (“The\n                            Bumbesti”), the claim was to enforce an arbitration\n                        award arising from a breach of a charterparty.(e)     Finally, a claim for outstanding hire payable\n                        under an agreement for the hire of containers previously held to be within\n                        the equivalent of s 3(1)(h) inThe Sonia S[1983] 2 Lloyd’s Rep 63\n                        was observed inThe Sandrinato have been\n                        wrongly decided and should be overruled.35     In each of the above cases, the claims were\n                    made under agreements which by themselves were not agreements relating to the\n                    use or hire of a vessel. This is to be contrasted withThe\n                        EschersheimandThe Queen of the\n                        Southwhere the claims were based on agreements which directly\n                    related to the use or hire of a vessel. In the present case, the guarantee is\n                    not an agreement which in itself relates to the use or hire of theMahakam. The sole purpose of the guarantee was to\n                    provide financial protection to the plaintiff against the risk of default by\n                    Heritage under the Bareboat C/P. In similar vein, inThe\n                        Aifanourios, although it was clear that the insurance of a vessel\n                    is a matter directed to the convenience and protection of the owner, it was held\n                    to be outside the scope of the equivalent of s 3(1)(h) because it was “... not essential for the operation of\n                    the vessel as such” (per Lord Wylie at 350). Equally, in each of these\n                    cases, the claims were based on separate agreements which were one step removed\n                    from the agreement for the use or hire of a vessel. The claims were based on\n                    agreements which wereindirectlyrelated to the\n                    use or hire of the vessels.36     This is consistent with the approach adopted\n                    by Aikens J inThe Bumbestiat 487 –\n                    488:(2) However, thatagreement to refer disputes is not,\n                            itself, an “agreement in relation to the use or hire of a\n                            ship”. This is because\n                        the arbitration agreement, whether it is the individual reference or the\n                        general agreement to refer, is a contract that is distinct from the\n                        principal contract, i.e. the bareboat charter-party in this\n                        case…(3) … The agreement to refer to arbitration individual disputes\n                        that have arisen out of a charter-party, or the agreement to refer future\n                        disputes in general that arise out of a charter-party, must be agreements\n                        that areindirectly“in relation to the\n                        use or hire of a ship”. But, in my view, they are not agreements that\n                        aresufficiently directly“in relation\n                        to the use or hire of a ship”The arbitration agreement is, at least, one step removed\n                            from the “use or hire” of a ship. The breach of contract\n                            relied upon to found the present claim has nothing to do with the use or\n                            hire of the ship; it concerns the implied term to fulfil any\n                        award made pursuant to the agreement to refer disputes. In my view the\n                        breach of the contract relied on when suing on an award does not have the\n                        “reasonably direct connection with” the use or hire of the\n                        ship that Lord Keith held in theGatoilcase\n                        was necessary to found jurisdiction...[emphasis in bold italics added]37     The plaintiff relied on the fact that under\n                    the Bareboat C/P, it was a condition precedent for HIT to execute the guarantee.\n                    On this basis, it was submitted that the guarantee must be an agreement relating\n                    to the Bareboat C/P since without the guarantee, there would have been no\n                    Bareboat C/P of theMahakam. In my view, an\n                    agreement which in itself is not an agreement intrinsically related to the use\n                    or hire of a vessel cannot be transformed into such an agreement simply by\n                    characterising it as a term or condition precedent of the charterparty. This\n                    would have the effect of altering the “direct connection” test\n                    into a “but for” test. If such a test is to be adopted, it would\n                    mean that an agreement for example to lease a building or to sell shares in a\n                    company which are framed as condition precedents to a charterparty wouldipso factobecome an agreement relating to the\n                    use or hire of a vessel. Such a submission would enlarge the admiralty\n                    jurisdiction of the High Court to cover claims which were never contemplated to\n                    have the right of arrest. Similarly, it is not uncommon for shipowners to insist\n                    on the incorporation of an arbitration agreement in the charterparty. In this\n                    way, it could be said that “but for” the arbitration agreement,\n                    the shipowner would not enter into the charterparty. However, as pointed out inThe Bumbesti, a claim to enforce an\n                    arbitration award arising out of the charterparty is at best a claim which isindirectlyrelated to the use or hire of the\n                    vessel.38     In the course of the hearing before me, I\n                    enquired from counsel for the plaintiff whether there is any authority that a\n                    claim brought under a collateral or separate agreement independent of the\n                    charterparty or bill of lading has been held to fall within\n                        s 3(1)(h). Initially, TheFua Kavengawas the only authority cited. Subsequently\n                    after the hearing and before I rendered my oral judgment, the plaintiff’s\n                    counsel also citedNational Bank Leasingin their\n                    further arguments. In setting aside the writ and the warrant of arrest, I\n                    informed the parties that I will explain why I have declined to follow these two\n                    decisions in my written grounds.39     InThe Fua\n                        Kavenga, the court dealt with several issues of admiralty\n                    jurisdiction in addition to sovereign immunity andres\n                        judicata. The main discussion on admiralty jurisdiction was\n                    whether New Zealand should adopt the UK approach of “sister ship”\n                    arrest inThe Eschersheimor the Singapore\n                    position inThe Permina 108. After analysing the\n                    conflicting views, the court preferred and adoptedThe\n                        Permina 108. Smellie J referred toThe\n                        Antonis P Lemosthat the expression “arising out\n                    of” (which is found in the New Zealand equivalent in s 4(1) of the\n                    Admiralty Act, 1973) is to be construed widely as “connected\n                    with”. AlthoughThe Sandrinawas also\n                    cited, there was no analysis in the judgment why despite the narrow\n                    interpretation of the relevant expression “relating to”, the claim\n                    under the guarantee was nevertheless found to be a claim relating to the use or\n                    hire of a vessel. This was not disputed by counsel for the plaintiff during the\n                    hearing. It seems to me that Smellie J after citingThe\n                        Antonis P Lemosas authority for the wide interpretation of the\n                    expression “arising out of” assumed that the broad interpretation\n                    should govern the entire sub-section without addressing how that was to be\n                    reconciled with the narrower expression of “relating\n                to”.40     InNational Bank\n                        Leasing, the Federal Court of Canada had to consider whether a\n                    claim under a Guarantee Bond which guaranteed the performance of a charterer\n                    fell within its jurisdiction.41     The Federal Court held that it had\n                    jurisdiction because the claim arose out of an agreement relating to the use or\n                    hire of a ship by charterparty within the meaning of s 22(2)(i) of the Federal Court Act, RSC 1985. It is apparent\n                    that the Canadian provision is practically identical to s 3(1)(h) of the HCAJA. In arriving at its decision, the\n                    Federal Court did not refer to and consequently did not consider any of the\n                    leading UK authorities on point. Instead, the Federal Court, after referring to\n                    the statement of claim that “the possible liability of the\n                    defendant… under the Lease Guarantee Bond [arises] out of the\n                    default...under the charterparty”, held that the claim “arises out\n                    of an agreement (the Lease Guarantee Bond) relating to the use or hire of a ship\n                    (as governed by the charterparty)”(at[6]). The Federal Court also observed that the claim under the\n                    Lease Guarantee Bond was inseparably linked to the charterparty. This appears to\n                    be akin to the “but for” test. The decision was therefore bereft\n                    of any serious analysis of the relevant narrow expression “relating\n                    to” and does not provide any useful assistance to the present\n                    case.42     The Australian approach of the “direct\n                    connection” test inPort of Geelong Authority v The\n                        Bass Reefer(1992) Federal Court Reports 374 (“The Bass Reefer”) is instructive. In that case,\n                    the plaintiff port authority, entered into a leasing agreement with the\n                    defendant shipowner. Under the agreement, the plaintiff agreed to provide some\n                    land for the defendant’s ships to handle container cargo and a priority\n                    berthing licence to the defendant. The plaintiff brought an in rem claim against\n                    the defendant’s ship for outstanding fees under the agreement. The court\n                    held that both claims fell outside the ambit of the equivalent\n                        s 3(1)(h). It held at 381 to 382:I ask myself, therefore, whether the agreement for lease in this case\n                        relevantly relates to the carriage of goods by the defendant ship or to its\n                        use or hire. I apply the test asto whether there is a\n                            strong argument for the existence of a reasonably direct connection\n                            between either of these agreements and those activities. I am\n                        satisfied that there is not. So far as connection with the carriage of goods\n                        by the defendant ship, it is not unreasonable to bear in mind that the\n                        decision in Gatoil rejected the contention that the contract of insurance of\n                        goods so carried was sufficiently connected. In the present case, so far as\n                        the lease is concerned, its purpose and effect, as previously indicated, was\n                        to provide a conveniently close area for the receipt of cargo from the ship\n                        and the assembly of cargo to be taken on board the ship. It might\n                        conceivably be said that these procedures had a connection with the\n                        operations of loading and unloading cargo to and from the ship. I express no\n                        concluded view as to that. However, I am satisfied that there is no\n                        reasonably direct connection between them and the actual carriage of goods\n                        by the ship. There is even less connection, in my view, between those\n                        activities and the use or hire of the ship.The licence\n                            agreement, the main feature of which was to provide priority berthing\n                            for the ship at the nominated berth has, in my opinion, no reasonably\n                            direct connection with the carriage of goods by the ship.\n                        Although the licence agreement has the effect of providing a regular berth\n                        for the ship, the effect of this is to provide a facility, at best, for use\n                        by the ship. It does not have any significant connection with the use of the\n                        ship itself. Finally, I can see no significant connection between the\n                        licence agreement and the hire of the ship.[emphasis added]43     The claims were held to be outside the\n                    provision because the lease agreement had little to do with the carriage of\n                    goods by the defendant’s ship or its use and hire. In the present case,\n                    the guarantee provided by HIT was strictly not for or related to the use or hire\n                    of theMahakam. It seems to me that if a claim is\n                    brought under an agreement which is collateral or ancillary to the contract of\n                    carriage, that collateral or ancillary agreement must also be intrinsically\n                    related to the use or hire of a vessel. If the collateral agreement is not\n                    intrinsically an agreement relating to the use or hire of a vessel such as a\n                    contract of insurance, container leasing agreement, an arbitration agreement in\n                    the charterparty or the guarantee in the present case, it would fall outside the\n                    purview of s 3(1)(h).44     In determining whether a claim can be\n                    considered to fall under s 3(1)(h), it would\n                    be useful to pose the question, “How did the claim arise?” The\n                    answer in this case would be “under the guarantee”. The next\n                    relevant question would be, “Did the guarantee relate to the use or hire\n                    of theMahakam?” The answer to that would\n                    be in the negative. This approach was adopted by Sheen J inThe Stella Nova[1981] Com L R 200, which I found\n                    it to be a usefulindiciumfor the direct\n                    connection test.45     In the course of the hearing, I also invited\n                    the parties to address me on the UK decision ofThe\n                        Zeus[1888] 13 PD 188. In that case, the charterparty\n                    provided that the vessel was to proceed to a port to load a full and complete\n                    cargo of coal from a colliery against a guarantee from the colliery to pay\n                    demurrage to the ship owner if the loading was not completed within 48 hours\n                    upon arrival. The court held that although the term demurrage was used in the\n                    colliery guarantee, the claim was not based on an agreement relating to the use\n                    or hire of the vessel. Significantly, the court held (at 190) that\n                    “unless it can be established that the agreement is one in relation to\n                    the use or hire of a ship the fact that the word “demurrage” is\n                    used is immaterial.” Counsel for the plaintiff sought to distinguishThe Zeuson the basis that unlike the present\n                    case, the provision of the guarantee was not a condition precedent to the\n                    charterparty. Although it may not have been expressed as a condition precedent,\n                    it was nonetheless specifically provided in the charterparty itself that the\n                    loading of the vessel was on condition of the colliery guarantee annexed to the\n                    charterparty. The decisive reason why the colliery guarantee inThe Zeuswas held not to be an agreement relating to the\n                    use or hire of a ship was not because of the manner in which the condition was\n                    expressed, but rather because the guarantee in itself did not relate to the use\n                    or hire of a ship. Interestingly,The Zeuswas\n                    decided almost a century before the “direct connection” test was\n                    expounded inThe Sandrina.46     Finally, I will deal with the\n                    plaintiff’s remaining submission that in cases where the agreements were\n                    held to be outside s 3(1)(h) of the HCAJA,\n                    typically the vessels were not referred to in the agreements unlike the present\n                    case where the Bareboat C/P of theMahakamwas\n                    expressly referred to in the recital of the guarantee. From my analysis of the\n                    relevant authorities, I do not regard this distinction to be material, much less\n                    critical. InThe Eschersheim, andThe Queen of the South, the vessels were both not\n                    specifically mentioned in the agreements and yet they were held to be within the\n                    UK equivalent of s 3(1)(h). However, inThe Zeus,The\n                        AifanouriosandThe Bumbesti, by\n                    way of illustrations, the vessels were referred to in the agreements but they\n                    were still held to be outside the ambit of the provision. The express reference\n                    of the vessels in the agreements is therefore clearly not decisive. InThe EschersheimandThe Queen of the\n                        South, the agreements in themselves related to the use or hire of\n                    the vessels even though the vessels were not named in the agreements. On the\n                    other hand, inThe Zeus,The\n                        AifanouriosandThe Bumbesti,\n                    despite the express reference of the vessels in the agreements, they were held\n                    to be outside the provision simply because those agreements were one step\n                    removed from the agreements which related to the use or hire of the vessel and\n                    hence lacked the requisite “direct connection”.Second issue – whether HIT was in possession or control of theMahakamat the time when the cause of action under\n                the guarantee arose47     This issue arises for determination under\n                        s 4(4)(b) of the HCAJA. At the time when\n                    the cause of action accrued against HIT under the guarantee, it is not essential\n                    that HIT must be the owner of theMahakam. This\n                    requirement is equally satisfied so long as HIT was either the charterer or in\n                    possession or in control of theMahakamat the\n                    time when the cause of action arose.48     It is therefore apposite to embark on the\n                    analysis by first determining when the cause of action against HIT\n                    accrued.49     The principal claim by the plaintiff against\n                    Heritage under the Bareboat C/P was for outstanding arrears of charterhire due\n                    and owing since 16 April 2009. The Bareboat C/P was eventually terminated\n                    on 22 June 2009 due to non-payment of the charterhire and for other\n                    breaches of the Bareboat C/P. As the guarantee issued by HIT was to secure the\n                    performance and payment of Heritage’s obligations under the Bareboat C/P,\n                    it is safe to conclude that the cause of action accrued no earlier than\n                    16 April 2009. This was not disputed by the plaintiff. Therefore, the\n                    inquiry as to whether HIT was in possession or in control of theMahakamshould be directed during this time\n                    frame.To lift or not to lift the corporate veil50     The plaintiff relies on the following\n                    materials to show that HIT was in possession or in control of theMahakamat the time when the cause of action\n                    arose:(a)     Heritage is a shell corporation\n                        through which HIT conducts its business and it has no separate independent\n                        identity from HIT.(b)     HIT uses Heritage as their “paying/receiving agent” in\n                        order to insulate itself from creditors.(c)     Heritage is essentially the “chartering\n                        arm” of HIT.(d)     HIT makes, receives, approves and/or directs payments on behalf of\n                        its wholly owned subsidiaries including Heritage.(e)     HIT and Heritage share common\n                        ownership, operations and/or premises.(f)     Heritage is the wholly owned subsidiary of HST which is\n                        in turn a wholly owned subsidiary of HIT(g)     Both HIT and Heritage have at least one common\n                        director and authorised signatory in Bobby Andika.(h)     Agus Darjanto as a common director to\n                        both HIT and Heritage signed the guarantee and the Bareboat C/P on behalf of\n                        both parties.(i)     HIT took over possession and control of theMahakamin or about June 2009 when they provided their crew\n                        to take over theMahakamat Belawan, Indonesia\n                        from the crew supplied by the previous managers of\n                Heritage.51     On the basis of the above matters, counsel for\n                    the plaintiff submitted that “Heritage and PT Humpus should properly be\n                    considered as a single economic unit with no corporate distinction between them,\n                    thus rendering each liable for the debts of the other.”52     It seems to me that the plaintiff was\n                    effectively inviting the court to lift the corporate veil in order to show that\n                    HIT was in reality the charterers of theMahakamunder the Bareboat C/P. These same matters were also referred to in the\n                    affidavit filed by Fredrik Platou in support of the warrant of arrest. In the\n                    same affidavit, the plaintiff alleged that HIT is the alter ego of Heritage. In\n                    the light of these assertions, it would appear that the plaintiff was seeking to\n                    lift the corporate veil in order to show that HIT was in truth the charterers of\n                    theMahakam. On this basis, HIT prepared\n                    substantial submissions to respond to the plaintiff’s perceived attempt to\n                    lift the corporate veil.53     However, on a plain reading of the indorsement\n                    in the writ of summons, it was clear that the plaintiff’s claim against\n                    HIT was solely based on the guarantee. There is no separate or alternative claim\n                    against HIT under the Bareboat C/P. Accordingly, at the commencement of the\n                    hearing, I sought clarification from the plaintiff’s counsel whether she\n                    was seeking to lift the corporate veil. She confirmed that the claim as indorsed\n                    in the writ of summons is based solely on the guarantee and that she was not\n                    attempting to lift the corporate veil in spite of the assertions in the\n                    affidavit in support of the warrant of arrest.54     Implicit in the plaintiff’s confirmation\n                    is their acknowledgment that the materials which they were relying on do not\n                    justify the lifting of the corporate veil. It is plainly inconsistent and\n                    incongruous for the plaintiff to rely on the same materials to show that HIT was\n                    in possession or in control of theMahakamhaving\n                    accepted that Heritage was the bareboat charterers of theMahakamat all material times. As earlier observed, the\n                    plaintiff has commenced London arbitration proceedings against Heritage for the\n                    outstanding charterhire under the Bareboat C/P.55     The establishment of one-ship companies within\n                    a group of companies is a well-known and legitimate practice in the shipping\n                    industry: seeThe Evpo Agnic[1988] 2\n                    Lloyd’s Rep 411 at 415 (“The Evpo\n                        Agnic”). There have been numerous unsuccessful attempts to\n                    lift the corporate veil in the context of one-ship companies with common\n                    shareholdings and/or directors: seeThe Evpo\n                    Agnic,The Maritime Trader,The Neptune[1986] HKLR 345,The Andres Bonifacio,The\n                        Interippu[1990] SGHC 131 (“The\n                        Interippu”) andThe Skaw\n                        Prince[1994] 3 SLR 379. The court may be minded to\n                    lift the corporate veil if there are exceptional circumstances which indicate\n                    the presence of a façade or sham set up to deceive or to perpetrate a fraud: seeThe Aventicum,The Saudi\n                        Prince[1982] 2 Lloyd’s Rep 255 andWin Line (UK) Ltd v Masterpart (Singapore) Pte Ltd[2000]\n                    2 SLR 98 at 116-117.56     None of the exceptional circumstances exist in\n                    the present case to warrant the piercing of the corporate veil. No allegation of\n                    fraud was raised by the plaintiff. That explains why the plaintiff did not\n                    attempt to lift the corporate veil. After all, the plaintiff chose and agreed to\n                    enter into the Bareboat C/P with Heritage with full knowledge that Heritage is\n                    related to HIT. In fact, the plaintiff accepted the guarantee from HIT on that\n                    basis.Person “in possession or in control” of the\n                vessel57     Section 4(4)(b)\n                    of the HCAJA refers to 3 different entities:(a)owner;(b)charterer; and(c)person in possession or in control58     These different entities concern parties with\n                    substantive as opposed to nominal or formal interest in relation to the ship:\n                    seeThe Ohm Mariana[1993] 2 SLR 698 at\n                    710 (“The Ohm\n                Mariana”).59     Under Singapore law, an owner refers to the\n                    beneficial owner who is vested with the right of sale: seeThe Ohm Mariana. It is not restricted only to the registered\n                    owners as was found to be the case inThe Evpo\n                        Agnic. Charterer would include voyage, time, demise or even slot\n                    charterers. Each of these charterers would have legally enforceable rights in\n                    relation to the employment of the ship. By the same token, a named charterer\n                    under a sham charterparty is not a charterer within the meaning of\n                        s 4(4)(b) of the HCAJA as the sham\n                    charterparty does not give rise to any legally enforceable rightsquacharterer: seeThe Inai\n                        Selasih.60     Similarly as rightly observed by Chao JC\n                    (as he then was) inThe Interippu, the term\n                    “in possession or in control” must mean possession or control\n                    “as an independent legal right”. Chao JC stated that:I am afraid there is hardly any evidence to show that Corporate Shipping\n                        were in possession or control of “Engineer 103”. The fact that\n                        H H Wong was managing “Engineer 103” does not necessarily mean\n                        that Corporate Shipping were therefore in control or possession of\n                        “Engineer 103”. After all, H H Wong was at the relevant time a\n                        director of both companies, one being the holding company and the other a\n                        subsidiary company. Something more than just a common shareholding or\n                        manager/director is required to sustain a claim of “possession or\n                        control”, otherwise, it would sweep aside the entire concept of\n                        corporate structures and entities. I am inclined to accept the submission of\n                        the Defendants that the term “in possession or in control” in\n                        section 4(4) must mean possession or control as an independent legal right;\n                        or at least the possession or control must be pursuant to a specific\n                        arrangement.61     It does not refer to physical possession or\n                    controlper se. Such a person would include a\n                    demise charterer (seeThe Span Terza[1982]\n                    1 Lloyd’s Rep 225 at 227), a salvor in possession (seeThe Evpo Agnicat 414), a purchaser under a\n                    conditional sale agreement (seeThe Permina 3001[1977] 1 MLJ 141 at 144), and a person who is in a position of a\n                    demise charterer albeit not under a demise charter (seeThe\n                        Evpo Agnicat 414). It would also cover a mortgagee in possession\n                    who has taken over the vessel following the default of the mortgagor. The common\n                    denominator is that each of them has legally enforceable rights as regards\n                    possession or control of the vessel.62     The matters relied on are largely material in\n                    relation to an attempt to lift the corporate veil which the plaintiff conceded\n                    they were not seeking to do. In any event, none of them either singly or\n                    collectively would justify the veil to be pierced. Based on the evidence before\n                    me, Heritage has substantial assets in excess of US$30m. It maintains its own\n                    bank accounts with Bank Negara Indonesia, CMIB Bank and BNP Paribas. The fact\n                    that it does not maintain its own employees is not remarkable in itself. It is\n                    not uncommon for wholly owned subsidiaries to share and use office premises and\n                    employees with their parents or the ultimate holding company. The plaintiff also\n                    referred to various emails to suggest that HIT had paid the ship management fees\n                    for theMahakamand had arranged to pay various\n                    expenses on behalf of Heritage. However, the evidence suggest otherwise. While\n                    HIT may have been involved in the payment process, the evidence indicate that\n                    the payments were made from Heritage’s bank accounts.63     Even if HIT has control over Heritage directly\n                    or through HST, it is strictly irrelevant for the present purposes since it is a\n                    fundamental principle of company law that a shareholder has no property, legal\n                    or equitable, in the assets of the company: seeThe Maritime\n                        Traderat 157 andThe Interippuat\n                    6. Furthermore, having control over Heritage does not translate into\n                    “possession or control” over theMahakam.64     The plaintiff also relied on the Ship\n                    Management Agreement dated 14 December 2007 under which HIT was appointed\n                    by Heritage to manage theMahakam. In July 2008,\n                    Heritage appointed an independent company, Seaquestsandigan Pte Ltd\n                    (“Seaquestsandigan”) to take over the management of the vessel\n                    from HIT. Accordingly, HIT were not even the ship managers of the vessel in\n                    April 2009 when the cause of action accrued. The plaintiff alleged that\n                    Seaquestsandigan’s appointment was limited only to the technical and\n                    crewing responsibilities and that all other management duties remained with HIT.\n                    Even accepting the plaintiff’s submission, the management of theMahakampursuant to an appointment by Heritage does not\n                    vest any legally enforceable rights on HIT as regards possession or control over\n                    theMahakam. It would be wrong to treat ship\n                    managers as being “in possession or in control” of a vessel. Their\n                    responsibilities over the vessel arise by reason of their appointment by the\n                    principal. If the managers should exercise any rights of control or possession\n                    over the vessel, it would be on behalf of their principal and not as an\n                    independent legal right. The appointment can be terminated by the principal just\n                    as in this case when Heritage appointed Seaquestsandigan to take over from HIT\n                    in July 2008.65     Further, the plaintiff submitted that the\n                    supply of crew by HIT for theMahakamat Belawan,\n                    Indonesia in June 2009 amounted to taking possession or control over the vessel.\n                    According to the affidavit of Capt Thanabalasingam s/o Balakrishnan, the crew\n                    was supplied by HIT following his request on behalf of Heritage after\n                    Seaquestsandigan removed their crew from theMahakamupon the termination of their ship management agreement.\n                    The supply of crew was therefore not to enable HIT to take over physical\n                    possession or control of theMahakamfrom\n                    Seaquestsandigan or even Heritage, but rather to enable the vessel to be manned\n                    at the request of Heritage after Seaquestsandigan removed their\n                crew.66     The plaintiff also relied on the decision of\n                    the Federal Court of Australia inMalaysia Shipyard and\n                        Engineering Sdn Bhd v Iron Shortland[1995] FCA 1565\n                        (“Iron Shortland”). In that case\n                    the claimant sought and succeeded in lifting the corporate veil to show that the\n                    parent company, Capeco Maritime NV (“Capeco Maritime”) was the\n                    beneficial owner of the two vessels,Iron\n                        ShortlandandNewcastle Prideeven\n                    though they were registered in the names of their wholly owned subsidiaries. The\n                    finding was based on the evidence presented by the claimant. Having found that\n                    Capeco Maritime was the beneficial owner of the vessel, the court observed that\n                    the “evidence at least establishes that Capeco Maritime was in possession\n                    or control of theNewcastle Pride”. The\n                    facts are therefore entirely different from the present case. First, the\n                    plaintiff concedes that they are not seeking to lift the corporate veil. In any\n                    event, the lifting of the corporate veil in theIron\n                        Shortlandwas based on the specific evidence presented in that\n                    case. Secondly, as Capeco Maritime was found to be the beneficial owner of the\n                    vessel,a fortiorithey would be in possession or\n                    in control of the vessel.67     Finally, the plaintiff also relied onThe Fua Kavenga. Any inquiry as to whether a\n                    person was “in possession or in control” of a vessel is primarily\n                    a question of fact taking into account the applicable legal principles. As such,\n                    the mere fact that a person who had provided a guarantee was found to be\n                    “in possession or in control” of a vessel in one case does not\n                    mean that all guarantors would likewise be treated in the same way. Each case\n                    must necessarily be decided on its own facts.The Fua\n                        Kavengadoes not provide any useful guidance on this issue. In\n                    fact, counsel for the plaintiff accepted that this issue was not properly\n                    considered. The court appeared to have accepted that the guarantor inThe Fua Kavengawas “in possession or in\n                    control” of the vessel because the chartererers were “in a variety\n                    of ways the agent or alter ego of the (guarantor)”: at 567. Furthermore,\n                    Smellie J also referred to the submission by counsel on the lifting of the\n                    corporate veil without any indication whether the veil would be lifted on the\n                    evidence before him. Given that there was no analysis as to why the guarantor\n                    was determined to be a person “in possession or in control” of the\n                    vessel and since there is no issue for the lifting of the corporate veil in the\n                    instant case unlikeThe Fua Kavenga, with respect,\n                    I do not find the decision to be instructive.Conclusion68     I therefore hold that the plaintiff has failed\n                    to satisfy me on the two jurisdictional issues raised by HIT. Failure to satisfy\n                    either would be fatal. In the result, the admiralty jurisdiction of the High\n                    Court was improperly invoked against HIT’s vessel,Catur Samudra. Accordingly, it is axiomatic that the writ of\n                    summons and the warrant of arrest must be set aside which I so ordered on\n                    21 December 2009. HIT is awarded costs of the action as well as the\n                    application to be taxed if not agreed.69     HIT has a remaining prayer for damages for\n                    wrongful arrest. When I delivered my oral judgment, I provisionally indicated\n                    subject to full arguments from both parties that this was perhaps not an\n                    appropriate case for damages to be awarded. I, however, adjourned the prayer\n                    with liberty to HIT to restore it for hearing before me within 14 days from the\n                    date of the oral decision. 14 days have since elapsed and HIT has elected not to\n                    proceed with the claim for wrongful arrest.",
        "Burden of proof": "22     It is well settled and not in dispute that the\n                    burden of proof is on the plaintiff to satisfy all the jurisdictional\n                    requirements laid down in s 4(4) of the HCAJA in order to successfully\n                    invoke the admiralty jurisdiction against theCatur\n                        Samudra: seeThe Maritime Trader[1981] 2 Lloyd’s Rep 153 (“The Maritime\n                        Trader”) at 157 andThe Andres\n                        Bonifacio[1991] 2 MLJ 371 (“The Andres Bonifacio”). 23     It is also trite that the plaintiff must\n                    satisfy the burden of proof on a balance of probabilities: seeThe Aventicum[1978] 1 Lloyd’s Rep 184 at 190\n                    andThe Alexandrea[2002] 3 SLR 56 at[18]. Equally, it is not in dispute that\n                    the question of admiralty jurisdiction must be decided based on the affidavit\n                    evidence before the court and should not be tried as an issue (save for\n                    exceptional circumstances which do not apply here): It follows as a matter of principle that any question of jurisdiction,\n                        such as the question in the present motions, must be dealt with on the\n                        motions, and cannot be dealt with as an issue in the actions - per Goff L J inThe I Congresco[1977] 1 Lloyd’s Rep 536 at 559. 24     In order to invoke the admiralty jurisdiction\n                    of the High Court against theCatur Samudra, four\n                    conditions under s 4(4) of the HCAJA must first be satisfied (seeThe Permina 108[1977] 1 MLJ 43 at 45 andThe Inai Selasih[2005] 4 SLR 1 at\n                    [6]). These conditions are: (a)The claim is mentioned in section 3 (1) (d)\n                            to (q);(b)The claim arises in connection with the\n                            ship;(c)The person who would be liable on the claim in an\n                            action in personam (referred to in this subsection as the relevant\n                            person) was, when the cause of action arose, the owner or charterer of,\n                            or in possession or in control of, the ship;(d)At the time when the action is brought, the\n                            relevant person is the beneficial owner as respect all the shares in the\n                            other ship against which an action in rem is brought.25     As regards sub-para (a), HIT denies that the\n                    claim under the guarantee falls within s 3(1)(h). There is no dispute that the requirements under sub-paras\n                    (b) and (d) are satisfied. As regards sub-para (c), this condition may be\n                    further broken into two sub-conditions:(i)     That the person proceeded against,ie, HIT, must either be the owner or\n                        charterer of, or in possession or in control of theMahakamat the time when the cause of action arose. The\n                        plaintiff alleged that HIT was in possession or in control of theMahakam. This is disputed by HIT;(ii)     That HIT is the person who would be\n                        liable to the plaintiff under the guarantee in an action in personam. This\n                        requirement is not disputed since HIT was indeed the party who executed the\n                        guarantee.First issue - Whether the plaintiff’s claim under the guarantee\n                issued by HIT would be a claim arising out of an agreement relating to the\n                charterparty in respect of theMahakam26     Counsel for the plaintiff advanced the\n                    following arguments that the claim under the guarantee falls within the scope of\n                        s 3(1)(h) of the HCAJA:(a)     The provisions of the HCAJA\n                        including s 3(1)(h) are to be given a\n                        “broad and liberal construction.” –The Antonis P Lemos[1985] AC 711\n                            (“The Antonis P\n                            Lemos”),The\n                            Indriani[1996] 1 SLR 305 (“The Indriani“) andThe\n                            Mara[2000] 4 SLR 156 (“The Mara“) were cited in support.(b)     The guarantee issued by HIT would\n                        constitute an agreement relating to the charterparty of theMahakamas the provision of the guarantee was stated\n                        to be a condition precedent to the Bareboat C/P. Initially,The Fua Kavengawas cited in support. Subsequently,\n                        the decision of the Federal Court of Canada,National\n                            Bank Leasing v Merlac Marine Inc(1992) 52 Federal Trial\n                        Reports 15 (“National Bank\n                        Leasing”) was also cited in aid of this\n                        construction.(c)     The Bareboat C/P in respect of theMahakamwas specifically referred to in the guarantee.27     On the other hand, counsel for HIT put forward\n                    the following rival contentions:(a)     There are two connecting phrases in\n                            s 3(1)(h) of the HCAJA. While\n                        “arising out of” has been given a wide and liberal\n                        construction, the other connecting phrase “relating to” is\n                        more relevant. The courts have consistently applied a narrow and restricted\n                        interpretation of the phrase “relating to”.The Fua Kavengashould not be followed since the court did\n                        not address this vital difference.(b)     The guarantee was for the financial protection of the\n                        plaintiff and was strictly unnecessary for the use or hire of theMahakam.(c)     The identification of theMahakamin the guarantee is not\n                decisive.28     Section 3(1)(h)\n                    of the HCAJA reads as follows:3.—(1) The admiralty jurisdiction of the High Court shall be as\n                        follows, that is to say, jurisdiction to hear and determine any of the\n                        following questions or claims:…(h) any claim arising out of any agreement\n                                relating to thecarriage of goods in a ship\n                            or to the use or hire of a ship; [emphasis added]29     It is apparent that there are two connecting\n                    phrases which govern the proper construction of s 3(1)(h),ie, “arising out\n                    of” and “relating to”.Effect of the expression “arising out of”30     For many years, it was considered to be\n                    settled law that a claim in tort falls within the UK equivalent of\n                        s 3(1)(h): seeThe St\n                        Elefterio[1957] P 179 at 183:[t]he words…are…wide enough to cover claims whether in\n                        contract or in tort arising out of any agreement relating to the carriage of\n                        goods in a ship.31     About 30 years later, counsel for the\n                    shipowners, Mark Saville QC (now Lord Saville) inThe Antonis\n                        P Lemossought to venture into unchartered waters in submitting\n                    that s 20(2)(h) of the UK Supreme Court Act\n                    1981 (inpari materiawith s 3(1)(h) of the HCAJA) only applied to claims of a purely\n                    contractual nature. After reviewing the relevant authorities, the House of Lords\n                    inThe Antonis P Lemosheld that the expression\n                    “arising out of” should be given its wider meaning of\n                    “connected with” and not the narrower meaning of “arising\n                    under”. InThe Antonis P Lemos, the claim\n                    was brought by the sub-sub-charterer against the shipowner in the tort of\n                    negligence for failing to ensure that the draft of the vessel did not exceed 32\n                    feet upon arrival at the port of discharge which thereby caused additional\n                    expenses to lighten the vessel. Accordingly, the effect of the holding is that\n                        s 20(2)(h) of the UK Act is wide enough\n                    to encompass a claim in tort even though there was no direct contractual\n                    relationship between the sub-sub charterer and the shipowner. However, it is\n                    relevant to highlight that inThe Antonio P Lemos,\n                    the claim in tort arose from a sub-sub charter. There can be no dispute that a\n                    sub-sub-charter like any other charterparty is an agreement relating to the use\n                    or hire of a vessel.32The MaraandThe Indrianicited by the plaintiff do not\n                    assist either. In both cases, the courts were concerned with the interpretation\n                    of the expression “arising out of”. InThe\n                        Mara, the Court of Appeal held that a claim for contractual\n                    compensation in respect of personal injuries payable under a collective\n                    agreement was a claim arising out of loss of life or personal injury under\n                        s 3(1)(f) of the HCAJA. InThe Indriani, consistent with the broad and liberal\n                    application of “arising out of” under s 3(1)(h), the Court of Appeal affirmed the decision of the\n                    lower court that a claim for malicious falsehood arising from the issuance of a\n                    clean bill of lading was a claim arising out of an agreement relating to the use\n                    or hire of a vessel. It could hardly be disputed that a claim under a bill of\n                    lading was indeed a claim arising out of an agreement relating to the use or\n                    hire of the vessel. While the courts have leaned towards a broad interpretation\n                    of the expression “arising out of” to enlarge the types of claims\n                    as falling within s 3(1)(h), they have,\n                    however, adopted a narrow interpretation to restrict the claims only under\n                    agreements which are in themselves related to the use or hire of a\n                    vessel.Ambit of the expression “relating to” – Direct\n                Connection Test33     In the present case, counsel for the defendant\n                    rightly focussed on the more relevant expression “relating to”.\n                    The House of Lord inGatoil International Inc v\n                        Arkwright-Boston Manufacturers Mutual Insurance Co[1985] AC 255\n                        (“The Sandrina”) reviewed the\n                    previous authorities and formulated the test that to constitute “an\n                    agreement relating to the use or hire of a ship” the agreement must have\n                    some “reasonably direct connection with such activities” (at 271).\n                    InThe Sandrina, the contract of insurance\n                    arranged by the shipowner for cargo shipped onboard the vessel was found to lack\n                    the “direct connection” and hence outside the ambit of\n                        s 20(2)(h) of the UK act. For the same\n                    reason, an agreement for salvage services inThe\n                        Eschersheimwas found to fall within the UK equivalent of\n                        s 3(1)(h) because the rendering of\n                    salvage services directly involved the use of a salvage vessel Similarly, the\n                    agreement for mooring and unmooring services inThe Queen of\n                        the South[1968] 1 All ER 1163 (“The\n                        Queen of the South”) directly involved the use of motor\n                    boats in providing the services.34     In deciding on the scope of the expression\n                    “relating to”, it is useful to refer to decisions where claims\n                    which have some appearance of a connection with the use or hire of a vessel were\n                    nevertheless held to fall outside the equivalent of s 3(1)(h):(a)     InThe\n                            Tesaba[1982] 1 Lloyd's Rep 397 (“The Tesaba”), the claim by the salvors\n                        against the shipowner was for failure to use best endeavours to ensure that\n                        cargo interests provide security prior to the release of the cargo in breach\n                        of the salvage agreement.(b)     InThe Sandrina, the claim\n                        was by the cargo insurers for unpaid premiums for insurance arranged by the\n                        shipowner on the cargo carried onboard the vessel.(c)     InThe\n                            Aifanourios(1980) SC 346(“The Aifanourios”), the claim was by the\n                        P&I insurers for unpaid release calls in respect of the vessel payable\n                        by the shipowner.(d)     InThe Bumbesti[1999]\n                        2 Lloyd’s Rep 481 (“The\n                            Bumbesti”), the claim was to enforce an arbitration\n                        award arising from a breach of a charterparty.(e)     Finally, a claim for outstanding hire payable\n                        under an agreement for the hire of containers previously held to be within\n                        the equivalent of s 3(1)(h) inThe Sonia S[1983] 2 Lloyd’s Rep 63\n                        was observed inThe Sandrinato have been\n                        wrongly decided and should be overruled.35     In each of the above cases, the claims were\n                    made under agreements which by themselves were not agreements relating to the\n                    use or hire of a vessel. This is to be contrasted withThe\n                        EschersheimandThe Queen of the\n                        Southwhere the claims were based on agreements which directly\n                    related to the use or hire of a vessel. In the present case, the guarantee is\n                    not an agreement which in itself relates to the use or hire of theMahakam. The sole purpose of the guarantee was to\n                    provide financial protection to the plaintiff against the risk of default by\n                    Heritage under the Bareboat C/P. In similar vein, inThe\n                        Aifanourios, although it was clear that the insurance of a vessel\n                    is a matter directed to the convenience and protection of the owner, it was held\n                    to be outside the scope of the equivalent of s 3(1)(h) because it was “... not essential for the operation of\n                    the vessel as such” (per Lord Wylie at 350). Equally, in each of these\n                    cases, the claims were based on separate agreements which were one step removed\n                    from the agreement for the use or hire of a vessel. The claims were based on\n                    agreements which wereindirectlyrelated to the\n                    use or hire of the vessels.36     This is consistent with the approach adopted\n                    by Aikens J inThe Bumbestiat 487 –\n                    488:(2) However, thatagreement to refer disputes is not,\n                            itself, an “agreement in relation to the use or hire of a\n                            ship”. This is because\n                        the arbitration agreement, whether it is the individual reference or the\n                        general agreement to refer, is a contract that is distinct from the\n                        principal contract, i.e. the bareboat charter-party in this\n                        case…(3) … The agreement to refer to arbitration individual disputes\n                        that have arisen out of a charter-party, or the agreement to refer future\n                        disputes in general that arise out of a charter-party, must be agreements\n                        that areindirectly“in relation to the\n                        use or hire of a ship”. But, in my view, they are not agreements that\n                        aresufficiently directly“in relation\n                        to the use or hire of a ship”The arbitration agreement is, at least, one step removed\n                            from the “use or hire” of a ship. The breach of contract\n                            relied upon to found the present claim has nothing to do with the use or\n                            hire of the ship; it concerns the implied term to fulfil any\n                        award made pursuant to the agreement to refer disputes. In my view the\n                        breach of the contract relied on when suing on an award does not have the\n                        “reasonably direct connection with” the use or hire of the\n                        ship that Lord Keith held in theGatoilcase\n                        was necessary to found jurisdiction...[emphasis in bold italics added]37     The plaintiff relied on the fact that under\n                    the Bareboat C/P, it was a condition precedent for HIT to execute the guarantee.\n                    On this basis, it was submitted that the guarantee must be an agreement relating\n                    to the Bareboat C/P since without the guarantee, there would have been no\n                    Bareboat C/P of theMahakam. In my view, an\n                    agreement which in itself is not an agreement intrinsically related to the use\n                    or hire of a vessel cannot be transformed into such an agreement simply by\n                    characterising it as a term or condition precedent of the charterparty. This\n                    would have the effect of altering the “direct connection” test\n                    into a “but for” test. If such a test is to be adopted, it would\n                    mean that an agreement for example to lease a building or to sell shares in a\n                    company which are framed as condition precedents to a charterparty wouldipso factobecome an agreement relating to the\n                    use or hire of a vessel. Such a submission would enlarge the admiralty\n                    jurisdiction of the High Court to cover claims which were never contemplated to\n                    have the right of arrest. Similarly, it is not uncommon for shipowners to insist\n                    on the incorporation of an arbitration agreement in the charterparty. In this\n                    way, it could be said that “but for” the arbitration agreement,\n                    the shipowner would not enter into the charterparty. However, as pointed out inThe Bumbesti, a claim to enforce an\n                    arbitration award arising out of the charterparty is at best a claim which isindirectlyrelated to the use or hire of the\n                    vessel.38     In the course of the hearing before me, I\n                    enquired from counsel for the plaintiff whether there is any authority that a\n                    claim brought under a collateral or separate agreement independent of the\n                    charterparty or bill of lading has been held to fall within\n                        s 3(1)(h). Initially, TheFua Kavengawas the only authority cited. Subsequently\n                    after the hearing and before I rendered my oral judgment, the plaintiff’s\n                    counsel also citedNational Bank Leasingin their\n                    further arguments. In setting aside the writ and the warrant of arrest, I\n                    informed the parties that I will explain why I have declined to follow these two\n                    decisions in my written grounds.39     InThe Fua\n                        Kavenga, the court dealt with several issues of admiralty\n                    jurisdiction in addition to sovereign immunity andres\n                        judicata. The main discussion on admiralty jurisdiction was\n                    whether New Zealand should adopt the UK approach of “sister ship”\n                    arrest inThe Eschersheimor the Singapore\n                    position inThe Permina 108. After analysing the\n                    conflicting views, the court preferred and adoptedThe\n                        Permina 108. Smellie J referred toThe\n                        Antonis P Lemosthat the expression “arising out\n                    of” (which is found in the New Zealand equivalent in s 4(1) of the\n                    Admiralty Act, 1973) is to be construed widely as “connected\n                    with”. AlthoughThe Sandrinawas also\n                    cited, there was no analysis in the judgment why despite the narrow\n                    interpretation of the relevant expression “relating to”, the claim\n                    under the guarantee was nevertheless found to be a claim relating to the use or\n                    hire of a vessel. This was not disputed by counsel for the plaintiff during the\n                    hearing. It seems to me that Smellie J after citingThe\n                        Antonis P Lemosas authority for the wide interpretation of the\n                    expression “arising out of” assumed that the broad interpretation\n                    should govern the entire sub-section without addressing how that was to be\n                    reconciled with the narrower expression of “relating\n                to”.40     InNational Bank\n                        Leasing, the Federal Court of Canada had to consider whether a\n                    claim under a Guarantee Bond which guaranteed the performance of a charterer\n                    fell within its jurisdiction.41     The Federal Court held that it had\n                    jurisdiction because the claim arose out of an agreement relating to the use or\n                    hire of a ship by charterparty within the meaning of s 22(2)(i) of the Federal Court Act, RSC 1985. It is apparent\n                    that the Canadian provision is practically identical to s 3(1)(h) of the HCAJA. In arriving at its decision, the\n                    Federal Court did not refer to and consequently did not consider any of the\n                    leading UK authorities on point. Instead, the Federal Court, after referring to\n                    the statement of claim that “the possible liability of the\n                    defendant… under the Lease Guarantee Bond [arises] out of the\n                    default...under the charterparty”, held that the claim “arises out\n                    of an agreement (the Lease Guarantee Bond) relating to the use or hire of a ship\n                    (as governed by the charterparty)”(at[6]). The Federal Court also observed that the claim under the\n                    Lease Guarantee Bond was inseparably linked to the charterparty. This appears to\n                    be akin to the “but for” test. The decision was therefore bereft\n                    of any serious analysis of the relevant narrow expression “relating\n                    to” and does not provide any useful assistance to the present\n                    case.42     The Australian approach of the “direct\n                    connection” test inPort of Geelong Authority v The\n                        Bass Reefer(1992) Federal Court Reports 374 (“The Bass Reefer”) is instructive. In that case,\n                    the plaintiff port authority, entered into a leasing agreement with the\n                    defendant shipowner. Under the agreement, the plaintiff agreed to provide some\n                    land for the defendant’s ships to handle container cargo and a priority\n                    berthing licence to the defendant. The plaintiff brought an in rem claim against\n                    the defendant’s ship for outstanding fees under the agreement. The court\n                    held that both claims fell outside the ambit of the equivalent\n                        s 3(1)(h). It held at 381 to 382:I ask myself, therefore, whether the agreement for lease in this case\n                        relevantly relates to the carriage of goods by the defendant ship or to its\n                        use or hire. I apply the test asto whether there is a\n                            strong argument for the existence of a reasonably direct connection\n                            between either of these agreements and those activities. I am\n                        satisfied that there is not. So far as connection with the carriage of goods\n                        by the defendant ship, it is not unreasonable to bear in mind that the\n                        decision in Gatoil rejected the contention that the contract of insurance of\n                        goods so carried was sufficiently connected. In the present case, so far as\n                        the lease is concerned, its purpose and effect, as previously indicated, was\n                        to provide a conveniently close area for the receipt of cargo from the ship\n                        and the assembly of cargo to be taken on board the ship. It might\n                        conceivably be said that these procedures had a connection with the\n                        operations of loading and unloading cargo to and from the ship. I express no\n                        concluded view as to that. However, I am satisfied that there is no\n                        reasonably direct connection between them and the actual carriage of goods\n                        by the ship. There is even less connection, in my view, between those\n                        activities and the use or hire of the ship.The licence\n                            agreement, the main feature of which was to provide priority berthing\n                            for the ship at the nominated berth has, in my opinion, no reasonably\n                            direct connection with the carriage of goods by the ship.\n                        Although the licence agreement has the effect of providing a regular berth\n                        for the ship, the effect of this is to provide a facility, at best, for use\n                        by the ship. It does not have any significant connection with the use of the\n                        ship itself. Finally, I can see no significant connection between the\n                        licence agreement and the hire of the ship.[emphasis added]43     The claims were held to be outside the\n                    provision because the lease agreement had little to do with the carriage of\n                    goods by the defendant’s ship or its use and hire. In the present case,\n                    the guarantee provided by HIT was strictly not for or related to the use or hire\n                    of theMahakam. It seems to me that if a claim is\n                    brought under an agreement which is collateral or ancillary to the contract of\n                    carriage, that collateral or ancillary agreement must also be intrinsically\n                    related to the use or hire of a vessel. If the collateral agreement is not\n                    intrinsically an agreement relating to the use or hire of a vessel such as a\n                    contract of insurance, container leasing agreement, an arbitration agreement in\n                    the charterparty or the guarantee in the present case, it would fall outside the\n                    purview of s 3(1)(h).44     In determining whether a claim can be\n                    considered to fall under s 3(1)(h), it would\n                    be useful to pose the question, “How did the claim arise?” The\n                    answer in this case would be “under the guarantee”. The next\n                    relevant question would be, “Did the guarantee relate to the use or hire\n                    of theMahakam?” The answer to that would\n                    be in the negative. This approach was adopted by Sheen J inThe Stella Nova[1981] Com L R 200, which I found\n                    it to be a usefulindiciumfor the direct\n                    connection test.45     In the course of the hearing, I also invited\n                    the parties to address me on the UK decision ofThe\n                        Zeus[1888] 13 PD 188. In that case, the charterparty\n                    provided that the vessel was to proceed to a port to load a full and complete\n                    cargo of coal from a colliery against a guarantee from the colliery to pay\n                    demurrage to the ship owner if the loading was not completed within 48 hours\n                    upon arrival. The court held that although the term demurrage was used in the\n                    colliery guarantee, the claim was not based on an agreement relating to the use\n                    or hire of the vessel. Significantly, the court held (at 190) that\n                    “unless it can be established that the agreement is one in relation to\n                    the use or hire of a ship the fact that the word “demurrage” is\n                    used is immaterial.” Counsel for the plaintiff sought to distinguishThe Zeuson the basis that unlike the present\n                    case, the provision of the guarantee was not a condition precedent to the\n                    charterparty. Although it may not have been expressed as a condition precedent,\n                    it was nonetheless specifically provided in the charterparty itself that the\n                    loading of the vessel was on condition of the colliery guarantee annexed to the\n                    charterparty. The decisive reason why the colliery guarantee inThe Zeuswas held not to be an agreement relating to the\n                    use or hire of a ship was not because of the manner in which the condition was\n                    expressed, but rather because the guarantee in itself did not relate to the use\n                    or hire of a ship. Interestingly,The Zeuswas\n                    decided almost a century before the “direct connection” test was\n                    expounded inThe Sandrina.46     Finally, I will deal with the\n                    plaintiff’s remaining submission that in cases where the agreements were\n                    held to be outside s 3(1)(h) of the HCAJA,\n                    typically the vessels were not referred to in the agreements unlike the present\n                    case where the Bareboat C/P of theMahakamwas\n                    expressly referred to in the recital of the guarantee. From my analysis of the\n                    relevant authorities, I do not regard this distinction to be material, much less\n                    critical. InThe Eschersheim, andThe Queen of the South, the vessels were both not\n                    specifically mentioned in the agreements and yet they were held to be within the\n                    UK equivalent of s 3(1)(h). However, inThe Zeus,The\n                        AifanouriosandThe Bumbesti, by\n                    way of illustrations, the vessels were referred to in the agreements but they\n                    were still held to be outside the ambit of the provision. The express reference\n                    of the vessels in the agreements is therefore clearly not decisive. InThe EschersheimandThe Queen of the\n                        South, the agreements in themselves related to the use or hire of\n                    the vessels even though the vessels were not named in the agreements. On the\n                    other hand, inThe Zeus,The\n                        AifanouriosandThe Bumbesti,\n                    despite the express reference of the vessels in the agreements, they were held\n                    to be outside the provision simply because those agreements were one step\n                    removed from the agreements which related to the use or hire of the vessel and\n                    hence lacked the requisite “direct connection”.Second issue – whether HIT was in possession or control of theMahakamat the time when the cause of action under\n                the guarantee arose47     This issue arises for determination under\n                        s 4(4)(b) of the HCAJA. At the time when\n                    the cause of action accrued against HIT under the guarantee, it is not essential\n                    that HIT must be the owner of theMahakam. This\n                    requirement is equally satisfied so long as HIT was either the charterer or in\n                    possession or in control of theMahakamat the\n                    time when the cause of action arose.48     It is therefore apposite to embark on the\n                    analysis by first determining when the cause of action against HIT\n                    accrued.49     The principal claim by the plaintiff against\n                    Heritage under the Bareboat C/P was for outstanding arrears of charterhire due\n                    and owing since 16 April 2009. The Bareboat C/P was eventually terminated\n                    on 22 June 2009 due to non-payment of the charterhire and for other\n                    breaches of the Bareboat C/P. As the guarantee issued by HIT was to secure the\n                    performance and payment of Heritage’s obligations under the Bareboat C/P,\n                    it is safe to conclude that the cause of action accrued no earlier than\n                    16 April 2009. This was not disputed by the plaintiff. Therefore, the\n                    inquiry as to whether HIT was in possession or in control of theMahakamshould be directed during this time\n                    frame.To lift or not to lift the corporate veil50     The plaintiff relies on the following\n                    materials to show that HIT was in possession or in control of theMahakamat the time when the cause of action\n                    arose:(a)     Heritage is a shell corporation\n                        through which HIT conducts its business and it has no separate independent\n                        identity from HIT.(b)     HIT uses Heritage as their “paying/receiving agent” in\n                        order to insulate itself from creditors.(c)     Heritage is essentially the “chartering\n                        arm” of HIT.(d)     HIT makes, receives, approves and/or directs payments on behalf of\n                        its wholly owned subsidiaries including Heritage.(e)     HIT and Heritage share common\n                        ownership, operations and/or premises.(f)     Heritage is the wholly owned subsidiary of HST which is\n                        in turn a wholly owned subsidiary of HIT(g)     Both HIT and Heritage have at least one common\n                        director and authorised signatory in Bobby Andika.(h)     Agus Darjanto as a common director to\n                        both HIT and Heritage signed the guarantee and the Bareboat C/P on behalf of\n                        both parties.(i)     HIT took over possession and control of theMahakamin or about June 2009 when they provided their crew\n                        to take over theMahakamat Belawan, Indonesia\n                        from the crew supplied by the previous managers of\n                Heritage.51     On the basis of the above matters, counsel for\n                    the plaintiff submitted that “Heritage and PT Humpus should properly be\n                    considered as a single economic unit with no corporate distinction between them,\n                    thus rendering each liable for the debts of the other.”52     It seems to me that the plaintiff was\n                    effectively inviting the court to lift the corporate veil in order to show that\n                    HIT was in reality the charterers of theMahakamunder the Bareboat C/P. These same matters were also referred to in the\n                    affidavit filed by Fredrik Platou in support of the warrant of arrest. In the\n                    same affidavit, the plaintiff alleged that HIT is the alter ego of Heritage. In\n                    the light of these assertions, it would appear that the plaintiff was seeking to\n                    lift the corporate veil in order to show that HIT was in truth the charterers of\n                    theMahakam. On this basis, HIT prepared\n                    substantial submissions to respond to the plaintiff’s perceived attempt to\n                    lift the corporate veil.53     However, on a plain reading of the indorsement\n                    in the writ of summons, it was clear that the plaintiff’s claim against\n                    HIT was solely based on the guarantee. There is no separate or alternative claim\n                    against HIT under the Bareboat C/P. Accordingly, at the commencement of the\n                    hearing, I sought clarification from the plaintiff’s counsel whether she\n                    was seeking to lift the corporate veil. She confirmed that the claim as indorsed\n                    in the writ of summons is based solely on the guarantee and that she was not\n                    attempting to lift the corporate veil in spite of the assertions in the\n                    affidavit in support of the warrant of arrest.54     Implicit in the plaintiff’s confirmation\n                    is their acknowledgment that the materials which they were relying on do not\n                    justify the lifting of the corporate veil. It is plainly inconsistent and\n                    incongruous for the plaintiff to rely on the same materials to show that HIT was\n                    in possession or in control of theMahakamhaving\n                    accepted that Heritage was the bareboat charterers of theMahakamat all material times. As earlier observed, the\n                    plaintiff has commenced London arbitration proceedings against Heritage for the\n                    outstanding charterhire under the Bareboat C/P.55     The establishment of one-ship companies within\n                    a group of companies is a well-known and legitimate practice in the shipping\n                    industry: seeThe Evpo Agnic[1988] 2\n                    Lloyd’s Rep 411 at 415 (“The Evpo\n                        Agnic”). There have been numerous unsuccessful attempts to\n                    lift the corporate veil in the context of one-ship companies with common\n                    shareholdings and/or directors: seeThe Evpo\n                    Agnic,The Maritime Trader,The Neptune[1986] HKLR 345,The Andres Bonifacio,The\n                        Interippu[1990] SGHC 131 (“The\n                        Interippu”) andThe Skaw\n                        Prince[1994] 3 SLR 379. The court may be minded to\n                    lift the corporate veil if there are exceptional circumstances which indicate\n                    the presence of a façade or sham set up to deceive or to perpetrate a fraud: seeThe Aventicum,The Saudi\n                        Prince[1982] 2 Lloyd’s Rep 255 andWin Line (UK) Ltd v Masterpart (Singapore) Pte Ltd[2000]\n                    2 SLR 98 at 116-117.56     None of the exceptional circumstances exist in\n                    the present case to warrant the piercing of the corporate veil. No allegation of\n                    fraud was raised by the plaintiff. That explains why the plaintiff did not\n                    attempt to lift the corporate veil. After all, the plaintiff chose and agreed to\n                    enter into the Bareboat C/P with Heritage with full knowledge that Heritage is\n                    related to HIT. In fact, the plaintiff accepted the guarantee from HIT on that\n                    basis.Person “in possession or in control” of the\n                vessel57     Section 4(4)(b)\n                    of the HCAJA refers to 3 different entities:(a)owner;(b)charterer; and(c)person in possession or in control58     These different entities concern parties with\n                    substantive as opposed to nominal or formal interest in relation to the ship:\n                    seeThe Ohm Mariana[1993] 2 SLR 698 at\n                    710 (“The Ohm\n                Mariana”).59     Under Singapore law, an owner refers to the\n                    beneficial owner who is vested with the right of sale: seeThe Ohm Mariana. It is not restricted only to the registered\n                    owners as was found to be the case inThe Evpo\n                        Agnic. Charterer would include voyage, time, demise or even slot\n                    charterers. Each of these charterers would have legally enforceable rights in\n                    relation to the employment of the ship. By the same token, a named charterer\n                    under a sham charterparty is not a charterer within the meaning of\n                        s 4(4)(b) of the HCAJA as the sham\n                    charterparty does not give rise to any legally enforceable rightsquacharterer: seeThe Inai\n                        Selasih.60     Similarly as rightly observed by Chao JC\n                    (as he then was) inThe Interippu, the term\n                    “in possession or in control” must mean possession or control\n                    “as an independent legal right”. Chao JC stated that:I am afraid there is hardly any evidence to show that Corporate Shipping\n                        were in possession or control of “Engineer 103”. The fact that\n                        H H Wong was managing “Engineer 103” does not necessarily mean\n                        that Corporate Shipping were therefore in control or possession of\n                        “Engineer 103”. After all, H H Wong was at the relevant time a\n                        director of both companies, one being the holding company and the other a\n                        subsidiary company. Something more than just a common shareholding or\n                        manager/director is required to sustain a claim of “possession or\n                        control”, otherwise, it would sweep aside the entire concept of\n                        corporate structures and entities. I am inclined to accept the submission of\n                        the Defendants that the term “in possession or in control” in\n                        section 4(4) must mean possession or control as an independent legal right;\n                        or at least the possession or control must be pursuant to a specific\n                        arrangement.61     It does not refer to physical possession or\n                    controlper se. Such a person would include a\n                    demise charterer (seeThe Span Terza[1982]\n                    1 Lloyd’s Rep 225 at 227), a salvor in possession (seeThe Evpo Agnicat 414), a purchaser under a\n                    conditional sale agreement (seeThe Permina 3001[1977] 1 MLJ 141 at 144), and a person who is in a position of a\n                    demise charterer albeit not under a demise charter (seeThe\n                        Evpo Agnicat 414). It would also cover a mortgagee in possession\n                    who has taken over the vessel following the default of the mortgagor. The common\n                    denominator is that each of them has legally enforceable rights as regards\n                    possession or control of the vessel.62     The matters relied on are largely material in\n                    relation to an attempt to lift the corporate veil which the plaintiff conceded\n                    they were not seeking to do. In any event, none of them either singly or\n                    collectively would justify the veil to be pierced. Based on the evidence before\n                    me, Heritage has substantial assets in excess of US$30m. It maintains its own\n                    bank accounts with Bank Negara Indonesia, CMIB Bank and BNP Paribas. The fact\n                    that it does not maintain its own employees is not remarkable in itself. It is\n                    not uncommon for wholly owned subsidiaries to share and use office premises and\n                    employees with their parents or the ultimate holding company. The plaintiff also\n                    referred to various emails to suggest that HIT had paid the ship management fees\n                    for theMahakamand had arranged to pay various\n                    expenses on behalf of Heritage. However, the evidence suggest otherwise. While\n                    HIT may have been involved in the payment process, the evidence indicate that\n                    the payments were made from Heritage’s bank accounts.63     Even if HIT has control over Heritage directly\n                    or through HST, it is strictly irrelevant for the present purposes since it is a\n                    fundamental principle of company law that a shareholder has no property, legal\n                    or equitable, in the assets of the company: seeThe Maritime\n                        Traderat 157 andThe Interippuat\n                    6. Furthermore, having control over Heritage does not translate into\n                    “possession or control” over theMahakam.64     The plaintiff also relied on the Ship\n                    Management Agreement dated 14 December 2007 under which HIT was appointed\n                    by Heritage to manage theMahakam. In July 2008,\n                    Heritage appointed an independent company, Seaquestsandigan Pte Ltd\n                    (“Seaquestsandigan”) to take over the management of the vessel\n                    from HIT. Accordingly, HIT were not even the ship managers of the vessel in\n                    April 2009 when the cause of action accrued. The plaintiff alleged that\n                    Seaquestsandigan’s appointment was limited only to the technical and\n                    crewing responsibilities and that all other management duties remained with HIT.\n                    Even accepting the plaintiff’s submission, the management of theMahakampursuant to an appointment by Heritage does not\n                    vest any legally enforceable rights on HIT as regards possession or control over\n                    theMahakam. It would be wrong to treat ship\n                    managers as being “in possession or in control” of a vessel. Their\n                    responsibilities over the vessel arise by reason of their appointment by the\n                    principal. If the managers should exercise any rights of control or possession\n                    over the vessel, it would be on behalf of their principal and not as an\n                    independent legal right. The appointment can be terminated by the principal just\n                    as in this case when Heritage appointed Seaquestsandigan to take over from HIT\n                    in July 2008.65     Further, the plaintiff submitted that the\n                    supply of crew by HIT for theMahakamat Belawan,\n                    Indonesia in June 2009 amounted to taking possession or control over the vessel.\n                    According to the affidavit of Capt Thanabalasingam s/o Balakrishnan, the crew\n                    was supplied by HIT following his request on behalf of Heritage after\n                    Seaquestsandigan removed their crew from theMahakamupon the termination of their ship management agreement.\n                    The supply of crew was therefore not to enable HIT to take over physical\n                    possession or control of theMahakamfrom\n                    Seaquestsandigan or even Heritage, but rather to enable the vessel to be manned\n                    at the request of Heritage after Seaquestsandigan removed their\n                crew.66     The plaintiff also relied on the decision of\n                    the Federal Court of Australia inMalaysia Shipyard and\n                        Engineering Sdn Bhd v Iron Shortland[1995] FCA 1565\n                        (“Iron Shortland”). In that case\n                    the claimant sought and succeeded in lifting the corporate veil to show that the\n                    parent company, Capeco Maritime NV (“Capeco Maritime”) was the\n                    beneficial owner of the two vessels,Iron\n                        ShortlandandNewcastle Prideeven\n                    though they were registered in the names of their wholly owned subsidiaries. The\n                    finding was based on the evidence presented by the claimant. Having found that\n                    Capeco Maritime was the beneficial owner of the vessel, the court observed that\n                    the “evidence at least establishes that Capeco Maritime was in possession\n                    or control of theNewcastle Pride”. The\n                    facts are therefore entirely different from the present case. First, the\n                    plaintiff concedes that they are not seeking to lift the corporate veil. In any\n                    event, the lifting of the corporate veil in theIron\n                        Shortlandwas based on the specific evidence presented in that\n                    case. Secondly, as Capeco Maritime was found to be the beneficial owner of the\n                    vessel,a fortiorithey would be in possession or\n                    in control of the vessel.67     Finally, the plaintiff also relied onThe Fua Kavenga. Any inquiry as to whether a\n                    person was “in possession or in control” of a vessel is primarily\n                    a question of fact taking into account the applicable legal principles. As such,\n                    the mere fact that a person who had provided a guarantee was found to be\n                    “in possession or in control” of a vessel in one case does not\n                    mean that all guarantors would likewise be treated in the same way. Each case\n                    must necessarily be decided on its own facts.The Fua\n                        Kavengadoes not provide any useful guidance on this issue. In\n                    fact, counsel for the plaintiff accepted that this issue was not properly\n                    considered. The court appeared to have accepted that the guarantor inThe Fua Kavengawas “in possession or in\n                    control” of the vessel because the chartererers were “in a variety\n                    of ways the agent or alter ego of the (guarantor)”: at 567. Furthermore,\n                    Smellie J also referred to the submission by counsel on the lifting of the\n                    corporate veil without any indication whether the veil would be lifted on the\n                    evidence before him. Given that there was no analysis as to why the guarantor\n                    was determined to be a person “in possession or in control” of the\n                    vessel and since there is no issue for the lifting of the corporate veil in the\n                    instant case unlikeThe Fua Kavenga, with respect,\n                    I do not find the decision to be instructive.Conclusion68     I therefore hold that the plaintiff has failed\n                    to satisfy me on the two jurisdictional issues raised by HIT. Failure to satisfy\n                    either would be fatal. In the result, the admiralty jurisdiction of the High\n                    Court was improperly invoked against HIT’s vessel,Catur Samudra. Accordingly, it is axiomatic that the writ of\n                    summons and the warrant of arrest must be set aside which I so ordered on\n                    21 December 2009. HIT is awarded costs of the action as well as the\n                    application to be taxed if not agreed.69     HIT has a remaining prayer for damages for\n                    wrongful arrest. When I delivered my oral judgment, I provisionally indicated\n                    subject to full arguments from both parties that this was perhaps not an\n                    appropriate case for damages to be awarded. I, however, adjourned the prayer\n                    with liberty to HIT to restore it for hearing before me within 14 days from the\n                    date of the oral decision. 14 days have since elapsed and HIT has elected not to\n                    proceed with the claim for wrongful arrest.",
        "First issue - Whether the plaintiff’s claim under the guarantee\n                issued by HIT would be a claim arising out of an agreement relating to the\n                charterparty in respect of theMahakam": "26     Counsel for the plaintiff advanced the\n                    following arguments that the claim under the guarantee falls within the scope of\n                        s 3(1)(h) of the HCAJA: (a)     The provisions of the HCAJA\n                        including s 3(1)(h) are to be given a\n                        “broad and liberal construction.” –The Antonis P Lemos[1985] AC 711\n                            (“The Antonis P\n                            Lemos”),The\n                            Indriani[1996] 1 SLR 305 (“The Indriani“) andThe\n                            Mara[2000] 4 SLR 156 (“The Mara“) were cited in support. (b)     The guarantee issued by HIT would\n                        constitute an agreement relating to the charterparty of theMahakamas the provision of the guarantee was stated\n                        to be a condition precedent to the Bareboat C/P. Initially,The Fua Kavengawas cited in support. Subsequently,\n                        the decision of the Federal Court of Canada,National\n                            Bank Leasing v Merlac Marine Inc(1992) 52 Federal Trial\n                        Reports 15 (“National Bank\n                        Leasing”) was also cited in aid of this\n                        construction. (c)     The Bareboat C/P in respect of theMahakamwas specifically referred to in the guarantee. 27     On the other hand, counsel for HIT put forward\n                    the following rival contentions: (a)     There are two connecting phrases in\n                            s 3(1)(h) of the HCAJA. While\n                        “arising out of” has been given a wide and liberal\n                        construction, the other connecting phrase “relating to” is\n                        more relevant. The courts have consistently applied a narrow and restricted\n                        interpretation of the phrase “relating to”.The Fua Kavengashould not be followed since the court did\n                        not address this vital difference. (b)     The guarantee was for the financial protection of the\n                        plaintiff and was strictly unnecessary for the use or hire of theMahakam. (c)     The identification of theMahakamin the guarantee is not\n                decisive. 28     Section 3(1)(h)\n                    of the HCAJA reads as follows: 3.—(1) The admiralty jurisdiction of the High Court shall be as\n                        follows, that is to say, jurisdiction to hear and determine any of the\n                        following questions or claims: … (h) any claim arising out of any agreement\n                                relating to thecarriage of goods in a ship\n                            or to the use or hire of a ship; [emphasis added] 29     It is apparent that there are two connecting\n                    phrases which govern the proper construction of s 3(1)(h),ie, “arising out\n                    of” and “relating to”.",
        "Effect of the expression “arising out of”": "30     For many years, it was considered to be\n                    settled law that a claim in tort falls within the UK equivalent of\n                        s 3(1)(h): seeThe St\n                        Elefterio[1957] P 179 at 183: [t]he words…are…wide enough to cover claims whether in\n                        contract or in tort arising out of any agreement relating to the carriage of\n                        goods in a ship. 31     About 30 years later, counsel for the\n                    shipowners, Mark Saville QC (now Lord Saville) inThe Antonis\n                        P Lemossought to venture into unchartered waters in submitting\n                    that s 20(2)(h) of the UK Supreme Court Act\n                    1981 (inpari materiawith s 3(1)(h) of the HCAJA) only applied to claims of a purely\n                    contractual nature. After reviewing the relevant authorities, the House of Lords\n                    inThe Antonis P Lemosheld that the expression\n                    “arising out of” should be given its wider meaning of\n                    “connected with” and not the narrower meaning of “arising\n                    under”. InThe Antonis P Lemos, the claim\n                    was brought by the sub-sub-charterer against the shipowner in the tort of\n                    negligence for failing to ensure that the draft of the vessel did not exceed 32\n                    feet upon arrival at the port of discharge which thereby caused additional\n                    expenses to lighten the vessel. Accordingly, the effect of the holding is that\n                        s 20(2)(h) of the UK Act is wide enough\n                    to encompass a claim in tort even though there was no direct contractual\n                    relationship between the sub-sub charterer and the shipowner. However, it is\n                    relevant to highlight that inThe Antonio P Lemos,\n                    the claim in tort arose from a sub-sub charter. There can be no dispute that a\n                    sub-sub-charter like any other charterparty is an agreement relating to the use\n                    or hire of a vessel. 32The MaraandThe Indrianicited by the plaintiff do not\n                    assist either. In both cases, the courts were concerned with the interpretation\n                    of the expression “arising out of”. InThe\n                        Mara, the Court of Appeal held that a claim for contractual\n                    compensation in respect of personal injuries payable under a collective\n                    agreement was a claim arising out of loss of life or personal injury under\n                        s 3(1)(f) of the HCAJA. InThe Indriani, consistent with the broad and liberal\n                    application of “arising out of” under s 3(1)(h), the Court of Appeal affirmed the decision of the\n                    lower court that a claim for malicious falsehood arising from the issuance of a\n                    clean bill of lading was a claim arising out of an agreement relating to the use\n                    or hire of a vessel. It could hardly be disputed that a claim under a bill of\n                    lading was indeed a claim arising out of an agreement relating to the use or\n                    hire of the vessel. While the courts have leaned towards a broad interpretation\n                    of the expression “arising out of” to enlarge the types of claims\n                    as falling within s 3(1)(h), they have,\n                    however, adopted a narrow interpretation to restrict the claims only under\n                    agreements which are in themselves related to the use or hire of a\n                    vessel.",
        "Ambit of the expression “relating to” – Direct\n                Connection Test": "33     In the present case, counsel for the defendant\n                    rightly focussed on the more relevant expression “relating to”.\n                    The House of Lord inGatoil International Inc v\n                        Arkwright-Boston Manufacturers Mutual Insurance Co[1985] AC 255\n                        (“The Sandrina”) reviewed the\n                    previous authorities and formulated the test that to constitute “an\n                    agreement relating to the use or hire of a ship” the agreement must have\n                    some “reasonably direct connection with such activities” (at 271).\n                    InThe Sandrina, the contract of insurance\n                    arranged by the shipowner for cargo shipped onboard the vessel was found to lack\n                    the “direct connection” and hence outside the ambit of\n                        s 20(2)(h) of the UK act. For the same\n                    reason, an agreement for salvage services inThe\n                        Eschersheimwas found to fall within the UK equivalent of\n                        s 3(1)(h) because the rendering of\n                    salvage services directly involved the use of a salvage vessel Similarly, the\n                    agreement for mooring and unmooring services inThe Queen of\n                        the South[1968] 1 All ER 1163 (“The\n                        Queen of the South”) directly involved the use of motor\n                    boats in providing the services. 34     In deciding on the scope of the expression\n                    “relating to”, it is useful to refer to decisions where claims\n                    which have some appearance of a connection with the use or hire of a vessel were\n                    nevertheless held to fall outside the equivalent of s 3(1)(h): (a)     InThe\n                            Tesaba[1982] 1 Lloyd's Rep 397 (“The Tesaba”), the claim by the salvors\n                        against the shipowner was for failure to use best endeavours to ensure that\n                        cargo interests provide security prior to the release of the cargo in breach\n                        of the salvage agreement. (b)     InThe Sandrina, the claim\n                        was by the cargo insurers for unpaid premiums for insurance arranged by the\n                        shipowner on the cargo carried onboard the vessel. (c)     InThe\n                            Aifanourios(1980) SC 346(“The Aifanourios”), the claim was by the\n                        P&I insurers for unpaid release calls in respect of the vessel payable\n                        by the shipowner. (d)     InThe Bumbesti[1999]\n                        2 Lloyd’s Rep 481 (“The\n                            Bumbesti”), the claim was to enforce an arbitration\n                        award arising from a breach of a charterparty. (e)     Finally, a claim for outstanding hire payable\n                        under an agreement for the hire of containers previously held to be within\n                        the equivalent of s 3(1)(h) inThe Sonia S[1983] 2 Lloyd’s Rep 63\n                        was observed inThe Sandrinato have been\n                        wrongly decided and should be overruled. 35     In each of the above cases, the claims were\n                    made under agreements which by themselves were not agreements relating to the\n                    use or hire of a vessel. This is to be contrasted withThe\n                        EschersheimandThe Queen of the\n                        Southwhere the claims were based on agreements which directly\n                    related to the use or hire of a vessel. In the present case, the guarantee is\n                    not an agreement which in itself relates to the use or hire of theMahakam. The sole purpose of the guarantee was to\n                    provide financial protection to the plaintiff against the risk of default by\n                    Heritage under the Bareboat C/P. In similar vein, inThe\n                        Aifanourios, although it was clear that the insurance of a vessel\n                    is a matter directed to the convenience and protection of the owner, it was held\n                    to be outside the scope of the equivalent of s 3(1)(h) because it was “... not essential for the operation of\n                    the vessel as such” (per Lord Wylie at 350). Equally, in each of these\n                    cases, the claims were based on separate agreements which were one step removed\n                    from the agreement for the use or hire of a vessel. The claims were based on\n                    agreements which wereindirectlyrelated to the\n                    use or hire of the vessels. 36     This is consistent with the approach adopted\n                    by Aikens J inThe Bumbestiat 487 –\n                    488: (2) However, thatagreement to refer disputes is not,\n                            itself, an “agreement in relation to the use or hire of a\n                            ship”. This is because\n                        the arbitration agreement, whether it is the individual reference or the\n                        general agreement to refer, is a contract that is distinct from the\n                        principal contract, i.e. the bareboat charter-party in this\n                        case… (3) … The agreement to refer to arbitration individual disputes\n                        that have arisen out of a charter-party, or the agreement to refer future\n                        disputes in general that arise out of a charter-party, must be agreements\n                        that areindirectly“in relation to the\n                        use or hire of a ship”. But, in my view, they are not agreements that\n                        aresufficiently directly“in relation\n                        to the use or hire of a ship”The arbitration agreement is, at least, one step removed\n                            from the “use or hire” of a ship. The breach of contract\n                            relied upon to found the present claim has nothing to do with the use or\n                            hire of the ship; it concerns the implied term to fulfil any\n                        award made pursuant to the agreement to refer disputes. In my view the\n                        breach of the contract relied on when suing on an award does not have the\n                        “reasonably direct connection with” the use or hire of the\n                        ship that Lord Keith held in theGatoilcase\n                        was necessary to found jurisdiction... [emphasis in bold italics added] 37     The plaintiff relied on the fact that under\n                    the Bareboat C/P, it was a condition precedent for HIT to execute the guarantee.\n                    On this basis, it was submitted that the guarantee must be an agreement relating\n                    to the Bareboat C/P since without the guarantee, there would have been no\n                    Bareboat C/P of theMahakam. In my view, an\n                    agreement which in itself is not an agreement intrinsically related to the use\n                    or hire of a vessel cannot be transformed into such an agreement simply by\n                    characterising it as a term or condition precedent of the charterparty. This\n                    would have the effect of altering the “direct connection” test\n                    into a “but for” test. If such a test is to be adopted, it would\n                    mean that an agreement for example to lease a building or to sell shares in a\n                    company which are framed as condition precedents to a charterparty wouldipso factobecome an agreement relating to the\n                    use or hire of a vessel. Such a submission would enlarge the admiralty\n                    jurisdiction of the High Court to cover claims which were never contemplated to\n                    have the right of arrest. Similarly, it is not uncommon for shipowners to insist\n                    on the incorporation of an arbitration agreement in the charterparty. In this\n                    way, it could be said that “but for” the arbitration agreement,\n                    the shipowner would not enter into the charterparty. However, as pointed out inThe Bumbesti, a claim to enforce an\n                    arbitration award arising out of the charterparty is at best a claim which isindirectlyrelated to the use or hire of the\n                    vessel. 38     In the course of the hearing before me, I\n                    enquired from counsel for the plaintiff whether there is any authority that a\n                    claim brought under a collateral or separate agreement independent of the\n                    charterparty or bill of lading has been held to fall within\n                        s 3(1)(h). Initially, TheFua Kavengawas the only authority cited. Subsequently\n                    after the hearing and before I rendered my oral judgment, the plaintiff’s\n                    counsel also citedNational Bank Leasingin their\n                    further arguments. In setting aside the writ and the warrant of arrest, I\n                    informed the parties that I will explain why I have declined to follow these two\n                    decisions in my written grounds. 39     InThe Fua\n                        Kavenga, the court dealt with several issues of admiralty\n                    jurisdiction in addition to sovereign immunity andres\n                        judicata. The main discussion on admiralty jurisdiction was\n                    whether New Zealand should adopt the UK approach of “sister ship”\n                    arrest inThe Eschersheimor the Singapore\n                    position inThe Permina 108. After analysing the\n                    conflicting views, the court preferred and adoptedThe\n                        Permina 108. Smellie J referred toThe\n                        Antonis P Lemosthat the expression “arising out\n                    of” (which is found in the New Zealand equivalent in s 4(1) of the\n                    Admiralty Act, 1973) is to be construed widely as “connected\n                    with”. AlthoughThe Sandrinawas also\n                    cited, there was no analysis in the judgment why despite the narrow\n                    interpretation of the relevant expression “relating to”, the claim\n                    under the guarantee was nevertheless found to be a claim relating to the use or\n                    hire of a vessel. This was not disputed by counsel for the plaintiff during the\n                    hearing. It seems to me that Smellie J after citingThe\n                        Antonis P Lemosas authority for the wide interpretation of the\n                    expression “arising out of” assumed that the broad interpretation\n                    should govern the entire sub-section without addressing how that was to be\n                    reconciled with the narrower expression of “relating\n                to”. 40     InNational Bank\n                        Leasing, the Federal Court of Canada had to consider whether a\n                    claim under a Guarantee Bond which guaranteed the performance of a charterer\n                    fell within its jurisdiction. 41     The Federal Court held that it had\n                    jurisdiction because the claim arose out of an agreement relating to the use or\n                    hire of a ship by charterparty within the meaning of s 22(2)(i) of the Federal Court Act, RSC 1985. It is apparent\n                    that the Canadian provision is practically identical to s 3(1)(h) of the HCAJA. In arriving at its decision, the\n                    Federal Court did not refer to and consequently did not consider any of the\n                    leading UK authorities on point. Instead, the Federal Court, after referring to\n                    the statement of claim that “the possible liability of the\n                    defendant… under the Lease Guarantee Bond [arises] out of the\n                    default...under the charterparty”, held that the claim “arises out\n                    of an agreement (the Lease Guarantee Bond) relating to the use or hire of a ship\n                    (as governed by the charterparty)”(at[6]). The Federal Court also observed that the claim under the\n                    Lease Guarantee Bond was inseparably linked to the charterparty. This appears to\n                    be akin to the “but for” test. The decision was therefore bereft\n                    of any serious analysis of the relevant narrow expression “relating\n                    to” and does not provide any useful assistance to the present\n                    case. 42     The Australian approach of the “direct\n                    connection” test inPort of Geelong Authority v The\n                        Bass Reefer(1992) Federal Court Reports 374 (“The Bass Reefer”) is instructive. In that case,\n                    the plaintiff port authority, entered into a leasing agreement with the\n                    defendant shipowner. Under the agreement, the plaintiff agreed to provide some\n                    land for the defendant’s ships to handle container cargo and a priority\n                    berthing licence to the defendant. The plaintiff brought an in rem claim against\n                    the defendant’s ship for outstanding fees under the agreement. The court\n                    held that both claims fell outside the ambit of the equivalent\n                        s 3(1)(h). It held at 381 to 382: I ask myself, therefore, whether the agreement for lease in this case\n                        relevantly relates to the carriage of goods by the defendant ship or to its\n                        use or hire. I apply the test asto whether there is a\n                            strong argument for the existence of a reasonably direct connection\n                            between either of these agreements and those activities. I am\n                        satisfied that there is not. So far as connection with the carriage of goods\n                        by the defendant ship, it is not unreasonable to bear in mind that the\n                        decision in Gatoil rejected the contention that the contract of insurance of\n                        goods so carried was sufficiently connected. In the present case, so far as\n                        the lease is concerned, its purpose and effect, as previously indicated, was\n                        to provide a conveniently close area for the receipt of cargo from the ship\n                        and the assembly of cargo to be taken on board the ship. It might\n                        conceivably be said that these procedures had a connection with the\n                        operations of loading and unloading cargo to and from the ship. I express no\n                        concluded view as to that. However, I am satisfied that there is no\n                        reasonably direct connection between them and the actual carriage of goods\n                        by the ship. There is even less connection, in my view, between those\n                        activities and the use or hire of the ship.The licence\n                            agreement, the main feature of which was to provide priority berthing\n                            for the ship at the nominated berth has, in my opinion, no reasonably\n                            direct connection with the carriage of goods by the ship.\n                        Although the licence agreement has the effect of providing a regular berth\n                        for the ship, the effect of this is to provide a facility, at best, for use\n                        by the ship. It does not have any significant connection with the use of the\n                        ship itself. Finally, I can see no significant connection between the\n                        licence agreement and the hire of the ship. [emphasis added] 43     The claims were held to be outside the\n                    provision because the lease agreement had little to do with the carriage of\n                    goods by the defendant’s ship or its use and hire. In the present case,\n                    the guarantee provided by HIT was strictly not for or related to the use or hire\n                    of theMahakam. It seems to me that if a claim is\n                    brought under an agreement which is collateral or ancillary to the contract of\n                    carriage, that collateral or ancillary agreement must also be intrinsically\n                    related to the use or hire of a vessel. If the collateral agreement is not\n                    intrinsically an agreement relating to the use or hire of a vessel such as a\n                    contract of insurance, container leasing agreement, an arbitration agreement in\n                    the charterparty or the guarantee in the present case, it would fall outside the\n                    purview of s 3(1)(h). 44     In determining whether a claim can be\n                    considered to fall under s 3(1)(h), it would\n                    be useful to pose the question, “How did the claim arise?” The\n                    answer in this case would be “under the guarantee”. The next\n                    relevant question would be, “Did the guarantee relate to the use or hire\n                    of theMahakam?” The answer to that would\n                    be in the negative. This approach was adopted by Sheen J inThe Stella Nova[1981] Com L R 200, which I found\n                    it to be a usefulindiciumfor the direct\n                    connection test. 45     In the course of the hearing, I also invited\n                    the parties to address me on the UK decision ofThe\n                        Zeus[1888] 13 PD 188. In that case, the charterparty\n                    provided that the vessel was to proceed to a port to load a full and complete\n                    cargo of coal from a colliery against a guarantee from the colliery to pay\n                    demurrage to the ship owner if the loading was not completed within 48 hours\n                    upon arrival. The court held that although the term demurrage was used in the\n                    colliery guarantee, the claim was not based on an agreement relating to the use\n                    or hire of the vessel. Significantly, the court held (at 190) that\n                    “unless it can be established that the agreement is one in relation to\n                    the use or hire of a ship the fact that the word “demurrage” is\n                    used is immaterial.” Counsel for the plaintiff sought to distinguishThe Zeuson the basis that unlike the present\n                    case, the provision of the guarantee was not a condition precedent to the\n                    charterparty. Although it may not have been expressed as a condition precedent,\n                    it was nonetheless specifically provided in the charterparty itself that the\n                    loading of the vessel was on condition of the colliery guarantee annexed to the\n                    charterparty. The decisive reason why the colliery guarantee inThe Zeuswas held not to be an agreement relating to the\n                    use or hire of a ship was not because of the manner in which the condition was\n                    expressed, but rather because the guarantee in itself did not relate to the use\n                    or hire of a ship. Interestingly,The Zeuswas\n                    decided almost a century before the “direct connection” test was\n                    expounded inThe Sandrina. 46     Finally, I will deal with the\n                    plaintiff’s remaining submission that in cases where the agreements were\n                    held to be outside s 3(1)(h) of the HCAJA,\n                    typically the vessels were not referred to in the agreements unlike the present\n                    case where the Bareboat C/P of theMahakamwas\n                    expressly referred to in the recital of the guarantee. From my analysis of the\n                    relevant authorities, I do not regard this distinction to be material, much less\n                    critical. InThe Eschersheim, andThe Queen of the South, the vessels were both not\n                    specifically mentioned in the agreements and yet they were held to be within the\n                    UK equivalent of s 3(1)(h). However, inThe Zeus,The\n                        AifanouriosandThe Bumbesti, by\n                    way of illustrations, the vessels were referred to in the agreements but they\n                    were still held to be outside the ambit of the provision. The express reference\n                    of the vessels in the agreements is therefore clearly not decisive. InThe EschersheimandThe Queen of the\n                        South, the agreements in themselves related to the use or hire of\n                    the vessels even though the vessels were not named in the agreements. On the\n                    other hand, inThe Zeus,The\n                        AifanouriosandThe Bumbesti,\n                    despite the express reference of the vessels in the agreements, they were held\n                    to be outside the provision simply because those agreements were one step\n                    removed from the agreements which related to the use or hire of the vessel and\n                    hence lacked the requisite “direct connection”.",
        "Second issue – whether HIT was in possession or control of theMahakamat the time when the cause of action under\n                the guarantee arose": "47     This issue arises for determination under\n                        s 4(4)(b) of the HCAJA. At the time when\n                    the cause of action accrued against HIT under the guarantee, it is not essential\n                    that HIT must be the owner of theMahakam. This\n                    requirement is equally satisfied so long as HIT was either the charterer or in\n                    possession or in control of theMahakamat the\n                    time when the cause of action arose. 48     It is therefore apposite to embark on the\n                    analysis by first determining when the cause of action against HIT\n                    accrued. 49     The principal claim by the plaintiff against\n                    Heritage under the Bareboat C/P was for outstanding arrears of charterhire due\n                    and owing since 16 April 2009. The Bareboat C/P was eventually terminated\n                    on 22 June 2009 due to non-payment of the charterhire and for other\n                    breaches of the Bareboat C/P. As the guarantee issued by HIT was to secure the\n                    performance and payment of Heritage’s obligations under the Bareboat C/P,\n                    it is safe to conclude that the cause of action accrued no earlier than\n                    16 April 2009. This was not disputed by the plaintiff. Therefore, the\n                    inquiry as to whether HIT was in possession or in control of theMahakamshould be directed during this time\n                    frame.",
        "To lift or not to lift the corporate veil": "50     The plaintiff relies on the following\n                    materials to show that HIT was in possession or in control of theMahakamat the time when the cause of action\n                    arose: (a)     Heritage is a shell corporation\n                        through which HIT conducts its business and it has no separate independent\n                        identity from HIT. (b)     HIT uses Heritage as their “paying/receiving agent” in\n                        order to insulate itself from creditors. (c)     Heritage is essentially the “chartering\n                        arm” of HIT. (d)     HIT makes, receives, approves and/or directs payments on behalf of\n                        its wholly owned subsidiaries including Heritage. (e)     HIT and Heritage share common\n                        ownership, operations and/or premises. (f)     Heritage is the wholly owned subsidiary of HST which is\n                        in turn a wholly owned subsidiary of HIT (g)     Both HIT and Heritage have at least one common\n                        director and authorised signatory in Bobby Andika. (h)     Agus Darjanto as a common director to\n                        both HIT and Heritage signed the guarantee and the Bareboat C/P on behalf of\n                        both parties. (i)     HIT took over possession and control of theMahakamin or about June 2009 when they provided their crew\n                        to take over theMahakamat Belawan, Indonesia\n                        from the crew supplied by the previous managers of\n                Heritage. 51     On the basis of the above matters, counsel for\n                    the plaintiff submitted that “Heritage and PT Humpus should properly be\n                    considered as a single economic unit with no corporate distinction between them,\n                    thus rendering each liable for the debts of the other.” 52     It seems to me that the plaintiff was\n                    effectively inviting the court to lift the corporate veil in order to show that\n                    HIT was in reality the charterers of theMahakamunder the Bareboat C/P. These same matters were also referred to in the\n                    affidavit filed by Fredrik Platou in support of the warrant of arrest. In the\n                    same affidavit, the plaintiff alleged that HIT is the alter ego of Heritage. In\n                    the light of these assertions, it would appear that the plaintiff was seeking to\n                    lift the corporate veil in order to show that HIT was in truth the charterers of\n                    theMahakam. On this basis, HIT prepared\n                    substantial submissions to respond to the plaintiff’s perceived attempt to\n                    lift the corporate veil. 53     However, on a plain reading of the indorsement\n                    in the writ of summons, it was clear that the plaintiff’s claim against\n                    HIT was solely based on the guarantee. There is no separate or alternative claim\n                    against HIT under the Bareboat C/P. Accordingly, at the commencement of the\n                    hearing, I sought clarification from the plaintiff’s counsel whether she\n                    was seeking to lift the corporate veil. She confirmed that the claim as indorsed\n                    in the writ of summons is based solely on the guarantee and that she was not\n                    attempting to lift the corporate veil in spite of the assertions in the\n                    affidavit in support of the warrant of arrest. 54     Implicit in the plaintiff’s confirmation\n                    is their acknowledgment that the materials which they were relying on do not\n                    justify the lifting of the corporate veil. It is plainly inconsistent and\n                    incongruous for the plaintiff to rely on the same materials to show that HIT was\n                    in possession or in control of theMahakamhaving\n                    accepted that Heritage was the bareboat charterers of theMahakamat all material times. As earlier observed, the\n                    plaintiff has commenced London arbitration proceedings against Heritage for the\n                    outstanding charterhire under the Bareboat C/P. 55     The establishment of one-ship companies within\n                    a group of companies is a well-known and legitimate practice in the shipping\n                    industry: seeThe Evpo Agnic[1988] 2\n                    Lloyd’s Rep 411 at 415 (“The Evpo\n                        Agnic”). There have been numerous unsuccessful attempts to\n                    lift the corporate veil in the context of one-ship companies with common\n                    shareholdings and/or directors: seeThe Evpo\n                    Agnic,The Maritime Trader,The Neptune[1986] HKLR 345,The Andres Bonifacio,The\n                        Interippu[1990] SGHC 131 (“The\n                        Interippu”) andThe Skaw\n                        Prince[1994] 3 SLR 379. The court may be minded to\n                    lift the corporate veil if there are exceptional circumstances which indicate\n                    the presence of a façade or sham set up to deceive or to perpetrate a fraud: seeThe Aventicum,The Saudi\n                        Prince[1982] 2 Lloyd’s Rep 255 andWin Line (UK) Ltd v Masterpart (Singapore) Pte Ltd[2000]\n                    2 SLR 98 at 116-117. 56     None of the exceptional circumstances exist in\n                    the present case to warrant the piercing of the corporate veil. No allegation of\n                    fraud was raised by the plaintiff. That explains why the plaintiff did not\n                    attempt to lift the corporate veil. After all, the plaintiff chose and agreed to\n                    enter into the Bareboat C/P with Heritage with full knowledge that Heritage is\n                    related to HIT. In fact, the plaintiff accepted the guarantee from HIT on that\n                    basis.",
        "Person “in possession or in control” of the\n                vessel": "57     Section 4(4)(b)\n                    of the HCAJA refers to 3 different entities: (a)owner;(b)charterer; and(c)person in possession or in control58     These different entities concern parties with\n                    substantive as opposed to nominal or formal interest in relation to the ship:\n                    seeThe Ohm Mariana[1993] 2 SLR 698 at\n                    710 (“The Ohm\n                Mariana”).59     Under Singapore law, an owner refers to the\n                    beneficial owner who is vested with the right of sale: seeThe Ohm Mariana. It is not restricted only to the registered\n                    owners as was found to be the case inThe Evpo\n                        Agnic. Charterer would include voyage, time, demise or even slot\n                    charterers. Each of these charterers would have legally enforceable rights in\n                    relation to the employment of the ship. By the same token, a named charterer\n                    under a sham charterparty is not a charterer within the meaning of\n                        s 4(4)(b) of the HCAJA as the sham\n                    charterparty does not give rise to any legally enforceable rightsquacharterer: seeThe Inai\n                        Selasih.60     Similarly as rightly observed by Chao JC\n                    (as he then was) inThe Interippu, the term\n                    “in possession or in control” must mean possession or control\n                    “as an independent legal right”. Chao JC stated that:I am afraid there is hardly any evidence to show that Corporate Shipping\n                        were in possession or control of “Engineer 103”. The fact that\n                        H H Wong was managing “Engineer 103” does not necessarily mean\n                        that Corporate Shipping were therefore in control or possession of\n                        “Engineer 103”. After all, H H Wong was at the relevant time a\n                        director of both companies, one being the holding company and the other a\n                        subsidiary company. Something more than just a common shareholding or\n                        manager/director is required to sustain a claim of “possession or\n                        control”, otherwise, it would sweep aside the entire concept of\n                        corporate structures and entities. I am inclined to accept the submission of\n                        the Defendants that the term “in possession or in control” in\n                        section 4(4) must mean possession or control as an independent legal right;\n                        or at least the possession or control must be pursuant to a specific\n                        arrangement.61     It does not refer to physical possession or\n                    controlper se. Such a person would include a\n                    demise charterer (seeThe Span Terza[1982]\n                    1 Lloyd’s Rep 225 at 227), a salvor in possession (seeThe Evpo Agnicat 414), a purchaser under a\n                    conditional sale agreement (seeThe Permina 3001[1977] 1 MLJ 141 at 144), and a person who is in a position of a\n                    demise charterer albeit not under a demise charter (seeThe\n                        Evpo Agnicat 414). It would also cover a mortgagee in possession\n                    who has taken over the vessel following the default of the mortgagor. The common\n                    denominator is that each of them has legally enforceable rights as regards\n                    possession or control of the vessel.62     The matters relied on are largely material in\n                    relation to an attempt to lift the corporate veil which the plaintiff conceded\n                    they were not seeking to do. In any event, none of them either singly or\n                    collectively would justify the veil to be pierced. Based on the evidence before\n                    me, Heritage has substantial assets in excess of US$30m. It maintains its own\n                    bank accounts with Bank Negara Indonesia, CMIB Bank and BNP Paribas. The fact\n                    that it does not maintain its own employees is not remarkable in itself. It is\n                    not uncommon for wholly owned subsidiaries to share and use office premises and\n                    employees with their parents or the ultimate holding company. The plaintiff also\n                    referred to various emails to suggest that HIT had paid the ship management fees\n                    for theMahakamand had arranged to pay various\n                    expenses on behalf of Heritage. However, the evidence suggest otherwise. While\n                    HIT may have been involved in the payment process, the evidence indicate that\n                    the payments were made from Heritage’s bank accounts.63     Even if HIT has control over Heritage directly\n                    or through HST, it is strictly irrelevant for the present purposes since it is a\n                    fundamental principle of company law that a shareholder has no property, legal\n                    or equitable, in the assets of the company: seeThe Maritime\n                        Traderat 157 andThe Interippuat\n                    6. Furthermore, having control over Heritage does not translate into\n                    “possession or control” over theMahakam.64     The plaintiff also relied on the Ship\n                    Management Agreement dated 14 December 2007 under which HIT was appointed\n                    by Heritage to manage theMahakam. In July 2008,\n                    Heritage appointed an independent company, Seaquestsandigan Pte Ltd\n                    (“Seaquestsandigan”) to take over the management of the vessel\n                    from HIT. Accordingly, HIT were not even the ship managers of the vessel in\n                    April 2009 when the cause of action accrued. The plaintiff alleged that\n                    Seaquestsandigan’s appointment was limited only to the technical and\n                    crewing responsibilities and that all other management duties remained with HIT.\n                    Even accepting the plaintiff’s submission, the management of theMahakampursuant to an appointment by Heritage does not\n                    vest any legally enforceable rights on HIT as regards possession or control over\n                    theMahakam. It would be wrong to treat ship\n                    managers as being “in possession or in control” of a vessel. Their\n                    responsibilities over the vessel arise by reason of their appointment by the\n                    principal. If the managers should exercise any rights of control or possession\n                    over the vessel, it would be on behalf of their principal and not as an\n                    independent legal right. The appointment can be terminated by the principal just\n                    as in this case when Heritage appointed Seaquestsandigan to take over from HIT\n                    in July 2008.65     Further, the plaintiff submitted that the\n                    supply of crew by HIT for theMahakamat Belawan,\n                    Indonesia in June 2009 amounted to taking possession or control over the vessel.\n                    According to the affidavit of Capt Thanabalasingam s/o Balakrishnan, the crew\n                    was supplied by HIT following his request on behalf of Heritage after\n                    Seaquestsandigan removed their crew from theMahakamupon the termination of their ship management agreement.\n                    The supply of crew was therefore not to enable HIT to take over physical\n                    possession or control of theMahakamfrom\n                    Seaquestsandigan or even Heritage, but rather to enable the vessel to be manned\n                    at the request of Heritage after Seaquestsandigan removed their\n                crew.66     The plaintiff also relied on the decision of\n                    the Federal Court of Australia inMalaysia Shipyard and\n                        Engineering Sdn Bhd v Iron Shortland[1995] FCA 1565\n                        (“Iron Shortland”). In that case\n                    the claimant sought and succeeded in lifting the corporate veil to show that the\n                    parent company, Capeco Maritime NV (“Capeco Maritime”) was the\n                    beneficial owner of the two vessels,Iron\n                        ShortlandandNewcastle Prideeven\n                    though they were registered in the names of their wholly owned subsidiaries. The\n                    finding was based on the evidence presented by the claimant. Having found that\n                    Capeco Maritime was the beneficial owner of the vessel, the court observed that\n                    the “evidence at least establishes that Capeco Maritime was in possession\n                    or control of theNewcastle Pride”. The\n                    facts are therefore entirely different from the present case. First, the\n                    plaintiff concedes that they are not seeking to lift the corporate veil. In any\n                    event, the lifting of the corporate veil in theIron\n                        Shortlandwas based on the specific evidence presented in that\n                    case. Secondly, as Capeco Maritime was found to be the beneficial owner of the\n                    vessel,a fortiorithey would be in possession or\n                    in control of the vessel.67     Finally, the plaintiff also relied onThe Fua Kavenga. Any inquiry as to whether a\n                    person was “in possession or in control” of a vessel is primarily\n                    a question of fact taking into account the applicable legal principles. As such,\n                    the mere fact that a person who had provided a guarantee was found to be\n                    “in possession or in control” of a vessel in one case does not\n                    mean that all guarantors would likewise be treated in the same way. Each case\n                    must necessarily be decided on its own facts.The Fua\n                        Kavengadoes not provide any useful guidance on this issue. In\n                    fact, counsel for the plaintiff accepted that this issue was not properly\n                    considered. The court appeared to have accepted that the guarantor inThe Fua Kavengawas “in possession or in\n                    control” of the vessel because the chartererers were “in a variety\n                    of ways the agent or alter ego of the (guarantor)”: at 567. Furthermore,\n                    Smellie J also referred to the submission by counsel on the lifting of the\n                    corporate veil without any indication whether the veil would be lifted on the\n                    evidence before him. Given that there was no analysis as to why the guarantor\n                    was determined to be a person “in possession or in control” of the\n                    vessel and since there is no issue for the lifting of the corporate veil in the\n                    instant case unlikeThe Fua Kavenga, with respect,\n                    I do not find the decision to be instructive.Conclusion68     I therefore hold that the plaintiff has failed\n                    to satisfy me on the two jurisdictional issues raised by HIT. Failure to satisfy\n                    either would be fatal. In the result, the admiralty jurisdiction of the High\n                    Court was improperly invoked against HIT’s vessel,Catur Samudra. Accordingly, it is axiomatic that the writ of\n                    summons and the warrant of arrest must be set aside which I so ordered on\n                    21 December 2009. HIT is awarded costs of the action as well as the\n                    application to be taxed if not agreed.69     HIT has a remaining prayer for damages for\n                    wrongful arrest. When I delivered my oral judgment, I provisionally indicated\n                    subject to full arguments from both parties that this was perhaps not an\n                    appropriate case for damages to be awarded. I, however, adjourned the prayer\n                    with liberty to HIT to restore it for hearing before me within 14 days from the\n                    date of the oral decision. 14 days have since elapsed and HIT has elected not to\n                    proceed with the claim for wrongful arrest.",
        "Conclusion": "68     I therefore hold that the plaintiff has failed\n                    to satisfy me on the two jurisdictional issues raised by HIT. Failure to satisfy\n                    either would be fatal. In the result, the admiralty jurisdiction of the High\n                    Court was improperly invoked against HIT’s vessel,Catur Samudra. Accordingly, it is axiomatic that the writ of\n                    summons and the warrant of arrest must be set aside which I so ordered on\n                    21 December 2009. HIT is awarded costs of the action as well as the\n                    application to be taxed if not agreed. 69     HIT has a remaining prayer for damages for\n                    wrongful arrest. When I delivered my oral judgment, I provisionally indicated\n                    subject to full arguments from both parties that this was perhaps not an\n                    appropriate case for damages to be awarded. I, however, adjourned the prayer\n                    with liberty to HIT to restore it for hearing before me within 14 days from the\n                    date of the oral decision. 14 days have since elapsed and HIT has elected not to\n                    proceed with the claim for wrongful arrest."
    }
}