{
    "case_title": "AHJ\n      v\n      AHK",
    "ncitation": "[2010] SGHC 148",
    "coram": "Tay Yong Kwang J",
    "sections": {
        "Introduction": "1       The parties were married on 7 June 2000. Their marriage was dissolved by the Family Court some seven years later on 30 October 2007 on the ground of unreasonable behaviour on the part of both parties. As the net value of the matrimonial assets was declared to be above $1.5 million, the ancillary matters were transferred to the High Court for hearing. 2       I shall refer to the parties individually as “the husband” and “the wife”. The husband is 52 years old while the wife is 34 years old. The parties have one son who is four years old. The husband is a retired helicopter pilot, formerly serving in the Republic of Singapore Air Force (“RSAF”). The wife is a Major in the Ministry of Defence (“MINDEF”) at Bukit Gombak. 3       The marriage was apparently not a happy one and the unhappiness unfortunately spilled over to the divorce proceedings, resulting in highly contentious litigation. The ancillary matters placed before me for determination were: (a)custody, care and control of the son;(b)maintenance for the wife;(c)maintenance for the son;(d)division of the matrimonial home and other assets.Five affidavits were filed by each of the parties relating to the above issues.Custody, care and control of the son4       On 16 July 2008, Tan Lee Meng J made an interim order on appeal from the Family Court whereby the husband would have interim care and control of the son from 10am on Fridays to 8pm on Sundays each week while the wife would have care and control at all other times. The husband was directed to pick up the son at the wife’s mother’s residence and return him to the same place. This arrangement continued until the hearing before me.5       Before me, the husband asked that joint custody be ordered, with care and control given to him and reasonable access given to the wife. This was because he is now retired while his wife has to abide by regular office hours in her full time work. He is therefore able to care for the son during the day. He retired with the intention of spending time with the son in his early growing up years. He claimed that the wife was vengeful and obstructive where access was concerned since the time he served the divorce documents on her and she packed up and left with the son to live in her mother’s home. He had to apply to court to gain access and even then, his wife committed contempt of court by breaching the orders. She has also refused to disclose the address of the son’s pre-school centre resulting in the husband being unable to bring the son there during his access period on Fridays.6       The wife asked that she be given sole custody, care and control of the son. She initially proposed that the husband be given supervised access every Saturday from 9.30am to 12.30pm at the Family Service Centre but modified it to reasonable access. She claimed that she was left alone to fend for herself and the son while the husband was on overseas deployment for about two years when he was working. However, this was refuted by the husband who affirmed that he had not been posted overseas from the time the son was born in January 2006. The wife said that her employer, MINDEF, accords her flexible working hours so that she is able to pick up the son from the pre-school centre at about 11am and send him to her mother’s home nearby in the Jurong public housing estate. Her parents would then take care of the son while she returns to work until sometime past 6pm. She did not want the son’s education and his Sunday school in church to be disrupted by the care and control arrangements. The husband admitted that he did not rule out returning to the workforce sometime in the future. The wife submitted that when he does so, there is a high possibility that he will place the son in a different household.7       Bearing in mind that the son is only four years old, it will be in his interest to have the care and influence of both parents as much as possible. Both parties love the son and both want him. The husband now lives alone in the former matrimonial home, a private apartment at 33 Jalan Rama Rama (“De Royale apartment”). The wife lives in a four-room Housing and Development Board flat with her parents. There is no indication that one or the other party is a much better parent or that one home environment is much more conducive for the son’s development than the other. The only logical solution is to let the parties have more or less equal time with the son so that he can benefit from the love of both, while ensuring that his attendance at the pre-school centre is not disrupted.8       I therefore decided that there should be joint custody and that the son should be in the shared care and control of each party in the following manner. He is to be with the wife from Saturday 8pm to Wednesday 11.30am and to be with the husband from Wednesday 11.30am to Saturday 8pm. The husband is to pick up the son from the wife’s parents’ residence on Wednesday at 11.30am and to send him back there on Saturday at 8pm. The wife is to provide the name and address of the pre-school centre to the husband forthwith. Either party may bring the son overseas during the individual periods of access so long as notice is given to the other party at least seven days before any trip. The wife is presently holding the son’s passport.9       In my view, this arrangement will give each party about equal time with the son both on weekdays as well as weekends. The son will also be able to continue attending Sunday school with the wife.Maintenance for the wife10     The husband submitted that the issue of maintenance for the wife had already been examined before the Family Court in MSS 53121 of 2007. That court, after a three-day trial, decided in December 2008 that the wife would receive no maintenance from the husband despite her claim for $6,500 monthly for herself and the son. At the time of the wife’s application in October 2007, she held the rank of Captain earning about $4,500 per month. Despite her claim of having resigned from her job, it transpired later that she did not and was actually promoted to Major earning more than $6,000 per month. She has since also graduated from the Singapore Institute of Management where she pursued her tertiary education, thereby increasing the prospects of further advancement in her career.11     The husband used to earn about $12,000 per month as a helicopter pilot. That was reduced to $7,500 when he retired as a pilot to become an instructor. He retired from work completely since March 2007 while the wife is now in the prime years of her career. The husband did not have to maintain the wife during the subsistence of the marriage as she was capable of supporting herself financially.12     The wife asserted that the husband “blatantly refuses to work, not that he is completely retired”. He also received a gratuity of some $600,000 from MINDEF. This information had to be forced out of him by an order of court. The husband is also receiving rental income from his 1,000 sq ft apartment at 1 St Martin’s Drive (“St Martin’s apartment”). The wife is now earning more than $6,000 per month. Her monthly expenses would be about $7,600. This included $3,000 for rental of accommodation and a monthly average of $661.70 for her tertiary education fees. The husband is having the luxury of living in a condominium while she and the son had “to seek refuge at her parents’ HDB flat after the husband locked us out of De Royale”. Besides, she is still helping with the loan repayments for De Royale apartment through her Central Provident Fund (“CPF”) contributions. She argued that she and the son should have an equally comfortable place to call home as they were accustomed to living in a private apartment with full facilities. She asked for maintenance of $6,500 per month (for herself and the son) and for the rental of $3,000 per month to be backdated to July 2007.13     The wife, to her credit, has been quite capable of maintaining herself without any difficulty. She has also been taking steps to advance herself in her career in MINDEF and is now a Major and a graduate. The increase in rank must have been matched by a corresponding increase in her salary. Her prospects are now even better with her tertiary education. She has managed very well with the fees for her tertiary education and this item of expenditure is no longer applicable since she has already graduated. She has chosen to reside with her parents and not rent her own apartment for good reason – she needs her parents to take care of the son while she is away at work. I therefore decided there was no need to order the husband to pay any maintenance to the wife.Maintenance for the son14     The wife claimed that the son’s monthly expenses amounted to $2,845.66. This comprised $428.50 for pre-school, $132.56 for enrichment classes, $300 for food, $139.20 for milk, $121.40 for diapers, $150 for clothes (including school uniform), shoes and toiletries, $100 for books, toys, educational tools and stationery, $441 for transport by taxi to and from pre-school, $250 for insurance, $83 for outings and trips, $300 for medical expenses and $400 for caregiver services. She wanted the husband to be ordered to bear 70% of the son’s monthly expenses (about $1,991 per month).15     The son should not need diapers any more. The wife brings the son to pre-school on her way to work. The pre-school is in the vicinity of her parents’ home. There is really no need for her to rush from office in mid-morning to bring the son home from pre-school since her parents are available to help. There is therefore no need to incur any travel expenses for the son’s pre-school. There is no indication of any special medical need for the son requiring an expenditure of $300 per month. It was also unclear what caregiver services entailed in her context.16     Bearing in mind my orders as to custody, care and control of the son, his needs and the parties’ respective means, I decided that all pre-school fees, school uniform and other incidental expenses such as books are to be borne equally by the parties. In addition, the husband is to contribute $350 per month as maintenance for the son with effect from 1 March 2010. With this arrangement, this amount of maintenance should be sufficient to take care of a four year old boy. As he grows and his needs increase or change with time, the wife may apply to court to justify an appropriate increase in the amount.Division of the matrimonial home and other assets17     The matrimonial home was the De Royale apartment with a floor area of 1,281 sq ft. This was bought in 2006 for $812,000. It is now worth $1.2 million, with an outstanding mortgage of $650,000, thereby giving it a net value of $550,000. Before this, the parties lived in an apartment in Hillside condominium which was bought by the husband for $848,240 in 1997, three years before the marriage. It became their first matrimonial home in 2000 and they lived in it until 2006. It was sold in June 2007 for $638,000, about the time the divorce proceedings were commenced. Although the husband received about $75,000 in cash from the sale, it was a net loss of $210,000 because of the instalments paid over the years. The rental income was insufficient to service the loan. The wife made no contribution towards this Hillside property. The wife disputed this, submitting that she had paid for renovation works and made contributions by fund transfers from her bank account to the husband’s bank account.18     After the wife and the son left the matrimonial home in June 2007, the husband continued to reside there alone. The husband claimed direct financial contribution (through his CPF account and by way of cash) amounting to73% and asserted that the wife’s direct financial contribution (through her CPF account) was only 27%. The husband asserted that he was the main breadwinner of the family and paid for most of the household expenses during the subsistence of the marriage. However, the wife also claimed to have borne the bulk of these expenses.19     The parties’ first child was still-born in January 2004. When the son was born in January 2006, their marriage began to have problems. The husband decided to go into full retirement in March 2007 in order to spend more time with the son. This was a point of contention with the wife and it eventually led to the divorce for which proceedings were commenced in June 2007. Since both parties worked throughout the marriage, the husband submitted that, given the unique circumstances of this case, neither party should be accorded any additional share of the matrimonial home for indirect contribution to the marriage. Any indirect contribution by the wife in terms of caring for the son was for only about one and a half years before the breakdown of the marriage. She continued working after the birth of the son who was taken care of by the wife’s mother during the day. This, the husband argued, could be equated with his contribution as a hands-on father, acknowledged by the court in granting him split care and control from the very start of the proceedings. The husband was a full time father for about three months before divorce proceedings began. If any larger share of the matrimonial home was to be given because of indirect contributions, it was the husband who deserved more. Commenting on the wife’s original proposal that the De Royale apartment be sold in the open market and that 80% of the net proceeds be given to her with the husband receiving 20%, the husband submitted that giving the wife an additional 53% share because of her indirect contribution would not be an equitable division as it would not be in line with the parties’ respective contributions to the marriage.20     The St Martin’s apartment was purchased at $465,000 by the husband in 1993, about seven years before the parties got married in 2000. The loan was serviced by the rental collected. The outstanding amount is about $150,000. It is now worth about $1.5 million. The wife’s claim was only for indirect contributions to this property, in particular, taking care of it and securing a tenant while the husband was on overseas assignment for about three years. The husband disputed this, saying that he had given a power of attorney to his sister to deal with the property in his absence. The husband acknowledged that it was within the pool of matrimonial properties for division but submitted that the wife’s indirect contributions were really miniscule and that she should therefore not be given any share of this property.21     The parties also have various other assets in their individual names, such as two cars, insurance policies and bank accounts. The husband submitted that all these be retained by the respective parties given that the marriage was relatively short in duration during which both parties earned their own incomes and acquired their own assets. One of the two cars (a Volkswagen GT registered as an Off Peak Car in August 2007) was sold in February 2008 at a loss of $18,500.22     The wife claimed that the De Royale apartment would be worth about $1.32m going by the transactions in that development. She made direct financial contributions towards the purchase price through her CPF account and by way of cash. She also made indirect contributions by engaging a part-time maid and managing the home while the husband was on overseas assignment for two years and on his frequent trips abroad.23     The wife submitted that the St Martin’s apartment should be worth around $1,603,800 as that was the highest transacted price for a similar unit in the development.24     Based on her direct and indirect contributions towards all the matrimonial assets, her care for the husband’s parents when he was overseas and her sacrifice in giving up her studies for the family, she argued that the two matrimonial properties should be sold and she be given 70% of the sale proceeds. She also wanted 70% of the sale proceeds of the Hillside property and of all other assets in the husband’s name. As for the assets in her name, she submitted that she should be entitled to keep them. She also asked for 50% of the funds in the husband’s CPF account.25     I proceeded on a broad brush approach to the matrimonial assets instead of attempting a detailed audit exercise. I considered that the wife required housing for herself and the son whom she has care and control of for roughly 50% of the time and that she took no maintenance from the husband during the marriage and is now not given any by the court. Naturally, the needs of the husband were also weighed in the balance.26     Taking an approximate valuation of the St Martin’s apartment at $1.5 million and deducting the outstanding loan of about $150,000, the net value of that property would be $1.35 million. Although the wife’s indirect contributions were hardly significant and the property was bought years before the marriage (and most probably before the husband even knew the wife as she would still be a teenager in 1993), I decided, in viewing everything from a broad perspective, that she ought to receive 20% of its net value.27     For the De Royale matrimonial home, I took the valuation of $1.2 million and deducted the outstanding loan of $650,000, arriving at a net value of $550,000. Out of this, I ordered that 45% be given to the wife.28     Since the Hillside property resulted in a net loss over the years and was purchased by the husband before the marriage, with no significant input from the wife, I decided not to make any order regarding it.29     The above orders on division were for liquidated amounts to be paid to the wife and were not meant to be orders for the sale of the properties. The husband was directed to pay the wife $50,000 within one week and to pay her the balance due within three months in order to give him time to raise the funds. The wife was directed to transfer her title in De Royale to the husband upon final payment of what is due to her.30     All other assets should remain the property of the respective parties. I saw no reason to accede to the wife’s request that she be given 50% of any funds in the husband’s CPF account. The husband at 52 is practically at the tail end of his working life even if he should decide to come out of retirement and resume work, whether on a full-time or a part-time basis. In contrast, the wife at 34 is now in the prime of her life and her career, with bright prospects ahead of her.31     As is usual in proceedings of this nature, I ordered each party to bear its own costs of the hearing before me although the husband wanted costs to be ordered against the wife for her alleged conduct in delaying proceedings by engaging in other hearings in the Family Court and thereby escalating costs for the hearing on the ancillary matters. The wife naturally disputed that she caused the delay.32     The wife now appeals to the Court of Appeal against the whole of my decision while the husband appeals against the order giving the wife a 20% share of the net value of the St Martin’s apartment.",
        "Custody, care and control of the son": "4       On 16 July 2008, Tan Lee Meng J made an interim order on appeal from the Family Court whereby the husband would have interim care and control of the son from 10am on Fridays to 8pm on Sundays each week while the wife would have care and control at all other times. The husband was directed to pick up the son at the wife’s mother’s residence and return him to the same place. This arrangement continued until the hearing before me. 5       Before me, the husband asked that joint custody be ordered, with care and control given to him and reasonable access given to the wife. This was because he is now retired while his wife has to abide by regular office hours in her full time work. He is therefore able to care for the son during the day. He retired with the intention of spending time with the son in his early growing up years. He claimed that the wife was vengeful and obstructive where access was concerned since the time he served the divorce documents on her and she packed up and left with the son to live in her mother’s home. He had to apply to court to gain access and even then, his wife committed contempt of court by breaching the orders. She has also refused to disclose the address of the son’s pre-school centre resulting in the husband being unable to bring the son there during his access period on Fridays. 6       The wife asked that she be given sole custody, care and control of the son. She initially proposed that the husband be given supervised access every Saturday from 9.30am to 12.30pm at the Family Service Centre but modified it to reasonable access. She claimed that she was left alone to fend for herself and the son while the husband was on overseas deployment for about two years when he was working. However, this was refuted by the husband who affirmed that he had not been posted overseas from the time the son was born in January 2006. The wife said that her employer, MINDEF, accords her flexible working hours so that she is able to pick up the son from the pre-school centre at about 11am and send him to her mother’s home nearby in the Jurong public housing estate. Her parents would then take care of the son while she returns to work until sometime past 6pm. She did not want the son’s education and his Sunday school in church to be disrupted by the care and control arrangements. The husband admitted that he did not rule out returning to the workforce sometime in the future. The wife submitted that when he does so, there is a high possibility that he will place the son in a different household. 7       Bearing in mind that the son is only four years old, it will be in his interest to have the care and influence of both parents as much as possible. Both parties love the son and both want him. The husband now lives alone in the former matrimonial home, a private apartment at 33 Jalan Rama Rama (“De Royale apartment”). The wife lives in a four-room Housing and Development Board flat with her parents. There is no indication that one or the other party is a much better parent or that one home environment is much more conducive for the son’s development than the other. The only logical solution is to let the parties have more or less equal time with the son so that he can benefit from the love of both, while ensuring that his attendance at the pre-school centre is not disrupted. 8       I therefore decided that there should be joint custody and that the son should be in the shared care and control of each party in the following manner. He is to be with the wife from Saturday 8pm to Wednesday 11.30am and to be with the husband from Wednesday 11.30am to Saturday 8pm. The husband is to pick up the son from the wife’s parents’ residence on Wednesday at 11.30am and to send him back there on Saturday at 8pm. The wife is to provide the name and address of the pre-school centre to the husband forthwith. Either party may bring the son overseas during the individual periods of access so long as notice is given to the other party at least seven days before any trip. The wife is presently holding the son’s passport. 9       In my view, this arrangement will give each party about equal time with the son both on weekdays as well as weekends. The son will also be able to continue attending Sunday school with the wife.",
        "Maintenance for the wife": "10     The husband submitted that the issue of maintenance for the wife had already been examined before the Family Court in MSS 53121 of 2007. That court, after a three-day trial, decided in December 2008 that the wife would receive no maintenance from the husband despite her claim for $6,500 monthly for herself and the son. At the time of the wife’s application in October 2007, she held the rank of Captain earning about $4,500 per month. Despite her claim of having resigned from her job, it transpired later that she did not and was actually promoted to Major earning more than $6,000 per month. She has since also graduated from the Singapore Institute of Management where she pursued her tertiary education, thereby increasing the prospects of further advancement in her career. 11     The husband used to earn about $12,000 per month as a helicopter pilot. That was reduced to $7,500 when he retired as a pilot to become an instructor. He retired from work completely since March 2007 while the wife is now in the prime years of her career. The husband did not have to maintain the wife during the subsistence of the marriage as she was capable of supporting herself financially. 12     The wife asserted that the husband “blatantly refuses to work, not that he is completely retired”. He also received a gratuity of some $600,000 from MINDEF. This information had to be forced out of him by an order of court. The husband is also receiving rental income from his 1,000 sq ft apartment at 1 St Martin’s Drive (“St Martin’s apartment”). The wife is now earning more than $6,000 per month. Her monthly expenses would be about $7,600. This included $3,000 for rental of accommodation and a monthly average of $661.70 for her tertiary education fees. The husband is having the luxury of living in a condominium while she and the son had “to seek refuge at her parents’ HDB flat after the husband locked us out of De Royale”. Besides, she is still helping with the loan repayments for De Royale apartment through her Central Provident Fund (“CPF”) contributions. She argued that she and the son should have an equally comfortable place to call home as they were accustomed to living in a private apartment with full facilities. She asked for maintenance of $6,500 per month (for herself and the son) and for the rental of $3,000 per month to be backdated to July 2007. 13     The wife, to her credit, has been quite capable of maintaining herself without any difficulty. She has also been taking steps to advance herself in her career in MINDEF and is now a Major and a graduate. The increase in rank must have been matched by a corresponding increase in her salary. Her prospects are now even better with her tertiary education. She has managed very well with the fees for her tertiary education and this item of expenditure is no longer applicable since she has already graduated. She has chosen to reside with her parents and not rent her own apartment for good reason – she needs her parents to take care of the son while she is away at work. I therefore decided there was no need to order the husband to pay any maintenance to the wife.",
        "Maintenance for the son": "14     The wife claimed that the son’s monthly expenses amounted to $2,845.66. This comprised $428.50 for pre-school, $132.56 for enrichment classes, $300 for food, $139.20 for milk, $121.40 for diapers, $150 for clothes (including school uniform), shoes and toiletries, $100 for books, toys, educational tools and stationery, $441 for transport by taxi to and from pre-school, $250 for insurance, $83 for outings and trips, $300 for medical expenses and $400 for caregiver services. She wanted the husband to be ordered to bear 70% of the son’s monthly expenses (about $1,991 per month). 15     The son should not need diapers any more. The wife brings the son to pre-school on her way to work. The pre-school is in the vicinity of her parents’ home. There is really no need for her to rush from office in mid-morning to bring the son home from pre-school since her parents are available to help. There is therefore no need to incur any travel expenses for the son’s pre-school. There is no indication of any special medical need for the son requiring an expenditure of $300 per month. It was also unclear what caregiver services entailed in her context. 16     Bearing in mind my orders as to custody, care and control of the son, his needs and the parties’ respective means, I decided that all pre-school fees, school uniform and other incidental expenses such as books are to be borne equally by the parties. In addition, the husband is to contribute $350 per month as maintenance for the son with effect from 1 March 2010. With this arrangement, this amount of maintenance should be sufficient to take care of a four year old boy. As he grows and his needs increase or change with time, the wife may apply to court to justify an appropriate increase in the amount.",
        "Division of the matrimonial home and other assets": "17     The matrimonial home was the De Royale apartment with a floor area of 1,281 sq ft. This was bought in 2006 for $812,000. It is now worth $1.2 million, with an outstanding mortgage of $650,000, thereby giving it a net value of $550,000. Before this, the parties lived in an apartment in Hillside condominium which was bought by the husband for $848,240 in 1997, three years before the marriage. It became their first matrimonial home in 2000 and they lived in it until 2006. It was sold in June 2007 for $638,000, about the time the divorce proceedings were commenced. Although the husband received about $75,000 in cash from the sale, it was a net loss of $210,000 because of the instalments paid over the years. The rental income was insufficient to service the loan. The wife made no contribution towards this Hillside property. The wife disputed this, submitting that she had paid for renovation works and made contributions by fund transfers from her bank account to the husband’s bank account. 18     After the wife and the son left the matrimonial home in June 2007, the husband continued to reside there alone. The husband claimed direct financial contribution (through his CPF account and by way of cash) amounting to73% and asserted that the wife’s direct financial contribution (through her CPF account) was only 27%. The husband asserted that he was the main breadwinner of the family and paid for most of the household expenses during the subsistence of the marriage. However, the wife also claimed to have borne the bulk of these expenses. 19     The parties’ first child was still-born in January 2004. When the son was born in January 2006, their marriage began to have problems. The husband decided to go into full retirement in March 2007 in order to spend more time with the son. This was a point of contention with the wife and it eventually led to the divorce for which proceedings were commenced in June 2007. Since both parties worked throughout the marriage, the husband submitted that, given the unique circumstances of this case, neither party should be accorded any additional share of the matrimonial home for indirect contribution to the marriage. Any indirect contribution by the wife in terms of caring for the son was for only about one and a half years before the breakdown of the marriage. She continued working after the birth of the son who was taken care of by the wife’s mother during the day. This, the husband argued, could be equated with his contribution as a hands-on father, acknowledged by the court in granting him split care and control from the very start of the proceedings. The husband was a full time father for about three months before divorce proceedings began. If any larger share of the matrimonial home was to be given because of indirect contributions, it was the husband who deserved more. Commenting on the wife’s original proposal that the De Royale apartment be sold in the open market and that 80% of the net proceeds be given to her with the husband receiving 20%, the husband submitted that giving the wife an additional 53% share because of her indirect contribution would not be an equitable division as it would not be in line with the parties’ respective contributions to the marriage. 20     The St Martin’s apartment was purchased at $465,000 by the husband in 1993, about seven years before the parties got married in 2000. The loan was serviced by the rental collected. The outstanding amount is about $150,000. It is now worth about $1.5 million. The wife’s claim was only for indirect contributions to this property, in particular, taking care of it and securing a tenant while the husband was on overseas assignment for about three years. The husband disputed this, saying that he had given a power of attorney to his sister to deal with the property in his absence. The husband acknowledged that it was within the pool of matrimonial properties for division but submitted that the wife’s indirect contributions were really miniscule and that she should therefore not be given any share of this property. 21     The parties also have various other assets in their individual names, such as two cars, insurance policies and bank accounts. The husband submitted that all these be retained by the respective parties given that the marriage was relatively short in duration during which both parties earned their own incomes and acquired their own assets. One of the two cars (a Volkswagen GT registered as an Off Peak Car in August 2007) was sold in February 2008 at a loss of $18,500. 22     The wife claimed that the De Royale apartment would be worth about $1.32m going by the transactions in that development. She made direct financial contributions towards the purchase price through her CPF account and by way of cash. She also made indirect contributions by engaging a part-time maid and managing the home while the husband was on overseas assignment for two years and on his frequent trips abroad. 23     The wife submitted that the St Martin’s apartment should be worth around $1,603,800 as that was the highest transacted price for a similar unit in the development. 24     Based on her direct and indirect contributions towards all the matrimonial assets, her care for the husband’s parents when he was overseas and her sacrifice in giving up her studies for the family, she argued that the two matrimonial properties should be sold and she be given 70% of the sale proceeds. She also wanted 70% of the sale proceeds of the Hillside property and of all other assets in the husband’s name. As for the assets in her name, she submitted that she should be entitled to keep them. She also asked for 50% of the funds in the husband’s CPF account. 25     I proceeded on a broad brush approach to the matrimonial assets instead of attempting a detailed audit exercise. I considered that the wife required housing for herself and the son whom she has care and control of for roughly 50% of the time and that she took no maintenance from the husband during the marriage and is now not given any by the court. Naturally, the needs of the husband were also weighed in the balance. 26     Taking an approximate valuation of the St Martin’s apartment at $1.5 million and deducting the outstanding loan of about $150,000, the net value of that property would be $1.35 million. Although the wife’s indirect contributions were hardly significant and the property was bought years before the marriage (and most probably before the husband even knew the wife as she would still be a teenager in 1993), I decided, in viewing everything from a broad perspective, that she ought to receive 20% of its net value. 27     For the De Royale matrimonial home, I took the valuation of $1.2 million and deducted the outstanding loan of $650,000, arriving at a net value of $550,000. Out of this, I ordered that 45% be given to the wife. 28     Since the Hillside property resulted in a net loss over the years and was purchased by the husband before the marriage, with no significant input from the wife, I decided not to make any order regarding it. 29     The above orders on division were for liquidated amounts to be paid to the wife and were not meant to be orders for the sale of the properties. The husband was directed to pay the wife $50,000 within one week and to pay her the balance due within three months in order to give him time to raise the funds. The wife was directed to transfer her title in De Royale to the husband upon final payment of what is due to her. 30     All other assets should remain the property of the respective parties. I saw no reason to accede to the wife’s request that she be given 50% of any funds in the husband’s CPF account. The husband at 52 is practically at the tail end of his working life even if he should decide to come out of retirement and resume work, whether on a full-time or a part-time basis. In contrast, the wife at 34 is now in the prime of her life and her career, with bright prospects ahead of her. 31     As is usual in proceedings of this nature, I ordered each party to bear its own costs of the hearing before me although the husband wanted costs to be ordered against the wife for her alleged conduct in delaying proceedings by engaging in other hearings in the Family Court and thereby escalating costs for the hearing on the ancillary matters. The wife naturally disputed that she caused the delay. 32     The wife now appeals to the Court of Appeal against the whole of my decision while the husband appeals against the order giving the wife a 20% share of the net value of the St Martin’s apartment."
    }
}