{
    "case_title": "Pacific King Shipping Pte Ltd and another\n      v\n      Glory Wealth Shipping Pte Ltd",
    "ncitation": "[2010] SGHC 173",
    "coram": "Philip Pillai J",
    "sections": {
        "Introduction": "1       The plaintiffs have filed this originating\n                    summons for an order that winding up petitions, CWU 168 of 2009 and\n                    CWU 169 of 2009, brought by the defendant against the first and second\n                    plaintiffs respectively be stayed or struck out. 2       On or about 26 October 2007, the first\n                    plaintiff chartered a vessel from the defendant. Pursuant to a guarantee dated\n                    12 October 2007, the second plaintiff stood as the first plaintiff’s\n                    guarantor against the first plaintiff’s obligations to the defendant. On\n                    12 August 2009, the defendant sent the plaintiffs statutory notices of\n                    demand for a sum of US$3,986,157.16 as the outstanding sum owing as charter hire\n                    under a charter agreement. US$1,326,625.04 of this demand represented an\n                    arbitration award issued by the London Tribunal dated 18 December 2008\n                    (then entitled “Interim” but which is now final in its effect)\n                    (the “Award”). The first plaintiff has paid US$350,000 of the\n                    arbitration award debt under a settlement agreement that has expired and to date\n                    US$976,625.04 remains due and outstanding. When the plaintiffs failed to respond\n                    satisfactorily to the defendant after three weeks, the defendant proceeded to\n                    file winding up petitions CWU 168 of 2009 and CWU 169 of 2009 pursuant\n                    to s 254(2)(a) read with\n                        s 254(1)(e) of the Companies Act\n                    (Cap 50, 2006 Rev Ed) (“Companies Act”). 3       The plaintiffs aver that the winding up\n                    petitions are an abuse of process because there is abona\n                        fidedispute on substantial grounds. The grounds as submitted by\n                    the plaintiffs are as follows: (a)The Award is not enforceable against the first\n                            plaintiff save by recognition or enforcement under the International\n                            Arbitration Act (Cap 143A, 2002 Rev Ed) (“IAA”).\n                            The interim award would not have been recognised or enforced under the\n                            IAA because it contravenes s 31(2)(c)\n                            of the IAA in that it was obtained in circumstances where the first\n                            plaintiff was denied an opportunity to and was thereby unable to present\n                            its case. I shall refer to these as the “IAA\n                            issue”.(b)The first plaintiff has a cross-claim equal to or\n                            exceeding the debt allegedly due under the Award. I shall refer to this\n                            as the “Cross-claim issue”.(c)The Award is unenforceable against the second\n                            plaintiff as it is against the first plaintiff and in any case the\n                            guarantor is not bound by the Award. I shall refer to the last as the\n                            “Guarantor’s Liability issue”.Threshold Issue4       A winding up petition is not the appropriate\n                    means of collecting a disputed debt nor is it to be abused as a means of\n                    pressure. The issue before me is whether there is abona\n                        fideand substantial dispute of the alleged debt on any of the\n                    grounds raised by the plaintiffs. This is the threshold which the plaintiffs\n                    must meet in support of their application to stay or strike out the winding up\n                    petitions.Whether there is abona fideand\n                substantial dispute over the debt5       InBNP Paribas v Jurong\n                        Shipyard Pte Ltd[2009] 2 SLR(R) 949 at [15], the Court\n                    of Appeal held that the “general rule is that, where a company is unable\n                    or deemed to be unable to pay its debts, the creditor isprima facieentitled to a winding-up orderex\n                        debito justitiae”. However, the court nonetheless retains\n                    the discretion not to grant a winding up order in exceptional cases. One\n                    instance when a court may refuse to grant a winding up order, but may instead\n                    stay or strike out the winding up petition, is where the debtor-company\n                    establishes that there is abona fidedispute of\n                    the statutory debt. To obtain the stay or striking out, the debtor company must\n                    show that the dispute isbona fidein both a\n                    subjective and objective sense.Palmer’s Company\n                        Lawvol 3 at pp 15068-15069, as quoted approvingly inLKM Investment Holdings Pte Ltd v Cathay Theatres Pte\n                        Ltd[2000] 1 SLR(R) 135 at [20], elucidates:… the dispute must be bona fide in both a subjective and an\n                        objective sense. Thus the reason for not paying the debt must be honestly\n                        believed to exist and must be based on substantial or reasonable grounds.\n                        'Substantial' means having substance and not frivolous, which disputes the\n                        court should ignore. There must be so much doubt and question about the\n                        liability to pay the debt that the court sees that there is a question to be\n                        decided. The onus is on the company 'to bring forward a prima facie case\n                        which satisfies the court that there is something which ought to be tried\n                        either before the court itself or in an action, or by some other\n                        proceedings.'Nonetheless, the debtor-company does not need to show that the debt\n                    does not exist – it merely needs to raise a triable issue. InPacific Recreation Pte Ltd v S Y Technology Inc and another\n                        appeal[2008] 2 SLR(R) 491 at [23], the Court of Appeal\n                    held that the applicable standard for determining the existence of a substantial\n                    andbona fidedispute was “no more than\n                    that for resisting a summary judgment application”.6       With the applicable principles in mind, I now\n                    turn to examining the IAA issue, the Cross-claim issue and the Guarantor’s\n                    Liability issue respectively.The IAA issue7       The plaintiffs dispute the debt that is founded\n                    on the interim arbitration award as being improperly obtained by reason of the\n                    alleged failure to observe the rules of natural justice. The defendant, in\n                    response, points out that the regularity of the award had been unchallenged at\n                    the arbitration and at the courts of the seat of the arbitration. The defendant\n                    cited the following authorities:(a)Minmetals Germany GmbH v Ferco\n                                Steel Ltd[1999] CLC 647 at 661where it was\n                            stated that:In international commerce a party who contracts into an agreement to\n                        arbitrate in a foreign jurisdiction is bound not only by the local\n                        arbitration procedure but also by the supervisory jurisdiction of the courts\n                        of the seat of the arbitration. If the award is defective or the arbitration\n                        is defectively conducted the party who complains of the defect must in the\n                        first instance pursue such remedies as exist under that supervisory\n                        jurisdiction. That is because by his agreement to the place in question as\n                        the seat of the arbitration he has agreed not only to refer all disputes to\n                        arbitration but that the conduct of the arbitration should be subject to\n                        that particular supervisory jurisdiction. Adherence to that part of the\n                        agreement must, in my judgment, be a cardinal policy consideration by an\n                        English court considering enforcement of a foreign award.(b)Aloe Vera of America, Inc v\n                                Asianic Food (S) Pte Ltd and another[2006]\n                            3 SLR(R) 174 where it was stated at [56]:… a party may be precluded by his failure to raise a point before\n                        the court of supervisory jurisdiction from raising that point before the\n                        court of enforcement. This is because failure to raise such a point may\n                        amount to an estoppel or a want of bona fides such as to justify the court\n                        of enforcement in enforcing an award.and further at [76]:There was nothing thereafter to stop him from challenging the\n                        Arbitrator’s preliminary holding in the courts of Arizona or from\n                        taking part in the arbitration itself or from challenging the\n                        Arbitrator’s final holding in the courts of Arizona. Having chosen not\n                        to participate in the proceedings, it really does not lie in\n                        Mr Chiew’s mouth to say that he has been deprived of natural\n                        justice because the Arbitrator made one finding in his interim award and\n                        supplemented that with an additional finding in the final award.\n                        Mr Chiew had the benefit of legal advice in Arizona at all material\n                        times and his decision not to have recourse to the supervisory court was a\n                        calculated one. If his choice has proved to be a miscalculation, public\n                        policy does not require that I relieve him from the consequences of such\n                        miscalculation.8       The law set out in the above cases is\n                    uncontroversial. However, the above cases deal with the position of a challenge\n                    of the arbitration awards made before the enforcement court, where the relevant\n                    awards are alleged to be defective but had been unchallenged at the arbitration\n                    or at the courts in the seat of arbitration. They do not address the issue that\n                    is before me here, which is not a proceeding for the enforcement of an\n                    arbitration award under the IAA, but a winding up application. The defendant in\n                    this case, has issued a statutory demand of a debt under s 254(2)(a) read with s 254(1)(e) of the Companies Act, the debt having arisen by reason of a\n                    final international arbitration award. While the plaintiffs alleged that this\n                    Award is defective, it was unchallenged in the arbitration forum and before the\n                    courts of the seat of arbitration. The Award therefore remains effective on the\n                    face of it.9       The real question before me is whether the\n                    defendant is precluded from issuing a statutory demand under\n                        s 254(2)(a) read with\n                        s 254(1)(e) of the Companies Act based on\n                    a debt that is founded on an arbitration award because such an award can only\n                    and exclusively be enforced under the IAA.10     The plaintiffs assert that the defendant is\n                    obliged to enforce the Award under s 27(2) of the IAA. They argue that had\n                    the defendant sought to enforce its arbitration award in Singapore under the\n                    IAA, this would have been resisted pursuant to s 31(2)(c) of the IAA on the ground that the rules of natural justice\n                    were not adhered to in obtaining that award (seeKanoria v\n                        Guinness[2006] EWCA Civ 222). In any case, to permit\n                    the defendant to rely on its statutory demand debt founded on the Award which\n                    was not enforced under the IAA, would be, they argue, in effect enforcing the\n                    interim award under s 27(2) of the IAA. As such the enforcement remains\n                    susceptible to the challenge of alleged breach of natural justice which would be\n                    available under s 31(2)(c) of the IAA and there\n                    therefore exists aprima facie bona fidedispute\n                    of the debt on substantial grounds. The plaintiffs further attack the validity\n                    of the interim award on the ground that the tribunal issued the award on a basis\n                    which had not been raised or contemplated by the parties (seePacific Recreation Pte Ltd v S Y Technology Inc and another[2008] 2 SLR(R) 491 at [30]). Against this, the defendant argues that\n                    it is free to elect either to enforce the Award in Singapore under the IAA or to\n                    use the debt arising therefrom as the foundation of its statutory demand for the\n                    purposes of a winding up petition.11     Section 27(2) of the IAA reads:In this Part, where the context so admits, “enforcement” in\n                        relation to a foreign award, includes the recognition of the award as\n                        binding for any purpose, and “enforce” and\n                        “enforced” have corresponding meanings.I am unable to accept the plaintiffs’ argument that the\n                    defendant must enforce the Award under this provision of the IAA before it can\n                    bring the winding up proceedings against the plaintiffs. No authority is cited\n                    to me for the proposition that a successful party of a foreign arbitration award\n                    is obliged and confined to enforce the award only by way of enforcement\n                    proceedings under the IAA and is thereby precluded from issuing a statutory\n                    demand based on a foreign arbitration award followed, if unsatisfied, by a\n                    winding up application on grounds of a presumption of insolvency.12     Furthermore, the IAA was by the terms of its\n                    Preamble, enacted to make provision for the conduct of international commercial\n                    arbitrations based on the UNCITRAL Model Law and to give effect to the New York\n                    Convention on the Recognition and Enforcement of Foreign Arbitral Awards\n                    (“New York Convention”). Part III of the IAA governs foreign\n                    awards under the New York Convention of 1958. Section 29(a) which is in Part III of the IAA, provides that a foreign\n                    award may be enforced in a court either under s 19, by action or in the\n                    same manner as a judgment or order, with leave of the court. Significantly,\n                    s 33 which is also within Part III of the statute, provides that\n                    nothing in that Part shall affect the right of any person to enforce an arbitral\n                    award otherwise than as is provided for in this Part. In other words, the IAA\n                    provides a platform which a party may have an award in its favour recognised and\n                    enforced, but it is not the only means by which a party may seek to utilise the\n                    award it has obtained. Quite apart from the summary registration process\n                    available under the IAA, a foreign arbitration award may be enforced and\n                    recognised at common law (see Rule 59 and 60 ofDicey,\n                        Morris & Collins, The Conflict of Laws, Vol 1 (Sweet\n                    & Maxwell, 14th edition 2006) at p 751-762).13     In any event, with respect to the alleged\n                    breach of natural justice, I note the approach of the courts to be circumspect\n                    in upholding the integrity of the arbitration process. InSoh\n                        Beng Tee & Co Pte Ltd v Fairmount Development Pte Ltd[2007]\n                    3 SLR(R) 86, V K Rajah JA opined at [65(f)]:Each case should be decided within its own factual matrix. It must always\n                        be borne in mind that it is not the function of the court to assiduously\n                        comb an arbitral award microscopically in attempting to determine if there\n                        was any blame or fault in the arbitral process; rather, an award should be\n                        read generously such that only meaningful breaches of the rules of natural\n                        justice that have actually caused prejudice are ultimately remedied.Robert Merkin, in Singapore Arbitration Legislation Annotated\n                    (Informa, 2009) at p 76 observes:… something far removed from what is required of the arbitral\n                        process is required and because the losing party will normally have a right\n                        to seek to have the award overturned by the courts of the jurisdiction in\n                        which the award was given, and if the losing party has sought but failed to\n                        obtain relief from the curial courts, or has unreasonably not invoked the\n                        jurisdiction of the curial courts, the award will generally be enforced by\n                        the courts. A party can either apply for the setting aside of the award to\n                        the courts of the country where the award was made, or oppose enforcement in\n                        the courts of the country of enforcement; a decision made by the court of\n                        the country of the award is binding, so that the options are in practical\n                        terms alternative not cumulative; …14     It is not disputed that the Award in favour of\n                    the defendant for the sum of US$ 1,326,625.04 with interest and costs, is\n                    final and binding under the relevant arbitration rules and was not challenged\n                    before the courts of the seat of the arbitration. Neither is it disputed that\n                    the remaining arbitration proceedings that continue relate to other hire\n                    statements between the parties, which do not affect the Award on which the\n                    statutory demand is founded. Quite apart from the circumstances surrounding the\n                    tribunal’s issue of the Award, that the first plaintiff had taken no\n                    further available action in the arbitration and in the seat of arbitration and\n                    continued to participate before the same tribunal in other claims, confirms my\n                    conclusion that there are not existent, substantial grounds establishing abona fidedispute relating to the debt on this\n                    point.15     With regard to the plaintiffs’ attack on\n                    the validity of the interim award on the ground that the tribunal issued the\n                    interim award on a basis that had not been raised or contemplated by the\n                    parties, I would observe that such objections ought also to have been raised in\n                    the arbitration. The winding up proceeding, which is separate from enforcement\n                    proceedings (seeRe International Tin Council[1987] Ch 419 (“International Tin\n                        Council”)), is not a proper arena for ventilating such\n                    objections especially when these objections have not been raised before the\n                    arbitration tribunal.16     The plaintiffs also submit that the issue as\n                    to the enforceability of the Award is complex and would, in all likelihood,\n                    involve many legal and factual arguments and should not be determined by a court\n                    exercising its winding up jurisdiction. InInternational Tin\n                        Council, Millet J addressed the question, in another\n                    context, whether a petition for the winding up of International Tin Council on\n                    the ground that it was insolvent and presented by a creditor with the benefit of\n                    an arbitration award in its favour, was a proceeding in respect of the\n                    enforcement of an arbitration award. To that, he observed at 455–456 as\n                    follows:I am not satisfied that, in this context, the presentation and hearing of\n                        a winding up petition, as distinct from the proof of debt in the winding up,\n                        are properly to be classified as falling within the enforcement jurisdiction\n                        at all. It is fallacious to suppose that, because the petitioner is not\n                        seeking to establish his debt, the court is exercising its enforcement\n                        jurisdiction. Even if the petitioner has previously resorted to litigation\n                        to establish his debt, the presentation of a petition marks the commencement\n                        of an entirely new lis. The issue at the hearing is not whether the\n                        petitioning and other creditors, some of whom will not yet have established\n                        their claims, should be paid, but whether the company is insolvent and, if\n                        so, whether it should be wound up or allowed to try to trade out of its\n                        difficulties. There is much to be said for the view that, in deciding\n                        whether or not the company should be wound up, the court is engaged in a new\n                        process of adjudication, separate and different from any that may previously\n                        have been involved in establishing the petitioning creditor’s\n                        debt.But it is not necessary to decide this, for in my judgment the winding up\n                        process is plainly not a method of enforcing a judgment or arbitration\n                        award. … Far from enabling any judgment or award to be enforced, the\n                        making of a winding up order prevents it. ... Whether the petition is\n                        presented by a creditor or by the debtor, its purpose is to obtain an order\n                        which will preclude the creditors from enforcing any judgments or awards\n                        which they may have obtained, and substitute the right to participate in apari passudistribution out of an\n                        insufficient fund in full satisfaction of their claims. That is not the\n                        enforcement of their judgments or awards, but the opposite.17     TheInternational Tin\n                        Councilcase squarely addresses this issue and concludes that the\n                    winding up application is not regarded as an enforcement of arbitration awards.\n                    I am not required to consider enforceability issues in these proceedings. There\n                    is further tangentially the same broad approach reflected in relation to\n                    s 11 of the Reciprocal Enforcement of Foreign Judgments Act (Cap 265,\n                    2001 Rev Ed), which gives general effect to registered foreign judgments.\n                    Section 7 of this statute expressly confines the enforcement of sums\n                    payable under registrable foreign judgments to being enforced by registration\n                    and to no other Singapore court proceedings. In Halsbury’s Laws of\n                    Singapore, Vol 2 (Butterworths Asia, 1998), at para 20.152, it is\n                    stated:Foreign judgments which are not registered for enforcement or are not\n                        registrable for enforcement may however be ‘recognised’ (as\n                        opposed to being enforced by way of execution) as conclusive of findings of\n                        fact and law in proceedings which may be commenced in the Singapore courts\n                        based on the original cause of action or related proceedings.18     In the premises there is, in my view, no\n                    obstacle to a statutory demand being made for the purposes of\n                        s 254(2)(a) read with\n                        s 254(1)(e) of the Companies Act, which\n                    is founded on a binding arbitration award whether or not such arbitration award\n                    has been otherwise enforced by registration under the International Arbitration\n                    Act. I find also that the submission that there is continuing arbitration\n                    between the parties relating to other claims which have no direct bearing on\n                    this particular interim award not to constitute abona\n                        fidedispute on substantial grounds of this debt constituted by\n                    the binding arbitration award.19     At this juncture, I would add that it should\n                    be noted that the statutory demand is quite distinct from enforcing the award.\n                    All it establishes is that the unsatisfied demand results in a presumption of\n                    insolvency being a ground for winding up. Upon an order for winding up being\n                    made, the liquidator would be responsible for the orderly determination and\n                    discharge of the company’s liabilities against is assets. The liquidator\n                    remains at liberty to dispute any proof of debt by the defendant based on the\n                    arbitration award. Should a liquidator dispute such debt, notwithstanding the\n                    obstacles set out in[13], the defendant may\n                    then be obliged to either register or enforce the award under the IAA. In such\n                    event, it is not inconceivable that a registration or enforcement court may\n                    refuse registration under s 31(2)(c) of the\n                    IAA. Would such a possibility, however remote, give pause for thought about such\n                    an award being the basis of a statutory demand presumption of insolvency? I\n                    think not because the primary considerations arising in the context of\n                    insolvency relate to the protection of all creditors and not the debtor whose\n                    unsatisfied claim which a later court may decide to be\n                unenforceable.The Cross-claim issue20     The next question is whether I should stay the\n                    winding up application by reason that the first plaintiff’s cross-claim\n                    under the remaining arbitration proceedings may exceed the debt. In addition to\n                    the cross-claim in the arbitration proceedings, as indicated in the affidavit of\n                    Huang Yingjun, a director of the first plaintiff, dated 11 December 2009,\n                    the defendant had also arrested the plaintiffs’ associated vessel in South\n                    Africa. While the plaintiffs are currently contesting the arrest, in the event\n                    that they fail and arrest not be lifted and the vessel sold, it is submitted\n                    that the sale proceeds will exceed the sum payable to the defendant under the\n                    statutory demand.21     There is, in principle no distinction between\n                    a cross-claim of substance and a serious dispute regarding the indebtedness\n                    imputed against a company, which has long been held to constitute a proper\n                    ground upon which to reject a winding-up petition (seeMalayan Plant (Pte) Ltd v Moscow Narodny Bank Ltd[1979 –\n                    1980] SLR(R) 511 at [18]). A debtor-company may rely on a cross-claim\n                    against its creditor to seek a striking out or stay of winding up proceeding,\n                    although it has to satisfy the court that on the evidence there is a distinct\n                    possibility that the cross-claim may exceed the undisputed debt (seeMetalform Asia Pte Ltd v Holland Leedon Pte Ltd[2007]\n                    2 SLR(R) 268 (“Metalform”)\n                    at [82]). InRe L.H.F.Wools\n                        Ltd[1970] 1 Ch 27, a creditor petitioned for the\n                    winding up of a debtor-company whose sole asset was a cross-claim against the\n                    creditor. The debtor-company sought an adjournment or dismissal of the petition\n                    on the basis of the cross-claim. The Court of Appeal held that when a\n                    debtor-company had a genuine and serious cross-claim against the petitioning\n                    creditor which it had not reasonably been able to litigate, the petition should\n                    be usually dismissed or stayed. The Court of Appeal stayed the winding up\n                    petition pending the trial of the cross-claim on the basis that (a) there was a\n                    genuine and serious cross-claim against the petitioner, (b) the\n                    debtor-company’s directors would be better able than a liquidator to\n                    prosecute its claim against the petitioner and (c) the delay in winding up would\n                    not in any event prejudice the petitioner as the debtor-company had no assets\n                    save for the claim.22     The decision whether or not to stay or dismiss\n                    a winding up petition on the basis of the existence of a cross-claim against the\n                    petitioning creditor involves two competing concerns. The first is articulated\n                    inPaganelli Sdn Bhd v Care-Me Direct Sales Sdn\n                        Bhd[1999] 2 MLJ 464 where the Malaysian High Court\n                    considered the implications of a stay against a winding up petition:… the respondent should not have to suffer a petition of winding up\n                        a day longer than necessary and neither should they have reimposed upon them\n                        the uncertainty and hardship which a reinstatement of the winding-up\n                        petition will bring.The second is elucidated inMetalformat\n                    [82]:… the commercial viability of a company should not be put in\n                        jeopardy by the premature presentation of a winding-up petition against it\n                        where it has a serious cross-claim based on substantial grounds. Such a\n                        petition may adversely affect the reputation and the business of the company\n                        and may also set in motion a process that may create cross-defaults or cut\n                        the company off from further sources of financing, thereby exacerbating its\n                        financial condition. … Businesses that have a chance of recovery\n                        should not be pushed into a state that makes it difficult for them to\n                        recover.23     If the first plaintiff has a genuine and\n                    serious cross-claim against the defendant, thelocus\n                        standiof the defendant to present a winding-up petition against\n                    the plaintiffs would be called into question and a stay or striking out of the\n                    winding-up petition would be justified by the concern that the commercial\n                    viability of the plaintiffs ought not to be put in jeopardy by the premature\n                    presentation of the petition.24     The first plaintiff asserts that it has a\n                    cross-claim against the defendant, which arises from an implied term of the\n                    charterparty that the vessel be commercially acceptable or marketable in the\n                    market for sub-charters. The alternative basis for its claim is that there was a\n                    collateral contract that the vessel be commercially acceptable or marketable in\n                    the market for sub-charters. The breach of this term, it is averred, is a\n                    repudiatory breach which entitles the first plaintiff to terminate the\n                    charterparty and seek damages which would exceed or be equivalent to the\n                    defendant’s arbitration claim.25     The defendant, on the other hand, points out\n                    that the first plaintiff has not filed any counterclaim against the defendant in\n                    the ongoing London arbitration and accordingly whatever the outcome of the\n                    arbitration, it would have no bearing on the debt comprised in the\n                award.26     I find little merit in the plaintiffs’\n                    case for a cross-claim as quite apart from it not having been hitherto raised in\n                    the arbitration proceedings there is further absent in these proceedings, any\n                    substantiated quantification of the cross-claim as would reveal that it is\n                    likely to approximate or exceed the statutory demand debt. I am not satisfied\n                    that the plaintiffs have made their case that the statutory demand debt has not\n                    been properly established and/or that there is abona\n                        fidedispute of the debt on substantial grounds. The presumption\n                    of insolvency under s 254(2)(a) of the\n                    Companies Act operates so long as the debtor does not pay a sum which is not in\n                    dispute and that sum exceeds the minimum prescribed therein (seeRe Makin Nominees Pte Ltd[1994]\n                    2 SLR(R) 848).Guarantor’s Liability issue27     The second plaintiff first relied on the first\n                    plaintiff’s submission that there is abona\n                        fidedispute as to the debt which arises from the allegedly\n                    defective award. I have addressed this above in [7] – [18] and find no\n                    merit in this submission. The second plaintiff next relied also on the first\n                    plaintiff’s disputes relating to the debt which I have found\n                    unmeritorious.28     The second plaintiff independently disputes\n                    the debt founded on its guarantee, on the ground that it is was not a party to\n                    the arbitration. The second plaintiff citesPT Jaya Sumpiles\n                        Indonesia and another v Kristle Trading Ltd and another[2009]\n                    3 SLR(R) 689 for the proposition that an award against a principal\n                    debtor is not binding on a guarantor in an action by the creditor against the\n                    guarantor based on the award. The guarantor not being a party to the arbitrationquaguarantor, that principle is clear. The\n                        decision, however, goes much further to elaborate at [42]:Instead, should the creditor sue the guarantor, it must prove the guarantor’s\n                    liability in the same way as it must prove the principal debtor’s\n                    liability if it were to bring an action against the principal\n                    debtor.29     Under its guarantee dated 12 October\n                    2007, it unconditionally guaranteed the defendant in the following\n                    terms:… due, full and complete performance in every respect\n                    by the said charterers of all terms and conditions of the charterparty includingpayment of any amounts due by the Charterers whether by\n                        way of hire, freight, damages or otherwise. [emphasis\n                        added]30     It is not disputed here that the defendant has\n                    issued a letter of demand on the guarantor. Once the first plaintiff’s\n                    debt to the defendant remains outstanding this unpaid debt becomes the basis of\n                    the guarantor’s liability under the terms of the guarantee. A statutory\n                    demand against the second plaintiff in these circumstances is not enforcing an\n                    arbitration award against a third party guarantor. Indeed the statutory demand\n                    against the second plaintiff is as follows:As a result of breaches on the part of the Charterers and/or their failure\n                        to pay hire and all other sums due, a sum ofUS$3,986,157.16as set out below, is now due and owing to\n                        our clients.14thHire Statement\n                                            dated 3 December 2008/Interim Final Award dated\n                                            18 December 2008US$1,326,625.04(less partial settlement in or about\n                                            March 2009)(US$350,000.00)15thHire\n                                            Statement dated 19 December\n                                    2008US$1,170,750.0016thHire\n                                            Statement dated 23 December\n                                    2008US$1,170,750.00Revised 17thHire Statement dated 12 August\n                                    2009US$668,032.12TotalUS$3,986,157.16Copies of the Interim Final Award dated 18 December 2009, the\n                            14th, 15th,\n                            16thHire Statements and the Revised\n                            17thHire Statements are attached.We are instructed that to date the [first plaintiff] have failed to make\n                        any payments in relation to this outstanding amount of\n                        US$3,986,157.16.As [the first plaintiff] have not effected payment of the amount due, we\n                        hereby demand immediate payment of the sum ofUS$3,986,157.16pursuant to the terms of the Guarantee given\n                        by yourselves to [the defendant].31     On the wording of the statutory demand, the\n                    defendant was making a demand on the basis of the first plaintiff’s\n                    failure to pay hire and sums due under the hire statements. The reference to the\n                    arbitration award was ancillary. The Award did not exclusively form the basis of\n                    the defendant’s statutory demand.Conclusion32     In these circumstances and in the light of the\n                    above, I dismiss the plaintiffs’ application to stay or strike out the\n                    winding up petitions filed by the defendant and order costs to the defendant to\n                    be agreed or taxed.",
        "Threshold Issue": "4       A winding up petition is not the appropriate\n                    means of collecting a disputed debt nor is it to be abused as a means of\n                    pressure. The issue before me is whether there is abona\n                        fideand substantial dispute of the alleged debt on any of the\n                    grounds raised by the plaintiffs. This is the threshold which the plaintiffs\n                    must meet in support of their application to stay or strike out the winding up\n                    petitions.",
        "Whether there is abona fideand\n                substantial dispute over the debt": "5       InBNP Paribas v Jurong\n                        Shipyard Pte Ltd[2009] 2 SLR(R) 949 at [15], the Court\n                    of Appeal held that the “general rule is that, where a company is unable\n                    or deemed to be unable to pay its debts, the creditor isprima facieentitled to a winding-up orderex\n                        debito justitiae”. However, the court nonetheless retains\n                    the discretion not to grant a winding up order in exceptional cases. One\n                    instance when a court may refuse to grant a winding up order, but may instead\n                    stay or strike out the winding up petition, is where the debtor-company\n                    establishes that there is abona fidedispute of\n                    the statutory debt. To obtain the stay or striking out, the debtor company must\n                    show that the dispute isbona fidein both a\n                    subjective and objective sense.Palmer’s Company\n                        Lawvol 3 at pp 15068-15069, as quoted approvingly inLKM Investment Holdings Pte Ltd v Cathay Theatres Pte\n                        Ltd[2000] 1 SLR(R) 135 at [20], elucidates: … the dispute must be bona fide in both a subjective and an\n                        objective sense. Thus the reason for not paying the debt must be honestly\n                        believed to exist and must be based on substantial or reasonable grounds.\n                        'Substantial' means having substance and not frivolous, which disputes the\n                        court should ignore. There must be so much doubt and question about the\n                        liability to pay the debt that the court sees that there is a question to be\n                        decided. The onus is on the company 'to bring forward a prima facie case\n                        which satisfies the court that there is something which ought to be tried\n                        either before the court itself or in an action, or by some other\n                        proceedings.' Nonetheless, the debtor-company does not need to show that the debt\n                    does not exist – it merely needs to raise a triable issue. InPacific Recreation Pte Ltd v S Y Technology Inc and another\n                        appeal[2008] 2 SLR(R) 491 at [23], the Court of Appeal\n                    held that the applicable standard for determining the existence of a substantial\n                    andbona fidedispute was “no more than\n                    that for resisting a summary judgment application”. 6       With the applicable principles in mind, I now\n                    turn to examining the IAA issue, the Cross-claim issue and the Guarantor’s\n                    Liability issue respectively.",
        "The IAA issue": "7       The plaintiffs dispute the debt that is founded\n                    on the interim arbitration award as being improperly obtained by reason of the\n                    alleged failure to observe the rules of natural justice. The defendant, in\n                    response, points out that the regularity of the award had been unchallenged at\n                    the arbitration and at the courts of the seat of the arbitration. The defendant\n                    cited the following authorities: (a)Minmetals Germany GmbH v Ferco\n                                Steel Ltd[1999] CLC 647 at 661where it was\n                            stated that:In international commerce a party who contracts into an agreement to\n                        arbitrate in a foreign jurisdiction is bound not only by the local\n                        arbitration procedure but also by the supervisory jurisdiction of the courts\n                        of the seat of the arbitration. If the award is defective or the arbitration\n                        is defectively conducted the party who complains of the defect must in the\n                        first instance pursue such remedies as exist under that supervisory\n                        jurisdiction. That is because by his agreement to the place in question as\n                        the seat of the arbitration he has agreed not only to refer all disputes to\n                        arbitration but that the conduct of the arbitration should be subject to\n                        that particular supervisory jurisdiction. Adherence to that part of the\n                        agreement must, in my judgment, be a cardinal policy consideration by an\n                        English court considering enforcement of a foreign award.(b)Aloe Vera of America, Inc v\n                                Asianic Food (S) Pte Ltd and another[2006]\n                            3 SLR(R) 174 where it was stated at [56]:… a party may be precluded by his failure to raise a point before\n                        the court of supervisory jurisdiction from raising that point before the\n                        court of enforcement. This is because failure to raise such a point may\n                        amount to an estoppel or a want of bona fides such as to justify the court\n                        of enforcement in enforcing an award.and further at [76]:There was nothing thereafter to stop him from challenging the\n                        Arbitrator’s preliminary holding in the courts of Arizona or from\n                        taking part in the arbitration itself or from challenging the\n                        Arbitrator’s final holding in the courts of Arizona. Having chosen not\n                        to participate in the proceedings, it really does not lie in\n                        Mr Chiew’s mouth to say that he has been deprived of natural\n                        justice because the Arbitrator made one finding in his interim award and\n                        supplemented that with an additional finding in the final award.\n                        Mr Chiew had the benefit of legal advice in Arizona at all material\n                        times and his decision not to have recourse to the supervisory court was a\n                        calculated one. If his choice has proved to be a miscalculation, public\n                        policy does not require that I relieve him from the consequences of such\n                        miscalculation.8       The law set out in the above cases is\n                    uncontroversial. However, the above cases deal with the position of a challenge\n                    of the arbitration awards made before the enforcement court, where the relevant\n                    awards are alleged to be defective but had been unchallenged at the arbitration\n                    or at the courts in the seat of arbitration. They do not address the issue that\n                    is before me here, which is not a proceeding for the enforcement of an\n                    arbitration award under the IAA, but a winding up application. The defendant in\n                    this case, has issued a statutory demand of a debt under s 254(2)(a) read with s 254(1)(e) of the Companies Act, the debt having arisen by reason of a\n                    final international arbitration award. While the plaintiffs alleged that this\n                    Award is defective, it was unchallenged in the arbitration forum and before the\n                    courts of the seat of arbitration. The Award therefore remains effective on the\n                    face of it.9       The real question before me is whether the\n                    defendant is precluded from issuing a statutory demand under\n                        s 254(2)(a) read with\n                        s 254(1)(e) of the Companies Act based on\n                    a debt that is founded on an arbitration award because such an award can only\n                    and exclusively be enforced under the IAA.10     The plaintiffs assert that the defendant is\n                    obliged to enforce the Award under s 27(2) of the IAA. They argue that had\n                    the defendant sought to enforce its arbitration award in Singapore under the\n                    IAA, this would have been resisted pursuant to s 31(2)(c) of the IAA on the ground that the rules of natural justice\n                    were not adhered to in obtaining that award (seeKanoria v\n                        Guinness[2006] EWCA Civ 222). In any case, to permit\n                    the defendant to rely on its statutory demand debt founded on the Award which\n                    was not enforced under the IAA, would be, they argue, in effect enforcing the\n                    interim award under s 27(2) of the IAA. As such the enforcement remains\n                    susceptible to the challenge of alleged breach of natural justice which would be\n                    available under s 31(2)(c) of the IAA and there\n                    therefore exists aprima facie bona fidedispute\n                    of the debt on substantial grounds. The plaintiffs further attack the validity\n                    of the interim award on the ground that the tribunal issued the award on a basis\n                    which had not been raised or contemplated by the parties (seePacific Recreation Pte Ltd v S Y Technology Inc and another[2008] 2 SLR(R) 491 at [30]). Against this, the defendant argues that\n                    it is free to elect either to enforce the Award in Singapore under the IAA or to\n                    use the debt arising therefrom as the foundation of its statutory demand for the\n                    purposes of a winding up petition.11     Section 27(2) of the IAA reads:In this Part, where the context so admits, “enforcement” in\n                        relation to a foreign award, includes the recognition of the award as\n                        binding for any purpose, and “enforce” and\n                        “enforced” have corresponding meanings.I am unable to accept the plaintiffs’ argument that the\n                    defendant must enforce the Award under this provision of the IAA before it can\n                    bring the winding up proceedings against the plaintiffs. No authority is cited\n                    to me for the proposition that a successful party of a foreign arbitration award\n                    is obliged and confined to enforce the award only by way of enforcement\n                    proceedings under the IAA and is thereby precluded from issuing a statutory\n                    demand based on a foreign arbitration award followed, if unsatisfied, by a\n                    winding up application on grounds of a presumption of insolvency.12     Furthermore, the IAA was by the terms of its\n                    Preamble, enacted to make provision for the conduct of international commercial\n                    arbitrations based on the UNCITRAL Model Law and to give effect to the New York\n                    Convention on the Recognition and Enforcement of Foreign Arbitral Awards\n                    (“New York Convention”). Part III of the IAA governs foreign\n                    awards under the New York Convention of 1958. Section 29(a) which is in Part III of the IAA, provides that a foreign\n                    award may be enforced in a court either under s 19, by action or in the\n                    same manner as a judgment or order, with leave of the court. Significantly,\n                    s 33 which is also within Part III of the statute, provides that\n                    nothing in that Part shall affect the right of any person to enforce an arbitral\n                    award otherwise than as is provided for in this Part. In other words, the IAA\n                    provides a platform which a party may have an award in its favour recognised and\n                    enforced, but it is not the only means by which a party may seek to utilise the\n                    award it has obtained. Quite apart from the summary registration process\n                    available under the IAA, a foreign arbitration award may be enforced and\n                    recognised at common law (see Rule 59 and 60 ofDicey,\n                        Morris & Collins, The Conflict of Laws, Vol 1 (Sweet\n                    & Maxwell, 14th edition 2006) at p 751-762).13     In any event, with respect to the alleged\n                    breach of natural justice, I note the approach of the courts to be circumspect\n                    in upholding the integrity of the arbitration process. InSoh\n                        Beng Tee & Co Pte Ltd v Fairmount Development Pte Ltd[2007]\n                    3 SLR(R) 86, V K Rajah JA opined at [65(f)]:Each case should be decided within its own factual matrix. It must always\n                        be borne in mind that it is not the function of the court to assiduously\n                        comb an arbitral award microscopically in attempting to determine if there\n                        was any blame or fault in the arbitral process; rather, an award should be\n                        read generously such that only meaningful breaches of the rules of natural\n                        justice that have actually caused prejudice are ultimately remedied.Robert Merkin, in Singapore Arbitration Legislation Annotated\n                    (Informa, 2009) at p 76 observes:… something far removed from what is required of the arbitral\n                        process is required and because the losing party will normally have a right\n                        to seek to have the award overturned by the courts of the jurisdiction in\n                        which the award was given, and if the losing party has sought but failed to\n                        obtain relief from the curial courts, or has unreasonably not invoked the\n                        jurisdiction of the curial courts, the award will generally be enforced by\n                        the courts. A party can either apply for the setting aside of the award to\n                        the courts of the country where the award was made, or oppose enforcement in\n                        the courts of the country of enforcement; a decision made by the court of\n                        the country of the award is binding, so that the options are in practical\n                        terms alternative not cumulative; …14     It is not disputed that the Award in favour of\n                    the defendant for the sum of US$ 1,326,625.04 with interest and costs, is\n                    final and binding under the relevant arbitration rules and was not challenged\n                    before the courts of the seat of the arbitration. Neither is it disputed that\n                    the remaining arbitration proceedings that continue relate to other hire\n                    statements between the parties, which do not affect the Award on which the\n                    statutory demand is founded. Quite apart from the circumstances surrounding the\n                    tribunal’s issue of the Award, that the first plaintiff had taken no\n                    further available action in the arbitration and in the seat of arbitration and\n                    continued to participate before the same tribunal in other claims, confirms my\n                    conclusion that there are not existent, substantial grounds establishing abona fidedispute relating to the debt on this\n                    point.15     With regard to the plaintiffs’ attack on\n                    the validity of the interim award on the ground that the tribunal issued the\n                    interim award on a basis that had not been raised or contemplated by the\n                    parties, I would observe that such objections ought also to have been raised in\n                    the arbitration. The winding up proceeding, which is separate from enforcement\n                    proceedings (seeRe International Tin Council[1987] Ch 419 (“International Tin\n                        Council”)), is not a proper arena for ventilating such\n                    objections especially when these objections have not been raised before the\n                    arbitration tribunal.16     The plaintiffs also submit that the issue as\n                    to the enforceability of the Award is complex and would, in all likelihood,\n                    involve many legal and factual arguments and should not be determined by a court\n                    exercising its winding up jurisdiction. InInternational Tin\n                        Council, Millet J addressed the question, in another\n                    context, whether a petition for the winding up of International Tin Council on\n                    the ground that it was insolvent and presented by a creditor with the benefit of\n                    an arbitration award in its favour, was a proceeding in respect of the\n                    enforcement of an arbitration award. To that, he observed at 455–456 as\n                    follows:I am not satisfied that, in this context, the presentation and hearing of\n                        a winding up petition, as distinct from the proof of debt in the winding up,\n                        are properly to be classified as falling within the enforcement jurisdiction\n                        at all. It is fallacious to suppose that, because the petitioner is not\n                        seeking to establish his debt, the court is exercising its enforcement\n                        jurisdiction. Even if the petitioner has previously resorted to litigation\n                        to establish his debt, the presentation of a petition marks the commencement\n                        of an entirely new lis. The issue at the hearing is not whether the\n                        petitioning and other creditors, some of whom will not yet have established\n                        their claims, should be paid, but whether the company is insolvent and, if\n                        so, whether it should be wound up or allowed to try to trade out of its\n                        difficulties. There is much to be said for the view that, in deciding\n                        whether or not the company should be wound up, the court is engaged in a new\n                        process of adjudication, separate and different from any that may previously\n                        have been involved in establishing the petitioning creditor’s\n                        debt.But it is not necessary to decide this, for in my judgment the winding up\n                        process is plainly not a method of enforcing a judgment or arbitration\n                        award. … Far from enabling any judgment or award to be enforced, the\n                        making of a winding up order prevents it. ... Whether the petition is\n                        presented by a creditor or by the debtor, its purpose is to obtain an order\n                        which will preclude the creditors from enforcing any judgments or awards\n                        which they may have obtained, and substitute the right to participate in apari passudistribution out of an\n                        insufficient fund in full satisfaction of their claims. That is not the\n                        enforcement of their judgments or awards, but the opposite.17     TheInternational Tin\n                        Councilcase squarely addresses this issue and concludes that the\n                    winding up application is not regarded as an enforcement of arbitration awards.\n                    I am not required to consider enforceability issues in these proceedings. There\n                    is further tangentially the same broad approach reflected in relation to\n                    s 11 of the Reciprocal Enforcement of Foreign Judgments Act (Cap 265,\n                    2001 Rev Ed), which gives general effect to registered foreign judgments.\n                    Section 7 of this statute expressly confines the enforcement of sums\n                    payable under registrable foreign judgments to being enforced by registration\n                    and to no other Singapore court proceedings. In Halsbury’s Laws of\n                    Singapore, Vol 2 (Butterworths Asia, 1998), at para 20.152, it is\n                    stated:Foreign judgments which are not registered for enforcement or are not\n                        registrable for enforcement may however be ‘recognised’ (as\n                        opposed to being enforced by way of execution) as conclusive of findings of\n                        fact and law in proceedings which may be commenced in the Singapore courts\n                        based on the original cause of action or related proceedings.18     In the premises there is, in my view, no\n                    obstacle to a statutory demand being made for the purposes of\n                        s 254(2)(a) read with\n                        s 254(1)(e) of the Companies Act, which\n                    is founded on a binding arbitration award whether or not such arbitration award\n                    has been otherwise enforced by registration under the International Arbitration\n                    Act. I find also that the submission that there is continuing arbitration\n                    between the parties relating to other claims which have no direct bearing on\n                    this particular interim award not to constitute abona\n                        fidedispute on substantial grounds of this debt constituted by\n                    the binding arbitration award.19     At this juncture, I would add that it should\n                    be noted that the statutory demand is quite distinct from enforcing the award.\n                    All it establishes is that the unsatisfied demand results in a presumption of\n                    insolvency being a ground for winding up. Upon an order for winding up being\n                    made, the liquidator would be responsible for the orderly determination and\n                    discharge of the company’s liabilities against is assets. The liquidator\n                    remains at liberty to dispute any proof of debt by the defendant based on the\n                    arbitration award. Should a liquidator dispute such debt, notwithstanding the\n                    obstacles set out in[13], the defendant may\n                    then be obliged to either register or enforce the award under the IAA. In such\n                    event, it is not inconceivable that a registration or enforcement court may\n                    refuse registration under s 31(2)(c) of the\n                    IAA. Would such a possibility, however remote, give pause for thought about such\n                    an award being the basis of a statutory demand presumption of insolvency? I\n                    think not because the primary considerations arising in the context of\n                    insolvency relate to the protection of all creditors and not the debtor whose\n                    unsatisfied claim which a later court may decide to be\n                unenforceable.The Cross-claim issue20     The next question is whether I should stay the\n                    winding up application by reason that the first plaintiff’s cross-claim\n                    under the remaining arbitration proceedings may exceed the debt. In addition to\n                    the cross-claim in the arbitration proceedings, as indicated in the affidavit of\n                    Huang Yingjun, a director of the first plaintiff, dated 11 December 2009,\n                    the defendant had also arrested the plaintiffs’ associated vessel in South\n                    Africa. While the plaintiffs are currently contesting the arrest, in the event\n                    that they fail and arrest not be lifted and the vessel sold, it is submitted\n                    that the sale proceeds will exceed the sum payable to the defendant under the\n                    statutory demand.21     There is, in principle no distinction between\n                    a cross-claim of substance and a serious dispute regarding the indebtedness\n                    imputed against a company, which has long been held to constitute a proper\n                    ground upon which to reject a winding-up petition (seeMalayan Plant (Pte) Ltd v Moscow Narodny Bank Ltd[1979 –\n                    1980] SLR(R) 511 at [18]). A debtor-company may rely on a cross-claim\n                    against its creditor to seek a striking out or stay of winding up proceeding,\n                    although it has to satisfy the court that on the evidence there is a distinct\n                    possibility that the cross-claim may exceed the undisputed debt (seeMetalform Asia Pte Ltd v Holland Leedon Pte Ltd[2007]\n                    2 SLR(R) 268 (“Metalform”)\n                    at [82]). InRe L.H.F.Wools\n                        Ltd[1970] 1 Ch 27, a creditor petitioned for the\n                    winding up of a debtor-company whose sole asset was a cross-claim against the\n                    creditor. The debtor-company sought an adjournment or dismissal of the petition\n                    on the basis of the cross-claim. The Court of Appeal held that when a\n                    debtor-company had a genuine and serious cross-claim against the petitioning\n                    creditor which it had not reasonably been able to litigate, the petition should\n                    be usually dismissed or stayed. The Court of Appeal stayed the winding up\n                    petition pending the trial of the cross-claim on the basis that (a) there was a\n                    genuine and serious cross-claim against the petitioner, (b) the\n                    debtor-company’s directors would be better able than a liquidator to\n                    prosecute its claim against the petitioner and (c) the delay in winding up would\n                    not in any event prejudice the petitioner as the debtor-company had no assets\n                    save for the claim.22     The decision whether or not to stay or dismiss\n                    a winding up petition on the basis of the existence of a cross-claim against the\n                    petitioning creditor involves two competing concerns. The first is articulated\n                    inPaganelli Sdn Bhd v Care-Me Direct Sales Sdn\n                        Bhd[1999] 2 MLJ 464 where the Malaysian High Court\n                    considered the implications of a stay against a winding up petition:… the respondent should not have to suffer a petition of winding up\n                        a day longer than necessary and neither should they have reimposed upon them\n                        the uncertainty and hardship which a reinstatement of the winding-up\n                        petition will bring.The second is elucidated inMetalformat\n                    [82]:… the commercial viability of a company should not be put in\n                        jeopardy by the premature presentation of a winding-up petition against it\n                        where it has a serious cross-claim based on substantial grounds. Such a\n                        petition may adversely affect the reputation and the business of the company\n                        and may also set in motion a process that may create cross-defaults or cut\n                        the company off from further sources of financing, thereby exacerbating its\n                        financial condition. … Businesses that have a chance of recovery\n                        should not be pushed into a state that makes it difficult for them to\n                        recover.23     If the first plaintiff has a genuine and\n                    serious cross-claim against the defendant, thelocus\n                        standiof the defendant to present a winding-up petition against\n                    the plaintiffs would be called into question and a stay or striking out of the\n                    winding-up petition would be justified by the concern that the commercial\n                    viability of the plaintiffs ought not to be put in jeopardy by the premature\n                    presentation of the petition.24     The first plaintiff asserts that it has a\n                    cross-claim against the defendant, which arises from an implied term of the\n                    charterparty that the vessel be commercially acceptable or marketable in the\n                    market for sub-charters. The alternative basis for its claim is that there was a\n                    collateral contract that the vessel be commercially acceptable or marketable in\n                    the market for sub-charters. The breach of this term, it is averred, is a\n                    repudiatory breach which entitles the first plaintiff to terminate the\n                    charterparty and seek damages which would exceed or be equivalent to the\n                    defendant’s arbitration claim.25     The defendant, on the other hand, points out\n                    that the first plaintiff has not filed any counterclaim against the defendant in\n                    the ongoing London arbitration and accordingly whatever the outcome of the\n                    arbitration, it would have no bearing on the debt comprised in the\n                award.26     I find little merit in the plaintiffs’\n                    case for a cross-claim as quite apart from it not having been hitherto raised in\n                    the arbitration proceedings there is further absent in these proceedings, any\n                    substantiated quantification of the cross-claim as would reveal that it is\n                    likely to approximate or exceed the statutory demand debt. I am not satisfied\n                    that the plaintiffs have made their case that the statutory demand debt has not\n                    been properly established and/or that there is abona\n                        fidedispute of the debt on substantial grounds. The presumption\n                    of insolvency under s 254(2)(a) of the\n                    Companies Act operates so long as the debtor does not pay a sum which is not in\n                    dispute and that sum exceeds the minimum prescribed therein (seeRe Makin Nominees Pte Ltd[1994]\n                    2 SLR(R) 848).Guarantor’s Liability issue27     The second plaintiff first relied on the first\n                    plaintiff’s submission that there is abona\n                        fidedispute as to the debt which arises from the allegedly\n                    defective award. I have addressed this above in [7] – [18] and find no\n                    merit in this submission. The second plaintiff next relied also on the first\n                    plaintiff’s disputes relating to the debt which I have found\n                    unmeritorious.28     The second plaintiff independently disputes\n                    the debt founded on its guarantee, on the ground that it is was not a party to\n                    the arbitration. The second plaintiff citesPT Jaya Sumpiles\n                        Indonesia and another v Kristle Trading Ltd and another[2009]\n                    3 SLR(R) 689 for the proposition that an award against a principal\n                    debtor is not binding on a guarantor in an action by the creditor against the\n                    guarantor based on the award. The guarantor not being a party to the arbitrationquaguarantor, that principle is clear. The\n                        decision, however, goes much further to elaborate at [42]:Instead, should the creditor sue the guarantor, it must prove the guarantor’s\n                    liability in the same way as it must prove the principal debtor’s\n                    liability if it were to bring an action against the principal\n                    debtor.29     Under its guarantee dated 12 October\n                    2007, it unconditionally guaranteed the defendant in the following\n                    terms:… due, full and complete performance in every respect\n                    by the said charterers of all terms and conditions of the charterparty includingpayment of any amounts due by the Charterers whether by\n                        way of hire, freight, damages or otherwise. [emphasis\n                        added]30     It is not disputed here that the defendant has\n                    issued a letter of demand on the guarantor. Once the first plaintiff’s\n                    debt to the defendant remains outstanding this unpaid debt becomes the basis of\n                    the guarantor’s liability under the terms of the guarantee. A statutory\n                    demand against the second plaintiff in these circumstances is not enforcing an\n                    arbitration award against a third party guarantor. Indeed the statutory demand\n                    against the second plaintiff is as follows:As a result of breaches on the part of the Charterers and/or their failure\n                        to pay hire and all other sums due, a sum ofUS$3,986,157.16as set out below, is now due and owing to\n                        our clients.14thHire Statement\n                                            dated 3 December 2008/Interim Final Award dated\n                                            18 December 2008US$1,326,625.04(less partial settlement in or about\n                                            March 2009)(US$350,000.00)15thHire\n                                            Statement dated 19 December\n                                    2008US$1,170,750.0016thHire\n                                            Statement dated 23 December\n                                    2008US$1,170,750.00Revised 17thHire Statement dated 12 August\n                                    2009US$668,032.12TotalUS$3,986,157.16Copies of the Interim Final Award dated 18 December 2009, the\n                            14th, 15th,\n                            16thHire Statements and the Revised\n                            17thHire Statements are attached.We are instructed that to date the [first plaintiff] have failed to make\n                        any payments in relation to this outstanding amount of\n                        US$3,986,157.16.As [the first plaintiff] have not effected payment of the amount due, we\n                        hereby demand immediate payment of the sum ofUS$3,986,157.16pursuant to the terms of the Guarantee given\n                        by yourselves to [the defendant].31     On the wording of the statutory demand, the\n                    defendant was making a demand on the basis of the first plaintiff’s\n                    failure to pay hire and sums due under the hire statements. The reference to the\n                    arbitration award was ancillary. The Award did not exclusively form the basis of\n                    the defendant’s statutory demand.Conclusion32     In these circumstances and in the light of the\n                    above, I dismiss the plaintiffs’ application to stay or strike out the\n                    winding up petitions filed by the defendant and order costs to the defendant to\n                    be agreed or taxed.",
        "The Cross-claim issue": "20     The next question is whether I should stay the\n                    winding up application by reason that the first plaintiff’s cross-claim\n                    under the remaining arbitration proceedings may exceed the debt. In addition to\n                    the cross-claim in the arbitration proceedings, as indicated in the affidavit of\n                    Huang Yingjun, a director of the first plaintiff, dated 11 December 2009,\n                    the defendant had also arrested the plaintiffs’ associated vessel in South\n                    Africa. While the plaintiffs are currently contesting the arrest, in the event\n                    that they fail and arrest not be lifted and the vessel sold, it is submitted\n                    that the sale proceeds will exceed the sum payable to the defendant under the\n                    statutory demand. 21     There is, in principle no distinction between\n                    a cross-claim of substance and a serious dispute regarding the indebtedness\n                    imputed against a company, which has long been held to constitute a proper\n                    ground upon which to reject a winding-up petition (seeMalayan Plant (Pte) Ltd v Moscow Narodny Bank Ltd[1979 –\n                    1980] SLR(R) 511 at [18]). A debtor-company may rely on a cross-claim\n                    against its creditor to seek a striking out or stay of winding up proceeding,\n                    although it has to satisfy the court that on the evidence there is a distinct\n                    possibility that the cross-claim may exceed the undisputed debt (seeMetalform Asia Pte Ltd v Holland Leedon Pte Ltd[2007]\n                    2 SLR(R) 268 (“Metalform”)\n                    at [82]). InRe L.H.F.Wools\n                        Ltd[1970] 1 Ch 27, a creditor petitioned for the\n                    winding up of a debtor-company whose sole asset was a cross-claim against the\n                    creditor. The debtor-company sought an adjournment or dismissal of the petition\n                    on the basis of the cross-claim. The Court of Appeal held that when a\n                    debtor-company had a genuine and serious cross-claim against the petitioning\n                    creditor which it had not reasonably been able to litigate, the petition should\n                    be usually dismissed or stayed. The Court of Appeal stayed the winding up\n                    petition pending the trial of the cross-claim on the basis that (a) there was a\n                    genuine and serious cross-claim against the petitioner, (b) the\n                    debtor-company’s directors would be better able than a liquidator to\n                    prosecute its claim against the petitioner and (c) the delay in winding up would\n                    not in any event prejudice the petitioner as the debtor-company had no assets\n                    save for the claim. 22     The decision whether or not to stay or dismiss\n                    a winding up petition on the basis of the existence of a cross-claim against the\n                    petitioning creditor involves two competing concerns. The first is articulated\n                    inPaganelli Sdn Bhd v Care-Me Direct Sales Sdn\n                        Bhd[1999] 2 MLJ 464 where the Malaysian High Court\n                    considered the implications of a stay against a winding up petition: … the respondent should not have to suffer a petition of winding up\n                        a day longer than necessary and neither should they have reimposed upon them\n                        the uncertainty and hardship which a reinstatement of the winding-up\n                        petition will bring. The second is elucidated inMetalformat\n                    [82]: … the commercial viability of a company should not be put in\n                        jeopardy by the premature presentation of a winding-up petition against it\n                        where it has a serious cross-claim based on substantial grounds. Such a\n                        petition may adversely affect the reputation and the business of the company\n                        and may also set in motion a process that may create cross-defaults or cut\n                        the company off from further sources of financing, thereby exacerbating its\n                        financial condition. … Businesses that have a chance of recovery\n                        should not be pushed into a state that makes it difficult for them to\n                        recover. 23     If the first plaintiff has a genuine and\n                    serious cross-claim against the defendant, thelocus\n                        standiof the defendant to present a winding-up petition against\n                    the plaintiffs would be called into question and a stay or striking out of the\n                    winding-up petition would be justified by the concern that the commercial\n                    viability of the plaintiffs ought not to be put in jeopardy by the premature\n                    presentation of the petition. 24     The first plaintiff asserts that it has a\n                    cross-claim against the defendant, which arises from an implied term of the\n                    charterparty that the vessel be commercially acceptable or marketable in the\n                    market for sub-charters. The alternative basis for its claim is that there was a\n                    collateral contract that the vessel be commercially acceptable or marketable in\n                    the market for sub-charters. The breach of this term, it is averred, is a\n                    repudiatory breach which entitles the first plaintiff to terminate the\n                    charterparty and seek damages which would exceed or be equivalent to the\n                    defendant’s arbitration claim. 25     The defendant, on the other hand, points out\n                    that the first plaintiff has not filed any counterclaim against the defendant in\n                    the ongoing London arbitration and accordingly whatever the outcome of the\n                    arbitration, it would have no bearing on the debt comprised in the\n                award. 26     I find little merit in the plaintiffs’\n                    case for a cross-claim as quite apart from it not having been hitherto raised in\n                    the arbitration proceedings there is further absent in these proceedings, any\n                    substantiated quantification of the cross-claim as would reveal that it is\n                    likely to approximate or exceed the statutory demand debt. I am not satisfied\n                    that the plaintiffs have made their case that the statutory demand debt has not\n                    been properly established and/or that there is abona\n                        fidedispute of the debt on substantial grounds. The presumption\n                    of insolvency under s 254(2)(a) of the\n                    Companies Act operates so long as the debtor does not pay a sum which is not in\n                    dispute and that sum exceeds the minimum prescribed therein (seeRe Makin Nominees Pte Ltd[1994]\n                    2 SLR(R) 848).",
        "Guarantor’s Liability issue": "27     The second plaintiff first relied on the first\n                    plaintiff’s submission that there is abona\n                        fidedispute as to the debt which arises from the allegedly\n                    defective award. I have addressed this above in [7] – [18] and find no\n                    merit in this submission. The second plaintiff next relied also on the first\n                    plaintiff’s disputes relating to the debt which I have found\n                    unmeritorious. 28     The second plaintiff independently disputes\n                    the debt founded on its guarantee, on the ground that it is was not a party to\n                    the arbitration. The second plaintiff citesPT Jaya Sumpiles\n                        Indonesia and another v Kristle Trading Ltd and another[2009]\n                    3 SLR(R) 689 for the proposition that an award against a principal\n                    debtor is not binding on a guarantor in an action by the creditor against the\n                    guarantor based on the award. The guarantor not being a party to the arbitrationquaguarantor, that principle is clear. The\n                        decision, however, goes much further to elaborate at [42]: Instead, should the creditor sue the guarantor, it must prove the guarantor’s\n                    liability in the same way as it must prove the principal debtor’s\n                    liability if it were to bring an action against the principal\n                    debtor. 29     Under its guarantee dated 12 October\n                    2007, it unconditionally guaranteed the defendant in the following\n                    terms: … due, full and complete performance in every respect\n                    by the said charterers of all terms and conditions of the charterparty includingpayment of any amounts due by the Charterers whether by\n                        way of hire, freight, damages or otherwise. [emphasis\n                        added] 30     It is not disputed here that the defendant has\n                    issued a letter of demand on the guarantor. Once the first plaintiff’s\n                    debt to the defendant remains outstanding this unpaid debt becomes the basis of\n                    the guarantor’s liability under the terms of the guarantee. A statutory\n                    demand against the second plaintiff in these circumstances is not enforcing an\n                    arbitration award against a third party guarantor. Indeed the statutory demand\n                    against the second plaintiff is as follows: As a result of breaches on the part of the Charterers and/or their failure\n                        to pay hire and all other sums due, a sum ofUS$3,986,157.16as set out below, is now due and owing to\n                        our clients. 14thHire Statement\n                                            dated 3 December 2008/Interim Final Award dated\n                                            18 December 2008US$1,326,625.04(less partial settlement in or about\n                                            March 2009)(US$350,000.00)15thHire\n                                            Statement dated 19 December\n                                    2008US$1,170,750.0016thHire\n                                            Statement dated 23 December\n                                    2008US$1,170,750.00Revised 17thHire Statement dated 12 August\n                                    2009US$668,032.12TotalUS$3,986,157.16   Copies of the Interim Final Award dated 18 December 2009, the\n                            14th, 15th,\n                            16thHire Statements and the Revised\n                            17thHire Statements are attached. We are instructed that to date the [first plaintiff] have failed to make\n                        any payments in relation to this outstanding amount of\n                        US$3,986,157.16. As [the first plaintiff] have not effected payment of the amount due, we\n                        hereby demand immediate payment of the sum ofUS$3,986,157.16pursuant to the terms of the Guarantee given\n                        by yourselves to [the defendant]. 31     On the wording of the statutory demand, the\n                    defendant was making a demand on the basis of the first plaintiff’s\n                    failure to pay hire and sums due under the hire statements. The reference to the\n                    arbitration award was ancillary. The Award did not exclusively form the basis of\n                    the defendant’s statutory demand.",
        "Conclusion": "32     In these circumstances and in the light of the\n                    above, I dismiss the plaintiffs’ application to stay or strike out the\n                    winding up petitions filed by the defendant and order costs to the defendant to\n                    be agreed or taxed."
    }
}