{
    "case_title": "Public Prosecutor\n      v\n      Galing Anak Kujat and another",
    "ncitation": "[2010] SGHC 212",
    "coram": "Kan Ting Chiu J",
    "sections": {
        "Galing’s statements": "",
        "Statement dated 26 February 2008": "6       The first statement recorded from Galing was\n                    recorded by Senior Station Inspector Razali bin Razak (“SSI\n                    Razali”). In this statement[note: 1]Galing recounted that: On 17/02/2008 at about 10:00 pm plus, my friends namely Vincent, Jabing,\n                        two Sarawak guys whose name I could not remember and I walked along Lorong 4\n                        Geylang going to Lorong 12 Geylang for drink. Whilst we were walking along\n                        the road, suddenly Jabing cross the road. Seeing this, I also crossed the\n                        road to follow him while the others did not cross the road. Jabing then told\n                        me to look at two male Chinese walking beside the road. I then asked Jabing\n                        what we are going to do. Jabing replied that we robbed the two male Chinese.\n                        I told Jabing not to do it. Jabing did not reply and just walked behind the\n                        two male Chinese. I then saw Jabing took a piece of wood near a tree. After\n                        a few steps, Jabing used the wood to hit on the male Chinese who has a\n                        bigger built on his head. The other smaller male Chinese wanted to beat\n                        Jabing and I approached the smaller Chinese and took out the belt that I was\n                        wearing belonging to my friend and used the belt to beat the smaller male\n                        Chinese at his face. 2    Afterwhich, I saw the bigger size male Chinese try\n                            to run but Jabing continue to beat him. I then chased the smaller male\n                            Chinese for quite a distance but he managed to run away. I then turn\n                            around and walk towards Jabing. I then saw the bigger male Chinese was\n                            already on the ground. After that I saw the smaller male Chinese came\n                            back towards me. Jabing then chased the smaller male Chinese and I let\n                            him do so. I then took the handphone belonging to the bigger male\n                            Chinese on his right waist. After taking the handphone I ran and shouted\n                            to Jabing not to chase the smaller male Chinese anymore. 3    Jabing then stopped chasing the smaller male Chinese\n                            and followed me use the overhead bridge to cross the opposite side of\n                            the road to meet up with Vincent and the two Sarawak guys who were\n                            waiting for us. After that the five of us walked to Lorong 24 Geylang.\n                            When we reached the coffee shop were order tiger beer to drink. I then\n                            told Jabing, Vincent and the two Sarawak guys that I want to sell away\n                            the stolen handphone. Vincent told me not to sell and I asked who wants\n                            to use the handphone. Vincent told me that he wants to use the handphone\n                            first and I asked Vincent whether he got any money. Vincent said he got\n                            money and I asked for $300/- to use for drinking. Vincent then took out\n                            cash of $300/- to me and I gave Vincent the N73 handphone. I told\n                            Vincent that he used the handphone first and at the end of the month I\n                            will take back the handphone. 4    Vincent then opened the cover of the handphone to\n                            remove the SIM card and I open my handphone cover and took out my SIM\n                            card and I insert it into the N73 handphone. I then switched on the N73\n                            handphone and find out that it has a pin number. I tried to key in any\n                            number as the pin number but was not successful. Vincent then took the\n                            N73 handphone and try for few times but also was not successful. Vincent\n                            told me that the N73 handphone must be sent to a handphone shop. I then\n                            told Vincent to do it and asked back for my SIM card. After we finished\n                            drinking till morning about 6:00 am, I left the coffee shop leaving the\n                            four of them behind. At about 6:15 am, I took a bus and go back to my\n                            working place at Sebarok Island. (The person referred to as “Vincent” is also\n                    referred to as “Vencent”, and his full name is Vencent Anak\n                    Anding.)",
        "Cautioned statement dated 26 February 2008": "7       A cautioned statement was recorded from Galing\n                    later on the same day in response to a charge that he, Vencent Anak Anding and\n                    three other persons had murdered the deceased. The statement[note: 2]reads: I do not have the intention to commit murder but my friend Jabing was too\n                        violent when hitting the Chinese man until he bled profusely. I saw him\n                        hitting the Chinese man several times and his head cracked open. Jabing used\n                        a piece of wood which he picked up from the road side. While the Chinese man\n                        was holding his head, I took a handphone from his waist pouch. When I was\n                        taking this handphone, Jabing chased after another Chinese man. This man is\n                        thin. I shouted at Jabing to stop chasing the Chinese man. He stopped, and\n                        we took the overhead bridge to join three other friends who were across the\n                        road. I suggested to the four of them to follow me to Lor 24 Geylang for\n                        drinks. We drank about six bottles of Tiger Beer. Before we started drinking\n                        I told them that I wanted to sell the handphone. My friend Vencent then\n                        informed me that he would keep the handphone and advance a sum of three\n                        hundred dollars. He took out three hundred dollars and gave it to me. I told\n                        Vencent that I will return three hundred dollars to him and collect the\n                        phone back when I have the money. I gave fifty dollars each to Vencent,\n                        Jabing and two other friends. I do not know their names. I also used some of\n                        the money to pay for the bottles of beer. I wish to say again that I have no\n                        intention to kill the Chinese man. I did not expect the Chinese man to die.\n                        I really regretted that Jabing hit him so many times until he died. I am\n                        sorry. I have no intention to kill him.",
        "Investigation statements recorded on 3, 4 and 6 March\n                    2008[note: 3]": "8       The Investigation Officer of the case, Senior\n                    Station Inspector Zainal Abidin Ismail (“SSI Zainal”) recorded\n                    investigation statements from Galing on 3, 4 and 6 March 2008 with the service\n                    of a Malay interpreter, Marriana. In these statements Galing recounted that on\n                    17 February 2008, Vencent had proposed to him that they rob two Bangladeshi\n                    persons. Galing agreed, and went to Tiong Bahru where the robbery was to take\n                    place. Other persons, namely, Jabing and Anthony Anak Jaban also agreed to join\n                    them in the scheme. The robbery was aborted because the group could not find the\n                    two targets. Another person, Alan Anak Ajan, joined the group, and they consumed\n                    liquor known as “Narcissus Ginseng Wine Tonic”. 9       Eventually they left Tiong Bahru and went to\n                    Geylang. Galing stated that his intention was to meet some friends there and to\n                    drink with them. Galing’s account of the events that followed merits\n                    reproduction: 14    Past 7.00 pm, we arrived at Kallang MRT and all of\n                            us alighted there. From Kallang MRT we walked towards Lor 4 by foot.\n                            Jabing and I were walking in front of the Vencent, Alan and Anthony. We\n                            walked past by block of flats and shops. We crossed the road using the\n                            pedestrian crossing and walked into Lor 4 Geylang Road. Once at Lor 4,\n                            Jabing and I walked to the other end of Lor 4 towards Lor 12. Suddenly,\n                            I saw Jabing crossed the road towards the open space. [Established to be\n                            Sims Way]. On seeing this, I followed him and caught up with Jabing at\n                            the centre of the road divider. I asked him what was going on. He\n                            pointed tome 2 male Chinese who were walking along the cemented path\n                            across the open field. Both of them were walking towards the other side\n                            of the road where there were several lorries were parking. Jabing told\n                            me that he wanted to rob those 2 persons. I told him not to do so but he\n                            ignored me. Jabing was walking slightly ahead of me. I saw him picked a\n                            wood from the ground which look like a tree branch that had just been\n                            cut from the trees. The said wood is about 2 feet long. Jabing carried\n                            it with his right hand by his side and walked hurriedly towards the rear\n                            of the 2 male Chinese. I would like to say that one of male Chinese was\n                            smaller in built whist the other was bigger built. When Jabing neared\n                            both of them, he used both his hands and swung the wood towards the\n                            right side of the bigger built make Chinese. On being hit, that said\n                            male Chinese held his head and ran forward. The other smaller built male\n                            Chinese stepped aside and ran but he turned back and ran after Jabing\n                            who was chasing the bigger built male Chinese. On seeing this, I took\n                            the belt I was wearing and I rolled part of the belt with my left hand\n                            with its buckle exposed. I swung the buckle of the belt towards the\n                            smaller built male Chinese. 16    I struck part of the smaller built Chinese’s\n                            face with the belt and he ran towards the main road. I chased him but he\n                            ran very fast and I could not catch up with him. I gave up the chase and\n                            turned back towards Jabing who was hitting the other Chinese with the\n                            wood in his hands repeatedly at the end of the open space where there is\n                            an electricity sub station. I joined Jabing to hit the said bigger built\n                            male Chinese with the belt I was holding. I struck the belt at the front\n                            part of the body once. By then the said male Chinese knelt and\n                            subsequently fell on the ground holding his head. He was facing up. When\n                            this was going on, the smaller built male Chinese came back towards us.\n                            Jabing rushed towards him and he ran back to the main road. I took the\n                            handphone of the bigger built male Chinese from the pouch at his right\n                            waist that was already lying face up on the ground. I notice there was\n                            blood on his face. After taking the handphone, I rant to the overhead\n                            bridge and shouted to Jabing to stop chasing the other smaller built\n                            Chinese. Jabing and I then crossed the road by the overhead bridge where\n                            Vencent, Alan and Anthony were waiting for us near the temple at Lor 4.\n                            On seeing us, the three of them walked towards Lor 12. Jabing and I\n                            followed them a distant away within sight. Midway along Lor 12, Jabing\n                            and I took another route and walked to Lor 24. Before Jabing and I\n                            parted company with the three of them I told the three of them to meet\n                            us at the coffee shop at Lor 24. 17    Jabing and I arrived at the coffee shop ... . I\n                            told the rest that Jabing had beaten one of the male Chinese very badly\n                            and the male Chinese could have died. I told Jabing off that his action\n                            was not warranted to that extend by beating the man so badly.\n                        ... 10     Galing went on to state that Vencent paid him\n                    $300 for the stolen handphone, and he distributed $50 of that to each member of\n                    the group and used the remaining $50 to pay for their food and drinks.\n                    (Subsequently, Vencent sold the handphone to a dealer, and that enabled the\n                    police to trace and apprehend him, Jabing and the others.) 11     Galing added in his statement: 22    I wish to add that Jabing, Vencent, Alan, Anthony\n                            and I never have anytime planned to commit robbery in Geylang when the\n                            plan to rob at Tiong Bahru failed. We did not discuss anything about\n                            committing robber in Geylang. I just happened spontaneously when Jabing\n                            rushed to attack the 2 male Chinese. 12     When he was questioned by the recording\n                    officer about the targeting of the two victims at Geylang, Galing\n                    explained: It was Jabing. Jabing was walking along the main road beside Lor 4. I was\n                        walking inside Lor 4 in parallel with Jabing. Vencent, Alan and Anthony were\n                        behind me. When I saw Jabing crossed the road, I followed suit. Like I said,\n                        I caught with him at the centre road divider and both of us crossed the road\n                        together towards the open space. When both of us had reached the open space,\n                        Jabing pointed to me of the 2 male Chinese walking ahead of us. After Jabing\n                        had picked the wood on the ground and started to attack them, I took out my\n                        belt from my waist and chased after the smaller built male Chinese.",
        "Jabing’s statements": "",
        "Statement of 26 February 2008": "13     The first statement of Jabing was recorded on\n                    26 February 2008[note: 4]by SSI\n                    Zainal. In the statement, Jabing recounted that Galing, Vencent, Anthony and\n                    Alan were planning to rob two Bangladeshi persons in Tiong Bahru, but were\n                    unable to carry that out because they could not find the two men. 14     He then went on to say that: 2    ... Since, their intended target had gone, we\n                            suggested amongst ourselves to go to Geylang to rob and all of us\n                            agreed. We shared and bought another bottle of Chinese ginseng and all\n                            of us consumed it. 3    At about 6.30 pm, the 5 of us took the train at\n                            Tiong Bahru MRT Station and headed towards Geylang. I used my EZlink\n                            card and the others might have used their own EZlink cards. I am not\n                            very sure. We arrived at Kallang MRT station at about .00 pm and all of\n                            us alighted. We crossed the road infront of Kallang MRT and walked\n                            towards Lorong 4 Geylang Road. We loitered around Lorong 4 Geylang Road\n                            to look for a suitable victim. This was the\n                                1sttime I followed them to commit\n                            robbery. They told me that they preferred Bangladeshi which I do not\n                            know the reason why. We walked in a small group of 2 and 3. I was\n                            walking with Galing ahead of them. Vencent, Alan and Anthony were behind\n                            us. 4    About ½ hour after we loitered at Lor 4, Galing\n                            signalled to me towards 2 male Chinese who were walking from Lor 4\n                            towards Kallang. Both of the male Chinese were crossing the road and\n                            walking towards the open space. Galing immediately ran and crossed the\n                            road. I followed suit. I did not turn back to look at the rest of us. I\n                            wish to say that Galing had earlier taken out his belt and held it on\n                            his right hand. I knew that Galing was wearing a belt with a metal\n                            buckle. 5    Whilst running after the 2 male Chinese, I picked up\n                            a wood which I found on the ground. It was a branch of a tree that was\n                            cut and was being left there. The length of the wood is about a foot and\n                            it was not that heavy. Having picked up that wood, I saw Galing was\n                            about to strike one of the male Chinese with his belt in his hands. The\n                            other male Chinese ran and I chased after him. Halfway running, I gave\n                            up and turned back towards Galing who was wrestling with the other male\n                            Chinese. Both of them were standing facing each other and were\n                            struggling. I came from behind and joined Galing to attack the male\n                            Chinese. On seeing this, Galing broke free from the said male Chinese\n                            and retreated few steps behind. I then swung the wood towards the head\n                            of the male Chinese. I am not sure I swung it at the back of the front\n                            of his head. Upon being struck by the wood, he fell to the ground facing\n                            up. Galing then hit him with the belt buckle on the head and I could see\n                            blood coming out from the head. I then swung the wood on the head again.\n                            After that, I ran and crossed the road towards Lorong 4. Whilst running,\n                            I threw the wood on the ground and I did not turn back. I ran through\n                            the back lanes and reached a coffee shop at Lor 24. I wish to say that\n                            Vencent had called me that they were waiting for me there. and that Galing sold the handphone to Vencent for $300, and each\n                    of them received $50 from the proceeds.",
        "Cautioned statement of 27 February 2008": "15     A cautioned statement was recorded from Jabing\n                    in response to a charge of murder of the deceased in further of a common\n                    intention of him, Vencent, Galing, Alan and an unknown person. Jabing’s\n                    statement was: I have no intention of killing the victim. My intention is only to rob\n                        him. After I had reached Kallang MRT, the 5 of us walked and looked out for\n                        victims that is easy to rob. About half an hour later, we met the victim. At\n                        that time, I and the rest, followed the victim from behind. After that, I\n                        and ‘Galing’ followed the victim. The 3 remained behind. When we\n                        reached at the place of the incident, me and ‘Galing’ attack\n                        victim. After I had hit victim twice, I ran off. When I was running away, I\n                        noticed ‘Galing’ was still behind hitting the victim, using his\n                        belt. ‘Galing’ had taken the victim’s handphone.",
        "Investigation statements recorded on 4, 7 and 13 March\n                2008": "16     SSI Zainal recorded the investigation\n                    statements from Jabing on 4, 7 and 13 March 2008 with the help of the Malay\n                    interpreter, Marriana. These statements form parts of a continuing\n                    narration. 17     Jabing recounted that when the robbery at\n                    Tiong Bahru was aborted, Anthony suggested to the rest of the group that they go\n                    to Geylang to rob because there was an open field opposite Lorong 4 which was an\n                    ideal place for a robbery as it was dark and secluded. 18     Jabing then referred to the events leading to\n                    the attack. He stated: 3    I wish to add that when the robbery plan at Tiong\n                            Bahru failed, Anthony was the one who suggested that all of us go to\n                            Geylang to rob. He told us that he knows of a place where many vehicles\n                            are park and there is an open field. Anthony had suggested that we only\n                            targeted victim walking towards the open field opposite Lor 4. Anthony\n                            added that this place is an ideal place to rob since it is dark and\n                            secluded. When Anthony said this, Vencent, Galing, Alan and I were still\n                            at the multi-purpose hall at Tiong Bahru. All of us agreed to his idea.\n                            I decided to join them since I was drunk and I needed money\n                        too. 4    ... When we arrived at Kallang, the five of us\n                            walked together towards Lor 4. I am familiar with Lor 4 Geylang since I\n                            have been there many times. The five of us loitered around Lor 4 to look\n                            for a suitable victim to rob. What I meant a suitable victim is, a\n                            person walking alone or in twos. We targeted foreigners immaterial of\n                            their nationalities. Since there were five of us, we can outnumber any\n                            foreigners walking in small group. 5    ... I was walking behind Galing along the main road\n                            beside Lor 4. Vencent, Alan and Anthony were walking inside Lor 4 and we\n                            were walking in parallel position. There is a green fencing that\n                            separates the three of them and both of us. Galing spotted 2 male\n                            Chinese crossing the road and signalled to me. I saw 2 male Chinese\n                            crossing the road towards the open field. On seeing this opportunity\n                            that we were looking for, I crossed the road behind Galing. I caught up\n                            with Galing at the centre road divider and both of us then crossed the\n                            road together. I did not turned back to look at Vencent, Alan and\n                            Anthony. I now draw the sketch of the place and the event that took\n                            place that day. 6    Like I have stated in my earlier statement, soon\n                            after Galing and I crossed the road to the open field, I picked a wood\n                            which I found on the ground. When I looked up, I saw a smaller built\n                            victim was running away and I started to chase him. By then Galing had\n                            started to hit the other male Chinese who is bigger built. I gave up the\n                            chase and turned around to help Galing who was by then was struggling\n                            with the said male Chinese. I came from behind and used the wood that I\n                            was holding on the head of the bigger built male Chinese. I am not sure\n                            whether I swung it hard or not since I was drunk. The single blow on the\n                            head by me caused the said male Chinese to fall onto the ground facing\n                            up. Galing then used his belt with the buckle of star shape and hit that\n                            person. I am not sure how many times Galing hit that man. Whilst the\n                            said man was already lying face up, I was standing on his right side, I\n                            swung the wood that I was holding onto his head one more time. I am not\n                            sure of the force of the blow onto his head this second time as I was\n                            drunk. As I was about to run, I threw the wood that I was holding. I\n                            turned around and saw Galing was searching the pockets of the victim who\n                            was lying on the ground.",
        "Wu Jun’s evidence": "19     Wu Jun was a construction worker from China.\n                    The deceased was from his same village in China. On 17 February 2008, the\n                    deceased had visited him. They had dinner, and when it was time for the deceased\n                    to return to his lodging, Wu Jun accompanied him to the Kallang MRT\n                    station. 20     As they were walking along a paved pathway at\n                    the open field, he was hit at the back of his head by something hard like a\n                    metal object. (He was subsequently brought to Tan Tock Seng Hospital for\n                    treatment and was found to have a left ear laceration and abrasions in the\n                    temporal region of his head.) He ran a few steps forward, turned round and saw a\n                    male person wearing a cap coming towards him in a menacing manner with a\n                    clenched fist, and he carried on running as fast as he could. He heard the\n                    deceased groaning in pain. However, he did not know whether he or the deceased\n                    was attacked first, how the deceased was attacked or who attacked the\n                    deceased. 21     After running about forty steps he stopped. He\n                    called for the police on his handphone and retraced his steps along the\n                    pavement. He found the deceased lying unconscious on the grass alone. The\n                    deceased had blood on his face and was vomiting blood. Wu Jun noticed that the\n                    deceased’s handphone which was usually kept in his waist pouch was\n                    missing.",
        "The deceased’s injuries": "22     The deceased was brought from the scene of the\n                    attack to the Accident and Emergency Department of Tan Tock Seng Hospital.\n                    Dr Ho Chi Long (“Dr Ho”), the physician who saw the\n                    deceased and operated on him certified that on admission, the deceased was in a\n                    deep coma and had facial injuries. The deceased had sustained life threatening\n                    injuries. CT scans revealed several depressed skull fractures including multiple\n                    comminuted, displaced and depressed fractures involving the frontal, bilateral\n                    parietal and occipital bones with fractured ethmoid septae, and swelling of the\n                    brain. He underwent surgery on that day, and further surgery on the following\n                    day, but he did not recover and died on 23 February 2008. Dr Ho was of\n                    the view that the primary cause of death was the severe head\n                injuries. 23     Dr Ho was unable to tell if the head\n                    fractures were caused by a blunt or a sharp instrument, but they were caused by\n                    a huge force that could have come from several blows. In answer to a question\n                    from Mr Chandra Mohan, counsel for Galing, Dr Ho stated that it was\n                    impossible for the injuries to have been sustained from a fall from a standing\n                    position. In response to a question from Mr Johan, counsel for Jabing,\n                    Dr Ho could not say whether the head injuries could have been sustained by\n                    the deceased falling forwards after being hit from behind. 24     Pathologist Dr Teo Eng Swee\n                    (“Dr Teo”) performed the autopsy on the deceased. In his\n                    autopsy report[note: 5]he noted\n                    that there were fourteen fractures of the skull with three areas of severe\n                    haemorrhage, and that the brain was soft and severely oedematous (swollen).\n                    Dr Teo certified the cause of death to be severe head injury. 25     Dr Teo explained that the severe head\n                    injury recorded in his autopsy report did not refer to the fractures of the\n                    skull. The fractures by themselves were not the fatal injury. The fatal injury\n                    was the injury to the brain. The brain was very swollen, and the swelling\n                    decreased the flow of blood and oxygen to the brain. The lack of oxygen supply\n                    to the brain is known as hypoxia. The swelling of the brain also caused it to\n                    shift position in the skull, and that is known as herniation. The hypoxia and\n                    the herniation together with brain contusions and brain haemorrhage made up the\n                    severe head injury, and the injury was sufficient in the ordinary course of\n                    nature to cause death. 26     Dr Teo was of the opinion that the skull\n                    fractures could have been caused by five impacts or more, and that one fracture\n                    could have resulted from a blow or a fall on the back of the head, and that the\n                    initial fragmentation of the skull required severe force, but when the skull was\n                    fractured, the further fractures could be caused by less severe\n                force. 27     The prosecutor showed Dr Teo the belt and\n                    buckle that Galing used in the assault, and sought Dr Teo’s\n                    assistance to make connections between the buckle and the deceased’s\n                    injuries, but Dr Teo was cautious and declined to draw any\n                    conclusions. 28     When Dr Teo was informed of\n                    Galing’s account in his statement that a severed tree branch about two\n                    feet long was used by Jabing to strike at the deceased, Dr Teo agreed that\n                    such a weapon was capable of causing the injuries that were found on the\n                    deceased’s skull. 29     When Mr Johan sought to get Dr Teo\n                    to develop on his conclusion that one of the fractures may have been the result\n                    of a fall, Dr Teo put the matter into context and explained that: I do not rule out definitively that this fracture ... is due to a fall,\n                        but taking the injuries that I see in totality and not [that fracture] in\n                        isolation, the injuries are due to blunt force.[note: 6] and he clarified in re-examination that a fall could not cause all the\n                    fractures that were sustained. 30     The accused persons’ statements and the\n                    medical evidence was the core of the prosecution’s case. 31     Neither counsel submitted that there was no\n                    case for his client to answer. When I called on both accused persons to enter\n                    their defence both of them gave evidence, but did not call any\n                witnesses.",
        "Defence of Galing": "32     Galing is 25 years old and he had come to\n                    Singapore to work. He helped to load oil onto ships. 33     He relied on his statements as his defence.\n                    His defence was that he did not cause the death of the deceased and that the\n                    death was not caused in the furtherance of the common intention of him and\n                    Jabing. He began his evidence saying that he had borrowed the belt that he wore\n                    and used from Anthony on the morning of 17 February 2008. 34     He then recounted that Vencent had proposed\n                    robbing two Bangladeshis who had just received their salary. He agreed, and went\n                    to Tiong Bahru with Anthony. At Tiong Bahru they met up with Vencent, and\n                    subsequently Jabing and Alan joined them. The five of them had bought and drank\n                    ginseng liquor after the robbery was called off. After they had their drinks, he\n                    told the others that he was going to continue drinking with his friends in\n                    Geylang, and the others agreed to go to Geylang with him. 35     They went from Tiong Bahru by the MRT to the\n                    Kallang MRT station. Upon arrival at the Kallang MRT station, they proceeded to\n                    Lorong 4 Geylang. He first went to a hotel, the Yunnan Hotel, to change into\n                    fresh clothes that were kept there. He then rejoined the group and told the\n                    others that he was going to Lorong 12 to have drinks with friends there, and\n                    they went on together towards Lorong 12. Along the way, they split into two\n                    groups. He and Jabing were walking along a higher stretch of the road, and the\n                    other three were walking along a lower stretch. 36     After he and Jabing passed an overhead bridge,\n                    Jabing crossed the road. He followed Jabing, and when they were on the middle\n                    road divider, he asked Jabing where he was going, and Jabing told him that he\n                    wanted to rob two Chinese men who were on the other side of the road. He told\n                    Jabing not to do that, but Jabing ignored him and continued to cross the\n                    road. 37     Galing was still on the road divider when he\n                    saw Jabing pick up something from the ground and went towards the two Chinese\n                    men, and hit one of them. The other Chinese man wanted to fight with Jabing.\n                    Galing took off his belt and went to Jabing’s assistance. He rolled up the\n                    belt in his left hand, and hit one of the Chinese men once at the back part of\n                    his body, and that man ran away and Galing chased him. (Galing confirmed in\n                    court that that person was Wu Jun). When Galing failed to catch up with Wu Jun,\n                    he retraced his steps. As he came to the deceased who was seated and was getting\n                    up, he hit the deceased on the area of the chest but he did not think that it\n                    could cause serious injury or death to the deceased. After hitting him, he\n                    noticed the deceased’s handphone and he took it. In the meantime, Jabing\n                    was chasing after Wu Jun who had apparently returned to the scene. 38     He went on to Lorong 12 to look for the\n                    friends he intended to meet, but did not find them. Subsequently, he joined the\n                    other members of the group at a coffee shop at Lorong 24. He showed the\n                    handphone to the others, and Vencent paid him $300 for it. With the $300, he\n                    paid $50 to each member of the group and left the remaining $50 to pay for the\n                    food and drinks they were having. 39     During cross-examination he qualified parts of\n                    his statements relating to his taking of the deceased’s handphone and\n                    Jabing’s assault on the deceased. When Mr Johan questioned him on his\n                    cautioned statement where he stated “... I saw him [Jabing] hitting the\n                    Chinese man several times and his head cracked open” he gave inconsistent\n                    answers. He said “As far as I can recall, I did not say\n                        that”[note: 7]and “The IO told me that the\n                    person was already dead. I was frightened ... so I said all these\n                        things.”[note: 8] 40     More inconsistencies were to follow when he\n                    was cross-examined by the prosecutor. He admitted that he took the\n                    deceased’s handphone but said that it was on the ground. When it was\n                    pointed out to him that he had stated in his cautioned statement “While\n                    the Chinese man was holding his head, I took a handphone from his waist\n                    pouch” his explanation was “... I was frightened and I was told by\n                    the officer that I must cooperate. That is why I said this in my\n                    statement” and “It was a suggestion made by the IO. I merely\n                    agreed to the suggestion.”[note: 9] 41     Galing had stated on three occasions in his\n                    statements that he had taken the handphone from the deceased’s waist or\n                    waist pouch.[note: 10]He did not offer any reason for insisting in\n                    court that it was on the ground when he took it. In any event, the legal\n                    character of his action was similar whether the handphone was taken from the\n                    deceased’s waist, or from the ground after the deceased dropped it during\n                    the assault. 42     When Galing persisted that he had seen Jabing\n                    hit the deceased once, the prosecutor referred him to his first\n                        statement[note: 11]where he\n                    had stated “... Jabing used the wood to hit on the male Chinese who has a\n                    bigger built on his head” and “... I saw the bigger size male\n                    Chinese try to run but Jabing continue to beat him” and to his cautioned\n                    statement which recorded that “I saw him hitting the Chinese man several\n                    times and his head cracked open” and his investigation\n                        statement[note: 12]that “Jabing who was hitting the other Chinese with the wood in his hands\n                    repeatedly ...”. 43     Galing’s explanation was that: I told the IO that Jabing hit the deceased only once but the IO told me,\n                        “How can one strike result in the head being cracked open?” So\n                        I had to tag along with him and say that Jabing hit the deceased several\n                            times.[note: 13] When the prosecutor also referred him to another part of his\n                    investigation statement[note: 14]where it\n                    was recorded “I gave up the Chinese and turned back towards Jabing who\n                    was hitting the other Chinese with the wood in his hands repeatedly ...”\n                    he gave a similar explanation that “... I did say this in my statement\n                    but I also remember the IO saying that it must be several blows. But I recall\n                    ... seeing Jabing hitting only once.”[note: 15] 44     In the course of cross-examination by the\n                    prosecution, Galing agreed that he should proceed along the side of Sims Way\n                    that he was on to go to Lorong 12, and that when he crossed Sims Way and went\n                    onto the open ground as he did, he was going out of the way.[note: 16] 45     In re-examination by his counsel, Galing added\n                    confusion to the matters. He stated that no one had suggested the use of\n                    “continue” in his first statement[note: 17]and that the recording officer SSI Razali\n                    was not involved in the use of the word.[note: 18] 46     No issue on the accuracy of the recording and\n                    interpretation of the statements were raised when the statements were admitted\n                    into evidence during the prosecution’s case. After they were raised in the\n                    course of defence case, Mr Chandra Mohan applied for three officers SSI\n                    Razali, who recorded the first statement, SSI Zainal, who recorded the\n                    investigation statements and Marriana, the Malay interpreter who assisted SSI\n                    Zainal in the recording of the investigation statements, to be recalled for\n                    further examination, and they were recalled. 47     Counsel put to them Galing’s allegations\n                    on the recording of the statements, but they rejected each allegation and\n                    maintained that the statements faithfully and accurately recorded what Galing\n                    had said. I accepted their evidence.",
        "Defence of Jabing": "48     Jabing is 24 years old and is from Sarawak. He\n                    was working in Singapore for akarung gunicompany. 49     He did not dispute the admissibility and the\n                    accuracy of his statements which were admitted in evidence. When he gave his\n                    evidence in chief, he kept to his statements and elaborated on parts of his\n                    account of the events. Notably, he said that after he consumed the ginseng\n                    liquor with his friends at Tiong Bahru, he was ‘high’. Nevertheless,\n                    he confirmed that the group had gone to Geylang to rob and that he and Galing\n                    had trailed the two Chinese (i.e. Wu Jun and the deceased) because they wanted\n                    to rob them. He confirmed that he had picked up a tree branch about a foot long,\n                    but he could not explain why he did that. 50     His evidence on his assault of the deceased\n                    was that he hit the deceased on the head, but he did not know the force he used,\n                    or the part of the head he hit because he was drunk. He also said that he had\n                    not aimed for the deceased’s head because his mind was blank and it just\n                    happened that he hit the head. He recalled that when the deceased fell, and\n                    turned his body to face upwards, he hit the deceased again, but he cannot\n                    remember where the second hit landed. Jabing maintained that he had no intention\n                    to hit the deceased on the head, and did not intend to kill him. Mr Chandra\n                    Mohan questioned him on the involvement between him and Galing in the assault.\n                    Jabing agreed that there was no planning on the execution of the robbery, no\n                    agreement on the location of the robbery or the division of functions, no common\n                    intention on the use of weapons, and no common intention to assault or\n                    kill. 51     When the prosecutor cross-examined him, Jabing\n                    was unable to explain why he followed Galing when he crossed the road. He\n                    acknowledged when he trailed the victims, he intended to rob them. He claimed\n                    that his intention was to punch the victims, but when he saw the branch, he\n                    “just took it”. He also agreed that he did not gave the deceased\n                    any forewarning of his approach, and had not issued any threats before he hit\n                    him. He also maintained that he did not aim for the deceased’s head when\n                    he struck, and it was only when the deceased fell to the ground holding his head\n                    that he realised he had struck the deceased’s head.",
        "Evaluation of the evidence": "52     In every case, there will be disputes over\n                    some facts. The disputes may arise between the prosecution and the accused\n                    persons or between the accused persons themselves. Some areas of disputes could\n                    be material, and others less so, depending on the circumstances of the case. In\n                    this case, there are two areas of dispute that are material and have to be\n                    addressed.",
        "Whether there was a common intention to rob the deceased": "53     Jabing admitted that he and Galing had spotted\n                    Wu Jun and the deceased and they had intended to rob them, but Galing denied\n                    that he had any intention to rob. He admitted that he had intended to rob the\n                    two Bangladeshis in Tiong Bahru. When that was aborted, he went with his friends\n                    to Geylang with the intention to seek out other friends in Lorong 12 and to\n                    drink with them. He did not want to rob the two Chinese men, and had told Jabing\n                    not to do it, but was nevertheless drawn into the events that\n                followed. 54     I did not accept Galing’s explanation\n                    because: (i)     he was prepared to rob, and had\n                        intended to do that in Tiong Bahru; (ii)     his claim that he was on the way to Lorong 12 was\n                        inconsistent with his action because he should not have crossed Sims Way and\n                        gone onto the open field if he wanted to proceed to\n                    Lorong 12; (iii)     he knew that Jabing was going to rob, and he stayed on with Jabing and\n                        assisted him in attacking the victims; (iv)     he completed the robbery by taking the\n                        deceased’s handphone; and (v)     he shared the proceeds on the sale of the handphone with\n                        Jabing and the others. These facts showed that he was a\n                    willing participant in the robbery with Jabing.",
        "Whether Galing and Jabing knew that death was likely to be\n                caused": "55     The evidence of Dr Teo indicated that the\n                    deceased’s death resulted from the head injuries. Although Galing did not\n                    inflict those injuries, he saw Jabing picking up the tree branch. He also armed\n                    himself with the belt buckle which he used as a weapon. It was clear that Galing\n                    and Jabing intended to use their weapons in the robbery because they did not\n                    seek to obtain the victims’ possessions by demand or the threat of\n                    violence, but had proceeded immediately to use their weapons on them. Their\n                    intention was to rob their victims by the use of force. It was telling that\n                    Galing had not said in his statements and his evidence that he was surprised\n                    when Jabing held the branch in both hands and struck the deceased with it. I\n                    find that Galing knew that when he and Jabing robbed the deceased, the deceased\n                    would be assaulted and serious injuries might be inflicted on him. 56     In the case of Jabing, he admitted in his\n                    first statement of 26 February 2008[note: 19]that he swung the branch towards the head\n                    of the deceased. He also recalled in his investigation statement[note: 20]that the single blow\n                    caused the deceased to fall onto the ground. Galing, his accomplice, recalled in\n                    his cautioned statement[note: 21]that the\n                    deceased’s head cracked open when Jabing hit him on the head. In his\n                    investigation statement, Galing had also narrated that Jabing had beaten the\n                    deceased so badly that he could have died.[note: 22] 57     Jabing’s narration of the events showed\n                    that he was not so drunk that he did not know or remember his actions, and he\n                    knew what he was doing. In any event, he could not plead drunkenness as a\n                    defence because s 85(2) of the Penal Code (Chapter 224, 2008 Rev Ed)\n                    stipulates that: Intoxication shall be a defence to any criminal charge if by\n                        reason thereof the person charged at the time of the act or omission\n                        complained of did not know that such act or omission was wrong or did not\n                        know what he was doing and – (a) the state of intoxication was caused without his consent by the\n                            malicious or negligent act of another person; or (b) the person charged was, by reason of intoxication, insane,\n                            temporarily or otherwise, at the time of such act or omission. and he had not satisfied conditions (a) or\n                (b). 58     Against this background, I find that: (i)     the two accused persons had the\n                        common intention to commit robbery; (ii)     each of them knew that it was likely that serious injury\n                        might be inflicted on the victims in the course of the\n                    robbery; (iii)     that\n                        Jabing intentionally inflicted head injuries on the deceased;\n                    and (iv)     the injuries\n                        inflicted were sufficient in the ordinary course of nature to cause death\n                        and did cause the deceased’s death.",
        "Whether Galing and Jabing had the necessary common intention under\n                s 34 of the Penal Code": "59     The law relating to common intention and\n                    s 34 was thoroughly reviewed by the Court of Appeal inLee Chez Kee v PP[2008] 3 SLR(R) 447. In the leading\n                    judgment, V K Rajah JA concluded in the “Summary of the correct\n                    interpretation of section 34 of the Penal Code” that: 253    Thus, I can now summarise what I\n                        regard as the correct interpretation of s 34 of the Penal Code, taking\n                        into account the typical requirements to make s 34 of the Penal Code\n                        applicable, viz, (a) a criminal act; (b) participation in the doing of the\n                        act; (c) a common intention between the parties; and (d) an act done in\n                        furtherance of the common intention of the parties: (a)     Criminal act: Section 34 does not\n                            refer to the actual crime committed only. It is essential to realise\n                            that the expression \"criminal act\" is not synonymous with \"offence\" as\n                            defined in s 40 of the Penal Code. (b)     Participation: Presence at the scene\n                            of the criminal act, primary or collateral, need no longer be rigidly\n                            insisted on for s 34 of the Penal Code to apply. In a \"twin crime\"\n                            situation [eg robbery and murder], there is no need for participation in\n                            the collateral criminal act as well as the primary criminal act;\n                            participation in the primary criminal act would be sufficient for\n                            liability to fix on all subsequent secondary offenders. The crux of the\n                            section is participation, and presence may or may not provide the\n                            evidence for participation; this is a question of fact to be decided in\n                            each case. (c)     Proving the common intention: To\n                            prove the common intention between the parties, inferences must be made\n                            from the circumstances of the case to show that the criminal act was\n                            committed in furtherance of a pre-arranged plan such as the conduct of\n                            the parties, the weapons used and the nature of the wounds inflicted.\n                            However, such inferences should never be made unless it was a necessary\n                            inference deducible from the circumstances of the case. All the\n                            circumstances, including antecedent and subsequent conduct, are relevant\n                            in inferring the common intention of all involved. (d)     In furtherance of the common\n                            intention: There is no need for the common intention of the parties to\n                            be to commit the offence actually committed in a \"twin crime\" situation,\n                            otherwise the words \"in furtherance\" would be superfluous. The Mimi Wong\n                                [Wong Mimi & Anor v PP[1971-1973] SLR(R) 412]approach to the interpretation of\n                            s 34 of the Penal Code is justified by the historical underpinnings\n                            of the Indian Penal Code and the doctrine of common purpose in English\n                            law. The additional mens rea required of the secondary offenders is that\n                            of a subjective knowledge on the part of the secondary offender in\n                            relation to the likelihood of the collateral offence happening. To be\n                            more precise, the secondary offender must subjectively know that one in\n                            his party may likely commit the criminal act constituting the collateral\n                            offence in furtherance of the common intention of carrying out the\n                            primary offence. There is no need to have known of the actual method of\n                            execution in a murder situation. While the common intention of Galing and Jabing was to\n                    rob, and not to kill, they knew that there was the likelihood that serious\n                    injury might be inflicted.",
        "Whether murder was committed in furtherance of the common\n                intention": "60     Was the common intention sufficient to support\n                    a charge of murder? Section 300 of the Penal Code states that: Except in the cases hereinafter excepted culpable homicide is\n                        murder — (a)   if the act by which the death is caused is done\n                            with the intention of causing death; (b)   if it is done with the intention of causing such\n                            bodily injury as the offender knows to be likely to cause the death of\n                            the person to whom the harm is caused; (c)   if it is done with the intention of causing\n                            bodily injury to any person, and the bodily injury intended to be\n                            inflicted is sufficient in the ordinary course of nature to cause death;\n                            or (d)   if the person committing the act knows that it is\n                            so imminently dangerous that it must in all probability cause death, or\n                            such bodily injury as is likely to cause death, and commits such act\n                            without any excuse for incurring the risk of causing death, or such\n                            injury as aforesaid. The intention to cause death specified in limb (a) and the\n                    knowledge of the likelihood of death specified in limb (b) are not\n                there. 61     However, the prosecution was putting its case\n                    under limb (c). This effect of s 300(c) of the Penal Code is settled law.\n                    Thelocus classicusis the decision of the Supreme\n                    Court of India inVirsa Singh v State of PunjabAIR 1958 SC 464 where Bose J reviewed the elements of the provision and\n                    declared at [12]: First, it must establish, quite objectively, that a bodily injury is\n                        present; Secondly, the nature of the injury must be proved; These are purely\n                        objective investigations. Thirdly, it must be proved that there was an intention to inflict that\n                        particular bodily injury, that is to say, that it was not accidental or\n                        unintentional, or that some other kind of injury was intended. Once these three elements are proved to be present, the enquiry proceeds\n                        further and, Fourthly, it must be proved that the injury of the type just described\n                        made up of the three elements set out above is sufficient to cause death in\n                        the ordinary course of nature. This part of the enquiry is purely objective\n                        and inferential and has nothing to do with the intention of the\n                        offender. and at [16] that: The question is not whether the prisoner intended to inflict a serious\n                        injury or a trivial one but whether he intended to inflict the injury that\n                        is proved to be present. If he can show that he did not, or if the totality\n                        of the circumstances justify such an inference, then, of course, the intent\n                        that the section requires is not proved. But if there is nothing beyond the\n                        injury and the fact that the appellant inflicted it, the only possible\n                        inference is that he intended to inflict it. Whether he knew of its\n                        seriousness or intended serious consequences, is neither here nor there. The\n                        question, so far as the intention is concerned, is not whether he intended\n                        to kill, or to inflict an injury of a particular degree of seriousness but\n                        whether he intended to inflict the injury in question; and once the\n                        existence of the injury is proved the intention to cause it will be presumed\n                        unless the evidence or the circumstances warrant an opposite\n                        conclusion. His analysis has been affirmed and applied by our Court of Appeal in a\n                    succession of cases, the most recent beingPP v Lim Poh\n                        Lye[2005] 4 SLR(R) 582. 62     Jabing had struck the deceased on the head in\n                    order to rob him. Jabing held the branch in both hands and swung it at the\n                    deceased’s head with such force that Galing saw his head crack open.\n                    Dr Teo found that the head injuries inflicted on the deceased were\n                    sufficient in the ordinary course of nature to cause death, and he certified the\n                    injuries to be the cause of death. Jabing’s actions fell within\n                    s 300(c).",
        "Conclusion": "63     I find Galing and Jabing to be guilty of the\n                    charge against them. They are convicted and sentenced to suffer the mandatory\n                    death penalty.  [note: 1]P136 [note: 2]P137 [note: 3]P147, P148 and P150\n                respectively [note: 4]P145 [note: 5]P118 [note: 6]Notes of\n                                    Evidence 23 July 2009 page 61 lines\n                            9–11 [note: 7]Notes of Evidence 27 July 2009 page 41\n                                line 17 [note: 8]Notes of Evidence 27 July 2009 page 41\n                                lines 24–25 [note: 9]Notes of\n                                Evidence 27 July 2009 page 52 lines 16–18 and line\n                            26 [note: 10]P136 para 2, P137, P147 para\n                            16 [note: 11]P136 [note: 12]P148 para 16 [note: 13]Notes of Evidence 28 July 2009\n                                    page 41 lines 1–3 [note: 14]P148 [note: 15]Notes of\n                                Evidence 29 July 2009 page 15 lines\n                        28–29 [note: 16]Notes of Evidence 28 July 2009 page 11 lines 5–7,\n                                17–21 [note: 17]P136 para\n                                2 [note: 18]Notes of\n                                Evidence 29 July 2009 page 41 lines 7–8,\n                            18–19 [note: 19]P145 para\n                                5 [note: 20]P149 para 6 [note: 21]P137 [note: 22]P147 para\n                                17"
    }
}