{
    "case_title": "Chan Cheng Wah Bernard and others\n      v\n      Koh Sin Chong Freddie",
    "ncitation": "[2010] SGHC 324",
    "coram": "Judith Prakash J",
    "sections": {
        "Introduction": "1       This defamation action arose out of events that\n                    took place in the Singapore Swimming Club (“the Club”) between\n                    November 2007 and the end of November 2008. 2       The Club is run by a management committee\n                    consisting of members who have been elected to various posts by the members at\n                    the Annual General Meeting (“AGM”). Each management committee\n                    holds office for a period of one year from one AGM to the next. The plaintiffs\n                    were members of the management committee that was in office during the period\n                    from May 2007 to May 2008 (“the previous MC”). During the term of\n                    the previous MC, the first plaintiff held the position of President of the Club,\n                    the second plaintiff was the Vice-President and the third and fourth plaintiffs\n                    were, respectively, the Treasurer and Facilities Chairman. 3       At the elections held during the AGM held in May\n                    2008 (“the 2008 AGM”), the defendant was elected as President and\n                    a slew of new persons were elected as members of the 2008/2009 management\n                    committee (“the current MC”). Only one member of the previous MC\n                    was re-elected. The defendant was re-elected as President for a further year in\n                    May 2009 and he held this position during the course of the proceedings before\n                    me. 4       The plaintiffs’ case is that libellous\n                    statements concerning them were published in the minutes of the meetings of the\n                    current MC held on 29 October 2008 and 26 November 2008. These minutes\n                    were posted on the Club’s notice board. The defamatory allegations\n                    complained of are as follows: First set of defamatory allegations published on 29\n                            October 2008 (“the First Statement”) President suggested that MC should correct the misrepresentation of facts\n                        made by the previous MC to influence the ratification of the expenditure at\n                        the last AGM. Second set of defamatory allegations published on\n                            26 November 2008 (“the Second\n                        Statement”) (c)    From the foregoing,\n                            President summarized the Treasurer’s findings as\n                        follows: •That the Club did not need a new water\n                                system to rectify the breakdown of the then existing filtration\n                                system which led to the shutdown of the competition\n                            pool. •After the installation of the new water\n                                system it was found that the filtration pumps needed to be replaced\n                                as the backwash water was still dirty. When the filtration pumps\n                                were changed, they worked perfectly and the water was\n                            clear. •The Club had purchased the new water\n                                system without budget approval. •Therefore it appeared that the justifiable\n                                emergency spending was to replace the filtration pumps at $42K and\n                                that would rectify the pool water in the 2 pools and Jacuzzis. The\n                                new water system at $168K was a ‘nice to have’ feature\n                                and the capital expenditure spent to install the system without\n                                budget approval was unwarranted. •It could be a case of misrepresentation of\n                                facts to the AGM to get ratification for a capital expenditure for a\n                                water system that could not be justified under the urgent/emergency\n                                reason. The new water system was only an add-on system as the\n                                current filtration was still the same as before and there was still\n                                a need to replace the pumps. 5       The defendant denies that the words complained\n                    of bear the defamatory meanings ascribed to them by the plaintiffs. In the\n                    alternative, he seeks to justify those allegations and, in the further\n                    alternative, to rely on qualified privilege.",
        "The background": "6       The Club, which is over 100 years old, prides\n                    itself on being a premier swimming club. One of the top priorities of each\n                    management committee is to ensure that the swimming facilities are in good\n                    condition. The Club has two large Olympic-size swimming pools, one a\n                    recreational pool and the other used mainly for serious training and\n                    competitions. The Club is also equipped with two Jacuzzis. 7       The general administration of the Club is under\n                    the charge of a general manager who reports to the management committee. In\n                    November 2007, the general manager was one Mr Richard Phua. 8       On 10 November 2007, the Club’s\n                    competition pool was closed by the general manager as there were complaints that\n                    the water in the pool had turned yellowish and that children using the pool had\n                    developed rashes. A special meeting of the previous MC was being held that day\n                    to consider matters relating to the upgrading of the area surrounding the\n                    competition pool and the general manager decided to table the issue of the pool\n                    water and the filtration system for discussion at the same\n                meeting. 9       The meeting started with a presentation by a\n                    company called The Water Consultant Pte Ltd (“TWC”) on a water\n                    system called the Natural Water System (“NWS”). The representation\n                    was given by one Mr Jeremy Rawle (“Mr Rawle”) and his\n                    wife, Ms Sylvia Chan. The meeting was informed that the NWS was an\n                    innovative and advanced technology which maintained water in its natural and\n                    neutral form without chemicals. TWC represented that the NWS could solve the\n                    filtration problem at the competition pool. After the presentation, Mr Phua\n                    informed the meeting that the only operational sand filtration tank serving the\n                    competition pool had become choked that morning and this had caused the water to\n                    change colour. The filtration tanks at the recreational pool were partially\n                    choked and would break down in a matter of months. As for the pumps, they were\n                    in need of an overhaul. 10     To solve the filtration problem, Mr Phua\n                    told the meeting that the Club could either choose to carry out conventional\n                    repairs,iesandblast the filtration tanks, or\n                    install the NWS. The cost of sandblasting was approximately $480,000 (this\n                    estimate was later reduced to $280,000) whilst TWC had offered the Club a\n                    special package price of $168,800 for its system. This price would include the\n                    NWS at both pools and the installation of another system, the mineral water\n                    system (“MWS”), at the Jacuzzis. 11     After considering the information presented,\n                    the previous MC was in favour of installing the NWS on the grounds of cost, the\n                    time that would be taken to get the competition pool back in use and the\n                    healthier swimming environment that the NWS would provide. The previous MC gave\n                    its in-principle approval to Mr Phua to install the NWS at a cost of\n                    $168,000. In the event, the contract when signed in December 2007 provided for a\n                    sum of $168,800. This figure which I will hereinafter sometimes refer to as\n                    “the expenditure” was, according to the contract, made up of the\n                    following components: (a)Mineral water system for the\n                                            Jacuzzis$18,800(b)Natural water system for the competition\n                                            pool$51,800(c)Pipe work modifications and waterproof\n                                            housing for the competition pool$13,000(d)Natural water system for the recreational\n                                            pool$51,800(e)Pipe work modifications and waterproof\n                                            housing for the recreational pool$14,000(f)On demand sanitizer controllers\n                                            (Auto-Dozers)plus stirrers plus tanks at $9,700 per\n                                            pool$19,400_______$168,800   12     The previous MC directed the general manager\n                    to ensure that due diligence was carried out before the contract was signed and\n                    to negotiate the best possible terms. No budget had been provided for the\n                    purchase of the NWS but the Club’s financial rules allowed a management\n                    committee, in case of an emergency, to authorise the expenditure required to\n                    resolve the emergency and to subsequently seek approval for the same from the\n                    members at the next AGM. The previous MC considered that the issue confronting\n                    it was of an emergency nature and therefore gave its in-principle approval for\n                    the expenditure on the NWS on the basis that the same had to be ratified later\n                    by the AGM. 13     The next meeting of the previous MC was held\n                    on 27 November 2007. The members of the previous MC were informed of the\n                    series of events that had, from April 2007, led to the breakdown of the\n                    filtration system of the competition pool. The general manager also briefed the\n                    previous MC on his actions in relation to due diligence in respect of the TWC\n                    proposal. 14     On 6 December 2007, the previous MC held\n                    another special meeting. Mr Phua briefed the meeting on follow-up action\n                    that he had taken in accordance with instructions given at the meeting of\n                    27 November 2007. The previous MC then gave its approval to Mr Phua to\n                    proceed to execute the contract with TWC. 15     Installation of the NWS took place thereafter.\n                    The competition pool was reopened on 11 January 2008. On 22 January\n                    2008, Mr Phua informed the previous MC that the installation of the system\n                    at the competition pool and the spas had been completed but that installation of\n                    the system at the recreation pool would be delayed as new pumps were required\n                    and would be installed in March 2008. 16     The 2008 AGM took place on 25 May. As the\n                    expenditure incurred on the systems supplied by TWC and the new pumps had not\n                    been provided for in the budget for the 2007-2008 budget year, these items were\n                    put up for members’ approval at the AGM as emergency expenditure.\n                    Apparently, the 2008 AGM was attended by more than 2,000 members though, since\n                    it spanned several hours, not all of them may have been present throughout the\n                    meeting. 17     The first plaintiff in his capacity as\n                    President explained to the meeting why there was a need to ratify the\n                    expenditure. The general manager also addressed the meeting on these items. Many\n                    questions were asked relating to whether the expenditure was justifiable and one\n                    of the members proposed that an audit committee (“the Audit\n                    Committee”) be appointed to conduct an independent review of the whole\n                    project before the expenditure was ratified. The motion proposed was: That Items 9(a), (b), (c) and (d) of the AGM Agenda be not ratified but be\n                        referred to the Special Ad Hoc Audit Committee for review of the whole\n                        process and project and be reported back to the Management Committee and\n                        Members within 3 months from date of the AGM The motion was carried with 210 members of the Club supporting it. It\n                    should be noted that of the four items mentioned, the latter two were unrelated\n                    to the matters involved in this case. 18     Elections for the management committee took\n                    place at the 2008 AGM and the plaintiffs, although they contested the election,\n                    were not re-elected. The defendant was elected as President of the current MC.\n                    Subsequently, the current MC appointed four members of the Club to serve on the\n                    Audit Committee established by the general meeting. 19     The Audit Committee duly carried out its\n                    investigations. It issued its report, the Audit Report, on 8 August 2008.\n                    In relation to the NWS, it concluded that the prescribed procedures had been\n                    followed and that the selection process in respect of the supplier was in order.\n                    It also found that the works done fell within the definition of\n                    “emergency”. As for the purchase of the pumps, the Audit Committee\n                    came to a similar conclusion. The Audit Report was given to the current MC but\n                    it was not released to the members generally at the time of its\n                issue. 20     Some time in the last week of August 2008,\n                    Mr Phua left the employ of the Club. Subsequently, a yellow file entitled\n                    “Water Consultants” was found in his office and handed to\n                    Mr Tan Wee Tin who held the post of Treasurer on the current MC. The\n                    material in the file caused Mr Tan and the defendant some concern regarding\n                    the representations that had been made to the 2008 AGM on the NWS. The defendant\n                    requested Mr Tan to look into the matter and report his findings to the\n                    current MC. 21     In September 2008, there were some discussions\n                    and correspondence between the current MC and the Audit Committee regarding\n                    whether the Audit Committee would wish to review the Audit Report in the light\n                    of the additional information and documents that had been found in the yellow\n                    file. At that stage, the Audit Committee did not seem inclined to do so. In the\n                    meantime, Mr Tan continued his investigation. 22     On 29 October 2008, at the monthly\n                    meeting of the current MC, Mr Tan reported his findings up to that stage on\n                    the issue of the purchase of the NWS. He provided the current MC members with a\n                    document setting out a summary of his findings. It was during the discussion on\n                    Mr Tan’s report, that the defendant made the remarks that were later\n                    reported in the minutes of the meeting as the First Statement. 23     The next monthly meeting of the current MC was\n                    held on 26 November 2008. In the meantime, Mr Tan had carried out\n                    further investigations. After Mr Tan completed a fairly lengthy report on\n                    his further findings, the defendant summarised his findings so that everyone\n                    understood what had been said. The discussions were subsequently paraphrased in\n                    the minutes of the meeting and the Second Statement appeared as part of what the\n                    defendant had said in the course of his summary. It should be noted that the\n                    minutes of both the October and the November 2008 management committee meetings\n                    were, when issued, posted on the Club’s notice board for all members to\n                    read, in accordance with the Club’s usual practice. 24     At the November 2008 meeting, the defendant\n                    suggested that Mr Tan’s findings should be set out in an addendum to\n                    the Audit Report which should be released to the members of the Club so that\n                    they could make an informed decision as to whether to ratify the previous\n                    MC’s expenditure of $168,800. This suggestion was accepted by the current\n                    MC. Subsequently in early May 2009, copies of the Audit Report together with the\n                    Addendum prepared by the current MC were made available to all members of the\n                    Club as part of the Notice of the 2009 AGM. At the AGM itself, the first\n                    plaintiff read out a written Response on the Report of the Audit Committee and\n                    the Addendum which was signed by a few members of the previous MC including the\n                    first, second and fourth plaintiffs. In the event, the expenditure was not\n                    ratified. 25     The above is a very brief summary of some of\n                    the events that are relevant to this action. I will go into more detail as and\n                    when it may be necessary in my discussion of the issues. 26     This action was started on 12 January\n                    2009 shortly after the publication of the minutes of the management committee\n                    meetings of 29 October and 26 November 2008.",
        "The issues": "27     From the pleadings, the issues that arise for\n                    determination are: (a)     Whether the First Statement and the\n                        Second Statement bear the meanings pleaded by the plaintiffs at,\n                        respectively, paragraphs 7 and 12 of the Statement of Claim and if so,\n                        whether these meanings are defamatory of the plaintiffs. (b)     If the First and Second Statements are\n                        found to bear the plaintiffs’ meanings or if they are found to bear\n                        some lesser meanings that are still defamatory of the plaintiffs, whether\n                        the defendant has justified the sting of the libel. (c)     If the defendant is unable to justify\n                        the meanings of the First and Second Statements, has he shown that they were\n                        made on an occasion of qualified privilege? (d)     Was the defendant actuated by malice in\n                        publishing the First and Second Statements so as to deprive him of the\n                        defence of qualified privilege?",
        "Meaning of the First and Second Statements": "28     In respect of both the Statements, the\n                    plaintiffs’ contention is that they are defamatory according to the\n                    natural and ordinary meanings of the words used. The legal principles applicable\n                    in determining meaning when the “natural and ordinary” meaning of\n                    a word or phrase is relied on have been laid down in several legal authorities.\n                    What follows is a paraphrase of these. The court is not confined to the literal\n                    or strict meaning of the words but has to decide what meaning they would have\n                    conveyed to an ordinary, reasonable person using his general knowledge and\n                    commonsense. The test is an objective one and the meaning intended by the maker\n                    of the defamatory statement is irrelevant. The court takes into account what the\n                    ordinary, reasonable person may reasonably infer from the words and bears in\n                    mind that such person would read between the lines. It is also important to have\n                    regard to the manner in which the words had been said and the surrounding\n                    circumstances. Where the words appear in a publication, the publication must be\n                    considered as a whole, including the circumstances in which the words are used,\n                    the prominence given to any headings and the nature of the publication. It is\n                    necessary to examine the context in which the words were used and if the words\n                    are capable of several meanings, the court should not select one bad meaning\n                    where other non-defamatory meanings are available. SeeLim\n                        Eng Hock Peter v Lin Jian Wei[2009] 2 SLR(R) 1004 at\n                    [81] to [91],Oei Hong Leong v Ban Song Long David[2005] 3 SLR(R) 608 at [22],Microsoft Corp v SM\n                        Summit Holdings Ltd[1999] 3 SLR(R) 465 andReview Publishing Co Ltd v Lee Hsien Loong[2010]\n                    1 SLR(R) 52. 29     The plaintiffs submitted, and I agree, that in\n                    the circumstances of this case where the statements were contained in the\n                    minutes of the Club’s management committee meetings and these minutes were\n                    published principally to Club members, the “ordinary reasonable\n                    person” would be one who was a member of the Club at the material time\n                    and who was interested in the affairs of the Club. I would therefore have to\n                    bear in mind what the ordinary reasonable and interested Club member’s\n                    general knowledge of the affairs of the Club would have been when the minutes\n                    were published. I will take the Statements in turn. 30     In paras 6 and 7 of the statement of\n                    claim, the plaintiffs pleaded that the First Statement referred to the\n                    plaintiffs by way of their office as members of the previous MC and, in its\n                    natural and ordinary meaning, meant and/or was understood to mean: (a)     That the plaintiffs had\n                        intentionally misrepresented to Club members that it was necessary to\n                        replace the water filtration system on the basis that it was urgent and/or\n                        an emergency in order to justify the expenditure and obtain the Club\n                        members’ ratification of the said expenditure at the 2008 AGM;\n                        and/or (b)     That the\n                        plaintiffs had not acted in the interests of the Club and had misused or\n                        abused the funds of the Club by the installation of a water filtration\n                        system which was unnecessary; and/or (c)     That the plaintiffs had acted improperly when they failed\n                        to comply with the proper procedures to obtain budget approval for the same,\n                        under the guise that it was necessary and/or an\n                emergency. 31     The defendant accepted that the First\n                    Statement means that in the course of seeking ratification for the expenditure\n                    of $168,800, inaccurate representations were made by the previous MC to the\n                    members of the Club. He did not accept that the First Statement also means that\n                    those misrepresentations were made intentionally by the previous MC. Instead, he\n                    said, the First Statement means: (a)     The plaintiffs had not acted in the\n                        interests of the Club and had misused or abused the funds of the Club by the\n                        installation of a water filtration system which was unnecessary;\n                        and/or (b)     The\n                        plaintiffs had acted improperly when they failed to comply with the proper\n                        procedures to obtain budget approval for the same under the guise that it\n                        was necessary and/or an emergency. 32     The defendant argued that just because the\n                    First Statement can reasonably be read to mean that the purpose of making the\n                    representations was to influence the ratification, it did not imply that the\n                    plaintiffs had deliberately made false representations. In the defendant’s\n                    view, the word “misrepresent” does not necessarily imply any\n                    deliberateness since a misrepresentation may be fraudulent, negligent or\n                    innocent. Further, someone may say something to influence a result but may have\n                    been mistaken. The assertion that representation was made for a specific purpose\n                    therefore does nothing to illuminate the mind of its maker. Agreeing that\n                    context was all important, the defendant made an analysis of the 29 October 2008\n                    meeting minutes and submitted that the reasonable reader would not have\n                    understood the defendant to be suggesting that the previous MC had deliberately\n                    misled the members. 33     Whilst the minutes themselves must be looked\n                    at, the analysis of the impression that the First Statement would have made\n                    cannot be confined to the context of the minutes. The context that must be\n                    regarded is the background to the discussion that took place during the meeting\n                    and the ordinary reasonable member’s knowledge of that\n                background. 34     The ordinary member would have known what had\n                    occurred during the 2008 AGM. It is not in dispute that the 2008 AGM had\n                    attracted a large turnout. During the meeting, the NWS was discussed on more\n                    than one occasion and both the first plaintiff and the general manager had\n                    addressed the meeting on the expenditure of $168,800 and the reasons for it.\n                    There had been a lively debate and the ordinary member who took an interest in\n                    the AGM would have known that the previous MC sought ratification for the\n                    expenditure which was unbudgeted and justified on the grounds of being an\n                    emergency. Such a member would also have known that instead of ratifying the\n                    expenditure, the meeting had decided to form the Audit Committee to review the\n                    entire process of approval by the previous MC and to make its report within\n                    three months. 35     When the minutes of the 27 August 2008\n                    management committee meeting were posted on the notice board, members would have\n                    learnt that the draft report of the Audit Committee had been circulated to all\n                    the current MC members at that meeting. They would have learnt from the minutes\n                    of the current MC meeting held on 24 September 2008 that the Treasurer had\n                    informed the Chairman of the Audit Committee that the documents and information\n                    furnished by the management to the Audit Committee might be incomplete and\n                    certain documents discovered after the general manager’s dismissal were\n                    now available to be considered. The current MC decided at that meeting to ask\n                    the Audit Committee to revisit the Audit Report in the light of the additional\n                    information. At the next meeting, the Treasurer had informed the current MC that\n                    the documents found in the general manager’s office indicated certain\n                    breaches of procedure in the acquisition of the new water filtration system. The\n                    minutes of the 29 October 2008 meeting recorded that the Treasurer was\n                    going to gather the Audit Committee for a meeting to revisit the audit and look\n                    into the newly discovered documents and information. The minutes also contained\n                    detailed information on the Treasurer’s investigations into the purchase\n                    of the NWS. 36     The plaintiffs submitted, and I agree, that\n                    from all this information, an objective member would have understood that as a\n                    result of the Treasurer’s investigation, the current MC had found\n                    something untoward in relation to the expenditure. In this context, on a plain\n                    and literal meaning of the First Statement, it would have appeared to the\n                    ordinary reasonable member that what was being implied was not innocent\n                    misrepresentation or a careless presentation of inaccurate facts by the previous\n                    MC. Instead the First Statement, read literally, meant that there had been a\n                    misrepresentation with a motive, specifically that the previous MC had made\n                    misrepresentations to the Club members to influence the ratification of the\n                    expenditure at the 2008 AGM. Therefore, the wording of the First Statement\n                    coupled with the background facts would have conveyed to the ordinary reasonable\n                    Club member the impression that the plaintiffs had lied in order to influence\n                    ratification of the expenditure. This is a defamatory meaning. 37     Turning to the Second Statement, in\n                    para 12 of the statement of claim, the plaintiffs pleaded that in its\n                    natural and ordinary meaning, the Second Statement bore the same defamatory\n                    meaning as the First Statement. The defendant took the position that the Second\n                    Statement was less serious than the First Statement for three reasons. First,\n                    there was no assertion that there had been any misrepresentation, only that it\n                    “could be” such a case. Second, the Second Statement did not\n                    attribute the misrepresentation to the previous MC. Third, in its proper\n                    context, the Second Statement appeared only as a summary of the\n                    Treasurer’s statements at the 26 November 2008 meeting of the current\n                    MC. Indeed, the Second Statement was a fair summary of what the Treasurer said\n                    and the presentation made by the Treasurer did not contain any accusation of\n                    deliberate misrepresentation on the part of the previous MC. 38     I do not accept the defendant’s\n                    position. I think it places undue emphasis on the words “could be”\n                    without due regard for the whole context including the report given by the\n                    Treasurer on 26 November 2008. This report, as the ordinary member would\n                    have known, was a report on the Treasurer’s continuing investigations into\n                    the expenditure. As noted in the minutes, the Treasurer mentioned some\n                    unsatisfactory features of the way in which the contract for the NWS had been\n                    signed and payment had been made. The Treasurer did not mention the word\n                    “misrepresentation” although he drew the current MC’s\n                    attention to the fact that the stated cost of $420,000 to sandblast the old sand\n                    filters which was printed in the 2008 AGM Booklet did not tally with the quoted\n                    repair cost of $280,000 mentioned in a notice to members dated 12 November\n                    2007. Then, the defendant summarised the Treasurer’s findings and,\n                    basically, said that the Club did not need a new water system, that it had\n                    purchased a new water system without budget approval and that the capital\n                    expenditure on this system was unwarranted. He was reported as having then gone\n                    on to say that this “could be a misrepresentation of facts to the AGM to\n                    get ratification for a capital expenditure for a water system that could not be\n                    justified under the urgent/emergency system”. 39     In my judgment, the Second Statement which is\n                    part of the defendant’s summary of what the Treasurer stated, in its\n                    natural and ordinary meaning was not speculating as to whether or not there had\n                    been a misrepresentation but was stating clearly that the previous MC had\n                    intentionally misrepresented the facts in order to have unwarranted expenditure\n                    ratified. In context, the phrase “could be” was mere verbiage and\n                    would not have changed the meaning that the reasonable member would have taken\n                    from the Second Statement. Though the Treasurer had not expressly alleged\n                    misrepresentation, his report indicated at least one instance where he\n                    considered that wrong information had been given to the members at the 2008 AGM.\n                    This may have led to the use of the word “misrepresentation” by\n                    the defendant but even if the defendant was making explicit what the Treasurer\n                    had implied, on the basis of what he understood the Treasurer to have said, that\n                    would not excuse the defendant from responsibility for his defamatory remarks.\n                    Although the Second Statement did not mention the previous MC by name, since the\n                    ordinary reasonable member would have known that it was the previous MC that\n                    wanted to obtain ratification for the expenditure, the Second Statement\n                    necessarily implied that it was the previous MC that had made the\n                    misrepresentation to the AGM. In coming to this finding, I am not ignoring the\n                    fact that the defendant did not actually voice the Second Statement at the\n                    meeting. Instead, the Second Statement was a printed paraphrase of his actual\n                    words. Since the defendant approved the minutes, however, he bears\n                    responsibility for the Second Statement. 40     I am satisfied that on their natural and\n                    ordinary meanings, the First and Second Statements bear the meanings imputed to\n                    them by the plaintiffs as pleaded in the statement of claim and set out in\n                    [30(a)] above.",
        "The defences": "",
        "Justification – particulars and law": "41     I now turn to the first defence of the\n                    defendant which is that the Statements were true. In para 29 of the\n                    defence, the defendant pleaded that insofar as the First Statement in its\n                    natural and ordinary meaning bore and/or was understood to bear the meanings set\n                    out in para 7 of the statement of claim, it was true in substance and in\n                    fact. In para 38 of the defence, the defendant pleaded that insofar as the\n                    Second Statement in its natural and ordinary meaning bore and/or was understood\n                    to bear the meanings set out in para 12 of the statement of claim, it was\n                    true in substance and fact. The defendant relied on the particulars set out in\n                    paras 27 and 28 of the defence to substantiate his assertions of the truth\n                    of both Statements. 42     The particulars of justification were as\n                    follows: (a)     The NWS and the Auto Dozers were not\n                        emergency purchases because: (i)       The NWS did not rectify\n                            and/or address the issue of the contamination of the competition pool\n                            that took place on or about 10 November 2007. (ii)       The problem with the\n                            contamination of the competition pool could have been rectified and/or\n                            dealt with by replacing one of the pumps serving the competition pool,\n                            which had broken down on or about 10 November\n                        2007. (iii)       After the installation of the NWS, the broken down pump serving the\n                            competition pool still needed to be replaced before the contamination\n                            problem was rectified and the pool was reopened for\n                        use. (iv)       The\n                            Auto Dozers which were purchased as part of the $168,800 NWS for both\n                            the Club’s swimming pools and which costs $9,700 each were not\n                            functional and had not been in use at all after the installation of the\n                            NWS. (b)     TWC made their presentation on the new water technology to the Club’s\n                        Facilities Sub-committee as early as during the eleventh Facilities\n                        Sub-committee meeting held on 12 April 2007, and not at or around the\n                        same time when the Club’s competition pool was contaminated and closed\n                        on 10 November 2007. (c)     Only the Club’s competition pool and recreational\n                        pool were to be, and were in fact, installed with NWS at a total cost of\n                        $150,000. The Club’s Jacuzzis were to be, and were in fact, installed\n                        with another system the “Carefree Water System” (iethe MWS) at the cost of $18,800. The MWS had\n                        nothing to do with the contamination in the Club’s competition pool,\n                        and was therefore not an emergency purchase. (d)     Only the MWS employs the process of ionising\n                        water. The NWS does not carry out ionisation of water, but instead allegedly\n                        uses resonance frequencies to neutralise bonding/ formation of large mineral\n                        crystals and to prevent scale formation. The installation of the NWS in\n                        respect of the Club’s competition and recreational pools did not\n                        result in the ionisation of the water in the pools to “break down the sand in the filters saving the effort to\n                            sandblast the sand filters which, over the past 20 years, had coagulated\n                            to the state of stone which rendered the sand filter\n                            ineffective.” (e)     Replacement of the broken down pump serving the\n                        competition pool would have been the cheaper alternative to installing the\n                        NWS for the purpose of resolving the contamination problem with the\n                        competition pool. (f)     There was no emergency need to repair or replace four filtration\n                        tanks to rectify or resolve the contamination of the competition\n                        pool: (i)       The competition pool has\n                            two filtration tanks attached to it. However, one of the tanks had been\n                            decommissioned several years previously and was not performing any\n                            filtration function. (ii)       The competition pool had been functioning with\n                            only one filtration tank for a significant period of\n                        time. (iii)       At the time of the contamination of the competition pool, only one\n                            filtration tank was serving the competition pool. (iv)       The recreational pool has\n                            three filtration tanks attached to it. However, one of the tanks had\n                            been decommissioned several years previously and was not performing any\n                            filtration function. (v)       The recreational pool had been functioning with\n                            only two filtration tanks for a significant period of\n                        time. (vi)       At\n                            the time of the contamination of the competition pool, the two\n                            filtration tanks serving the recreational pool were still\n                            operational. (vii)       In the circumstances, the breakdown of\n                            swimming pool equipment and the contamination of the competition pool\n                            did not include or affect the two decommissioned filtration tanks and\n                            the two operational filtration tanks that were serving the recreational\n                            pool. There was correspondingly no emergency need to repair or replace\n                            the same. (g)     Installation of the NWS was not a cheaper alternative to\n                        sandblasting, further and/or alternatively, the previous MC had inflated the\n                        costs of sandblasting the filtration tanks: (i)       The costs for refurbishing\n                            the sand filter tanks for the competition pool and the recreational pool\n                            had, on 15 November 2007, been quoted by Memiontec Pte Ltd at\n                            $70,000 and $65,000 respectively, and not $480,000 (ie$120,000 per tank x 4) as represented in Appendix D,\n                            or even $280,000 (ie$70,000 per tank x 4)\n                            as stated in the AGM. (ii)       The previous MC and the former General Manager\n                            had included the long decommissioned filtration tank attached to the\n                            Club’s competition pool, and the two operating filtration tanks\n                            serving the recreational pool in the projected costs of sandblasting\n                            when there was no reason to do so, thereby inflating the costs of\n                            sandblasting. (iii)       The defendant repeated the particulars set out\n                            in para (f) above. (h)     The NWS is not a “brand new\n                            filtration system” or even a “water filtration system”. The NWS is an\n                        add-on system designed to de-scale water which may help improve the\n                        efficiency of the existing filters. (i)     The NWS was not installed in the Marina Mandarin Hotel\n                        Singapore. (j)     The\n                        NWS did not “[do] away with the need for chemical\n                            additives”. Chlorine needed to be, and is still being,\n                        added to the Club’s swimming pools even after the installation of the\n                        NWS. Further, about the same quantity of chlorine is used in the\n                        Club’s competition pool and recreational pool both before and after\n                        the installation of the NWS: (i)       Prior to the installation\n                            of the NWS, both the competition pool and recreational pool used a total\n                            of “30 drums of 25 kg each of chlorine per\n                                month”. The defendant shall refer to and reply on\n                            the Minutes of the 16thMC Meeting held on\n                            17 February 2009. (ii)       After the installation of the NWS, both the\n                            competition pool and recreational pool used a total of “15 drums of 45 kg each of chlorine per\n                            month”. The defendant shall refer to and reply on the\n                            Minutes of the 16thMC Meeting held on\n                            17 February 2009. (iii)       In the circumstances, after the installation\n                            of the NWS, the total amount of chlorine used per month in the\n                            competition pool and recreational pool decreased by only\n                        10%. (k)     Statutory regulations set out in Rule 7(1) of the Environment Public Health\n                        (Swimming Pools) Regulations (Cap 95 Sections 94 and 113) require\n                        chemical additives to be added in the pool to act as\n                    disinfectants. (l)     Even\n                        after the installation of the NWS, the Club’s swimming pools do not\n                        contain “mineral\n                    water”. (m)     The sand in the filtration tanks was not hardened. (n)     Even if the sand in the filtration\n                        tanks was hardened the problem could have been resolved by replacing the\n                        sand filtration medium at the costs of between $15,000 and $25,000 for each\n                        tank, which was a cheaper alternative to installing the\n                    NWS. (o)     The previous\n                        MC had not undertaken a month’s research before deciding to install\n                        the NWS. The previous MC approved the installation of the NWS on the evening\n                        of 10 November 2007 (ieon the very day\n                        that the competition pool was closed), and there was no “lengthy study” or “much deliberation’ prior to the purchase of the\n                        NWS: (i)       The previous MC approved\n                            the installation of the NWS at a cost of $168,800 at the special MC\n                            Meeting held on the evening of 10 November 2007,inter alia, after a presentation was carried out by the\n                            representatives of TWC during the said meeting. (ii)       On or about\n                            12 November 2007, just two days after the previous MC approved the\n                            purchase and installation of the NWS, Mr Phua, on behalf of the\n                            Club, signed a contract (“12 November Contract”) with\n                            TWC for the purchase and installation of the MWS for the Club’s\n                            Jacuzzis, and the NWS for the Club’s competition and recreational\n                            pools. (iii)       On or about 7 December 2007, Mr Phua, on behalf of the\n                            Club, signed a second contract (“7 December\n                            Contract”) with TWC which replaced the 12 November\n                            Contract. (iv)       The previous MC failed to procure any independent evidence or\n                            proof that the NWS was effective. (p)     It was the duty of the member of the previous\n                        MC, including the plaintiffs, to act in the interests of the Club and its\n                        members and also to carry out proper due diligence and/or ensure the\n                        accuracy of the information put before the members at the AGM to ratify the\n                        purchase of the NWS. (q)     The plaintiffs failed to ensure that all material facts and matters\n                        relating to the purchase of the NWS were put before the members and/ or\n                        those facts and matters were correct or accurate. 43     I have set out the particulars of\n                    justification in detail to provide a guide to the discussion that follows. I\n                    accept, however, that in justifying his defamatory statements, the defendant\n                    does not have to prove the truth of every word, merely that the gist of the\n                    defamatory sting is true. SeeAaron Anne Joseph v Cheong Yip\n                        Seng[1996] 1 SLR(R) 258;Gatley on\n                        Libel and Slander(11thEd, Sweet\n                    & Maxwell) at pp 320–321. Further, in justifying his defamatory\n                    statement, a defendant may rely upon facts subsisting at the time of publication\n                    even if he was unaware of them at that time. SeeMusa King v\n                        Telegraph Group Limited[2004] EWLR 23.",
        "Justification – the alleged misrepresentations": "44     Before I deal with the representations made, I\n                    should say a few words about the duties that the plaintiffs as members of the\n                    previous MC owed the general membership of the Club. The plaintiffs accepted\n                    that they were accountable to members for what they did while serving on the\n                    previous MC. The first and second plaintiffs agreed that any management\n                    committee had to act in the best interests of the Club. As far as the spending\n                    of Club funds was concerned, if the proposed expenditure had not been provided\n                    for in the budget, three of the plaintiffs agreed that then the management\n                    committee would have to be satisfied that there was an emergency to be addressed\n                    and that this expenditure was necessary to address that emergency. Thereafter,\n                    the management committee would have to seek ratification of the emergency\n                    expenditure from the general body. In this context the plaintiffs accepted that\n                    the management committee concerned would be under a duty to give full and frank\n                    disclosure of all the relevant facts to the members. In order to make a\n                    considered decision as to whether to ratify the spending, the members would have\n                    to be informed of all relevant facts, whether such facts would support\n                    ratification or not. The plaintiffs also accepted that if part of the\n                    expenditure did not concern the emergency, the members would have to be notified\n                    of that fact. 45     In his closing submissions, the\n                    defendant’s allegation was that the plaintiffs had made or condoned\n                    representations falling into various categories which were actually\n                    misrepresentations to procure the ratification of the expenditure. I will\n                    consider these categories in turn. An “emergency spend”? 46     The first category of representations was to\n                    establish that the sum of $168,800 was “an emergency spend” and,\n                    according to the defendant, it contained incorrect information about what was\n                    purchased. The defendant’s case was that these misrepresentations appeared\n                    from the following: (a)     Various representations in the\n                        Annual Reportviz: (1)       Item 9(a) of the Agenda\n                            issued for the 2008 AGM stated: SPECIAL BUSINESS 9.    Items for Ratification (Appendix\n                                D) To ratify expenditures [sic]\n                                approved by the Managing Committee for the following\n                                purposes: (a)    Installation of Natural Water System to the Competition Pool,\n                                    Recreational Pool and 2 Jacuzzis; ... (2)       In the first\n                            plaintiff’s message to the members in the Annual Report, he stated\n                            that the previous MC had completed the “installation of the\n                            natural water system in our Club” and that the Club was the first\n                            in Singapore to have “clean, natural water in both our pools and\n                            mineral water in our Jacuzzis”. (3)       As part of a feature in the Annual\n                            Report marking the Club’s milestones over the previous year, it\n                            was stated: February 2008 Newly installed water system supplies healthy, mineral water for\n                                the Club’s pools and Jacuzzis, making the Club the first in\n                                Singapore to have such a system. (4)       The\n                            fourth plaintiff approved the following statement in the Annual Report\n                            about the system that had been installed in the Club: Club’s Water Filtration\n                                System The Club’s dilapidated water filtration system, which has\n                                been giving problems for some time now, finally broke down. After\n                                much deliberation on the best way to put this problem to rest, the\n                                Sub-Committee decided to install a brand new filtration system\n                                incorporating Hydrosmart Technology. This system adds resonance\n                                frequencies to the water making it soft, removes scales and prevents\n                                algae. Furthermore it does away with the need for chemical\n                                additives. Members now enjoy the benefits of mineral water in our\n                                swimming pools and Jacuzzis. (b)     Various representations in the Booklet accompanying the Annual Report\n                        (“the Booklet”)viz: (1)       In Appendix A, as part of\n                            the Summary of Decisions made at the 6 December 2007 Meeting, it\n                            was stated: 1.Installation of Natural Water\n                                    System MC approved the signing of the contract for the New Water System\n                                after information were [sic] obtained\n                                on the Water Consultant: •Letter from Paul Pearce, Managing\n                                    Director of Hydrosmart certifying that Hydrosmart International\n                                    Pty Ltd is the sole global manufacturers of the resonance\n                                    frequency treatment. •Letter from Hydrosmart International\n                                    Pty Ltd. certifying that Water Consultant Pte Ltd was appointed\n                                    the exclusive distributor for the Natural Water system in\n                                    Singapore since 2006. Hydrosmart had also given an undertaking\n                                    that they would put into place a support system to maintain all\n                                    installations and would honour the 5 year\n                                warranty. A clause had been added in the contract to specify that should the\n                                system failed [sic] to achieve the\n                                desired results, Water Consultant would install a new system. Also\n                                if the system failed the water test they would refund the cost to\n                                the Club. (2)       In\n                            Appendix B, the statement that the expenditure of $168,000 on the water\n                            filtration system was a “mandatory replacement” (it should\n                            be noted that both in Appendix B and Appendix D, the amount stated for\n                            which ratification was sought was $168,000 and not the full contract sum\n                            which was $168,800); and (3)       In Appendix D regarding the presentation made by\n                            TWC on 10 November 2007: At about the same time [as the Competition Pool was closed], Water\n                                Consultant Pte Ltd were promoting their new water technology that\n                                would produce natural water for our pools and mineral water for our\n                                Jacuzzis. ... Water Consultant Pte Ltd offered to install the NWS for both our\n                                swimming pools as well as our Jacuzzis at the cost of SGD168k. GM\n                                was asked to check the background of the company and get some form\n                                of guarantee from their principal ... No open tender was called for because Water Consultants were the\n                                sole agents for the technology ... (c)     Statements made at the 2008 AGM by the first plaintiff during his summing\n                        up before the ratification of the expenditure was put to the\n                    vote. 47     Before I go on to discuss the statements made\n                    at the 2008 AGM, the effect of the various statements quoted from the Annual\n                    Report and the Booklet was as follows. First, the members were being given the\n                    impression from most of what was said that only one system had been purchased\n                    and this system was designed to resolve the problems with the pools and the\n                    Jacuzzis. Secondly, with regard to Appendix D, the first and second plaintiffs\n                    agreed that it did not explain the differences between the NWS and the MWS.\n                    Further, by stating that TWC had offered “to install the natural water\n                    system for both pools as well as our Jacuzzis at a cost of SGD168K”, the\n                    impression given was that the pools and the spas used the same system. The\n                    second plaintiff also agreed that it would have been clear to all members\n                    reading it that what was being said was that all the expenses set out in\n                    Appendix D were emergency expenses and therefore every dollar of the expenditure\n                    had been spent to address an emergency. The plaintiffs, however, accepted that\n                    the members were not told that the system installed in the Jacuzzis was not\n                    intended to deal with any emergency experienced by the Jacuzzis. 48     The documents did contain two references to\n                    the MWS: on the cover page of Appendix D and in a heading of one page, the MWS\n                    was mentioned. These portions state: 1.    To ratify the expenditure of $168k for the\n                            installation of the Natural Water System in our pools and a Mineral\n                            Water System in the Jacuzzis. The question is, however, whether these two references would have\n                    alerted the members to the fact that there were two different systems when there\n                    were so many other statements which pointed to only one system having being\n                    purchased. The plaintiffs themselves had agreed that the members would have\n                    understood that only one system was purchased. Looking at the various statements\n                    made in the documents, it appears to me that most members would have thought\n                    that one system had been bought which managed to provide varying benefits in the\n                    pools and Jacuzzis. Members who read the material carefully would not, I think,\n                    have understood that the two systems were separate and need not have been bought\n                    together. Instead, they may have been confused as to what had actually been\n                    purchased. In any case, the statements taken as a whole would have conveyed the\n                    message to the members that all of the expenditure was effected to meet an\n                    emergency. 49     The impression given by the documents would,\n                    in my view, have been reinforced by the first plaintiff’s summing up at\n                    the 2008 AGM. This is the matter referred to in [46(c)] and this is what the\n                    first plaintiff said: So we move to item 9 first, which is to ratify expenditures approved by\n                        the Management Committee. First one is the installation of the Natural Water\n                        System in the pools and Jacuzzis, at 168,000. I think there’s been quite a, a lot of discussion on this earlier,\n                        but the question at hand is, why did the MC approve this expenditure ahead\n                        of the AGM, whilst there was no budget for it. And to explain the issue, the\n                        situation came about very suddenly when one day the pool water turned green,\n                        and uh, there was influx of complaints from members about their children\n                        getting rashes and uh drinking, swallowing green water and so on and so\n                        forth. And upon investigation, we discovered what you already know, as the\n                        pumps and filters, well not all of them, but uh, have started to break\n                        down. Uh the pools was [sic] then immediately\n                        closed to avoid any further mishaps. And in the month or so that ensued, we\n                        went through the routine that you already know about and finally decided on\n                        this particular system which was in our minds above all the other points\n                        that were discussed, really the cheaper alternative compared to having to\n                        change the filters and the sand and we (shortblast) – sandblast them\n                        and everything for a real heavy price, without, and ending up with\n                        technology that is really 30 to 50 years old.So it was\n                            felt that the 168,000, uh, after the due diligence was carried out, was\n                            the way to go, and up to today, we have had good comments from this, and\n                            the water is crystal clear not only in the pools but also in the\n                            Jacuzzis, the big advantage being that the smell of chlorine\n                        and your potentially bleached hair and red skin and all are all done away\n                        with, so we ask that members ratify this, because it was done, a decision\n                        had been made to avoid uh, problems, health problems, you know, which were\n                        thrust upon us, you know, like a disaster (unclear). Nothing we could do\n                        about it, so I (open it to the House). Thank you. 50     The first plaintiff was asked whether he\n                    agreed that it was quite clear that in the summing up he had portrayed the\n                    entire $168,800 as an “emergency spend”. His answer was\n                    “Yes”. He was then asked whether he accepted that it was wrong of\n                    him not to tell the members that some components of the expenditure had nothing\n                    to do with the emergency and his reply was “in hindsight, yes, maybe I\n                    should have mentioned”. Then, there was the following exchange: QThank you. By not telling them that components of\n                            the 168,000 had nothing to do with the emergency, you were in fact\n                            misleading them that the entire 168,000 was relevant to address the\n                            emergency – agreed? AYes. 51     It is also clear to me that the summing up\n                    would have reinforced any impression that the members had obtained from the\n                    Annual Report and Booklet that the expenditure had been used to purchase one\n                    system which had the result of solving the problems in both the pools and in the\n                    Jacuzzis. Any member who may have realised that, possibly, two systems had been\n                    bought would, after hearing the first plaintiff, have considered this impression\n                    to be mistaken. 52     So to sum up, two important representations\n                    made in the documents and at the meeting were: (a)One system was purchased.(b)All of the expenditure was incurred to meet an\n                            emergency.The next question is whether these representations were\n                true.53     At the trial, it was common ground that two\n                    systems rather than one were purchased. The evidence also showed that not all of\n                    the expenditure was incurred to meet an emergency. There was no emergency with\n                    the Jacuzzis and the money spent on the Auto-Dozers was not really necessary to\n                    deal with the problem in the competition pool. There was also doubt as to\n                    whether money needed to be spent on the recreational pool at the same time. No\n                    convincing evidence was adduced that the recreation pool had any problem that\n                    could not be solved by the purchase of new pumps. Only one emergency had cropped\n                    up and that was the emergency with the competition pool. The members were not\n                    told that the contract for the expenditure comprised several distinct components\n                    or that the NWS could have been purchased for the competition pool alone in\n                    order to resolve the emergency. All that the members were told was that the\n                    previous MC had solved the emergency by the expenditure and that it was cheaper\n                    to do it this way then to resort to the traditional sandblasting alternative. It\n                    appears to me that the representations were not true.54     The plaintiffs’ position was that the\n                    previous MC had dealt with the recreational pool and the Jacuzzis holistically\n                    as a package. At the material time, the plaintiffs had been told that the\n                    recreational pool was in as bad a state as the competition pool and that it was\n                    a matter of time before its filtration system broke down. The recreational pool\n                    had not been overhauled for the previous 20 years and there had been no\n                    sandblasting of the tank during that period. Further, prior to the closure of\n                    the competition pool, the previous MC had already intended to provide a budget\n                    for sandblasting the filtration tanks of both pools in the Club’s capital\n                    expenditure budget for the year 2008 – 2009. The upgrading of the\n                    filtration system at both pools would therefore have been something the previous\n                    MC would look into even if the competition pool was not closed on\n                    10 November 2007.55     It was submitted that the previous MC had\n                    therefore taken a holistic approach to resolving the problems faced by the\n                    Club’s swimming pools. The decision to install the NWS at the recreational\n                    pool was madebona fideas the decision of a\n                    responsible management committee. To wait half a year for budget approval to\n                    repair/upgrade the filtration system at the recreational pool would simply show\n                    a lack of foresight. Inaction might well have been construed as irresponsible\n                    conduct in the light of the prevailing circumstances. The plaintiffs as members\n                    of a responsible management committee were entitled to deal with the matter on a\n                    global basis to avoid repeated closures of the pools, which would have reflected\n                    badly on the Club.56     As for the Jacuzzis, the previous MC had been\n                    told by TWC during the presentation on 10 November 2007 that it had\n                    inspected these facilities and found the water clarity to be poor. The TWC\n                    representatives also mentioned that the Jacuzzis had a strong chlorine odour.\n                    The first plaintiff himself had complained many times about the state of the\n                    murky and smelly water in the Club’s Jacuzzis and Mr Phua was also\n                    aware of similar complaints. TWC offered to remedy the problem at the Jacuzzis\n                    as part of the special package which they had presented. The previous MC\n                    considered that $168,800 was a good price to pay for a system that would not\n                    only resolve the contamination in the competition pool, but also prevent future\n                    problems with the recreational pool and the Jacuzzis. This was a reasonable\n                    method of dealing with the concerns facing the previous MC at that\n                time.57     The plaintiffs also suggested that the errors\n                    in the representations were made innocently as they had left the details of the\n                    purchase to Mr Phua and they themselves were unclear about what they were\n                    buying.58     It appears to me however from the evidence\n                    that at the material time, the plaintiffs knew that it was not possible to\n                    justify the entire sum of $168,800 as expenditure to solve an emergency. They\n                    accepted that the problem with the competition pool was the only emergency. The\n                    first and second plaintiffs also admitted that, while they were aware that\n                    purchasing the MWS for the Jacuzzis was not intended to solve an emergency, they\n                    decided to go ahead with it anyway. The solution, the first plaintiff thought,\n                    would be to explain matters to the members and hope that they would understand.\n                    In the event, the plaintiffs were not upfront in their explanation. They did not\n                    clearly indicate to the members that they had purchased two different systems\n                    and one of the systems was simply purchased because they had been persuaded that\n                    it would be nice to have the MWS technology in the Jacuzzis.59     As for the plaintiffs’ explanations that\n                    at the material time they did not understand exactly what they were purchasing,\n                    it is difficult to accept the same at face value. First, the evidence\n                    establishes that during the presentation on 10 November 2007, TWC made it\n                    clear that they were selling two different systems to the Club: the NWS for the\n                    pools and the MWS for the Jacuzzis. Second, TWC informed the previous MC (and\n                    this information was subsequently confirmed by the due diligence investigations\n                    carried out by the management) that the two systems had two different\n                    principals: Hydrosmart International Pty Ltd (“Hydrosmart”) from\n                    Australia for the NWS and Carefree Clearwater Ltd (“Carefree”)\n                    from the US for the MWS. The presentation made it clear that the two systems\n                    were based on different principles and technologies, and were intended to\n                    address two different problems. Third, prior to the signing of the contract, the\n                    plaintiffs were shown two different warranties from the two different\n                    principals. Fourth, the plaintiffs were informed that the MWS had been installed\n                    in Singapore previously but the Club would be the first in Singapore to install\n                    the NWS. At the end of the presentation on 10 November 2007, the plaintiffs\n                    knew that they were buying two different systems and even if some of them were\n                    confused about this, by the time the contract was signed in December 2007, that\n                    confusion would have been cleared up because of the reports that Mr Phua\n                    made to them regarding his investigations into the manufacturers of the two\n                    systems.60     I do not accept the first plaintiff’s\n                    assertion that he had not learnt of the differences between the NWS and the MWS\n                    until two months after the 2008 AGM. This was the assertion that he made during\n                    the first tranche of the trial. At the resumed hearing when the tapes of the\n                    previous MC’s meetings held on 10 November 2007, 27 November\n                    2007 and 6 December 2007 had been transcribed, the first plaintiff admitted\n                    that it had been made clear to him and that he understood that there were two\n                    different systems, one for the pools and one for the Jacuzzis.61     The third plaintiff testified that he only\n                    discovered the distinction between the two systems when he was preparing his\n                    affidavit of evidence in chief for the trial. This was incredible on the face of\n                    it. In any case, when he was confronted with the transcripts of the meetings, he\n                    confirmed that he had been aware that at the meetings, the previous MC had been\n                    told about the two different systems based on different technologies and about\n                    their different attributes. The second plaintiff was more straightforward. He\n                    admitted knowing that two systems were being bought before the contract was\n                    signed because he was told about it by Mr Phua. I find that by the time of\n                    2008 AGM, all the plaintiffs were aware that the NWS and the MWS were different\n                    systems. Therefore they had no business representing that only one system had\n                    been purchased. In fact, they should have made it crystal clear to the members\n                    that two different systems had been purchased.62     What I said at the end of the last paragraph\n                    is also relevant to the plaintiffs’ contention that they had dealt with\n                    the problems with the Club’s swimming pools in a holistic fashion and had\n                    taken a proactive approach to resolving these problems. However, that is not\n                    what they told the members. Instead, they represented to the members that all of\n                    the expenditure was spent to address the emergency. In particular, they did not\n                    inform the members that only the competition pool required the emergency\n                    expenditure. Their position at the 2008 AGM was that the expenditure was\n                    incurred to deal with the filtration problems in the pools. This position did\n                    not justify buying the MWS which had nothing to do with the pools’\n                    filtration system and this was probably why the impression was given that only\n                    one system was purchased which gave the “additional” benefit of\n                    providing mineral water in the Jacuzzis. There was also a great deal of\n                    controversy over whether the NWS itself was a water filtration system, but I do\n                    not need to determine that point. In court, the plaintiffs accepted that an\n                    emergency did not give them the right to purchase items that were not connected\n                    with such emergency. Their failure to disclose to the meeting that part of the\n                    expenditure did not address the emergency must have been\n                deliberate.63     The plaintiffs suggested that they had spent\n                    $168,800 because they believed that they were buying a package from TWC. There\n                    was, however, no suggestion by TWC during its presentation that it was selling\n                    the Club a package. On the contrary, Mr Rawle testified that if the\n                    previous MC had requested that TWC installed the NWS only for the competition\n                    pool, it would have been agreeable. The first plaintiff himself testified that\n                    he knew it was possible for the Club to buy the equipment for the competition\n                    pool first. In any case, the “package” explanation would only be\n                    relevant if the plaintiffs had been informed that the Club would be given a\n                    discount only if it bought the entire package. The transcript of the\n                    10 November 2007 meeting, however, makes it clear that the previous MC was\n                    not told any such thing.64     It was also clear from the evidence that the\n                    Auto-Dozers had nothing to do with the filtration system of the pools. It was\n                    not disputed that they were not relevant to solving the emergency. The first two\n                    plaintiffs agreed that these items were not essential for the functioning of the\n                    NWS or for resolving the chokage of the competition pool’s sand filter\n                    though the second plaintiff maintained that the previous MC did not know until\n                    very recently that the Auto-Dozers did not address the emergency. He agreed,\n                    though, in the light of what he now knew, it was not possible to justify the\n                    purchase of the Auto-Dozers as an emergency expense.65     The plaintiffs’ pleaded case was that\n                    they were not aware that the expenditure included the Auto-Dozers. The\n                    plaintiffs’ stand that they knew about the Auto-Dozers only in 2009 is,\n                    however, contradicted by the transcript of the 10 November 2007 meeting.\n                    The transcript records that Mr Rawle had recommended that the Club add\n                    “an on-demand chlorination system, which is a system that reads your\n                    water”. The plaintiffs must therefore have known that what was being sold\n                    to them included the Auto-Dozers. When the first plaintiff was shown this\n                    transcript, he said that he knew at the time of the presentation that TWC was\n                    offering the Auto-Dozers as something extra. It should be noted that the\n                    transcript also shows that the first plaintiff had asked questions about the\n                    Auto-Dozers during the meeting. In the light of all the evidence, it is safe to\n                    infer that the plaintiffs had a general idea about the use of the Auto-Dozers\n                    and knew that they had nothing to do with the filtration problem. Yet, they\n                    sanctioned the purchase and, more than that, did not explain to the members that\n                    this equipment was an optional extra which had no connection with the emergency.\n                    It may be worth mentioning that in the event the Auto-Dozers could not be used\n                    because the contract did not include two essential components: the chemical\n                    tanks and stirrers. The Club ended up paying for useless pieces of equipment but\n                    I am satisfied that at the material time the plaintiffs were not aware of that\n                    aspect.66     The plaintiffs maintained that they did not\n                    see the contract that was signed with TWC as this was a matter that they left in\n                    the hands of the general manager. Therefore, they were not aware that the\n                    Auto-Dozers were being bought or that they cost $19,400. If the plaintiffs are\n                    to be believed, they authorised the expenditure without knowing what the total\n                    sum of $168,800 covered or how it was made up. I find that hard to credit. Even\n                    if I accepted that to be the case, I agree with the defendant’s submission\n                    that in that event, the plaintiffs would have been reckless in representing to\n                    the members that the entire expenditure was necessary to resolve the\n                    emergency.67     The fourth plaintiff in particular seems to\n                    have been very careless in this regard. He claimed that he did not know of the\n                    existence of the Auto-Dozers and this was because:(a)     When the previous MC approved the\n                        expenditure, he had no idea what comprised the system that was being\n                        purchased from TWC;(b)     When Mr Rawle recommended the Auto-Dozers, he was not\n                        interested; and(c)     Although it was the previous MC’s decision to purchase the system and\n                        he agreed that it must understand what was being offered before agreeing to\n                        purchase the same, he did not understand what was being bought and did not\n                        ask any questions about it. His position was that it was the general\n                        manager’s duty to get everything straightened out.In these circumstances, it would appear that he was happy to go along with\n                    whatever was said by the other plaintiffs and the general manager to obtain\n                    ratification of the expenditure even though he himself did not know whether the\n                    system and all the components purchased were needed to solve the emergency. That\n                    makes him equally culpable.Addition of chemicals to the pool water68     It was reported in the Annual Report that\n                    after the installation of the NWS the Club’s swimming pools did not\n                    require the addition of chemicals. Evidence given for the plaintiffs showed that\n                    the amount of chlorine added to the swimming pools was reduced by a maximum of\n                    32.5% after the NWS was installed. This meant that the pools were still dozed\n                    with 67.5% of the amount of chlorine that they had previously received.\n                    Obviously, chlorine still needed to be added even though the NWS was in\n                    operation. The plaintiffs explained that the regulations of the National\n                    Environment Agency (“NEA”) require chlorine to be added to all\n                    swimming pools in Singapore and the Club was adding the minimum required.\n                    However, the statement in the Annual Report was categorical. It read\n                    “Furthermore, [NWS] does away with the need for chemical\n                    additives”. Such a statement must have given members the impression that\n                    no more chemicals were being added to the pools.69     It was not right to give the members such an\n                    impression because the previous MC must have known that whilst the NWS was being\n                    touted as reducing the need for chemicals, they had been specifically informed\n                    by Mr Rawle at the 10 November 2007 meeting that even with the NWS,\n                    the pool would have to “maintain at least a 1% chlorine that the NEA\n                    requires” and in any case the purpose of the Auto Dozers was to provide\n                    the requisite chlorination. The first plaintiff as a swimmer for several years\n                    was also aware that chlorine was a compulsory addition to swimming\n                pools.70     Although in the context of what happened, the\n                    representation as to the reduced need for chlorine after the installation of the\n                    NWS was a minor misrepresentation, I think that the plaintiffs deliberately made\n                    this representation in order to emphasise the benefits of the new system and\n                    encourage ratification. It would be noted that in his speech quoted in[49]above, the first plaintiff emphasised that\n                    the smell of chlorine and the dangers of hair being bleached and skin being\n                    reddened, had all been done away with by the new system.Representation that the NWS provided mineral water71     The Annual Report stated that as a result of\n                    the system purchased by the Club, the members of the Club were able to\n                    “enjoy the benefits of mineral water in [the Club’s] swimming pools\n                    and Jacuzzis”. By the end of the trial, it was not in dispute that the\n                    NWS did not result in there being mineral water in the Club’s pools and\n                    that the mineral water in the Jacuzzis resulted from the installation of the MWS\n                    in those facilities.72     The defendant submitted that the statement in\n                    the Annual Report was a deliberate misrepresentation. He pointed out that the\n                    transcript of TWC’s presentation made on 10 November 2007 showed that\n                    the plaintiffs had not been informed that mineral water would result from the\n                    NWS. The plaintiffs had not explained why this statement regarding the presence\n                    of mineral water in the pools had been made. Therefore, the defendant submitted,\n                    the only inference that could be drawn would be that this was a deliberate\n                    embellishment on the part of the plaintiffs on the benefits of the NWS to\n                    convince the members to ratify the expenditure.73     The statement in question appeared in the\n                    section of the Annual Report on the work of the Facilities Department. It was\n                    drafted by the staff but vetted by the third plaintiff who was the Facilities\n                    Chairman. In court, the third plaintiff was questioned about this statement. He\n                    agreed that as it stood, it was not accurate but maintained that this was\n                    because certain words had been left out and testified that the relevant portion\n                    of the sentence should have read “enjoy the benefits ofnatural andmineral water in our swimming pools and\n                    Jacuzzis”. On further questioning, he did not agree that even with the\n                    amendment, the sentence would still give the impression that there was only one\n                    system that provided both natural and mineral water. In the third\n                    plaintiff’s view, if the words “natural and” had been added\n                    to the sentence, it would have been clear to all members that the Club had\n                    bought two different systems.74     The third plaintiff would have me believe that\n                    it was a careless mistake that resulted in the misleading statement in the\n                    Annual Report. He would also have me believe that his command of English is such\n                    that he honestly thought that simply adding the words “natural\n                    and” would convey the message that two separate systems had been bought.\n                    It is difficult to believe this when the full context of the statement is\n                    considered. The material portion of the paragraph in which it appeared reads as\n                    follows:... the Sub-Committee decided to install a brand new filtration system\n                        incorporating Hydrosmart Technology. This system adds resonance frequencies\n                        to the water making it soft, removes scales and prevents algae. Furthermore\n                        it does away with the need for chemical additives. Members now enjoy the\n                        benefits of mineral water in our swimming pools and jacuzzis.It is plain from the full context that the members were being told\n                    that one system alone had been purchased. The system was referred to as\n                    “it” in the singular and “this system”. Nothing in\n                    the paragraph indicated that two systems had been purchased and, therefore, if\n                    the words “natural and” had been added to the last sentence,\n                    members would have thought that the single system purchased was capable of\n                    delivering two different types of water. They would not have thought that two\n                    systems had been bought.75     Given that the third plaintiff knew by April\n                    2008 that two different systems had been purchased, the defendant contended that\n                    the statement was a deliberate misrepresentation emphasising the benefits that\n                    the members had gained from the expenditure but hiding the fact that two systems\n                    had had to be purchased in order to provide such a benefit and that the system\n                    for the Jacuzzis did not address any emergency.76     The plaintiffs on the other hand submitted\n                    that while there might have been some inaccuracies in the Annual Report about\n                    the MWS and the NWS, the Annual Report simply formed part of the previous\n                    MC’s update to the members about the new facilities installed at the Club\n                    and was not material to ratification. The material document relating to\n                    ratification was Appendix D and the heading in this document stated\n                    unequivocally and prominently in the heading that two systems were installed for\n                    the pools and Jacuzzis. There was no attempt to conceal any facts or to mislead\n                    Club members.77     It is true that the heading of item 1 of\n                    Appendix D read:To ratify the expenditure of $168k for the installation of the Natural\n                        Water System in our pools and a Mineral Water System in our JacuzzisThat heading if taken by itself would have clearly informed the\n                    members that two separate systems had been purchased. However, the four\n                    paragraphs of explanation that followed the heading were not so clear. The first\n                    sentence of the second paragraph read:At about the same time Water Consultants Pte Ltd were promoting their new\n                        water technology that would produce natural water for our pools and mineral\n                        water for our Jacuzzis.This sentence gave an impression of one type of technology producing\n                    two results though careful readers who compared the heading with the sentence\n                    may have thought that the phrase “new water technology” referred\n                    to two systems, not one. However, such interpretation would have been\n                    contradicted immediately if such readers went on to read the first sentence of\n                    the third paragraph which stated:Water Consultants offered to install the Natural Water System for both our\n                        pools as well as our Jacuzzis at a cost of SGD$168k.The implication of that sentence was that the NWS was the only system\n                    being acquired. This impression would have been reinforced by the following\n                    sentences of the third paragraph which read:GM was asked to check the background of the company and get some form of\n                        guarantee from their principal. After securing the necessary documents and\n                        assurances the contract was awarded to Water Consultants Pte Ltd on\n                        28 November 2007.The second sentence of the third paragraph in particular indicated\n                    that there was only one principal behind TWC who gave a guarantee. Finally, in\n                    the last paragraph of this item, a reference was made to the NWS as being able\n                    to break up the hardened sand in the filters thus obviating the need to\n                    sandblast the sand filters. Apart from the title, there was not a single mention\n                    of the MWS in the four paragraphs explaining the expenditure. Thus, the overall\n                    picture that a member reading item 1 of Appendix D would have had was that a\n                    single system was purchased which provided the benefits of natural water for the\n                    pools and mineral water for the Jacuzzis.78     The wrongful impression given by the statement\n                    in the Annual Report would thus have been reinforced rather than corrected by\n                    Appendix D. I find that there was a misrepresentation in the Annual Report and\n                    it was deliberate.Representations as to due diligence79     At the 2008 AGM, Mr Phua made the\n                    following statements:(a)    “... we have done a thorough study on this,\n                            and we have also got all the pros and cons of the system ... But uh, you\n                            can rest assured that the people we got in have convinced us thoroughly\n                            on the system ...”(b)    “... the Committee I must say, took all the\n                            precautions to make sure that the system works and is reliable.\n                            We’ve got the principals of the company giving us guarantee letter\n                            etc etc etc. So rest assured we have done our homework before we launch\n                            into this water system.”; and(c)    “Well we’ve checked the company,\n                            it’s an independent private (co) and company, private listed\n                            company, Water Consultant Pte Ltd. They are the sole agents for this\n                            particular system in Singapore and Southeast Asia. So we contacted their\n                            principals, the one invented this system in Australia, and they’ve\n                            given us documents to say that it works and it’s guaranteed, and\n                            that they’ve even given us a guarantee over the guarantee given to\n                            us by Water Consultants, that should Water Consultants go kaput for\n                            example, they will take over and provide us the\n                            guarantee.”80     Additionally, on the question of the\n                    investigations done prior to purchase of the NSW, the first plaintiff\n                    said:(a)    “we were concerned, and we did the best we\n                            could to find various references uh, as well as due diligence, we\n                            contacted the manufacturers who gave us guarantees that should the local\n                            distributor fail to deliver, they would back up the local distributor on\n                            this particular issue and so on and so forth.”(b)    in the month or so that ensued [after the\n                            Competition Pool was closed], we went through the routine that you\n                            already know about and finally decided on this particular system\n                            ...”81     The defendant submitted that since the\n                    previous MC did not correct Mr Phua’s statements at the 2008 AGM,\n                    members had been given the impression that they endorsed what he had said.\n                    Further, the first plaintiff had admitted in court that when he made the\n                    statement in [80(a)] above, his intention was to convince members that adequate\n                    due diligence had been carried out. In the defendant’s view, however, the\n                    facts established that the due diligence was shoddy, that the plaintiffs had\n                    decided immediately after the 10 November 2007 meeting to purchase the\n                    system and had not applied their minds to its adequacy. Further, whilst the\n                    plaintiffs had testified that they left the due diligence to the staff and had\n                    relied on Mr Phua to discharge his duties properly, this is not what they\n                    had told the members of the AGM.82     The first point that the defendant made to\n                    substantiate the assertions above was that the decision to purchase the NWS was\n                    not made on 6 December 2007 but much earlier. This was evidenced by the\n                    transcript of the 10 November 2007 meeting which contained a discussion of\n                    how to pay for the system followed by an instruction to Mr Phua to\n                    “build up a case” to justify the expenditure as an emergency. The\n                    defendant also pointed out that the minutes of that meeting had stated that\n                    “after consideration, MC approved the installation of the system at a\n                    cost of $168,800”.83     The plaintiffs’ position was that the\n                    decision made on 10 November 2007 was only an “in principle”\n                    approval of the purchase. There are, however, certain documents which cast doubt\n                    on this assertion:(a)     On 12 November 2007 Sylvia Chan\n                        sent Richard Phua an e-mail thanking him, his team and the MC for awarding\n                        the contract to TWC and stating that the contract would be sent over for\n                        signature;(b)     A\n                        contract dated 12 November 2007 entered into between the Club and TWC;\n                        and(c)     An\n                        “Addendum to Sales Agreement dated 12 November 2007” with\n                        the number “12” struck out and replaced with a\n                        “23” which was subsequently signed.The\n                    documents above appear to indicate that there was a binding contract for the\n                    purchase of the NWS and MWS from TWC on or shortly after 12 November\n                    2007.84     The plaintiffs, however, pointed out that the\n                    payment terms were not settled from the beginning. In the 12 November 2007\n                    document, a 60% down-payment was to be made prior to the equipment supply and\n                    pipe work fabrication, followed by a 25% progress payment upon installation,\n                    then six percent payment a month after installation and a final payment of ten\n                    percent upon commissioning of the natural water pool and satisfactory\n                    decalcification of the filters. After a meeting that took place on\n                    19 November 2007, the payment terms were modified so that there was a ten\n                    percent down-payment followed by a 50% payment upon the supply of the equipment,\n                    whilst the progress payment was changed from 25% to 20% and the payment a month\n                    after installation was raised from five to ten percent. Additionally, there was\n                    a change in the warranty to be provided by TWC which was reflected in the\n                    Addendum to the Sales Agreement. Further, at the management committee meeting\n                    held on 27 November 2007, Mr Phua asked for approval for the signing\n                    of the contract with TWC thus indicating to the previous MC that the contract\n                    was still to be concluded. No approval was given as the previous MC still wanted\n                    Mr Phua to obtain a guarantee from TWC that the pool water would pass\n                    “local standards”. It was at the next meeting, held on\n                    6 December 2007, that Mr Phua informed the previous MC that he had\n                    managed to secure a limited warranty provision in the contract and again asked\n                    for approval to sign the contract. The previous MC then gave him the green\n                    light. The previous MC had not given Mr Phua any authority to sign any\n                    contract until the conclusion of this meeting and it was not aware that\n                    Mr Phua had signed a contract prior to that date.85     On this issue, I accept the evidence of the\n                    plaintiffs that as far as they were concerned, whilst they were very\n                    enthusiastic about the new technology after TWC’s presentation on\n                    10 November 2007, they had not authorised Mr Phua to enter a binding\n                    contract at that stage. Thus, when he signed the quotation of 12 November\n                    2007, he did so without authority (although since TWC was not aware of that lack\n                    of authority, the contract would still have bound the Club). Mr Phua was\n                    questioned about this in court and he was unable to give a coherent explanation\n                    as to why he had entered into a binding contract with TWC on or about\n                    12 November 2007. Whilst technically this action on the part of\n                    Mr Phua means that the contract was not concluded after a month long study,\n                    the previous MC was not aware of these facts and indeed the existence of the\n                    12 November 2007 contract was not discovered until the yellow file came to\n                    light. To the previous MC’s knowledge at the time of the 2008 AGM, there\n                    was only one contract between the Club and TWC and that was the one signed on\n                    7 December 2007. Accordingly, I find that it was not a deliberate\n                    misrepresentation on the part of the previous MC to tell the members at the 2008\n                    AGM that the contract was only signed after a month long due diligence effort\n                    had been made. As far as the previous MC was concerned, this statement was\n                    true.86     Apart from the period of due diligence, the\n                    defendant submitted that the statements of the first plaintiff and Mr Phua\n                    quoted contained untrue representations to the effect that:(a)     The previous MC had obtained\n                        satisfactory warranties from the principals, Hydrosmart and\n                    Carefree;(b)     That they\n                        had carried out research into the NWS; and(c)     That there were third party endorsements of the\n                        NWS.I will deal with these allegations in\n                turn.87     As regards the warranties, to paraphrase the\n                    statement made by Mr Phua and quoted at [79(c)] above, what he was telling\n                    the members was that the Club had contacted the principals of TWC and had been\n                    given documents to say that the system worked and had even obtained a guarantee\n                    from the principals that if TWC was to go bankrupt, the principals would take\n                    over and carry out the terms of the guarantee given by TWC. This message was\n                    reinforced by the first plaintiff’s statement quoted at [80(a)] above,\n                    which was to the effect that the manufacturers of the system had given the Club\n                    guarantees that should TWC fail to deliver, they would back up\n                TWC.88     The warranty given by Hydrosmart, the\n                    manufacturer of the NWS, is addressed to “To whom it may concern”.\n                    The first few paragraphs deal with the appointment of TWC as the exclusive\n                    distributor for the NWS in Singapore and praise the knowledge and ability of\n                    TWC. The only part of the letter that can be construed as a warranty is the\n                    ninth paragraph which reads:We would be dismayed if they would walk way [sic] after all the investment in time, energy and finance.\n                        However, should the unlikely situation take place we would definitely put\n                        into place a support system to cope with all installations and honour the 5\n                        year warranty.89     The warranty given by Carefree is also\n                    addressed to “To whom it may concern”. It too has several\n                    paragraphs dealing with the ability of TWC and the confidence that Carefree had\n                    in it as Carefree’s Asia Pacific exclusive distributors. The material\n                    paragraphs relating to the warranty are as follows:Carefree Clearwater provides the Lifetime product warranty for all the\n                        systems that are sold and installed by [TWC] in Asia Pacific.It is unlikely that [TWC] directors would walk away from a fast growing\n                        business that they have nurtured from its embryonic stage, through\n                        accumulated technical knowledge, their wealth of marketing expertise and\n                        their financial investment. The Green movement is here to stay. In the\n                        unlikely event, we would definitely arrange for support infrastructure in\n                        Singapore.90     The defendant submitted that it was plainly\n                    untrue that satisfactory warranties had been obtained from the principals\n                    because:(a)     The warranties were not addressed to\n                        the Club but to “To whom it may concern”.(b)     Second, both warranties were\n                        hopelessly vague and indicated that at the time of writing there was no\n                        support structure available in Singapore.(c)     No steps were taken to look into the financial\n                        standing of the principals and as it turned out, Hydrosmart had a paid up\n                        capital of only A$100.(d)     The principals were not based in Singapore and this would\n                        make enforcement of the warranties difficult. In any event, the lack of\n                        financial standing of the principals suggested that enforcement proceedings\n                        would be futile and therefore the warranties served no useful\n                        purpose.91     Looking at the statements made by the first\n                    plaintiff and Mr Phua, I think it is difficult to categorise them as\n                    misrepresentations. It was true that the Club had obtained letters of support\n                    from both principals concerned. The defendant’s point about the letters\n                    not being addressed directly to the Club at the outset was not a substantial one\n                    since a specific reference was made to the Club in each letter in the context of\n                    welcoming the Club as a purchaser and user of the system concerned. Therefore,\n                    it was apparent that the principals knew whom they were writing to and to whom\n                    their assurances of support were being given. It was also true that the\n                    Hydrosmart letter specifically agreed to honour the five year warranty for the\n                    NWS given by TWC in the event that TWC folded up as Mr Phua had told the\n                    meeting. I do not consider that undertaking to be hopelessly vague. Further, the\n                    speakers did not hide from the meeting the fact that the principals were\n                    companies located overseas. Reasonable members would have realised that\n                    difficulties may be encountered if the Club sought to enforce the warranties\n                    against foreigners. The first plaintiff admitted in court the previous MC had\n                    taken the warranties at face value without considering the practicalities of\n                    enforcement but, in my view, in doing this they probably acted little\n                    differently from many consumers who buy fairly expensive systems for their\n                    homes. The point is that it is apparent from the evidence that the previous MC\n                    did push the general manager to obtain guarantees from TWC’s principals\n                    and was not satisfied simply to rely on TWC in respect of this new technology.\n                    In any event, I am satisfied that the plaintiffs were not being deceitful in the\n                    information they gave the general meeting about the warranties.92     The next representation relied on was\n                    Mr Phua’s comment that a thorough study had been done on the NWS and\n                    the “pros and cons of the system” had been obtained. This is\n                    quoted at [79(a)] above. The defendant argued that the plaintiffs were aware of\n                    what studies had been carried out and did not correct Mr Phua’s\n                    statement even though they knew that no proper research had been done in respect\n                    of the NWS. In this connection, the second plaintiff agreed that due diligence\n                    had to be done in relation to how the NWS worked. For himself, he did this by\n                    listening to the presentation given by TWC and also checked with Mr Phua to\n                    clarify a few points on the effectiveness of the system. He did not read the\n                    material relating to the system himself as he considered that that would only be\n                    necessary if he had doubts regarding it. On the whole, he relied on the\n                    investigations done by Mr Phua. A similar position was taken by the third\n                    plaintiff who said that he did not go into the details because he did not think\n                    that that was his duty since he took it that both the full-time staff and\n                    Facilities Sub-committee had done so. The fourth plaintiff confirmed in court\n                    that he had taken TWC’s presentation at face value and had not done any\n                    independent checks.93     In the light of the above evidence and on the\n                    plaintiffs’ own case, it is clear that they left the issue of due\n                    diligence entirely up to Mr Phua because these were operational matters for\n                    him to look at. The defendant argued that that was not good enough because they\n                    had given the members the impression that they themselves had done a thorough\n                    study. I do not agree. I do not think that the members would have expected the\n                    individual members of the previous MC to do detailed due diligence on their own.\n                    It would have been understood that this would be work for the professional\n                    management under the charge of Mr Phua. The previous MC had instructed\n                    Mr Phua to negotiate with TWC for better contract terms and to carry out\n                    checks on the company. Knowing that TWC’s systems were new to the market,\n                    they had discussed ways in which the Club could be protected should TWC cease\n                    operation and had directed Mr Phua to contact TWC’s principals for\n                    added security. They had also asked for references and had been provided with\n                    some. At the meeting held on 27 November 2007, they had received\n                    Mr Phua’s reports on the results of the various checks that he had\n                    made including the bank statement he had received confirming TWC’s bank\n                    credit. At the end of this meeting, Mr Phua was instructed to carry out\n                    further checks on the principals and it was only after receiving a satisfactory\n                    report from Mr Phua on 6 December 2007 that the previous MC authorised\n                    the execution of the contract. The previous MC believed that Mr Phua had\n                    taken all necessary steps in the due diligence process and therefore were not\n                    wrong in failing to correct his statement. It should also be noted that the\n                    Audit Committee’s findings were that the prescribed procedures had been\n                    followed and that the selection process in relation to TWC was in order. Whether\n                    a due diligence exercise has been properly performed is to some extent a\n                    question of perspective and a subjective matter. In this particular case, it was\n                    easy in hindsight to find holes in the process but I do not think that such\n                    holes were so obvious at the material time as to alert the previous MC that it\n                    would be wrong in relying on the reports of Mr Phua.94     The third representation was that the previous\n                    MC had obtained third party endorsements of the NWS. The defendant noted that\n                    this was a key concern of the members present at the AGM and that in court the\n                    plaintiffs had agreed that this was a legitimate concern of the members and\n                    would be important to them in deciding on ratification. One of the members, a\n                    Mr Ken Lee, had asked whether matters relating to the efficacy of the NWS\n                    were a representation from the vendors or the finding of an expert. Subsequently\n                    he asked whether there were any third party opinions on the system. Mr Phua\n                    then informed the meeting that referrals from the YMCA in the U.S. had been\n                    obtained and that he had also spoken to Marina Mandarin Hotel whose swimming\n                    pool used the system and the Negara Hotel. When further queries were raised,\n                    Mr Phua told the meeting that he had a letter from the Marina Mandarin\n                    Hotel.95     The evidence was, however, that none of the\n                    organisations referred to had used the NWS. The feedback from the YMCA, New\n                    Jersey, USA was in relation to the MWS. The Marina Mandarin Hotel and the Negara\n                    Hotel had also installed the MWS, and not the NWS. The letter from the Marina\n                    Mandarin Hotel dated 13 November 2007 was shown to the previous MC by\n                    Mr Phua on 27 November 2007 and the same expressly referred to the\n                    Carefree ionization system which had created “a mineral water swimming\n                    pool”. When Mr Phua told the 2008 AGM that he had a letter of\n                    reference from the Marina Mandarin Hotel, the clear impression given was that\n                    this reference was for the NWS. That was the wrong impression and it should have\n                    been corrected by members of the previous MC. None of them did so. The issue of\n                    the references was raised several times during the meeting and the Marina\n                    Mandarin Hotel was referred to more than once, but at no time was it clarified\n                    that the third party endorsement was for the MWS used by the Jacuzzis and not\n                    for the NWS installed in the pools. I agree that the plaintiffs endorsed or\n                    permitted a deliberate misrepresentation in this respect.Summary of findings on representations96     I have held that the natural and ordinary\n                    meaning of the First and Second Statements was that the plaintiffs had\n                    intentionally misrepresented to the members that it was necessary to replace the\n                    water filtration system on the basis that it was urgent and/or an emergency in\n                    order to justify the expenditure and obtain ratification of the\n                same.97     I have found that the plaintiffs made the\n                    following representations to the members despite knowing that they were untrue\n                    in order to obtain ratification of the expenditure:(a)     That the whole of the expenditure\n                        was required to address an emergency;(b)     That after the installation of the NWS, the swimming\n                        pools did not require the addition of chemicals;(c)     That the NWS provided mineral water to\n                        the pools; and(d)     That third party endorsements had been obtained in respect of the\n                        NSW.98     Accordingly, I hold that the defendant has\n                    justified the gist of the defamatory sting and is not liable to the plaintiffs\n                    for defamation.Conclusion99     In view of my findings above in relation to\n                    justification, I do not need to go on to consider the further defence of\n                    qualified privilege and whether this defence would have been defeated by the\n                    presence of malice on the part of the defendant.100    I therefore dismiss the plaintiffs’\n                    claim with costs.",
        "Conclusion": "99     In view of my findings above in relation to\n                    justification, I do not need to go on to consider the further defence of\n                    qualified privilege and whether this defence would have been defeated by the\n                    presence of malice on the part of the defendant. 100    I therefore dismiss the plaintiffs’\n                    claim with costs."
    }
}