{
    "case_title": "Public Prosecutor\n      v\n      AFR",
    "ncitation": "[2010] SGHC 230",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "Introduction": "1       The accused was charged with the murder of his\n                    daughter some 22 days before her second birthday. The charge states as\n                    follows: that you, on the 6th day of January 2009, between 7.30 pm and\n                        7.45 pm at [address redacted] did commit murder, by causing the death\n                        of one [the deceased], female, aged 1 year and 11 months old\n                        (D.O.B: 28 January 2007), and you have thereby committed an offence\n                        punishable under section 302 of the Penal Code, Chapter 224\n                        (2008 Rev. Ed.). 2       At the end of the trial I reserved judgment and\n                    gave my decision on 17 March 2010. I acquitted the accused of the charge of\n                    murder but convicted him of the charge of culpable homicide under s 299 and\n                    punishable under s 304(b) of the Penal Code\n                    (Cap 224, 2008 Rev Ed)(“the Act”). Submissions on\n                    sentence were made by the prosecution and defence counsel on 19 April 2010,\n                    at the end of which I sentenced the accused to six years’ imprisonment\n                    with effect from the date of his arrest. The Public Prosecutor has appealed\n                    against the sentence and I now give the grounds for my decision on the\n                    sentence. 3       The deceased had died as a result of a rupture\n                    to the inferior vena cava (“IVC”), a large vein that carries\n                    de-oxygenated blood from the lower half of the body into the heart. The severe\n                    bleeding that followed the rupture caused her heart to fail within minutes. The\n                    accused had subjected the deceased to a severe beating with blows from his fists\n                    and possibly his feet to her back, head and arms. I found that those blows had\n                    caused the rupture to the IVC although the evidence was unclear as to the exact\n                    mechanism. This was because the pathologist had testified that such rupture was\n                    more commonly seen in high speed collisions, yet the blows were not severe\n                    enough to cause any fracture to the ribs of the deceased. Nevertheless, the\n                    multiple blows on the trunk had caused bleeding in the left lung and caecum and\n                    the rupture to the IVC could only be caused by the beating inflicted on the\n                    deceased by the accused. The full findings of fact are set out in my judgment in\n                    [2010] SGHC 82 dated 17 March 2010 and I do not propose to repeat them\n                    here, save to reproduce parts of [41] and [42] of that judgment which distil the\n                    essential facts: 41    ... The deceased was [the accused’s] natural\n                            daughter. All of the witnesses who knew the family said that he loved\n                            the deceased, even though he had a violent streak and had physically\n                            abused her. On the day in question, up to the moment he entered the flat\n                            upon returning from his shopping trip, he felt nothing but love for the\n                            deceased. He was thinking of her upcoming birthday and had felt that he\n                            should buy her a present as he might not have another opportunity to do\n                            so. As he entered the flat, he was feeling rather pleased with himself\n                            for buying the doll and was keen to hand it to the deceased.\n                        ... 42    The question is whether – in the\n                            circumstances of this case – [the accused] had the intention, when\n                            he subjected the deceased to that beating on the night of 6 January\n                            2009, of doing it to the extent of rupturing her IVC. The relevant\n                            circumstances may be summarised as follows: on the night of\n                            6 January 2009 when [the accused] entered his flat, he was pleased\n                            with himself for having bought a present for the deceased; he was\n                            looking forward to giving it to her there and then. Instead, he was\n                            confronted with the sight of the deceased playing with his cigarettes,\n                            making a mess, and – above all – chewing on his tobacco.\n                            Only two days earlier, she had done something similar and he had given\n                            her a scolding and warned her not to do it again. That warning had not\n                            worked; thus, on 6 January 2009, he wanted to teach her a lesson so\n                            that she would not do it again. He brought her into the kitchen so that\n                            they were less likely to be overheard by the neighbours. He did not\n                            start out by hitting her. But when he scolded the deceased, she started\n                            to cry and her cries only grew louder. This caused [the accused] to be\n                            stressed. He began hitting her. It started with slaps; then, as the\n                            deceased’s cries grew more intense with each blow, [the accused]\n                            became even more stressed and his blows increased in intensity. His\n                            emotions boiled over – all his frustrations ranging from his\n                            inability to support his family (manifested in the deceased eating his\n                            cigarettes), the lack of respect shown to him by his wife’s\n                            relatives, his insecurities about her infidelity and the reflection on\n                            his own manhood, even the prospect of losing face before his neighbours\n                            – and found an outlet in his violence. The blows and cries\n                            escalated until [the accused], in Dr [Z]’s words, “finally\n                            tipped over”. It must be remembered that [the accused] was young\n                            and poorly educated; he was 27 years old at the time. He had no idea\n                            that the blows he inflicted in those moments of frenzy were, relative to\n                            the deceased, the equivalent of a 360kg person hitting someone of his\n                            own stature. He thought he was beating her to teach her a lesson but\n                            lost control in the heat of the moment and went well beyond what was\n                            justified. He caused so much injury to the deceased that, apart from the\n                            bruises to skin and muscle, her lungs and caecum were contused. Yet, no\n                            bones were broken. His unfortunate combination of blows caused a rupture\n                            to the IVC in a manner that Dr [X] found unusual. In such circumstances,\n                            could a father who loved the deceased, had set out to teach her a\n                            lesson, but got carried away in the heat of passion and caused an\n                            unusual injury that resulted in her death, be said to have intended to\n                            cause that injury when he hit her? 4       The punishment prescribed under\n                        s 304(b) of the Act is imprisonment for a\n                    term which may extend to ten years, or with fine, or with caning, or with any\n                    combination thereof. The facts of the present case do not merit caning nor any\n                    fine. An appropriate term of imprisonment would suffice to fulfil the\n                    requirements of justice and public policy. Such term may range from a day to ten\n                    years, depending on the circumstances of each individual case. The authorities\n                    show that a wide range of sentences have been meted out for convictions under\n                        s 304(b) even though they all necessarily\n                    involve the accused causing the death of a human being. This is as it should be\n                    because there is a wide spectrum of circumstances under which this offence may\n                    be committed and the punishment must fit the crime. InPublic\n                        Prosecutor v Tan Kei Loon Allan[1998] 3 SLR(R) 679 the\n                    Court of Appeal said at [33]: We were of the view that it is not desirable, unlike simple rape, to set a\n                        benchmark for culpable homicide. The range of circumstances in which such\n                        offences are committed is extremely varied, as our brief survey of the\n                        reported cases demonstrates. They are not easily classified, and there is no\n                        such thing as a “typical” homicide. Similarly, to classify all\n                        culpable homicides as more serious than all rapes is overly simplistic. As\n                        counsel for the respondent pointed out, there is a correlation between the\n                        offender’s culpability and hismens rea.\n                        Whereas the rapist intends to violate the victim without her consent, the\n                        perpetrator in a culpable homicide case lacks the intention to cause death.\n                        Sentencing for culpable homicide should remain a matter within the trial\n                        judge’s discretion (subject to our power to review a decision made in\n                        error, or which is manifestly excessive or inadequate), and should be\n                        determined on the facts of each particular case. 5       I turn to examine the precedents. At one end of\n                    the spectrum, the maximum of ten years’ imprisonment has been imposed in\n                    the most egregious cases. InPublic Prosecutor v McCrea\n                        Michael[2006] 3 SLR(R) 677, the accused\n                    (“McCrea”) had killed his driver and his driver’s\n                    girlfriend. The driver had called McCrea’s mistress a\n                    “slut”, which made McCrea lose his temper. McCrea rained punches\n                    on the driver’s face until it was swollen and stopped only when the driver\n                    became motionless. The autopsy revealed extensive injuries all over the\n                    driver’s body; his face, arms and legs were bruised, three ribs were\n                    fractured as were both the superior thyroid horns (around the larynx). Death was\n                    caused by strangulation. The driver’s girlfriend had come to his\n                    assistance while McCrea was beating him up. She used a knife and stabbed McCrea\n                    with it, but he kicked and punched her and dislodged the knife from her hand.\n                    After the driver died, the girlfriend tried to leave but McCrea prevented this.\n                    Subsequently, for reasons that are not given, she lost consciousness. McCrea\n                    then wrapped plastic bags round her head and secured them tightly around the\n                    neck with a necktie. She died from suffocation. McCrea had told another person\n                    that he “had to ‘silence’ the girlfriend as she had witnessed\n                    the incident”. The court imposed the maximum of ten years’\n                    imprisonment for each of the charges and ordered the sentences to run\n                    consecutively. McCrea also faced a third charge of causing disappearance of\n                    evidence under s 201 of the Act and he was sentenced to a term of four\n                    years. This was also to run consecutively to the two offences under\n                        s 304(b). 6       InTan Chun Seng v Public\n                        Prosecutor[2003] 2 SLR(R) 506, the appellant\n                    (“Tan”) was parking his car when the deceased and his friend\n                    (“Chandrasegaran”) approached. The deceased and Chandrasegaran had\n                    been drinking earlier. Chandrasegaran hit the window of the front passenger\n                    seat. They then went to the rear of the car and Chandrasegaran gestured to Tan\n                    to get out of the car. After parking his car, Tan got out to confront\n                    Chandrasegaran. However Tan could not find him, and only managed to see the\n                    deceased walking down the road. Tan shouted at him, asking why his friend had\n                    hit Tan’s car. Unknown to Tan, the deceased was a deaf mute and therefore\n                    could not hear him. The deceased continued walking, not knowing that Tan was\n                    behind. This angered Tan further and he hurled Hokkien vulgarities at the\n                    deceased. When Tan neared the deceased, the latter turned around and stood his\n                    ground. Tan advanced, pouring verbal abuse and gesticulating with his hands.\n                    When Tan came close, the deceased gave him a push. As the deceased was of large\n                    physical build, the push caused Tan to fall. When on the ground, Tan spotted a\n                    wooden pole some distance away. Realising that he would not be able to overpower\n                    the deceased with his bare hands, he grabbed the pole, ran to the deceased and\n                    hit him numerous times with it. One of the blows was delivered to the head and\n                    it proved fatal. The deceased fell to the ground, motionless. Tan threw the pole\n                    away and fled. He was convicted of murder by the trial court but the Court of\n                    Appeal found the defence of sudden fight made out and convicted him of culpable\n                    homicide under s 304 of the Act. At that time, s 304(a) provided for life imprisonment or imprisonment up to\n                    ten years. The Court of Appeal was of the view that the appropriate sentence was\n                    more than ten years, but in view of the fact that the s 304(a) did not provide for an intermediate period between\n                    ten years and life imprisonment, Tan was sentenced to ten years’\n                    imprisonment under s 304(b). The Court of\n                    Appeal did not explain why it chose this limb over s 304(a) which, technically, would have been the appropriate limb as\n                    the charge was reduced on account of the successful defence of sudden\n                    fight. 7       Sentences at the high end – nine years\n                    – were given inSoosay v Public Prosecutor[1993] 2 SLR(R) 670 andPublic Prosecutor v Aw Teck\n                        Hock[2003] 1 SLR(R) 167. They both involved fights of\n                    various sorts. A sentence of eight years was imposed inTan\n                        Chee Hwee and another v Public Prosecutor[1993] 2 SLR(R)\n                    493, where a maid was strangled during a botched burglary. InPublic Prosecutor v Leong Soon Kheong[2009] 4 SLR(R) 63\n                    the accused received a sentence of seven years’ imprisonment for his role\n                    as ringleader in an unprovoked group attack on the deceased. 8       Sentences in the mid-range, around five years,\n                    have been meted out in convictions under s 304(b). InPublic Prosecutor v Wan Chin\n                        Hon[2005] SGHC 121, the accused (“Wan”) was a\n                    taxi driver. The deceased was riding a motorcycle and the two (Wan and the\n                    deceased) had somehow gotten into a disagreement on the road which led to some\n                    high-speed antics, which resulted in the tragic death of the motorcyclist. Wan\n                    was found to have deliberately swerved the taxi into the path of the motorcycle\n                    at high speed, causing the deceased to lose control and crash. He was sentenced\n                    to four years’ imprisonment. InPublic Prosecutor v Oon\n                        Oon Sang Tee(Criminal Case No 11 of 2006), the accused\n                    (“Oon”) was sentenced to four years and six months for strangling\n                    his wife to death. Oon was upset that his wife had been conducting an\n                    extramarital affair and tried to reconcile with her. But his wife told Oon that\n                    she could not change the way she felt and intimated that she would divorce him.\n                    This caused Oon to lose control and strangle her. There was no premeditation and\n                    no weapon used. However Oon had an underlying psychiatric\n                condition. 9       Sentences as low as two and a half years have\n                    been imposed in convictions under s 304(b).\n                    InPublic Prosecutor v Lim Ah Seng[2007]\n                    2 SLR(R) 957, the accused (“Lim”) had caused the death of his\n                    wife by strangulation. However the trial court considered the following\n                    mitigating factors to be sufficient to sentence him to a prison term of only two\n                    years and six months: (a)    Lim had been the victim of the deceased who was an\n                            abusive spouse who had physically and psychologically abused him to a\n                            point where he become mentally disordered; (b)    he was afraid of the deceased; (c)    the deceased had sought him out on that fateful\n                            day and had physically abused him, seduced him to have sexual\n                            intercourse and then threatened to report him for rape, threatened to\n                            kill him, tried to take hold of one or more knives and then hit him\n                            again before strangling him; (d)    it was at that point that he retaliated by\n                            strangling her; (e)    the fact that the deceased was smaller than Lim\n                            did not prevent her from abusing him or from being the aggressor that\n                            night or from having Lim live in fear of her; and (f)    no weapon was used. The setting was that of an\n                            intense physical fight initiated by the deceased and still continuing\n                            with each strangling the other until Lim felt the deceased’s grip\n                            on his neck loosen. There is no trace or suggestion of any premeditation\n                            or planning. This was a case where Lim lost control under the most\n                            trying of circumstances, none of which appear to have been of his\n                            making. 10     Finally I turn to consider cases involving\n                    very young victims. InPublic Prosecutor v Teo Chee\n                        Seng[2005] 3 SLR(R) 250 the appellant (“Teo”)\n                    was sentenced to seven years’ imprisonment for causing the death of his\n                    lover’s seven-month old infant. The facts are summarised in [2]–[5]\n                    of the judgment of the Court of Appeal, as follows: 2    Teo had been hired as a private investigator by the\n                            infant’s mother, Tay Seoh Hong (“Tay”), to check on\n                            the movements of her husband, whom she suspected of having an affair\n                            with another woman. As it turned out, Teo, a married man with children\n                            of his own, fell in love with Tay and they became lovers. After Tay\n                            separated from her husband, Teo’s mother helped Tay look after the\n                            infant. 3    The tragic event occurred on 25 October 2000\n                            when Teo had to look after the infant for some time. He first drove to a\n                            car park at Serangoon Garden Way as he wanted to buy 4-D tickets. When\n                            the infant started crying, he decided to go to another 4-D outlet at\n                            Hougang Central. As the infant was still crying, he tried to pacify her\n                            by feeding her milk but the infant refused to drink the milk. Teo then\n                            applied some “Axe” medicated oil onto the infant’s\n                            lips and nostrils. The infant showed signs of discomfort and the accused\n                            assumed that she felt a burning sensation on her lips and nostrils after\n                            the application of the medicated oil. 4    A little later, Teo shouted at the infant when she\n                            began to cry again. This time, he poured some of the medicated oil into\n                            the infant’s mouth. The infant stopped crying but she moved her\n                            tongue in and out of her mouth and groaned in discomfort. Teo then\n                            joined the queue at the 4-D outlet at Hougang Central to purchase 4-D\n                            tickets. While he was in the queue, the infant started to cry. Teo\n                            returned with the infant to his car and tried to feed her milk. When she\n                            refused to drink the milk, he applied medicated oil onto her lips and\n                            nostrils and proceeded to a petrol kiosk to buy some goods, including a\n                            bottle of “Axe” medicated oil because the one that he had\n                            was already empty. 5    Teo next drove to the Riverdale Plaza car park and\n                            tried to feed the infant again. When she refused to drink the milk\n                            offered to her and cried, he shook the contents of the new bottle of\n                            medicated oil into her mouth. The infant’s cries became fainter\n                            and fainter, her face changed colour, her stomach became bloated, there\n                            was a watery discharge from her nostrils and she retched and tried very\n                            hard to get rid of the poisonous substance from her body before she\n                            finally became unconscious. Teo took the infant and ran to a medical\n                            clinic in the shopping mall. It was then around 5.03pm. An ambulance\n                            took the infant to the KK Women’s and Children’s\n                            Hospital, where she was pronounced dead at 6.30pm. Dr Wee Keng Poh,\n                            a forensic pathologist, certified that the cause of death was\n                            “acute salicylic acid poisoning”. 11     The trial court had sentenced Teo to four\n                    years’ imprisonment and the Court of Appeal increased it to seven years.\n                    One of the reasons for the increased sentence was that insufficient weight had\n                    been given to the fact that the victim was only seven months old and inPurwanti Parji v Public Prosecutor[2005]\n                    2 SLR(R) 220, the Court of Appeal had recognised the need to protect\n                    vulnerable and defenceless persons. The Court of Appeal then reviewed the cases\n                    involving young victims in [12]–[14] of its judgment, as follows: 12    Three such cases may be noted. In the first case,PP v Sumarni bte PonoCriminal Case\n                            No 11 of 2001, the mother of a child, aged two years, was so\n                            incensed by his crying that she carried him from his mattress, which was\n                            on the floor, and lifted him up to the level of her waist before\n                            dropping him onto the mattress. She then pulled his ears and knocked his\n                            head several times against the mattress. She pleaded guilty to a charge\n                            under s 304(b) of the Penal Code for\n                            causing the death of her child and was sentenced to imprisonment for a\n                            term of five years. 13    In the second case,PP v Dwi\n                                Arti SamadCriminal Case No 12 of 2000, the accused,\n                            a female aged 22 years, was also irritated by the cries of an infant,\n                            aged 15 months. She picked him up from his pram and dropped him onto the\n                            floor. The child was killed and she pleaded guilty to a charge of\n                            culpable homicide not amounting to murder. She was sentenced to eight\n                            years’ imprisonment. 14    In the third case,PP v Devadass\n                                s/o SuppaiyahCriminal Case No 41 of 1997, the\n                            accused pleaded guilty to a charge under s 304(b) of the Penal Code. He had held a baby, aged three\n                            months, by the neck and slapped him hard several times for crying. The\n                            baby died after being thrown onto a mattress on the floor. The accused\n                            was sentenced to ten years’ imprisonment. 12     In the authorities reviewed in the foregoing\n                    paragraphs, the sentences imposed in convictions under s 304(b) of the Act range from two and a half years to the\n                    maximum of ten years. Where very young victims were involved, the sentences\n                    ranged from five to seven years with ten years being imposed in an egregious\n                    case involving a three month old infant. In the present case, the deceased was\n                    the natural daughter of the accused, the oldest of three girls and, as was clear\n                    from the evidence, one whom he loved dearly. Indeed the offence was committed\n                    just after he had returned home from a shopping trip during which he had decided\n                    at the spur of the moment to buy her a doll for her upcoming second birthday.\n                    The knowledge that, in that moment of uncontrolled anger, he had brought this\n                    tragedy upon the deceased and his wife and above all, to himself, will never be\n                    erased from his conscience no matter how many years he is imprisoned as\n                    punishment. That is a burden he will bear for the rest of his life and no\n                    punishment meted out by this court can be greater than that. It was nevertheless\n                    necessary for society to manifest its abhorrence for such loss of control by the\n                    accused and the degree of violence that he visited on the young innocent that\n                    was his own daughter. Bearing in mind the range of sentences imposed in the\n                    authorities considered above, the fact that the accused will have to live with\n                    the knowledge that he had caused the death of a child he had loved, and the need\n                    for the court to impose a sentence that will punish him for his lapse, I imposed\n                    a sentence of six years’ imprisonment, against which the Public Prosecutor\n                    is now appealing."
    }
}