{
    "case_title": "Orion Oil Ltd \n      v\n      Agus Anwar",
    "ncitation": "[2010] SGHC 356",
    "coram": "Tan Lee Meng J",
    "sections": {
        "Background": "2       Orion lent AA $10 million (“the\n                    loan”) pursuant to a loan agreement dated 22 September 2008 and a\n                    supplemental agreement dated 24 September 2008. Under the agreement, the loan\n                    amount and interest were to be repaid on 18 December 2008. AA acknowledged the\n                    loan in his correspondence with Orion and promised to repay. However, he failed\n                    to do so. 3       On 18 April 2009, Orion served a statutory\n                    demand on AA for the sum of $10.5 million. This amount included interest on the\n                    loan furnished to AA. 4       On 7 July 2009, AA applied to set aside\n                    Orion’s statutory demand. He argued that by furnishing him the loan, Orion\n                    acted as a moneylender and as the latter did not have a moneylender’s\n                    license, the contract to lend him money was not enforceable by virtue of the\n                    Moneylenders Act (Cap 188, 1985 Rev Ed). The Assistant Registrar who\n                    heard AA’s application took the view that the debt was disputed on\n                    substantial grounds and that there was a triable issue as to whether the\n                    defendant was a moneylender under the Moneylenders Act. The statutory demand was\n                    thus set aside. 5       Orion appealed against the Assistant\n                    Registrar’s decision. On 25 August 2009, Lee Seiu Kin J\n                    overruled the Assistant Registrar’s decision and upheld the statutory\n                    demand: seeAgus Anwar v Orion Oil Ltd[2010] SGHC 6. He pointed out (at [12]) that AA had a totally\n                    unmeritorious case and had “tried to take advantage of the presumption in\n                    s 3 of the [Moneylenders Act] to escape his obligations, willingly\n                    undertaken at the time when he was desperate for cash, but which he did not want\n                    to repay for reasons best known to himself”. 6       AA’s appeal against Lee J’s\n                    decision was dismissed by the Court of Appeal on 9 July 2010. 7       As AA did not pay the amount claimed in the\n                    statutory demand, Orion filed the bankruptcy application on 15 May 2009. AA\n                    responded by trying to have the application set aside or stayed. 8       At the hearing before AR Then, AA relied on two\n                    grounds. First, he contended that the debt to Orion is a disputed debt.\n                    Secondly, he asserted that the bankruptcy petition should be set aside or stayed\n                    because Orion already had security by way of a charge on a property at 39A\n                    Ridout Road, Singapore 248438 (the “Ridout property”), which had\n                    been sold and part of the proceeds of which would be paid into court when the\n                    sale was completed. AA’s application was dismissed by AR Then Ling. It is\n                    noteworthy that she stated in her notes of evidence as follows: Separately, I am mindful of [AA’s] conduct throughout the entire\n                        proceedings. In my view, [AA] is simply trying to delay the proceedings and\n                        deny [Orion] the money owed. The court will not condone such conduct.",
        "The appeal": "9       At the hearing of this appeal, AA abandoned his\n                    argument that the debt was disputed. He was right to do so, since this issue had\n                    already been raised and decided in the proceedings before Lee J and the Court of\n                    Appeal when he unsuccessfully sought to set aside the statutory demand. His\n                    counsel thus focussed his attention on the charge on the Ridout\n                property. 10     The Ridout property is owned not by AA but by\n                    a company, Ridout Residences Pte Ltd (“RRPL”), of which he is the\n                    sole shareholder and director. AA claims that the property is held on trust for\n                    him. However, AA’s reliance on the charge on the Ridout property as a\n                    ground for setting aside or staying the bankruptcy application is fraught with\n                    difficulties. To begin with - and as AR Then rightly pointed out - AA is\n                    prevented from raising the issue of the charge on the Ridout property because\n                    this issue had been canvassed by him in earlier proceedings in the High Court\n                    and the Court of Appeal with respect to his application to set aside\n                    Orion’s statutory demand against him. In any case, even if the charge on\n                    the Ridout property had not been raised in previous proceedings, AA knew about\n                    this charge when he applied to set aside the statutory demand. As such, he was\n                    prevented by issue estoppel from raising this issue as well as other issues\n                    which he could have raised with reasonable diligence in the earlier proceedings\n                    to set aside the statutory demand. InHenderson v\n                        Henderson(1843-60) All ER Rep 378 (“Henderson”), Wigram VC explained at pp\n                    381-382: The plea ofres judicataapplies, except in\n                        special case[s], not only to points upon which the court was actually\n                        required by the parties to form an opinion and pronounce a judgment, butto every point which properly belonged to the subject\n                            of litigation and which the parties, exercising reasonable diligence,\n                            might have brought forward at the time. [emphasis added] 11     The wider ambit of the plea ofres judicataenunciated inHendersonhas been followed on numerous occasions by our courts:\n                    see the decision of the Court of Appeal inNg Chee Chong and\n                        another v Toh Kouw and another[1999]\n                    2 SLR(R) 909. 12     Even if the issue ofres\n                        judicatais left aside for the moment, AA took inconsistent\n                    positions on the enforceability of the charge on the Ridout property. While he\n                    argued in these proceedings that Orion had a charge on the Ridout property, his\n                    position in other proceedings before the High Court was that Orion’s\n                    charge on the Ridout property could not be enforced because it is connected to\n                    another transaction involving Gainsford Capital Ltd (the “Gainsford\n                    transaction”) that rendered the charge ineffective. In Originating\n                    Summons No 1357 of 2009 (“OS No 1357”), which concerned a claim by\n                    an option holder for specific performance of his contract to purchase the Ridout\n                    property from RRPL, AA made it quite clear in his Affidavit of Evidence-in-Chief\n                    filed on 25 June 2010 that he would oppose any attempt by Orion to enforce the\n                    charge and claim any part of the balance of the sale proceeds of the Ridout\n                    property. AA’s attempt to have the bankruptcy application set aside or\n                    stayed while insisting that this charge is unenforceable cannot be countenanced.\n                    He cannot blow hot and cold. 13     A petitioning creditor is, as was made clear\n                    by Harman J inIn Re Gilmartin (a bankrupt)[1989]\n                    1 WLR 513, 516, “entitled to be paid his debt in full on the\n                    hearing of a petition unless it is adjourned on the ground that there is a\n                    reasonable prospect of him being paid within a reasonable time”. It\n                    cannot be said at the present moment that there is a reasonable prospect of\n                    Orion being paid within a reasonable time. 14     As there was insufficient reason for me to set\n                    aside or stay the bankruptcy application. I dismissed AA’s appeal with\n                    costs."
    }
}