{
    "case_title": "Vicplas Holdings Pte Ltd\n      v\n      Allfit International Market Pte Ltd and others",
    "ncitation": "[2010] SGHC 370",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "The applications": "11     The plaintiff filed this Suit on 26 March\n                    2001 and on the same day obtained anex parteinjunction against all three defendants from passing-off or attempting to\n                    pass-off solvent cement that was not manufactured by the plaintiff as the\n                    plaintiff’s product. The application for an injunction was supported by an\n                    affidavit filed by the plaintiff’s operations manager Cheng Hsheng\n                    (“Hsheng”). 12     On 11 June 2010, the first and second\n                    defendants applied by Summons No. 2614 (“the O 14\n                    application”) for the court to make a determination under O 14\n                    r 12 of the Rules of Court (Cap 322, R 5, 2006 Rev Ed)\n                    (“the Rules”) of the following question of law:- Whether the plaintiff’s claims of copyright infringement of the\n                        Artistic Work (as defined in the statement of claim) comprised in the\n                        alleged get-up of the “P&S” brand of solvent cement are\n                        sustainable at law against the first and second defendants and if it is\n                        determined that the plaintiff’s aforesaid claim is unsustainable at\n                        law, the plaintiff’s said claim be dismissed and para 48 of the\n                        statement of claim and all references to the plaintiff’s said claim of\n                        copyright infringement of the Artistic Work against the first and second\n                        defendants in the statement of claim be struck out. 13     Separately, the third defendant applied on\n                    14 June 2010 by way of Summons No. 2660 (“the second\n                    application”) for the following prayers under O 18 r 19 of the\n                    Rules: (i)That paras 28 to\n                            33, 35 to 42, 44 to 46 and 55 of the statement of claim be struck out in\n                            as much as they related to “passing\n                            off”; (ii)That para 56 of\n                            the statement of claim be struck out in as much as it related to\n                            “damaging the plaintiff’s\n                            goodwill”; (iii)para 57\n                            of the statement of claim be struck out on the basis that: (a)the said paragraphs disclose no reasonable\n                                cause of action; (b)the said paragraphs may prejudice, embarrass\n                                or delay the fair trial of the action; and/or (c)that the said paragraphs are otherwise an\n                                abuse of the process of the Court. 14     Both applications were heard and dismissed by\n                    the Assistant Registrar against which decision only the third defendant filed an\n                    appeal by way of Registrar’s Appeal No 276 of 2010 (“the\n                    Appeal”). This court heard and allowed the Appeal. As the plaintiff is\n                    dissatisfied with my decision and has filed a notice of appeal (in Civil Appeal\n                    No 154 of 2010) against the same, I now set out the reasons for my reversal of\n                    the order made by the Assistant Registrar. 15     At the hearing below, the main contention by\n                    counsel for the defendants was that no goodwill subsisted in the product in\n                    Singapore as it was only sold in Bangladesh. Counsel for the plaintiff on the\n                    other hand argued that notwithstanding that the product was not sold locally,\n                    there was still goodwill in Singapore because the product was exported from here\n                    to Bangladesh and the sale transaction was made in Singapore.",
        "The facts": "16     Before I go into the facts of the case it\n                    would be appropriate to look at the get-up that contained the parties’\n                    products. The product’s can appears as follows:  17     The cheaper product found at the third\n                    defendant’s premises appeared in cans that looked as follows:  It was remarkably similar to the get-up of the can for the\n                    product as can be seen from[16]save that\n                    the colour of the orange stripes was lighter. 18     It was the plaintiff’s case (as deposed\n                    to in Hsheng’s affidavit) that the “artistic work” comprised\n                    in the get-up of the product was created by the plaintiff’s executive\n                    director Cheng Liang (“Cheng”), a Singapore citizen, in or around\n                    2003 by adapting and modifying the artistic work comprised in the get-up of the\n                    plaintiff’s Vicplas brand of solvent cement ([55]infra) which he had previously created in or about\n                    1988. 19     The plaintiff asserted that by virtue of\n                    s 30(5) of the Copyright Act (Cap 63, 2006 Rev Ed) (“The\n                    Copyright Act”), the plaintiff owned the copyright in the artistic work\n                    comprised in the get-up for the product which it believed was still valid and\n                    subsisting. 20     The plaintiff described the get-up as being a\n                    cylindrical metal can white in colour with a border that consisted of two orange\n                    stripes of approximately 6mm in width at the top and at the bottom of the curved\n                    surface. The cap of the can in white in colour and has ridges. 21     In his affidavit. Hsheng added that the can in[18]contained the following literary\n                    work; (a)     On the front curved surface of the\n                        can: P&S (in orange) PVC Cement CONFORM TO BS4346; PART 3 (in black) SPECIALLY PREPARED FOR UPVC Pipes AND Fittings (in orange) (b)     To the right of the literary work\n                        set out above, on the curved surface of the can, were 7 directions for usage\n                        including the following: DIRECTIONS FOR USE 1    Cut pipe ends square. Clean mating surfaces of the\n                            pipe and fittings with printing fluid. 2    Pipe should go into fitting at least 1/3 to ¾\n                            of the way without forcing… and ended with: MADE IN SINGAPORE(in black) 22     The curved surface of the can also contained a\n                    caution which opening words were: KEEP OUT OF THE REACH OF CHILDREN! (in\n                        orange) which ended with a diamond shape and the words: DANGER –EXTREMELY FLAMABLE(in\n                        orange) Hsheng claimed the get-up of the can for the product was very\n                    distinctive and different from that used by its competitors in the Bangladesh\n                    market. 23     Hsheng deposed that the product had been\n                    advertised, displayed, offered for sale and sold in Bangladesh since 2003. Prior\n                    thereto, the two brands of solvent cement that were manufactured in Singapore\n                    and sold in Bangladesh were the plaintiff’s “Vicplas” brand\n                    and the third defendant’s “Faltex” brand. 24     Hsheng provided figures for the\n                    plaintiff’s sale of the product in Bangladesh, starting with 26,020 cans\n                    in 2006 (amounting to $75,010.54) and increasing over the years until it reached\n                    157,220 cans for 2009 valued at $433,680.24. The product was the dominant brand\n                    in Bangladesh. Consequently, there was goodwill in the product in\n                    Bangladesh. 25     On the defendants’ behalf, Khurseed (see[5]) affirmed an affidavit wherein he\n                    deposed that he used to work for a Bangladeshi firm of import-export merchants\n                    called Saleheen International (“Saleheen”) between 1995 and 2005.\n                    Saleheen was in the business of importing building and materials and sanitary\n                    fittings including uPVC fittings and solvent cement. Khurseed deposed he came to\n                    Singapore in 2003 with his boss from Saleheen and visited the plaintiff’s\n                    office where he met one Steven Eu (“Steven”). Saleheen asked for\n                    the distribution rights in Bangladesh for Vicplus brand uPVC fittings and\n                    solvent cement. Steven said that was not possible as the plaintiff already had a\n                    distributor for Vicplus in Bangladesh. 26     After his return to Bangladesh, Khurseed\n                    reported the outcome of his Singapore trip to Saleheen’s management and\n                    he/the management came up with the idea to create Saleheen’s own brand of\n                    solvent cement. Khurseed subsequently saw a billboard advertising machinery\n                    under the brand “P&S”. He thought that it would be the perfect\n                    name for the proposed brand of solvent cement as “P” was the short\n                    form for PVC fittings while “S” represented solvent cement. He\n                    proposed the name to Saleheen and the firm liked it. 27     Later the same year (2003), Khurseed visited\n                    Singapore and he met Steven again. He told Steven that Saleheen would like the\n                    plaintiff to supply solvent cement and uPVC fittings under Saleheen’s own\n                    brand “P&S”; Steven agreed. The plaintiff prepared a mock-up\n                    of the can for Khurseed which he approved. The can had a white background with\n                    orange stripes on the top and the bottom. Khurseed specifically requested the\n                    plaintiff to add the words “specially prepared for uPVC pipes and\n                    fittings” under the brand “P&S”. 28     Thereafter, Saleheen proceeded to order uPVC\n                    fittings and solvent cement under the “P&S” brand from the\n                    plaintiff. As far as Khurseed was concerned, he created the brand\n                    “P&S” and he was the owner of any goodwill and rights that may\n                    attach to the artwork of the cans for the product. He considered the plaintiff\n                    as only the original equipment manufacturer (“OEM”) or contract\n                    manufacturer for Saleheen. Whatever reputation that had been acquired by the\n                    product was also vested in him. 29     In 2004, Khurseed came to Singapore again and\n                    visited the third defendant. He asked the third defendant to supply him with\n                    Faltex brand pipe fittings and solvent cement which the third defendant agreed\n                    to do. 30     Khurseed left Saleheen in 2005 and set up his\n                    own business trading under the name Emon (see[5]above). As the uPVC fittings and solvent cement business\n                    were largely his “baby”, Khurseed deposed that his former employer\n                    Saleheen allowed him to take the same away with him. The “P&S”\n                    brand was successfully sold in Bangladesh between 2005 and 2009 through\n                    Emon. 31     In 2008, the business of\n                    “P&S” solvent cement increased significantly in Bangladesh and\n                    the product was sold nationally through a wholesaler Grameen. Khurseed gave his\n                    consent when Grameen’s proprietor Habibur Rahman (“Rahman”)\n                    sought his permission to register the “P&S” trademark in\n                    Bangladesh. Rahman has since applied to register the “P&S”\n                    trademark in Bangladesh. 32     Khurseed deposed that in 2009, he discovered\n                    that the plaintiff was supplying the product to a firm known as Kushtia Traders\n                    (“Kushtia”). Khurseed was very angry with his discovery and\n                    confronted Steven with it; Steven admitted the plaintiff was supplying the\n                    product to Kushtia without Khurseed’s knowledge and consent. As a result,\n                    Khurseed stopped ordering the product from the plaintiff. He transferred his\n                    orders to the third defendant who he knew was/is a manufacturer for the first\n                    defendant’s products. 33     Khurseed revealed that the cans seized by the\n                    plaintiff in[9]were intended for shipmentof\n                    his orders of the product to Bangladesh. He complained that his business in\n                    Bangladesh had been disrupted by the plaintiff’s action. 34     A director of the third defendant, Ong Lu Ling\n                    (‘Ong”) also filed an affidavit on its behalf in support of the\n                    second application. On his affidavit, Ong submitted that the plaintiff did not\n                    make full and frank disclosure of all material facts and had failed to show that\n                    damages would not be an adequate remedy. 35     Ong revealed that because of the injunction,\n                    the third defendant was obliged to store 15,540 cans of flammable solvent in its\n                    premises. He questioned the plaintiff’s claim that damages would not be an\n                    adequate remedy pointing out that the third defendant was only a contract\n                    manufacturer for the product on the first defendant’s behalf. The third\n                    defendant had no interest in the product itself. There was no necessity to\n                    injunct the company as the third defendant is a substantial company which was in\n                    a position to pay the plaintiff damages or account for its profits, according to\n                    law. Ong asked for the court’s leave to dispose of the product in the\n                    third defendant’s premises as it is highly flammable. 36     In support of his submission that the\n                    plaintiff had failed to make full and frank disclosure, Ong alleged that the\n                    plaintiff failed to disclose that there were other brands of solvent cement that\n                    were contained in metal cans using the orange /white colour schemes just like\n                    the product. Ong considered the get-up of the can as common in the trade.\n                    Directions on usage and cautions on the can were also common in the trade. In\n                    any case, customers bought the product for their own use, not because of the\n                    directions on usage. Ong relied on Khurseed’s affidavit for his contention\n                    that Hsheng’s affidavit claiming copyright was untrue. He disputed the\n                    plaintiff’s claim for passing-off. As the product was not sold in\n                    Singapore, the plaintiff could not claim goodwill and hence, its claim for\n                    passing- off must necessarily fail. 37     The second defendant had filed an affidavit in\n                    support of the O 14 application. In his affidavit, the second defendant\n                    contended that the plaintiff’s claim for artistic work was not\n                    sustainable. Hence, the third defendant’s second application to strike out\n                    certain paragraphs in the statement of claim. He relied on ss 7, 70 and 74 of\n                    the Copyright Act as well r 12 of the regulations made under the Copyright\n                    Act. I shall revert to these sections and r 12 of the Copyright Act\n                    later.",
        "The submissions": "38     The plaintiff’s counsel argued that\n                    overseas goodwill in the product was insufficient for purposes of copyright\n                    protection in Singapore, citingMomentum Creations Pte Ltd v\n                        Tan Eng Koon t/a De Angeli[2003] 1 SLR(R) 342. He\n                    submitted that the product was exported from Singapore to Bangladeshvizthe sale was made at a wholesale level in Singapore\n                    to Bangladesh, the purchase order was given by the Bangladeshi buyer and payment\n                    was received by the plaintiff in Singapore. Arguably, the sale transaction was\n                    made in Singapore and was evidence of trading activity sufficient to establish\n                    goodwill in Singapore. Counsel also relied onJC Penny Co Inc\n                        v Punjabi Nick[1979] FSR 26,RH Macy & Co\n                        Inc v Trade Accents[1991] 2 SLR(R) 98,Tiffany & Co v Fabriques de Tabac Reunies SA[1999]\n                    2 SLR(R) 541 andNovelty Pte Ltd v Amanresorts Ltd\n                        and Anor[2009] 3 SLR(R) 216. 39     Counsel for the third defendant pointed out\n                    that the product had no buyers in Singapore, only in Bangladesh. He citedFuture Enterprises Pte Ltd v Tong Seng Produce Pte\n                        Ltd[1997] 3 SLR(R) 797 (“Future Enterprises”) as authority for the proposition\n                    that the product must be available in Singapore and have a local reputation in\n                    order to prove that the plaintiff has goodwill in Singapore. Counsel pointed out\n                    that the plaintiff had not produced one iota of evidence of sale of the product\n                    in Singapore or even of its advertisement.",
        "The decision": "40     It was common ground that the product was not\n                    sold in Singapore or even advertised here. I allowed the Appeal as I was not\n                    persuaded by the arguments canvassed on the plaintiff’s behalf that\n                    goodwill in another jurisdiction (Bangladesh) was sufficient to constitute\n                    goodwill in Singapore for purposes of an action in passing-off in\n                    Singapore. 41     It was telling that the plaintiff did not file\n                    a further affidavit by Hsheng to rebut what was stated in Khurseed’s\n                    affidavit. As Hsheng had referred to Khurseed as one of the plaintiff’s\n                    Bangladesh customers in his own affidavit, I can only conclude that some\n                    credence at least must be given to Khurseed’s affidavit. That being the\n                    case, doubt was cast on Hsheng’s claim that the plaintiff came up with the\n                    name “P&S” for the product as well as the artistic work. I was\n                    also sceptical of Hseng’s claim (at[4]supra) that the word “P” stood for\n                    Penang and “S” represented Singapore when the product was not sold\n                    at all in Singapore. It was more likely than not that Khurseed ([27]supra) came up with the name\n                    “P&S” with the two letters representing PVC and solvent\n                    respectively. 42     In addition, the cases cited by counsel for\n                    the third defendant negated the plaintiff’ contention that foreign\n                    goodwill sufficed for a passing-off action in Singapore. According to Lord\n                    Macnaghten inThe Commissioners of Inland Revenue v Muller\n                        & Co’s Margarine Limited[1901] AC 217 at p\n                    223, “goodwill”: …is a thing very easy to describe, very difficult to define. It is\n                        the benefit and advantage of the good name, reputation, and connection of a\n                        business. It is the attractive force which brings in custom. It is the one\n                        thing which distinguishes an old-established business from a new business at\n                        its first start. The goodwill of a business must emanate from a particular\n                        centre or source. Goodwill is composed of a variety of elements. It differs\n                        in its composition in different trades and in different businesses in the\n                        same trade… 43     In the same case, Lord Lindley added (at p\n                    235): Goodwill regarded as property has no meaning except in connection with\n                        some trade, business, or calling. In that connection I understand the word\n                        to include whatever adds value to a business by reason of situation, name\n                        and reputation, connection, introduction to old customers, and agreed\n                        absence from competition, or any of these things, and there may be other\n                        which do not occur to me.In this wide sense, goodwill is\n                            inseparable from the business to which it adds value and, in my opinion,\n                            exists where the business is carried on. Such business may be\n                        carried on in one place or country or in several, and if in several there\n                        may be several businesses. each having a goodwill of its\n                        own…[emphasis added] The court inFuture Enterprises([40]supra) at [29] followed both law lords’\n                    definition of goodwill. As noted earlier at[41], the product was not sold in Singapore. Consequently, it\n                    did not have goodwill, based on their lordships’\n                definitions. 44     I turn my attention now toFuture Enterprises. There, the plaintiff and the defendant were\n                    both established trading companies that decided to go into the business of\n                    producing 3-in-1 instant coffee mix. The plaintiff’s 3-in-1 product was\n                    called “MacCoffee” which it started selling in Russia and Vietnam\n                    in August 1994. It commenced local distribution of MacCoffee in 1995. In 1996,\n                    the plaintiff received information that the defendant was selling a 3-in-1\n                    instant coffee called “A Maxcoffee” which bore similarities to\n                    MacCoffee. The plaintiff sued the defendant for passing-off when the latter\n                    refused to withdraw its A Maxcoffee from the market. 45     The court had to determine whether there was\n                    goodwill attached to the MacCoffee product in Singapore and whether the\n                    defendant had misrepresented its coffee mix as the plaintiff’s product.\n                    The court dismissed the plaintiff’s claim. The court held that in order to\n                    establish it had goodwill in MacCoffee, the plaintiff mustinter aliashow it had carried on business in MacCoffee in\n                    Singapore. It was not enough for the plaintiff to establish that it was\n                    incorporated in Singapore and that it made MacCoffee here. There was a\n                    distinction between the goodwill attached to the corporation Future Enterprises\n                    and the goodwill attached to the product MacCoffee. Further, the relevant time\n                    at which the existence of goodwill was adjudged was the date of commencement of\n                    the conduct of the defendant that was complained about, October 1995. The\n                    evidence of such goodwill at that date was meagre. As such, the plaintiff failed\n                    to discharge the burden of proof of establishing that when the defendant started\n                    selling the A Maxcoffee in Singapore, MacCoffee already enjoyed sufficient\n                    reputation and goodwill to found an action for passing off. 46     The plaintiff (unsuccessfully) submitted thatFuture Enterprisesdid not represent the\n                    absolute position by citingMomentum Creations Pte Ltd v Tan\n                        Eng Koon (trading as De Angeli)(“Momentum Creations”) ([39]supra)andTrade Facilities Pte\n                        Ltd & Others v Public Prosecutor[1995] 2 SLR(R) 7\n                        (“Trade Facilities”). Neither\n                    case, in my view assisted the plaintiff as their facts were vastly different, as\n                    can be seen below. 47     InMomentum\n                        Creations, the plaintiff manufactured and sold furniture under\n                    the mark “OM”. The defendant was in the furniture business before\n                    the plaintiff’s incorporation. The plaintiff accused the defendant of\n                    passing off four items of furniture as the plaintiff’s MC furniture.\n                    Evidence was led to show that the defendant’s sales representatives had\n                    made various representations to potential customers that the defendant was the\n                    distributor of OM furniture and had also shown OM newspaper advertisements and\n                    brochures to them. The court allowed the plaintiff’s claim as it was clear\n                    that the defendant had copied the designs of the four items from the OM range of\n                    furniture. The court further held that the existence of goodwill should not be\n                    confused with the value of the goodwill. (This holding was relied on by the\n                    plaintiff to support its submission that goodwill in the ­product need not\n                    necessarily have to exist in Singapore). 48     InTrade\n                        Facilities, the appellant company and its controller one Looi was\n                    charged with importing and selling counterfeit Hennessy XO cognac (“the\n                    brandy”) contrary to s 73 of the Trade Marks Act (Cap 332,\n                    1992 Rev Ed) (“the TMA”). The buyer in Japan suspected the\n                    100 cases of brandy it purchased from the company was counterfeit; the company\n                    agreed to refund the buyer the cost of 97 cases and the cases were then shipped\n                    back to Singapore where they were seized upon arrival. The company was convicted\n                    and fined in the subordinate courts on a private summons lodged by Soci?t? Jas\n                    Hennessy which complainant was represented by the Public Prosecutor\n                    (“PP”). The company appealed against conviction and sentence while\n                    the PP cross-appealed against the sentence. The company’s appeal was\n                    dismissed but the PP’s cross-appeal was allowed. The court held that under\n                    s 73 of the TMA, Looi had committed the act of selling the brandy in\n                    Singapore as all the acts of selling were done by Looi in Singapore. The brandy\n                    had been imported by Looi into Singapore for the purpose of s 73. The\n                    acceptance of the return of the brandy sold in the course of trade was something\n                    done for a purpose of trade and was a necessary incident of the trade of selling\n                    the brandy. 49     The court’s holding above was relied on\n                    by the plaintiff to support its argument that sale of the product not in\n                    Singapore but in Bangladesh sufficed for purposes of establishing goodwill.\n                    However, the court’s holding was specific to prosecution under s 73\n                    of the TMA and has no application to our facts. This is clear from the section\n                    which states: Any person who imports, sells or exposes or has in his\n                        possession for sale or for any purpose of trade or manufacture, any goods or\n                        thing to which a counterfeit trade mark is applied or to which a registered\n                        trade mark is falsely applied, shall, unless he proves that — (a)having taken all reasonable precautions\n                                against committing an offence under this section, he had, at the\n                                time of the commission of the alleged offence, no reason to suspect\n                                the genuineness of the mark…; or (b)he had acted reasonably be guilty of an offence and shall be liable on conviction to a fine not\n                        exceeding $10,000 for each goods or thing to which the counterfeit trade\n                        mark is applied… 50     The relevant legislation for our case is the\n                    Copyright Act, not the TMA. The sections relied on by the third defendant are\n                    set out in the paragraphs below. Interpretation 7—(1) In this Act, unless the context\n                        otherwise requires — \"artistic work\" means — (a) a painting, sculpture, drawing, engraving or photograph, whether the\n                        work is of artistic quality or not; (b) a building or model of a building, whether the building or model is of\n                        artistic quality or not; or (c) a work of artistic craftsmanship to which neither paragraph (a) nor (b)\n                        applies. but does not include a layout-design or an integrated circuit within the\n                        meaning of section 2 (1) of the Layout-Designs of Integrated Circuits Act\n                        (Cap. 159A). Counsel for the first and second defendants pointed out that the\n                    plaintiff had produced no evidence of the “artistic work” as\n                    defined in s 7 of the Copyright Act as having been printed or published\n                    anywhere else or in any form other than on the surface of the cans of the\n                    product. 51     Counsel then drew the court’s attention\n                    to s 70 of the Copyright Act which states: Special exception for artistic works which have been\n                            industrially applied (1) Notwithstanding section 69, the making of any useful article in 3\n                        dimensions (including a reproduction in 2 dimensions reasonably required for\n                        the making of the article) does not infringe the copyright in an artistic\n                        work if, when the useful article or reproduction is made, the artistic work\n                        has been industrially applied in Singapore or in any other country at any\n                        time before the useful article or reproduction is made. (2) For the purposes of subsection (1), an artistic work is applied\n                        industrially if — (a) more than 50 reproductions in 3 dimensions are made of it, for the\n                        purposes of sale or hire; (b) it is reproduced in 3 dimensions in one or more articles manufactured\n                        in lengths, for the purposes of sale or hire; or (c) it is reproduced as a plate which has been used to produce\n                        — (i) more than 50 reproductions of an object in 3 dimensions for the\n                        purposes of sale or hire; or (ii) one or more articles in 3 dimensions manufactured in lengths for the\n                        purposes of sale or hire. (3) For the purposes of subsection (2), 2 or more reproductions in 3\n                        dimensions which are of the same general character and intended for use\n                        together are a single reproduction. (4) In this section, “useful article” means an article\n                        having an intrinsic utilitarian function that is not merely to portray the\n                        appearance of the article or to convey information. (5) For the purposes of this section, an article that is normally part of\n                        a useful article is considered a useful article. 52     Based on Hseng’s first affidavit (para\n                    26) and the statement of claim (at para 29.3) on the plaintiff’s sales of\n                    the product in Bangladesh between 2006 and 2009, counsel pointed out that it was\n                    undisputed that more that 50 reproductions in 3 dimensions (vizthe can) of the “artistic work” had been made\n                    by the plaintiff for the Bangladesh market. He argue that by virtue of\n                    s 70(1) read with subsection (2), the “artistic work” had\n                    been “applied industrially” on “useful articles” as\n                    defined in subsection (4). Consequently, s 70 provided an unassailable\n                    defence to his clients on the alleged infringement of copyright in the\n                    “artistic work” set out at[19]. 53     Counsel for the first and second defendants\n                    further relied on s 74 of the Copyright Act which states: (2) Where copyright subsists in an artistic work, and — (a) a corresponding design is applied industrially (whether in Singapore\n                        or elsewhere) by or with the licence of the owner of the copyright in the\n                        work; (b) articles to which the design has been so applied are sold, let for\n                        hire, or offered for sale or hire whether in Singapore or elsewhere;\n                        and (c) at the time when those articles are sold, let for hire or offered or\n                        exposed for sale or hire, they are not articles in respect of which the\n                        corresponding design has been registered or, is deemed registered under the\n                        Registered Designs Act (Cap. 266), subsections (3), (4), (5) and (6) shall apply. (3) Subject to subsection (5) — (a) during the relevant period of 15 years, it shall not be an\n                        infringement of the copyright in the work to do anything which, at the time\n                        when it is done, would have been within the scope of the copyright in the\n                        design if the design had, immediately before that time, been registered in\n                        respect of all relevant articles; and (b) after the end of the relevant period of 15 years, it shall not be an\n                        infringement of the copyright in the work to do anything which, at the time\n                        when it is done, would, if the design had been registered immediately before\n                        that time, have been within the scope of the copyright in the design as\n                        extended to all associated designs and articles. (5) For the purposes of subsections (2) and (3), no account shall be taken\n                        of any articles in respect of which, at the time when they were sold, let\n                        for hire, or offered for sale or hire, the design in question was excluded\n                        from registration under the provisions of the Registered Designs Act or the\n                        Registered Designs Act 1949 of the United Kingdom (U.K. 1949, c. 88) (as the\n                        case may be), by rules made under the applicable Act (which relates to the\n                        exclusion of designs for articles which are primarily literary or artistic\n                        in character). As the “artistic work” on the can being a\n                    “corresponding design” had been industrially applied and it was\n                    registrable under the Registered Designs Act (Cap 266, 2005 Rev Ed)\n                    (but it was not), it enjoyed no copyright protection. 54     In addition, Rule 12 of the Copyright\n                    Regulations provides: Circumstances in which design is to be deemed to be\n                            applied industrially (1) For the purposes of section 74 of the Act, a design shall be deemed to\n                        be applied industrially if it is applied — (a) to more than 50 articles; or (b) to one or more articles (other than hand-made articles) manufactured\n                        in lengths or pieces. … (3) For the purposes of this regulation, a design shall be deemed to be\n                        applied to an article if — (a) the design is applied to the article by a process (whether a process\n                        of printing, embossing or otherwise); or… Consequently, s 74 of the Copyright Act read with Rule 12(1) and\n                    (3) of the Copyright Regulations also provided an unassailable defence to the\n                    first and second defendants. 55     The plaintiff on the other hand relied on\n                    s 30(5) of The Copyright Act which states: Ownership of copyright in original\n                        works 30. —(1) This section shall have\n                        effect subject to Part X … … (4) Where a literary, dramatic or artistic work is made by the author in\n                        pursuance of the terms of his employment by the proprietor of a newspaper,\n                        magazine or similar periodical under a contract of service or apprenticeship\n                        and is so made for the purpose of publication in a newspaper, magazine or\n                        similar periodical, the proprietor shall be entitled to any copyright\n                        subsisting in the work by virtue of this Part insofar as the copyright\n                        relates to — (a) publication of the work in any newspaper, magazine or similar\n                        periodical; or (b) reproduction of the work for the purpose of its being so\n                        published, but not otherwise. (5) Subject to subsection (4), where — (a) a person makes, for valuable consideration, an agreement with another\n                        person for the taking of a photograph, the painting or drawing of a portrait\n                        or the making of an engraving by the other person; and (b) the work is made in pursuance of the agreement, the first-mentioned person shall be entitled to any copyright subsisting\n                        in the work by virtue of this Part, except that if the work is required for\n                        any particular purpose, that purpose shall be communicated to that other\n                        person and that other person shall be entitled to restrain the doing,\n                        otherwise than for that particular purpose, of any act comprised in the\n                        copyright in the work. In my view, s 30 of the Copyright Act has no application as\n                    Khurseed’s affidavit cast doubts on the plaintiff’s ownership of the\n                    “artistic work” comprised in the design on the product’s\n                    can. Moreover, the plaintiff’s executive director Cheng (see[18]supra) should but did not, file any affidavit\n                    to corroborate Hseng’s claim that Cheng was the author of the\n                    “artistic work”. Furthermore, I noted that the can for the product\n                    and that for the plaintiff’s Vicplas brand of solvent cement ([16]supra) was remarkably similar in get-up save for\n                    the brands. This can be seen from the following picture of a Vicplas\n                    can:  56     The plaintiff had cited the Court of Appeal\n                    case ofNovelty Pte Ltd v Amanresorts Ltd and\n                        another[2009] 3 SLR(R) 216. That case stood for the\n                    proposition that it is sufficient if goodwill exists in a small section of the\n                    public as long as the section is not negligible. (In that case, the goodwill of\n                    the Aman name was limited to those with a high income who would have been\n                    exposed to the respondent’s advertising of and experienced its operation\n                    of, ultra-luxurious resorts in exotic locations around the world). 57     As forAlteco Chemical Pte\n                        Ltd v Chong Yean Wah[1999] 2 SLR(R) 915, that case\n                    concerned passing off by the defendant of the plaintiff’s super glue which\n                    was sold in small tubes under the get-up known as SG-12. The super glue was\n                    produced and sold in Singapore and overseas by the plaintiff, who was assigned\n                    the copyright in the SG-12 get-up by another company in 1990. The plaintiff\n                    advertised the SG-12 get-up extensively and sales improved tremendously. The\n                    plaintiff pointed out that an injunction was granted to the plaintiff\n                    notwithstanding that there were no trading activities in Singapore. However, I\n                    note that Justice GP Selvam’sdicta(at[42]) in this regard has been taken out\n                    of context. What he actually said was: In the result, where there has been no trading, the appropriate remedy is\n                        an injunction and, if the circumstances warrant, an order for an account of\n                        profits. Where there has been actual trading and therefore actual goodwill,\n                        the appropriate remedies are an injunction to restrain future passing off\n                        and an inquiry as to damages. The evidence in that case clearly showed that the plaintiff sold the\n                    super glue using the SG 12 get-up both in and outside Singapore. 58     The caseGabriel Peter\n                        & Partners (suing as a firm) v Wee Chong Jin & Others[1997] 3 SLR(R) 649 did not help to advance the plaintiff’s\n                    case. The Cour of Appeal had there spelt out when a court would exercise its\n                    powers to strike out pleadings under O 18 r 19 of the Rulesvizonly in plain and obvious cases. 59     Was this then a “plain and obvious\n                    case” that warranted the striking out of the plaintiff’s pleadings\n                    as set out in the second application (at[13])? I was of the view it was. 60     In paras 28 to 31 of the statement of claim,\n                    the plaintiff detailed the goodwill it had acquired in the product in\n                    Bangladesh. In paras 32, 33, 35 to 42, 44 to 46, the plaintiff alleged passing\n                    off of the product by the three defendants by their production and or sale of\n                    the cheaper prodcut. In para 55, the plaintiff alleged the three defendants had\n                    conspired to commit passing off of the product, thereby infringing the\n                    plaintiff’s copyright. The plaintiff’s claim in passing off was\n                    obviously unsustainable based on case law. 61     Further, to succeed in passing off, there must\n                    be the requirements known as the classical trinityvizgoodwill, misrepresentation and damage (per Lord Oliver inReckitt & Colman Products Ltd v Borden Inc[1990] 1 WLR 491 at p 499). The plaintiff did not pass the threshold\n                    of the first requirement as it had no goodwill in the product in Singapore. The\n                    plaintiff’s cause of action if any, was in Bangladesh not in Singapore.\n                    Counsel for the plaintiff did not present any convincing arguments that refuted\n                    the submissions of the first and second defendants based on sections of The\n                    Copyright Act referred to earlier at[50]and[53]. 62     It was plainly obvious that the\n                    plaintiff’s claim for passing off could not possibly succeed as there was\n                    no basis to found such a claim in Singapore against any of the three defendants.\n                    Consequently I granted the second application and allowed the\n                Appeal."
    }
}