{
    "case_title": "The “Shen Ming Hong 7”",
    "ncitation": "[2010] SGHC 269",
    "coram": "Chan Wei Sern Paul AR",
    "sections": {
        "Introduction": "1       In this application before the court, the\n                    plaintiff requested for a stay of execution of a decision by Assistant Registrar\n                    Ang Ching Pin (“AR Ang”) pending appeal. Amongst other matters,\n                    that decision had to do with the release of a vessel from arrest. Having heard\n                    submissions from both parties, I was of the view that a stay of execution was,\n                    in the circumstances, appropriate and allowed the application. 2       In many respects, the above application, and the\n                    resulting decision, is not uncommon. Accordingly, it might be thought that all\n                    the principles relevant thereto would have already been established. However,\n                    both sets of counsel assured me that this was not so. During the hearing for the\n                    determination of the application, both sets of counsel informed me that there\n                    was no local authority dealing directly with the issue at hand - when a stay of\n                    execution should be granted over a decision to release a vessel from arrest.\n                    Further, the nature of the application also meant that any appeal to a High\n                    Court Judge was unlikely to be filed in this specific instance; it might also be\n                    ventured that the same could be said of future similar applications. For these\n                    reasons, I am persuaded that it would be helpful for me to render the basis of\n                    my decision for scrutiny. I shall nevertheless endeavour to be\n                brief.",
        "The factual background": "3       In Admiralty in Rem No. 121 of 2010\n                    (“Adm 121/2010”), the plaintiff claimed,inter\n                        alia, against the defendant for delivery of 41,000 metric tons of\n                    Iron Ore Fines (“the cargo”). The facts underlying that claim are\n                    uncomplicated; even so, it is only necessary for present purposes to provide a\n                    bare skeleton of those facts. 4       The plaintiff is an Indian company carrying on\n                    the business of manufacturing and exporting iron ore. In the course of its\n                    business, it had chartered a vessel “Shen Ming Hong 7”\n                    (“the Vessel”) to transport the cargo from Mormugao, Goa, India to\n                    Tianjin, China. The Vessel was owned by the defendant, a company incorporated in\n                    Panama. As is typical of shipping companies, the defendant is a one-ship company\n                    whose only asset of any value was the Vessel. 5       In time, a dispute arose between the plaintiff\n                    and the defendant arising out of the transport of the cargo. The plaintiff\n                    alleged that the defendant had wrongfully delivered the cargo to a third party\n                    instead of the plaintiff. The defendant denied that allegation and asserted that\n                    the plaintiff had, instead, failed to come forward to claim the cargo at\n                    Tianjin, China. The result was that the cargo was, and still is, stored under\n                    the supervision of the Chinese customs authority. 6       In order to recover the cargo (or,\n                    alternatively, damages), the plaintiff commenced Adm 121/2010; the vessel was\n                    arrested on 14 July 2010 as security for the plaintiff’s claims.\n                    Slightly more than one month after the arrest, on 17 August 2010, the\n                    defendant responded by applying to set aside the Writ of Summons as well as\n                    Warrant of Arrest and sought damages for wrongful arrest. 7       AR Ang heard the defendant’s application\n                    on 1 September 2010; her decision was delivered the following day. She\n                    ordered that the Warrant of Arrest be set aside and the Vessel be released.\n                    Costs were also awarded to the defendant. However, she made no order in relation\n                    to the defendant’s other prayers. Specifically, she did not award any\n                    damages for wrongful arrest nor was she inclined to strike out the Writ of\n                    Summons. Against that decision both the plaintiff and the defendant appealed.\n                    The plaintiff’s appeal is currently scheduled, on an urgent basis, to be\n                    heard on 13 September 2010. Presumably, the defendant’s appeal would\n                    be fixed to be heard at the same time. 8       To prevent the Vessel from leaving Singapore\n                    waters pending the determination of the appeals, the plaintiff prayed,inter alia, for the following relief in Summons 4163 of\n                    2010: That the order made by the Assistant Registrar Ms. Ang Ching Pin on\n                        2 September 2010 that the Warrant of Arrest be set aside and the vessel\n                        “SHEN MING HONG 7” be released from arrest, be stayed pending\n                        the determination of the Plaintiffs’ appeal against the said order to\n                        a Judge in Chambers.",
        "Parties’ submissions": "9       The plaintiff essentially had only one main\n                    argument in support of its application for a stay of execution. It was argued\n                    that without a stay of execution, the plaintiff’s appeal against AR\n                    Ang’s decision would be nugatory. By the plaintiff’s reckoning, the\n                    contract value of the cargo alone is US$2,898,126.86. As such, the plaintiff had\n                    sought security for its claims against the defendant for the sum of US$3.892\n                    million. However, the defendant stated that it was financially unable to put up\n                    the security; the plaintiff took this to be indicative of the fact that the\n                    defendant was in poor financial standing. More pertinently, the plaintiff\n                    emphasised that the defendant was a foreign company with only one notable asset\n                    – the Vessel. There was no evidence to indicate that the Vessel has any\n                    sister ships or that the defendant possesses any other assets located anywhere\n                    in the world. For these reasons, it was submitted that the plaintiff was\n                    unlikely to be provided with any other security if the Vessel was allowed to\n                    leave Singapore waters. As such, even if the plaintiff was to succeed in its\n                    appeal against AR Ang’s decision, it would obtain no more than a paper\n                    judgment. 10     The defendant, on its part, underlined that it\n                    had obtained a judgment in its favour. As such, it was incumbent on the\n                    plaintiff to demonstrate special circumstances to justify the grant of a stay of\n                    execution. Relying heavily upon the case ofHarte Dennis\n                        Mathew v Tan Hun Hoe and another[2001] SGHC 19\n                        (“Harte Dennis Mathew”), the\n                    defendant argued forcefully that the mere fact that the judgment creditor\n                        (i.e. the defendant in the present case) is a\n                    foreign company was insufficient to justify a stay of execution. That fact,\n                    alone, did not lead irresistibly to the conclusion that the appeal would be\n                    nugatory. In addition, the fact that a large amount of money was involved did\n                    not also, by itself, constitute a special circumstance. On the other hand, the\n                    defendant contended that an order of a stay of execution would cause undue\n                    hardship upon the defendant. Far from denying that the defendant was in poor\n                    financial shape, the defendant instead relied upon that fact to argue that the\n                    mounting arrest costs and expenses would put the defendant in an extremely\n                    prejudicial position. It was estimated that the defendant would have to fork out\n                    an additional US$546,000 if a stay of execution was granted. For these reasons,\n                    the court was urged to dismiss the plaintiff’s application.",
        "The decision of the court": "11     As is well known, an appeal does not operate\n                    as a stay of execution: see O 57 r 15 of the Rules of Court\n                    (Cap 322, R 5, 2006 Rev Ed) and s. 41(1) of the Supreme\n                    Court of Judicature Act (Cap 322, 2007 Rev Ed). The order of a stay of\n                    execution may, however, be made on the application of a litigant. While the\n                    decision to order a stay of execution is entirely at the discretion of the\n                    court, this discretion is to be exercised in accordance with well-established\n                    principles. Two foremost, and competing, principles immediately leap to mind.\n                    First, the court should not deprive a successful litigant of the fruits of his\n                    litigation pending an appeal. On the other hand, when a party is exercising his\n                    undoubted right of appeal, the court ought to see that the appeal, if\n                    successful, is not nugatory. All of the above have been outlined inLee Sian Hee (t/a Lee Sian Hee Pork Trader) v Oh Keng Soon (t/a Ban\n                        Hon Trading Enterprise)[1991] 2 SLR(R) 869 (at [5]).\n                    For ease of reference, I will henceforth refer to the successful litigant as the\n                    “judgment creditor” and the unsuccessful one as “judgment\n                    debtor”. 12     As a result of the interplay between the\n                    above-mentioned principles, it is generally said that in order for a judgment\n                    debtor to obtain a stay of execution, he must first demonstrate the existence of\n                    special circumstances justifying the granting of a stay: see, for instance,Cathay Theatres Pte Ltd v LKM Investment Holdings Pte\n                        Ltd[2000] 1 SLR(R) 15 (at [13]) (“Cathay Theatres”) andLee Kuan\n                        Yew v Jeyaretnam Joshua Benjamin[1990] 1 SLR(R) 772\n                    (at [6]) (“Lee Kuan Yew”). What,\n                    however, qualifies as special circumstances? It has also been said that\n                    “[i]t is not possible to give a catalogue of all the circumstances that\n                    would qualify to be considered as special” (seeCathay\n                        Theatres(at [13])). Nonetheless, a (non-exhaustive) list of\n                    instances where the court had found that special circumstances warranting the\n                    grant of a stay of execution existed may be helpful to ascertain the crux of the\n                    matter. These include situations where: i.the judgment creditor was unlikely to be able to\n                            return monies paid over under a judgment due to a pressing financial\n                            situation: seeLee Yee Ming v Ubin Lagoon Resort Pte\n                                Ltd and others[2003] 4 SLR(R) 344 (at\n                            [7]);ii.the judgment creditor, in executing judgment, was\n                            actively pursuing a winding up of the judgment debtor: seeCathay Theatres(at [15]);iii.the judgment debtor was ordered to complete the\n                            purchase of a property, an order which would be difficult to reverse:\n                            seeCathay Theatres(at\n                        [13]);iv.there was no indication that the judgment\n                            creditor would refrain from demolishing a temple pending the hearing of\n                            an appeal: seeChellapa a/l K Kalimuthu (suing as\n                                public officer of Sri Maha Mariamman Temple, Hicom, Shah Alam,\n                                Selangor) v Sime UEP Properties Bhd[1998]\n                            1 MLJ 20;v.there was a likelihood of the judgment creditor\n                            becoming insolvent before the disposal of the appeal: seeLee Kuan Yew(at [6]);vi.under an order of a court, money was to be paid\n                            out of a fund and distributed among a large number of persons resident\n                            abroad: seeWilson v Church (No 2)(1879)\n                            12 Ch D 454.13     A common thread underlies all of the\n                    above-enumerated situations – they are all instances where the appeal, if\n                    successful, may be rendered nugatory due to the prevailing circumstances.\n                    Indeed, it may be said that the special circumstances necessary for the grant of\n                    a stay of execution are no more than circumstances which made it difficult, if\n                    not impossible to reverse the execution of the underlying judgment. As was\n                    declared inTC Trustees Ltd v JS Darwen Ltd[1969]\n                    2 QB 295 (at 302), “[t]he circumstances... are circumstances\n                    which go to the enforcement of the judgment: and not those which go to its\n                    validity or correctness.”14     That the heart of the matter is the\n                    reversibility of the underlying judgment – and not any other special\n                    circumstances - may be simply explained. It must be remembered that preceding\n                    every application for a stay of execution is a judgment in favour of the\n                    judgment creditor. The court, in laying down this judgment, did not order a stay\n                    of execution. From that moment to the time the applicant, thereafter, applies\n                    for a stay of execution, the only material change in circumstances is usually\n                    the filing of an appeal against the judgment. Given that, the basis for granting\n                    a stay of execution must logically stem from the appeal. From there, it is not\n                    difficult to conclude that it is the teeth of a successful appeal that is in\n                    issue. As to what special circumstances must prevail before a court will grant a\n                    stay of execution, the court is looking for circumstances that will render the\n                    appeal nugatory; the circumstances are only “special” because the\n                    court assumes that, ordinarily, any judgment handed down may be reversed, both\n                    in law and in substance, on appeal. Hence, any circumstances that demonstrate\n                    that that presumption is, on the balance of probabilities, rebutted will usually\n                    suffice as special circumstances.15     In the present case, I agreed with the\n                    defendant’s submission that the fact that the judgment creditor was\n                    ordinarily resident out of jurisdiction was, alone, insufficient to grant a stay\n                    of execution. Nor did the fact that the claim in Adm 121/2010 involved a large\n                    sum of money change that position. However, to my mind, that the judgment\n                    creditor (i.e. the defendant) is a company with no\n                    assets in the world, save for the one ship ordered to be release, was crucial.\n                    This fact meant that the usual forces ensuring that the subsequent appeal would\n                    not be hollow – such as the ability of the judgment debtor to seize the\n                    judgment creditor’s assets or garnish the judgment creditor’s\n                    sources of income if the appeal is allowed – were no longer of much bite.\n                    Once the Vessel is released, there was nothing to stop the defendant from\n                    causing the Vessel to leave Singapore waters. There were simply no real adverse\n                    consequences to deter the defendant from pursuing this cause of action. Indeed,\n                    from the defendant’s argument that the Vessel was incurring substantial\n                    costs by remaining in Singapore, it may be inferred that the defendant had\n                    intentions to take the Vessel out of Singapore and put it to work. If so, it\n                    would be improbable that the plaintiff would be able to obtain any security for\n                    their claim in Adm 121/2010 should they succeed on appeal. I will venture\n                    further; in my opinion, it would also be improbable, without the grant of a stay\n                    of execution, that the plaintiff would be able to obtain any relief if they\n                    succeeded in Adm 121/2010 at the end of the day. In short, both the appeal\n                    against AR Ang’s decision as well as the claim in Adm 121/2010 itself\n                    would be rendered nugatory.16     It might be argued that that the fact the\n                    judgment creditor is a one-ship company could hardly be considered a special\n                    circumstance. It is a feature of the industry that, for liability-insulation\n                    purposes, most ship-owning companies only own one ship and hardly anything else.\n                    This is a common phenomenon. However, I have explained earlier that whether the\n                    circumstances are special, for the purposes of stay of execution applications,\n                    is not to be measured by the ordinariness or particularity of the situation but\n                    by whether the prevailing circumstances are likely to render the appeal\n                    toothless. On this view, the present circumstances might be said to be\n                    “special”, even if they were ordinary by any other\n                measure.17     That, however, was not the end of the matter.\n                    Establishing that the judgment debtor will suffer from severe prejudice if a\n                    stay of execution is not granted is merely one side of the equation. If, on the\n                    other hand, the judgment creditor will also suffer from serious harm, if not\n                    irreparable damage, upon the grant of a stay of execution, the court should not\n                    ordinarily grant the stay. This is because the balance of justice is no longer\n                    in the judgment debtor’s favour. If so, thestatus\n                        quomust remain and the judgment already obtained by the judgment\n                    creditor should be respected.18     In the present case, I accepted the\n                    defendant’s contention that it would incur additional financial costs if a\n                    stay of execution was ordered, though I noted that it had taken more than a\n                    month after the Vessel was arrested before applying to set the arrest aside. I\n                    was also mindful that ordinarily the defendant should be able to obtain damages\n                    for wrongful arrest if the arrest was indeed unwarranted. Indeed, the defendant\n                    has filed an appeal against AR Ang’s decision not to award damages for\n                    wrongful arrest. That being the case, if the defendant is right about the arrest\n                    being completely unwarranted, the defendant should be able to recover the said\n                    financial costs from the plaintiff, whose financial status has not been put into\n                    question by the defendant.Conclusion19     For the above reasons, I allowed the\n                    plaintiff’s application for AR Ang’s decision to be stayed pending\n                    appeal. Costs were reserved to the Judge hearing the appeal against AR\n                    Ang’s decision.",
        "Conclusion": "19     For the above reasons, I allowed the\n                    plaintiff’s application for AR Ang’s decision to be stayed pending\n                    appeal. Costs were reserved to the Judge hearing the appeal against AR\n                    Ang’s decision."
    }
}