{
    "case_title": "Tan Pwee Eng\n      v\n      Tan Pwee Hwa",
    "ncitation": "[2010] SGHC 258",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "Introduction": "1       This is an appeal against the decision of the\n                    district judge against his dismissal of the appellant’s application for a\n                    declaration that a nuncupative will made by the late Tan Kiok Lan\n                    (“TKL”) on 16 July 2009 was her last will and testament.\n                    The sole issue in this appeal is whether a nuncupative or oral will is valid\n                    under the Wills Act (Cap 352, 1996 Rev Ed)(the “Wills\n                    Act”). In my judgment, it is not, for the reasons set out\n                below. 2       The material facts are not in dispute. TKL\n                    passed away on 30 July 2009 and was survived by five children. The\n                    appellant is the fourth child and was TKL’s sole caregiver up until the\n                    time of TKL’s death. The respondents are the remaining four of TKL’s\n                    children. 3       In 2009, in anticipation of TKL’s death,\n                    the appellant enlisted the services of Wills and Trusts Pte Ltd (the\n                    “Company”) for TKL to make her will. The appellant asserted that\n                    this was done on TKL’s instructions, but the respondents asserted\n                    otherwise. They contended that TKL gave no such instructions and that the draft\n                    was done without her knowledge and consent. In the alternative, one of the\n                    respondents (Tan Pwee Hwa @ Lim Pwee Hwa) also contended that her “late\n                    mother was very ill when the purported instructions were given for the alleged\n                    draft [w]ill”. Whatever may have been the case, the issue of her\n                    testamentary capacity is, in the event, immaterial in this appeal and it is\n                    unnecessary for me to go further than pointing out the existence of such a\n                    disagreement. 4       Nevertheless, it is not disputed that\n                    instructions for a will was given on 16 July 2009 under the following\n                    circumstances. On that day, an associate of the Company, Pan Sing Fong\n                    (“Pan”), visited TKL and took her instructions on the will to be\n                    drawn up. Because TKL’s health was failing, the appellant adduced a letter\n                    obtained from the doctor attending to TKL, who certified that TKL was “of\n                    sound mind and rational”. Presumably this letter was meant to prove that\n                    TKL had the requisite testamentary capacity when she gave her instructions\n                    regarding her will. Pan made notes of TKL’s instructions and returned to\n                    his office to prepare the will. On 24 July 2009, Pan visited TKL with\n                    the draft will for execution. However Pan found that TKL was tired and sleepy,\n                    and he felt that it was imprudent to ask her to sign the draft will. He decided\n                    to return another day. 5       Unfortunately that opportunity never arose. On\n                    30 July 2009, TKL passed away and, in the event, the draft will was\n                    not executed. It is with reference to this unexecuted draft will (“the\n                    Draft Will”) that the appellant now seeks a declaration. The appellant\n                    argued that the instructions TKL gave to Pan amounted to a nuncupative will and\n                    the resulting Draft Will comprised the details of that nuncupative will. The\n                    appellant asked that the Draft Will be declared TKL’s last will and\n                    testament. 6       The appellant’s counsel submitted that the\n                    Draft Will amounted to a nuncupative will, or evidence of it. The first question\n                    is, what is a nuncupative will? In L B Curzon,Dictionary of Law(Pitman Publishing, 4th Ed, 1983) it is\n                    defined in the following manner: Nuncupative will. (Nuncupare= to name, declare.) A verbal testament. Abolished\n                        under the W.A. 1837, s.9, except in the case of privileged wills (q.v.) made\n                        by those on active service. 7       The Statute of Frauds 1676 (AD 1676\n                    Cap III) (UK) (“Statute of Frauds”) altered the law regarding\n                    the validity of nuncupative wills by restricting its scope. Section 19\n                    thereof provides as follows: XIX.  And for Prevention of fraudulent Practices in\n                            setting up Nuncupative Wills, which have been ‘the Occasion of\n                            much Perjury;’ (2) Be it enacted by the Authority aforesaid, That\n                            from and after [24 June 1677] no Nuncupative Will shall be good,\n                            where the Estate thereby bequeathed shall exceed the Value of thirty\n                            Pounds, that is not provided by the Oaths of three Witnesses (at the\n                            least) that were present at the Making thereof; (3) nor unless it be\n                            proved that the Testator at the Time of pronouncing the same, did bid\n                            the Persons present, or some of them, bear Witness, that such was his\n                            Will, or to that Effect; (4) nor unless such Nuncupative Will were made\n                            in the Time of the last Sickness of the Deceased, and in the House of\n                            his or her Habitation or Dwelling, or where he or she hath been Resident\n                            for the Space of ten Days or more next before the making of such Will,\n                            except where such Person was surprized or taken sick, being from his own\n                            Home, and died before he returned to the Place of his or her\n                            Dwelling. 8       It would appear that prior to the enactment of\n                    the Statute of Frauds, nuncupative wills, which merely describes oral wills, had\n                    been the subject of fraudulent practices. Section 19 of the Statute of\n                    Frauds provides that a nuncupative will shall not be a valid will (for an estate\n                    of value exceeding 30 Pounds Sterling), unless it is made in compliance with the\n                    conditions specified therein. The principal requirements are: (a) it must be\n                    witnessed by at least three persons; (b) the Testator must declare to the\n                    persons present that such was his will; (c) it must be made “in the time\n                    of the last sickness” of the Testator (described by commentators as\n                        “in extremis”); (d) unless the\n                    Testator had, on account of sudden illness, been removed from his home and had\n                    died before he could return, it must be made in his home, or a place in which he\n                    had resided for at least ten days. 9       In Sir William Blackstone’sCommentaries on the Laws of England(A Strahan, 15th Ed\n                    1809, vol 2), the law relating to nuncupative wills at the time is\n                    described in the following manner at p 499: These testaments are divided into two sorts;written, andverbalornuncupative; of which the former is\n                        committed to writing, the latter depends merely upon oral evidence, being\n                        declared by the testatorin extremisbefore a\n                        sufficient number of witnesses, and afterwards reduced to writing. [emphasis\n                        in original] 10     That position obtained until the enactment in\n                    1837 of the English Wills Act (7 Will 4 1 Vict cap 26) (UK) (“1837 Wills\n                    Act”). Section 9 of the 1837 Wills Act provided that any will not\n                    made in accordance with the provisions of that Act shall not be valid\n                    dispositions, except as provided in s 11 which operated in relation to\n                    soldiers and seaman. Hence nuncupative wills were no longer valid for persons\n                    outside those coming within the operation of s 11 and its utility was\n                    therefore limited to very narrow circumstances. The 1837 Wills Act formed the\n                    basis of the 1838 Indian Wills Act (Act No XXV of 1838), which is the precursor\n                    to the Wills Act. 11     I turn to examine the position of the Draft\n                    Will under the Wills Act. Section 6(1) of the Wills Act provides as\n                    follows: No will shall be valid unless it is in writing and executed in the manner\n                        mentioned in subsection (2). As the Draft Will was not executed, for it to be valid, it must come\n                    within some other provision of the Wills Act that exempts it from the operation\n                    of s 6(1). The only provision in the Wills Act that touches on nuncupative\n                    wills is s 27, which provides as follows: (1)   Notwithstanding anything in this Act, any soldier\n                        being in actual military service, or any mariner or seaman being at sea, may\n                        dispose of his personal estate as he might have done before the making of\n                        this Act and may do so even though under the age of 21 years. ... (4)   This section shall extend to any member of any naval\n                        or marine forces not only when he is at sea but also when he is so\n                        circumstanced that if he were a soldier he would be in actual military\n                        service within the meaning of this section. (5)   For the purposes of this section,\n                        “soldier” includes a member of an air force. 12     The effect of s 27(1) is to retain the\n                    law relating to nuncupative wills prior to 1837 in relation to the narrow group\n                    of persons falling within that provision. There is no question that TKL does not\n                    fall within this group of persons. Therefore the operation of s 6(1) in\n                    relation to the Draft Will is not affected by s 27. As it was not executed\n                    in the manner set out in s 6(2) – it was not signed at all by the\n                    testator – the Draft Will is not valid by operation of s 6(1). It\n                    does not matter if it is a nuncupative will made in compliance with s 19 of\n                    the Statute of Frauds. 13     Counsel for the appellant however made a\n                    further submission, based on the provisions in the Rules of Court (Cap 322,\n                    R 5, 2006 Rev Ed)(“ROC”). He pointed out that O 71,\n                    r 46 makes provisions for nuncupative wills and therefore such a will must\n                    be valid. That order provides: Applications in respect of nuncupative wills and copies\n                            of wills (O. 71, r. 46) 46.—(1) An application for an order\n                        admitting to proof a nuncupative will, or a will contained in a copy, a\n                        completed draft, a reconstruction or other evidence of its contents where\n                        the original will is not available, may be made to the Court by\n                        summons: Provided that where a will is not available owing to its being retained in\n                        the custody of a foreign court or official, a duly authenticated copy of the\n                        will may be admitted to proof by virtue of section 11 of the [Wills] Act\n                        without any such order as aforesaid. Counsel further referred to an observation inSingapore Court Practice 2009(Jeffrey Pinsler SC) (LexisNexis,\n                    2009) (“SCP”) relating to O 71, r 46 of the ROC, at\n                    para 71/2/1: 71/2/1.  Nuncupative will. A\n                        nuncupative will or privileged will is a verbal testament depending only\n                        upon oral evidence, being declared by the testatorin\n                            extremisbefore a sufficient number of witnesses and\n                        afterwards reduced to writing (2 Br Comm 500). While s 27 of the Wills\n                        Act (Cap 352) is restrictive in scope (ie applying only to servicemen),\n                        a nuncupative will applies to any onein\n                            extremis. [emphasis in original] 14     The first point to bear in mind is that the\n                    ROC is subsidiary legislation, enacted to give effect to primary legislation\n                    which, in the case of O 71, r 46, is the Wills Act. The tail cannot\n                    wag the dog – what is invalidated by an Act of Parliament cannot be\n                    resuscitated in the ROC by the Rules Committee. It is important to understand\n                    that a nuncupative will for what it is: an oral testament, which may or may not\n                    be valid as a will under the Wills Act. Prior to the enactment of the Statute of\n                    Frauds, there were no conditions placed on its validity as a testamentary\n                    disposition. The Statute of Frauds however imposed conditions on its validity\n                    and, after the enactment of the Wills Act, nuncupative wills were no longer\n                    valid except in relation to persons coming within s 27 of the Wills Act.\n                    Therefore the provision in O 71, r 46 on the procedure relating to\n                    nuncupative wills is only relevant to the situation where a nuncupative will is\n                    required to be proved in court. This can only pertain to a person within the\n                    contemplation of s 27 of the Wills Act. In relation to any other person, a\n                    nuncupative will is not valid and O 71 r 46 has no relevance. Seen\n                    from this perspective, the observation in SCP reproduced in [13] is simply that\n                    a nuncupative will applies to any onein extremisand only valid for those falling within the s 27 of the Wills\n                Act. 15     In conclusion, I make the following\n                    observation. The formalities required of a valid will are clearly set out in the\n                    Wills Act. If those formalities are not met, and unless the testator falls\n                    within any statutory exception, the will is not valid. A nuncupative will is\n                    therefore not valid unless it is made by a person falling within s 27 of\n                    the Wills Act. There may well be circumstances in which the requirements of the\n                    Wills Act prevent the disposal of the estate of a deceased person in accordance\n                    with his or her last wishes. However the problem lies in ascertaining what\n                    exactly are those last wishes and the legislature has taken the position that\n                    obtains in the Wills Act. This policy has been in force for a very long time,\n                    the primary objective of which is to guard against fraud. Insofar as this may be\n                    said to operate harshly at times, I would state that any such possibility may,\n                    to some extent, be ameliorated by the Intestate Succession Act (Cap 146,\n                    1985 Rev Ed) which provides for distribution to the children or other\n                    relatives of a person who dies intestate as a result of the invalidity of his\n                    will. 16     Accordingly, the appeal is dismissed. I will\n                    hear counsel on the issue of costs."
    }
}