{
    "case_title": "LaserResearch (S) Pte Ltd (in liquidation)\n      v\n      Internech Systems Pte Ltd and another matter",
    "ncitation": "[2010] SGHC 285",
    "coram": "Belinda Ang Saw Ean J",
    "sections": {
        "Introduction and background facts": "1       In January 2008, Internech Systems Pte Ltd\n                    (“Internech”) commenced an action against LaserResearch (S) Pte\n                    Ltd (“LaserResearch”) for the sum of $81,451.15 in unpaid invoices\n                    (“the DC Suit”). LaserResearch admitted 14 out of the 25 invoices\n                    Internech’s claim was based on, and the former duly made payment after the\n                    Writ of Summons was issued in the District Court (ie, the DC Suit). It disputed the remaining 11 invoices, which\n                    totalled $62,142.94, on the basis that the goods under those documents were not\n                    delivered to it or to persons who had authority to accept the goods on its\n                    behalf. Internech applied for summary judgment for the balance of its claim on\n                    the 11 invoices. 2       At the hearing of the application for summary\n                    judgment, the Deputy Registrar entered judgment on four of the invoices,\n                    totalling $1,260.31 and granted LaserResearch leave to defend the claim against\n                    the remaining seven invoices, totalling $60,884.63, on the condition that it\n                    furnished a banker’s guarantee in Internech’s favour.\n                    Internech’s appeal against the Deputy Registrar’s conditional order\n                    was dismissed. 3       LaserResearch duly put its bank in funds and\n                    secured the required banker’s guarantee on 28 August 2008. On\n                    24 April 2009, Internech filed an Affidavit Verifying List of Documents.\n                    No further formal steps in the proceedings were taken in the DC Suit after\n                    that. The parties’ lawyers continued to communicate, however, in the\n                    search for a settlement. The date of the last correspondence between the\n                    parties’ lawyers on the matter was 4 May 2009. 4       On 15 May 2009, LaserResearch went into\n                    provisional liquidation and a provisional liquidator was appointed on\n                    15 May 2009 by way of directors’ resolution and accompanying\n                    statutory declaration of the company’s inability to continue with the\n                    company’s business. Both documents were duly filed with the Accounting and\n                    Corporate Regulatory Authority. In the normal course of events, Internech\n                    received a letter dated 18 May 2009 giving it notice that a\n                    creditors’ meeting was to be convened on 12 June 2009. While at that\n                    time it had been in the midst of preparing affidavits of evidence-in-chief of\n                    their witnesses for the trial, its solicitors advised that the DC Suit had been\n                    stayed as a result of the winding up and that the company could not proceed with\n                    the DC Suit except by leave of court. Rather than seek leave of court to\n                    continue with the proceedings, Internech instead filed proof of debt against\n                    LaserResearch on 1 June 2009. On 12 June 2009, at the creditors’\n                    meeting, a liquidator was appointed. It is common ground that commencement date\n                    of the creditors’ voluntary winding up of LaserResearch was 15 May\n                    2009. 5       On 5 February 2010, LaserResearch’s\n                    solicitors wrote to Internech requesting that the banker’s guarantee be\n                    returned together with a written confirmation that the former could proceed to\n                    effect cancellation of the banker’s guarantee in view of its liquidation.\n                    In the same letter, LaserResearch’s solicitors drew attention to\n                    Internech’s inaction in DC Suit since May 2009. Internech was also\n                    informed that an application would be taken out should the request not be\n                    acceded to by 5.00 pm on 18 February 2010. No reply was received by\n                    that deadline and the liquidator, accordingly, commenced the present application\n                    (viz Originating Summons No 495 of 2010 (“OS 495”)) for,inter alia, an order to cancel the\n                    banker’s guarantee on the ground that DC Suit was deemed discontinued\n                    under O 21 r 2(6) of the Rules of Court (Cap 322, R 5,\n                    2006 Rev Ed) (“ROC”). It is common ground that more than one\n                    year had lapsed since the last step in the proceedings on 24 April 2009\n                    (“the trigger date”). OS 495 was filed more than one year after\n                    the trigger date.",
        "Issue": "6       The facts are undisputed, and for the purpose of\n                    OS 495, the narrow issue before me was simply whether time continued to run\n                    under O 21 r 2(6) of the ROC even though the proceedings had already\n                    been stayed by virtue of s 299(2) of the Companies Act (Cap 50,\n                    2006 Rev Ed) on 15 May 2009. This issue turns on the interpretation\n                    of, and inter-relationship between a statutory stay of proceedings pursuant to\n                    s 299(2) of the Companies Act and the strict language of O 21\n                    r 2(6A) which refers only to stay of proceedings pursuant to an order of\n                    court.",
        "Discussion and conclusions on the issue": "7       The relevant parts of O 21 r 2 read as\n                    follows: (6)    Subject to paragraph 6(a), if no party to an\n                            action or cause or matter has,for more than one\n                                year(or such extended period as the Court may allow\n                            under paragraph (6B)), taken any step or proceeding in the action, cause\n                            or matter that appears from records maintained by the Court, the action,\n                            cause or matter is deemed to have been discontinued. (6A)  Paragraph 6 shall not apply where the action,\n                            cause or matter has been stayed pursuant to an order of\n                        court. (6B)  The Court may, on an application by any party\n                            madebeforethe one year referred to in\n                            paragraph (6) has elapsed, extend the time to such extent as it may\n                            think fit. [emphasis added] 8       It is also convenient to now set out the text of\n                    s 299(2) of the Companies Act pertaining to creditors’ voluntary\n                    winding up: (2) After the commencement of the winding up no action or proceeding shall\n                        be proceeded with or commenced against the company except by leave of the\n                        Court and subject to such terms as the Court imposes. 9       Before me, opposing arguments were canvassed on\n                    the inter-relation of the two provisions above. Internech, who was represented\n                    by Mr Ng Yeow Khoon (“Mr Ng”), pointed out that since DC\n                    Suit was already stayed under s 299(2) of the Companies Act, O 21\n                    r 2(6) did not apply. Mr Ng submitted that the purpose of the deeming\n                    provision is to catch tardy litigants, not actions that are automatically stayed\n                    by legislation like, for example, s 299(2) of the Companies Act. In\n                    contrast, counsel for LaserReasearch, Mr Terence Tan\n                    (“Mr Tan”) asserted that even though the DC Suit was stayed\n                    by virtue of s 299(2), time continued to run under O 21 r 2(6) as\n                    the statutory stay wasnot“pursuant to an\n                    order of court” as prescribed by O 21 r 2(6A). In effect,\n                    Mr Tan contended that the proper procedure Internech ought to have adopted\n                    was to first seek leave of court to lift the statutory stay on the DC Suit, and\n                    to follow thereafter with an application for an order of court to stay the same\n                    DC Suit under O 21 r 2(6A) (hereafter referred to as “the\n                    suggested procedural steps”). The suggested procedural steps would have\n                    to be takenbeforethe guillotine date as time\n                    continued to run O 21 r 2(6). Mr Tan also suggested another way\n                    to avoid the guillotine date by extending the 12-month period under O 21\n                    r 2(6B). Again there is a need to first lift the stay under s 299(2)beforeresorting to O 21\n                    r 2(6B). 10     Section 19(c) of the Interpretation Act\n                    (Cap 1, 2002 Rev Ed), which Mr Ng directed my attention to,\n                    provides that “no subsidiary legislation made under an Act shall be\n                    inconsistent with the provisions of any Act”. In a conflict between\n                    subsidiary legislation and a primary legislation, the latter will prevail.\n                    However, this is not an instance of conflict falling within the ambit of\n                    s 19(c). Rather, the rival submissions of counsel point to two possible\n                    readings of the inter-relation of a statutory provision and a rule in a\n                    subsidiary legislation. The starting point, therefore, is to ascertain the\n                    rationale of s 299(2) of the Companies Act and O 21r 2(6) of ROC,\n                    and thereafter examine their differences, if any, in terms of their respective\n                    purpose and function. 11     I begin with s 299(2) of the Companies\n                    Act. The prohibition against commencing or proceeding with an action or other\n                    proceeding against a company upon the commencement of a creditors’\n                    voluntary winding up without leave of court is found in s 299(2) of the\n                    Companies Act. This statutory stay is an important statutory feature with\n                    respect to liquidation of companies. Upon commencement of winding up, a\n                    statutory regime (which provisions are contained in the Companies Act and the\n                    Companies (Winding Up) Rules) aimed at the orderly realisation of the debtor\n                    company’s assets and the fair and equitable settlement of its\n                    creditors’ claims is triggered. Similar provisions are found in\n                    s 262(3) of the Companies Act which applies to compulsory winding up, and\n                    s 227(c) which deals with judicial management, and also in ss 45(3), 56F\n                    and 76 of the Bankruptcy Act (Cap 20, 2009 Rev Ed). The rationale of\n                    s 299(2) and the statutory ring fencing regime that arises upon winding up\n                    (which also applies with equal force to a bankruptcy) has been considered inKorea Asset Management Corp v Daewoo Singapore Pte Ltd\n                        (in liquidation)[2004] 1 SLR(R) 671 (“Korea Asset Management”) at [36]: … it is to prevent the company from being further burdened by\n                        expenses incurred in defending unnecessary litigation. The main focus of a\n                        company and its liquidators once winding up has commenced should be to\n                        prevent the fragmentation of its assets and to ensure that the interests of\n                        its creditors are protected to the fullest extent. In other words, returns\n                        to legitimate creditors should be maximised; the process of collecting\n                        assets and returning them to legitimate creditors should be attended to with\n                        all practicable speed. Unnecessary costs should not be incurred; liquidators\n                        should act in the collective interests of all legitimate stakeholders and\n                        not with a view to enhancing their own self-interests or fees. 12     In other words (seeWoon’s Corporations Law, Issue 34 (2010), LexisNexis at\n                    para 3753): The purpose of s 299(2) ... is to preserve the limited assets of the\n                        company in the best way for distribution among all the persons who have\n                        claims upon them. As the fund is limited, it ought not to be diminished\n                        because of costs incurred due to actions against the company. ... The policy\n                        in winding up is that all claims should generally be disposed of by the\n                        cheap summary procedure of proving a debt in the winding up rather than by\n                        dissipating the assets in a multiplicity of suits. 13     I keep in mind the purpose and function of\n                    s 299(2) as I turn now to examine O 21 r 2 of ROC. 14     The relevant extracts of O 21 r 2\n                    have already been set out above at[7].\n                    Order 21 r 2(6) is intended to cut down delays in litigation. The rule\n                    is intended to ensure that litigants progress the action expeditiously. The\n                    deeming provision in O 21 r 2(6) obviates the need for separate\n                    applications to strike out dormant actions for want of prosecution. InTan Kim Seng v Ibrahim Victor Adams[2004]\n                    1 SLR(R) 181at [20], it was explained that the rationale behind\n                    O 21 r 2 was “the maintenance of an efficient judicial system\n                    which required less policing, with the imposition of drastic consequences for\n                    tardy litigants”. The deemed discontinuance provision does not operate\n                    where the action has been stayed “pursuant to an order of court”\n                    (see O 21 r 2(6A)). A stay order is granted if the court is persuaded\n                    to halt the court proceedings, and with that time stops running for the 12-month\n                    period. Another way of avoiding the 12-month guillotine is to extend the\n                    12-month period under O 21 r 2(6B) so long as the appropriate\n                    application is madebeforethe guillotine\n                    date. 15     Given that the purpose of s 299(2) is the\n                    preservation of an insolvent company’s assets, and that the purpose of\n                    O 21 r 2(6) is to ensure litigants progress actions expeditiously,\n                    could the suggested procedural steps advocated by Mr Tan have been intended\n                    by the draftsmen? I am not persuaded that it is so. Mr Tan was unable to\n                    cite me any cases supporting any of his propositions, and in any event, there\n                    are a number of difficulties with his submissions. 16     LaserResearch’s construction of\n                    O 21 r 2(6A) and s 299(2) of the Companies Act from where\n                    Mr Tan’s suggested procedural steps are derived, produces a result\n                    that is manifestly at odds with the purpose of s 299(2). Instead of\n                    conserving the insolvent company’s assets, adopting Mr Tan’s\n                    construction of O 21 r 2(6A) and s 299 of the Companies Act would\n                    mean that further cost had to be incurred by the company in winding up for\n                    purely procedural reasons. Neither is the purpose of O 21 r 2(6)\n                    served (ie, to cut down delays in litigation), as\n                    even after following Mr Tan’s suggested procedural steps, the action\n                    is to be stayed for an indefinite period of time rather than continued. The only\n                    result is duplicity, and a waste of time and costs and the court’s\n                    resources 17     Mr Tan’s suggested procedural steps\n                    produce an absurd result as to the way the rule is to operate. One well-known\n                    interpretative presumption of relevance to the issue here is that the court\n                    seeks to avoid a construction that produces an absurd result. Several aspects of\n                    this general presumption against absurdity come to mind, and they are equally\n                    applicable here: (a) avoidance of a futile or pointless result, and (b)\n                    pointless legal proceedings. Francis Bennion,Statutory\n                        Interpretation(LexisNexis, 2008, 5thEd) (“Bennion”) explains these two\n                    aspects as follows (at pp 1000 and 1001): Futile or pointless resultParliament does\n                        nothing in vain, a principle also expressed aslex nil\n                            frustra facit(the law does nothing in vain). It is an old\n                        maxim of the law thatquod vanum et inutile est, lex non\n                            requirit(the law does not call for what is vain and\n                        useless). Or as it is put in another form:lex non\n                            praecipit inutilia(the law does not demand the doing of\n                        useless things). The law never compels a person to do that is useless and\n                        unnecessary. Through the inevitable limitations of language, it is sometimes\n                        nevertheless happens that, in the events that have occurred in the instant\n                        case, the literal meaning of the enactment seems to demand the doing of\n                        something that would be futile or pointless. Here the court will strive to\n                        find a more sensible construction. ... Pointless legal proceedingsThe court is\n                        always averse to requiring litigants to embark on futile or unnecessary\n                        legal proceedings. This includes a stage in proceedings that could without\n                        detriment to any party be done without. Judges are uncomfortably aware of\n                        the costs and delays involved in a legal action, and do all in their power\n                        to minimise them. 18     In this present case, the absurdity and\n                    irrationality of the construction as described in the passages above inBennionreside in the suggested procedural\n                    steps: an action that has already been statutorily stayed has to be revived for\n                    the sole objective of not continuing with the action but to halt proceedings by\n                    a court order. That is not all. This approach, which forms the basis of the\n                    application, hardly qualifies as a proper ground for lifting the statutory stay.\n                    It must be remembered that the court’s power under s 299(2) is to\n                    grant leave toproceedorcontinuewith the court proceedings outside of resolution of\n                    claims within the insolvency regime. It requires the applicant to satisfy the\n                    court that there are compelling reasons for lifting the stay to proceed or\n                    continue with the court proceedings as there is aprima\n                        faciecase to betried(seeKorea Asset Managementat [41]). To proceed or\n                    continue with court proceedings would mean diverting limited resources from an\n                    insolvent company to deal with court proceedings. Normally leave would be\n                    refused under s 299(2) if the dispute in the action can be decided in the\n                    course of the winding up within the insolvency regime. The first stage of the\n                    suggested procedural steps has demonstrably shown itself to be unworkable since\n                    the primary objective for granting leave to lift the statutory stay is not\n                    likely to be met. One way of testing the correctness of this conclusion is from\n                    the court’s case management perspective. If the action had been stayed\n                    under s 299(2), the court as part of case management is not likely to\n                    intervene in the progress of the action since it is already\n                stayed. 19     The analysis above underlines the different\n                    perspective and different intentions of a statutory stay under s 299(2) and\n                    the court ordered stay under O21r 2(6A). Contrary to Mr Ng’s\n                    contention, there is no inconsistency between the statutory stay under\n                    s 299(2) and a stay order under O 21 r 2(6A). Both substantive\n                    and procedural laws can co-exist harmoniously, each serving different objectives\n                    and functions. Whilst both substantive and procedural laws lead to the same\n                    result (ie, the court proceedings are halted), the\n                    similarities end there. Even so, at this level, the suggested procedural steps\n                    intended to stop time from running is patently unnecessary because as mentioned\n                    above they are pointless for duplicity, and a waste of time and costs and the\n                    court’s resources. 20     On first principles, the better view (and this\n                    is not an unreasonable one since both substantive and procedural laws can\n                    co-exist) is that whenever an action is automatically stayed by operation of\n                    s 299(2) of the Companies Act (or for that matter under the other\n                    corresponding provisions in the Companies Act or the Bankruptcy Act on automatic\n                    stays listed at[11]above), the action is\n                    excluded andnotsubject to the 12-month period\n                    prescribed by O 21 r 2(6). (This is not to say that the creditor whose\n                    action is stayed by operation of s 299(2) can take an indefinite amount of\n                    time to decide whether it wants to proceed by proof of debt or by litigation in\n                    court – one would imagine that should the creditor come before the court\n                    after an unreasonably long time to seek a lift of the stay, the court would have\n                    justifiable reason to refuse unless otherwise persuaded. See alsoKorea Asset Managementat [47].) I do not read the\n                    provision of O 21 r 2(6A) to be exhaustive by implication so as to\n                    exclude or disapply a statutory stay prescribedaliunde. It goes without saying that it is a principle in\n                    statutory interpretation that unless a contrary intention appears, the ROC,\n                    which is a subsidiary legislation, and in particular O 21 r 2(6A) must\n                    be construed and applied within the context of the existing corpus of law, and\n                    in this case, the primary legislation is s 299(2) of the Companies Act and\n                    regard must be given to it in construing O 21 r 2(6A) (seeBennionPart XXIII, Section 327 at p1033; generally\n                    s19(c) of the Interpretation Act). 21     As stated, upon the commencement of winding\n                    up, a statutory regime is triggered; the automatic stay under s 299(2) is\n                    meant to facilitate the change in regime. The proper route for a creditor is\n                    usually to file a proof of debt with the liquidator instead of continuing with\n                    the court process unless it satisfies the court that it meets the broad\n                    guidelines set out by Rajah JC inKorea Asset\n                        Managementat [45] - [57] and obtains the leave of court to\n                    commence or continue proceedings despite the fact that the company it wishes to\n                    sue is in liquidation. Order 21 r 2(6) is clearly intended to apply to court\n                    proceedings that have become dormant because one party had allowed the\n                    proceedings to go to sleep. In the present case, the commencement of the winding\n                    up of LaserResearch on 15 May 2009 which triggered the automatic stay under\n                    s 299(2) of the Companies Act takes the DC Suit out of the ambit of the\n                    Rules of Court altogether so that O 21 r 2(6) does not apply to the\n                    cause or matter in the action. 22     For these reasons, the DC Suit has not been\n                    deemed discontinued. As such, OS 495 for the return of the bank guarantee is\n                    dismissed. In light of the conclusion reached above, there is no need to go\n                    further to deal with LaserResearch’s submissions on O 21\n                    r 2(6B). 23     Even if for the sake of argument O 21\n                    r 2(6) applies, and the action has been deemed discontinued, Internech has\n                    as an additional measure applied to reinstate the action (see Originating\n                    Summons No 746 of 2010 (“OS 746”)). If it was necessary, I\n                    would have allowed the application seeing that in this instance, especially\n                    given the circumstances of the present case,ie,\n                    the sole reason why no application for a order to stay the action or to extend\n                    the stipulated period under O 21 r 2 was because Internech believed,\n                    not unreasonably, that the automatic stay under s 299(2) of the Companies\n                    Act was sufficient to render the automatic discontinuance provision inoperative.\n                    In the circumstances, I make no order on the application in OS\n                746.",
        "Result": "24     For the reasons given above, I dismiss the\n                    application in OS 495 with costs. I make no order on the application in OS 746\n                    including costs."
    }
}