{
    "case_title": "Jurong Technologies Industrial Corp Ltd (under judicial\n                management)\n      v\n      Coöperatieve Centrale Raiffeisen-Boerenleenbank BA (trading as Rabobank\n                International, Singapore Branch)",
    "ncitation": "[2010] SGHC 357",
    "coram": "Andrew Ang J",
    "sections": {
        "Introduction": "1       In this action the plaintiff seeks to set aside\n                    and recover payments of US$529,720.31 and US$2,245,429.06 (“the\n                    Payment”) made by the plaintiff to the defendant on 22 December 2008\n                    on the ground that the Payment constituted an undue preference under s 227T\n                    of the Companies Act (Cap 50, 2006 Rev Ed) (“Companies\n                    Act”). 2       The plaintiff is an investment holding company\n                    with a wholly-owned principal operating subsidiary, Jurong Hi-Tech Industries\n                    Pte Ltd (“JHTI”). Most business operations were conducted in the\n                    name of JHTI. The defendant granted banking facilities to both JHTI and the\n                    plaintiff (collectively referred to as “the Companies”) jointly\n                    and severally. The Companies were placed under judicial management by orders of\n                    court dated 20 February 2009. Tam Chee Chong (“Tam”) was\n                    one of the two persons appointed the joint and several judicial managers of the\n                    Companies (“the Judicial Managers”).",
        "Factual background": "3       The facts that form the background to this\n                    action were largely undisputed and can be briefly stated. The plaintiff procured\n                    banking facilities from several banks, including ABN AMRO NV, Bank of\n                    Tokyo-Mitsubishi UFJ (“BTMU”), DBS Bank Ltd (“DBS”),\n                    Malayan Banking Berhad (“Maybank”), Oversea-Chinese Banking\n                    Corporation Ltd (“OCBC”), RHB Bank Berhad\n                    (“RHB”) and United Overseas Bank Ltd (“UOB”). The\n                    plaintiff’s facilities with these banks were unsecured, but each bank was\n                    given a negative pledge and apari passuundertaking. As most of the business operations of the Companies were conducted\n                    in the name of JHTI, other than BTMU, Maybank and RHB which had granted\n                    facilities solely to the plaintiff, all the other banks granted facilities to\n                    the Companies jointly and severally. 4       Sometime in September 2004, the defendant\n                    approached the plaintiff with an offer of credit facilities. Yeo Peck Heng\n                    (“Yeo”), a director of the Companies, told the defendant about the\n                    plaintiff’s unsecured facilities with other banks as well as the negative\n                    pledge andpari passuundertaking that each of the\n                    banks had been given. By a letter dated 20 September 2004, the defendant\n                    offered credit facilities to the plaintiff on a similar basis, incorporating a\n                    negative pledge and apari passuclause. These\n                    original credit facilities were subject to several addenda and revisions issued\n                    by the defendant over the years, with the last revision letter issued jointly to\n                    the Companies on 22 January 2008. 5       Sometime in early 2007, the defendant offered to\n                    provide account receivables financing (“AR Financing”) to JHTI.\n                    The defendant and JHTI entered into a Master Receivables Purchase Agreement\n                    dated 15 February 2007, which was followed by an addendum dated\n                    12 November 2007. 6       In March 2008, Ms Lin Li Fang\n                    (“Ms Lin”) took over as chairperson of the plaintiff’s\n                    group of companies (“the Group”). She was concerned about the high\n                    debt level of the Group and sought to monetise the assets of the Group to pay\n                    down the outstanding bank loans. The directors of the plaintiff, including\n                    Ms Lin and Yeo, gave similar presentations to the defendant and each of the\n                    other banks separately. During the presentations, they stated that some of the\n                    Companies’ assets would be sold to pay down the bank loans. These assets\n                    included the Electronic Manufacturing Services (“EMS”) business,\n                    shares in MAP Technology Holdings Ltd (“MAP Shares”) and shares in\n                    Min Aik Technology Co Ltd (“Min Aik Shares”). 7       In July 2008, the plaintiff’s general\n                    manager, Ang Ah Bah (“Ang”) told Ms Lin that Richard Lee Seow\n                    Hong (“Lee”), the relationship manager for the Companies’\n                    accounts with the defendant, had told him that the defendant no longer wished to\n                    continue the AR Financing arrangement with JHTI. Although Ms Lin was\n                    concerned that the defendant might terminate the AR Financing facility and\n                    demand immediate repayment, in fact, no action was taken by the defendant. A\n                    month later, in August 2008, Ang informed Ms Lin that Lee had told him that\n                    the defendant wanted to concentrate on the agricultural sector and cease\n                    financing the telecommunications and electronic sectors (which the Companies\n                    were involved in). Again, the defendant did not take immediate action and\n                    continued to provide financing, including against invoices presented by the\n                    Companies. 8       Subsequently, at a dinner meeting on\n                    22 September 2008, Lee informed Ms Lin that the defendant wished to\n                    exit from the non-core markets (ie, the\n                    telecommunications and electronics sectors) and that it intended to end its\n                    relationship with the Companies in an orderly fashion. Ms Lin then\n                    requested that the defendant reduce or cancel the banking facilities gradually\n                    and allow the Companies to pay according to the maturity dates of those\n                    facilities. 9       It bears noting that Ms Lin and Lee have\n                    had a long business relationship, having known each other personally since the\n                    early 1980s when Lee was working in Overseas Union Bank. After he moved to OCBC,\n                    he was tasked to handle the plaintiff’s accounts as OCBC was aware of his\n                    good relationship with Ms Lin. When he subsequently joined the defendant,\n                    he continued to act as the relationship manager for the Companies’\n                    accounts with the defendant. According to Lee, during his tenure with OCBC, he\n                    would visit the plaintiff’s office once a week. He intensified the\n                    frequency of visits to twice a week when he joined the defendant in order to\n                    deepen the relationship, as the defendant was a relatively new banker. He often\n                    spoke to Ms Lin during those visits and Ms Lin felt obligated towards\n                    the defendant and him as she believed that they were very\n                    “supportive” of the Companies. 10     Between September and November 2008, the\n                    plaintiff faced increasing difficulties paying overdue loans and other\n                    facilities and these were left largely unpaid. On 11 September 2008, the\n                    defendant requested that the Companies reduce the amount of invoices sent for\n                    discounting to avoid exceeding the AR Financing facility’s limit of\n                    US$20m. After the limit was reached by the end of September 2008, no\n                    further invoices were sent to the defendant for discounting. Besides the\n                    defendant, other banks such as ABN AMRO, DBS, KBC, Maybank and UOB were pressing\n                    the Companies to repay their overdue loans and other facilities, but the\n                    Companies were unable to make payment in full, only making payments in the\n                    ordinary course of business from trade receivables or by drawing on credit\n                    lines. The Companies then told their bank creditors, including the defendant,\n                    that they would pay down their loans and facilities using the proceeds from the\n                    sale of the MAP Shares, the Min Aik Shares and the EMS business to the Global\n                    Emerging Markets Group (“GEM”). 11     At around the same time, the Companies’\n                    trade creditors were also demanding payment of invoices from the\n                    Companies. 12     The Companies first defaulted on their\n                    facilities with the defendant on 7 October 2008 when they failed to pay\n                    over receivables that would have been paid by Motorola Electronics to JHTI on\n                    that date. Besides this, JHTI failed to make payment on other amounts, including\n                    invoices under the AR Financing facility and trade bills, which had fallen due\n                    for payment in early October 2008. When the Companies failed to settle trust\n                    receipts which were due on 16 October 2008, the defendant forced-debited\n                    JHTI’s current account, causing it to be overdrawn. 13     Between October and December 2008, Lee sent\n                    e-mail chasers and made telephone calls to the Companies’ directors\n                    requesting for payment. He also met with the plaintiff’s representatives\n                    at the plaintiff’s premises to discuss repayment of the amounts due to the\n                    defendant. According to the defendant, Lee and Ms Lin had reached a verbal\n                    agreement on a schedule of repayment that was recorded in a letter dated 13\n                    November 2008 from the defendant to the Companies (“the First\n                    Letter”). The defendant took the position that the First Letter had\n                    purported to cancel the facilities extended to the Companies and had included a\n                    formal demand for all amounts due and owing under the various facilities\n                    extended to the Companies. Ms Lin’s evidence, however, was that she\n                    was not aware of any verbal agreement with Lee. She also did not recall having\n                    seen the First Letter, which the Judicial Managers could not find among the\n                    books and records of the Companies. 14     During one of his telephone calls sometime in\n                    November 2008, Lee asked Ms Lin whether the MAP Shares could be placed in\n                    an escrow account with the defendant, but Ms Lin told him that this could\n                    not be done and that the loans due to the defendant could be repaid instead from\n                    the sale proceeds of the Min Aik Shares. Later that month, Lee told Ms Lin\n                    that the defendant wanted the Min Aik Shares to be placed in an escrow account\n                    with the defendant to ensure that the sale proceeds of those shares would be\n                    paid to the defendant. 15     On 17 November 2008, the defendant issued\n                    a letter to JHTI demanding payment of the unpaid receivables under the AR\n                    Financing facility. 16     On 23 November 2008, Ms Lin signed\n                    and issued a letter under which the plaintiff undertook to set up an escrow\n                    account with the defendant to hold the Min Aik Shares and credit the sale\n                    proceeds of the Min Aik Shares directly to the escrow account. Despite the\n                    contents of that letter, no escrow account was opened with the defendant and the\n                    Min Aik Shares were not placed in any such escrow account. 17     According to the defendant, on\n                    25 November 2008, a meeting took place between the Companies’\n                    principal representatives (including Ms Lin), Lee, the defendant’s\n                    general manager Goh Chong Theng (“Goh”) and the defendant’s\n                    chief credit analyst Tan Wah Yam (“Tan”). At that meeting, Goh\n                    demanded that the Companies take immediate action to prepare the appropriate\n                    documentation to ensure that the proceeds from the sale of the Min Aik Shares be\n                    paid to the defendant. While Ms Lin’s evidence in this regard was\n                    that she did not recall this meeting on 25 November 2008, the plaintiff is\n                    prepared to accept that the meeting did take place as nothing turns on\n                    this. 18     Around 25 November 2008, the plaintiff\n                    instructed Min Aik to source for a buyer for the Min Aik Shares. On\n                    27 November 2008, Min Aik informed Ms Lin that the proceeds of sale\n                    would be paid to the defendant. In November and December 2008, Lee sent numerous\n                    e-mails and made various telephone calls to the Companies’ officers,\n                    asking them to sell the Min Aik Shares and remit the proceeds to the\n                    defendant. 19     On 1 December 2008, the Companies\n                    appointed KordaMentha Pte Ltd (“KordaMentha”) as financial\n                    advisors, primarily to assist the plaintiff with the proposed sale transaction\n                    with Global Emerging Markets Group by managing the key stakeholders during the\n                    sale period. Additionally, Tam’s evidence was that the appointment of\n                    KordaMentha was meant to aid the plaintiff which was in dire financial\n                    straits. 20     On 9 December 2008, KordaMentha called\n                    for a meeting of all the bank creditors of the Companies, at which KordaMentha\n                    presented the total amounts owing by the Companies to all their bank creditors.\n                    Subsequently, several letters of demand were received. By the end of December\n                    2008, the Companies had received letters of demand from the following\n                    creditors: (a)     KBC (on 7 November\n                        2008); (b)     Maybank\n                        (on 2 and 22 December 2008); (c)     ABN AMRO (on 18 December 2008); (d)     OCBC (on 26 December 2008);\n                        and (e)     BTMU (on\n                        29 December 2008). Apart from these bank creditors,\n                    the Companies also received letters of demand from their trade creditors, some\n                    of which even commenced legal proceedings for unpaid debts as early as\n                    12 December 2008. 21     On 18 December 2008 and 7 January\n                    2009, the plaintiff sold the Min Aik Shares for a total of US$2,819,093.03,\n                    part of which,ie, the Payment, was remitted to\n                    the defendant on 22 December 2008 in two tranches. By way of a letter dated\n                    26 December 2008, the defendant informed the plaintiff that the Payment had\n                    been set off against the moneys due and owing by the plaintiff.",
        "The issues": "22     Against that backdrop, the plaintiff seeks to\n                    recover the sale proceeds of the Min Aik Shares from the defendant on the ground\n                    that the Payment constituted an undue preference under s 227T of the\n                    Companies Act. Under that section, a payment made by a company shall be void as\n                    against the judicial manager if, being made by a natural person, it would have\n                    been void as against the Official Assignee under s 99 (read with\n                    ss 100 – 102) of the Bankruptcy Act (Cap 20, 2000 Rev Ed)\n                    (“Bankruptcy Act”) as an unfair preference in the event that that\n                    natural person became bankrupt. 23     Under s 99(3) of the Bankruptcy Act, an\n                    unfair preference is given by an individual to a person if: (a)    that person is one\n                            of the individual’s creditors or a surety or guarantor for any of\n                            his debts or other liabilities; and (b)    the individual does\n                            anything or suffers anything to be done which (in either case) has the\n                            effect of putting that person into a position which, in the event of the\n                            individual’s bankruptcy, will be better than the position he would\n                            have been in if that thing had not been done. Crucially, s 99(4) provides that an order shall not be made\n                    under s 99 of the Bankruptcy Act unless the individual who gave the\n                    preference was “influenced in deciding to give it by a desire to produce\n                    in relation to that person the effect mentioned” in\n                        s 99(3)(b). 24     The transaction that is being impugned as an\n                    unfair preference should have occurred within the period of six months ending on\n                    the day of the making of the bankruptcy application (or, in this case, the\n                    application for the judicial management order) (see s 100(1)(c)(ii) of the\n                    Bankruptcy Act, read with s 227T(2) of the Companies Act). Under\n                    s 100(2) of the Bankruptcy Act, the six-month period prior to the day of\n                    the application for the judicial management order is not relevant for the\n                    purposes of avoiding the transaction as an unfair preference under s 99\n                    unless the company: (a)    is insolvent at that\n                            time; or (b)    becomes insolvent in\n                            consequence of the transaction or preference. 25     For the purposes of determining if a company\n                    was “insolvent” at the relevant time, the following two tests are\n                    provided in s 100(4) of the Bankruptcy Act: (a)    [it] is unable to\n                            pay [its] debts as they fall due [the ‘liquidity test’];\n                            or (b)    the value of [its]\n                            assets is less than the amount of [its] liabilities, taking into account\n                            [its] contingent and prospective liabilities [the ‘balance sheet\n                            test’]. 26     In summary, the requirements to be satisfied\n                    before the Payment could be avoided as against the Judicial Managers on the\n                    ground of unfair preference can be gleaned from the provisions above to be the\n                    following: (a)     The Payment was made to the\n                        defendant within six months of the date of the application for a judicial\n                        management order; (b)     The defendant is a creditor of the plaintiff; (c)     The Payment has the effect of putting\n                        the defendant in a position which in the event of the plaintiff’s\n                        being placed under judicial management will be better than the position the\n                        defendant would have been in if the payment was not made; (d)     In deciding to make the Payment, the\n                        plaintiff was influenced by a desire to produce in relation to the defendant\n                        the effect mentioned in (c) above; and (e)     The plaintiff was either insolvent at the time the\n                        Payment was made or became insolvent as a result of making the\n                        Payment. 27     As it was common ground that the first three\n                    requirements were satisfied on the facts, the issues that arise for my\n                    consideration are: (a)     Whether in deciding to make the\n                        Payment the plaintiff was influenced by a desire to place the defendant in a\n                        better position in the event of the former’s placement under judicial\n                        management than the latter would have been in if the Payment had not been\n                        made; and (b)     Whether the plaintiff was insolvent at the time the Payment was made, or\n                        had become insolvent as a result of the Payment.",
        "Whether the plaintiff was influenced by a desire to prefer the\n                defendant": "28     The plaintiff’s case is that it was\n                    influenced in deciding to pay the proceeds from the sale of the Min Aik Shares\n                    to the defendant by a desire to produce the effect of putting the defendant into\n                    a position which in the event of the plaintiff’s insolvency would be\n                    better than the position the defendant would have been in if the Payment had not\n                    been made. 29     The defendant took the position that: (a)     the plaintiff did not possess the\n                        requisite state of mind envisaged under the unfair preference regime as the\n                        plaintiff did not know that it was actually or imminently insolvent at the\n                        material time; and (b)     the plaintiff had not proven that it had the requisite desire to\n                        improve the defendant’s position in the event of its insolvency.\n                        Furthermore, even if the plaintiff did possess the requisite state of mind\n                        as to its imminent or actual insolvency, the defendant averred that the\n                        desire to prefer was not operative on the plaintiff’s mind in making\n                        the decision to make the Payment; rather, the Payment was made in response\n                        to the commercial pressure exerted by the defendant on the plaintiff’s\n                        management for repayment of its facilities. 30     In the English decision ofRe MC Bacon Ltd[1990] BCLC 324 (“Re Bacon”), Millett J discussed in\n                    detail the changes brought afoot by the enactment of the UK Insolvency Act 1986.\n                    In relation to the UK equivalent of our s 99(4) of the Bankruptcy Act,\n                    Millett J observed (at 335) that: It is no longer necessary to establish adominantintention to prefer. It is sufficient that the\n                        decision wasinfluencedby the requisite\n                        desire. That is the first change. The second is that it is no longer\n                        sufficient to establish anintentionto\n                        prefer. There must be adesireto produce the\n                        effect mentioned in the subsection. [emphasis in original] Since “desire” has been substituted as the relevant\n                    test, it is the subjective desire of the company,ie, it positively wished, to improve the creditor’s\n                    position in the event of its imminent insolvency that is decisive (seeRe Baconat 335–336). 31     There is no need for direct evidence of the\n                    requisite desire as such desire can be inferred from the circumstances of the\n                    case (seeRe Baconat 336; see alsoChee Yoh Chuang and another (as Liquidators of Progen Engineering\n                        Pte Ltd (in liquidation) v Progen Holdings Ltd[2010] SGCA 31 at [40]). As the test of “dominant\n                    intention to prefer” has been abolished, so long as the desire to prefer\n                    was one of the factors which operated on the minds of those who made the\n                    decision, the test under s 99(4) would be satisfied (seeRe Baconat 336).",
        "The plaintiff’s knowledge of its actual or imminent\n                insolvency": "32     The defendant submitted that in order for\n                    unfair preference to be made out, it must be shown that the plaintiff must have\n                    known of its insolvency or imminent insolvency when deciding to make the\n                    Payment. The defendant relied on judicial support for this proposition in\n                    Singapore and in England. InAmrae Benchuan Trading Pte\n                        Ltd (in liquidation) v Tan Te Teck Gregory[2006]\n                    4 SLR(R) 969 (“Amrae\n                    Benchuan”), Sundaresh Menon JC held that there was no\n                    unfair preference in that case because,inter\n                    alia, he did not see (at [56]) “how [he] can find that [the\n                    shareholders and directors of the plaintiff] (and the defendant for that matter)\n                    knew or expected that the company would inevitably be wound up\n                    imminently”. Menon JC was there dealing with an alleged unfair\n                    preference given to an associate. Under s 99(5) of the Bankruptcy Act, any\n                    unfair preference given to an associate ispresumedto have been influenced by the requisite desire, unless\n                    the contrary is shown on a balance of probabilities. InAmrae\n                        Benchuan, Menon JC was of the view (at [56]) that the lack\n                    of knowledge or expectation on the part of the company’s controllers that\n                    it would be wound up imminently, coupled with the fact that the impugned\n                    transaction had occurred “a little less than two years before a petition\n                    for the winding up of the plaintiff was in fact presented”,pointed away from the probabilitythat those making the\n                    payment were doing so with the relevant desire. In other words, lack of\n                    knowledge of the company’s imminent winding up could be one factor to be\n                    considered in deciding whether the statutory presumption has been rebutted. I\n                    find nothing in his judgment that makes knowledge of the company’s\n                    imminent winding up arequirementto be satisfied\n                    in order for an unfair preference to be made out. If, however, that was the\n                    intended effect of Menon JC’s judgment, I respectfully\n                differ. 33     In an English case where the “burden of\n                    proof [had] shifted” as a result of the statutory presumption,Re Beacon Leisure Ltd[1992] BCLC 565\n                        (“Re Beacon Leisure”),\n                    Mr R A K Wright QC (sitting as a deputy judge of the High Court) found (at\n                    568) that the necessary desire did not exist or ought not to be inferred,\n                    primarily because he accepted the company directors’ denials that they had\n                    such a desire. Andrew Chan Chee Yin,Law and Practice of\n                        Corporate Insolvency(LexisNexis, 2005) at para\n                    [1555]–[1600] citedRe Beacon Leisureas authority for the proposition that “it is possible” to read\n                    s 99 of the Bankruptcy Act as requiring the debtor to have some knowledge\n                    of its own winding up because in that case, where the director concerned did not\n                    know that liquidation was imminent, it was held that there was no desire to\n                    prefer on the part of the insolvent company. To my mind, Wright QC inRe Beacon Leisuremerely found that the statutory\n                    presumption had been rebutted by the directors’ denials, backed by their\n                    lack of knowledge of the debtor company’s imminent winding up, that they\n                    had the relevant desire. There was no necessity for the learned deputy judge to\n                    make a positive finding that the directors knew of their company’s\n                    imminent winding up because the requisite desire had been presumed against them.\n                    To my mind, bothRe Beacon LeisureandAmrae Benchuan([32]supra) are examples of how the lack of knowledge\n                    of the debtor company’s insolvent state of affairs is one of the factors\n                    that should be considered in deciding whether the statutory presumption under\n                    s 99(5) has been rebutted, but the converse proposition, that knowledge of\n                    the company’s winding up is required before unfair preference is made out,\n                    hasnotbeen laid down as a rule by the\n                    courts. 34     Lee Eng Beng, “The Avoidance Provisions\n                    of the Bankruptcy Act 1995 and their Application to Companies”\n                    [1995] SJLS 597, expressed the view (at p 616) that a literal\n                    interpretation of s 99(4) of the Bankruptcy Act would suggest that the\n                    deputy judge’s approach inRe Beacon Leisurein assuming that there was no desire to prefer on the part of an insolvent\n                    company if the director concerned did not know that liquidation was imminent\n                    “is not entirely correct, since the desire to prefer relates to the\n                    producing of the effect of a preference and has nothing to do with knowledge of\n                    one’s own insolvency”. The article further considered that (at\n                    p 616): Admittedly, it is improbable that one would have a desire to prefer if he\n                        is ignorant of his own impoverished condition. On the other hand, it is very\n                        possible that a person will have a desire to prefer even if he is not\n                        absolutely sure that he is insolvent; it is totally plausible that he may\n                        entertain such a desire where he suspects or has reason to believe that his\n                        own insolvency is a real possibility. To this extent, therefore, it would\n                        appear that the approach in [Re Beacon\n                        Leisure] is too lenient. I agree with these views. 35     It must also be borne in mind that under\n                    s 99(1), a transaction will only be considered an unfair preference if it\n                    occurred “at the relevant time”. In relation to a company, such\n                    relevant time could be as early as two years before the making of the\n                    application for a judicial management order (where the creditor is an associate\n                    of the debtor company) (see s 100(1)(c) of\n                    the Bankruptcy Act read with s 227T of the Companies Act). To my mind, it\n                    would not be realistic or practicable, and therefore unlikely to have been the\n                    legislature’s intention, to require the judicial manager to show that the\n                    controllers of the insolvent company knew at the relevant time (which could even\n                    be two years before the application for a judicial management order is even\n                    made) that the company was facing imminent liquidation. 36     Furthermore, in order for a transaction to be\n                    impugned as an unfair preference, not only must it have occurred within the\n                    period of two years or six months (under s 100(1)(b) and (c) of the Bankruptcy Act\n                    respectively) ending on the day of the making of the application for a judicial\n                    management order, but under s 100(2) of the Bankruptcy Act the company must\n                    also have been insolvent at the time of the transaction, or became insolvent in\n                    consequence of the transaction. Since, for the purposes of unfair preference,\n                    a company’s insolvency is judged objectively under the liquidity test\n                    or the balance sheet test (see s 100(4) of the Bankruptcy Act), at the time\n                    of the impugned transaction, the controllers of the company may not know that\n                    its winding up is an inevitable result. However, they may think that its winding\n                    up is on the horizon, or a possible result, and decide to give a preference to a\n                    creditor. In my judgment, to require the judicial manager to prove that the\n                    company’s controllers must have known that the company was insolvent or\n                    imminently insolvent at the material time before a transaction can be avoided as\n                    an unfair preference would place too onerous a burden on the judicial\n                    manager. 37     Indeed, the English Court of Appeal inKatz & Ors v McNally & Ors[1999] BCC 291 made it clear (at 296) that it is “not necessary\n                    to establish that the directors of the company knew or believed that it was\n                    insolvent” in order to prove unfair preference. It is sufficient that the\n                    directors were influenced by the desire to put the creditor into a position\n                    “which in the event of the company going into insolvent\n                    liquidation” would be a better position than if no payment was made. In\n                    another English case,Wills and another v Corfe Joinery Ltd\n                        (in liq)[1998] 2 BCLC 75, Lloyd J held (at 79)\n                    that it is not necessary, in order to show such desire, to demonstrate that the\n                    directors knew that the company would go into insolvent liquidation, or when it\n                    would do so. Lloyd J’s judgment was cited with approval by Kan Ting\n                    Chiu J inRe Libra Industries Pte Ltd (in compulsory\n                        liquidation)[1999] 3 SLR(R) 205 at [43]. 38     This is not to say that the knowledge of the\n                    company’s imminent liquidation on the part of its controllers is never\n                    relevant in making out unfair preference. Indeed, such knowledge will often be\n                    instrumental in proving the relevant desire. InRe Living\n                        Images Ltd[1996] BCC 112, Laddie J held\n                    (at 128) that the “most likely explanation” for the repayment\n                    of moneys to a particular creditor (a personal friend of the company’s\n                    chairman) was that the directors “knew that there was a great risk that\n                    the company was on the point of going into liquidation and, if it did so, [that\n                    creditor] would not be paid”. InRe Agriplant\n                        Services Ltd[1997] BCC 842, Jonathan Parker J,\n                    having found (at 851) that the director (who had personally guaranteed the\n                    company’s indebtedness to a creditor) “knew that an insolvent\n                    liquidation was imminent, and he was looking for ways of limiting his\n                    liabilities in that event”, held that the requirements for making out\n                    unfair preference were satisfied. 39     Thus, whereas none of the cases have stated\n                    explicitly that the company’s management must have known that it was\n                    actually or imminently insolvent at the material time, there are clear judicial\n                    pronouncements to the contrary,ie, that there is\n                    no necessity to establish that the management knew or believed that the company\n                    was insolvent, or even imminently so. It is one thing to say that such knowledge\n                    or belief is relevant to proving the requisite desire; it is quite another to\n                    say that the judicial managercannotprove a case\n                    of unfair preference without establishing such knowledge or\n                belief. 40     In any event, it is clear that on the present\n                    facts, the directors of the plaintiff must have known that it was facing\n                    imminent liquidation by 22 December 2008, the date on which the Payment was\n                    made. By that time, it had received letters of demand from KBC, Maybank and\n                    ABN AMRO, as well as numerous trade creditors. In fact, some of those demands\n                    were made after the 9 December 2008 meeting that KordaMentha had convened\n                    with the plaintiff’s creditors to disclose the total amounts owed to those\n                    creditors. Those demands were never fully met by the plaintiff. Thus, it could\n                    not have escaped the directors’ attention that the plaintiff owed debts to\n                    several bank and trade creditors that it could not repay, particularly since,\n                    even on the defendant’s evidence, numerous email chasers were being sent\n                    and telephone calls were being made by all the various creditors in a bid to\n                    procure repayment of their debts.",
        "The plaintiff’s evidence as to its desire to prefer the\n                defendant": "41     It was Ms Lin’s clear evidence\n                    given on behalf of the plaintiff that she had agreed to pay the proceeds of the\n                    sale of the Min Aik Shares to the defendant as she had felt that the defendant\n                    had been supportive of the Companies. Despite her initial concern that the\n                    defendant would terminate the banking facilities extended to the plaintiff and\n                    demand immediate repayment, the defendant had continued to finance the Companies\n                    and allowed for gradual reduction of the facilities. 42     Ms Lin’s subjective view that the\n                    defendant had been supportive of the Companies is also objectively borne out by\n                    the surrounding circumstances. Despite the Companies’ defaults, the\n                    defendant continued to invite the Companies to roll over the term loans and\n                    refrained from withdrawing the facilities, even assuring the plaintiff that it\n                    would exit the relationship gradually in an orderly and responsible fashion.\n                    According to Lee’s evidence on cross-examination, the First Letter was\n                    either a “friendly” letter of demand, or even “not a letter\n                    of demand”. Even if the defendant had indeed intended it to be a letter\n                    of demand, doubts were raised as to whether the plaintiff ever received it.\n                    Furthermore, when asked on cross-examination whether the defendant’s\n                    conduct could reasonably be viewed as supportive, Lee agreed that it could be so\n                    construed. 43     Not only was it clear that the\n                    defendant’s treatment of the plaintiff in the midst of its financial\n                    difficulties was less threatening than the treatment by most of its other bank\n                    creditors, it was also clear that the plaintiff had treated the defendant more\n                    favourably. Even though the Companies had informed all their creditors in\n                    various presentations that they would be raising funds to repay or reduce their\n                    outstanding loans through the sale of the EMS business, the MAP Shares and the\n                    Min Aik Shares, the plaintiff chose to pay the proceeds from the sale of the Min\n                    Aik Shares to the defendant alone. This is despite the fact that the other bank\n                    creditors were also pressing for repayment from the Companies. In fact, the\n                    other bank creditors had served formal letters of demand on the plaintiff,\n                    threatening to cancel the facilities forthwith. Moreover, the knowledge that the\n                    payment of the sale proceeds of the Min Aik Shares to the defendant would have\n                    caused the plaintiff to be in breach of its obligations under the negative\n                    pledge andpari passuclauses in the facilities\n                    with the other bank creditors did not deter the plaintiff from making the\n                    Payment. 44     All these indicate that the decision to make\n                    the Payment was influenced by the plaintiff’s subjective desire to prefer\n                    the defendant in the event of the former’s insolvency by putting the\n                    latter in a better position than it would be in if the Payment was not made. The\n                    defendant maintained, however, that whatever desire the plaintiff had to prefer\n                    the defendant was vitiated by the pressure that it had placed on the plaintiff\n                    to repay.",
        "The defendant’s pressure on the plaintiff": "45     The defendant relied on the local case ofLeun Wah Electric Co (Pte) Ltd (in liquidation) v Sigma\n                        Cable Co (Pte) Ltd[2006] 3 SLR(R) 227\n                        (“Leun Wah”) as an example\n                    of a commentary by a local court on the value of legitimate commercialpressurein the context of unfair preference.Leun Wahwas cited inWalter Woon on\n                        Company Law(Sweet & Maxwell, Rev 3rd Ed, 2009)\n                        (“Walter Woon”) at\n                    para 17.172 for the proposition that a transaction is not\n                    “likely” to be an unfair preference “in situations where a\n                    company makes a payment in response to commercial pressure”. I note,\n                    however, that inLeun Wah, Choo Han\n                    Teck J held (at [11]) that there was insufficient evidence to form the\n                    conclusion that the plaintiff there had any desire to give an unfair preference\n                    to the defendant when it agreed to assign a debt to the latter; the plaintiff\n                    had seemed to believe that the assignment would “forestall drastic action\n                    by the defendant, and thereby gain time for the plaintiff to collect its own\n                    debts”. The primary reason for the insufficiency of evidence in that case\n                    was that the principal person from the plaintiff in respect of the impugned\n                    decision to assign the debt was not called to testify by either party.\n                    Thus, Choo J found (at [12]) that without evidence from that principal\n                    person, “the element of the plaintiff’s desire, the burden of which\n                    lay with the plaintiff, was not proved”. With respect,Leun Wahwas not a case where the desire to prefer a creditor\n                    was vitiated by commercial pressure exerted by that creditor; there was simply\n                    no evidence to support a finding of any such desire. 46     That is not to say that commercial pressure\n                    will never provide a good defence to a claim of unfair preference. Since Lord\n                    Mansfield’s judgment inThompson and Others, Assignees\n                        of Jane Wiseman v Freeman(1786) 99 ER 1026 where his\n                    Lordship held (at 1028) that: A bankrupt when in contemplation of his bankruptcy cannot by his voluntary\n                        act favour any one creditor; but if under fear of legal process he gives a\n                        preference, it is evidence that he does not it voluntarily it has been a principle of English law that preferential transactions\n                    entered into because of pressure will not be set aside. InRe\n                        Bacon, Millett J found (at 337) that the debtor\n                    company’s decision to grant a debenture to its bank creditor had been made\n                    as part of the directors’ decision to “continue trading in a\n                    genuine belief that the company could be pulled round” and they had\n                    “no choice but to accede to the bank’s request for a\n                    debenture”. InRe Ledingham-Smith (a bankrupt), ex\n                        parte the trustee of the bankrupt v Pannell Kerr Forster (a firm)[1993] BCLC 635, Morritt J held (at 642) that “[i]t may be\n                    that pressure does not displace desire in the way that it formerly displaced a\n                    dominant intention to prefer but it can certainly affect the question of\n                    desire”. 47     In Andrew R Keay,McPherson’s Law of Company Liquidation(Sweet &\n                    Maxwell, 2nd Ed, 2009) (“McPherson’s”), it is explained (at para 11.035)\n                    that: The reason why pressure prevents a transfer from being a voidable\n                        preference is that a preference predicates an act of free will and pressure\n                        negatives free will. It has been held that as long as pressure is genuine\n                        and not fraudulent then no transfer can be regarded as a preference. It\n                        could be said that if there is pressure then the debtor company, in granting\n                        a preference, could not have been influenced by a desire to benefit the\n                        creditor. This makes it “advantageous for creditors to exert pressure on\n                    any of their debtors whose financial state appears to be parlous” (seeMcPherson’sat para 11.035).McPherson’sfurther cautioned that (at\n                    para 11.035): This invites creditors to implement a ‘first in first served’\n                        approach and to exert as much pressure so that they are able to grab what\n                        they can before liquidation eventuates, and if any payment is challenged\n                        they can point to such pressure to justify the payment. ...To permit individual creditors to secure advantages by coercing\n                            the insolvent is totally antithetical to the purposes behind the\n                            enactment of laws preventing preferences, namely to ensure that there is\n                            a collective process involving a pari passu distribution of the\n                            company’s assets. [emphasis in original] I agree with these observations inMcPherson’s. 48     Therefore, in my view, there must be a limit\n                    to the defence of pressure exerted by creditors. InInsolvencyvol 2 (Peter Totty and Gabriel Moss QC ed) (Sweet\n                    & Maxwell, Looseleaf Ed, 1986, August 2008 release) at\n                    para H4–08, it was suggested that the limit is provided by a\n                    reference to commercial purpose. Thus, in circumstances where the directors of a\n                    debtor company bow to creditor pressure in order to act in the commercial\n                    interests of the company as a viable going concern,ie, for “proper commercial considerations” (seeRe Bacon([30]supra) at 336 andRe Fairway\n                        Magazines Ltd,Fairbairn v Hartigan[1993] BCLC 643 at 649), the requisite desire will not be established.\n                    Conversely, if there is no commercial benefit to the company at all in paying\n                    any creditor, then the court should be extremely slow to find that pressure from\n                    the creditor is a defence to the claim of unfair preference. 49     The defendant pointed to the Singapore Court\n                    of Appeal decision inLin Securities Pte v Royal Trust Bank\n                        (Asia) Ltd[1994] 3 SLR(R) 899 (“Lin Securities”) as an illustration of the\n                    type of commercial pressure exerted by a bank creditor that would negative any\n                    desire to prefer on the part of the debtor. It bears noting thatLin Securitieswas decided under the previous regime of\n                    unfair preference where a dominant intention to prefer must be shown. The\n                    alleged unfair preference there was in the form of an arrangement between a bank\n                    creditor and the debtor company under which shares charged to the bank as\n                    security for credit facilities were handed to the bank to be kept in its custody\n                    overnight after trading hours. The Court of Appeal took the view (at\n                    [27]–[28]) that there was a threat conveyed to the debtor that if it did\n                    not agree to the bank’s “request” for the arrangement, the\n                    bank would terminate the credit facilities immediately and call for repayment of\n                    the amounts owing. Crucially, the Court of Appeal found (at [29]) that the\n                    debtor company did what it could “in the circumstances to avoid the knell\n                    of their imminent collapse”; as such, the arrangement with the bank\n                    allowed the debtor to carry on trading and “at the same time enabled [the\n                    debtor] to have the benefit of the facility” from the bank. In the\n                    result, it was held that there was no intention on the debtor’s part to\n                    prefer the bank creditor. In other words, even though the bank inLin Securitieshad exerted pressure on the debtor, the\n                    arrangement was entered into so that the company could continue as a going\n                    concern,ie, for proper commercial considerations;\n                    such an arrangement did not constitute an unfair preference. 50     The approach taken by the Hong Kong Court of\n                    First Instance inRe Sweetmart Garment Works\n                        Ltd[2008] 2 HKLRD 92 (“Re\n                        Sweetmart”) is instructive in this regard. In that case,\n                    Barma J examined the contemporaneous correspondence between the bank\n                    creditor and the debtor company in the months leading up to the grant of the\n                    mortgage (ie, the impugned transaction) as well as\n                    the evidence of the steps taken by the other creditors of the company around the\n                    time when the mortgage was granted. At [18], the learned judge explained\n                    that: The former will throw some light on thenature of the\n                            relationshipbetween the Bank and the Company,the degree of pressurethat may have been exerted\n                        by the Bank on the Company to improve its position, and theadvantages, if any, to the Company in granting the\n                        mortgage. The latter will provide material against which the conduct of the\n                        Bank and the Company can be compared, and will also throw light on the\n                        financial position of the Company at the relevant time, a matter which, as I\n                        explain below, bears onwhether or not there was good\n                            reason for the Company to enter into the mortgage in favour of the\n                            Bank. [emphasis added] After comparing the conduct towards the debtor company on the part of\n                    the other creditors and that of the bank to which the mortgage was granted,\n                    Barma J concluded (at [29]) that the steps taken by the former creditors\n                    “were, it is evident, more concrete, more serious, and instituted much\n                    more promptly, than those threatened by the Bank”. Moreover, the loan\n                    granted by the bank creditor against the security of the mortgage “did\n                    not involve fresh credit being given” to the debtor company and it could\n                    not be said that the company “benefited in any tangible way from the\n                    granting of the security, so as to provide a good reason for the grant of the\n                    mortgage” (see [31]). As a result, Barma J held that the debtor\n                    company had acted with the requisite desire to prefer that particular bank\n                    creditor. 51     Reverting to the evidence in the present case,\n                    despite the defendant’s attempts to show that it was exerting more\n                    pressure on the plaintiff as compared to the other bank creditors, I am\n                    satisfied that the pressure purportedly exerted by the defendant was not\n                    exceptional, particularly when compared to the pressure exerted by the other\n                    bank creditors. As mentioned above at[43],\n                    Lee testified that the First Letter was merely a “friendly letter of\n                    demand”. Moreover, in his personal opinion, the First Letter was not even\n                    a letter of demand. The defendant sent another letter dated 17 December\n                    2008 (“the Second Letter”) to the plaintiff, stating that unless\n                    the plaintiff made payment of sums due and owing to the defendant within five\n                    business days, the defendant would not hesitate to pursue all its legal rights\n                    against the plaintiff. The Second Letter should be considered in the light of\n                    the fact that by 27 November 2008, the plaintiff had given instructions\n                    that proceeds from the sale of the Min Aik Shares should be credited to the\n                    defendant. Moreover, even though the Second Letter suggested that the defendant\n                    would not rollover any of the term loans once they became due and revoked the\n                    “alternative payment arrangements” stated in the First Letter, Lee\n                    testified that the defendant did in fact allow rollover of the outstanding\n                    amounts under the term loan even after the Second Letter. 52     Other than requests made in writing, the\n                    defendant also made phone calls and visits to the plaintiff’s premises.\n                    According to Lee’s evidence on cross-examination, he had always been a\n                    regular visitor to the plaintiff’s office, even before he began his\n                    employment with the defendant. Indeed, at the beginning of the relationship\n                    between the plaintiff and the defendant, prior to the plaintiff’s defaults\n                    on the facilities granted by the defendant, Lee visited the plaintiff’s\n                    premises twice a week. 53     The conduct of the defendant towards the\n                    plaintiff stood in stark contrast with that of the other bank creditors: (a)     KBC issued a plain and unambiguous\n                        letter of demand to the plaintiff on 7 November 2008, demanding\n                        repayment of some $13m in three days, which demand was acknowledged by Lee\n                        to constitute “more pressure” than the defendant’s\n                        “friendly letter of demand”. (b)     RHB issued a letter on 4 November 2008 to\n                        the plaintiff, reducing the facilities extended to the latter and\n                        stipulating that repayment should be made in instalments by 28 November\n                        2008 and 31 December 2008. (c)     Maybank served a letter of demand on the plaintiff on\n                        2 December 2008 calling an event of default and demanding repayment of\n                        all outstanding monies by 16 December 2008. (d)     ABN AMRO sent a letter dated\n                        18 December 2008 to the Companies notifying them of the occurrence of\n                        events of default and requiring them to pay the outstanding monies within\n                        two business days. In addition, the e-mails from the\n                    other bank creditors such as OCBC, Sumitomo Mitsui Banking Corporation and UOB\n                    to the Companies as well as the call reports of KBC and RHB indicate these\n                    creditors had made telephone calls to and held meetings with the Companies.\n                    There is, however, no evidence that representatives of these creditors had made\n                    visits to the Companies prior to the latter’s defaults on the banking\n                    facilities granted by the creditors. 54     The objective evidence, coupled with\n                    Ms Lin’s unequivocal evidence that the demands made by the defendant\n                    were not any more critical or pressing than those made by the other bank\n                    creditors at that time, shows that the pressure exerted by the defendant on the\n                    plaintiff was not significantly more considerable than that exerted by the other\n                    bank creditors. Indeed, the letters of demand served on the plaintiff before\n                    22 December 2008 pressed for more immediate repayment of outstanding\n                    moneys. Yet, those other creditors were not paid. Instead, the proceeds from the\n                    sale of the Min Aik Shares were paid to the defendant. 55     It is also clear that the Payment did not\n                    confer any commercial benefit on the plaintiff. As the defendant did not grant\n                    or disburse any new facilities to the Companies after 25 November 2008, the\n                    Payment was not made in exchange for any continuing funding from the defendant\n                    so as to keep the plaintiff operating as a going concern. Viewed in the light of\n                    the authorities discussed above, the defendant’s stance that the fact that\n                    the defendant did not terminate its facilities with the Companies was a good\n                    commercial reason for the plaintiff to make the Payment seems distinctly\n                    disingenuous, all the more so since the defendant had recognised internally in a\n                    credit memorandum dated 26 November 2008 that: It should be noted that the taking of Min Aik shares (and subsequent cash\n                        proceeds) even if not pledged may be deemed to be preferred payment if [the\n                        plaintiff] enters into liquidation within 6 months. However, this would not\n                        have compromised our position vis-à-vis now. As such, since [the plaintiff]\n                        is willing to give us the Min Aik shares pending sale, it is proposed thatwe take it for now and deal with the preferential\n                            payment issue if needed subsequently. [emphasis added] 56     In my view, the defendant’s position\n                    that the Payment was a response to the defendant’s demands and sustained\n                    pressure for payment, a way to placate one of its biggest creditors and pre-empt\n                    it from taking legal action against the plaintiff so as to prevent an escalation\n                    of the matter, is precisely the result that the unfair preference regime should\n                    be aimed at avoiding. When a company is facing imminent insolvency, all the\n                    creditors that have extended banking facilities on apari\n                        passubasis should be held to that undertaking and not compete to\n                    exert the greatest amount of pressure on the debtor company to procure repayment\n                    in a bid to circumvent the statutory process of distribution of the\n                    company’s assets. In my judgment, therefore, the pressure exerted by the\n                    defendant on the plaintiff did not vitiate the plaintiff’s desire to\n                    prefer the defendant, which desire had influenced the decision to make the\n                    Payment.",
        "Whether the plaintiff was insolvent": "57     Section 100(4) of the Bankruptcy Act states\n                    that a person shall be “insolvent” for the purposes of\n                    s 100(2) if: (a)    he is unable to pay\n                            his debts as they fall due; or (b)    the value of his\n                            assets is less than the amount of his liabilities, taking into account\n                            his contingent and prospective liabilities. The two limbs of s 100(4) are to be read disjunctively:Velstra Pte Ltd (in compulsory winding up) v Azero\n                        Investments SA[2004] SGHC 251 at [89]. So long as one\n                    of the tests is satisfied on the facts, the plaintiff can be considered to be\n                    insolvent for the purposes of avoiding the Payment as an unfair preference under\n                    s 99.",
        "The liquidity test": "58     InLeun Wah,\n                    Choo J found (at [8]) that the company was insolvent as it was\n                    “pressed for payments at the material time from many quarters and had not\n                    been able to pay”. There is sufficient evidence on the present facts that\n                    from around September 2008 the plaintiff was unable to pay its debts as they\n                    fell due. The demands made by the bank creditors in respect of bills,\n                    trust receipts, long and short term loans were largely unmet by the\n                    plaintiff. No new financing or loans were made available to the plaintiff in the\n                    meantime. The fact that the plaintiff was unable to make payment of its debts\n                    and overdue loans despite repeated demands from its various creditors indicates\n                    clearly that it was cash-flow insolvent. 59     Apart from the correspondence between the\n                    plaintiff and its bank creditors, another indication of the plaintiff’s\n                    cash-flow insolvency was the cash balances of its bank accounts in November and\n                    December 2008. The bank statements show that as at 25 November 2008, one of\n                    its 15 bank accounts was in overdraft of S$1,499,870.64 while the remaining 14\n                    had relatively low balances of S$43,274.28 and US$32,976.58. As at\n                    22 December 2008, three of the accounts were in overdraft of S$1,519,949.68\n                    and US$18,960.55 while the remaining accounts had relatively low balances of\n                    S$53,539.55 and US$5,308.99. These paltry cash balances could hardly have been\n                    sufficient to meet the bank creditors’ demands for repayment of millions\n                    of dollars outstanding. 60     With regard to cash-flow insolvency, the\n                    defendant contended,inter alia, that as\n                    there were no statutory demands made as at 25 November 2008 (when it was\n                    agreed that the Payment would be made) and 22 December 2008 (the date of\n                    the Payment), the plaintiff was not cash-flow insolvent at the material time.\n                    This contention reveals the defendant’s mistaken conflation between the\n                    winding up process and the judicial management process. Under s 254(1) of\n                    the Companies Act, the court may order the winding up of a company if,inter alia, the company is “unable to pay its\n                    debts”. Under s 254(2), a company shall be deemed to be unable to\n                    pay its debts if,inter alia, (a)    a creditor by\n                            assignment or otherwise to whom the company is indebted in a sum\n                            exceeding $10,000 then due has served on the company by leaving at the\n                            registered office a demand under his hand or under the hand of his agent\n                            thereunto lawfully authorised requiring the company to pay the sum so\n                            due, and the company has for 3 weeks thereafter neglected to pay the sum\n                            or to secure or compound for it to the reasonable satisfaction of the\n                            creditor; ... However, s 227C(a) of the\n                    Companies Act makes it clear that during the period beginning with the making of\n                    an application for a judicial management order and ending with the making of\n                    such an order,no order shall be made for the winding up of\n                        the company. Indeed, s 227D(1)(b) of the Companies Act states that on the making of a judicial\n                    management order, any application for the winding up of the company shall be\n                    dismissed. Thus, the winding up of a company is separate and distinct from the\n                    making of a judicial management order in respect of the same. In any case,\n                    unlike s 254 of the Companies Act, for the purposes of unfair preference\n                    the liquidity test under s 100(4)(a) of the\n                    Bankruptcy Act measures the company’s insolvency in terms of its inability\n                    to pay its debtsas they fall due. InRe Cheyne Finance plc[2008] 2 All ER 987\n                        (“Re Cheyne”), Briggs J\n                    held (at [56]) that the effect of the addition of the words “as they fall\n                    due” in s 123(1)(e) of the UK\n                    Insolvency Act 1986 (in pari materiawith\n                        s 100(4)(a) of the Bankruptcy Act) was\n                    to: ... replace in the commercial solvency test now in s 123(1)(e), one\n                        futurity requirement, namely to include contingent and prospective\n                        liabilities, with another more flexible and fact sensitive requirement\n                        encapsulated in the new phrase ‘as they fall due’. On this view, I am entitled to consider the letters of demand served\n                    on the plaintiffafter22 December 2008 as\n                    evidence that the plaintiff was unable to pay its debts as they fell due. These\n                    include the letters of demand from OCBC and BTMU served on the plaintiff on 26\n                    and 29 December 2008 respectively. 61     Looking at the evidence in its totality, I am\n                    firmly of the view that the plaintiff was cash-flow insolvent when it made the\n                    Payment to the defendant.",
        "The balance sheet test": "62     In view of the fact that the test in\n                    s 100(4) of the Bankruptcy Act is disjunctive rather than conjunctive and\n                    that the plaintiff has failed the liquidity test, it is strictly not necessary\n                    for me to look into the balance sheet test. For the sake of completeness I shall\n                    nevertheless do so. 63     On the face of the plaintiff’s balance\n                    sheets as at 30 September 2008 and 31 December 2008, the plaintiff\n                    appeared to be balance-sheet solvent. However, the Judicial Managers were of the\n                    view that substantial write-downs should be made to the plaintiff’s\n                    investments in subsidiaries and receivables from related companies. This\n                    followed their investigation into the financial affairs of the plaintiff where\n                    they came across dubious entries in the accounts of the plaintiff. Adjustments\n                    to the balance sheet were accordingly made with the approval of the\n                    plaintiff’s directors. With these adjustments, it became evident that the\n                    plaintiff was balance-sheetinsolventat the time\n                    of the Payment. 64     The defendant contended that a retrospective\n                    view of the situation should not be adopted to reach the conclusion that the\n                    plaintiff was balance-sheet insolvent as that would allowex\n                        post factoanalysis to substitute that which the directors of the\n                    Companies honestly believed at the time and represented to its creditors. The\n                    defendant took the position that the Judicial Managers and the directors of the\n                    plaintiff should not have taken into account events that transpired after\n                    31 December 2008 in restating the accounts of the plaintiff as at that\n                    date. This position is misconceived. In the first place, the balance sheet test,\n                    applying s 100(4) of the Bankruptcy Act, is simply whether the value of the\n                    plaintiff’s assets as at the balance sheet date was less than the amount\n                    of its liabilities, taking into account its contingent and prospective\n                    liabilities. The test is an objective one and not subject to the vagaries of the\n                    directors’ subjective views at that time, much less their erroneous views\n                    as demonstrated by their acceptance of the adjustments recommended by the\n                    Judicial Managers. 65     The defendant relied on the Australian case ofLewis (as liquidator of Doran Constructions Pty Ltd (in\n                        liq) and Another v Doran and Others[2005] 54 ACSR 410\n                        (“Doran”) for the proposition\n                    that any solvency assessment must take into account what was known or ought to\n                    have been known at the relevant time. The New South Wales Court of Appeal held\n                    that the company was not insolvent at the time the impugned transaction was\n                    entered into. In his discussion on s 95A of the New South Wales\n                    Corporations Law, Giles JA (with whom Hodgson and McColl JJA agreed), held\n                    that (at [103]): ... Section 95A speaks of objective ability to pay debts as and when they\n                        become due and payable, but ability must be determined in the circumstances\n                        as they were known or ought to have been known at the relevant time, without\n                        intrusion of hindsight. There must of course be ‘consideration ...\n                        given to the immediate future’ (Bank of Australasia\n                            v Hall(1907) 4 CLR 1514 at 1528; 14 ALR 51 at 54–5 per\n                        Griffith CJ), and how far into the future will depend on the\n                        circumstances including the nature of the company’s business and, if\n                        it is known, of the future liabilities. ... 66     There are obvious barriers to the application\n                    of this passage quoted above from Giles JA’s judgment inDoranto the present facts. First, as adroitly pointed\n                    out by Briggs J inRe Cheyne([60]supra) at [41], “neither the Australian\n                    courts nor legislature have developed a balance sheet test of the type found in\n                    s 123(2)” of the UK Insolvency Act 1986 (equivalent to\n                        s 100(4)(b) of the Bankruptcy Act). The\n                    decision inDoranthus has nothing to do with the\n                    balance sheet test for insolvency; Giles JA was construing a provision\n                    regarding “ability to pay debtsas and when they\n                        become due and payable” [emphasis added],ie, the liquidity test for insolvency. 67     Second, the defendant had omitted\n                    Giles JA’s qualification immediately following the passage quoted at[66]above, which I reproduce as\n                    follows: Unexpected laterdiscovery of a liability,\n                        or later quantification of a liability at an unexpected level, may be\n                        excluded from considerationif the liability was\n                            properly unknown or seen in lesser amount at the relevant\n                            time. [emphasis added] In other words, later discovery of a liability or later quantification\n                    of a liability at an unexpected levelmaybe taken\n                    into account if it wasnotunexpected or if it wasnotproperly unknown or seen in lesser amount\n                    at the relevant time. InThe Bell Group Ltd (in liq) v\n                        Westpac Banking Corporation (No 9)[2008] WASC 239\n                        (“The Bell Group”), Owen J\n                    adopted Giles JA’s reference to an assessment made “without\n                    the intrusion of hindsight”, but elaborated that (at [1115]) “when\n                    determining the company’s ability to pay, it must be done according to the\n                    circumstances or state of affairs which were known or ‘knowable’ at the time” [emphasis added].\n                    Furthermore, Owen J also held (at [1116]) that: ... a court can take into account facts available in hindsight (that is,\n                        after the determinative date of solvency) if the facts help determine which\n                        version of conflicting accounts as to the state of affairs is the more\n                        likely. ... 68     Notwithstanding that the views expressed in\n                    the Australian authorities on insolvency wereaproposthe liquidity test rather than the balance sheet test,\n                    even transposing the logic to the balance-sheet test, they do not assist the\n                    defendant in showing that the plaintiff was not balance-sheet insolvent. Many of\n                    the adjustments to the accounts proposed by the Judicial Managers were based on\n                    facts which were “knowable” and thus should not be considered to\n                    be “unexpected” so as to be omitted from the factual matrix\n                    considered in the assessment of the plaintiff’s balance-sheet solvency.\n                    Indeed, based on the post-event facts uncovered by the Judicial Managers, it is\n                    clear that the “proffered expectations of the parties ... were not\n                    realistic” (perOwen J inThe Bell Groupat [1117]), as evidenced by the\n                    directors’ agreement to the adjustments without any demurrer. The Judicial\n                    Managers’ adjustments to the accounts can hardly be described as an\n                    instance where hindsight was allowed to intrude. 69     Therefore, I am of the view that the plaintiff\n                    was also insolvent on the balance sheet test.",
        "Conclusion": "70     For the reasons above, I come to the\n                    conclusion that the Payment to the defendant was an undue preference within the\n                    meaning of s 227T of the Companies Act and is void as against the Judicial\n                    Managers. The defendant shall pay the plaintiff the US$529,720.31 and\n                    US$2,245,429.06 that it received under the Payment together with interest\n                    thereon (at the applicable fixed deposit rate the defendant was paying its prime\n                    customers on or about 22 December 2009) for the period commencing from that date\n                    to the date of judgment herein and thereafter at the rate of 5.33% per annum\n                    until payment. 71     Costs to the plaintiff shall be taxed unless\n                    agreed."
    }
}