{
    "case_title": "Crédit Industriel et Commercial\n      v\n      Teo Wai Cheong",
    "ncitation": "[2010] SGHC 155",
    "coram": "Philip Pillai JC",
    "sections": {
        "Introduction": "1       The 2008 international financial crisis, like previous financial crises, has been followed in Singapore by regulatory actions (seeegMonetary Authority of Singapore:Investigation Report on the Sale and Marketing of Structured Notes linked to Lehman Brothers, (7 July 2009)) and civil litigation. The financial products in each successive financial crisis have become more complex, in tandem with the financial institutions, their discrete services and the varying capacities, sometime proprietary, sometimes agency, in which they transact with their clients. The outcome in each civil litigation case, however, remains to be determined by the applicable common law or statutory causes of action and the evidence adduced. The implications of the common law and statutory causes of actions available and the hurdles to be overcome have been extensively canvassed in the recent English caseJ.P.Morgan Bank (formerly Chase Manhattan Bank) & Others v Springwell Navigation Corporation[2008] EWHC 1186 (“J.P.Morgan”) (see also Melanie Ryan & Andrew Yong, “Springwell– are the English courts the venue of last resort for complex investor claims?” (2009) 24(1) Journal of International Banking Law and Regulation 54, Christa Band, “Selling complex financial products to sophisticated clients:J.P.Morgan Chase v Springwell: Part I” (2009) 24(2) Journal of International Banking Law and Regulation 71, and Christa Band & Karen Anderson, “Selling complex financial products to sophisticated clients:J.P.Morgan Chase v Springwell: Part II” (2009) 24(5) Journal of International Banking Law and Regulation 233). 2       The present case raises a core question of law about private banking and sophisticated clients. When is a private bank acting as a trusted advisor of its client and when is it not? The answer to this question of law falls to be determined by the particular contractual documentation and conduct adduced in evidence in each case.",
        "Summary of this particular dispute": "3       The plaintiff, Crédit Industriel et Commercial (“CIC”), the Singapore branch of a French bank, carries on the business of private banking in Singapore. The defendant, Mr Teo Wai Cheong, is a private banking client of the plaintiff. The present dispute between the parties turns upon whether or not the defendant purchased certain accumulators. Accumulators are complex over-the-counter structured equity products (a structured product apocryphally called “I’ll kill you later” by financial professionals). The plaintiff’s amended statement of claim against the defendant is for (a) payment of the balance sum of S$2,782,803.66 remaining payable for the China Energy shares delivered pursuant to the terms of five disputed accumulator agreements, namely the Third to Seventh China Energy Accumulators (“the Disputed CE Accumulators”) and/or (b) payment of the sum of S$3,625,393.11 for the closing out cost for the Disputed CE Accumulators. Alternatively, the plaintiff claims the sum of S$6,408,196.77 for loans extended by the plaintiff to the defendant for payment of (a) and (b) above. The plaintiff also claims payment of the sum of S$51,323.06 as interest on the sum allegedly owed to it by the defendant as of 29 August 2008. 4       The heart of this dispute is as follows: It is the plaintiff’s case that the defendant instructed the plaintiff’s relationship manager, Ms Ng Su Ming (“Relationship Manager”), to purchase the Disputed CE Accumulators during their telephone calls on 2 and 3 October 2007. The defendant, whilst acknowledging the telephone calls, disputes that he gave instructions or authority to the Relationship Manager to purchase the Disputed CE Accumulators. 5       The defendant seeks to further corroborate his case that he did not instruct the Relationship Manager to purchase the Disputed CE Accumulators by the following additional averments. First, he asserts that he had all along instructed the Relationship Manager to ensure that his total exposure to equity accumulators at any one time should not exceed S$1m and were to be confined to “blue chip” shares. The defendant then avers that he was never told, prior to 19 November 2007, that he was obliged to acquire double the number of shares in each of the Disputed CE Accumulators for the duration when the market price of these shares fell below the forward price. He further avers that he was never told that if he were to terminate the Disputed CE Accumulators prior to their expiry, he would have to pay additional closing out costs. He also expressed surprise, during cross-examination, at the magnitude of the realised losses under the Disputed CE Accumulators as he did not think that the losses, if any, could exceed the amount of his deposits with the plaintiff. The defendant’s counsel in his cross-examination pursued another case theory, namely that the transcripts of recordings of the plaintiff’s backroom execution process, its Private Banking Advisory (“PBA”), did not reveal an exact match between the defendant’s alleged orders and the orders placed by the Relationship Manager. Further, he submitted that the transcripts reveal that she had mistakenly placed orders for a larger number of shares than the defendant had allegedly ordered and had allocated the excess to him.",
        "Complexity and asymmetry of understanding": "6       In contrast toJ.P.Morgan, this dispute turns on a much simpler issue. Nevertheless, even in this trial, there was some degree of complexity relating to accumulators and the private banking processes. These were expressed in the asymmetry of understanding between the defendant’s counsel and the plaintiff’s witnesses, particularly the Relationship Manager. There was evident asymmetry relating to the meaning and effects of the terms of Disputed CE Accumulators. There was also evident asymmetry relating to evidence concerning the order taking process and the communications between the defendant and the Relationship Manager that was compounded by the different interpretations put on the evidence relating to the backroom order execution process including the transcripts of recordings of the PBA. These asymmetries often resulted in disconnects in cross-examination which I took into account in weighing the credibility of the witnesses.",
        "The overarching contractual documents between the plaintiff private bank and the defendant client": "7       Because of the complexity and asymmetries, it becomes useful to first examine the contractual documents that govern this private bank and client relationship in order to more clearly set out and evaluate the evidence adduced within its contractual context. 8       The contractual relationship between the plaintiff and the defendant is set out in a number of standard printed forms. These are standard form contracts, which private banking clients do not normally read, and if read, are not fully understood and rarely negotiated. Nevertheless, in the absence of fraud or misrepresentation, a person is bound by the express contractual terms of the documents which he has signed even though he has not read their content nor understood their language (seeL’Estrange v F Graucob Limited[1934] 2 KB 394 andConsmat Singapore(Pte)Ltd v Bank of America National Trust & Savings Association[1992] 2 SLR(R) 195). 9       The defendant’s contractual private banking relationship with the plaintiff was governed by the following overarching contractual documents: (a)Account Opening and Custodian Agreement (Natural Persons)of 11 August 2006 – contains the Terms and Conditions of the Account Opening and Custodian Agreement and sets out the Risk Disclosure Statement separately signed by the defendant in Appendix A; and the Terms and Conditions for Treasury Services in Appendix B;(b)Banking Facility Letterof 29 September 2006 – in it the plaintiff confirmed availability to the defendant of up to USD 5m as a loan facility, up to USD 5m to facilitate his entering of Treasury Contracts and up to USD 5m to facilitate his entering into margin trading transactions; and(c)Charge Agreement (Natural Persons)dated 29 September 2006 – in it the defendant agreed to charge all his deposits and investment portfolio to secure payment of all monies owed by him to the plaintiff.(a)   Account Opening and Custodian Agreement (Natural Persons)10     The function of the Account Opening and Custodian Agreement is to set out the terms and conditions which are to govern the plaintiff’s general and specific financial facilities to the defendant.11     It starts out with a one page Preamble which reads:PreambleThis file contains the Account Opening Documents, which all clients are required to execute in order to open an account and utilize the private banking services in Asia of Crédit Industriel et Commercial (the “Bank”). These private banking services have been designed for sophisticated and experienced investors (“High Net Worth Individuals” as defined in the Guidelines issued by the Monetary Authority of Singapore) who have the expertise, the understanding of financial product, as well as the desire and financial capacity to invest in domestic and international markets.…The Bank will not, unless it specifically agrees to do so in writing, provide investment management services to clients. The Bank may be prepared to provide to clients access to the research and market information it receives from its own resources and from third parties. This research and market information is believed to be reliable, but the Bank does not guarantee its accuracy, its completeness nor whether it is current. The clients are responsible for evaluating this research and market information and deciding whether or not it is appropriate to act upon it.12     The account opening agreement is framed as a request by the defendant, to the plaintiff, to open accounts with the plaintiff and to hold in such accounts cash, term deposits, securities, deeds, documents and other properties deposited with or transferred to the plaintiff or any third party nominated by the plaintiff. There is an acknowledgement that the defendant has read and understood the Terms and Conditions annexed to the form, that he has not found any provisions confusing or objectionable, that he agrees to be bound by them and that charges are payable to the plaintiff for its services. The defendant signed this document and the Relationship Manager witnessed his signature.13     Some of the material terms and conditions of the Account Opening and Custodian Agreement are as follows:Clause 6.03:-In respect of the purchase or sale of an Investment the Bank may act as agent of the Client or as a principal to the transaction.…Clause 23.02:-The Client shall indemnify the Bank, its officers and employees against all liabilities, claims, costs and damages of any kind which may be incurred by any of them and all actions or proceedings which may be brought by or against them in connection with any Investment made by the Bank on behalf of the Client or other assets and the exercise of its powers and rights of the Bank under this Charge, unless due to the gross negligence or willful default of the Bank, its officers or employees.…Clause 24:-The Bank shall have a lien over all the Investments deposited pursuant hereto (or transferred into the Bank’s name or the name of its nominee) for all obligations, costs, payments and expenses incurred or payable by the Client whether directly or indirectly in connection with these Terms and Conditions and the fee payable by the Client to the Bank pursuant to sub-Clause 19.01 hereof. The Bank shall be entitled to realize and sell so much thereof in such a manner as the Bank shall deem fit if any of such costs, payments or expenses, or the fee payable pursuant to sub-Clause 19.01 hereof remain owing after demand and the proceeds thereof (after deducting the expenses of realization and sale) shall be applied in or towards settlement.The Client shall have no right or claim against the Bank in respect of any loss arising out of any realization or sale, howsoever caused and whether or not a better price could have been obtained by either deferring or advancing the date of such realization or sale or otherwise howsoever.…Clause 25.04:-The Bank is authorised to act on the basis of an oral instruction (“Oral Instruction”) given directly or by telephone provided that the Bank is satisfied as to the identity of the caller pursuant to the verification process selected by the Bank.Any transaction entered into by the Bank pursuant to an Oral Instruction given in accordance with this procedure shall be binding upon the Client whether or not the Client shall have been given any subsequent written confirmation in respect of such Instructions. The Bank shall not be liable to the Client for any loss or damage which the Bank may incur or suffer as a consequence of the Bank acting upon such Instructions.The Client further undertakes to fully indemnify the Bank and its officers, employees and agents against all actions, proceedings, claims, demands, losses, liabilities and expenses of whatever nature which may be sustained or incurred in consequence of the Bank entering into any transactions pursuant to an Oral Instruction. …Appendix A Risk Disclosure Statement14     The Risk Disclosure Statement is set out in Appendix A of the Terms and Conditions. It is highlighted and the client’s particular attention is drawn to it by requiring the client to additionally sign off a separate acknowledgement against this statement. The Risk Disclosure Statement sets out in general terms the risks involved in financial transactions including (but not limited to) foreign exchange, currency swaps and options transactions, interest rate swaps, caps, floors, collars, non-deliverable forwards and other financial derivative transactions. It states:The intention of this statement is to draw your attention to the fact that there is some degree of financial risk associated with the financial transactions mentioned above. You should be prepared to carry the burden of these and all other risks and the Bank will not be responsible for any losses arising from your transactions unless the same is caused by the Bank’s wilful misconduct. Accordingly, before deciding whether to transact you must understand the nature, terms and conditions and risks associated with the transactions and consider whether such trading is suitable for you in light of your financial condition and investment objectives.In particular, you should make such enquiries, take such care and consult such professional advisers, as would be the case had you traded and/or entered into the transactions without the assistance of the Bank. You should make your own appraisal of or investigation of the advantages, disadvantages and risks of a particular transaction and should not rely solely on the Bank to advise you of the same, and the Bank shall not be obliged at any time to provide such advice. If you are in doubt or do not fully understand a transaction, you should refrain from entering it.15     The above is followed by a description of some of the specific risks which may arise with respect to the following products: derivatives, structured and over-the-counter deals, options, dual currency investments, contracts for differences, foreign markets/off-exchange transactions, margin trading, emerging markets, liquidation of position, suspension of restriction on trading and electronic trading, credit characteristics, pricing relationships, currency risks, and risk of counterparties and brokers. In particular, the paragraph relating to “margin trading” reads:You should be aware that you may sustain a total loss of the initial margin and any additional funds that you deposit with the Bank to maintain a position. If the market moves against you, you may be called upon to pay substantial additional margin at short notice to maintain the position. If you fail to do so, your position may be liquidated at a loss and you will be liable for any resulting deficit.The high degree of leverage due to the small margin requirement that is often obtainable in currency, options and futures trading can work against you as well as for you. The use of leverage can lead to large losses as well as large gains. Losses may exceed the amount of margin deposited by you with the Bank and you will be liable to the Bank for any shortfall between the margin deposited and the loss incurred. …The Risk Disclosure Statement ends with the following:The Bank highly recommends that you consult your lawyers, accountants, tax advisors, brokers and other professional advisers before making such investment. Accordingly, if you enter into transactions with the Bank, the Bank will assume that you understand and accept the characteristics and risks associated with such transactions.In accepting any services or facilities made available to you, you agree that (a) you have made your own assessment in relation to investment or trading transactions; (b) the Bank is not under any responsibility to make or give advice or make recommendations; (c) if any suggestions are made by the Bank, it assumes no responsibility for your portfolio or for any investment or transaction made; (d) you are responsible for monitoring the performance and continuing appropriateness of outstanding transactions; (e) the Bank and its affiliates may hold positions in securities, currencies or other commodities and derivatives thereof which may not be consistent with any advice given by its officers or employees; (f) any risk associated with and any loss suffered as a result of the Bank entering into any transactions or investments on your behalf is your responsibility; and (g) you will indemnify the Bank against any loss or liability which it may suffer in relation to the foregoing matters.Signed Acknowledgment Risk Disclosure Statement16     The Acknowledgment of the Risk Disclosure Statement which was separately signed by the defendant, reads as follows:This acknowledges that I/we have received a copy of the RISK DISCLOSURE STATEMENT and that I/we have carefully read and understood its contents.I/We also acknowledge that the Risk Disclosure Statement is not and cannot be comprehensive, and further confirm that I/we have made such enquiries on my/our own and have taken or will take such care as would be the case had I/we traded and/or entered into the transactions without the assistance of the Bank. The Bank shall not be liable for any loss, damage or liabilities which may be incurred by us in connection with the transactions.Appendix B Terms and Conditions for Treasury Services17     Appendix B, which sets out the Terms and Conditions for Treasury Services,inter alia, reads:This Appendix B sets out the general terms and conditions governing all treasury contracts and sets out the bank’s rights relating to set-off, combination and consolidation of accounts, settlement and payment netting, termination, close out and liquidation of treasury contracts and margin trading.Summary of Risk Disclosure Terms18     In short, the signed Risk Disclosure Statement highlights and allocates the risks to the client as follows:(i)that the client’s financial transactions carry risks which he is prepared to bear;(ii)that the plaintiff is not responsible for any losses arising from the client’s financial transactions, unless the same is caused by the plaintiff’s wilful misconduct;(iii)that before transacting, the client should understand the nature, terms and conditions and risks associated with the transaction and whether such trading is suitable for him in light of his financial condition and investment objectives;(iv)that the client should make enquiries and take care and consult other professional advisers as he would have, had he traded or entered the transactions without the assistance of the plaintiff;(v)that the client should make his own risk assessments and not rely solely on the plaintiff to advise him and that plaintiff is not obliged at any time to provide such advice; and(vi)if the client is in doubt or does not fully understand a transaction he should refrain from entering it.19     To drive this home, the Risk Disclosure ends with the following:(i)the plaintiff recommends the client to consult his lawyers, accountants, tax advisors, brokers and other professional advisers before making investments; and(ii)the client by accepting any bank services or facilities agrees that(a)he had made his own risk assessment;(b)the plaintiff is under no responsibility to make or give advice or make recommendations;(c)if suggestions are made by the plaintiff it assumes no responsibility for his portfolio, investment or transaction;(d)he is responsible for monitoring the performance and continuing appropriateness of his transactions;(e)the plaintiff and its affiliates may hold positions not consistent with any advice given;(f)any risk and loss suffered is his responsibility; and(g)the client is to indemnify the plaintiff against any loss or liability it may suffer in relation to the foregoing.20     The plaintiff does not by these terms purport to be its client’s trusted advisor. The client is to make his own risk assessments and is recommended to seek financial advice elsewhere should he require it. The plaintiff does not hold itself out to be offering advice or recommendations.(b)   Banking Facility Letter21     The purpose and function of the Banking Facility Letter is to provide leverage for the defendant, subject to the terms and up to the limits set out therein. Under this Banking Facility Letter, the plaintiff confirms granting to the defendant pursuant to his request, a loan facility of up to USD 5m, an amount of up to USD 5m to facilitate his entering Treasury Contracts and an amount up to USD 5m to facilitate his entering margin trading transaction against his entering a Charge Agreement.22     The Banking Facility Letter sets out the interest rates, the margin requirements for treasury contracts and its availability subject to the plaintiff receiving a duly executed charge agreement and such further security as it may require from time to time. Whilst the plaintiff does not charge a fee for providing the facility and actual utilisation depends on suitable investment opportunities, the plaintiff anticipates that the defendant will make reasonable use of the facility. Clause 1 reads:For the avoidance of doubt, any certificate issued to you by the Bank and signed by an officer of the Bank certifying the amount(s) which are overdue hereunder shall, in the absence of manifest error, be conclusive evidence for all purposes as to the amount due and owing to the Bank by you and shall be binding on you.(c)   Charge Agreement23     The Charge Agreement provides the plaintiff with a first fixed charge and lien against the defendant’s deposits and investment portfolio as a continuing security for the due and punctual payment of all moneys owed to the bank.Summary of economic substance of contractual documents24     The economic substance of the above contractual documents can be distilled as follows: The client places some deposits with the bank. The bank provides interest bearing loans to enable him to leverage his investments. The client provides a charge over all deposits and investments with the bank. The client makes his investment decisions, within these financial risk limits and his own risk appetite. The bank executes his investment decisions either as principal or as agent. The bank’s economic interests arise from interest on the facilities, but principally from the receipts of agency fees or principal gains, arising from the volume of his leveraged investment decisions within the financial risk limits.The contractual terms of the Disputed CE Accumulators25     In addition to the overarching contractual documents above, it is necessary to examine the particular terms of the investment product. Such examination also helps to clarify the interplay between the evidence adduced within this context.26     Turning first then to the nature of accumulators in general, it ought to be pointed out that the accumulators are not standard exchange-traded products; they are customised over-the-counter products. Exchange traded derivatives are products like options and futures which are traded on an exchange. Over-the-counter products, like accumulators, are derivatives which are not traded on an exchange. The terms of each accumulator are set out in its particular term sheet. The form and content of each accumulator, however, follows a standard industry format. Each accumulator confirmation or term sheet is expressed to incorporate by reference and to be construed by theInternational Swaps and Derivatives Association Master Agreementand the2002 International Swaps and Derivatives Association Equity Derivative Definitions.27     The following is an extract of the principal terms of one of the term sheets of the Disputed CE Accumulators and is typical of the terms of the other Disputed CE Accumulators as well:Accumulator on China Energy LtdCounterparty: CIC-ClientTrade Date: 1st October 2007Effective Date: 2nd October 2007Observation Period End Date: 30 September 2008, subject to early termination due to a Knock-out Event, Market Disruption event or certain Extraordinary Events.Initial Price: SGD 1.6701Forward Price: SGD 1.5198 (91% of Initial Price)Share Accumulation per day:1,500 shares if Closing Price >= Strike Price3,000 shares if Closing Price < Strike PriceSettlement Scenario: Subject to no Knock-Out Event occurring in an Observation Period, the following will take place on the Settlement Date following that Observation Period:Settlement Scenario: Subject to no Knock-Out Event occurring in an Observation Period, the following will take place on the Settlement Date following that Observation Period:(1)CIC will deliver to the Counterparty the number of Shares calculated as follows:Share Accumulation per Day * Number of Scheduled Trading Days in the Observation Period(2)Counterparty will pay CIC a SGD amount calculated as follows and rounded to the nearest cent:Forward Price * Share Accumulation per Day * number of Scheduled Trading Days in the Observation PeriodClearance System: Central Depository (Pte) Ltd.Knock–out Price: SGD 1.7202 (103% of Initial Spot Price)Knock-out Event: A Knock-out Event occurs when the traded price per Share quoted by the Exchange is, at any time on any Exchange Business Day from the first Observation Period Start Date to the Valuation Time on the Valuation Date (both inclusive).AT OR ABOVEthe Knock-Out Price.Settlement Scenario on Knock-Out Settlement Date:A.If the Knock-out Occurrence Date is on or before the end of First Observation Period, on the Knock-out Settlement Date:(1)CIC will deliver to Counterparty the number of Shares calculated as follows:Share Accumulation per Day * 20(2)Counterparty will pay CIC a SGD amount calculated as follows and rounded to the nearest cent.Forward Price * Share Accumulation per Day * 20Where for the purposes of (A) above, Share Accumulation per Day for shall be deemed to be 1500 shares for all days falling on or after the Knock-Out Occurrence Date.B.If the Knock-out Occurrence Date is after the end of the First Observation Period, on the Knock-out Settlement Date:(1)CIC will deliver to Counterparty the number of Shares calculated as follows:Share Accumulation per Day * Number of Accumulation Days from and including the first day of the relevant Accumulation Period to and excluding the Knock-Out Date(2)Counterparty will pay CIC a SGD amount calculated as follows and rounded to the nearest cent:Forward Price * Share Accumulation per Day * Number of Accumulation Days from and including the first day of the relevant Accumulation Period to and excluding the Knock-Out Date.For avoidance of doubt, the Observation Period with respect to this Knock-out settlement will begin on the Observation Period Start Date as stated in the table above and end on the Scheduled Trading Day immediately before the Knock-out Occurrence Date (both dates inclusive).DISCLAIMER1.This product is not suitable for all investors and involves a variety of risks. Please note that we are willing to negotiate this transaction with you because a) you have sufficient knowledge, experience and professional advice to make your own evaluation of the merits and risks of making an investment of this type and b) you are not relying on Credit Industriel et Commercial, Singapore Branch (“CIC”) or any affiliate of CIC for information, advice or recommendation of any sort except the factual terms of the transaction.2.This Termsheet does not identify all the risks (direct or indirect) or other consideration which might be material to you when entering into this transaction. You should consult your own legal, regulatory, tax, business, investment, financial and accounting advisers to the extent that you deem it necessary and make your own investment, hedging and trading decision (including decisions regarding the suitability of this investment) based on your own judgment an the advice from your advisers.3.This Termsheet supersedes and replaces any other correspondence or confirmation if any, relating to this product on or prior to the date hereof.4.This Termsheet shall be read in conjunction with the Risk Disclosure Statement you have signed together with the Account Opening and Custodian Agreement.5.By having given instructions to purchase the product, you are deemed to have understood and agreed to the terms, conditions and risks set in this Termsheet.Summary of economic substance of an accumulator contract28     In short, pursuant to the abovementioned term sheet, the defendant contracted to purchase 1,500 China Energy shares per week at a price of S$1.5981(“Forward Price”) representing a discount of 9% to the current share market price then of S$1.6701 (“Initial Price”). In exchange for this discount, he contracted to purchase 1,500 China Energy shares per week for about 52 weeks. During these 52 weeks, he contracted to double his weekly purchases, when the market price of the share fell below the Forward Price. However, during these 52 weeks, in the event that the market price of the shares were to rise beyond S$1.7202 (103% of the Initial Price), the accumulator was automatically knocked-out. An accumulator upon knock-out automatically releases both the defendant from any further obligation to buy, and the plaintiff from any further obligation to sell, any China Energy shares for the rest of the 52 weeks. The settlement process involves the purchaser making weekly payments for shares delivered during the term of the accumulator and the seller being obliged to deliver either the shares or the cash equivalent.The defendant’s averments29     Turning now to the dispute between the parties, I shall at the outset deal with the defendant’s additional averments in[5]which can be disposed of briefly.30     The defendant first averred that his instructions to the Relationship Manager was to ensure his “total exposure” to equity accumulators at any one time should not exceed S$1m and was to be confined to “blue chip” shares. However, the defendant provided no substantiating evidence as to his instructions. Second, he did not define what he meant by “total exposure”. He did make several allusions to the “maximum obligation” under the Disputed CE Accumulators being beyond S$1m. However, it was clarified in court by the plaintiff’s witnesses that “maximum obligation” means the purchaser’s obligation to purchase double the number of shares, in the worst case scenario, where the market price of the share drops and remains below the forward price, for the entire duration of the accumulator. This is quite different from “total exposure” which is the estimated normal risk at any one time. In any event, the defendant had on record purchased accumulators whose maximum obligation far exceeded S$1 million. As for “blue chip” shares, these remained undefined in the evidence and his previous accumulator purchases included a wider range of shares than might commonly be regarded as “blue chip”.31     His second averment is that he was never told, prior to 19 November 2007, that he would be obliged to acquire double the number of shares in each of the Disputed CE Accumulators for the duration when the market price of the shares fell below the Forward Price. However, the term sheets of the relevant Disputed CE Accumulators expressly set out that where the closing price of the shares exceeds the strike price, the number of shares to be accumulated per day doubles. Thisex facieputs paid to this averment.32     His third averment is that he was never told that if he were to terminate the Disputed CE Accumulators prior to their expiry, he would have to pay additional closing out costs. However, should he have required further information or clarification about terminating the accumulators, he could have so requested either from the plaintiff or from his external advisers. The plaintiff was under no contractual obligation to ensure that the defendant understood the full import and implications of all the terms of the accumulators. There was nothing to prevent him from requesting information or clarification which he, by his evidence never did until 5 December 2007. Indeed the term sheet of the Disputed CE Accumulators set out the relevant disclaimers relating to the defendant’s need to make his own risk assessments (see[27]above).33     The defendant’s other averment is that of his surprise at the magnitude of the realised losses and his expectation that his losses, if any, could not exceed the amount of his deposits with the plaintiff. However, considering that he had signed and accepted banking facilities for up to USD 15m, which was several times the amount of his deposits, this has little merit.Evidence and inferences of fact34     Having dealt with the above, the pivotal question of fact in this action is whether the defendant had instructed the Relationship Manager during the telephone calls between them on 2 and 3 October 2007, to purchase the Disputed CE Accumulators. If the defendant did instruct the Relationship Manager to purchase the Disputed CE Accumulators, then he must consequently be liable for the price of the China Energy shares delivered pursuant to the terms of the Disputed CE Accumulators and the closing out costs, in the absence of any other viable contractual defences, none of which were raised. I will evaluate the evidence before me and set out my inferences of fact in the following order of evidence that was adduced:(a)Witness testimony relating to content of telephone calls on 2 and 3 October 2007;(b)The defendant’s experience with accumulators and his earlier purchases of China Energy shares and undisputed CE Accumulators; and(c)The conduct of the plaintiff and the defendant after the purchase of the Disputed CE Accumulators:(i)The plaintiff despatched the Disputed CE Accumulators term sheets, China Energy share confirmation notes and monthly statements to the defendant and requested further security;(ii)The defendant was silent for a considerable period after being informed;(iii)The defendant paid S$160,000 by cheque to the plaintiff and his previously acquired China Energy shares were sold to pay for China Energy shares to be acquired under the Disputed CE Accumulators; and(iv)The plaintiff had senior management meetings with the defendant on 20 and 28 November 2007.(a)   Witness testimony relating to content of telephone calls on 2 and 3 October 200735     The undisputed evidence regarding the telephone calls is as follows:At09:34 on 2 October 2007,the Relationship Manager sent a text message (“SMS”) to the defendant which read:“Ok, last night us very gd. Rally shld continue. Can I do somemore? Looking at china energy, cosco and ferrochina”.At09:34:06(2 minutes and 22 seconds) andat17:35:05(2 minutes and 34 seconds) on2 October 2007there were two telephone calls from the defendant to the Relationship Manager;At10:27:27(1 minute and 15 seconds) andat11:00:17(1 minute and 34 seconds) on3 October 2007there were two telephone calls from the Relationship Manager to the defendant.[Emphasis added in bold]36     It is the plaintiff’s case, and the Relationship Manager’s evidence, that the defendant instructed the Relationship Manager to purchase the Disputed CE Accumulators and one SembCorp Accumulator during the telephone conversations on 2 October 2007 (the 09:34:06 call) and 3 October 2007 (the 10:27:27 call).37     Under cross-examination, the defendant stated that whilst he did not remember the details of the telephone calls, the calls were not about purchasing the Disputed CE Accumulators. When questioned further on the purpose of his calling the Relationship Manager on 2 October 2007 at 09:34:06 (just six seconds after he received the SMS), the defendant claimed that he had called the Relationship Manager to enquire about the status of shares which he had previously purchased under earlier undisputed accumulators. He gave evidence under cross-examination that these shares would have been Neptune Orient Line (“NOL”) shares, Cosco shares and China Energy shares and that he had instructed the Relationship Manager to sell off the NOL shares and Cosco shares but to retain the China Energy shares. When asked to explain why he would call the Relationship Manager again on 3 October 2007 when he no longer had shares in his account, save for the China Energy shares which he had already instructed her to retain, he responded that he could not recall what was discussed during the 3 October 2007 conversation.38     In my view, it can be reasonably inferred that since the defendant called the Relationship Manager just six seconds after receiving her 2 October 2007 morning SMS, he was responding to the contents of her SMS, in which she had clearly asked him if she could purchase more accumulators in 3 named shares including China Energy. The defendant’s testimony under cross-examination does not negate this. He admitted making these calls and I did not accept his evidence that the calls had nothing to do with the Disputed CE Accumulators.39     The Relationship Manager, in her Affidavits in Evidence in Chief (“AEIC”) (at paras 40 – 42) describes the communications between herself and the defendant and the typical lead up to instructions to purchase an accumulator as follows (this process hereinafter described as the “AEIC Order Process Narrative”):Prior to establishing each of the twenty (20) Accumulators under the Defendant’s instructions, [the Relationship Manager], on behalf of the Plaintiffs, would:-provide the Defendant with certain information on the particular share counter, including some information and recommendations of the research analysts from various brokers and/or financial institutions;inform the Defendant of the maximum quantity of shares that the Defendant would be obliged to accumulate under that particular Accumulator; andinform the Defendant of the Maximum Obligation under that particular Accumulator.The Defendant would then communicate his instructions to the Plaintiffs in relation to the Accumulators, through [the Relationship Manager], either orally in telephone conversations (on [the Relationship Manager]’s mobile phone) or via a SMS....Accordingly, once the Defendant confirms with [the Relationship Manager] his instructions to establish the said Accumulator, the Plaintiffs would execute the Accumulator for and on his behalf. Thereafter, as a standard practice, the Plaintiffs would send term sheets, confirmation notes and monthly statements of accounts detailing the terms of the said Accumulator to the Defendant.40     The Relationship Manager’s AEIC Order Process Narrative (see[39]) provides a narrative of the nature of the running communications and conversations between her and the defendant over a period of time which would culminate in the defendant’s oral instructions to purchase an accumulator.41     The defendant’s counsel laid considerable store by his cross-examination of the Relationship Manager on what she had stated in her AEIC. The defendant’s counsel sought to demonstrate that her AEIC Order Process Narrative could not possibly gel with the content of the SMS and the short telephone conversations on 2 and 3 October 2007. By so doing, he sought to discredit the witness in order that her evidence be disbelieved.42     It was however evident during cross-examination that the defendant’s counsel and the Relationship Manager were often at cross-purposes. There was a lack of clarity and consistency of usage of the technical expressions. An illustration of the dissonance between the Relationship Manager’s AEIC Order Process Narrative and her answers under cross-examination, in relation to the content of the critical telephone conversations on 2 and 3 October 2007 is as follows:(a)     The Relationship Manager stated under cross-examination that the defendant had given her a range of spot or initial prices of between S$1.75 to S$1.82 which the China Energy Accumulator could be established. When the defendant’s counsel pointed out to the Relationship Manager that she had not mentioned that she had discussed any alleged range of spot price with the defendant in her AEIC, she could not explain the omission. She then asserted that the forward price was given at a range of between 89.25% and 91%.Q:Now where is that in your affidavit evidence, that he gave you a range of 1.75 to 1.82?A:Because, your Honour, this was what was communicated to me by [the defendant]. When I go out there to the PBA desk to place the orders, that is why when we hit the market, rather, or they communicate to the counterparty, and then that’s how they acquired the orders, accumulators back, because that he [sic] the way accumulators are structured it’s not possible for us – it’s not like a normal store that I can just say a price and we buy at that price.Q:But that has been your evidence so far, Ms Ng. That has been your evidence so far in this case, that you told him what the initial price was?A:Yes.Q:That you told him what the forward price was?A:Mm-hmm. …Q:You told him what the knockout price was?A:Yes, your Honour, that’s true.Q:And then on the basis of what you told him, he then said “Okay, I agree to do an accumulator at those prices”. But your evidence now is quite different. Your evidence now is that you didn’t tell him what the forward price was, you didn’t tell him what the initial price was, you didn’t tell him what the knockout price was. You told him a range. It says, “Can I establish accumulators for you within this range?”, and this is the first time we are hearing from you about this range?A:Your Honour, I disagree on that, because the thing is, [the defendant’s counsel] started asking me about the China Energy accumulators, right? So the thing is when we establish an accumulator throughout this period of time from July to October, okay, it’s always a series of conversations, a series of sms, a series of information. If you could refer to page 427 of my AEIC, what I communicated to [the defendant] was that the proposed spot price, okay, due to the last night’s rally, and the research analyst report – …… Because what happens is during the conversation, I told – after [the defendant] has said that, “Okay, the maximum obligation is 6 million, right?”, we discussed the proposed spot price, which is between 1.75 to 1.82. He knows that the proposed forward price is between 89.25 per cent to 91 per cent, and that would depend on the spot price that has been established. And the knockout is between 102, which is end of day knockout, or 103 intraday knockdown.Q:Let’s just stop there. How does he know that the forward price is between the 89.5 per cent and – what is the other percentage that you said?A:89.25 per cent and 91 per cent.Q:Yes. This is again the first time I’m hearing about that.A:Your Honour, I think for clarity’s sake, maybe this AEIC was written to – so that it’s clearer that we put the proposed – I mean the forward price there, rather than as a percentage, however, this proposed forward price is the structure of the accumulator.43     The Relationship Manager appeared to be conflating two quite separate processes. One was the typical flow of communications and conversations between the defendant and her which would culminate in an oral instruction to purchase a particular accumulator which she described in her AEIC Order Process Narrative. The other was the precise contents of the short morning telephone conversations with the defendant the 2 and 3 October 2007. As a result of conflating the two, she often tripped up under cross-examination in explaining how she could have managed to provide all the detailed information she purports to have provided as described in her AEIC Order Process Narrative, in the course of the short telephone conversations, quite apart from the additional matter of ranges which she also said under cross-examination that she provided.44     The defendant had sight of the transcripts of recordings of the backroom conversations between the Relationship Manager and the plaintiff’s PBA and their conversations with the accumulator counterparty. In relation to those, he made the following closing submissions in support of his case that he did not instruct the Relationship Manager to purchase the Disputed CE Accumulators during the telephone calls on 2 and 3 October 2007:(a)He first challenged her evidence that she only places the defendant’s orders after she has received his orders. On 2 October 2007, there were four accumulators done for the defendant. These could not have been done for the defendant as if the first telephone conversation took place at 09:34 the transcripts of conversations between the Relationship Manager and the plaintiff’s PBA indicate that orders for the Disputed Third to Fifth CE Accumulators with the counterparty took place even before the 09:34 conversation with the defendant.(b)He pointed out that the Relationship Manager had given evidence that she was instructed to purchase S$6m CE Accumulators in the Disputed Fourth and Fifth CE Accumulators but had placed an order with the PBA at 10:32 for just S$1m and only later at 11:44 did she place an order for S$6.74m. He submitted that this could lead to the inference that the defendant in fact did not give her any instructions to purchase the Disputed CE Accumulators.(c)With regard to the Disputed Sixth CE Accumulator, the defendant had allegedly given the Relationship Manager a range to buy between S$1.75 and S$1.82. However, the shares had been bought at S$1.74 which was outside, albeit lower than the range.(d)With regard to the Disputed Seventh CE Accumulator, the Relationship Manager averred that the defendant gave her the range of maximum obligation S$4–5m during the 10:27 telephone call on 3 October 2007. However, she had mistakenly placed an order for S$4.5m (without including the doubling effect of what would constitute the maximum obligation). He submitted that having exceeded her authorised range of maximum obligation, she proceeded to dump the excess accumulators on him.45     The plaintiff responded as follows:(a)It was the Relationship Manager’s evidence that her orders are consolidated with orders of her other clients. As a result, the orders placed by the plaintiff with the counterparties do not match with any one client’s orders or even the timing of such orders.(b)The Relationship Manager consolidates, executes and only allocates her confirmed transactions at the end of each day to each of her clients, including the defendant.(c)The Relationship Manager had in her evidence answered that she did not exceed the price range instructed by the defendant because it is the practice to take the average of the prices of the total number of Disputed CE Accumulators purchased. When the prices of the four Disputed CE Accumulators are averaged:i.e. S$1.79, S$1.81, S$1.79 and S$1.74, the average was S$1.789 which is within the range of S$1.75 to S$1.82.(d)It is industry practice not to include the possible doubling effect when the bank places orders with counterparties. The Relationship Manager had admitted that there had been a mistake relating to the Disputed Seventh CE Accumulator in her having purchased an excess. It is her evidence however that she had other client’s orders which she filled with this excess. It was also the evidence of the plaintiff’s general manager that mistakes in orders can be reversed at the end of the day. In the light of this there was no reason for the Relationship Manager to dump the Disputed Seventh CE Accumulator on the defendant as these could have been unwound.46     The defendant, who is external to these processes, has postulated that there does not appear to be a direct match between each of the defendant’s alleged accumulator orders and the orders executed by the bank backroom. This, he submits, further corroborates his defence that he did not make these purchases. However I accepted the plaintiff’s explanations for three reasons. First, the plaintiff’s explanation is consistent with the transcript of the recordings of the backroom execution – that there was consolidation of orders. Second, the backroom execution process is the plaintiff’s own. It is accordingly in the best position to explain how its own process works including the consolidation of other client orders. Finally, the mismatch between the defendant’s alleged order and the orders placed by the Relationship Manager with PBA is answered by her explanation of her consolidating the defendant’s orders with the orders of her other customers. The defendant’s observation of exceeding his price range was made in abstract without taking into account the market practice of execution averaging described by the plaintiff. I am accordingly, unable to accept the defendant’s submission that the transcripts support the defendant’s case that he did not instruct the Relationship Manager to purchase the Disputed CE Accumulators during the telephone calls on 2 and 3 October 2007.47     In considering the evidence relating to the content of the critical telephone calls on 2 and 3 October 2007, what I find most significant is the defendant’s inability to explain satisfactorily his version of the contents of the telephone conversation, as he disputes that they were about instructions to purchase the Disputed CE Accumulators (see[37]above).48     The only two participants to these two telephone calls were the defendant and the Relationship Manager. Evaluating their evidence, I find the Relationship Manager’s evidence on her understanding of the product terms and her order taking process to have gaps, and thus unhelpful. Notwithstanding this shortcoming, I find her evidence that the defendant instructed her to purchase the Disputed CE Accumulators during the telephone calls on 2 and 3 October 2007 to be credible. This is supported by her having initiated the SMS query which led to the defendant’s almost immediate telephone call in response. By contrast I do not find the defendant’s evidence on the content of the telephone calls to be credible. He appeared to me to be evasive and when challenged under cross-examination he was obliged to fall back on the response that he could not recall.(b)   The defendant’s experience with accumulators and his earlier purchases of China Energy shares and undisputed CE Accumulators49     I next test the consistency of my findings and inferences of fact against the defendant’s prior experience with accumulators and his purchases of undisputed CE Accumulators and retention of China Energy shares.50     The defendant had between July 2007 and September 2007 purchased through the Relationship Manager, fourteen accumulators involving Cosco, DBS, Noble and China Energy shares. Starting with USD328,263.00 in his account in July 2007, the defendant’s account recorded USD393,521.00 by the end of September 2007. Over two months, the defendant realised a profit of USD65,258.00 (about a 20% return) from accumulators.51     Closer to the date of the Disputed CE Accumulators, on 26 September 2007, the Relationship Manager informed the defendant that he had realised a profit of S$37,000 when the DBS shares acquired under three DBS Accumulators (approximately S $5.7m Maximum Obligation) were sold and that he could make an additional profit of S$17,000 if the defendant chose to sell the Cosco shares acquired that day under a Cosco Accumulator with a maximum obligation of approximately S$2.35m.52     It was the defendant’s evidence that on or around 2 October 2007, he had requested the Relationship Manager to sell his Cosco shares but to keep the China Energy shares previously acquired under the undisputed First and Second China Energy Accumulators, even though he would have realised an immediate profit had he then sold them. Under cross-examination, the defendant could not explain why he chose to keep the China Energy shares, stating initially that he forgot why he did so, and then finally conceding that it could be because he had thought the prices of the China Energy shares would go up further.Q:You do recall that, in your affidavit, you told [the Relationship Manager] to sell the Cosco but to keep the China Energy shares accumulated so far; which means the China Energy shares accumulated under the first and second China Energy accumulator; correct?A:Correct.Q:My question to you – and I asked you this a few times – was what made you decide to keep the China Energy shares? I asked a few questions on that. I also told you that you had sub-prime concerns, which is why you wanted to stop doing accumulators. My questions to you then were, why did you want to keep a share counter you knew nothing about, since, in your view, the sub-prime would affect the Singapore stock market. Then I asked you questions as to what would make you keep a share, even when there is a storm brewing. You said you spoke to [the Relationship Manager] and if the share would still go up in the long term, even though it was going to go down in the short term, you would keep the share; correct?A:Yes.53     The defendant’s prior profitable experience with accumulators and his retention of the China Energy shares are consistent with my findings and inferences of fact that he had instructed the Relationship Manager to purchase the Disputed CE Accumulators during the telephone calls on 2 and 3 October 2007. His preceding profitable experience with accumulators and his recent retention of China Energy shares explain his likely purchase of the Disputed CE Accumulators and his ambiguous behaviour in not promptly and unequivocally rejecting them.(c)   The conduct of the plaintiff and the defendant after the purchase of the Disputed CE Accumulators54     Having considered the witnesses’ evidence relating to the content of the telephone calls on 2 and 3 October 2007, the defendant’s experience with accumulators and his earlier purchases of CE share and undisputed CE Accumulators, I now turn to examine the evidence relating to the conduct of the plaintiff and the defendant after the purchase of the Disputed CE Accumulators for consistency with my findings and inferences of fact.(i)   The plaintiff despatched the Disputed CE Accumulators term sheets, China Energy share confirmation notes and monthly statements to the defendant and requested further security55     The plaintiff despatched Disputed CE Accumulators term sheets, China Energy share confirmation notes and monthly statements to the defendant and the defendant does not dispute that he had received them in the ordinary course.56     The plaintiff also sent to the defendant his October 2007 monthly statement of account, whichinter alia, stated:The bank must be notified in writing within thirty (30) days of the statement date of any errors or omissions in the statement or the related contract notes. In the absence of such notification, the client is deemed to have agreed to the balances and details of the account.57     Notwithstanding this, the defendant did not promptly contact or query the plaintiff about either the Disputed CE Accumulators term sheets or the China Energy shares acquired thereunder. Neither did he contact the plaintiff nor make queries about his October 2007 monthly statement of account. He also did not return these documents to the plaintiff. All that he claimed he did was raise an objection to the Relationship Manager on 16 October 2007 and that he had given her one month to resolve the matter.58     According to the Relationship Manager, from 16 October 2007 to around 13 November 2007, she made repeated requests to the defendant to bring in the additional funds required to acquire the China Energy shares which he was obliged to acquire under the Disputed CE Accumulators. This included requests by the plaintiff to the defendant to provide more security, by taking steps such as mortgaging his house or transferring more funds from his trading account in another financial institution.(ii)   The defendant was silent for a considerable period after being informed59     The evidence adduced reveals that save for a telephone conversation on 18 October 2007, there were no communications between the defendant and the Relationship Manager until 5 November 2007. The defendant did not contact the Relationship Manager for any status update. On 2 November 2007, which was the scheduled settlement date for the China Energy shares acquired under three of the Disputed CE Accumulators, the Relationship Manager called the defendant twice but the defendant did not answer her calls. On 5 November 2007, the Relationship Manager called the defendant three times. The defendant once again did not answer her calls. The defendant returned the Relationship Manager’s telephone calls on the afternoon of 5 November 2007. It was a call which lasted for 27 minutes.60     Were the defendant to have given the Relationship Manager one month from 18 October 2007 to resolve the issue of the Disputed CE Accumulators, it might be expected that he would have called her or responded to her repeated telephone calls of 2 and 5 November 2007. He does not appear to have done so.(iii)   The defendant paid S$160,000 by cheque to the plaintiff and his previously acquired China Energy shares were sold to pay for China Energy shares to be acquired under the Disputed CE Accumulators61     It is not disputed that two separate payments were subsequently made in connection with the Disputed CE Accumulators from funds provided by the defendant and from the proceeds of liquidation of his previously acquired China Energy shares.62     On 7 November 2007 the defendant issued a cheque for S$160,000 to the plaintiff. The cheque was used to pay for the China Energy shares acquired under the Disputed CE Accumulators.63     The defendant’s explanation of this payment is that he had issued this cheque as the Relationship Manager had told him that the money was for the payment of shares acquired under the undisputed First and Second CE Accumulators and under the SembCorp Accumulator. Consequently, this cheque was not payment for the Disputed CE Accumulators. It is difficult to accept the defendant’s explanation for the following reasons: first, the shares acquired under the First and Second CE Accumulators had already been paid for on or around 2 October 2007 and would have been reflected in the statements received by the time he issued this cheque. Second, as he had given the Relationship Manager one month from 18 October 2007 to resolve the matter and it had yet to be resolved, it is difficult to understand why he would nevertheless on 7 November 2007 deliver a S$160,000.00 cheque to her without reserving his rights or position.64     On 16 November 2007 the plaintiff sold 180,000 China Energy shares. It claims it did so under the defendant’s instructions. 60,000 of the 180,000 China Energy shares were acquired by the defendant under the undisputed First and Second China Energy Accumulators and the remaining 120,000 shares were acquired by the defendant under the Disputed CE Accumulators. The sale proceeds were then used to pay for the new China Energy shares acquired under the Disputed CE Accumulators.65     The defendant avers that he did not know that the proceeds of sale of his previously acquired China Energy shares were to be used for the payment of new China Energy shares acquired under the Disputed CE Accumulators. He avers that the plaintiff had unilaterally applied the sale proceeds to these new China Energy shares acquired under the Disputed CE Accumulators. By this averment he attests only that he did not know how the plaintiff applied these sale proceeds. However, confirmation notes reflecting the sale of the China Energy shares (including those under the Disputed CE Accumulators) were sent to and received by the defendant. He did not raise any query at the time.66     In these circumstances, I am of the view that contrary to the defendant’s averment, he knew that he was making payment or he acquiesced with knowledge in the sale of the abovementioned China Energy shares. He would not have made the cheque payment had the Disputed CE Accumulators, in the first place, not been purchased under his instructions. Neither would he have made the cheque payment without reserving his position had he been waiting for the resolution of the Disputed CE Accumulators.(iv)   The plaintiff had senior management meetings with the defendant on 20 and 28 November 200767     On 20 November 2007, the defendant met with the plaintiff’s Mr Paul Kwek (“Mr Kwek”) and the Relationship Manager. The note of the meeting prepared by Mr Kwek, records,inter alia:1.    Mr Teo expressed surprise at the size of his exposure. He made remarks like he is not well versed with equity accumulator, he was only into blue chips, he was not fully apprised of the risks involved, the sizes of the contract are very high relative to his networth and risk appetite,etc. When I pressed as to whether he is denying the contracts, he said no but that the bank has to take some responsibility for them.2.    I told him that if the contracts are valid, then we have to address the near term issue of funds to pick up the shares as and when they get ‘striked’ in the weeks ahead. The other issue is margin for the remaining tenor of the contracts. Mr Teo did not want to commit himself on these matters. He wants to meet up with GM of the branch so that all his concerns can be addressed. We told him that we will schedule a meeting next week when the GM is back from Paris.3.    He questioned our margin requirementsvis-à-visthe contracts done. Sue said that she had all along been asking him to bring in additional funds but he has not responded.68     Under cross-examination by the defendant’s counsel, Mr Kwek stated that at the meeting on 20 November 2007, he specifically asked the defendant whether the latter was denying liability for the Disputed CE Accumulators and the defendant had replied “no”.69     However, according to the defendant, Mr Kwek’s contemporaneous note of their meeting on 20 November 2007 is not an accurate reflection of what transpired at the meeting. Under cross-examination, the defendant challenged Mr Kwek’s evidence as follows:(i)He expressed surprise at the deals that were being done on his accounts with that kind of exposure, and not merely at the size of the exposure;(ii)He had informed Mr Kwek that the Disputed CE Accumulators were not authorised;(iii)Mr Kwek did not inform him about the need to bring in funds to pick up the shares acquired under the Disputed CE Accumulators; and(iv)He did not ask on the margin requirements for the contracts as he did not understand what a margin was.70     However, when the plaintiff’s counsel showed the defendant that the contents of his own emails of 21 November 2007 and 23 November 2007 were similar to Mr Kwek’s contemporaneous note of 20 November 2007, the defendant changed his evidence. The defendant admitted that the issue of funds to acquire the China Energy shares was addressed at the meeting but that he had told Mr Kwek that he did not want to acquire the shares. The defendant further admitted that it was possible that parties had spoken on the margin requirements for the Disputed CE Accumulators:Court:To clarify for your benefit, on page 90, paragraph numbered 2, plaintiff's counsel has taken you line by line through this email.A:Sorry, your Honour, the --Court:Page 90.A:Of the plaintiff's core bundle of documents?Court:Yes, the core bundle. He had taken you line by line through that email and asked you which lines you would agree reflected your conversation with Paul Kwek on 30 (sic) November, and which you did not. In the paragraph numbered 2, he took you through two sentences. The first one: \"If the contracts are valid, then we have to address the near term issue of funds to pick up the shares as and when they get 'striked' in the weeks ahead.\"A:Yes, your Honour.Court:Yes. So, your email three days later, 23 November, page 176, in the second last paragraph you state: \"I will not be interested even if the shares gets knocked out next week.\" And the last line: \"... I am also not prepared to pick up the next batch of shares that you mentioned earlier that is due next week.\"A:Yes, your Honour.Court:In the light of these two things, would you want to restate your position on the second paragraph of Paul Kwek's internal email to the bank?A:Yes, I think I will accept that, your Honour.Q:So you will accept that Mr Kwek then said that you have to address the near term issue of funds to pick up the shares, correct? He raised that to you?A:Yes, I accept that.Q:In fact, I understand that Mr Kwek told you what has to be done in relation to the picking up of the shares, right? He explained that to you.A:Say that again?Q:He explained to you what you needed to do to be able to pick up the next batch of shares that were due under the accumulators.A:Yes, he -- I think he is asking me to -- better think of how to raise money to pick up the shares, yeah.Q:To pick up the shares. He told you that, right? And so his paragraph 2, first sentence is correct. How about the second sentence now, because earlier you also said that was incorrect. I will give you another chance. He also raised: \"The other issue is margin for the remaining tenure of the contracts.” Do you want to think about this again and see whether he may have raised the issue of margin for the remaining tenure of the contracts?A:I, quite frankly --Q:Can't remember?A:-- I can't remember because the margin is something that I'm not -- I'm not familiar with.Q:But it is possible that he raised an issue with you on the margin for the remainder tenure of the contracts? \"Contracts\" meaning the unauthorised transactions. Correct? Right?A:It's possible.Q:It's possible, right. So you have confirmed that he spoke to you about the near term issue of funds, to pick up shares due under the unauthorised transactions; and he may have possibly spoken to you about the margin for the remaining tenure of the contracts. Correct? That's your evidence now.A:Correct.71     Critically, when I questioned the defendant regarding whether Mr Kwek had asked him whether he was denying the Disputed CE Accumulators, the defendant changed his mind and claimed that he could not recall whether this statement was made by him at the meeting on 20 November 2009. This contradicted the defendant’s earlier position in the affidavits he filed in these proceedings where he clearly denied that the statement was made at the 20 November 2007 meeting.Court:With the benefit of having looked over your transcript, as well as this, you are looking literally at paragraph 1, the last sentence. It was your evidence yesterday that Mr Paul Kwek did not press you as to whether you were denying and you said \"no\". Are you basically saying now that you could not recall whether that statement was made at that meeting?A:Yes, I couldn't recall.Q:Now, for that also you say you cannot recall: you are now confirming that?A:I can't recall, yes.72     The defendant’s evidence about the meeting on 20 November 2007 is contradictory. The defendant’s own emails of 21 November 2007 and 23 November 2007 support the plaintiff’s version of the events which took place at the meeting on 20 November 2007. Under cross-examination, the defendant suggested that Mr Kwek may have lied in his contemporaneous note of the meeting of 20 November 2007, in order to cover up for his employee. The bare assertion was not supported by any evidence.73     On 28 November 2007, the defendant attended a second meeting, this time with the plaintiff’s General Manager, Mr Jean Luc Anglada (“Mr Anglada”) and Mr Kwek. It is their evidence that the defendant also did not, at this meeting, deny that he gave instructions to the Relationship Manager to purchase the Disputed CE Accumulators. The defendant disputes this but in light of the evidence adduced, I accepted their account. There was no evidence to establish that Mr Anglada would, in addition to Mr Kwek, cover up for the Relationship Manager.The defendant’s equivocation in rejecting Disputed CE Accumulators74     On 5 December 2007, the defendant requested the plaintiff to provide him with the estimated costs of closing out the Disputed CE Accumulators. The plaintiff thereafter also provided the defendant with a summary of his accumulators in January 2008. They also made arrangements for the defendant to attend an analysts lunch meeting scheduled in February 2008 by the China Energy management.75     Given the defendant’s experience with accumulators, the question does arise as to what accounts for his equivocal conduct between 16 October and 5 December 2007 which marks the time between when he claims he first discovered the Disputed CE Accumulators and the time he requested information about closing out costs. If he were rejecting the Disputed CE Accumulators, what could account for his inaction - his payment of S$160,000 and his instructions, or knowing acquiescence in the sale of his previously acquired China Energy shares to pay for new China Energy shares under the Disputed CE Accumulators? Why did he not vigorously and unequivocally reject the Disputed CE Accumulators prior to or when he first met the plaintiff’s senior management on two separate occasions in November 2007?76     It was Mr Anglada’s evidence that the defendant could have, if he wished, mitigated his loss in the declining China Energy market price by selling off his acquired shares promptly and terminating the accumulator by paying the closing out costs. There are only two choices when the market price of the relevant share dives and continues a sustained dive below the forward price of the accumulator. Where the purchaser remains bullish about the underlying share, he may decide to retain the acquired shares, and continue to double up the shares he becomes obliged to acquire. Should the market price of the underlying share thereafter recover beyond the forward price, he can then sell his doubled share acquisitions at a profit. Alternatively, the purchaser can cut loss by selling all the shares acquired previously and promptly terminating the accumulator by paying the closing out costs. I accepted his evidence.77     In the light of Mr Anglada’s evidence as to the two available risk decisions, how is the defendant’s equivocation in the face of a declining China Energy share price consistent with my finding and decision? There were produced in evidence, some market analysts’ recommendations between October and December 2007 which projected a target price of the China Energy shares which was significantly higher than the Disputed China Energy Accumulators Knock-Out price. There was also evidence of the defendant’s prior decision with another earlier accumulator, the Second Noble Accumulator. The market price of Noble shares had fallen below the Second Noble Accumulator Forward Price for a number of days during which the defendant was obliged to double up his share acquisitions. However, thereafter the market price of Noble shares recovered and the Second Noble Accumulator was knocked-out some two months after it was established. The defendant had made a significantly larger profit when he later sold the Noble shares, including the doubled acquisitions during the Noble market share price downturn. If the defendant remained bullish about China Energy shares notwithstanding its share price decline in October 2007, this would explain his equivocation in neither clearly rejecting the Disputed CE Accumulators nor terminating them.78     What the defendant faced was the immediate pressure of the plaintiff’s margin calls and requests for additional security. The defendant’s equivocation as to the Disputed CE Accumulators during this period is consistent with a bullish expectation of recovery of the market price of China Energy shares. By his equivocation he was able to defer having to provide additional margin and security as pressed for by the bank. It was only by the time of the meeting of 5 December 2007 with the plaintiff’s senior managers that he appears to have ceased to be bullish about China Energy shares. He only then asked for an estimate of the closing out costs.79     He appears thereafter to have taken no further actions. Sometime in or around March 2008, the market price of the China Energy shares declined sharply. By way of a letter dated 14 March 2008, the plaintiff’s solicitors demanded that the defendant make payment to the plaintiff of the outstanding sum of S$4,125,745.00 which was due and owing to the plaintiff as of 6 March 2008 pursuant to the terms of the Disputed CE Accumulators.80     As the defendant had not made any payment, the plaintiff exercised its rights under the contractual documents and closed out the Disputed CE Accumulators from 10 April to 21 April 2008 and set-off the funds in the defendant’s account towards payment of the outstanding sum due under the Disputed CE Accumulators.81     On or around 27 May 2009, the plaintiff issued a conclusive certificate of indebtedness (see[22]above) certifying that the outstanding sum (including interest) due and owing from the defendant to the plaintiff as of 29 August 2008 was S$6,459,519.83. This sum consisted of:(a)S$2,782,803.66 for the China Energy shares delivered pursuant to the terms of the Disputed CE accumulators and which was paid by the Plaintiffs to the counterparties;(b)S$3,625,393.11 which the plaintiff paid to the counterparties to close-out the Third to Seventh China Energy Accumulators; and(c)interest of S$51,323.06 as of 29 August 2008.The plaintiff then brought the present action claiming these amounts against the defendant (see above at[3]).Conclusion82     In the light of the evidence and my findings, and in the totality of the prior and subsequent consistent conduct of the parties in relation to the Disputed CE Accumulators, I find that the defendant did instruct the Relationship Manager to purchase the Disputed CE Accumulators during the telephone conversations on 2 and 3 October 2007. It is not necessary to further deal with the plaintiff’s alternative submissions as to estoppel.83     I now return to the core question of law about private banking and sophisticated clients raised in[2]in the light of the relevant contractual documents and the evidence adduced in this dispute:When is a private bank acting as a trusted advisor of its client and when is it not?84     A private bank is not acting as a trusted advisor of its client when (a) its account opening form and Risk Disclosure Statement highlight to the client that he is responsible for the risks in his transactions and recommends that he takes advice from other professional advisers, including his accountants, lawyers and tax advisors, and further that the bank does not make recommendations or give advice and (b) this is borne out by the evidence of conduct.85     Judgment for the plaintiff. Costs are to be taxed or agreed.",
        "(a)   Account Opening and Custodian Agreement (Natural Persons)": "10     The function of the Account Opening and Custodian Agreement is to set out the terms and conditions which are to govern the plaintiff’s general and specific financial facilities to the defendant. 11     It starts out with a one page Preamble which reads: Preamble This file contains the Account Opening Documents, which all clients are required to execute in order to open an account and utilize the private banking services in Asia of Crédit Industriel et Commercial (the “Bank”). These private banking services have been designed for sophisticated and experienced investors (“High Net Worth Individuals” as defined in the Guidelines issued by the Monetary Authority of Singapore) who have the expertise, the understanding of financial product, as well as the desire and financial capacity to invest in domestic and international markets. … The Bank will not, unless it specifically agrees to do so in writing, provide investment management services to clients. The Bank may be prepared to provide to clients access to the research and market information it receives from its own resources and from third parties. This research and market information is believed to be reliable, but the Bank does not guarantee its accuracy, its completeness nor whether it is current. The clients are responsible for evaluating this research and market information and deciding whether or not it is appropriate to act upon it. 12     The account opening agreement is framed as a request by the defendant, to the plaintiff, to open accounts with the plaintiff and to hold in such accounts cash, term deposits, securities, deeds, documents and other properties deposited with or transferred to the plaintiff or any third party nominated by the plaintiff. There is an acknowledgement that the defendant has read and understood the Terms and Conditions annexed to the form, that he has not found any provisions confusing or objectionable, that he agrees to be bound by them and that charges are payable to the plaintiff for its services. The defendant signed this document and the Relationship Manager witnessed his signature. 13     Some of the material terms and conditions of the Account Opening and Custodian Agreement are as follows: Clause 6.03:- In respect of the purchase or sale of an Investment the Bank may act as agent of the Client or as a principal to the transaction. … Clause 23.02:- The Client shall indemnify the Bank, its officers and employees against all liabilities, claims, costs and damages of any kind which may be incurred by any of them and all actions or proceedings which may be brought by or against them in connection with any Investment made by the Bank on behalf of the Client or other assets and the exercise of its powers and rights of the Bank under this Charge, unless due to the gross negligence or willful default of the Bank, its officers or employees. … Clause 24:- The Bank shall have a lien over all the Investments deposited pursuant hereto (or transferred into the Bank’s name or the name of its nominee) for all obligations, costs, payments and expenses incurred or payable by the Client whether directly or indirectly in connection with these Terms and Conditions and the fee payable by the Client to the Bank pursuant to sub-Clause 19.01 hereof. The Bank shall be entitled to realize and sell so much thereof in such a manner as the Bank shall deem fit if any of such costs, payments or expenses, or the fee payable pursuant to sub-Clause 19.01 hereof remain owing after demand and the proceeds thereof (after deducting the expenses of realization and sale) shall be applied in or towards settlement. The Client shall have no right or claim against the Bank in respect of any loss arising out of any realization or sale, howsoever caused and whether or not a better price could have been obtained by either deferring or advancing the date of such realization or sale or otherwise howsoever. … Clause 25.04:- The Bank is authorised to act on the basis of an oral instruction (“Oral Instruction”) given directly or by telephone provided that the Bank is satisfied as to the identity of the caller pursuant to the verification process selected by the Bank. Any transaction entered into by the Bank pursuant to an Oral Instruction given in accordance with this procedure shall be binding upon the Client whether or not the Client shall have been given any subsequent written confirmation in respect of such Instructions. The Bank shall not be liable to the Client for any loss or damage which the Bank may incur or suffer as a consequence of the Bank acting upon such Instructions. The Client further undertakes to fully indemnify the Bank and its officers, employees and agents against all actions, proceedings, claims, demands, losses, liabilities and expenses of whatever nature which may be sustained or incurred in consequence of the Bank entering into any transactions pursuant to an Oral Instruction. … Appendix A Risk Disclosure Statement 14     The Risk Disclosure Statement is set out in Appendix A of the Terms and Conditions. It is highlighted and the client’s particular attention is drawn to it by requiring the client to additionally sign off a separate acknowledgement against this statement. The Risk Disclosure Statement sets out in general terms the risks involved in financial transactions including (but not limited to) foreign exchange, currency swaps and options transactions, interest rate swaps, caps, floors, collars, non-deliverable forwards and other financial derivative transactions. It states: The intention of this statement is to draw your attention to the fact that there is some degree of financial risk associated with the financial transactions mentioned above. You should be prepared to carry the burden of these and all other risks and the Bank will not be responsible for any losses arising from your transactions unless the same is caused by the Bank’s wilful misconduct. Accordingly, before deciding whether to transact you must understand the nature, terms and conditions and risks associated with the transactions and consider whether such trading is suitable for you in light of your financial condition and investment objectives. In particular, you should make such enquiries, take such care and consult such professional advisers, as would be the case had you traded and/or entered into the transactions without the assistance of the Bank. You should make your own appraisal of or investigation of the advantages, disadvantages and risks of a particular transaction and should not rely solely on the Bank to advise you of the same, and the Bank shall not be obliged at any time to provide such advice. If you are in doubt or do not fully understand a transaction, you should refrain from entering it. 15     The above is followed by a description of some of the specific risks which may arise with respect to the following products: derivatives, structured and over-the-counter deals, options, dual currency investments, contracts for differences, foreign markets/off-exchange transactions, margin trading, emerging markets, liquidation of position, suspension of restriction on trading and electronic trading, credit characteristics, pricing relationships, currency risks, and risk of counterparties and brokers. In particular, the paragraph relating to “margin trading” reads: You should be aware that you may sustain a total loss of the initial margin and any additional funds that you deposit with the Bank to maintain a position. If the market moves against you, you may be called upon to pay substantial additional margin at short notice to maintain the position. If you fail to do so, your position may be liquidated at a loss and you will be liable for any resulting deficit. The high degree of leverage due to the small margin requirement that is often obtainable in currency, options and futures trading can work against you as well as for you. The use of leverage can lead to large losses as well as large gains. Losses may exceed the amount of margin deposited by you with the Bank and you will be liable to the Bank for any shortfall between the margin deposited and the loss incurred. … The Risk Disclosure Statement ends with the following: The Bank highly recommends that you consult your lawyers, accountants, tax advisors, brokers and other professional advisers before making such investment. Accordingly, if you enter into transactions with the Bank, the Bank will assume that you understand and accept the characteristics and risks associated with such transactions. In accepting any services or facilities made available to you, you agree that (a) you have made your own assessment in relation to investment or trading transactions; (b) the Bank is not under any responsibility to make or give advice or make recommendations; (c) if any suggestions are made by the Bank, it assumes no responsibility for your portfolio or for any investment or transaction made; (d) you are responsible for monitoring the performance and continuing appropriateness of outstanding transactions; (e) the Bank and its affiliates may hold positions in securities, currencies or other commodities and derivatives thereof which may not be consistent with any advice given by its officers or employees; (f) any risk associated with and any loss suffered as a result of the Bank entering into any transactions or investments on your behalf is your responsibility; and (g) you will indemnify the Bank against any loss or liability which it may suffer in relation to the foregoing matters. Signed Acknowledgment Risk Disclosure Statement 16     The Acknowledgment of the Risk Disclosure Statement which was separately signed by the defendant, reads as follows: This acknowledges that I/we have received a copy of the RISK DISCLOSURE STATEMENT and that I/we have carefully read and understood its contents. I/We also acknowledge that the Risk Disclosure Statement is not and cannot be comprehensive, and further confirm that I/we have made such enquiries on my/our own and have taken or will take such care as would be the case had I/we traded and/or entered into the transactions without the assistance of the Bank. The Bank shall not be liable for any loss, damage or liabilities which may be incurred by us in connection with the transactions. Appendix B Terms and Conditions for Treasury Services 17     Appendix B, which sets out the Terms and Conditions for Treasury Services,inter alia, reads: This Appendix B sets out the general terms and conditions governing all treasury contracts and sets out the bank’s rights relating to set-off, combination and consolidation of accounts, settlement and payment netting, termination, close out and liquidation of treasury contracts and margin trading. Summary of Risk Disclosure Terms 18     In short, the signed Risk Disclosure Statement highlights and allocates the risks to the client as follows: (i)that the client’s financial transactions carry risks which he is prepared to bear;(ii)that the plaintiff is not responsible for any losses arising from the client’s financial transactions, unless the same is caused by the plaintiff’s wilful misconduct;(iii)that before transacting, the client should understand the nature, terms and conditions and risks associated with the transaction and whether such trading is suitable for him in light of his financial condition and investment objectives;(iv)that the client should make enquiries and take care and consult other professional advisers as he would have, had he traded or entered the transactions without the assistance of the plaintiff;(v)that the client should make his own risk assessments and not rely solely on the plaintiff to advise him and that plaintiff is not obliged at any time to provide such advice; and(vi)if the client is in doubt or does not fully understand a transaction he should refrain from entering it.19     To drive this home, the Risk Disclosure ends with the following:(i)the plaintiff recommends the client to consult his lawyers, accountants, tax advisors, brokers and other professional advisers before making investments; and(ii)the client by accepting any bank services or facilities agrees that(a)he had made his own risk assessment;(b)the plaintiff is under no responsibility to make or give advice or make recommendations;(c)if suggestions are made by the plaintiff it assumes no responsibility for his portfolio, investment or transaction;(d)he is responsible for monitoring the performance and continuing appropriateness of his transactions;(e)the plaintiff and its affiliates may hold positions not consistent with any advice given;(f)any risk and loss suffered is his responsibility; and(g)the client is to indemnify the plaintiff against any loss or liability it may suffer in relation to the foregoing.20     The plaintiff does not by these terms purport to be its client’s trusted advisor. The client is to make his own risk assessments and is recommended to seek financial advice elsewhere should he require it. The plaintiff does not hold itself out to be offering advice or recommendations.(b)   Banking Facility Letter21     The purpose and function of the Banking Facility Letter is to provide leverage for the defendant, subject to the terms and up to the limits set out therein. Under this Banking Facility Letter, the plaintiff confirms granting to the defendant pursuant to his request, a loan facility of up to USD 5m, an amount of up to USD 5m to facilitate his entering Treasury Contracts and an amount up to USD 5m to facilitate his entering margin trading transaction against his entering a Charge Agreement.22     The Banking Facility Letter sets out the interest rates, the margin requirements for treasury contracts and its availability subject to the plaintiff receiving a duly executed charge agreement and such further security as it may require from time to time. Whilst the plaintiff does not charge a fee for providing the facility and actual utilisation depends on suitable investment opportunities, the plaintiff anticipates that the defendant will make reasonable use of the facility. Clause 1 reads:For the avoidance of doubt, any certificate issued to you by the Bank and signed by an officer of the Bank certifying the amount(s) which are overdue hereunder shall, in the absence of manifest error, be conclusive evidence for all purposes as to the amount due and owing to the Bank by you and shall be binding on you.(c)   Charge Agreement23     The Charge Agreement provides the plaintiff with a first fixed charge and lien against the defendant’s deposits and investment portfolio as a continuing security for the due and punctual payment of all moneys owed to the bank.Summary of economic substance of contractual documents24     The economic substance of the above contractual documents can be distilled as follows: The client places some deposits with the bank. The bank provides interest bearing loans to enable him to leverage his investments. The client provides a charge over all deposits and investments with the bank. The client makes his investment decisions, within these financial risk limits and his own risk appetite. The bank executes his investment decisions either as principal or as agent. The bank’s economic interests arise from interest on the facilities, but principally from the receipts of agency fees or principal gains, arising from the volume of his leveraged investment decisions within the financial risk limits.The contractual terms of the Disputed CE Accumulators25     In addition to the overarching contractual documents above, it is necessary to examine the particular terms of the investment product. Such examination also helps to clarify the interplay between the evidence adduced within this context.26     Turning first then to the nature of accumulators in general, it ought to be pointed out that the accumulators are not standard exchange-traded products; they are customised over-the-counter products. Exchange traded derivatives are products like options and futures which are traded on an exchange. Over-the-counter products, like accumulators, are derivatives which are not traded on an exchange. The terms of each accumulator are set out in its particular term sheet. The form and content of each accumulator, however, follows a standard industry format. Each accumulator confirmation or term sheet is expressed to incorporate by reference and to be construed by theInternational Swaps and Derivatives Association Master Agreementand the2002 International Swaps and Derivatives Association Equity Derivative Definitions.27     The following is an extract of the principal terms of one of the term sheets of the Disputed CE Accumulators and is typical of the terms of the other Disputed CE Accumulators as well:Accumulator on China Energy LtdCounterparty: CIC-ClientTrade Date: 1st October 2007Effective Date: 2nd October 2007Observation Period End Date: 30 September 2008, subject to early termination due to a Knock-out Event, Market Disruption event or certain Extraordinary Events.Initial Price: SGD 1.6701Forward Price: SGD 1.5198 (91% of Initial Price)Share Accumulation per day:1,500 shares if Closing Price >= Strike Price3,000 shares if Closing Price < Strike PriceSettlement Scenario: Subject to no Knock-Out Event occurring in an Observation Period, the following will take place on the Settlement Date following that Observation Period:Settlement Scenario: Subject to no Knock-Out Event occurring in an Observation Period, the following will take place on the Settlement Date following that Observation Period:(1)CIC will deliver to the Counterparty the number of Shares calculated as follows:Share Accumulation per Day * Number of Scheduled Trading Days in the Observation Period(2)Counterparty will pay CIC a SGD amount calculated as follows and rounded to the nearest cent:Forward Price * Share Accumulation per Day * number of Scheduled Trading Days in the Observation PeriodClearance System: Central Depository (Pte) Ltd.Knock–out Price: SGD 1.7202 (103% of Initial Spot Price)Knock-out Event: A Knock-out Event occurs when the traded price per Share quoted by the Exchange is, at any time on any Exchange Business Day from the first Observation Period Start Date to the Valuation Time on the Valuation Date (both inclusive).AT OR ABOVEthe Knock-Out Price.Settlement Scenario on Knock-Out Settlement Date:A.If the Knock-out Occurrence Date is on or before the end of First Observation Period, on the Knock-out Settlement Date:(1)CIC will deliver to Counterparty the number of Shares calculated as follows:Share Accumulation per Day * 20(2)Counterparty will pay CIC a SGD amount calculated as follows and rounded to the nearest cent.Forward Price * Share Accumulation per Day * 20Where for the purposes of (A) above, Share Accumulation per Day for shall be deemed to be 1500 shares for all days falling on or after the Knock-Out Occurrence Date.B.If the Knock-out Occurrence Date is after the end of the First Observation Period, on the Knock-out Settlement Date:(1)CIC will deliver to Counterparty the number of Shares calculated as follows:Share Accumulation per Day * Number of Accumulation Days from and including the first day of the relevant Accumulation Period to and excluding the Knock-Out Date(2)Counterparty will pay CIC a SGD amount calculated as follows and rounded to the nearest cent:Forward Price * Share Accumulation per Day * Number of Accumulation Days from and including the first day of the relevant Accumulation Period to and excluding the Knock-Out Date.For avoidance of doubt, the Observation Period with respect to this Knock-out settlement will begin on the Observation Period Start Date as stated in the table above and end on the Scheduled Trading Day immediately before the Knock-out Occurrence Date (both dates inclusive).DISCLAIMER1.This product is not suitable for all investors and involves a variety of risks. Please note that we are willing to negotiate this transaction with you because a) you have sufficient knowledge, experience and professional advice to make your own evaluation of the merits and risks of making an investment of this type and b) you are not relying on Credit Industriel et Commercial, Singapore Branch (“CIC”) or any affiliate of CIC for information, advice or recommendation of any sort except the factual terms of the transaction.2.This Termsheet does not identify all the risks (direct or indirect) or other consideration which might be material to you when entering into this transaction. You should consult your own legal, regulatory, tax, business, investment, financial and accounting advisers to the extent that you deem it necessary and make your own investment, hedging and trading decision (including decisions regarding the suitability of this investment) based on your own judgment an the advice from your advisers.3.This Termsheet supersedes and replaces any other correspondence or confirmation if any, relating to this product on or prior to the date hereof.4.This Termsheet shall be read in conjunction with the Risk Disclosure Statement you have signed together with the Account Opening and Custodian Agreement.5.By having given instructions to purchase the product, you are deemed to have understood and agreed to the terms, conditions and risks set in this Termsheet.Summary of economic substance of an accumulator contract28     In short, pursuant to the abovementioned term sheet, the defendant contracted to purchase 1,500 China Energy shares per week at a price of S$1.5981(“Forward Price”) representing a discount of 9% to the current share market price then of S$1.6701 (“Initial Price”). In exchange for this discount, he contracted to purchase 1,500 China Energy shares per week for about 52 weeks. During these 52 weeks, he contracted to double his weekly purchases, when the market price of the share fell below the Forward Price. However, during these 52 weeks, in the event that the market price of the shares were to rise beyond S$1.7202 (103% of the Initial Price), the accumulator was automatically knocked-out. An accumulator upon knock-out automatically releases both the defendant from any further obligation to buy, and the plaintiff from any further obligation to sell, any China Energy shares for the rest of the 52 weeks. The settlement process involves the purchaser making weekly payments for shares delivered during the term of the accumulator and the seller being obliged to deliver either the shares or the cash equivalent.The defendant’s averments29     Turning now to the dispute between the parties, I shall at the outset deal with the defendant’s additional averments in[5]which can be disposed of briefly.30     The defendant first averred that his instructions to the Relationship Manager was to ensure his “total exposure” to equity accumulators at any one time should not exceed S$1m and was to be confined to “blue chip” shares. However, the defendant provided no substantiating evidence as to his instructions. Second, he did not define what he meant by “total exposure”. He did make several allusions to the “maximum obligation” under the Disputed CE Accumulators being beyond S$1m. However, it was clarified in court by the plaintiff’s witnesses that “maximum obligation” means the purchaser’s obligation to purchase double the number of shares, in the worst case scenario, where the market price of the share drops and remains below the forward price, for the entire duration of the accumulator. This is quite different from “total exposure” which is the estimated normal risk at any one time. In any event, the defendant had on record purchased accumulators whose maximum obligation far exceeded S$1 million. As for “blue chip” shares, these remained undefined in the evidence and his previous accumulator purchases included a wider range of shares than might commonly be regarded as “blue chip”.31     His second averment is that he was never told, prior to 19 November 2007, that he would be obliged to acquire double the number of shares in each of the Disputed CE Accumulators for the duration when the market price of the shares fell below the Forward Price. However, the term sheets of the relevant Disputed CE Accumulators expressly set out that where the closing price of the shares exceeds the strike price, the number of shares to be accumulated per day doubles. Thisex facieputs paid to this averment.32     His third averment is that he was never told that if he were to terminate the Disputed CE Accumulators prior to their expiry, he would have to pay additional closing out costs. However, should he have required further information or clarification about terminating the accumulators, he could have so requested either from the plaintiff or from his external advisers. The plaintiff was under no contractual obligation to ensure that the defendant understood the full import and implications of all the terms of the accumulators. There was nothing to prevent him from requesting information or clarification which he, by his evidence never did until 5 December 2007. Indeed the term sheet of the Disputed CE Accumulators set out the relevant disclaimers relating to the defendant’s need to make his own risk assessments (see[27]above).33     The defendant’s other averment is that of his surprise at the magnitude of the realised losses and his expectation that his losses, if any, could not exceed the amount of his deposits with the plaintiff. However, considering that he had signed and accepted banking facilities for up to USD 15m, which was several times the amount of his deposits, this has little merit.Evidence and inferences of fact34     Having dealt with the above, the pivotal question of fact in this action is whether the defendant had instructed the Relationship Manager during the telephone calls between them on 2 and 3 October 2007, to purchase the Disputed CE Accumulators. If the defendant did instruct the Relationship Manager to purchase the Disputed CE Accumulators, then he must consequently be liable for the price of the China Energy shares delivered pursuant to the terms of the Disputed CE Accumulators and the closing out costs, in the absence of any other viable contractual defences, none of which were raised. I will evaluate the evidence before me and set out my inferences of fact in the following order of evidence that was adduced:(a)Witness testimony relating to content of telephone calls on 2 and 3 October 2007;(b)The defendant’s experience with accumulators and his earlier purchases of China Energy shares and undisputed CE Accumulators; and(c)The conduct of the plaintiff and the defendant after the purchase of the Disputed CE Accumulators:(i)The plaintiff despatched the Disputed CE Accumulators term sheets, China Energy share confirmation notes and monthly statements to the defendant and requested further security;(ii)The defendant was silent for a considerable period after being informed;(iii)The defendant paid S$160,000 by cheque to the plaintiff and his previously acquired China Energy shares were sold to pay for China Energy shares to be acquired under the Disputed CE Accumulators; and(iv)The plaintiff had senior management meetings with the defendant on 20 and 28 November 2007.(a)   Witness testimony relating to content of telephone calls on 2 and 3 October 200735     The undisputed evidence regarding the telephone calls is as follows:At09:34 on 2 October 2007,the Relationship Manager sent a text message (“SMS”) to the defendant which read:“Ok, last night us very gd. Rally shld continue. Can I do somemore? Looking at china energy, cosco and ferrochina”.At09:34:06(2 minutes and 22 seconds) andat17:35:05(2 minutes and 34 seconds) on2 October 2007there were two telephone calls from the defendant to the Relationship Manager;At10:27:27(1 minute and 15 seconds) andat11:00:17(1 minute and 34 seconds) on3 October 2007there were two telephone calls from the Relationship Manager to the defendant.[Emphasis added in bold]36     It is the plaintiff’s case, and the Relationship Manager’s evidence, that the defendant instructed the Relationship Manager to purchase the Disputed CE Accumulators and one SembCorp Accumulator during the telephone conversations on 2 October 2007 (the 09:34:06 call) and 3 October 2007 (the 10:27:27 call).37     Under cross-examination, the defendant stated that whilst he did not remember the details of the telephone calls, the calls were not about purchasing the Disputed CE Accumulators. When questioned further on the purpose of his calling the Relationship Manager on 2 October 2007 at 09:34:06 (just six seconds after he received the SMS), the defendant claimed that he had called the Relationship Manager to enquire about the status of shares which he had previously purchased under earlier undisputed accumulators. He gave evidence under cross-examination that these shares would have been Neptune Orient Line (“NOL”) shares, Cosco shares and China Energy shares and that he had instructed the Relationship Manager to sell off the NOL shares and Cosco shares but to retain the China Energy shares. When asked to explain why he would call the Relationship Manager again on 3 October 2007 when he no longer had shares in his account, save for the China Energy shares which he had already instructed her to retain, he responded that he could not recall what was discussed during the 3 October 2007 conversation.38     In my view, it can be reasonably inferred that since the defendant called the Relationship Manager just six seconds after receiving her 2 October 2007 morning SMS, he was responding to the contents of her SMS, in which she had clearly asked him if she could purchase more accumulators in 3 named shares including China Energy. The defendant’s testimony under cross-examination does not negate this. He admitted making these calls and I did not accept his evidence that the calls had nothing to do with the Disputed CE Accumulators.39     The Relationship Manager, in her Affidavits in Evidence in Chief (“AEIC”) (at paras 40 – 42) describes the communications between herself and the defendant and the typical lead up to instructions to purchase an accumulator as follows (this process hereinafter described as the “AEIC Order Process Narrative”):Prior to establishing each of the twenty (20) Accumulators under the Defendant’s instructions, [the Relationship Manager], on behalf of the Plaintiffs, would:-provide the Defendant with certain information on the particular share counter, including some information and recommendations of the research analysts from various brokers and/or financial institutions;inform the Defendant of the maximum quantity of shares that the Defendant would be obliged to accumulate under that particular Accumulator; andinform the Defendant of the Maximum Obligation under that particular Accumulator.The Defendant would then communicate his instructions to the Plaintiffs in relation to the Accumulators, through [the Relationship Manager], either orally in telephone conversations (on [the Relationship Manager]’s mobile phone) or via a SMS....Accordingly, once the Defendant confirms with [the Relationship Manager] his instructions to establish the said Accumulator, the Plaintiffs would execute the Accumulator for and on his behalf. Thereafter, as a standard practice, the Plaintiffs would send term sheets, confirmation notes and monthly statements of accounts detailing the terms of the said Accumulator to the Defendant.40     The Relationship Manager’s AEIC Order Process Narrative (see[39]) provides a narrative of the nature of the running communications and conversations between her and the defendant over a period of time which would culminate in the defendant’s oral instructions to purchase an accumulator.41     The defendant’s counsel laid considerable store by his cross-examination of the Relationship Manager on what she had stated in her AEIC. The defendant’s counsel sought to demonstrate that her AEIC Order Process Narrative could not possibly gel with the content of the SMS and the short telephone conversations on 2 and 3 October 2007. By so doing, he sought to discredit the witness in order that her evidence be disbelieved.42     It was however evident during cross-examination that the defendant’s counsel and the Relationship Manager were often at cross-purposes. There was a lack of clarity and consistency of usage of the technical expressions. An illustration of the dissonance between the Relationship Manager’s AEIC Order Process Narrative and her answers under cross-examination, in relation to the content of the critical telephone conversations on 2 and 3 October 2007 is as follows:(a)     The Relationship Manager stated under cross-examination that the defendant had given her a range of spot or initial prices of between S$1.75 to S$1.82 which the China Energy Accumulator could be established. When the defendant’s counsel pointed out to the Relationship Manager that she had not mentioned that she had discussed any alleged range of spot price with the defendant in her AEIC, she could not explain the omission. She then asserted that the forward price was given at a range of between 89.25% and 91%.Q:Now where is that in your affidavit evidence, that he gave you a range of 1.75 to 1.82?A:Because, your Honour, this was what was communicated to me by [the defendant]. When I go out there to the PBA desk to place the orders, that is why when we hit the market, rather, or they communicate to the counterparty, and then that’s how they acquired the orders, accumulators back, because that he [sic] the way accumulators are structured it’s not possible for us – it’s not like a normal store that I can just say a price and we buy at that price.Q:But that has been your evidence so far, Ms Ng. That has been your evidence so far in this case, that you told him what the initial price was?A:Yes.Q:That you told him what the forward price was?A:Mm-hmm. …Q:You told him what the knockout price was?A:Yes, your Honour, that’s true.Q:And then on the basis of what you told him, he then said “Okay, I agree to do an accumulator at those prices”. But your evidence now is quite different. Your evidence now is that you didn’t tell him what the forward price was, you didn’t tell him what the initial price was, you didn’t tell him what the knockout price was. You told him a range. It says, “Can I establish accumulators for you within this range?”, and this is the first time we are hearing from you about this range?A:Your Honour, I disagree on that, because the thing is, [the defendant’s counsel] started asking me about the China Energy accumulators, right? So the thing is when we establish an accumulator throughout this period of time from July to October, okay, it’s always a series of conversations, a series of sms, a series of information. If you could refer to page 427 of my AEIC, what I communicated to [the defendant] was that the proposed spot price, okay, due to the last night’s rally, and the research analyst report – …… Because what happens is during the conversation, I told – after [the defendant] has said that, “Okay, the maximum obligation is 6 million, right?”, we discussed the proposed spot price, which is between 1.75 to 1.82. He knows that the proposed forward price is between 89.25 per cent to 91 per cent, and that would depend on the spot price that has been established. And the knockout is between 102, which is end of day knockout, or 103 intraday knockdown.Q:Let’s just stop there. How does he know that the forward price is between the 89.5 per cent and – what is the other percentage that you said?A:89.25 per cent and 91 per cent.Q:Yes. This is again the first time I’m hearing about that.A:Your Honour, I think for clarity’s sake, maybe this AEIC was written to – so that it’s clearer that we put the proposed – I mean the forward price there, rather than as a percentage, however, this proposed forward price is the structure of the accumulator.43     The Relationship Manager appeared to be conflating two quite separate processes. One was the typical flow of communications and conversations between the defendant and her which would culminate in an oral instruction to purchase a particular accumulator which she described in her AEIC Order Process Narrative. The other was the precise contents of the short morning telephone conversations with the defendant the 2 and 3 October 2007. As a result of conflating the two, she often tripped up under cross-examination in explaining how she could have managed to provide all the detailed information she purports to have provided as described in her AEIC Order Process Narrative, in the course of the short telephone conversations, quite apart from the additional matter of ranges which she also said under cross-examination that she provided.44     The defendant had sight of the transcripts of recordings of the backroom conversations between the Relationship Manager and the plaintiff’s PBA and their conversations with the accumulator counterparty. In relation to those, he made the following closing submissions in support of his case that he did not instruct the Relationship Manager to purchase the Disputed CE Accumulators during the telephone calls on 2 and 3 October 2007:(a)He first challenged her evidence that she only places the defendant’s orders after she has received his orders. On 2 October 2007, there were four accumulators done for the defendant. These could not have been done for the defendant as if the first telephone conversation took place at 09:34 the transcripts of conversations between the Relationship Manager and the plaintiff’s PBA indicate that orders for the Disputed Third to Fifth CE Accumulators with the counterparty took place even before the 09:34 conversation with the defendant.(b)He pointed out that the Relationship Manager had given evidence that she was instructed to purchase S$6m CE Accumulators in the Disputed Fourth and Fifth CE Accumulators but had placed an order with the PBA at 10:32 for just S$1m and only later at 11:44 did she place an order for S$6.74m. He submitted that this could lead to the inference that the defendant in fact did not give her any instructions to purchase the Disputed CE Accumulators.(c)With regard to the Disputed Sixth CE Accumulator, the defendant had allegedly given the Relationship Manager a range to buy between S$1.75 and S$1.82. However, the shares had been bought at S$1.74 which was outside, albeit lower than the range.(d)With regard to the Disputed Seventh CE Accumulator, the Relationship Manager averred that the defendant gave her the range of maximum obligation S$4–5m during the 10:27 telephone call on 3 October 2007. However, she had mistakenly placed an order for S$4.5m (without including the doubling effect of what would constitute the maximum obligation). He submitted that having exceeded her authorised range of maximum obligation, she proceeded to dump the excess accumulators on him.45     The plaintiff responded as follows:(a)It was the Relationship Manager’s evidence that her orders are consolidated with orders of her other clients. As a result, the orders placed by the plaintiff with the counterparties do not match with any one client’s orders or even the timing of such orders.(b)The Relationship Manager consolidates, executes and only allocates her confirmed transactions at the end of each day to each of her clients, including the defendant.(c)The Relationship Manager had in her evidence answered that she did not exceed the price range instructed by the defendant because it is the practice to take the average of the prices of the total number of Disputed CE Accumulators purchased. When the prices of the four Disputed CE Accumulators are averaged:i.e. S$1.79, S$1.81, S$1.79 and S$1.74, the average was S$1.789 which is within the range of S$1.75 to S$1.82.(d)It is industry practice not to include the possible doubling effect when the bank places orders with counterparties. The Relationship Manager had admitted that there had been a mistake relating to the Disputed Seventh CE Accumulator in her having purchased an excess. It is her evidence however that she had other client’s orders which she filled with this excess. It was also the evidence of the plaintiff’s general manager that mistakes in orders can be reversed at the end of the day. In the light of this there was no reason for the Relationship Manager to dump the Disputed Seventh CE Accumulator on the defendant as these could have been unwound.46     The defendant, who is external to these processes, has postulated that there does not appear to be a direct match between each of the defendant’s alleged accumulator orders and the orders executed by the bank backroom. This, he submits, further corroborates his defence that he did not make these purchases. However I accepted the plaintiff’s explanations for three reasons. First, the plaintiff’s explanation is consistent with the transcript of the recordings of the backroom execution – that there was consolidation of orders. Second, the backroom execution process is the plaintiff’s own. It is accordingly in the best position to explain how its own process works including the consolidation of other client orders. Finally, the mismatch between the defendant’s alleged order and the orders placed by the Relationship Manager with PBA is answered by her explanation of her consolidating the defendant’s orders with the orders of her other customers. The defendant’s observation of exceeding his price range was made in abstract without taking into account the market practice of execution averaging described by the plaintiff. I am accordingly, unable to accept the defendant’s submission that the transcripts support the defendant’s case that he did not instruct the Relationship Manager to purchase the Disputed CE Accumulators during the telephone calls on 2 and 3 October 2007.47     In considering the evidence relating to the content of the critical telephone calls on 2 and 3 October 2007, what I find most significant is the defendant’s inability to explain satisfactorily his version of the contents of the telephone conversation, as he disputes that they were about instructions to purchase the Disputed CE Accumulators (see[37]above).48     The only two participants to these two telephone calls were the defendant and the Relationship Manager. Evaluating their evidence, I find the Relationship Manager’s evidence on her understanding of the product terms and her order taking process to have gaps, and thus unhelpful. Notwithstanding this shortcoming, I find her evidence that the defendant instructed her to purchase the Disputed CE Accumulators during the telephone calls on 2 and 3 October 2007 to be credible. This is supported by her having initiated the SMS query which led to the defendant’s almost immediate telephone call in response. By contrast I do not find the defendant’s evidence on the content of the telephone calls to be credible. He appeared to me to be evasive and when challenged under cross-examination he was obliged to fall back on the response that he could not recall.(b)   The defendant’s experience with accumulators and his earlier purchases of China Energy shares and undisputed CE Accumulators49     I next test the consistency of my findings and inferences of fact against the defendant’s prior experience with accumulators and his purchases of undisputed CE Accumulators and retention of China Energy shares.50     The defendant had between July 2007 and September 2007 purchased through the Relationship Manager, fourteen accumulators involving Cosco, DBS, Noble and China Energy shares. Starting with USD328,263.00 in his account in July 2007, the defendant’s account recorded USD393,521.00 by the end of September 2007. Over two months, the defendant realised a profit of USD65,258.00 (about a 20% return) from accumulators.51     Closer to the date of the Disputed CE Accumulators, on 26 September 2007, the Relationship Manager informed the defendant that he had realised a profit of S$37,000 when the DBS shares acquired under three DBS Accumulators (approximately S $5.7m Maximum Obligation) were sold and that he could make an additional profit of S$17,000 if the defendant chose to sell the Cosco shares acquired that day under a Cosco Accumulator with a maximum obligation of approximately S$2.35m.52     It was the defendant’s evidence that on or around 2 October 2007, he had requested the Relationship Manager to sell his Cosco shares but to keep the China Energy shares previously acquired under the undisputed First and Second China Energy Accumulators, even though he would have realised an immediate profit had he then sold them. Under cross-examination, the defendant could not explain why he chose to keep the China Energy shares, stating initially that he forgot why he did so, and then finally conceding that it could be because he had thought the prices of the China Energy shares would go up further.Q:You do recall that, in your affidavit, you told [the Relationship Manager] to sell the Cosco but to keep the China Energy shares accumulated so far; which means the China Energy shares accumulated under the first and second China Energy accumulator; correct?A:Correct.Q:My question to you – and I asked you this a few times – was what made you decide to keep the China Energy shares? I asked a few questions on that. I also told you that you had sub-prime concerns, which is why you wanted to stop doing accumulators. My questions to you then were, why did you want to keep a share counter you knew nothing about, since, in your view, the sub-prime would affect the Singapore stock market. Then I asked you questions as to what would make you keep a share, even when there is a storm brewing. You said you spoke to [the Relationship Manager] and if the share would still go up in the long term, even though it was going to go down in the short term, you would keep the share; correct?A:Yes.53     The defendant’s prior profitable experience with accumulators and his retention of the China Energy shares are consistent with my findings and inferences of fact that he had instructed the Relationship Manager to purchase the Disputed CE Accumulators during the telephone calls on 2 and 3 October 2007. His preceding profitable experience with accumulators and his recent retention of China Energy shares explain his likely purchase of the Disputed CE Accumulators and his ambiguous behaviour in not promptly and unequivocally rejecting them.(c)   The conduct of the plaintiff and the defendant after the purchase of the Disputed CE Accumulators54     Having considered the witnesses’ evidence relating to the content of the telephone calls on 2 and 3 October 2007, the defendant’s experience with accumulators and his earlier purchases of CE share and undisputed CE Accumulators, I now turn to examine the evidence relating to the conduct of the plaintiff and the defendant after the purchase of the Disputed CE Accumulators for consistency with my findings and inferences of fact.(i)   The plaintiff despatched the Disputed CE Accumulators term sheets, China Energy share confirmation notes and monthly statements to the defendant and requested further security55     The plaintiff despatched Disputed CE Accumulators term sheets, China Energy share confirmation notes and monthly statements to the defendant and the defendant does not dispute that he had received them in the ordinary course.56     The plaintiff also sent to the defendant his October 2007 monthly statement of account, whichinter alia, stated:The bank must be notified in writing within thirty (30) days of the statement date of any errors or omissions in the statement or the related contract notes. In the absence of such notification, the client is deemed to have agreed to the balances and details of the account.57     Notwithstanding this, the defendant did not promptly contact or query the plaintiff about either the Disputed CE Accumulators term sheets or the China Energy shares acquired thereunder. Neither did he contact the plaintiff nor make queries about his October 2007 monthly statement of account. He also did not return these documents to the plaintiff. All that he claimed he did was raise an objection to the Relationship Manager on 16 October 2007 and that he had given her one month to resolve the matter.58     According to the Relationship Manager, from 16 October 2007 to around 13 November 2007, she made repeated requests to the defendant to bring in the additional funds required to acquire the China Energy shares which he was obliged to acquire under the Disputed CE Accumulators. This included requests by the plaintiff to the defendant to provide more security, by taking steps such as mortgaging his house or transferring more funds from his trading account in another financial institution.(ii)   The defendant was silent for a considerable period after being informed59     The evidence adduced reveals that save for a telephone conversation on 18 October 2007, there were no communications between the defendant and the Relationship Manager until 5 November 2007. The defendant did not contact the Relationship Manager for any status update. On 2 November 2007, which was the scheduled settlement date for the China Energy shares acquired under three of the Disputed CE Accumulators, the Relationship Manager called the defendant twice but the defendant did not answer her calls. On 5 November 2007, the Relationship Manager called the defendant three times. The defendant once again did not answer her calls. The defendant returned the Relationship Manager’s telephone calls on the afternoon of 5 November 2007. It was a call which lasted for 27 minutes.60     Were the defendant to have given the Relationship Manager one month from 18 October 2007 to resolve the issue of the Disputed CE Accumulators, it might be expected that he would have called her or responded to her repeated telephone calls of 2 and 5 November 2007. He does not appear to have done so.(iii)   The defendant paid S$160,000 by cheque to the plaintiff and his previously acquired China Energy shares were sold to pay for China Energy shares to be acquired under the Disputed CE Accumulators61     It is not disputed that two separate payments were subsequently made in connection with the Disputed CE Accumulators from funds provided by the defendant and from the proceeds of liquidation of his previously acquired China Energy shares.62     On 7 November 2007 the defendant issued a cheque for S$160,000 to the plaintiff. The cheque was used to pay for the China Energy shares acquired under the Disputed CE Accumulators.63     The defendant’s explanation of this payment is that he had issued this cheque as the Relationship Manager had told him that the money was for the payment of shares acquired under the undisputed First and Second CE Accumulators and under the SembCorp Accumulator. Consequently, this cheque was not payment for the Disputed CE Accumulators. It is difficult to accept the defendant’s explanation for the following reasons: first, the shares acquired under the First and Second CE Accumulators had already been paid for on or around 2 October 2007 and would have been reflected in the statements received by the time he issued this cheque. Second, as he had given the Relationship Manager one month from 18 October 2007 to resolve the matter and it had yet to be resolved, it is difficult to understand why he would nevertheless on 7 November 2007 deliver a S$160,000.00 cheque to her without reserving his rights or position.64     On 16 November 2007 the plaintiff sold 180,000 China Energy shares. It claims it did so under the defendant’s instructions. 60,000 of the 180,000 China Energy shares were acquired by the defendant under the undisputed First and Second China Energy Accumulators and the remaining 120,000 shares were acquired by the defendant under the Disputed CE Accumulators. The sale proceeds were then used to pay for the new China Energy shares acquired under the Disputed CE Accumulators.65     The defendant avers that he did not know that the proceeds of sale of his previously acquired China Energy shares were to be used for the payment of new China Energy shares acquired under the Disputed CE Accumulators. He avers that the plaintiff had unilaterally applied the sale proceeds to these new China Energy shares acquired under the Disputed CE Accumulators. By this averment he attests only that he did not know how the plaintiff applied these sale proceeds. However, confirmation notes reflecting the sale of the China Energy shares (including those under the Disputed CE Accumulators) were sent to and received by the defendant. He did not raise any query at the time.66     In these circumstances, I am of the view that contrary to the defendant’s averment, he knew that he was making payment or he acquiesced with knowledge in the sale of the abovementioned China Energy shares. He would not have made the cheque payment had the Disputed CE Accumulators, in the first place, not been purchased under his instructions. Neither would he have made the cheque payment without reserving his position had he been waiting for the resolution of the Disputed CE Accumulators.(iv)   The plaintiff had senior management meetings with the defendant on 20 and 28 November 200767     On 20 November 2007, the defendant met with the plaintiff’s Mr Paul Kwek (“Mr Kwek”) and the Relationship Manager. The note of the meeting prepared by Mr Kwek, records,inter alia:1.    Mr Teo expressed surprise at the size of his exposure. He made remarks like he is not well versed with equity accumulator, he was only into blue chips, he was not fully apprised of the risks involved, the sizes of the contract are very high relative to his networth and risk appetite,etc. When I pressed as to whether he is denying the contracts, he said no but that the bank has to take some responsibility for them.2.    I told him that if the contracts are valid, then we have to address the near term issue of funds to pick up the shares as and when they get ‘striked’ in the weeks ahead. The other issue is margin for the remaining tenor of the contracts. Mr Teo did not want to commit himself on these matters. He wants to meet up with GM of the branch so that all his concerns can be addressed. We told him that we will schedule a meeting next week when the GM is back from Paris.3.    He questioned our margin requirementsvis-à-visthe contracts done. Sue said that she had all along been asking him to bring in additional funds but he has not responded.68     Under cross-examination by the defendant’s counsel, Mr Kwek stated that at the meeting on 20 November 2007, he specifically asked the defendant whether the latter was denying liability for the Disputed CE Accumulators and the defendant had replied “no”.69     However, according to the defendant, Mr Kwek’s contemporaneous note of their meeting on 20 November 2007 is not an accurate reflection of what transpired at the meeting. Under cross-examination, the defendant challenged Mr Kwek’s evidence as follows:(i)He expressed surprise at the deals that were being done on his accounts with that kind of exposure, and not merely at the size of the exposure;(ii)He had informed Mr Kwek that the Disputed CE Accumulators were not authorised;(iii)Mr Kwek did not inform him about the need to bring in funds to pick up the shares acquired under the Disputed CE Accumulators; and(iv)He did not ask on the margin requirements for the contracts as he did not understand what a margin was.70     However, when the plaintiff’s counsel showed the defendant that the contents of his own emails of 21 November 2007 and 23 November 2007 were similar to Mr Kwek’s contemporaneous note of 20 November 2007, the defendant changed his evidence. The defendant admitted that the issue of funds to acquire the China Energy shares was addressed at the meeting but that he had told Mr Kwek that he did not want to acquire the shares. The defendant further admitted that it was possible that parties had spoken on the margin requirements for the Disputed CE Accumulators:Court:To clarify for your benefit, on page 90, paragraph numbered 2, plaintiff's counsel has taken you line by line through this email.A:Sorry, your Honour, the --Court:Page 90.A:Of the plaintiff's core bundle of documents?Court:Yes, the core bundle. He had taken you line by line through that email and asked you which lines you would agree reflected your conversation with Paul Kwek on 30 (sic) November, and which you did not. In the paragraph numbered 2, he took you through two sentences. The first one: \"If the contracts are valid, then we have to address the near term issue of funds to pick up the shares as and when they get 'striked' in the weeks ahead.\"A:Yes, your Honour.Court:Yes. So, your email three days later, 23 November, page 176, in the second last paragraph you state: \"I will not be interested even if the shares gets knocked out next week.\" And the last line: \"... I am also not prepared to pick up the next batch of shares that you mentioned earlier that is due next week.\"A:Yes, your Honour.Court:In the light of these two things, would you want to restate your position on the second paragraph of Paul Kwek's internal email to the bank?A:Yes, I think I will accept that, your Honour.Q:So you will accept that Mr Kwek then said that you have to address the near term issue of funds to pick up the shares, correct? He raised that to you?A:Yes, I accept that.Q:In fact, I understand that Mr Kwek told you what has to be done in relation to the picking up of the shares, right? He explained that to you.A:Say that again?Q:He explained to you what you needed to do to be able to pick up the next batch of shares that were due under the accumulators.A:Yes, he -- I think he is asking me to -- better think of how to raise money to pick up the shares, yeah.Q:To pick up the shares. He told you that, right? And so his paragraph 2, first sentence is correct. How about the second sentence now, because earlier you also said that was incorrect. I will give you another chance. He also raised: \"The other issue is margin for the remaining tenure of the contracts.” Do you want to think about this again and see whether he may have raised the issue of margin for the remaining tenure of the contracts?A:I, quite frankly --Q:Can't remember?A:-- I can't remember because the margin is something that I'm not -- I'm not familiar with.Q:But it is possible that he raised an issue with you on the margin for the remainder tenure of the contracts? \"Contracts\" meaning the unauthorised transactions. Correct? Right?A:It's possible.Q:It's possible, right. So you have confirmed that he spoke to you about the near term issue of funds, to pick up shares due under the unauthorised transactions; and he may have possibly spoken to you about the margin for the remaining tenure of the contracts. Correct? That's your evidence now.A:Correct.71     Critically, when I questioned the defendant regarding whether Mr Kwek had asked him whether he was denying the Disputed CE Accumulators, the defendant changed his mind and claimed that he could not recall whether this statement was made by him at the meeting on 20 November 2009. This contradicted the defendant’s earlier position in the affidavits he filed in these proceedings where he clearly denied that the statement was made at the 20 November 2007 meeting.Court:With the benefit of having looked over your transcript, as well as this, you are looking literally at paragraph 1, the last sentence. It was your evidence yesterday that Mr Paul Kwek did not press you as to whether you were denying and you said \"no\". Are you basically saying now that you could not recall whether that statement was made at that meeting?A:Yes, I couldn't recall.Q:Now, for that also you say you cannot recall: you are now confirming that?A:I can't recall, yes.72     The defendant’s evidence about the meeting on 20 November 2007 is contradictory. The defendant’s own emails of 21 November 2007 and 23 November 2007 support the plaintiff’s version of the events which took place at the meeting on 20 November 2007. Under cross-examination, the defendant suggested that Mr Kwek may have lied in his contemporaneous note of the meeting of 20 November 2007, in order to cover up for his employee. The bare assertion was not supported by any evidence.73     On 28 November 2007, the defendant attended a second meeting, this time with the plaintiff’s General Manager, Mr Jean Luc Anglada (“Mr Anglada”) and Mr Kwek. It is their evidence that the defendant also did not, at this meeting, deny that he gave instructions to the Relationship Manager to purchase the Disputed CE Accumulators. The defendant disputes this but in light of the evidence adduced, I accepted their account. There was no evidence to establish that Mr Anglada would, in addition to Mr Kwek, cover up for the Relationship Manager.The defendant’s equivocation in rejecting Disputed CE Accumulators74     On 5 December 2007, the defendant requested the plaintiff to provide him with the estimated costs of closing out the Disputed CE Accumulators. The plaintiff thereafter also provided the defendant with a summary of his accumulators in January 2008. They also made arrangements for the defendant to attend an analysts lunch meeting scheduled in February 2008 by the China Energy management.75     Given the defendant’s experience with accumulators, the question does arise as to what accounts for his equivocal conduct between 16 October and 5 December 2007 which marks the time between when he claims he first discovered the Disputed CE Accumulators and the time he requested information about closing out costs. If he were rejecting the Disputed CE Accumulators, what could account for his inaction - his payment of S$160,000 and his instructions, or knowing acquiescence in the sale of his previously acquired China Energy shares to pay for new China Energy shares under the Disputed CE Accumulators? Why did he not vigorously and unequivocally reject the Disputed CE Accumulators prior to or when he first met the plaintiff’s senior management on two separate occasions in November 2007?76     It was Mr Anglada’s evidence that the defendant could have, if he wished, mitigated his loss in the declining China Energy market price by selling off his acquired shares promptly and terminating the accumulator by paying the closing out costs. There are only two choices when the market price of the relevant share dives and continues a sustained dive below the forward price of the accumulator. Where the purchaser remains bullish about the underlying share, he may decide to retain the acquired shares, and continue to double up the shares he becomes obliged to acquire. Should the market price of the underlying share thereafter recover beyond the forward price, he can then sell his doubled share acquisitions at a profit. Alternatively, the purchaser can cut loss by selling all the shares acquired previously and promptly terminating the accumulator by paying the closing out costs. I accepted his evidence.77     In the light of Mr Anglada’s evidence as to the two available risk decisions, how is the defendant’s equivocation in the face of a declining China Energy share price consistent with my finding and decision? There were produced in evidence, some market analysts’ recommendations between October and December 2007 which projected a target price of the China Energy shares which was significantly higher than the Disputed China Energy Accumulators Knock-Out price. There was also evidence of the defendant’s prior decision with another earlier accumulator, the Second Noble Accumulator. The market price of Noble shares had fallen below the Second Noble Accumulator Forward Price for a number of days during which the defendant was obliged to double up his share acquisitions. However, thereafter the market price of Noble shares recovered and the Second Noble Accumulator was knocked-out some two months after it was established. The defendant had made a significantly larger profit when he later sold the Noble shares, including the doubled acquisitions during the Noble market share price downturn. If the defendant remained bullish about China Energy shares notwithstanding its share price decline in October 2007, this would explain his equivocation in neither clearly rejecting the Disputed CE Accumulators nor terminating them.78     What the defendant faced was the immediate pressure of the plaintiff’s margin calls and requests for additional security. The defendant’s equivocation as to the Disputed CE Accumulators during this period is consistent with a bullish expectation of recovery of the market price of China Energy shares. By his equivocation he was able to defer having to provide additional margin and security as pressed for by the bank. It was only by the time of the meeting of 5 December 2007 with the plaintiff’s senior managers that he appears to have ceased to be bullish about China Energy shares. He only then asked for an estimate of the closing out costs.79     He appears thereafter to have taken no further actions. Sometime in or around March 2008, the market price of the China Energy shares declined sharply. By way of a letter dated 14 March 2008, the plaintiff’s solicitors demanded that the defendant make payment to the plaintiff of the outstanding sum of S$4,125,745.00 which was due and owing to the plaintiff as of 6 March 2008 pursuant to the terms of the Disputed CE Accumulators.80     As the defendant had not made any payment, the plaintiff exercised its rights under the contractual documents and closed out the Disputed CE Accumulators from 10 April to 21 April 2008 and set-off the funds in the defendant’s account towards payment of the outstanding sum due under the Disputed CE Accumulators.81     On or around 27 May 2009, the plaintiff issued a conclusive certificate of indebtedness (see[22]above) certifying that the outstanding sum (including interest) due and owing from the defendant to the plaintiff as of 29 August 2008 was S$6,459,519.83. This sum consisted of:(a)S$2,782,803.66 for the China Energy shares delivered pursuant to the terms of the Disputed CE accumulators and which was paid by the Plaintiffs to the counterparties;(b)S$3,625,393.11 which the plaintiff paid to the counterparties to close-out the Third to Seventh China Energy Accumulators; and(c)interest of S$51,323.06 as of 29 August 2008.The plaintiff then brought the present action claiming these amounts against the defendant (see above at[3]).Conclusion82     In the light of the evidence and my findings, and in the totality of the prior and subsequent consistent conduct of the parties in relation to the Disputed CE Accumulators, I find that the defendant did instruct the Relationship Manager to purchase the Disputed CE Accumulators during the telephone conversations on 2 and 3 October 2007. It is not necessary to further deal with the plaintiff’s alternative submissions as to estoppel.83     I now return to the core question of law about private banking and sophisticated clients raised in[2]in the light of the relevant contractual documents and the evidence adduced in this dispute:When is a private bank acting as a trusted advisor of its client and when is it not?84     A private bank is not acting as a trusted advisor of its client when (a) its account opening form and Risk Disclosure Statement highlight to the client that he is responsible for the risks in his transactions and recommends that he takes advice from other professional advisers, including his accountants, lawyers and tax advisors, and further that the bank does not make recommendations or give advice and (b) this is borne out by the evidence of conduct.85     Judgment for the plaintiff. Costs are to be taxed or agreed.",
        "(b)   Banking Facility Letter": "21     The purpose and function of the Banking Facility Letter is to provide leverage for the defendant, subject to the terms and up to the limits set out therein. Under this Banking Facility Letter, the plaintiff confirms granting to the defendant pursuant to his request, a loan facility of up to USD 5m, an amount of up to USD 5m to facilitate his entering Treasury Contracts and an amount up to USD 5m to facilitate his entering margin trading transaction against his entering a Charge Agreement. 22     The Banking Facility Letter sets out the interest rates, the margin requirements for treasury contracts and its availability subject to the plaintiff receiving a duly executed charge agreement and such further security as it may require from time to time. Whilst the plaintiff does not charge a fee for providing the facility and actual utilisation depends on suitable investment opportunities, the plaintiff anticipates that the defendant will make reasonable use of the facility. Clause 1 reads: For the avoidance of doubt, any certificate issued to you by the Bank and signed by an officer of the Bank certifying the amount(s) which are overdue hereunder shall, in the absence of manifest error, be conclusive evidence for all purposes as to the amount due and owing to the Bank by you and shall be binding on you.",
        "(c)   Charge Agreement": "23     The Charge Agreement provides the plaintiff with a first fixed charge and lien against the defendant’s deposits and investment portfolio as a continuing security for the due and punctual payment of all moneys owed to the bank.",
        "Summary of economic substance of contractual documents": "24     The economic substance of the above contractual documents can be distilled as follows: The client places some deposits with the bank. The bank provides interest bearing loans to enable him to leverage his investments. The client provides a charge over all deposits and investments with the bank. The client makes his investment decisions, within these financial risk limits and his own risk appetite. The bank executes his investment decisions either as principal or as agent. The bank’s economic interests arise from interest on the facilities, but principally from the receipts of agency fees or principal gains, arising from the volume of his leveraged investment decisions within the financial risk limits.",
        "The contractual terms of the Disputed CE Accumulators": "25     In addition to the overarching contractual documents above, it is necessary to examine the particular terms of the investment product. Such examination also helps to clarify the interplay between the evidence adduced within this context. 26     Turning first then to the nature of accumulators in general, it ought to be pointed out that the accumulators are not standard exchange-traded products; they are customised over-the-counter products. Exchange traded derivatives are products like options and futures which are traded on an exchange. Over-the-counter products, like accumulators, are derivatives which are not traded on an exchange. The terms of each accumulator are set out in its particular term sheet. The form and content of each accumulator, however, follows a standard industry format. Each accumulator confirmation or term sheet is expressed to incorporate by reference and to be construed by theInternational Swaps and Derivatives Association Master Agreementand the2002 International Swaps and Derivatives Association Equity Derivative Definitions. 27     The following is an extract of the principal terms of one of the term sheets of the Disputed CE Accumulators and is typical of the terms of the other Disputed CE Accumulators as well: Accumulator on China Energy Ltd Counterparty: CIC-Client Trade Date: 1st October 2007 Effective Date: 2nd October 2007 Observation Period End Date: 30 September 2008, subject to early termination due to a Knock-out Event, Market Disruption event or certain Extraordinary Events. Initial Price: SGD 1.6701 Forward Price: SGD 1.5198 (91% of Initial Price) Share Accumulation per day: 1,500 shares if Closing Price >= Strike Price 3,000 shares if Closing Price < Strike Price Settlement Scenario: Subject to no Knock-Out Event occurring in an Observation Period, the following will take place on the Settlement Date following that Observation Period: Settlement Scenario: Subject to no Knock-Out Event occurring in an Observation Period, the following will take place on the Settlement Date following that Observation Period: (1)CIC will deliver to the Counterparty the number of Shares calculated as follows: Share Accumulation per Day * Number of Scheduled Trading Days in the Observation Period (2)Counterparty will pay CIC a SGD amount calculated as follows and rounded to the nearest cent: Forward Price * Share Accumulation per Day * number of Scheduled Trading Days in the Observation Period Clearance System: Central Depository (Pte) Ltd. Knock–out Price: SGD 1.7202 (103% of Initial Spot Price) Knock-out Event: A Knock-out Event occurs when the traded price per Share quoted by the Exchange is, at any time on any Exchange Business Day from the first Observation Period Start Date to the Valuation Time on the Valuation Date (both inclusive).AT OR ABOVEthe Knock-Out Price. Settlement Scenario on Knock-Out Settlement Date: A.If the Knock-out Occurrence Date is on or before the end of First Observation Period, on the Knock-out Settlement Date: (1)CIC will deliver to Counterparty the number of Shares calculated as follows: Share Accumulation per Day * 20 (2)Counterparty will pay CIC a SGD amount calculated as follows and rounded to the nearest cent. Forward Price * Share Accumulation per Day * 20 Where for the purposes of (A) above, Share Accumulation per Day for shall be deemed to be 1500 shares for all days falling on or after the Knock-Out Occurrence Date. B.If the Knock-out Occurrence Date is after the end of the First Observation Period, on the Knock-out Settlement Date: (1)CIC will deliver to Counterparty the number of Shares calculated as follows: Share Accumulation per Day * Number of Accumulation Days from and including the first day of the relevant Accumulation Period to and excluding the Knock-Out Date (2)Counterparty will pay CIC a SGD amount calculated as follows and rounded to the nearest cent: Forward Price * Share Accumulation per Day * Number of Accumulation Days from and including the first day of the relevant Accumulation Period to and excluding the Knock-Out Date. For avoidance of doubt, the Observation Period with respect to this Knock-out settlement will begin on the Observation Period Start Date as stated in the table above and end on the Scheduled Trading Day immediately before the Knock-out Occurrence Date (both dates inclusive). DISCLAIMER 1.This product is not suitable for all investors and involves a variety of risks. Please note that we are willing to negotiate this transaction with you because a) you have sufficient knowledge, experience and professional advice to make your own evaluation of the merits and risks of making an investment of this type and b) you are not relying on Credit Industriel et Commercial, Singapore Branch (“CIC”) or any affiliate of CIC for information, advice or recommendation of any sort except the factual terms of the transaction. 2.This Termsheet does not identify all the risks (direct or indirect) or other consideration which might be material to you when entering into this transaction. You should consult your own legal, regulatory, tax, business, investment, financial and accounting advisers to the extent that you deem it necessary and make your own investment, hedging and trading decision (including decisions regarding the suitability of this investment) based on your own judgment an the advice from your advisers. 3.This Termsheet supersedes and replaces any other correspondence or confirmation if any, relating to this product on or prior to the date hereof. 4.This Termsheet shall be read in conjunction with the Risk Disclosure Statement you have signed together with the Account Opening and Custodian Agreement. 5.By having given instructions to purchase the product, you are deemed to have understood and agreed to the terms, conditions and risks set in this Termsheet.",
        "Summary of economic substance of an accumulator contract": "28     In short, pursuant to the abovementioned term sheet, the defendant contracted to purchase 1,500 China Energy shares per week at a price of S$1.5981(“Forward Price”) representing a discount of 9% to the current share market price then of S$1.6701 (“Initial Price”). In exchange for this discount, he contracted to purchase 1,500 China Energy shares per week for about 52 weeks. During these 52 weeks, he contracted to double his weekly purchases, when the market price of the share fell below the Forward Price. However, during these 52 weeks, in the event that the market price of the shares were to rise beyond S$1.7202 (103% of the Initial Price), the accumulator was automatically knocked-out. An accumulator upon knock-out automatically releases both the defendant from any further obligation to buy, and the plaintiff from any further obligation to sell, any China Energy shares for the rest of the 52 weeks. The settlement process involves the purchaser making weekly payments for shares delivered during the term of the accumulator and the seller being obliged to deliver either the shares or the cash equivalent.",
        "The defendant’s averments": "29     Turning now to the dispute between the parties, I shall at the outset deal with the defendant’s additional averments in[5]which can be disposed of briefly. 30     The defendant first averred that his instructions to the Relationship Manager was to ensure his “total exposure” to equity accumulators at any one time should not exceed S$1m and was to be confined to “blue chip” shares. However, the defendant provided no substantiating evidence as to his instructions. Second, he did not define what he meant by “total exposure”. He did make several allusions to the “maximum obligation” under the Disputed CE Accumulators being beyond S$1m. However, it was clarified in court by the plaintiff’s witnesses that “maximum obligation” means the purchaser’s obligation to purchase double the number of shares, in the worst case scenario, where the market price of the share drops and remains below the forward price, for the entire duration of the accumulator. This is quite different from “total exposure” which is the estimated normal risk at any one time. In any event, the defendant had on record purchased accumulators whose maximum obligation far exceeded S$1 million. As for “blue chip” shares, these remained undefined in the evidence and his previous accumulator purchases included a wider range of shares than might commonly be regarded as “blue chip”. 31     His second averment is that he was never told, prior to 19 November 2007, that he would be obliged to acquire double the number of shares in each of the Disputed CE Accumulators for the duration when the market price of the shares fell below the Forward Price. However, the term sheets of the relevant Disputed CE Accumulators expressly set out that where the closing price of the shares exceeds the strike price, the number of shares to be accumulated per day doubles. Thisex facieputs paid to this averment. 32     His third averment is that he was never told that if he were to terminate the Disputed CE Accumulators prior to their expiry, he would have to pay additional closing out costs. However, should he have required further information or clarification about terminating the accumulators, he could have so requested either from the plaintiff or from his external advisers. The plaintiff was under no contractual obligation to ensure that the defendant understood the full import and implications of all the terms of the accumulators. There was nothing to prevent him from requesting information or clarification which he, by his evidence never did until 5 December 2007. Indeed the term sheet of the Disputed CE Accumulators set out the relevant disclaimers relating to the defendant’s need to make his own risk assessments (see[27]above). 33     The defendant’s other averment is that of his surprise at the magnitude of the realised losses and his expectation that his losses, if any, could not exceed the amount of his deposits with the plaintiff. However, considering that he had signed and accepted banking facilities for up to USD 15m, which was several times the amount of his deposits, this has little merit.",
        "Evidence and inferences of fact": "34     Having dealt with the above, the pivotal question of fact in this action is whether the defendant had instructed the Relationship Manager during the telephone calls between them on 2 and 3 October 2007, to purchase the Disputed CE Accumulators. If the defendant did instruct the Relationship Manager to purchase the Disputed CE Accumulators, then he must consequently be liable for the price of the China Energy shares delivered pursuant to the terms of the Disputed CE Accumulators and the closing out costs, in the absence of any other viable contractual defences, none of which were raised. I will evaluate the evidence before me and set out my inferences of fact in the following order of evidence that was adduced: (a)Witness testimony relating to content of telephone calls on 2 and 3 October 2007;(b)The defendant’s experience with accumulators and his earlier purchases of China Energy shares and undisputed CE Accumulators; and(c)The conduct of the plaintiff and the defendant after the purchase of the Disputed CE Accumulators:(i)The plaintiff despatched the Disputed CE Accumulators term sheets, China Energy share confirmation notes and monthly statements to the defendant and requested further security;(ii)The defendant was silent for a considerable period after being informed;(iii)The defendant paid S$160,000 by cheque to the plaintiff and his previously acquired China Energy shares were sold to pay for China Energy shares to be acquired under the Disputed CE Accumulators; and(iv)The plaintiff had senior management meetings with the defendant on 20 and 28 November 2007.(a)   Witness testimony relating to content of telephone calls on 2 and 3 October 200735     The undisputed evidence regarding the telephone calls is as follows:At09:34 on 2 October 2007,the Relationship Manager sent a text message (“SMS”) to the defendant which read:“Ok, last night us very gd. Rally shld continue. Can I do somemore? Looking at china energy, cosco and ferrochina”.At09:34:06(2 minutes and 22 seconds) andat17:35:05(2 minutes and 34 seconds) on2 October 2007there were two telephone calls from the defendant to the Relationship Manager;At10:27:27(1 minute and 15 seconds) andat11:00:17(1 minute and 34 seconds) on3 October 2007there were two telephone calls from the Relationship Manager to the defendant.[Emphasis added in bold]36     It is the plaintiff’s case, and the Relationship Manager’s evidence, that the defendant instructed the Relationship Manager to purchase the Disputed CE Accumulators and one SembCorp Accumulator during the telephone conversations on 2 October 2007 (the 09:34:06 call) and 3 October 2007 (the 10:27:27 call).37     Under cross-examination, the defendant stated that whilst he did not remember the details of the telephone calls, the calls were not about purchasing the Disputed CE Accumulators. When questioned further on the purpose of his calling the Relationship Manager on 2 October 2007 at 09:34:06 (just six seconds after he received the SMS), the defendant claimed that he had called the Relationship Manager to enquire about the status of shares which he had previously purchased under earlier undisputed accumulators. He gave evidence under cross-examination that these shares would have been Neptune Orient Line (“NOL”) shares, Cosco shares and China Energy shares and that he had instructed the Relationship Manager to sell off the NOL shares and Cosco shares but to retain the China Energy shares. When asked to explain why he would call the Relationship Manager again on 3 October 2007 when he no longer had shares in his account, save for the China Energy shares which he had already instructed her to retain, he responded that he could not recall what was discussed during the 3 October 2007 conversation.38     In my view, it can be reasonably inferred that since the defendant called the Relationship Manager just six seconds after receiving her 2 October 2007 morning SMS, he was responding to the contents of her SMS, in which she had clearly asked him if she could purchase more accumulators in 3 named shares including China Energy. The defendant’s testimony under cross-examination does not negate this. He admitted making these calls and I did not accept his evidence that the calls had nothing to do with the Disputed CE Accumulators.39     The Relationship Manager, in her Affidavits in Evidence in Chief (“AEIC”) (at paras 40 – 42) describes the communications between herself and the defendant and the typical lead up to instructions to purchase an accumulator as follows (this process hereinafter described as the “AEIC Order Process Narrative”):Prior to establishing each of the twenty (20) Accumulators under the Defendant’s instructions, [the Relationship Manager], on behalf of the Plaintiffs, would:-provide the Defendant with certain information on the particular share counter, including some information and recommendations of the research analysts from various brokers and/or financial institutions;inform the Defendant of the maximum quantity of shares that the Defendant would be obliged to accumulate under that particular Accumulator; andinform the Defendant of the Maximum Obligation under that particular Accumulator.The Defendant would then communicate his instructions to the Plaintiffs in relation to the Accumulators, through [the Relationship Manager], either orally in telephone conversations (on [the Relationship Manager]’s mobile phone) or via a SMS....Accordingly, once the Defendant confirms with [the Relationship Manager] his instructions to establish the said Accumulator, the Plaintiffs would execute the Accumulator for and on his behalf. Thereafter, as a standard practice, the Plaintiffs would send term sheets, confirmation notes and monthly statements of accounts detailing the terms of the said Accumulator to the Defendant.40     The Relationship Manager’s AEIC Order Process Narrative (see[39]) provides a narrative of the nature of the running communications and conversations between her and the defendant over a period of time which would culminate in the defendant’s oral instructions to purchase an accumulator.41     The defendant’s counsel laid considerable store by his cross-examination of the Relationship Manager on what she had stated in her AEIC. The defendant’s counsel sought to demonstrate that her AEIC Order Process Narrative could not possibly gel with the content of the SMS and the short telephone conversations on 2 and 3 October 2007. By so doing, he sought to discredit the witness in order that her evidence be disbelieved.42     It was however evident during cross-examination that the defendant’s counsel and the Relationship Manager were often at cross-purposes. There was a lack of clarity and consistency of usage of the technical expressions. An illustration of the dissonance between the Relationship Manager’s AEIC Order Process Narrative and her answers under cross-examination, in relation to the content of the critical telephone conversations on 2 and 3 October 2007 is as follows:(a)     The Relationship Manager stated under cross-examination that the defendant had given her a range of spot or initial prices of between S$1.75 to S$1.82 which the China Energy Accumulator could be established. When the defendant’s counsel pointed out to the Relationship Manager that she had not mentioned that she had discussed any alleged range of spot price with the defendant in her AEIC, she could not explain the omission. She then asserted that the forward price was given at a range of between 89.25% and 91%.Q:Now where is that in your affidavit evidence, that he gave you a range of 1.75 to 1.82?A:Because, your Honour, this was what was communicated to me by [the defendant]. When I go out there to the PBA desk to place the orders, that is why when we hit the market, rather, or they communicate to the counterparty, and then that’s how they acquired the orders, accumulators back, because that he [sic] the way accumulators are structured it’s not possible for us – it’s not like a normal store that I can just say a price and we buy at that price.Q:But that has been your evidence so far, Ms Ng. That has been your evidence so far in this case, that you told him what the initial price was?A:Yes.Q:That you told him what the forward price was?A:Mm-hmm. …Q:You told him what the knockout price was?A:Yes, your Honour, that’s true.Q:And then on the basis of what you told him, he then said “Okay, I agree to do an accumulator at those prices”. But your evidence now is quite different. Your evidence now is that you didn’t tell him what the forward price was, you didn’t tell him what the initial price was, you didn’t tell him what the knockout price was. You told him a range. It says, “Can I establish accumulators for you within this range?”, and this is the first time we are hearing from you about this range?A:Your Honour, I disagree on that, because the thing is, [the defendant’s counsel] started asking me about the China Energy accumulators, right? So the thing is when we establish an accumulator throughout this period of time from July to October, okay, it’s always a series of conversations, a series of sms, a series of information. If you could refer to page 427 of my AEIC, what I communicated to [the defendant] was that the proposed spot price, okay, due to the last night’s rally, and the research analyst report – …… Because what happens is during the conversation, I told – after [the defendant] has said that, “Okay, the maximum obligation is 6 million, right?”, we discussed the proposed spot price, which is between 1.75 to 1.82. He knows that the proposed forward price is between 89.25 per cent to 91 per cent, and that would depend on the spot price that has been established. And the knockout is between 102, which is end of day knockout, or 103 intraday knockdown.Q:Let’s just stop there. How does he know that the forward price is between the 89.5 per cent and – what is the other percentage that you said?A:89.25 per cent and 91 per cent.Q:Yes. This is again the first time I’m hearing about that.A:Your Honour, I think for clarity’s sake, maybe this AEIC was written to – so that it’s clearer that we put the proposed – I mean the forward price there, rather than as a percentage, however, this proposed forward price is the structure of the accumulator.43     The Relationship Manager appeared to be conflating two quite separate processes. One was the typical flow of communications and conversations between the defendant and her which would culminate in an oral instruction to purchase a particular accumulator which she described in her AEIC Order Process Narrative. The other was the precise contents of the short morning telephone conversations with the defendant the 2 and 3 October 2007. As a result of conflating the two, she often tripped up under cross-examination in explaining how she could have managed to provide all the detailed information she purports to have provided as described in her AEIC Order Process Narrative, in the course of the short telephone conversations, quite apart from the additional matter of ranges which she also said under cross-examination that she provided.44     The defendant had sight of the transcripts of recordings of the backroom conversations between the Relationship Manager and the plaintiff’s PBA and their conversations with the accumulator counterparty. In relation to those, he made the following closing submissions in support of his case that he did not instruct the Relationship Manager to purchase the Disputed CE Accumulators during the telephone calls on 2 and 3 October 2007:(a)He first challenged her evidence that she only places the defendant’s orders after she has received his orders. On 2 October 2007, there were four accumulators done for the defendant. These could not have been done for the defendant as if the first telephone conversation took place at 09:34 the transcripts of conversations between the Relationship Manager and the plaintiff’s PBA indicate that orders for the Disputed Third to Fifth CE Accumulators with the counterparty took place even before the 09:34 conversation with the defendant.(b)He pointed out that the Relationship Manager had given evidence that she was instructed to purchase S$6m CE Accumulators in the Disputed Fourth and Fifth CE Accumulators but had placed an order with the PBA at 10:32 for just S$1m and only later at 11:44 did she place an order for S$6.74m. He submitted that this could lead to the inference that the defendant in fact did not give her any instructions to purchase the Disputed CE Accumulators.(c)With regard to the Disputed Sixth CE Accumulator, the defendant had allegedly given the Relationship Manager a range to buy between S$1.75 and S$1.82. However, the shares had been bought at S$1.74 which was outside, albeit lower than the range.(d)With regard to the Disputed Seventh CE Accumulator, the Relationship Manager averred that the defendant gave her the range of maximum obligation S$4–5m during the 10:27 telephone call on 3 October 2007. However, she had mistakenly placed an order for S$4.5m (without including the doubling effect of what would constitute the maximum obligation). He submitted that having exceeded her authorised range of maximum obligation, she proceeded to dump the excess accumulators on him.45     The plaintiff responded as follows:(a)It was the Relationship Manager’s evidence that her orders are consolidated with orders of her other clients. As a result, the orders placed by the plaintiff with the counterparties do not match with any one client’s orders or even the timing of such orders.(b)The Relationship Manager consolidates, executes and only allocates her confirmed transactions at the end of each day to each of her clients, including the defendant.(c)The Relationship Manager had in her evidence answered that she did not exceed the price range instructed by the defendant because it is the practice to take the average of the prices of the total number of Disputed CE Accumulators purchased. When the prices of the four Disputed CE Accumulators are averaged:i.e. S$1.79, S$1.81, S$1.79 and S$1.74, the average was S$1.789 which is within the range of S$1.75 to S$1.82.(d)It is industry practice not to include the possible doubling effect when the bank places orders with counterparties. The Relationship Manager had admitted that there had been a mistake relating to the Disputed Seventh CE Accumulator in her having purchased an excess. It is her evidence however that she had other client’s orders which she filled with this excess. It was also the evidence of the plaintiff’s general manager that mistakes in orders can be reversed at the end of the day. In the light of this there was no reason for the Relationship Manager to dump the Disputed Seventh CE Accumulator on the defendant as these could have been unwound.46     The defendant, who is external to these processes, has postulated that there does not appear to be a direct match between each of the defendant’s alleged accumulator orders and the orders executed by the bank backroom. This, he submits, further corroborates his defence that he did not make these purchases. However I accepted the plaintiff’s explanations for three reasons. First, the plaintiff’s explanation is consistent with the transcript of the recordings of the backroom execution – that there was consolidation of orders. Second, the backroom execution process is the plaintiff’s own. It is accordingly in the best position to explain how its own process works including the consolidation of other client orders. Finally, the mismatch between the defendant’s alleged order and the orders placed by the Relationship Manager with PBA is answered by her explanation of her consolidating the defendant’s orders with the orders of her other customers. The defendant’s observation of exceeding his price range was made in abstract without taking into account the market practice of execution averaging described by the plaintiff. I am accordingly, unable to accept the defendant’s submission that the transcripts support the defendant’s case that he did not instruct the Relationship Manager to purchase the Disputed CE Accumulators during the telephone calls on 2 and 3 October 2007.47     In considering the evidence relating to the content of the critical telephone calls on 2 and 3 October 2007, what I find most significant is the defendant’s inability to explain satisfactorily his version of the contents of the telephone conversation, as he disputes that they were about instructions to purchase the Disputed CE Accumulators (see[37]above).48     The only two participants to these two telephone calls were the defendant and the Relationship Manager. Evaluating their evidence, I find the Relationship Manager’s evidence on her understanding of the product terms and her order taking process to have gaps, and thus unhelpful. Notwithstanding this shortcoming, I find her evidence that the defendant instructed her to purchase the Disputed CE Accumulators during the telephone calls on 2 and 3 October 2007 to be credible. This is supported by her having initiated the SMS query which led to the defendant’s almost immediate telephone call in response. By contrast I do not find the defendant’s evidence on the content of the telephone calls to be credible. He appeared to me to be evasive and when challenged under cross-examination he was obliged to fall back on the response that he could not recall.(b)   The defendant’s experience with accumulators and his earlier purchases of China Energy shares and undisputed CE Accumulators49     I next test the consistency of my findings and inferences of fact against the defendant’s prior experience with accumulators and his purchases of undisputed CE Accumulators and retention of China Energy shares.50     The defendant had between July 2007 and September 2007 purchased through the Relationship Manager, fourteen accumulators involving Cosco, DBS, Noble and China Energy shares. Starting with USD328,263.00 in his account in July 2007, the defendant’s account recorded USD393,521.00 by the end of September 2007. Over two months, the defendant realised a profit of USD65,258.00 (about a 20% return) from accumulators.51     Closer to the date of the Disputed CE Accumulators, on 26 September 2007, the Relationship Manager informed the defendant that he had realised a profit of S$37,000 when the DBS shares acquired under three DBS Accumulators (approximately S $5.7m Maximum Obligation) were sold and that he could make an additional profit of S$17,000 if the defendant chose to sell the Cosco shares acquired that day under a Cosco Accumulator with a maximum obligation of approximately S$2.35m.52     It was the defendant’s evidence that on or around 2 October 2007, he had requested the Relationship Manager to sell his Cosco shares but to keep the China Energy shares previously acquired under the undisputed First and Second China Energy Accumulators, even though he would have realised an immediate profit had he then sold them. Under cross-examination, the defendant could not explain why he chose to keep the China Energy shares, stating initially that he forgot why he did so, and then finally conceding that it could be because he had thought the prices of the China Energy shares would go up further.Q:You do recall that, in your affidavit, you told [the Relationship Manager] to sell the Cosco but to keep the China Energy shares accumulated so far; which means the China Energy shares accumulated under the first and second China Energy accumulator; correct?A:Correct.Q:My question to you – and I asked you this a few times – was what made you decide to keep the China Energy shares? I asked a few questions on that. I also told you that you had sub-prime concerns, which is why you wanted to stop doing accumulators. My questions to you then were, why did you want to keep a share counter you knew nothing about, since, in your view, the sub-prime would affect the Singapore stock market. Then I asked you questions as to what would make you keep a share, even when there is a storm brewing. You said you spoke to [the Relationship Manager] and if the share would still go up in the long term, even though it was going to go down in the short term, you would keep the share; correct?A:Yes.53     The defendant’s prior profitable experience with accumulators and his retention of the China Energy shares are consistent with my findings and inferences of fact that he had instructed the Relationship Manager to purchase the Disputed CE Accumulators during the telephone calls on 2 and 3 October 2007. His preceding profitable experience with accumulators and his recent retention of China Energy shares explain his likely purchase of the Disputed CE Accumulators and his ambiguous behaviour in not promptly and unequivocally rejecting them.(c)   The conduct of the plaintiff and the defendant after the purchase of the Disputed CE Accumulators54     Having considered the witnesses’ evidence relating to the content of the telephone calls on 2 and 3 October 2007, the defendant’s experience with accumulators and his earlier purchases of CE share and undisputed CE Accumulators, I now turn to examine the evidence relating to the conduct of the plaintiff and the defendant after the purchase of the Disputed CE Accumulators for consistency with my findings and inferences of fact.(i)   The plaintiff despatched the Disputed CE Accumulators term sheets, China Energy share confirmation notes and monthly statements to the defendant and requested further security55     The plaintiff despatched Disputed CE Accumulators term sheets, China Energy share confirmation notes and monthly statements to the defendant and the defendant does not dispute that he had received them in the ordinary course.56     The plaintiff also sent to the defendant his October 2007 monthly statement of account, whichinter alia, stated:The bank must be notified in writing within thirty (30) days of the statement date of any errors or omissions in the statement or the related contract notes. In the absence of such notification, the client is deemed to have agreed to the balances and details of the account.57     Notwithstanding this, the defendant did not promptly contact or query the plaintiff about either the Disputed CE Accumulators term sheets or the China Energy shares acquired thereunder. Neither did he contact the plaintiff nor make queries about his October 2007 monthly statement of account. He also did not return these documents to the plaintiff. All that he claimed he did was raise an objection to the Relationship Manager on 16 October 2007 and that he had given her one month to resolve the matter.58     According to the Relationship Manager, from 16 October 2007 to around 13 November 2007, she made repeated requests to the defendant to bring in the additional funds required to acquire the China Energy shares which he was obliged to acquire under the Disputed CE Accumulators. This included requests by the plaintiff to the defendant to provide more security, by taking steps such as mortgaging his house or transferring more funds from his trading account in another financial institution.(ii)   The defendant was silent for a considerable period after being informed59     The evidence adduced reveals that save for a telephone conversation on 18 October 2007, there were no communications between the defendant and the Relationship Manager until 5 November 2007. The defendant did not contact the Relationship Manager for any status update. On 2 November 2007, which was the scheduled settlement date for the China Energy shares acquired under three of the Disputed CE Accumulators, the Relationship Manager called the defendant twice but the defendant did not answer her calls. On 5 November 2007, the Relationship Manager called the defendant three times. The defendant once again did not answer her calls. The defendant returned the Relationship Manager’s telephone calls on the afternoon of 5 November 2007. It was a call which lasted for 27 minutes.60     Were the defendant to have given the Relationship Manager one month from 18 October 2007 to resolve the issue of the Disputed CE Accumulators, it might be expected that he would have called her or responded to her repeated telephone calls of 2 and 5 November 2007. He does not appear to have done so.(iii)   The defendant paid S$160,000 by cheque to the plaintiff and his previously acquired China Energy shares were sold to pay for China Energy shares to be acquired under the Disputed CE Accumulators61     It is not disputed that two separate payments were subsequently made in connection with the Disputed CE Accumulators from funds provided by the defendant and from the proceeds of liquidation of his previously acquired China Energy shares.62     On 7 November 2007 the defendant issued a cheque for S$160,000 to the plaintiff. The cheque was used to pay for the China Energy shares acquired under the Disputed CE Accumulators.63     The defendant’s explanation of this payment is that he had issued this cheque as the Relationship Manager had told him that the money was for the payment of shares acquired under the undisputed First and Second CE Accumulators and under the SembCorp Accumulator. Consequently, this cheque was not payment for the Disputed CE Accumulators. It is difficult to accept the defendant’s explanation for the following reasons: first, the shares acquired under the First and Second CE Accumulators had already been paid for on or around 2 October 2007 and would have been reflected in the statements received by the time he issued this cheque. Second, as he had given the Relationship Manager one month from 18 October 2007 to resolve the matter and it had yet to be resolved, it is difficult to understand why he would nevertheless on 7 November 2007 deliver a S$160,000.00 cheque to her without reserving his rights or position.64     On 16 November 2007 the plaintiff sold 180,000 China Energy shares. It claims it did so under the defendant’s instructions. 60,000 of the 180,000 China Energy shares were acquired by the defendant under the undisputed First and Second China Energy Accumulators and the remaining 120,000 shares were acquired by the defendant under the Disputed CE Accumulators. The sale proceeds were then used to pay for the new China Energy shares acquired under the Disputed CE Accumulators.65     The defendant avers that he did not know that the proceeds of sale of his previously acquired China Energy shares were to be used for the payment of new China Energy shares acquired under the Disputed CE Accumulators. He avers that the plaintiff had unilaterally applied the sale proceeds to these new China Energy shares acquired under the Disputed CE Accumulators. By this averment he attests only that he did not know how the plaintiff applied these sale proceeds. However, confirmation notes reflecting the sale of the China Energy shares (including those under the Disputed CE Accumulators) were sent to and received by the defendant. He did not raise any query at the time.66     In these circumstances, I am of the view that contrary to the defendant’s averment, he knew that he was making payment or he acquiesced with knowledge in the sale of the abovementioned China Energy shares. He would not have made the cheque payment had the Disputed CE Accumulators, in the first place, not been purchased under his instructions. Neither would he have made the cheque payment without reserving his position had he been waiting for the resolution of the Disputed CE Accumulators.(iv)   The plaintiff had senior management meetings with the defendant on 20 and 28 November 200767     On 20 November 2007, the defendant met with the plaintiff’s Mr Paul Kwek (“Mr Kwek”) and the Relationship Manager. The note of the meeting prepared by Mr Kwek, records,inter alia:1.    Mr Teo expressed surprise at the size of his exposure. He made remarks like he is not well versed with equity accumulator, he was only into blue chips, he was not fully apprised of the risks involved, the sizes of the contract are very high relative to his networth and risk appetite,etc. When I pressed as to whether he is denying the contracts, he said no but that the bank has to take some responsibility for them.2.    I told him that if the contracts are valid, then we have to address the near term issue of funds to pick up the shares as and when they get ‘striked’ in the weeks ahead. The other issue is margin for the remaining tenor of the contracts. Mr Teo did not want to commit himself on these matters. He wants to meet up with GM of the branch so that all his concerns can be addressed. We told him that we will schedule a meeting next week when the GM is back from Paris.3.    He questioned our margin requirementsvis-à-visthe contracts done. Sue said that she had all along been asking him to bring in additional funds but he has not responded.68     Under cross-examination by the defendant’s counsel, Mr Kwek stated that at the meeting on 20 November 2007, he specifically asked the defendant whether the latter was denying liability for the Disputed CE Accumulators and the defendant had replied “no”.69     However, according to the defendant, Mr Kwek’s contemporaneous note of their meeting on 20 November 2007 is not an accurate reflection of what transpired at the meeting. Under cross-examination, the defendant challenged Mr Kwek’s evidence as follows:(i)He expressed surprise at the deals that were being done on his accounts with that kind of exposure, and not merely at the size of the exposure;(ii)He had informed Mr Kwek that the Disputed CE Accumulators were not authorised;(iii)Mr Kwek did not inform him about the need to bring in funds to pick up the shares acquired under the Disputed CE Accumulators; and(iv)He did not ask on the margin requirements for the contracts as he did not understand what a margin was.70     However, when the plaintiff’s counsel showed the defendant that the contents of his own emails of 21 November 2007 and 23 November 2007 were similar to Mr Kwek’s contemporaneous note of 20 November 2007, the defendant changed his evidence. The defendant admitted that the issue of funds to acquire the China Energy shares was addressed at the meeting but that he had told Mr Kwek that he did not want to acquire the shares. The defendant further admitted that it was possible that parties had spoken on the margin requirements for the Disputed CE Accumulators:Court:To clarify for your benefit, on page 90, paragraph numbered 2, plaintiff's counsel has taken you line by line through this email.A:Sorry, your Honour, the --Court:Page 90.A:Of the plaintiff's core bundle of documents?Court:Yes, the core bundle. He had taken you line by line through that email and asked you which lines you would agree reflected your conversation with Paul Kwek on 30 (sic) November, and which you did not. In the paragraph numbered 2, he took you through two sentences. The first one: \"If the contracts are valid, then we have to address the near term issue of funds to pick up the shares as and when they get 'striked' in the weeks ahead.\"A:Yes, your Honour.Court:Yes. So, your email three days later, 23 November, page 176, in the second last paragraph you state: \"I will not be interested even if the shares gets knocked out next week.\" And the last line: \"... I am also not prepared to pick up the next batch of shares that you mentioned earlier that is due next week.\"A:Yes, your Honour.Court:In the light of these two things, would you want to restate your position on the second paragraph of Paul Kwek's internal email to the bank?A:Yes, I think I will accept that, your Honour.Q:So you will accept that Mr Kwek then said that you have to address the near term issue of funds to pick up the shares, correct? He raised that to you?A:Yes, I accept that.Q:In fact, I understand that Mr Kwek told you what has to be done in relation to the picking up of the shares, right? He explained that to you.A:Say that again?Q:He explained to you what you needed to do to be able to pick up the next batch of shares that were due under the accumulators.A:Yes, he -- I think he is asking me to -- better think of how to raise money to pick up the shares, yeah.Q:To pick up the shares. He told you that, right? And so his paragraph 2, first sentence is correct. How about the second sentence now, because earlier you also said that was incorrect. I will give you another chance. He also raised: \"The other issue is margin for the remaining tenure of the contracts.” Do you want to think about this again and see whether he may have raised the issue of margin for the remaining tenure of the contracts?A:I, quite frankly --Q:Can't remember?A:-- I can't remember because the margin is something that I'm not -- I'm not familiar with.Q:But it is possible that he raised an issue with you on the margin for the remainder tenure of the contracts? \"Contracts\" meaning the unauthorised transactions. Correct? Right?A:It's possible.Q:It's possible, right. So you have confirmed that he spoke to you about the near term issue of funds, to pick up shares due under the unauthorised transactions; and he may have possibly spoken to you about the margin for the remaining tenure of the contracts. Correct? That's your evidence now.A:Correct.71     Critically, when I questioned the defendant regarding whether Mr Kwek had asked him whether he was denying the Disputed CE Accumulators, the defendant changed his mind and claimed that he could not recall whether this statement was made by him at the meeting on 20 November 2009. This contradicted the defendant’s earlier position in the affidavits he filed in these proceedings where he clearly denied that the statement was made at the 20 November 2007 meeting.Court:With the benefit of having looked over your transcript, as well as this, you are looking literally at paragraph 1, the last sentence. It was your evidence yesterday that Mr Paul Kwek did not press you as to whether you were denying and you said \"no\". Are you basically saying now that you could not recall whether that statement was made at that meeting?A:Yes, I couldn't recall.Q:Now, for that also you say you cannot recall: you are now confirming that?A:I can't recall, yes.72     The defendant’s evidence about the meeting on 20 November 2007 is contradictory. The defendant’s own emails of 21 November 2007 and 23 November 2007 support the plaintiff’s version of the events which took place at the meeting on 20 November 2007. Under cross-examination, the defendant suggested that Mr Kwek may have lied in his contemporaneous note of the meeting of 20 November 2007, in order to cover up for his employee. The bare assertion was not supported by any evidence.73     On 28 November 2007, the defendant attended a second meeting, this time with the plaintiff’s General Manager, Mr Jean Luc Anglada (“Mr Anglada”) and Mr Kwek. It is their evidence that the defendant also did not, at this meeting, deny that he gave instructions to the Relationship Manager to purchase the Disputed CE Accumulators. The defendant disputes this but in light of the evidence adduced, I accepted their account. There was no evidence to establish that Mr Anglada would, in addition to Mr Kwek, cover up for the Relationship Manager.The defendant’s equivocation in rejecting Disputed CE Accumulators74     On 5 December 2007, the defendant requested the plaintiff to provide him with the estimated costs of closing out the Disputed CE Accumulators. The plaintiff thereafter also provided the defendant with a summary of his accumulators in January 2008. They also made arrangements for the defendant to attend an analysts lunch meeting scheduled in February 2008 by the China Energy management.75     Given the defendant’s experience with accumulators, the question does arise as to what accounts for his equivocal conduct between 16 October and 5 December 2007 which marks the time between when he claims he first discovered the Disputed CE Accumulators and the time he requested information about closing out costs. If he were rejecting the Disputed CE Accumulators, what could account for his inaction - his payment of S$160,000 and his instructions, or knowing acquiescence in the sale of his previously acquired China Energy shares to pay for new China Energy shares under the Disputed CE Accumulators? Why did he not vigorously and unequivocally reject the Disputed CE Accumulators prior to or when he first met the plaintiff’s senior management on two separate occasions in November 2007?76     It was Mr Anglada’s evidence that the defendant could have, if he wished, mitigated his loss in the declining China Energy market price by selling off his acquired shares promptly and terminating the accumulator by paying the closing out costs. There are only two choices when the market price of the relevant share dives and continues a sustained dive below the forward price of the accumulator. Where the purchaser remains bullish about the underlying share, he may decide to retain the acquired shares, and continue to double up the shares he becomes obliged to acquire. Should the market price of the underlying share thereafter recover beyond the forward price, he can then sell his doubled share acquisitions at a profit. Alternatively, the purchaser can cut loss by selling all the shares acquired previously and promptly terminating the accumulator by paying the closing out costs. I accepted his evidence.77     In the light of Mr Anglada’s evidence as to the two available risk decisions, how is the defendant’s equivocation in the face of a declining China Energy share price consistent with my finding and decision? There were produced in evidence, some market analysts’ recommendations between October and December 2007 which projected a target price of the China Energy shares which was significantly higher than the Disputed China Energy Accumulators Knock-Out price. There was also evidence of the defendant’s prior decision with another earlier accumulator, the Second Noble Accumulator. The market price of Noble shares had fallen below the Second Noble Accumulator Forward Price for a number of days during which the defendant was obliged to double up his share acquisitions. However, thereafter the market price of Noble shares recovered and the Second Noble Accumulator was knocked-out some two months after it was established. The defendant had made a significantly larger profit when he later sold the Noble shares, including the doubled acquisitions during the Noble market share price downturn. If the defendant remained bullish about China Energy shares notwithstanding its share price decline in October 2007, this would explain his equivocation in neither clearly rejecting the Disputed CE Accumulators nor terminating them.78     What the defendant faced was the immediate pressure of the plaintiff’s margin calls and requests for additional security. The defendant’s equivocation as to the Disputed CE Accumulators during this period is consistent with a bullish expectation of recovery of the market price of China Energy shares. By his equivocation he was able to defer having to provide additional margin and security as pressed for by the bank. It was only by the time of the meeting of 5 December 2007 with the plaintiff’s senior managers that he appears to have ceased to be bullish about China Energy shares. He only then asked for an estimate of the closing out costs.79     He appears thereafter to have taken no further actions. Sometime in or around March 2008, the market price of the China Energy shares declined sharply. By way of a letter dated 14 March 2008, the plaintiff’s solicitors demanded that the defendant make payment to the plaintiff of the outstanding sum of S$4,125,745.00 which was due and owing to the plaintiff as of 6 March 2008 pursuant to the terms of the Disputed CE Accumulators.80     As the defendant had not made any payment, the plaintiff exercised its rights under the contractual documents and closed out the Disputed CE Accumulators from 10 April to 21 April 2008 and set-off the funds in the defendant’s account towards payment of the outstanding sum due under the Disputed CE Accumulators.81     On or around 27 May 2009, the plaintiff issued a conclusive certificate of indebtedness (see[22]above) certifying that the outstanding sum (including interest) due and owing from the defendant to the plaintiff as of 29 August 2008 was S$6,459,519.83. This sum consisted of:(a)S$2,782,803.66 for the China Energy shares delivered pursuant to the terms of the Disputed CE accumulators and which was paid by the Plaintiffs to the counterparties;(b)S$3,625,393.11 which the plaintiff paid to the counterparties to close-out the Third to Seventh China Energy Accumulators; and(c)interest of S$51,323.06 as of 29 August 2008.The plaintiff then brought the present action claiming these amounts against the defendant (see above at[3]).Conclusion82     In the light of the evidence and my findings, and in the totality of the prior and subsequent consistent conduct of the parties in relation to the Disputed CE Accumulators, I find that the defendant did instruct the Relationship Manager to purchase the Disputed CE Accumulators during the telephone conversations on 2 and 3 October 2007. It is not necessary to further deal with the plaintiff’s alternative submissions as to estoppel.83     I now return to the core question of law about private banking and sophisticated clients raised in[2]in the light of the relevant contractual documents and the evidence adduced in this dispute:When is a private bank acting as a trusted advisor of its client and when is it not?84     A private bank is not acting as a trusted advisor of its client when (a) its account opening form and Risk Disclosure Statement highlight to the client that he is responsible for the risks in his transactions and recommends that he takes advice from other professional advisers, including his accountants, lawyers and tax advisors, and further that the bank does not make recommendations or give advice and (b) this is borne out by the evidence of conduct.85     Judgment for the plaintiff. Costs are to be taxed or agreed.",
        "(a)   Witness testimony relating to content of telephone calls on 2 and 3 October 2007": "35     The undisputed evidence regarding the telephone calls is as follows: At09:34 on 2 October 2007, the Relationship Manager sent a text message (“SMS”) to the defendant which read: “Ok, last night us very gd. Rally shld continue. Can I do somemore? Looking at china energy, cosco and ferrochina”. At09:34:06(2 minutes and 22 seconds) and at17:35:05(2 minutes and 34 seconds) on2 October 2007 there were two telephone calls from the defendant to the Relationship Manager; At10:27:27(1 minute and 15 seconds) and at11:00:17(1 minute and 34 seconds) on3 October 2007 there were two telephone calls from the Relationship Manager to the defendant. [Emphasis added in bold] 36     It is the plaintiff’s case, and the Relationship Manager’s evidence, that the defendant instructed the Relationship Manager to purchase the Disputed CE Accumulators and one SembCorp Accumulator during the telephone conversations on 2 October 2007 (the 09:34:06 call) and 3 October 2007 (the 10:27:27 call). 37     Under cross-examination, the defendant stated that whilst he did not remember the details of the telephone calls, the calls were not about purchasing the Disputed CE Accumulators. When questioned further on the purpose of his calling the Relationship Manager on 2 October 2007 at 09:34:06 (just six seconds after he received the SMS), the defendant claimed that he had called the Relationship Manager to enquire about the status of shares which he had previously purchased under earlier undisputed accumulators. He gave evidence under cross-examination that these shares would have been Neptune Orient Line (“NOL”) shares, Cosco shares and China Energy shares and that he had instructed the Relationship Manager to sell off the NOL shares and Cosco shares but to retain the China Energy shares. When asked to explain why he would call the Relationship Manager again on 3 October 2007 when he no longer had shares in his account, save for the China Energy shares which he had already instructed her to retain, he responded that he could not recall what was discussed during the 3 October 2007 conversation. 38     In my view, it can be reasonably inferred that since the defendant called the Relationship Manager just six seconds after receiving her 2 October 2007 morning SMS, he was responding to the contents of her SMS, in which she had clearly asked him if she could purchase more accumulators in 3 named shares including China Energy. The defendant’s testimony under cross-examination does not negate this. He admitted making these calls and I did not accept his evidence that the calls had nothing to do with the Disputed CE Accumulators. 39     The Relationship Manager, in her Affidavits in Evidence in Chief (“AEIC”) (at paras 40 – 42) describes the communications between herself and the defendant and the typical lead up to instructions to purchase an accumulator as follows (this process hereinafter described as the “AEIC Order Process Narrative”): Prior to establishing each of the twenty (20) Accumulators under the Defendant’s instructions, [the Relationship Manager], on behalf of the Plaintiffs, would:- provide the Defendant with certain information on the particular share counter, including some information and recommendations of the research analysts from various brokers and/or financial institutions; inform the Defendant of the maximum quantity of shares that the Defendant would be obliged to accumulate under that particular Accumulator; and inform the Defendant of the Maximum Obligation under that particular Accumulator. The Defendant would then communicate his instructions to the Plaintiffs in relation to the Accumulators, through [the Relationship Manager], either orally in telephone conversations (on [the Relationship Manager]’s mobile phone) or via a SMS. ... Accordingly, once the Defendant confirms with [the Relationship Manager] his instructions to establish the said Accumulator, the Plaintiffs would execute the Accumulator for and on his behalf. Thereafter, as a standard practice, the Plaintiffs would send term sheets, confirmation notes and monthly statements of accounts detailing the terms of the said Accumulator to the Defendant. 40     The Relationship Manager’s AEIC Order Process Narrative (see[39]) provides a narrative of the nature of the running communications and conversations between her and the defendant over a period of time which would culminate in the defendant’s oral instructions to purchase an accumulator. 41     The defendant’s counsel laid considerable store by his cross-examination of the Relationship Manager on what she had stated in her AEIC. The defendant’s counsel sought to demonstrate that her AEIC Order Process Narrative could not possibly gel with the content of the SMS and the short telephone conversations on 2 and 3 October 2007. By so doing, he sought to discredit the witness in order that her evidence be disbelieved. 42     It was however evident during cross-examination that the defendant’s counsel and the Relationship Manager were often at cross-purposes. There was a lack of clarity and consistency of usage of the technical expressions. An illustration of the dissonance between the Relationship Manager’s AEIC Order Process Narrative and her answers under cross-examination, in relation to the content of the critical telephone conversations on 2 and 3 October 2007 is as follows: (a)     The Relationship Manager stated under cross-examination that the defendant had given her a range of spot or initial prices of between S$1.75 to S$1.82 which the China Energy Accumulator could be established. When the defendant’s counsel pointed out to the Relationship Manager that she had not mentioned that she had discussed any alleged range of spot price with the defendant in her AEIC, she could not explain the omission. She then asserted that the forward price was given at a range of between 89.25% and 91%. Q:Now where is that in your affidavit evidence, that he gave you a range of 1.75 to 1.82? A:Because, your Honour, this was what was communicated to me by [the defendant]. When I go out there to the PBA desk to place the orders, that is why when we hit the market, rather, or they communicate to the counterparty, and then that’s how they acquired the orders, accumulators back, because that he [sic] the way accumulators are structured it’s not possible for us – it’s not like a normal store that I can just say a price and we buy at that price. Q:But that has been your evidence so far, Ms Ng. That has been your evidence so far in this case, that you told him what the initial price was? A:Yes. Q:That you told him what the forward price was? A:Mm-hmm. … Q:You told him what the knockout price was? A:Yes, your Honour, that’s true. Q:And then on the basis of what you told him, he then said “Okay, I agree to do an accumulator at those prices”. But your evidence now is quite different. Your evidence now is that you didn’t tell him what the forward price was, you didn’t tell him what the initial price was, you didn’t tell him what the knockout price was. You told him a range. It says, “Can I establish accumulators for you within this range?”, and this is the first time we are hearing from you about this range? A:Your Honour, I disagree on that, because the thing is, [the defendant’s counsel] started asking me about the China Energy accumulators, right? So the thing is when we establish an accumulator throughout this period of time from July to October, okay, it’s always a series of conversations, a series of sms, a series of information. If you could refer to page 427 of my AEIC, what I communicated to [the defendant] was that the proposed spot price, okay, due to the last night’s rally, and the research analyst report – … … Because what happens is during the conversation, I told – after [the defendant] has said that, “Okay, the maximum obligation is 6 million, right?”, we discussed the proposed spot price, which is between 1.75 to 1.82. He knows that the proposed forward price is between 89.25 per cent to 91 per cent, and that would depend on the spot price that has been established. And the knockout is between 102, which is end of day knockout, or 103 intraday knockdown. Q:Let’s just stop there. How does he know that the forward price is between the 89.5 per cent and – what is the other percentage that you said? A:89.25 per cent and 91 per cent. Q:Yes. This is again the first time I’m hearing about that. A:Your Honour, I think for clarity’s sake, maybe this AEIC was written to – so that it’s clearer that we put the proposed – I mean the forward price there, rather than as a percentage, however, this proposed forward price is the structure of the accumulator. 43     The Relationship Manager appeared to be conflating two quite separate processes. One was the typical flow of communications and conversations between the defendant and her which would culminate in an oral instruction to purchase a particular accumulator which she described in her AEIC Order Process Narrative. The other was the precise contents of the short morning telephone conversations with the defendant the 2 and 3 October 2007. As a result of conflating the two, she often tripped up under cross-examination in explaining how she could have managed to provide all the detailed information she purports to have provided as described in her AEIC Order Process Narrative, in the course of the short telephone conversations, quite apart from the additional matter of ranges which she also said under cross-examination that she provided. 44     The defendant had sight of the transcripts of recordings of the backroom conversations between the Relationship Manager and the plaintiff’s PBA and their conversations with the accumulator counterparty. In relation to those, he made the following closing submissions in support of his case that he did not instruct the Relationship Manager to purchase the Disputed CE Accumulators during the telephone calls on 2 and 3 October 2007: (a)He first challenged her evidence that she only places the defendant’s orders after she has received his orders. On 2 October 2007, there were four accumulators done for the defendant. These could not have been done for the defendant as if the first telephone conversation took place at 09:34 the transcripts of conversations between the Relationship Manager and the plaintiff’s PBA indicate that orders for the Disputed Third to Fifth CE Accumulators with the counterparty took place even before the 09:34 conversation with the defendant. (b)He pointed out that the Relationship Manager had given evidence that she was instructed to purchase S$6m CE Accumulators in the Disputed Fourth and Fifth CE Accumulators but had placed an order with the PBA at 10:32 for just S$1m and only later at 11:44 did she place an order for S$6.74m. He submitted that this could lead to the inference that the defendant in fact did not give her any instructions to purchase the Disputed CE Accumulators. (c)With regard to the Disputed Sixth CE Accumulator, the defendant had allegedly given the Relationship Manager a range to buy between S$1.75 and S$1.82. However, the shares had been bought at S$1.74 which was outside, albeit lower than the range. (d)With regard to the Disputed Seventh CE Accumulator, the Relationship Manager averred that the defendant gave her the range of maximum obligation S$4–5m during the 10:27 telephone call on 3 October 2007. However, she had mistakenly placed an order for S$4.5m (without including the doubling effect of what would constitute the maximum obligation). He submitted that having exceeded her authorised range of maximum obligation, she proceeded to dump the excess accumulators on him. 45     The plaintiff responded as follows: (a)It was the Relationship Manager’s evidence that her orders are consolidated with orders of her other clients. As a result, the orders placed by the plaintiff with the counterparties do not match with any one client’s orders or even the timing of such orders. (b)The Relationship Manager consolidates, executes and only allocates her confirmed transactions at the end of each day to each of her clients, including the defendant. (c)The Relationship Manager had in her evidence answered that she did not exceed the price range instructed by the defendant because it is the practice to take the average of the prices of the total number of Disputed CE Accumulators purchased. When the prices of the four Disputed CE Accumulators are averaged:i.e. S$1.79, S$1.81, S$1.79 and S$1.74, the average was S$1.789 which is within the range of S$1.75 to S$1.82. (d)It is industry practice not to include the possible doubling effect when the bank places orders with counterparties. The Relationship Manager had admitted that there had been a mistake relating to the Disputed Seventh CE Accumulator in her having purchased an excess. It is her evidence however that she had other client’s orders which she filled with this excess. It was also the evidence of the plaintiff’s general manager that mistakes in orders can be reversed at the end of the day. In the light of this there was no reason for the Relationship Manager to dump the Disputed Seventh CE Accumulator on the defendant as these could have been unwound. 46     The defendant, who is external to these processes, has postulated that there does not appear to be a direct match between each of the defendant’s alleged accumulator orders and the orders executed by the bank backroom. This, he submits, further corroborates his defence that he did not make these purchases. However I accepted the plaintiff’s explanations for three reasons. First, the plaintiff’s explanation is consistent with the transcript of the recordings of the backroom execution – that there was consolidation of orders. Second, the backroom execution process is the plaintiff’s own. It is accordingly in the best position to explain how its own process works including the consolidation of other client orders. Finally, the mismatch between the defendant’s alleged order and the orders placed by the Relationship Manager with PBA is answered by her explanation of her consolidating the defendant’s orders with the orders of her other customers. The defendant’s observation of exceeding his price range was made in abstract without taking into account the market practice of execution averaging described by the plaintiff. I am accordingly, unable to accept the defendant’s submission that the transcripts support the defendant’s case that he did not instruct the Relationship Manager to purchase the Disputed CE Accumulators during the telephone calls on 2 and 3 October 2007. 47     In considering the evidence relating to the content of the critical telephone calls on 2 and 3 October 2007, what I find most significant is the defendant’s inability to explain satisfactorily his version of the contents of the telephone conversation, as he disputes that they were about instructions to purchase the Disputed CE Accumulators (see[37]above). 48     The only two participants to these two telephone calls were the defendant and the Relationship Manager. Evaluating their evidence, I find the Relationship Manager’s evidence on her understanding of the product terms and her order taking process to have gaps, and thus unhelpful. Notwithstanding this shortcoming, I find her evidence that the defendant instructed her to purchase the Disputed CE Accumulators during the telephone calls on 2 and 3 October 2007 to be credible. This is supported by her having initiated the SMS query which led to the defendant’s almost immediate telephone call in response. By contrast I do not find the defendant’s evidence on the content of the telephone calls to be credible. He appeared to me to be evasive and when challenged under cross-examination he was obliged to fall back on the response that he could not recall.",
        "(b)   The defendant’s experience with accumulators and his earlier purchases of China Energy shares and undisputed CE Accumulators": "49     I next test the consistency of my findings and inferences of fact against the defendant’s prior experience with accumulators and his purchases of undisputed CE Accumulators and retention of China Energy shares. 50     The defendant had between July 2007 and September 2007 purchased through the Relationship Manager, fourteen accumulators involving Cosco, DBS, Noble and China Energy shares. Starting with USD328,263.00 in his account in July 2007, the defendant’s account recorded USD393,521.00 by the end of September 2007. Over two months, the defendant realised a profit of USD65,258.00 (about a 20% return) from accumulators. 51     Closer to the date of the Disputed CE Accumulators, on 26 September 2007, the Relationship Manager informed the defendant that he had realised a profit of S$37,000 when the DBS shares acquired under three DBS Accumulators (approximately S $5.7m Maximum Obligation) were sold and that he could make an additional profit of S$17,000 if the defendant chose to sell the Cosco shares acquired that day under a Cosco Accumulator with a maximum obligation of approximately S$2.35m. 52     It was the defendant’s evidence that on or around 2 October 2007, he had requested the Relationship Manager to sell his Cosco shares but to keep the China Energy shares previously acquired under the undisputed First and Second China Energy Accumulators, even though he would have realised an immediate profit had he then sold them. Under cross-examination, the defendant could not explain why he chose to keep the China Energy shares, stating initially that he forgot why he did so, and then finally conceding that it could be because he had thought the prices of the China Energy shares would go up further. Q:You do recall that, in your affidavit, you told [the Relationship Manager] to sell the Cosco but to keep the China Energy shares accumulated so far; which means the China Energy shares accumulated under the first and second China Energy accumulator; correct? A:Correct. Q:My question to you – and I asked you this a few times – was what made you decide to keep the China Energy shares? I asked a few questions on that. I also told you that you had sub-prime concerns, which is why you wanted to stop doing accumulators. My questions to you then were, why did you want to keep a share counter you knew nothing about, since, in your view, the sub-prime would affect the Singapore stock market. Then I asked you questions as to what would make you keep a share, even when there is a storm brewing. You said you spoke to [the Relationship Manager] and if the share would still go up in the long term, even though it was going to go down in the short term, you would keep the share; correct? A:Yes. 53     The defendant’s prior profitable experience with accumulators and his retention of the China Energy shares are consistent with my findings and inferences of fact that he had instructed the Relationship Manager to purchase the Disputed CE Accumulators during the telephone calls on 2 and 3 October 2007. His preceding profitable experience with accumulators and his recent retention of China Energy shares explain his likely purchase of the Disputed CE Accumulators and his ambiguous behaviour in not promptly and unequivocally rejecting them.",
        "(c)   The conduct of the plaintiff and the defendant after the purchase of the Disputed CE Accumulators": "54     Having considered the witnesses’ evidence relating to the content of the telephone calls on 2 and 3 October 2007, the defendant’s experience with accumulators and his earlier purchases of CE share and undisputed CE Accumulators, I now turn to examine the evidence relating to the conduct of the plaintiff and the defendant after the purchase of the Disputed CE Accumulators for consistency with my findings and inferences of fact. (i)   The plaintiff despatched the Disputed CE Accumulators term sheets, China Energy share confirmation notes and monthly statements to the defendant and requested further security 55     The plaintiff despatched Disputed CE Accumulators term sheets, China Energy share confirmation notes and monthly statements to the defendant and the defendant does not dispute that he had received them in the ordinary course. 56     The plaintiff also sent to the defendant his October 2007 monthly statement of account, whichinter alia, stated: The bank must be notified in writing within thirty (30) days of the statement date of any errors or omissions in the statement or the related contract notes. In the absence of such notification, the client is deemed to have agreed to the balances and details of the account. 57     Notwithstanding this, the defendant did not promptly contact or query the plaintiff about either the Disputed CE Accumulators term sheets or the China Energy shares acquired thereunder. Neither did he contact the plaintiff nor make queries about his October 2007 monthly statement of account. He also did not return these documents to the plaintiff. All that he claimed he did was raise an objection to the Relationship Manager on 16 October 2007 and that he had given her one month to resolve the matter. 58     According to the Relationship Manager, from 16 October 2007 to around 13 November 2007, she made repeated requests to the defendant to bring in the additional funds required to acquire the China Energy shares which he was obliged to acquire under the Disputed CE Accumulators. This included requests by the plaintiff to the defendant to provide more security, by taking steps such as mortgaging his house or transferring more funds from his trading account in another financial institution. (ii)   The defendant was silent for a considerable period after being informed 59     The evidence adduced reveals that save for a telephone conversation on 18 October 2007, there were no communications between the defendant and the Relationship Manager until 5 November 2007. The defendant did not contact the Relationship Manager for any status update. On 2 November 2007, which was the scheduled settlement date for the China Energy shares acquired under three of the Disputed CE Accumulators, the Relationship Manager called the defendant twice but the defendant did not answer her calls. On 5 November 2007, the Relationship Manager called the defendant three times. The defendant once again did not answer her calls. The defendant returned the Relationship Manager’s telephone calls on the afternoon of 5 November 2007. It was a call which lasted for 27 minutes. 60     Were the defendant to have given the Relationship Manager one month from 18 October 2007 to resolve the issue of the Disputed CE Accumulators, it might be expected that he would have called her or responded to her repeated telephone calls of 2 and 5 November 2007. He does not appear to have done so. (iii)   The defendant paid S$160,000 by cheque to the plaintiff and his previously acquired China Energy shares were sold to pay for China Energy shares to be acquired under the Disputed CE Accumulators 61     It is not disputed that two separate payments were subsequently made in connection with the Disputed CE Accumulators from funds provided by the defendant and from the proceeds of liquidation of his previously acquired China Energy shares. 62     On 7 November 2007 the defendant issued a cheque for S$160,000 to the plaintiff. The cheque was used to pay for the China Energy shares acquired under the Disputed CE Accumulators. 63     The defendant’s explanation of this payment is that he had issued this cheque as the Relationship Manager had told him that the money was for the payment of shares acquired under the undisputed First and Second CE Accumulators and under the SembCorp Accumulator. Consequently, this cheque was not payment for the Disputed CE Accumulators. It is difficult to accept the defendant’s explanation for the following reasons: first, the shares acquired under the First and Second CE Accumulators had already been paid for on or around 2 October 2007 and would have been reflected in the statements received by the time he issued this cheque. Second, as he had given the Relationship Manager one month from 18 October 2007 to resolve the matter and it had yet to be resolved, it is difficult to understand why he would nevertheless on 7 November 2007 deliver a S$160,000.00 cheque to her without reserving his rights or position. 64     On 16 November 2007 the plaintiff sold 180,000 China Energy shares. It claims it did so under the defendant’s instructions. 60,000 of the 180,000 China Energy shares were acquired by the defendant under the undisputed First and Second China Energy Accumulators and the remaining 120,000 shares were acquired by the defendant under the Disputed CE Accumulators. The sale proceeds were then used to pay for the new China Energy shares acquired under the Disputed CE Accumulators. 65     The defendant avers that he did not know that the proceeds of sale of his previously acquired China Energy shares were to be used for the payment of new China Energy shares acquired under the Disputed CE Accumulators. He avers that the plaintiff had unilaterally applied the sale proceeds to these new China Energy shares acquired under the Disputed CE Accumulators. By this averment he attests only that he did not know how the plaintiff applied these sale proceeds. However, confirmation notes reflecting the sale of the China Energy shares (including those under the Disputed CE Accumulators) were sent to and received by the defendant. He did not raise any query at the time. 66     In these circumstances, I am of the view that contrary to the defendant’s averment, he knew that he was making payment or he acquiesced with knowledge in the sale of the abovementioned China Energy shares. He would not have made the cheque payment had the Disputed CE Accumulators, in the first place, not been purchased under his instructions. Neither would he have made the cheque payment without reserving his position had he been waiting for the resolution of the Disputed CE Accumulators. (iv)   The plaintiff had senior management meetings with the defendant on 20 and 28 November 2007 67     On 20 November 2007, the defendant met with the plaintiff’s Mr Paul Kwek (“Mr Kwek”) and the Relationship Manager. The note of the meeting prepared by Mr Kwek, records,inter alia: 1.    Mr Teo expressed surprise at the size of his exposure. He made remarks like he is not well versed with equity accumulator, he was only into blue chips, he was not fully apprised of the risks involved, the sizes of the contract are very high relative to his networth and risk appetite,etc. When I pressed as to whether he is denying the contracts, he said no but that the bank has to take some responsibility for them. 2.    I told him that if the contracts are valid, then we have to address the near term issue of funds to pick up the shares as and when they get ‘striked’ in the weeks ahead. The other issue is margin for the remaining tenor of the contracts. Mr Teo did not want to commit himself on these matters. He wants to meet up with GM of the branch so that all his concerns can be addressed. We told him that we will schedule a meeting next week when the GM is back from Paris. 3.    He questioned our margin requirementsvis-à-visthe contracts done. Sue said that she had all along been asking him to bring in additional funds but he has not responded. 68     Under cross-examination by the defendant’s counsel, Mr Kwek stated that at the meeting on 20 November 2007, he specifically asked the defendant whether the latter was denying liability for the Disputed CE Accumulators and the defendant had replied “no”. 69     However, according to the defendant, Mr Kwek’s contemporaneous note of their meeting on 20 November 2007 is not an accurate reflection of what transpired at the meeting. Under cross-examination, the defendant challenged Mr Kwek’s evidence as follows: (i)He expressed surprise at the deals that were being done on his accounts with that kind of exposure, and not merely at the size of the exposure;(ii)He had informed Mr Kwek that the Disputed CE Accumulators were not authorised;(iii)Mr Kwek did not inform him about the need to bring in funds to pick up the shares acquired under the Disputed CE Accumulators; and(iv)He did not ask on the margin requirements for the contracts as he did not understand what a margin was.70     However, when the plaintiff’s counsel showed the defendant that the contents of his own emails of 21 November 2007 and 23 November 2007 were similar to Mr Kwek’s contemporaneous note of 20 November 2007, the defendant changed his evidence. The defendant admitted that the issue of funds to acquire the China Energy shares was addressed at the meeting but that he had told Mr Kwek that he did not want to acquire the shares. The defendant further admitted that it was possible that parties had spoken on the margin requirements for the Disputed CE Accumulators:Court:To clarify for your benefit, on page 90, paragraph numbered 2, plaintiff's counsel has taken you line by line through this email.A:Sorry, your Honour, the --Court:Page 90.A:Of the plaintiff's core bundle of documents?Court:Yes, the core bundle. He had taken you line by line through that email and asked you which lines you would agree reflected your conversation with Paul Kwek on 30 (sic) November, and which you did not. In the paragraph numbered 2, he took you through two sentences. The first one: \"If the contracts are valid, then we have to address the near term issue of funds to pick up the shares as and when they get 'striked' in the weeks ahead.\"A:Yes, your Honour.Court:Yes. So, your email three days later, 23 November, page 176, in the second last paragraph you state: \"I will not be interested even if the shares gets knocked out next week.\" And the last line: \"... I am also not prepared to pick up the next batch of shares that you mentioned earlier that is due next week.\"A:Yes, your Honour.Court:In the light of these two things, would you want to restate your position on the second paragraph of Paul Kwek's internal email to the bank?A:Yes, I think I will accept that, your Honour.Q:So you will accept that Mr Kwek then said that you have to address the near term issue of funds to pick up the shares, correct? He raised that to you?A:Yes, I accept that.Q:In fact, I understand that Mr Kwek told you what has to be done in relation to the picking up of the shares, right? He explained that to you.A:Say that again?Q:He explained to you what you needed to do to be able to pick up the next batch of shares that were due under the accumulators.A:Yes, he -- I think he is asking me to -- better think of how to raise money to pick up the shares, yeah.Q:To pick up the shares. He told you that, right? And so his paragraph 2, first sentence is correct. How about the second sentence now, because earlier you also said that was incorrect. I will give you another chance. He also raised: \"The other issue is margin for the remaining tenure of the contracts.” Do you want to think about this again and see whether he may have raised the issue of margin for the remaining tenure of the contracts?A:I, quite frankly --Q:Can't remember?A:-- I can't remember because the margin is something that I'm not -- I'm not familiar with.Q:But it is possible that he raised an issue with you on the margin for the remainder tenure of the contracts? \"Contracts\" meaning the unauthorised transactions. Correct? Right?A:It's possible.Q:It's possible, right. So you have confirmed that he spoke to you about the near term issue of funds, to pick up shares due under the unauthorised transactions; and he may have possibly spoken to you about the margin for the remaining tenure of the contracts. Correct? That's your evidence now.A:Correct.71     Critically, when I questioned the defendant regarding whether Mr Kwek had asked him whether he was denying the Disputed CE Accumulators, the defendant changed his mind and claimed that he could not recall whether this statement was made by him at the meeting on 20 November 2009. This contradicted the defendant’s earlier position in the affidavits he filed in these proceedings where he clearly denied that the statement was made at the 20 November 2007 meeting.Court:With the benefit of having looked over your transcript, as well as this, you are looking literally at paragraph 1, the last sentence. It was your evidence yesterday that Mr Paul Kwek did not press you as to whether you were denying and you said \"no\". Are you basically saying now that you could not recall whether that statement was made at that meeting?A:Yes, I couldn't recall.Q:Now, for that also you say you cannot recall: you are now confirming that?A:I can't recall, yes.72     The defendant’s evidence about the meeting on 20 November 2007 is contradictory. The defendant’s own emails of 21 November 2007 and 23 November 2007 support the plaintiff’s version of the events which took place at the meeting on 20 November 2007. Under cross-examination, the defendant suggested that Mr Kwek may have lied in his contemporaneous note of the meeting of 20 November 2007, in order to cover up for his employee. The bare assertion was not supported by any evidence.73     On 28 November 2007, the defendant attended a second meeting, this time with the plaintiff’s General Manager, Mr Jean Luc Anglada (“Mr Anglada”) and Mr Kwek. It is their evidence that the defendant also did not, at this meeting, deny that he gave instructions to the Relationship Manager to purchase the Disputed CE Accumulators. The defendant disputes this but in light of the evidence adduced, I accepted their account. There was no evidence to establish that Mr Anglada would, in addition to Mr Kwek, cover up for the Relationship Manager.The defendant’s equivocation in rejecting Disputed CE Accumulators74     On 5 December 2007, the defendant requested the plaintiff to provide him with the estimated costs of closing out the Disputed CE Accumulators. The plaintiff thereafter also provided the defendant with a summary of his accumulators in January 2008. They also made arrangements for the defendant to attend an analysts lunch meeting scheduled in February 2008 by the China Energy management.75     Given the defendant’s experience with accumulators, the question does arise as to what accounts for his equivocal conduct between 16 October and 5 December 2007 which marks the time between when he claims he first discovered the Disputed CE Accumulators and the time he requested information about closing out costs. If he were rejecting the Disputed CE Accumulators, what could account for his inaction - his payment of S$160,000 and his instructions, or knowing acquiescence in the sale of his previously acquired China Energy shares to pay for new China Energy shares under the Disputed CE Accumulators? Why did he not vigorously and unequivocally reject the Disputed CE Accumulators prior to or when he first met the plaintiff’s senior management on two separate occasions in November 2007?76     It was Mr Anglada’s evidence that the defendant could have, if he wished, mitigated his loss in the declining China Energy market price by selling off his acquired shares promptly and terminating the accumulator by paying the closing out costs. There are only two choices when the market price of the relevant share dives and continues a sustained dive below the forward price of the accumulator. Where the purchaser remains bullish about the underlying share, he may decide to retain the acquired shares, and continue to double up the shares he becomes obliged to acquire. Should the market price of the underlying share thereafter recover beyond the forward price, he can then sell his doubled share acquisitions at a profit. Alternatively, the purchaser can cut loss by selling all the shares acquired previously and promptly terminating the accumulator by paying the closing out costs. I accepted his evidence.77     In the light of Mr Anglada’s evidence as to the two available risk decisions, how is the defendant’s equivocation in the face of a declining China Energy share price consistent with my finding and decision? There were produced in evidence, some market analysts’ recommendations between October and December 2007 which projected a target price of the China Energy shares which was significantly higher than the Disputed China Energy Accumulators Knock-Out price. There was also evidence of the defendant’s prior decision with another earlier accumulator, the Second Noble Accumulator. The market price of Noble shares had fallen below the Second Noble Accumulator Forward Price for a number of days during which the defendant was obliged to double up his share acquisitions. However, thereafter the market price of Noble shares recovered and the Second Noble Accumulator was knocked-out some two months after it was established. The defendant had made a significantly larger profit when he later sold the Noble shares, including the doubled acquisitions during the Noble market share price downturn. If the defendant remained bullish about China Energy shares notwithstanding its share price decline in October 2007, this would explain his equivocation in neither clearly rejecting the Disputed CE Accumulators nor terminating them.78     What the defendant faced was the immediate pressure of the plaintiff’s margin calls and requests for additional security. The defendant’s equivocation as to the Disputed CE Accumulators during this period is consistent with a bullish expectation of recovery of the market price of China Energy shares. By his equivocation he was able to defer having to provide additional margin and security as pressed for by the bank. It was only by the time of the meeting of 5 December 2007 with the plaintiff’s senior managers that he appears to have ceased to be bullish about China Energy shares. He only then asked for an estimate of the closing out costs.79     He appears thereafter to have taken no further actions. Sometime in or around March 2008, the market price of the China Energy shares declined sharply. By way of a letter dated 14 March 2008, the plaintiff’s solicitors demanded that the defendant make payment to the plaintiff of the outstanding sum of S$4,125,745.00 which was due and owing to the plaintiff as of 6 March 2008 pursuant to the terms of the Disputed CE Accumulators.80     As the defendant had not made any payment, the plaintiff exercised its rights under the contractual documents and closed out the Disputed CE Accumulators from 10 April to 21 April 2008 and set-off the funds in the defendant’s account towards payment of the outstanding sum due under the Disputed CE Accumulators.81     On or around 27 May 2009, the plaintiff issued a conclusive certificate of indebtedness (see[22]above) certifying that the outstanding sum (including interest) due and owing from the defendant to the plaintiff as of 29 August 2008 was S$6,459,519.83. This sum consisted of:(a)S$2,782,803.66 for the China Energy shares delivered pursuant to the terms of the Disputed CE accumulators and which was paid by the Plaintiffs to the counterparties;(b)S$3,625,393.11 which the plaintiff paid to the counterparties to close-out the Third to Seventh China Energy Accumulators; and(c)interest of S$51,323.06 as of 29 August 2008.The plaintiff then brought the present action claiming these amounts against the defendant (see above at[3]).Conclusion82     In the light of the evidence and my findings, and in the totality of the prior and subsequent consistent conduct of the parties in relation to the Disputed CE Accumulators, I find that the defendant did instruct the Relationship Manager to purchase the Disputed CE Accumulators during the telephone conversations on 2 and 3 October 2007. It is not necessary to further deal with the plaintiff’s alternative submissions as to estoppel.83     I now return to the core question of law about private banking and sophisticated clients raised in[2]in the light of the relevant contractual documents and the evidence adduced in this dispute:When is a private bank acting as a trusted advisor of its client and when is it not?84     A private bank is not acting as a trusted advisor of its client when (a) its account opening form and Risk Disclosure Statement highlight to the client that he is responsible for the risks in his transactions and recommends that he takes advice from other professional advisers, including his accountants, lawyers and tax advisors, and further that the bank does not make recommendations or give advice and (b) this is borne out by the evidence of conduct.85     Judgment for the plaintiff. Costs are to be taxed or agreed.",
        "The defendant’s equivocation in rejecting Disputed CE Accumulators": "74     On 5 December 2007, the defendant requested the plaintiff to provide him with the estimated costs of closing out the Disputed CE Accumulators. The plaintiff thereafter also provided the defendant with a summary of his accumulators in January 2008. They also made arrangements for the defendant to attend an analysts lunch meeting scheduled in February 2008 by the China Energy management. 75     Given the defendant’s experience with accumulators, the question does arise as to what accounts for his equivocal conduct between 16 October and 5 December 2007 which marks the time between when he claims he first discovered the Disputed CE Accumulators and the time he requested information about closing out costs. If he were rejecting the Disputed CE Accumulators, what could account for his inaction - his payment of S$160,000 and his instructions, or knowing acquiescence in the sale of his previously acquired China Energy shares to pay for new China Energy shares under the Disputed CE Accumulators? Why did he not vigorously and unequivocally reject the Disputed CE Accumulators prior to or when he first met the plaintiff’s senior management on two separate occasions in November 2007? 76     It was Mr Anglada’s evidence that the defendant could have, if he wished, mitigated his loss in the declining China Energy market price by selling off his acquired shares promptly and terminating the accumulator by paying the closing out costs. There are only two choices when the market price of the relevant share dives and continues a sustained dive below the forward price of the accumulator. Where the purchaser remains bullish about the underlying share, he may decide to retain the acquired shares, and continue to double up the shares he becomes obliged to acquire. Should the market price of the underlying share thereafter recover beyond the forward price, he can then sell his doubled share acquisitions at a profit. Alternatively, the purchaser can cut loss by selling all the shares acquired previously and promptly terminating the accumulator by paying the closing out costs. I accepted his evidence. 77     In the light of Mr Anglada’s evidence as to the two available risk decisions, how is the defendant’s equivocation in the face of a declining China Energy share price consistent with my finding and decision? There were produced in evidence, some market analysts’ recommendations between October and December 2007 which projected a target price of the China Energy shares which was significantly higher than the Disputed China Energy Accumulators Knock-Out price. There was also evidence of the defendant’s prior decision with another earlier accumulator, the Second Noble Accumulator. The market price of Noble shares had fallen below the Second Noble Accumulator Forward Price for a number of days during which the defendant was obliged to double up his share acquisitions. However, thereafter the market price of Noble shares recovered and the Second Noble Accumulator was knocked-out some two months after it was established. The defendant had made a significantly larger profit when he later sold the Noble shares, including the doubled acquisitions during the Noble market share price downturn. If the defendant remained bullish about China Energy shares notwithstanding its share price decline in October 2007, this would explain his equivocation in neither clearly rejecting the Disputed CE Accumulators nor terminating them. 78     What the defendant faced was the immediate pressure of the plaintiff’s margin calls and requests for additional security. The defendant’s equivocation as to the Disputed CE Accumulators during this period is consistent with a bullish expectation of recovery of the market price of China Energy shares. By his equivocation he was able to defer having to provide additional margin and security as pressed for by the bank. It was only by the time of the meeting of 5 December 2007 with the plaintiff’s senior managers that he appears to have ceased to be bullish about China Energy shares. He only then asked for an estimate of the closing out costs. 79     He appears thereafter to have taken no further actions. Sometime in or around March 2008, the market price of the China Energy shares declined sharply. By way of a letter dated 14 March 2008, the plaintiff’s solicitors demanded that the defendant make payment to the plaintiff of the outstanding sum of S$4,125,745.00 which was due and owing to the plaintiff as of 6 March 2008 pursuant to the terms of the Disputed CE Accumulators. 80     As the defendant had not made any payment, the plaintiff exercised its rights under the contractual documents and closed out the Disputed CE Accumulators from 10 April to 21 April 2008 and set-off the funds in the defendant’s account towards payment of the outstanding sum due under the Disputed CE Accumulators. 81     On or around 27 May 2009, the plaintiff issued a conclusive certificate of indebtedness (see[22]above) certifying that the outstanding sum (including interest) due and owing from the defendant to the plaintiff as of 29 August 2008 was S$6,459,519.83. This sum consisted of: (a)S$2,782,803.66 for the China Energy shares delivered pursuant to the terms of the Disputed CE accumulators and which was paid by the Plaintiffs to the counterparties;(b)S$3,625,393.11 which the plaintiff paid to the counterparties to close-out the Third to Seventh China Energy Accumulators; and(c)interest of S$51,323.06 as of 29 August 2008.The plaintiff then brought the present action claiming these amounts against the defendant (see above at[3]).Conclusion82     In the light of the evidence and my findings, and in the totality of the prior and subsequent consistent conduct of the parties in relation to the Disputed CE Accumulators, I find that the defendant did instruct the Relationship Manager to purchase the Disputed CE Accumulators during the telephone conversations on 2 and 3 October 2007. It is not necessary to further deal with the plaintiff’s alternative submissions as to estoppel.83     I now return to the core question of law about private banking and sophisticated clients raised in[2]in the light of the relevant contractual documents and the evidence adduced in this dispute:When is a private bank acting as a trusted advisor of its client and when is it not?84     A private bank is not acting as a trusted advisor of its client when (a) its account opening form and Risk Disclosure Statement highlight to the client that he is responsible for the risks in his transactions and recommends that he takes advice from other professional advisers, including his accountants, lawyers and tax advisors, and further that the bank does not make recommendations or give advice and (b) this is borne out by the evidence of conduct.85     Judgment for the plaintiff. Costs are to be taxed or agreed.",
        "Conclusion": "82     In the light of the evidence and my findings, and in the totality of the prior and subsequent consistent conduct of the parties in relation to the Disputed CE Accumulators, I find that the defendant did instruct the Relationship Manager to purchase the Disputed CE Accumulators during the telephone conversations on 2 and 3 October 2007. It is not necessary to further deal with the plaintiff’s alternative submissions as to estoppel. 83     I now return to the core question of law about private banking and sophisticated clients raised in[2]in the light of the relevant contractual documents and the evidence adduced in this dispute: When is a private bank acting as a trusted advisor of its client and when is it not? 84     A private bank is not acting as a trusted advisor of its client when (a) its account opening form and Risk Disclosure Statement highlight to the client that he is responsible for the risks in his transactions and recommends that he takes advice from other professional advisers, including his accountants, lawyers and tax advisors, and further that the bank does not make recommendations or give advice and (b) this is borne out by the evidence of conduct. 85     Judgment for the plaintiff. Costs are to be taxed or agreed."
    }
}