{
    "case_title": "Thumb (China) Holdings Group Ltd (in liquidation)\n      v\n      Hero Key Ltd",
    "ncitation": "[2010] SGHC 246",
    "coram": "Woo Bih Li J",
    "sections": {
        "Introduction": "1       Thumb (China) Holdings Group Limited\n                    (“Thumb”) is an investment holding company incorporated in the\n                    British Virgin Islands (“BVI”). It filed the present action for a\n                    declaration that on a true and proper construction of a Deed of Release dated\n                    23 September 2009 (“the Deed of Release”) entered into\n                    between Thumb and Hero Key Limited (“Hero Key”), a company\n                    incorporated in Hong Kong, Hero Key is under an obligation to take all necessary\n                    steps to effect the release of a share charge dated 13 March 2008\n                    (“the Share Charge”) in respect of 138,235,390 shares in Radiance\n                    Group Limited, formerly known as Radiance Electronics Limited\n                    (“Radiance”) including, by itself or by instructing its depository\n                    agent Philip Securities Pte Ltd (“Philip Securities”) the\n                    execution of a form, referred to as Form L, with The Central Depository\n                    (Pte) Ltd (“CDP”) and also for consequential orders. After hearing\n                    arguments, I made the substantive declaration sought, with Philip Securities to\n                    execute Form L as Hero Key’s depository agent and consequential\n                    orders.",
        "The court’s reasons": "2       Thumb is wholly owned by Sun Jiangrong\n                    (“SJR”) who is also the sole director of Thumb. Thumb’s\n                    major asset is its interest in 138,235,390 shares in Radiance (“the\n                    Radiance Shares”) which represents 52.41% of the issued capital of\n                    Radiance. Radiance is a company listed on the mainboard of the Singapore Stock\n                    Exchange. 3       Hero Key is owned and was controlled by\n                    SJR’s brother Sun Shao Feng. 4       On 13 August 2007, a Notes Trust Deed was\n                    entered into between Thumb (previously known as Sino Fortune Union Investment\n                    Limited) of the first part, SJR of the second part, and The Bank of New York\n                    Mellon (“BNYM”) (previously known as The Bank of New York), as\n                    trustee of the notes of the third part (the “Notes Trust Deed”).\n                    The Notes Trust Deed was subsequently amended and restated by an Amendment and\n                    Accession Deed dated 5 March 2008 (the “Amendment and Accession\n                    Deed”). Pursuant to the terms of the Notes Trust Deed, Thumb issued notes\n                    (“the Notes”) to noteholders in the aggregate principal amount of\n                    S$120 million. Under the terms of the Notes Trust Deed, Thumb was scheduled to\n                    repay the principal amount outstanding under the Notes on 15 February\n                    2009. 5       Subsequently, by a loan agreement entered into\n                    between Thumb and Hero Key dated 13 March 2008 (“the Loan\n                    Agreement”), Hero Key was said to have made available to Thumb a loan of\n                    HK$180 million. 6       Pursuant to the terms of the Loan Agreement,\n                    Thumb executed the Share Charge in favour of Hero Key over the Radiance Shares\n                    as security for the loan granted by Hero Key to Thumb under the Loan\n                    Agreement. 7       The Share Charge was registered in the Register\n                    of Corporate Affairs of the BVI (“the BVI Share Register”) a year\n                    later on 20 March 2009 and endorsed in the register of charges maintained\n                    with CDP by the lodgement of the relevant executed form with CDP. 8       On 14 August 2009, an action was commenced\n                    by BNYM against Thumb and Hero Key in Suit 703/2009/Y (“Suit 703”)\n                    in Singapore. On 24 August 2009, upon the application of BNYM made by way\n                    of ex-parte Summons No 4455 of 2009/G filed on 21 August 2009, an interim\n                    injunction was granted against Thumb and Hero Key (the “24 August 2009\n                    Order”). Pursuant to the 24 August 2009 Order, it was ordered that\n                    Thumb and Hero Key by themselves, their officers, employees, servants and/or\n                    agents or otherwise howsoever be restrained from effecting a transfer of the\n                    Radiance Shares to Hero Key or any other party, or otherwise dealing with the\n                    same, until further order or the final determination of the action in Suit\n                    703. 9       On 1 October 2009, BNYM filed a statement\n                    of claim in Suit 703 against Thumb and Hero Key, alleging,inter alia, that the entry into the Loan Agreement and the\n                    issuance of the Share Charge was in breach of certain covenants in the Notes\n                    Trust Deed. BNYM sought,inter alia, a declaration\n                    that the Share Charge was void and/or unenforceable. 10     Subsequent to the 24 August 2009 Order,\n                    Thumb and Hero Key executed the Deed of Release on 23 September 2009\n                    pursuant to which Hero Key released the Share Charge. The Deed of Release was\n                    prepared by Hero Key’s solicitors, Yeo-Leong & Peh LLC\n                    (“YLP”). 11     On 2 October 2009, upon compliance with\n                    the requirements under the laws of the BVI for a cessation of charge, the Share\n                    Charge was deregistered from the BVI Share Register, with the knowledge and\n                    consent of Hero Key. 12     On 3 November 2009, Christopher Stride,\n                    Cosimo Borrelli and Hamish Christie were appointed as joint and several\n                    liquidators of Thumb by an order of court of the Eastern Caribbean Supreme Court\n                    of BVI. 13     Pursuant to s 130N of the Companies Act\n                    (Cap 50, 2006 Rev Ed in Singapore), a discharge of a charge over\n                    shares effected by endorsement of the charge against the subject shares\n                    registered with CDP is effected by a cancellation of the endorsement of the\n                    charge against the shares in the register of charges and in the account of the\n                    chargor. Section 130N of the Companies Act read with Reg 23 of the Companies\n                    (Central Depository System) Regulations provides that the said cancellation is\n                    effected by the execution and lodgement of Form L with the CDP. Form L\n                    can only be executed by the chargee or its depository agent. Accordingly, in the\n                    present instance, Hero Key or its depository agent, Philip Securities would have\n                    to execute and lodge Form L with CDP to effect the cancellation of the\n                    endorsement of the Share Charge. 14     Accordingly, following the liquidators’\n                    appointment, the liquidators’ solicitors, Tan Kok Quan Partnership\n                    (“TKQP”) wrote to Hero Key’s solicitors, YLP on\n                    10 December 2009 to request that Hero Key execute Form L. A\n                    Form L, with the particulars of Thumb filled in, was enclosed with the\n                    letter. It was also stated that for the avoidance of doubt, the liquidators made\n                    no admission as to the validity of the Share Charge, the Deed of Release\n                    (described as Discharge of Charge in the letter) or the debt the Share Charge\n                    purported to secure. The liquidators said that they could not admit to the said\n                    matters as they were the subject matter of Suit 730 and were matters that needed\n                    to be investigated by the liquidators in discharge of their duties. Further,\n                    since these transactions preceded the liquidators appointment, the liquidators\n                    said they were not bound by them or any admissions made therein. The\n                    liquidators’ position was therefore reserved. 15     In reply, YLP wrote to TKQP on\n                    21 December 2009, stating,inter alia, that\n                    TKQP’s letter dated 10 December 2009 insinuated that the Share Charge\n                    and the underlying debt were invalid or improperly obtained/incurred and that\n                    this position was unacceptable to Hero Key. YLP requested that the liquidators\n                    rectify their position by acknowledging the validity of the Share Charge and the\n                    underlying debt before parties proceeded further in the matter. YLP also\n                    requested for a copy of the document described as ‘Discharge of\n                    Charge’ in TKQP’s letter dated 10 December 2009. 16     TKQP replied to YLP on 22 December 2009\n                    (the letter is incorrectly dated 10 December 2009) stating that the\n                    liquidators did not insinuate that the Share Charge and the underlying debt were\n                    void and/or unenforceable and that the liquidators were unable to take a\n                    position on such issues as they were matters that they had to examine. The\n                    letter also stated that positions taken by Thumb prior to the appointment of the\n                    liquidators did not bind the liquidators. 17     In the same letter, Hero Key was again\n                    requested to execute Form L. Hero Key was told that in light of the\n                    execution of the Deed of Release, the liquidators had reasonably assumed and\n                    were entitled to say that Hero Key would execute Form L in performance of\n                    the Deed of Release. 18     The liquidators said that they were\n                    subsequently given to understand that Philip Securities would not execute\n                    Form L without a variation of the 24 August 2009 Order (made in the\n                    suit commenced by BNYM) to allow for the same. Accordingly, the liquidators, on\n                    behalf of Thumb, made an application by way of Summons 339/2010/T on\n                    22 January 2010 for the 24 August 2009 Order to be varied to allow for\n                    all necessary steps to be taken to perform the Deed of Release and discharge the\n                    Share Charge, including the execution of Form L by Philip\n                    Securities. 19     On 5 February 2010, Hero Key’s\n                    counsel, Mr Kenny Chooi, said to the court hearing the variation\n                    application that Hero Key was not objecting to the application to vary without\n                    any admission to the allegations made by the liquidators. Accordingly, the court\n                    granted an order in terms of the liquidators’ application on\n                    5 February 2010 (“the 5 February 2010 Order”) thereby\n                    varying the 24 August 2009 Order such that Thumb and Hero Key, by\n                    themselves, their officers, employees, servants and/or agents, including Philip\n                    Securities, were granted liberty to take any necessary action required for the\n                    discharge of the Share Charge including and without limitation the execution of\n                    documents to effect the same with CDP. 20     Following the making of the 5 February\n                    2010 Order, the liquidators requested Philip Securities to execute Form L\n                    by a letter from TKQP dated 12 February 2010. The letter was copied to YLP\n                    and enclosed a copy of the 5 February 2010 Order and TKQP’s letter to\n                    YLP dated 10 December 2009. 21     However, Philip Securities declined to execute\n                    Form L unless it received instructions to do so from Hero\n                Key. 22     Accordingly, TKQP wrote to YLP on\n                    17 February 2010, pointing out that the 24 August 2009 Order has been\n                    varied by the 5 February 2010 Order to allow for the discharge of the Share\n                    Charge and requested that Hero Key and/or its depository agent execute\n                    Form L within seven days from the date of the letter. It was reiterated\n                    that Form L had been forwarded to YLP for Hero Key’s execution as\n                    Hero Key had executed the Deed of Release and the liquidators had reasonably\n                    assumed and were entitled to therefore say that Hero Key would execute and/or\n                    instruct its depository agent to execute Form L to implement the covenants\n                    in the Deed of Release. YLP’s response, which is discussed in the next\n                    paragraph, did not deny or take issue with this. 23     On 25 February 2010, YLP replied pointing\n                    out that the name of the chargor had been spelt incorrectly in the copy of\n                    Form L which had been forwarded to YLP under cover of TKQP’s letter\n                    dated 10 December 2010,ie, two and a half\n                    months earlier. 24     TKQP then forwarded Form L, duly\n                    corrected, to YLP under cover of their letter dated 4 March 2010. In the\n                    same letter, Hero Key was requested to arrange for the execution of Form L\n                    without delay as the matter had been outstanding for a long time. The urgency\n                    stemmed from an imminent sale of the Radiance Shares by the\n                liquidators. 25     In response, by a letter dated 8 March\n                    2010 from YLP, Hero Key took several positions. The liquidators summarised the\n                    positions as follows. First, Hero Key asserted for the first time that it was\n                    under no legal obligation to execute and lodge Form L. This was the first\n                    unequivocal indication that Hero Key would not do so. Secondly, Hero Key\n                    asserted, again for the first time, that the liquidators’ expectation that\n                    Hero Key would execute and lodge Form L was not reasonable and did not give\n                    rise to a cause of action. Thirdly, Hero Key took the position that it might not\n                    be in a position to sign Form L as the Radiance Shares were not registered\n                    under its name. The liquidators were therefore told to liaise with Philip\n                    Securities with regard to the execution of Form L. 26     By their letter dated 10 March 2010, TKQP\n                    said that Philip Securities would require direct instructions from YLP or Hero\n                    Key before Philip Securities would proceed to execute Form L. YLP was\n                    therefore requested to instruct Philip Securities to execute Form L and to\n                    forward TKQP a copy of the written instructions to Philip Securities as soon as\n                    possible, latest by 12 March 2010. TKQP did not receive any response from\n                    YLP. 27     The liquidators then filed an application in\n                    Summons 1191 of 2010 in Suit 703 for Hero Key and/or its agents to take all\n                    necessary steps to discharge the Share Charge. However, the application was not\n                    successful because of procedural objections which I need not elaborate\n                    on. 28     Eventually, the liquidators had to resort to\n                    the present action. 29     It appeared that Hero Key refused to\n                    co-operate because the liquidators had not admitted the validity of the\n                    underlying loan which gave rise to the creation of the Share\n                Charge. 30     Hero Key sought to justify its position by\n                    pointing out that the Deed of Release was executed gratuitously,ie, Hero Key did not receive any payment for the same.\n                    This was irrelevant since there was no issue of absence of consideration as the\n                    instrument was a deed. 31     Secondly, Hero Key pointed out that there was\n                    no express provision in the Deed of Release requiring it or its agent to execute\n                    Form L. While that was true, the liquidators were relying on an implied\n                    undertaking or obligation of Hero Key for Hero Key or its agent to do\n                so. 32     Thirdly, Hero Key pointed out that the\n                    omission to execute Form L did not deprive the Deed of Release of all\n                    validity. Thumb had been released from various obligations under the Share\n                    Charge and Hero Key would not be able to enforce its power of sale over the\n                    Reliance Shares. 33     It seemed to me that this submission\n                    reinforced the liquidators’ position. Hero Key was not disputing that the\n                    charge was released. However, it refused to give full effect to the release by\n                    refusing to execute Form L or to give instructions to Philips Securities to\n                    do so. 34     Hero Key said that it was for the liquidators\n                    to take a more conciliatory approach towards it to win its co-operation, citing\n                    the case ofBee See & Tay v Ong Hun Seang[1997] 1 SLR(R) 469. 35     As for the variation of the 24 August 2009\n                    Order by the 5 February 2010 Order, Hero Key took the position that the\n                    variation was permissive only and did not compel Hero Key to execute or procure\n                    the execution of Form L. 36     In my view, Hero Key’s position was\n                    untenable. The case it relied on was based on materially different facts. The\n                    defendant there was under no obligation to do as the plaintiffs sought. That was\n                    why the plaintiffs there ought to have adopted a less combative\n                stance. 37     In the present case, the issue was whether\n                    Hero Key was obliged to execute or procure the execution of Form L. If it\n                    was so obliged, there was no need for the liquidators to take a more\n                    conciliatory approach. 38     I was of the view that as a matter of\n                    commercial efficacy, it must be implied that Hero Key would do all that was\n                    reasonably necessary to give full effect to the very substance under the Deed of\n                    Release,ie, the release of the\n                charge. 39     Furthermore, I was of the view that Hero Key\n                    was estopped from refusing to co-operate as it had by its conduct,ie, its omission to object to the variation of the\n                    24 August 2009 Order led the court and Thumb to believe that it would\n                    execute or procure the execution of Form L even though the variation order\n                    did not specifically direct it to do so. I should, however, add that the\n                    liquidators did not rest their case primarily on estoppel in order to avoid any\n                    suggestion that there was a dispute of fact which might require a\n                trial. 40     In the circumstances, I made the substantive\n                    declaration sought, with Philip Securities to execute Form L as Hero\n                    Key’s depository agent, and consequential orders which included costs\n                    against Hero Key. It then filed an appeal against my decision which it withdrew\n                    prior to the finalisation of my grounds of decision."
    }
}