{
    "case_title": "Mohamed Amin bin Mohamed Taib and others\n      v\n      Lim Choon Thye and others",
    "ncitation": "[2010] SGHC 341",
    "coram": "Judith Prakash J",
    "sections": {
        "Introduction": "1       The substantive issue in Originating Summons 17\n                    of 2008 (“OS 17/2008”) was the plaintiffs’ appeal to have a\n                    decision of the Strata Titles Board (“the Board”) set aside and to\n                    have their original application for approval of the collective sale of the\n                    condominium development known as Regent Court (Strata Title Plan No 866\n                    comprised in Land Lot Mukim 17-5574T) remitted to the Board for a fresh\n                    decision. On 30 October 2008, I heard the appeal and granted the orders\n                    sought. I ordered the Board to decide who should bear the costs of the earlier\n                    hearing before it after it had completed the proceedings. I then adjourned the\n                    question of the costs of the appeal to a later date. 2       Pursuant to my order of 30 October 2008,\n                    the Board recommenced hearing the plaintiffs’ application for approval of\n                    the proposed collective sale on 18 March 2009. By that time, however, new\n                    information had come to light: the agreement relating to the collective sale\n                    (“the SPA”) had not, in fact, been stamped. The Board learnt of\n                    this from a letter sent (without prior request or prompting) by the Inland\n                    Revenue Authority of Singapore (“IRAS”) dated 4 December\n                    2008; they then brought the letter’s contents to the parties’\n                    attention. The parties made an attempt to settle the matter but were\n                    unsuccessful. On 23 March 2009, the Board gave the parties one final\n                    opportunity to have the SPA stamped; alternatively, they were to make one final\n                    attempt at arriving at a settlement. On 24 March, though, the SPA remained\n                    unstamped and no settlement had been arrived at. The Board then dismissed the\n                    plaintiffs’ application for approval of the collective sale on the ground\n                    that neither side would have been able to discharge their burden of proof\n                    without making reference to the SPA which, being unstamped, could not be\n                    admitted as evidence before the Board. It also directed parties to bear their\n                    own costs. On 27 July 2009, the seventh and eighth defendants filed Summons\n                    No 3938 of 2009 (“Sum 3938/2009”) to have my decision of\n                    30 October 2008 set aside on the basis of the non-stamping of the SPA.\n                    Woo J heard the matter and dismissed the application on 18 August\n                    2010. The seventh and eight defendants were ordered to pay the plaintiffs their\n                    costs in defending Sum 3938/2009. 3       On 22 July 2010, parties returned before me\n                    to address the question of costs awardable on the outcome of OS 17/2008. It was\n                    no surprise, in light of the previous cost orders made by the STB and by\n                    Woo J in Sum 3938/2009, that the arguments before me were hard-fought and\n                    fraught – doubtlessly, the defendants felt hard done by when they were\n                    required to bear their own and the plaintiffs’ costs in the STB\n                    proceedings and Sum 3938/2009 respectively. Nevertheless – as the\n                    plaintiffs were quick to remind me – the default position in law is that\n                    costs follow the event: see O 59 r 3(2) of the Rules of Court\n                    (Cap 322, Rule 5, 2006 Rev Ed). For all that happened after\n                    30 October 2008, the fact remained that the plaintiffs had succeeded on\n                    their substantive application before me in OS 17/2008; they were entitled,\n                    therefore, to their costs unless it could be shown that the circumstances of the\n                    case justified an order otherwise.",
        "The Parties’ Submissions": "4       Costs are awarded at the court’s\n                    discretion; nevertheless, as I have already mentioned, the general rule is that\n                    cost should follow the event unless it appears to the court that in the\n                    circumstances of the case some other order should be made or that there are\n                    special reasons for depriving the successful litigant of his costs in part or in\n                    full: O 59 r 3(2);Tullio Planata v Maoro Andrea\n                        G[1994] 2 SLR(R) 501 (“Tullio”); andHo Kon Kim v Lim Gek Kim\n                        Betsy and others and another appeal[2001]\n                    3 SLR(R) 253. These reasons may arise from the conduct of all the\n                    parties, both from before and during the proceedings: O 59 r 5(1)(b).\n                    They would include the conduct of any party in raising unnecessary claims or\n                    issues and in unreasonably or improperly acting or omitting to act in such a way\n                    as to save costs: O 59 r 6A(1) and r 7,\n                respectively. 5       It was submitted by Mr Low on behalf of the\n                    plaintiffs that the only special reason that might justify depriving a\n                    successful party of its costs would be if that party had acted either improperly\n                    or unreasonably:Singapore Civil Procedure 2007(GP Selvam ed-in-chief) (Singapore Sweet & Maxwell Asia, 2007), at\n                    para 59/3/7. In this case, the plaintiffs did neither. They alleged that it\n                    was the defendants – in particular the eight defendant – who made\n                    factual allegations that sought to discredit the plaintiffs and their\n                    solicitors, failed to address the relevant point of law before the court, and\n                    who made procedural errors that unnecessarily complicated the plaintiffs’\n                    response and preparation for the appeal in OS 17/2008. Thus, any wasted time and\n                    costs arose out of the defendants’ conduct and the plaintiffs could not be\n                    said to be disentitled to their costs. 6       However, Mr Singh (for the first to sixth\n                    defendants) submitted that it was more appropriate in this case for no order to\n                    be made as to costs. He relied on three main grounds for this submission: first,\n                    he pointed out that the plaintiffs were being maintained in this action by a\n                    non-party (the purchaser’s property agent who was responsible for\n                    arranging the collective sale). To award the plaintiffs costs would amount,\n                    therefore, to awarding them a bonus. His second point was that the issue raised\n                    in OS 17/2008 dealt with a legal question that was both novel and of general\n                    interest and, as a result, the defendants should not be made to bear the\n                    plaintiffs’ costs in the appeal. Finally, he argued that the defendants\n                    had already been deprived of costs by the STB on two previous occasions. The\n                    court should, he argued, take note of this fact in deciding the appropriate\n                    costs order in OS 17/2008. 7       Mr Rai, who was the eight defendant and who\n                    argued on behalf of himself and the seventh defendant, submitted that the\n                    plaintiffs should not merely be deprived of their costs but have costs ordered\n                    against them as well. I shall be considering Mr Rai’s arguments in\n                    greater detail below. For now, it suffices to summarise his arguments thus: that\n                    it was the plaintiffs’ failure to ensure that the SPA had been duly\n                    stamped and failure to disclose this fact earlier that caused parties to waste\n                    much time and effort in addressing a futile case. For that reason, they should\n                    be deprived of their costs and ordered to pay costs to the defendants\n                    instead. 8       Mr Cheong, for the ninth and tenth\n                    defendants, also asked that no order be made as to costs. He supplemented\n                    Mr Rai’s submissions with reference to ss 42 and 63 of the Stamp\n                    Duties Act (Cap 312, 2006 Rev Ed) (“the Act”) –\n                    arguing that the failure to procure the stamping of the SPA amounted to an\n                    offence under the Act and this was conduct that the court could and would take\n                    into consideration in assessing costs. As for the question of maintenance: while\n                    Mr Cheong acknowledged that plaintiffs were not being maintained by a third\n                    party in the technical sense of the word, he argued that where a successful\n                    plaintiff had agreed with his solicitor not to pay the latter any costs for\n                    conducting the action on his behalf, that plaintiff would be precluded from\n                    recovering costs from the other side. Again, the details of this argument will\n                    be considered below.",
        "The Issues": "9       I do not accept Mr Singh’s\n                    submissions concerning the (supposed) novelty of the point of law raised in OS\n                    17/2008 relevant to the question of costs before me; nor do I accept his\n                    submission concerning the defendants’ (alleged) deprivation of costs in\n                    the hearing before the STB. Both arguments seem to me to have no impact on the\n                    question of whether the plaintiffs are entitled to costs following their success\n                    in OS 17/2008. The complaint about deprivation of costs, in particular, is one\n                    that should be taken up before the STB itself. This is not the forum for it and\n                    it evidently has no bearing on the costs of OS 17/2008. 10     There are, however, two issues raised that\n                    – to my mind – may have an impact on the plaintiffs’\n                    entitlement to costs. These are: (a)     The non-stamping of the SPA;\n                        and (b)     The nature\n                        of the fee-paying arrangement between the plaintiffs and their\n                        solicitors. I shall address them in turn.",
        "The failure to procure stamping of the SPA": "11     As mentioned, it was Mr Rai who first\n                    raised the fact of the SPA’s non-stamping as a relevant consideration to\n                    the plaintiffs’ entitlement to costs. InTullio, the Singapore Court of Appeal, at [24], endorsed the\n                    headnote from the English Court of Appeal decision inRe\n                        Elgindata Ltd (No 2)[1992] 1 WLR 1207 as accurately\n                    summarising the relevant principles governing the award of costs: ... The principles on which costs were to be awarded were (i) that costs\n                        were in the discretion of the court, (ii) that costs should follow the event\n                        except when it appeared to the court that in the circumstances of the case\n                        some other order should be made, (iii) that the general rule did not cease\n                        to apply simply because the successful party raised issues or made\n                        allegations that failed, but thathe could be deprived of\n                            his costs in whole or in part where he had caused a significant increase\n                            in the length of the proceedings, and (iv) thatwhere the successful party raised issues or made allegations\n                            improperly or unreasonably the court could not only deprive him of his\n                            costs but could also order him to pay the whole or part of the\n                            unsuccessful party’s costs. The fourth principle\n                        implied, moreover, that a successful party who neither improperly nor\n                        unreasonably raised issues or made allegations which failed ought not to be\n                        ordered to pay any part of the unsuccessful party’s costs... [emphasis added] According to Mr Rai, the plaintiffs’ failure to ensure that\n                    the SPA had been duly stamped and their failure to disclose this fact earlier\n                    caused a significant increase in the length of the proceedings. He argued that\n                    the plaintiffs’ arguments in OS 17/2008 had been made improperly and\n                    unreasonably as they were, in the end, entirely futile. As the SPA had not been\n                    stamped, it could not be used before the STB as evidence and without it being in\n                    evidence, the plaintiffs could not proceed with their application for collective\n                    sale. Thus, he submitted, principles (iii) and (iv) fromTulliojustified depriving the plaintiffs of their costs and\n                    ordering that costs should be paid to the defendants instead. 12     Mr Cheong’s argument on the\n                    relevancy of the non-stamping of the SPA to the question of costs was couched in\n                    more subtle terms. Section 42 of the Act states that “all instruments\n                    chargeable with duty and executed by any person in Singaporeshallbe stamped before being executed [emphasis added].”\n                    The use of “shall” implies a positive duty to ensure that a\n                    document (such as the SPA) is properly stamped, while s 63 goes further to\n                    provide that: Any person who – (a)    having drawn, made, executed or signed, otherwise\n                            than as a witness, any instrument that is chargeable with duty without\n                            the instrument being duly stamped and fails, without lawful excuse toprocure the due stamping of the\n                                instrumentwithin the time within which the instrument\n                            may be stamped without penalty under this Act... shall be guilty of an offence and shall be liable on conviction to a fine\n                        not exceeding $1,000. [emphasis added] The plaintiffs’ failure to procure the stamping of the SPA\n                    amounted, therefore, to an offence under the Act and, according to\n                    Mr Cheong, a court could not and should not ignore that fact. Where a\n                    party’s failure to fulfil a statutory duty would have disposed of an\n                    appeal one way or the other, a court should take such conduct into consideration\n                    by denying them costs. The entire purpose of introducing the SPA as evidence\n                    before the STB (and indeed, its entire purpose when it was referred to in OS\n                    17/2008) was to demonstrate the purchaser’s intention to proceed with the\n                    sale; thus, the fact that it was not stamped was evidence to the contrary. Had\n                    the intention not to proceed with completion been known at either the STB\n                    hearing or the hearing of OS 17/2008, the plaintiff’s application in the\n                    former would have been dismissed out of hand and the latter would never have\n                    been pursued. 13     Mr Low’s responses to the arguments\n                    above canvassed several points previously made before Woo J at the hearing\n                    for Sum 3938/2009. First, he argued that there was no duty or obligation on the\n                    plaintiff to ensure that the SPA had been stamped. Section 34(a) of the Act\n                    – in conjunction with the Third Schedule – made it clear that the\n                    stamp duty in conveyances such as this was to be borne by the transferee or\n                    purchaser. The plaintiffs were under no duty to ensure that the purchaser\n                    complied with the purchaser’s own obligations under the statute; nor could\n                    they be faulted for having failed to check with the purchaser in order to\n                    establish whether the SPA had been stamped. Secondly, he reiterated that there\n                    was no basis to suggest that the plaintiffs concealed or were even aware of the\n                    fact that the SPA was unstamped. His third point was that the failure to\n                    disclose the non-stamping of the SPA earlier might not necessarily have obviated\n                    the need for the STB hearings or the hearing in OS 17/2008. Section 52(2)\n                    of the Act expressly allows unstamped documents to be admitted in evidence upon\n                    payment of the relevant duty and penalty under s 46 of the Act and this was\n                    precisely what the STB allowed the parties to do when the failure to stamp the\n                    SPA first became known. The Board only dismissed the application in March 2009\n                    when it became manifestly clear that the purchaser would not be rectifying the\n                    omission and having the documents stamped. The fact that the purchaser proved\n                    unwilling to stamp the SPA in 2009 did not necessarily mean that it would have\n                    been unwilling – if offered the opportunity – to stamp the SPA at an\n                    earlier point of time. It could not, therefore, be said that the hearings that\n                    proceeded on the basis of the SPA would have been obviated had the fact that the\n                    SPA was not stamped been known at an earlier stage. At the hearing of Sum\n                    3938/2009, Woo J accepted these arguments in rebuttal to the seventh and\n                    eighth defendants’ application to strike out my initial order in\n                    OS 17/2008. Mr Low, no doubt, hoped that they might have the same\n                    effect here. 14     Having considered the arguments, I am not\n                    inclined to agree with Mr Rai’s submissions on this issue. He argued\n                    that the plaintiffs acted improperly in failing to disclose that the SPA was\n                    unstamped and placed great reliance on the English Court of Appeal’s\n                    decision inGoodwood Recoveries Ltd v Breen; Breen v\n                        Slater[2006] 1 WLR 2723, where the third party’s\n                    conduct included (amongst other things) suppressing the disclosure of a key\n                    document. That conduct was held sufficient to justify ordering the third party\n                    to pay all the costs of the action on an indemnity basis. However, I find this\n                    case to be of limited assistance to Mr Rai. InGoodwood, Rix LJ made it clear that it was the third\n                    party’sdishonest suppressionof a key\n                    document that justified the adverse order of costs. In sharp contrast, the\n                    plaintiffs have categorically denied any knowledge of the purchaser’s\n                    failure to stamp the SPA prior to 22 December 2008. They affirmed this in\n                    an affidavit filed by Mr Amin on 13 August 2009 and again through\n                    their solicitors at the hearing before me. As of 22 December 2008, the\n                    substantive appeal in OS 17/2008 had been both heard and disposed of.\n                    Mr Rai had, at the hearing of Sum 3938/2009 before Woo J, disputed the\n                    plaintiffs’ claim to ignorance, but at the hearing before me he appeared\n                    to accept that the worst that could be said is that the plaintiffs had been\n                    merely indifferent. It could hardly be argued, therefore, that the whole of the\n                    costs of the litigation in OS 17/2008 were caused by the plaintiffs’\n                    dishonesty, impropriety and exceptional conduct. The conduct of the plaintiffs\n                    in the present case was in no way on par with that of the third party inGoodwood. The plaintiffs cannot, therefore, be\n                    deprived of their costs in OS 17/2008 on the basis that they failed to disclose\n                    the failure to stamp the SPA. 15     I turn now to Mr Cheong’s\n                    submissions. As mentioned above, costs are awarded in exercise of the\n                    Court’s discretion: O 59 r 3(2). O 59 r 5 provides\n                    that in exercising that discretion, the Court shall “as may be\n                    appropriate in the circumstances, take into account... the conduct of all the\n                    parties, including conduct before, as well as during, the proceedings...”\n                    The Rules of Court identify particular kinds of conduct where a court should be\n                    more willing to deem costs unnecessarily incurred: see O 59 rr 6A and 7.\n                    However, as O 59 r 6A explicitly recognises, these are “[i]n\n                    addition to and not in derogation [from]” the basic principle stated in\n                    O 59 r 5 – namely, that in exercising his or her discretion as\n                    to the costs of any proceedings, a judge is entitled to consider any relevant\n                    aspect of the parties’ conduct whether such conduct occurred before or\n                    during the legal proceedings. 16     However, was the non-stamping of the SPA an\n                    aspect of the plaintiffs’ conduct at all? The immediate answer would\n                    appear to be “No”. The failure to stamp the SPA was a failure on\n                    the part of the purchaser and not the plaintiffs; concomitantly, any offence\n                    committed would have been committed by the purchaser and not the plaintiffs\n                    themselves. As Mr Low pointed out, s 34 of the Act (read with the\n                    Third Schedule) places the obligation to pay stamp duty on the transferee or\n                    purchaser in a conveyance; s 49 similarly provides that it is the person\n                    liable under the Third Schedule to pay stamp duty who is liable for any penalty\n                    arising from a failure to have the conveyance stamped on time. Section 63(a), on\n                    which Mr Cheong so heavily relies, then makes it an offence for any person\n                    who has drawn, made, executed or signed an instrument that is chargeable with\n                    duty to “[fail], without lawful excuse, to procure the due stamping of\n                    the said instrument within the [specified] time”. However, the act of\n                    paying stamp duty is inseparable from the act ofhavingan instrument stamped and this is especially true under\n                    the E-Stamping regimes established by ss 6B - 6D of the Act. While the language\n                    of procurement may at first sight seem broad, therefore, I find that in light of\n                    the cited provisions the duty to procure the due stamping of a conveyance in\n                    s 63(a) must be read as falling squarely on the person liable to pay the\n                    stamp duty under the Act. In this case, that would have been the purchaser\n                    – not the plaintiffs. There was therefore no illegal conduct on the part\n                    of the plaintiffs’ part that I (in the words of Mr Cheong)\n                    “cannot ignore” whilst exercising my discretion in order to\n                    determine the costs payable in OS 17/2008. 17     Having said as much, it is true that the\n                    plaintiffs were guilty of omitting to check if the purchasers had stamped the\n                    SPA before bringing their original application before the STB. It is also true\n                    that – as events turned out – if the SPA had been properly stamped\n                    or the fact of its non-stamping been discovered much earlier, costs could have\n                    been saved. And while Mr Low argued that the defendants could have taken\n                    the initiative to write to the IRAS or to the purchasers, the truth of the\n                    matter is that the plaintiffs were the parties best-placed to check on the\n                    status of the SPA and whether it had been stamped or not as they would have been\n                    in regular contact with the purchasers over the potential sale of the\n                    condominium. In my view this omission to check on the status of a document that\n                    they were signatories to and that they would, inevitably, have to rely on before\n                    the STB in order to make their application would and should constitute relevant\n                    conduct for the purposes of determining the appropriate order as to costs in OS\n                    17/2008. However, it is only one factor to be considered; it should not be given\n                    more weight than it deserves. 18     The non-stamping of the SPA was – as\n                    Woo J correctly observed at [15] of his judgment, in Sum 3938/2009 (found\n                    at [2009] SGHC 216) – a situation that could have been easily\n                    rectified at any time. It did not affect the essential validity of the document\n                    but merely rendered it inadmissible in evidence. Section 52(2) of the Act\n                    explicitly provides for admissibility upon payment of the stamp duty and any\n                    penalty. Thus, as Mr Low suggested, it is by no means evident that early\n                    discovery of the non-stamping of the SPA would have obviated the need for the\n                    STB proceedings and OS 17/2008. Had the non-stamping of the SPA been discovered\n                    in 2007 and the situation rectified, the STB application may have continued as a\n                    matter of course with nothing more than a slight delay. Mr Rai and\n                    Mr Cheong were wrong, therefore, to ascribe the causative significance that\n                    they did to the non-stamping of the SPA. 19     Even if Mr Rai and Mr Cheong were\n                    right – and proceedings before the STB and in OS 17/2008 could have been\n                    avoided entirely had the SPA’s non-stamping been discovered earlier\n                    – it is not clear whether this fact suffices on its own to deprive the\n                    plaintiffs of all their costs in OS 17/2008. There is also the defendants’\n                    own conduct to consider: in particular, the conduct of the seventh and eight\n                    defendants in filing Summons No 396 of 2008 and Sum No 3938/2008 to strike out\n                    the plaintiffs’ application in OS 17/2008 and set aside the outcome of the\n                    same. A glance at the history of OS 17/2008 would show that both these summonses\n                    were responsible in no small way for prolonging and complicating the\n                    proceedings. Summons No 396 of 2008 was fixed to be heard together with the\n                    substantive application in OS 17/2008 on 9 October 2008 for a full day. As\n                    a result of the extensive arguments canvassed in the Summons, though, I had to\n                    adjourn OS 17/2008 to be heard on 30 October 2008. That took another full\n                    day and left no time for the question of costs to be considered. Consequently,\n                    the latter was fixed to be heard on 10 July 2009. On 10 July 2009,\n                    however, it became clear that a further adjournment was necessary as the seventh\n                    defendants indicated that they intended to commence proceedings to set aside my\n                    original decision in OS 17/2008. The resulting Sum No 3938/2008 was originally\n                    fixed before me. I declined to hear it and it had to be adjourned once more\n                    before it was finally heard by Woo J on 11 and 18 August 2009. When\n                    the parties finally returned to argue the issue of costs before me on\n                    22 July 2010, therefore, more than 2 years had passed since OS 17/2008\n                    was filed on 7 January 2008. The sequence of events shows that some\n                    responsibility for this delay must lie at the defendants’\n                doors. 20     In conclusion, therefore, it was not the\n                    plaintiffs own conduct that led to the non-stamping of the SPA; nor was there\n                    any evidence that they knew, but dishonestly failed to disclose, the fact of the\n                    SPA’s non-stamping to the STB and the defendants. They may not be deprived\n                    of their costs in OS 17/2008 on these grounds. While the failure to check on the\n                    status of the SPA might constitute conduct relevant to my assessment of the\n                    amount of costs payable in OS 17/2008, it is conduct that must be weighed\n                    on its own merits and alongside the defendants’ own actions. In my view,\n                    the failure to check with the purchaser on the stamping of the SPA could justify\n                    a slight reduction in the costs awarded to the plaintiffs in OS 17/2008. It\n                    cannot, however, justify depriving them of their costs entirely.",
        "The plaintiffs’ fee-paying arrangement": "21     The second issue concerned the nature of the\n                    fee-paying arrangement between the plaintiffs and their solicitors.\n                    Mr Singh argued that since the plaintiffs’ appeal in OS 17/2008 was\n                    being maintained by a non-party to the litigation, the plaintiffs may rightly be\n                    deprived of the entirety of their costs. He pointed to the following three\n                    paragraphs from the second affidavit of Mr Mohamed Amin bin Mohamed Taib\n                    filed on 22 February 2008 in order to support his allegation of\n                    maintenance: 139    For completeness, the Sale Commitee has already\n                            explained in paragraph 5 of Ms Mok’s Affidavit thatthe legal fees for this Appeal and OS 103 are being paid by\n                                Mr Chew Lay Seong... of Eccoventure Pte Ltd, who is\n                            the property agent of the Purchaser. 140    The Sale Committee was in a difficult position as\n                            a result of the purported dissolution of the Sale Committee at the EOGM,\n                            and the Majority Owners’ obligation to prosecute this Appeal\n                            within the time period allowed in law. The Sale Committee had to\n                            urgently clarify its standing through OS 103 and to file the Appeal.\n                            However, we did not have the funds to do so. 141    As Mr Chew offered to pay for the legal fees\n                            incurred in the Appeal and OS 103, and we were advised that there is no\n                            conflict of interest, we therefore accepted Mr Chew’s\n                            offer. [emphasis added] According to Mr Singh, the fact that the legal fees were being\n                    paid for by Mr Chew indicated that the plaintiffs did not and would not\n                    themselves incur any legal fees in OS 17/2008. The rule at common law is that a\n                    litigant may not recover from the opposing litigant more than what he is liable\n                    to pay to his own solicitor in costs; in short, party and party costs are given\n                    in the character of an indemnity:Gundry v\n                        Sainsbury[1910] 1 KB 645, 649. Since the plaintiffs\n                    admitted that the fees for OS 17/2008 were being borne by a non-party, what they\n                    have indicated is that they would not be incurring any legal costs themselves.\n                    As a result, any costs paid to them by the defendants would not amount to\n                    compensation but a bonus instead. The plaintiffs should, therefore, be deprived\n                    of their costs in OS 17/2008 in their entirety. 22     Mr Cheong expanded on the arguments of\n                    Mr Singh: he pointed out that the mere fact that Mr Chew offered to\n                    pay the plaintiffs’ solicitors their legal fees would not necessarily\n                    amount to maintenance disentitling the plaintiffs to costs if the primary\n                    obligation to pay their solicitors lay with the plaintiffs. The losing party in\n                    litigation is obliged to pay such costs as the receiving party is primarily and\n                    potentially legally obliged to pay to his solicitor:Joyce v\n                        Kammac (1988) Ltd[1996] 1 All ER 923, 928. In\n                    most cases, that obligation would be set out in the written retainer. But where\n                    the retainer reflected an understanding between solicitor and client that the\n                    former would not look to the latter for their costs or fees (or where there was\n                    a verbal agreement to the same effect) the rule is that no party-and-party costs\n                    may be recovered: seeJoyce v Kammac, 928;\n                    Cozens-Hardy MR inGundry v Sainsbury, 649.\n                    The paragraphs in Mr Amin’s affidavit referred to by Mr Singh\n                    indicated that a non-party had undertaken to bear the legal costs of maintaining\n                    the action in OS 17/2008. In the absence of any evidence to the contrary, the\n                    existence of an agreement to look to Mr Chew for legal fees could be\n                    reasonably inferred. Mr Cheong accepted that the defendants will normally\n                    bear the burden of proving that such an agreement exists. However, he also\n                    submitted that the plaintiffs’ solicitors were – as officers of the\n                    court – obliged to disclose the true nature of the agreement between the\n                    plaintiffs and themselves. In the absence of such voluntary disclosure,\n                    Mr Amin’s affidavit (and the arrangement that it hints at) must be\n                    taken at face value and the plaintiffs must, as a result, be deprived of their\n                    costs. 23     Mr Low made no substantive reply to\n                    either Mr Singh or Mr Cheong’s submissions in his\n                    rebuttal. 24     Both Mr Singh and Mr Cheong rightly\n                    pointed out that party and party costs are given in the character of an\n                    indemnity. In other words, they are awarded to indemnify the successful party\n                    for the costs and expenses he has incurred in the litigation: Michael J\n                    Cook,Cook on Costs 2010(LexisNexis, 2009) at\n                    para 17.1. The indemnity is not complete, but it is an indemnity in this\n                    sense: namely, that costs between the parties can never exceed the solicitor and\n                    client costs. The receiving party cannot make a profit out of the costs\n                    recovered from the other party:Cook on Costsat\n                    para 17.2. The principle finds its earliest expression inHarold v Smith(1860)\n                    5 H & N 381, where it was stated by Bramwell B., at 385,\n                    that: Costs as between party and party are given by the law as an indemnity to\n                        the person entitled to them; they are not imposed as a punishment on the\n                        party who pays them, nor given as a bonus to the party who receives them.Therefore, if the extent of the damnification can be\n                            found out, the extent to which costs ought to be allowed is also\n                            ascertained. [emphasis added] It is also the position adopted by local statutory law.\n                    Section 112(2) of the Legal Profession Act (Cap 161, 2009 Rev Ed)\n                    provides that a litigant should not be entitled to recover from any other person\n                    more in costs than the amount payable by the litigant to his own solicitor under\n                    a s 111(1) written agreement between himself and his solicitor governing\n                    the amount and manner of the payment of costs for conducting contentious\n                    business. 25     This principle of indemnity is the foundation\n                    for a second rule: that, if a solicitor expressly or impliedly agrees that he\n                    will not in any circumstances charge his client, no costs are recoverable from\n                    the other party (Cook on Costsat para 17.3;Gundry v Sainsbury,supra; andBritish Waterways Board v\n                        Norman(1993) 26 HLR 232). Thus, where a solicitor has\n                    expressly agreed that his client is primarily and legally obliged to pay him his\n                    legal fees but accepts payment from another in lieu of such payment, costs may\n                    still be recovered. An early form of this position was set out inDavies (A.P.) (suing as widow and administratrix of the estate of\n                        Kenneth Stanley Davies, decd) v Taylor (No 2)[1974] AC 225 by Lord Cross of Chelsea, at 234. In the context of a\n                    claim for payment out from the Legal Aid Fund to a victorious litigant, it was\n                    observed that: No doubt if it were shown that the respondent’s solicitor had agreed\n                        with him that in no circumstances would he hold him liable to pay any part\n                        of them then the costs, though incurred by the solicitor in defending the\n                        case, would not be costs “incurred” by the respondent, but it\n                        was not suggested that any such agreement... was made in this case. If there\n                        was no such agreement then the fact that the insurance company had\n                        undertaken to indemnify the respondent against his liability for these costs\n                        would not mean that they were not costs “incurred” by\n                        him... The same principle is expressed a little more strongly in the decision\n                    ofJoyce v Kammac,supra, which was relied upon by Mr Cheong in the course of\n                    his argument. There, Morland J stated, at 928: The general principle [at common law] is that the party in whose favour\n                        the order for costs was made... is entitled to be indemnified in respect of\n                        such costs that he was primarily and potentially legally obliged to pay to\n                        his solicitors. It matters not whether the receiving party was able or not\n                        to discharge that legal obligation, so long as the primary potential legal\n                        obligation to his solicitors existed.It matters not\n                            whether the receiving party was able to discharge that legal obligation\n                            from funds of his own or funds provided by friends, family, trade union,\n                            employer, insurer or otherwise, so long as the obligation was primarily\n                            his... [emphasis added] Thus, the fact that the purchaser’s property agent would\n                    ultimately be bearing the legal fees of OS 17/2008 is immaterial to determining\n                    the plaintiffs’ entitlement to costsunlessit could be shown that the plaintiffs were not primarily and potentially legally\n                    obliged to pay their solicitors at all. 26     The critical question in the present case is\n                    therefore clear: was there an agreement between the plaintiffs and their\n                    solicitors that the latter would not look to them for their legal costs? The\n                    question is not one of law but of fact. It also raises a second issue: namely,\n                    how should a court approach disputes of fact that arise in the context of a\n                    hearing on the issue of costs? In answering these questions, I should highlight\n                    at the outset two points derived from the authorities cited above. The first is\n                    Bramwell B.’s dictum inHarold v Smiththat, “[I]f the extent of the damnification can be found out, the extent\n                    to which costs ought to be allowed is also ascertained.” The second is\n                    the fact observed by Morland J inJoyce v\n                        Kammac: namely, that in most cases the obligation of a client to\n                    pay his solicitors’ costs may be found in the latter’s written\n                    retainer. 27     Mr Cheong pointed out that it was\n                    Mr Amin who gave evidence that the legal fees of OS 17/2008 were to be\n                    borne not by the plaintiffs but by another. It was the plaintiffs’ own\n                    evidence that raised the very real possibility that an agreement by the\n                    plaintiffs’ solicitors not to charge their clients was actually made; the\n                    onus was on them, therefore, to adduce some evidence in order to support any\n                    assertion to the contrary. Mr Cheong submitted that the best way for the\n                    plaintiffs to do this was to disclose the terms of their solicitors’\n                    retainer to the court. On his part, he would be satisfied with the court having\n                    sight of the document; he and his clients would not insist seeing it for\n                    themselves. 28     The first portion of Mr Cheong’s\n                    argument above is consistent with the position espoused by Hobhouse J inPamplin v Express Newspapers Ltd[1985]\n                    1 WLR 689, 696-697: At the taxation a problem may arise. An issue of fact may emerge which\n                        necessitates the master making formally or informally a finding of fact. In\n                        such a situation, the master may have to ask the claimant what evidence he\n                        wishes to rely upon in support of the contested allegation of fact... The master does not have any power to order discovery to be given; he does\n                        not have any power to override a right of privilege. But it is the duty of\n                        the master, if the respondent raises a factual issue, which is real and\n                        relevant and not a sham or fanciful dispute, to require the claimant to\n                        prove the facts upon which he relies. The claimant then has to choose what\n                        evidence he will adduce and to what extent he will waive his privilege. That\n                        is a choice for the claimant alone. The master then has to decide the issue\n                        of fact on the evidence [and consider] whether he is satisfied by the\n                        evidence... This seems to me to be the correct approach to take. The evidence that\n                    is currently before me strongly suggests the existence of an agreement stating\n                    that the plaintiffs’ solicitors will not be looking to the plaintiffs for\n                    their legal fees; it is only fair that the plaintiffs should be given a chance\n                    to voluntarily respond and adduce such evidence to rebut the allegation made\n                    against them. As this was not a taxation hearing, I could not compel the\n                    plaintiffs to produce their written retainer. Operating on the basis of thePamplinapproach, however, I could and did\n                    invite the plaintiffs to (voluntarily) waive privilege and disclose the written\n                    retainer in order to determine the true nature of the arrangement they have with\n                    their solicitors. After taking instructions from their clients, the\n                    plaintiffs’ solicitors indicated that their clients were not willing to\n                    waive their privilege, nor make the limited disclosure being asked of them.\n                    Pressed for a response to Mr Singh and Mr Cheong’s allegations,\n                    all Mr Low could offer was his assurance that the plaintiffs were their\n                    clients on record and that the written retainer reflected the agreement arrived\n                    at between Mr Chew and the plaintiffs for Mr Chew to pay the legal\n                    costs of the proceedings. 29     The plaintiffs’ unwillingness to waive\n                    privilege and disclose the terms of their retainer meant that I had to consider\n                    the impact of their silence on the finding of fact that I had to make concerning\n                    the existence of an agreement between the plaintiffs and their solicitors and on\n                    my final assessment of the plaintiffs’ entitlement to costs. 30     The plaintiffs could not – by virtue of\n                    s 131 of the Evidence Act (Cap 97, 1997 Rev Ed) – be\n                    compelled to disclose their solicitors’ retainer to the court. However,\n                    the dispute of fact is concerned with the nature of the plaintiffs’\n                    agreement with their solicitors and this would evidently be a fact that was\n                    especially within the plaintiffs’ knowledge. Section 108 of the Evidence\n                    Act places the burden of proving such a fact squarely on the plaintiffs’\n                    shoulders. The key provision in the Evidence Act, however, is s 116. It\n                    provides that: The court may presume the existence of any fact which it thinks likely to\n                        have happened, regard being had to the common course of natural events,\n                        human conduct, and public and private business, in their relation to the\n                        facts of the particular case. Illustrations (g) and (h) to s 116 then go on to provide\n                    that: The court may presume – ... (g)    that evidence which could be and is not produced\n                            would if produced be unfavourable to the person who withholds it;\n                            [and] (h)    that if a man refuses to answer a question which\n                            he is not compelled to answer by law, the answer if given would be\n                            unfavourable to him... Section 116, therefore, allows me to draw an adverse conclusion\n                    from the plaintiffs’ silence and in my view, there is sufficient ground in\n                    this case for me to do so. 31     InPamplin,\n                    Hobhouse J stated, at 697, that where a claiming party has decided not to\n                    waive privilege and to rely on other evidence in order to respond to a factual\n                    issue raised in cost proceedings, the assessing master will “no doubt\n                    take into account that the claimant may have a legitimate interest in not\n                    adducing the most obvious or complete evidence, and may prefer to rely on oral\n                    evidence rather than producing legal documents.” No such explanation was\n                    given here, however, for the plaintiffs’ reluctance to disclose their\n                    written retainer. The defendants did not ask to have sight of the retainer\n                    themselves. They maintained they would be satisfied as long as the court did.\n                    The facts of this case did not, therefore, raise the difficult issues of\n                    limiting disclosure and restricting an opposing party’s access to\n                    privileged documents that cases such asPamplinwere concerned with. There was no such legitimate interest on the\n                    plaintiffs’ part in withholding disclosure of their retainer. In addition,\n                    the plaintiffs offered no alternative evidence to support their claim that the\n                    terms of the written retainer “reflected” the arrangement with\n                    Mr Chew and did not go so far as to waive the plaintiffs’ primary\n                    obligation to pay their solicitors. Indeed, Mr Low’s careful and very\n                    deliberate choice of words in describing the terms of the retainer (see[29]above) only served to heighten my\n                    unease concerning the plaintiffs’ choice to withhold\n                disclosure.",
        "Conclusion": "32     In the circumstances, therefore, I find that\n                    there is sufficient ground upon which to invoke the court’s power to draw\n                    an adverse inference against the plaintiffs under s 116 of the Evidence\n                    Act. Having thus found that there was an agreement between the plaintiffs and\n                    their solicitors for the latter to look to a non-party for their legal costs, I\n                    conclude that the plaintiffs are not primarily and potentially legally obliged\n                    to pay their solicitors at all and, as a result, are not entitled to their costs\n                    in OS 17/2008. 33     I hold, therefore, that no order as to costs\n                    should be made in OS 17/2008."
    }
}