{
    "case_title": "Freight Links Fabpark Pte Ltd\n      v\n      DB International Trust (Singapore) Ltd",
    "ncitation": "[2010] SGHC 146",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "Introduction": "1       This dispute arose from a Put and Call Option\n                    Agreement dated 7 December 2007 (the “Agreement”) between the\n                    plaintiff and the defendant (acting in a representative capacity) relating to\n                    factory premises at 30 and 32 Tuas Avenue 8, Singapore (the\n                    “Property”). 2       The Property was originally leased by ST\n                    Microelectronics Pte Ltd (“STM”) from JTC Corporation\n                    (“JTC”) for a term of 60 years commencing\n                    1 September 1996 (the “JTC Lease”) and ending in 2056.\n                    STM subsequently assigned the JTC Lease to the plaintiff in 2005. That same\n                    year, the plaintiff sub-leased the Property to Microcircuit Technology (2002)\n                    Pte Ltd (“Microcircuit”) for a period of ten years commencing\n                    28 September 2005 (the “Existing Tenancy Agreement”) and\n                    ending on 27 September 2015. Microcircuit’s obligations under the\n                    Existing Tenancy Agreement were secured by a banker’s guarantee of\n                    $700,000 and a guarantee by its parent company, AEM Holdings Limited\n                    (“AEM”). The relationships between the various entities are\n                    illustrated in the following chart:  3       Under the Agreement, the plaintiff granted the\n                    defendant the right to purchase the JTC Lease (the Call Option), and at the same\n                    time, the defendant granted the plaintiff an option to sell the JTC Lease (the\n                    Put Option). Both parties were entitled to exercise the options upon certain\n                    terms, the principal one being that the price shall be $20,800,000. As the JTC\n                    Lease was subject to a prohibition against assignment to a third party for a\n                    period of three years, the Agreement could not be completed until around\n                    December 2008, one year after it was made. The Agreement was also conditional\n                    upon approval by JTC (“JTC Approvals”) being obtained by 30 November\n                    2008. 4       By letter of 30 October 2008 (“the\n                    Rescission Letter”), the defendant wrote to the plaintiff to rescind the\n                    Agreement under cl 9.4 of the Agreement. The plaintiff disputed this and\n                    continued to take steps to procure the JTC Approvals. On 11 December 2008,\n                    the plaintiff commenced this action for,inter\n                        alia, specific performance of the Agreement. On\n                    15 January 2009, the defendant through its solicitors wrote to the\n                    plaintiff’s solicitors to rescind the Agreement on two other grounds: (a)\n                    that the plaintiff had failed to obtain the requisite JTC Approvals as defined\n                    in cl 1.1 of the Agreement; and (b) that even if the JTC Approvals had been\n                    obtained, the defendant had reasonably determined the conditions to the JTC\n                    Approvals to be unacceptable. 5       The plaintiff’s contentions may be\n                    summarised under the following three issues: (a)     there had not been a material and\n                        adverse difference in the two due diligence exercises; (b)     the defendant’s right of\n                        rescission had not arisen by 30 October 2008 when it sent the\n                        Rescission Letter to the plaintiff; and (c)     the defendant was not entitled to rely on the\n                        alleged lack of JTC Approvals and the conditions to the JTC Approvals to\n                        rescind the Agreement. 6       Under issue (a),vizwhether there had been a material and adverse difference\n                    between the two due diligence exercises, the relevant provisions are found in\n                    cll 9.1 and 9.4 of the Agreement. They provide as follows: 9.1... the rights of\n                            the Purchaser to issue and serve on the Vendor the Call Option Exercise\n                            Notice and the rights of the Vendor to issue and serve on the Purchaser\n                            the Put Option Exercise Notice areconditional upon\n                                the Purchaser updating its due diligence investigations,\n                            including but not limited to the Property, the Building, the Mechanical\n                            and Electrical Equipment, the Existing Tenancy Agreement, the Existing\n                            Tenant, AEM-Evertech, the Existing Guarantee and Undertaking\n                                (“Due Diligence\n                            Investigations”) …and obtaining results which must not be materially\n                                and adversely different from the results of the Due Diligence\n                                Investigations conducted by the Purchaser prior to the date of this\n                                [Agreement]. 9.4In the event that\n                            the results of the Purchaser’s update of the Due Diligence\n                            Investigations arematerially and adversely\n                                differentfrom the results of the Due Diligence\n                            Investigations conducted by the Purchaser prior to the date of this\n                            [Agreement] and not acceptable to the Purchaserin\n                                all respects acting reasonably, the Purchaser shall be\n                            entitled to give written notice to the Vendor that it is not satisfied\n                            with its update of the Due Diligence Investigations … furnish to\n                            the Vendor reasonable supporting documentary evidence of the results of\n                            the Due Diligence Investigations that are materially and adversely\n                            different from the results of the Due Diligence Investigations conducted\n                            by the Purchaser prior to the date of this [Agreement] and immediately\n                            rescind this [Agreement] by giving written notice to the Vendor on or\n                            prior to the Due Diligence End Date …Provided Alwaysthatsuch right of rescission shall not apply until the Purchaser shall\n                                first allow the Vendor at least one (1) month to rectify,\n                            to the reasonable satisfaction of the Purchaser,any\n                                defects (to the extent that such defects are capable of\n                                rectification) … that constitutes a material adverse\n                                differencebetween the results of the update of the Due\n                            Diligence Investigations and the Due Diligence Investigations by the\n                            Purchaser before the date of this [Agreement] … [emphasis in bold in original, emphasis in italics added] 7       In the Rescission Letter, the defendant stated\n                    that its updated Due Diligence Investigations disclosed that the financial\n                    position of AEM was materially and adversely different from the results obtained\n                    in December 2007, prior to execution of the Agreement. 8       The plaintiff proceeded with its first line of\n                    argument by setting out the proposition that “due diligence had to be\n                    done as a whole and reasonably, and difference in results of updated due\n                    diligence had to be material and adverse as a whole”. The plaintiff then\n                    argued that the defendant had conducted its Due Diligence Investigations solely\n                    in respect of one factor,vizthe guarantor, AEM,\n                    and not in respect of any of the other factors specified in cl 9.1. For\n                    example, no due diligence was done in respect of the building, mechanical and\n                    electrical equipment. Therefore, even assuming that, by itself, the updated due\n                    diligence done on AEM had revealed a severe deterioration of its credit\n                    standing, this could not constitute a material adverse difference for the\n                    purpose of cl 9.1 because due diligence had to be done as a whole and the\n                    defendant was not entitled to look to only one factor but to all relevant\n                    factors. I was unable to agree with the plaintiff. First of all, cl 9.1 did\n                    not comprehensively set out all the areas that the defendant was entitled to\n                    conduct due diligence on; indeed the factors listed therein were prefaced with\n                    the words “including but not limited to”. In the absence of a\n                    comprehensive list of factors, the plaintiff’s interpretation would have\n                    led to an impossible situation because no matter what factors the defendant had\n                    taken into account, it could always be argued that they were not\n                    comprehensive. 9       Furthermore, the due diligence clause existed\n                    for the benefit of the defendant. It was for the defendant to elect what areas\n                    it wished to carry out due diligence on. The defendant could not be faulted for\n                    deciding against carrying out due diligence on the building or mechanical and\n                    electrical works or whatever other matters that it was entitled to carry out.\n                    The onus fell on the defendant to show that the subsequent due diligence\n                    exercise was materially and adversely different from the first. I cannot see why\n                    it was not open to the defendant to rely only on a single factor, if the\n                    deterioration of that factor was sufficiently large to amount to a material and\n                    adverse difference. 10     The defendant’s position was simply that\n                    the results of its updated Due Diligence Investigations were materially and\n                    adversely different from those conducted prior to the date of the Agreement.\n                    Paragraph 7 of the Rescission Letter set out the following grounds for this\n                    position: ... we hereby inform you that the results of our Updated Investigations\n                        are materially and adversely different from the results of the Due Diligence\n                        Investigations which we conducted and which we obtained on or about 4\n                        December 2007, prior to the date of the Agreement ... These differences\n                        relate primarily to the financial position of [AEM]. Particulars of these\n                        material and adverse differences and the supporting documentary evidence\n                        upon which they are based are appended hereto. 11     The supporting material appended to the\n                    Rescission Letter showed that AEM had a bad year, having incurred a loss of\n                    $15.2m between January and June 2008 as opposed to a profit of $0.9m in the\n                    corresponding period in 2007. Its net assets had dropped from $183m in 2007 to\n                    $64m in 2008 and its credit rating lowered from DP3 to DP4. The\n                    defendant’s position was that this was a material and adverse difference\n                    as it was a real estate investment trust whose purpose in purchasing the JTC\n                    Lease was to secure a stable income. The main attraction of the JTC Lease was\n                    the fact that Microcircuit was an anchor tenant up to 2015 and its obligations\n                    were secured by AEM. Therefore such an increase in the credit risk of AEM was a\n                    material and adverse difference. 12     The plaintiff disagreed that this constituted\n                    a material and adverse difference under cl 9.1. The plaintiff essentially\n                    submitted that AEM was still a viable company and was not in any danger of\n                    default. At most, it was a “hiccup”. 13     In my view, the point was not whether AEM was\n                    still a viable company. The defendant had entered into the Agreement based on a\n                    set of circumstances, presumably upon which it had decided on the price to be\n                    paid. The issue was whether the new set of circumstances, specifically the\n                    increased credit risk of AEM, was a material and adverse difference as\n                    contemplated in the Agreement. I accepted the defendant’s position that it\n                    was and therefore the defendant was entitled to rescind the Agreement on\n                    30 October 2008. 14     Issue (b) concerned whether the\n                    defendant’s right to rescission had arisen on 30 October 2008, the\n                    date of the Rescission Letter. The plaintiff pointed out that the proviso in\n                    cl 9.4 stated that the right of rescission shall not arise until the\n                    defendant had given the plaintiff one month to rectify any defects, to the\n                    extent that such defects were capable of rectification. As the Rescission Letter\n                    purported to rescind the Agreement on the same day, the plaintiff submitted that\n                    such rescission was invalid as the right to do so would not arise until at least\n                    a month thereafter. 15     I was unable to agree with the plaintiff on\n                    this point. Clause 9.1 specifically includes, as Due Diligence\n                    Investigations, the following matters: the Property, the Building, the Mechanical and Electrical Equipment, the\n                        Existing Tenancy Agreement, the Existing Tenant, AEM-Evertech, the Existing\n                        Guarantee and Undertaking … Under the Agreement, Due Diligence Investigations covered not only the\n                    status of the Existing Tenancy Agreement as well as the financial health of the\n                    existing tenant and its parent company, but also that of the building and\n                    mechanical and electrical equipment. It was clear that the qualifying words in\n                    cl 9.4,viz“to the extent such\n                    defects are capable of rectification”, were intended to refer to defects\n                    that were capable of rectification such as physical defects in the building or\n                    defects in the mechanical and electrical equipment. The material and adverse\n                    difference relied upon by the defendant to rescind the Agreement related to the\n                    financial health of AEM and this was not a defect within the contemplation of\n                    the proviso in cl 9.4. For this reason I found that the right to rescind\n                    had arisen by the date of the Rescission Letter. 16     Issue (c) pertained to the additional grounds\n                    relied upon by the defendant for rescission,iethe lack of JTC Approvals. Under cl 1.1, “JTC Approvals” was\n                    defined as: JTC’s approval or evidence satisfactory to the Purchaser of\n                        JTC’s consent to (a) the sale of the Property by the Vendor to the\n                        Purchaser and where required by JTC, the approval or clearance of the\n                        Competent Authorities and (b) the term under the Existing Tenancy Agreement\n                        being a lease term of ten (10) years commencing from 28 September\n                        2005. The defendant relied on cl 5.3 of the Agreement which required\n                    the plaintiff to procure the JTC Approvals by 30 November 2008. That\n                    clause stated: In the event that … the JTC Approvals … are not obtained by\n                        the Second Target Date [ie30 November\n                        2008], the purchaser (provided it has complied with its obligations under\n                        Clause 4.1) … shall be entitled to rescind this [Agreement] by\n                        giving written notice to the other Party at any time after … the\n                        Second Target Date [ie30 November 2008]\n                        ... 17     The following provisions of cl 4 were\n                    relevant: 4.1    The Vendor shall apply to JTC and the Competent\n                            Authorities (if applicable) for the JTC Approvals. In this connection,\n                            the Vendor shall keep the Purchaser fully informed of all steps taken\n                            towards obtaining the JTC Approvals and promptly notify the Purchaser\n                            upon obtaining each of the JTC Approvals. Subject to Clause 4.3,\n                            the Purchaser shall render and/or procure its agent, presently Colliers\n                            International, as soon as possible to render all reasonable assistance\n                            to the Vendor in connection with the Vendor’s application for the\n                            JTC Approvals. … 4.4    Without prejudice to Clause 4.5, the Vendor\n                            shall use its best endeavours to obtain the JTC Approvals and the JTC\n                            Confirmation by the Second Target Date [ie30 November 2008]. 4.5    In the event either Party reasonably determines\n                            that any of the terms and conditions of any of the JTC Approvals, either\n                            singly, or in aggregate, is/are not acceptable to it (provided that no\n                            Party shall raise any objection to any condition which is imposed on the\n                            other Party and not itself), the Purchaser (provided it has complied\n                            with its obligations under Clause 4.1) or the Vendor (provided it\n                            has complied with its obligations under Clause 4.4) shall be\n                            entitled to rescind this [Agreement] by giving written notice to the\n                            other Party at any time after the Second Target Date [ie30 November 2008], and upon such rescission the\n                            terms of Clause 15 shall apply. 18     The plaintiff’s first contention was\n                    that the defendant, having written to rescind the Agreement on 30 October\n                    2008, one month before the 30 November 2008 deadline for the JTC Approvals,\n                    was not entitled to rely on this ground to rescind. In the plaintiff’s\n                    submission, it “lies ill for the Defendant to say that JTC Approvals had\n                    not been procured … since it is now an open question as to what form the\n                    approval from JTC would have taken had the Defendant continued to render all\n                    reasonable assistance to the Plaintiff in connection with the JTC\n                    Approvals”. However the plaintiff conceded that it did not make any\n                    request to the defendant for assistance. That being the case, the plaintiff\n                    could not assert that the defendant had not rendered reasonable\n                    assistance. 19     The plaintiff’s next contention was that\n                    it had procured the JTC Approvals by 30 November 2008 and these were in the\n                    form of three letters from JTC dated 16 October 2008 (“First JTC\n                    Letter”), 5 November 2008 (“Second JTC Letter”) and\n                    24 November 2008 (“Third JTC Letter”). The defendant\n                    submitted that these letters did not constitute JTC Approvals in that they fell\n                    short of a consent to “(a) the sale of the Property by the Vendor to\n                    the Purchaser and where required by JTC, the approval or clearance of the\n                    Competent Authorities and (b) the term under the Existing Tenancy Agreement\n                    being a lease term of ten (10) years commencing from 28 September\n                    2005” for the reasons that follow. 20     The First JTC Letter only reiterated the\n                    existing approval by JTC of the sub-lease until 30 September 2011 and\n                    expressly stated that any renewal or extension or continuation of the existing\n                    subletting beyond 30 September 2011 would be subject to the defendant\n                    obtaining JTC’s written consent. It also stated that any renewal or\n                    extension or continuation of the existing subletting would, in any event, not\n                    extend beyond 27 September 2014. 21     The Second JTC Letter merely amended the\n                    long-stop date for any future extensions of JTC’s existing three-year\n                    approval to the sub-lease from “27 September 2014” to\n                    “27 September 2015”. As expressly stated by the Second JTC\n                    Letter, “[a]ll other contents in our letter of 16 October 2008\n                        [iethe First JTC Letter] shall remain\n                    unchanged”. This isolated amendment which the Second JTC Letter made to\n                    the First JTC Letter had the limited effect of introducing the possibility that\n                    JTC may, in the future, and upon the defendant’s further application at\n                    such a later time, extend its approval to the sub-lease beyond 27 September\n                    2011 to a date on or before 27 September 2014. Accordingly, even after the\n                    Second JTC Letter, the defendant only had the approval from JTC to sublet the\n                    Property to Microcircuit until 27 September 2011. Based on the terms of the\n                    First and Second JTC Letters, the defendant’s ability to continue\n                    subletting to Microcircuit beyond 27 September 2011 would depend on the\n                    defendant successfully “obtaining [JTC’s] prior written\n                    consent”. 22     I turn to the Third JTC Letter. The plaintiff\n                    submitted that JTC Approvals were given by the following paragraphs of that\n                    letter: 3.    As the Assignee is a REIT trustee, we approve the\n                            Term of the Agreement (being from 28 September 2005 to\n                            27 September 2015) provided always that: - … (c)    the Assignee\n                                complies and procures compliance at all times with\n                                clause 2.3(d) of our letter of 16 October 2008 save that\n                                the aforesaid compliance(s) shall be to such extent not inconsistent\n                                with this letter. For avoidance of doubt, the following shall not be\n                                inconsistent with this letter: - (i)    As an administrative formality, the\n                                    Assignee is required to apply for our formal consent for\n                                    subletting to MCT at every such applicable interval under our\n                                    prevailing “subletting policies and conditions” as\n                                    set out in our “Subletting Your Premises”\n                                    guidebook at the material time. The Assignee’s first\n                                    application as such shall be before 30 September\n                                    2011. (ii)   In any event, any subletting to MCT shall\n                                    be subject to and not conflict with our prevailing\n                                    “subletting policies and conditions” as set out in\n                                    our “Subletting Your Premises” guidebook at the\n                                    material time. 23     The defendant submitted that, notwithstanding\n                    JTC’s expressed “approv[al] of the Term of the Agreement”,\n                    the substance and effect of the Third JTC Letter, construed as a whole, did not\n                    constitute the requisite consent. This was because the Third JTC Letter\n                    continued to limit outright approval of the sub-lease to 30 September 2011,\n                    and required the defendant to “apply for [JTC’s] formal consent\n                    … at every such applicable interval” thereafter, “under\n                    [JTC’s] prevailing ‘subletting policies and\n                    conditions’” at the material time in the future. In the\n                    defendant’s submission, this requirement was of a far broader and more\n                    substantive purport than merely being an “administrative\n                    formality”, as the Third JTC Letter suggested. In particular, the\n                    defendant would be left hostage to the vagaries of JTC’s\n                    “prevailing subletting policies and conditions”, and exposed to\n                    the risk that JTC’s subletting policies and conditions would be altered to\n                    the defendant’s prejudice, for instance, through a change in policy\n                    prospectively refusing any further subleases of JTC property. As these\n                    uncertainties subjected the defendant to a degree of commercial risk that was\n                    entirely inconsistent with the parties’ negotiated bargain, the defendant\n                    submitted that the Third JTC Letter did not amount to JTC Approvals, as the\n                    definition of that term clearly manifested an objective intention to ensure that\n                    the defendant was assured of the approval from JTC to the entire sub-lease\n                    term. 24     In support of its submission, the defendant\n                    referred toSpanners International Pte Ltd v Laredo Pte\n                        Ltd[2008] SGHC 129. The plaintiff there had agreed to\n                    sell its JTC lease over a property to the defendant on condition that the\n                    defendant granted a lease back for five years and two months. The sale was\n                    expressed as being “subject to … approvals from JTC … being\n                    granted on the sale and purchase and lease back of the Property” (the\n                    “JTC Approvals Requirement”). At the time when the parties agreed\n                    to this term, they were unaware of JTC’s general three-year subletting\n                    policy. When they subsequently gained cognizance of JTC’s subletting\n                    policy, a dispute arose between them as to whether the JTC Approvals Requirement\n                    required the approval from JTC to the entire lease back term of five years and\n                    two months. At [36] of the grounds of decision, the court said as\n                    follows: … Although the defendant was committed to giving a lease back for\n                        the agreed duration [of five years and two months], it was not entitled to\n                        insist on granting a partial lease for the time being subject to a second\n                        application to JTC for approval to be made in due course. It was\n                        understandable why certainty of duration was crucial to the\n                        plaintiff’s future operations, in the same way that it was critical to\n                        the defendant’s decision to invest in the property. Although I have no\n                        doubt that the defendant would make the second application to JTC when the\n                        first 3-year term was about to expire, there was always the risk that\n                        something could go awry in the years ahead and JTC might decline to grant\n                        further approval after the first 3 years. JTC might even change its policy\n                        on subletting in the course of that time. As acknowledged by counsel for the\n                        defendant, its present policy is not writ in stone. The plaintiff would not\n                        have the comfort of knowing for sure at the start of the lease back that it\n                        has the legal right to conduct its business on the property for the\n                        remaining 2 years and 2 months. 25     I concurred with the defendant’s\n                    submissions on this issue. The objective of the transaction was to secure a\n                    stable income stream and the requirement for JTC Approvals was to ensure the\n                    continuity of that income stream. The Third JTC Letter did not provide the\n                    certainty required by the defendant and therefore that letter cannot constitute\n                    “JTC Approvals” within the definition of that term in\n                    cl 1.1.",
        "Conclusion": "26     For the foregoing reasons, I held that the\n                    defendant had validly rescinded the Agreement on 30 October 2008 by way of\n                    the Rescission Letter. I further held that a further ground was available to the\n                    defendant in that the JTC Approvals were not procured by 30 November 2008\n                    such that if the Agreement had not come to an end on 30 October 2008, it\n                    would have been rescinded on that ground on 15 January 2009. The plaintiff\n                    has since appealed against my decision."
    }
}