{
    "case_title": "Law Society of Singapore\n      v\n      Ng Bock Hoh Dixon",
    "ncitation": "[2010] SGHC 69",
    "coram": "Chan Sek Keong CJ; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1       This was an application by the Law Society of\n                    Singapore (“the Law Society”) made under ss 94(1) and 98(1)\n                    of the Legal Profession Act (Cap 161, 2001 Rev Ed) (“the\n                    Act”) against Dixon Ng Bock Hoh (“the Respondent”) to make\n                    absolute an order to show cause. 2       The charges brought against the Respondent, as\n                    amended by the Disciplinary Committee of the Law Society (“the\n                    Disciplinary Committee) at the end of the hearing, and to which the Respondent\n                    pleaded guilty, read as follows (seeLaw Society of Singapore\n                        v Dixon Ng Bock Hoh[2009] SGDSC 4 (“the Report”)\n                    at [44]–[45]): Re-amended First Charge You, [the Respondent], an Advocate & Solicitor of the Supreme Court\n                        are charged that you, in or about December 2005 or January 2006, in\n                        Singapore, were guilty of misconduct unbefitting an advocate and solicitor\n                        as an officer of the Supreme Court and as a member of an honourable\n                        profession within the meaning of section 83(2)(h) of the Legal\n                        Profession Act (Cap 161, 2001 Rev Ed) in that, sometime in or\n                        about December 2005 or January 2006, you prepared a document entitled\n                        Judgment between JCV Consultants and Nortel (S) Pte Ltd dated\n                        13 December 2005 for DC Suit 133418 of 2005 stamped\n                        “Draft” which purported to be a draft of a judgment for an\n                        action in the Subordinate Courts of Singapore which document you knew was\n                        false. Re-amended Second Charge You, [the Respondent], an Advocate & Solicitor of the Supreme Court\n                        are charged that you, in or about December 2005 or January 2006, in\n                        Singapore, were guilty of misconduct unbefitting an advocate and solicitor\n                        as an officer of the Supreme Court and as a member of an honourable\n                        profession within the meaning of section 83(2)(h) of the Legal Profession\n                        Act (Cap 161, 2001 Rev Ed) in that, sometime in or about December\n                        2005 or January 2006, you prepared a document entitled Judgment between RJ\n                        Crocker Consultants Pte and Singapore Agro Agricultural Pte Ltd dated\n                        14 December 2005 for DC Suit 133553 of 2005 stamped\n                        “Draft” which purported to be a draft of a judgment for an\n                        action in the Subordinate Courts of Singapore which document you knew was\n                        false. 3       After hearing arguments by counsel for the Law\n                    Society as well as the Respondent in person, we ordered that the Respondent be\n                    suspended from practice for two years, but made no order as to costs. We now\n                    give the detailed grounds for our decision.",
        "The background": "4       The Respondent is an advocate and solicitor of\n                    the Supreme Court of Singapore of approximately 17 years’ standing\n                    and was practising as a sole proprietor of Messrs Dixon Ng & Co at\n                    the material time. The complainant is one Ng Swee How who is also known as\n                    Vincent Ng. 5       On or about June 2001, the complainant engaged\n                    the services of the Respondent to represent JCV Consultants (which was a\n                    sole-proprietorship owned by the complainant) in its claim against Nortel\n                    Networks Pte Ltd for outstanding payment due. The Respondent filed a writ on the\n                    complainant’s behalf. However, the writ was not served and the action was\n                    deemed to have been discontinued one year after the date of issue of the writ.\n                    Subsequently, on or about September 2005, the complainant and the Respondent met\n                    again and became business partners for the purposes of developing business\n                    contacts in the Middle East. However, by March 2006, their relationship had\n                    soured. On 17 April 2006, the complainant informed the Respondentviae-mail that he was terminating their business\n                    relationship. 6       On 17 October 2006, the complainant made a\n                    complaint to the Law Society against the Respondent.",
        "The proceedings before the Disciplinary Committee": "7       Before the Disciplinary Committee, there were\n                    initially three charges brought against the Respondent. The third charge related\n                    to the complainant’s claim that he gave the Respondent a sum of $20,000 to\n                    incorporate a company in Dubai, but that the money was not returned to him when\n                    he told the Respondent that he had decided not to incorporate the company after\n                    all. At the end of the hearing, the Disciplinary Committee held that the third\n                    charge was not made out (see the Report at [48]–[49]). 8       For our purposes, therefore, we will be\n                    focussing only on those parts of the proceedings before the Disciplinary\n                    Committee relevant to the present charges against the Respondent (see above at[2]). As already noted, the Respondent\n                    faced two charges for preparing two court judgments purportedly issued by the\n                    Subordinate Courts which he knew were false. The complainant’s evidence 9       The complainant alleged that he had instructed\n                    the Respondent to act for him in pursuing two claims. For the first claim, the\n                    complainant instructed the Respondent to re-open the file concerning JCV\n                    Consultants’ claim against Nortel Networks Pte Ltd. For the second claim,\n                    the complainant instructed the Respondent to represent RJ Crocker (which he\n                    was a director and shareholder of) against Singapore Agro Agricultural Pte Ltd.\n                    Subsequently, the Respondent informed the complainant that he obtained judgments\n                    in his favour for both actions (in DC Suit Nos 133418 and 133553 of 2005,\n                    respectively). The Respondent then gave him copies of the two judgments. In\n                    reality, no such judgments were issued by the Subordinate Courts. The Respondent’s evidence 10     The Respondent did not dispute that he had\n                    produced the two “judgments” purportedly issued by the Subordinate\n                    Courts, which he knew were false. However, the Respondent claimed that he was\n                    not acting in the capacity of an advocate and solicitor for the complainant;\n                    that the complainant knew that the “judgments” were not real; that\n                    the judgments were stamped with the word “DRAFT”; that they were\n                    produced at the request of the complainant as part of a “wife placation\n                    exercise”; and that he had never intended to represent such documents as\n                    genuine court documents. 11     The Respondent stated that he and the\n                    complainant were friends and business partners, and that the complainant had\n                    confided in him about his marital problems. The complainant’s marital\n                    problems stemmed from his affair with a lounge hostess who absconded with\n                    $150,000 of his wife’s money. As a result of this incident, the\n                    complainant owed his wife $150,000. Since then, the complainant’s wife had\n                    harassed the complainant and restricted his expenses. 12     We turn now to consider the “wife\n                    placation exercise” proper. According to the Respondent, the complainant\n                    had sought the assistance of the Respondent to ameliorate the situation with his\n                    wife. The complainant requested, and the Respondent agreed to lend money to the\n                    complainant, in order that the complainant would be able to repay the money owed\n                    by him to his wife. The complainant subsequently requested that the Respondent\n                    produce court “judgments” so that the complainant could show his\n                    wife that monies were forthcoming. The Respondent again agreed and duly produced\n                    the “judgments”. These “judgments” resembled actual\n                    court judgments and even bore the “signature” of the Deputy\n                    Registrar of the Subordinate Courts. Having created these\n                    “judgments”, the Respondent was, however, concerned that they\n                    might be used to mislead third parties (other than the complainant’s\n                    wife). Therefore, the Respondent stamped the word “DRAFT” on them.\n                    The Respondent then gave to the complainant photocopies of the\n                    “judgments” and left it to the complainant to decide what to do\n                    with them. 13     Thus, the production of the two\n                    “judgments”, as explained by the Respondent, was part of a\n                    “wife placation exercise” to make the complainant’s wife\n                    believe that the complainant would be receiving money from his legal actions so\n                    as to alleviate the harassment by his wife. The Respondent claimed that he acted\n                    as a friend and out of care and concern for the complainant’s\n                    well-being. The findings of the Disciplinary Committee 14     After hearing the evidence of the complainant\n                    and Respondent, the Disciplinary Committee was of the view that the complainant\n                    was not a witness of truth, and that he “was very evasive during\n                    cross-examination, and was found lying at numerous parts of his evidence”\n                    (see the Report at [37]). Instead, the\n                    Disciplinary Committee accepted the Respondent’s evidence, finding that\n                    “the Respondent was trying to help [the complainant] to continue his\n                    business activities without any interference from his wife” (see the\n                    Report at [39]). The Disciplinary Committee also found that the Law Society had\n                    failed to prove beyond reasonable doubt that the judgments did not have the word\n                    “DRAFT” stamped on them (see the Report at [43]). 15     Nevertheless, the Disciplinary Committee held\n                    (at [44]) that even if they accepted the Respondent’s evidence that he had\n                    stamped the word “draft” on the two “judgments” and\n                    that the Respondent was not acting in his capacity as an advocate and solicitor,\n                    the production of the two “judgments” was conduct unbefitting of\n                    an advocate and solicitor. In this regard, the Disciplinary Committee observed\n                    (see the Report at [56]): In our view, there was clearly an element of deceit in what the Respondent\n                        did when he created the false draft judgments. We find the\n                        Respondent’s conduct to be dishonest and unbefitting of an advocate\n                        and solicitor as an officer of the court and as a member of an honourable\n                        profession. The false documents which were created in this case purported to\n                        be drafts of judgments to be issued by a court of law. His conduct struck at\n                        the administration of justice. As an officer of the court, the Respondent\n                        was duty bound to uphold the integrity of the system for the administration\n                        of justice. Instead he had done otherwise. … 16     The Disciplinary Committee therefore\n                    determined that under s 93(1)(c) of the Act,\n                    cause of sufficient gravity for disciplinary action existed against the\n                    Respondent under s 83 of the same. However, the Disciplinary Committee\n                    amended the charges as framed by the Law Society to include the words\n                    “stamped draft” and also to remove references to\n                        s 83(2)(b) of the Act. The Respondent\n                    pleaded guilty to the amended charges (see above at[2]).",
        "The proceedings before this court": "",
        "The issues": "17     The issues before this court were as\n                    follows: (a)     whether due cause for disciplinary\n                        action against the Respondent under s 83(2)(h) of the Act had been shown; and (b)     if so, what was the appropriate\n                        penalty to be imposed on the Respondent.",
        "The relevant law": "18     The relevant provision is s 83(2)\n                        (h) of the Act, which reads as follows: (2)    Such due cause may be shown by proof that an\n                            advocate and solicitor — … (h)    has been guilty of such misconduct unbefitting\n                                an advocate and solicitor as an officer of the Supreme Court or as a\n                                member of an honourable profession; 19     Section 83(2)(h) of the Act provides that due cause may be shown against an\n                    advocate and solicitor who “has been guilty of such misconduct\n                    unbefitting an advocate and solicitor as an officer of the Supreme Court or as a\n                    member of an honourable profession”. As this court observed inLaw Society of Singapore v Ng Chee Sing[2000]\n                    1 SLR(R) 466 (“Ng Chee\n                    Sing”) at [40]: Section 83(2)(h) of the Legal Profession Act is a catch-all provision\n                        which can be invoked when the conduct does not fall within any of the other\n                        enumerated grounds but is nevertheless considered unacceptable. It was\n                        stated in Law Society of Singapore v Khushvinder Singh Chopra [[1998]\n                        3 SLR(R) 490] that unlike “grossly improper conduct”\n                        in s 83(2)(b), “conduct unbefitting an advocate and\n                        solicitor” is not confined to misconduct in the solicitor’s\n                        professional capacity but also extends to misconduct in the\n                        solicitor’s personal capacity. It follows that the standard of\n                        unbefitting conduct is less strict and, as stated in In re Weare, a\n                        Solicitor; In re The Solicitors Act, 1888 [1893] 2 QB 439, a solicitor\n                        need only be shown to have been guilty of “such conduct as would\n                        render him unfit to remain as a member of an honourable\n                        profession”. And, in the decision of this court inLaw Society\n                        of Singapore v Ahmad Khalis bin Abdul Ghani[2006]\n                    4 SLR(R) 308 (“Ahmad\n                    Khalis”), it was observed (at [80]) that “the focus of\n                        [s 83(2)(h)] is on the conduct of the\n                    solicitor – in particular to ensure that the conduct of the solicitor\n                    concerned meets the high levels of professionalism expected of practising\n                    lawyers”. It was also established by this court, inLaw Society of Singapore v Arjan Chotrani Bisham[2001]\n                    1 SLR(R) 231 (at [34]), that “under s 83(2)(h) the\n                    solicitor’s misconduct has to be unbefitting an advocate and solicitor and\n                    that the standard of judgment to be applied is fixed by the court and is not the\n                    standard of peer judgment (Law Society of Singapore v Heng Guan Hong Geoffrey\n                    [1999] 3 SLR(R) 966)”.",
        "The Law Society’s arguments": "20     The Law Society relied on the findings of the\n                    Disciplinary Committee and the guilty plea of the Respondent to contend that due\n                    cause for disciplinary action under s 83(2)(h) of the Act had been shown. Even though the Respondent acted to\n                    help a friend, the production of false court documents was misconduct\n                    unbefitting of an advocate and solicitor. However, the Law Society made no\n                    submissions as to the appropriate penalty to be imposed.",
        "The Respondent’s arguments": "21     As noted above, the Respondent acknowledged\n                    that he was guilty of conduct unbefitting an advocate and solicitor. He also did\n                    not contest that due cause for disciplinary action against him had been\n                    shown. 22     Taking the Respondent’s case at its\n                    highest, the situation may be succinctly described as follows. The Respondent\n                    had the best of intentions in creating the false court documents,viz, to aid his erstwhile friend and business partner in\n                    what was (in his words) a “wife placation exercise”. He therefore\n                    received no benefit himself. Further, the orders were stamped with the word\n                    “draft” and were therefore not passed off as being final court\n                    orders. The Respondent therefore urged this court to impose a lenient penalty in\n                    the light of the circumstances of the case.",
        "Our decision": "",
        "The Respondent’s conduct": "23     Before considering thesubstanceof what the Respondent effected through the drafting\n                    of such (false) orders, let us first consider his argument based on best\n                    intentions and the attendant absence of personal benefit. 24     As this court pointed out inLaw Society of Singapore v Ong Ying Ping[2005]\n                    3 SLR(R) 583 (“Ong Ying\n                    Ping”) at [45]: Even if we assume that the respondent had his own “noble”\n                        reasons for doing what he did, the ends could never justify the means. One\n                        cannot divorce the means from the ends. Where improper means are utilised,\n                        the ends, no matter how noble or desirable they might otherwise be, are\n                        almost invariably tainted and sullied. There are in fact two consequences\n                        arising as a result. The first is that the use of improper means is itself\n                        wrong and the second (as just mentioned) is that the otherwise noble ends\n                        themselves are also tainted and sullied as a result. This would of course\n                        be, a fortiori, the case if the respondent had less than noble reasons.\n                        [emphasis in original] 25     In any event, the ends sought to be achieved\n                    by the Respondent in the present case were far from noble. Whilst the Respondent\n                    described his actions as constituting a “wife placation exercise”\n                    it was, in effect, more of a “wifedeceptionexercise”. 26     However,even\n                        assumingthat the ends sought to be achieved were in fact noble,\n                    it didnot(as pointed out above) justify the\n                    means utilised. This is an appropriate juncture at which to turn to considerthe meansutilised by the Respondent, which\n                    consisted in the drafting offalse court\n                    documents. 27     It is important to note that the Respondent,\n                    as an advocate and solicitor, “shall bean officer of\n                        the Supreme Court” (emphasis added) (see s 82(1) of\n                    the Act). It is also important to remind ourselves of the declaration which each\n                    lawyer makes when admitted as an advocate and solicitor of the Supreme Court.\n                    The declaration is to be found in s 24 of the Act, as follows: Declaration, duty and\n                            roll 24.-(1) Every person admitted as an\n                        advocate and solicitor of the Supreme Court shall make the declaration set\n                        out in subsection (2). (2)    Subject to any\n                            necessary modification to conform to the religious beliefs of the\n                            applicant for admission, the declaration shall be in the following\n                            form: “I, A.B., do solemnly and\n                            sincerely declare (and swear) that I will truly and honestly conduct\n                            myself in the practice of an advocate and solicitor according to the\n                            best of my knowledge and ability and according to law. (So help me God)”. [emphasis added] 28     As this court observed inNarindar Singh Kang v Law Society of Singapore[2007]\n                    4 SLR(R) 641 at [50]: 50    It is a solemn declaration which, though outwardly\n                            simple, is pregnant with meaning. It is a declaration by the lawyer\n                            concerned that he or she will not only exercise his or her professional\n                            knowledge and skills to the best of his or her ability as well as\n                            according to law, but (and more importantly) that such knowledge and\n                            skills will be exercised “truly and honestly”. This\n                            signifies a duty not merely to oneself and to one’s client, but\n                            also to the court and to the attainment of justice and fairness\n                            generally. Indeed, the pursuit and attainment of justice and fairness is\n                            central to one’s role as an advocate and solicitor. Any conduct\n                            which sullies such an ideal not only damages the reputation of the\n                            lawyer concerned but (more importantly) constitutes a blow against this\n                            ideal - especially in the eyes of the public. This ideal is a very real\n                            one … … Prof Jeffrey Pinsler, in his seminal work, Ethics and\n                        Professional Responsibility: A Code for the Advocate and Solicitor (Academy\n                        Publishing, 2007), also aptly observes thus (at\n                        paras 01-108–01-109): The oath binds the person taking it for the entire length of his\n                            career, although the number of disciplinary actions taken against\n                            advocates and solicitors may indicate that it has too often been\n                            honoured in the breach. Three phrases ring out: “truly and\n                            honestly conduct myself”; “according to the best of my\n                            knowledge and ability”; and “according to\n                            law”. Referring to the oath that they had just taken, the Chief\n                            Justice, in his address to newly admitted advocates and solicitors on\n                            20 May 2006, said: Bear in mind always that a lawyer’s first and foremost duty\n                                is to uphold the principles of honesty, integrity and\n                                professionalism. This is reflected in the oath that you have just\n                                taken this morning ... . 29     In this case, the Respondent, by creating\n                    false court documents in order to placate the complainant’s wife, had\n                    acted (to say the least) in a less than professional manner and had thereby\n                    contravened the declaration he took on the occasion of being admitted as an\n                    advocate and solicitor of the Supreme Court. Indeed, as counsel for the Law\n                    Society, Mr Vijai Parwani, submitted (correctly, in our view), there are\n                    certain lines that cannot be crossed by an advocate and solicitor and, on this\n                    particular occasion, the Respondent had crossed the line because the means he\n                    employed involved court documents which embodied (by their very nature) a high\n                    measure of sanctity. Court documents are intended to facilitate the attainment\n                    of a just and fair decision by the court itself. In other words, they are not\n                    merely the tools of the lawyer’s trade but are also the means through\n                    which justice and fairness are achieved. The use – or, in this case, abuse\n                    – of them for any other reason (even one as unusual as that in the present\n                    case) not only demonstrates a lack of respect for the court process but is also\n                    anathema to the very ideals which constitute the very pith and marrow of the law\n                    itself. In this regard, we rejected the Respondent’s contention that the\n                    documents concerned were only marked as drafts. Indeed, a close examination of\n                    the said documents revealed that they were intended to be passed off asgenuinecourt documents (albeit in highly\n                    unusual as well as narrow circumstances). Their format and language were\n                    precisely what one would expect to see in a proper court judgment. This was no\n                    mere amateurish effort but one that would probably have even convinced a lawyer\n                    that it was an authentic court document – not to mention a layperson. The\n                    Respondent conducted himself as he did precisely in order that the\n                    complainant’s wife be convinced that the documents concerned were\n                    authentic, thereby succeeding in the “wife placation exercise”. In\n                    the circumstances, this was clearly conduct which constituted a breach of\n                    conduct pursuant to s 83(2)(h) of the\n                    Act.",
        "The sentence imposed": "30     The mitigating factors the Respondent urged us\n                    to take into account have, in fact, already been referred to above (at[22]). In particular, he emphasised the fact that\n                    his intention was to aid the complainant in a “wife placation\n                    exercise” and that he received no personal benefit in return. He also\n                    stated that he had stamped the word “draft” on the documents to\n                    ensure that they were not passed off as final judgments. We have already\n                    considered this last-mentioned argument (above at[29]) and found it to be wholly without merit. The only\n                    mitigating factors that were relevant in the context of the present proceedings,\n                    therefore, were that the Respondent had acted with good intentions and that he\n                    had received no personal benefit in return. 31     What was clear was that the Respondent had\n                    not, in the circumstances, been guilty of dishonest conduct (as compared, for\n                    example, to the respondent inLaw Society of Singapore v\n                        Khushvinder Singh Chopra[1998] 3 SLR(R) 490 (where the\n                    charges against the lawyer concerned were also brought pursuant to\n                        s 83(2)(h) of the Act) as well as the\n                    respondents inLaw Society of Singapore v Heng Guan Hong\n                        Geoffrey[1999] 3 SLR(R) 966 andNg\n                        Chee Sing(where the charges against both the lawyers concerned\n                    were brought pursuant to s 83(2)(b) and\n                        (h) of the Act)). This was an important\n                    consideration because dishonest conduct almost invariably results in the lawyer\n                    concerned being struck off the roll of advocates and solicitors of the Supreme\n                    Court (“the roll”). Although the Disciplinary Committee in the\n                    present proceedings did (in passing) characterise the Respondent’s conduct\n                    as “dishonest” (see the Report at [56] and above at[15]), one should view this observation as\n                    precisely that – a passing (and very general) observation that ought to be\n                    viewed in itscontext(which focused, in the main,\n                    on thegeneralelement of deceit in relation tofalsecourt documents). The Respondent’s\n                    conduct was intended solely as a “wife placation exercise”,as opposed to a deliberate attempt to deceive a client\n                        and/or the court in the context of actual court (or court-related)\n                        proceedings. 32     However, it doesnotfollow that an absence of dishonesty willneverresult in an advocate and solicitor being struck off the\n                    roll. In the oft-cited words of Sir Thomas Bingham MR in the English Court of\n                    Appeal decision ofBolton v Law Society[1994]\n                    1 WLR 512 at 518: Any solicitor who is shown to have discharged his professional duties with\n                        anything less than complete integrity, probity and trustworthiness must\n                        expect severe sanctions to be imposed upon him ... Lapses from the required\n                        high standard may, of course, take different forms and be of varying\n                        degrees. The most serious involves proven dishonesty, whether or not leading\n                        to criminal proceedings and criminal penalties. In such cases the tribunal\n                        has almost invariably, no matter how strong the mitigation advanced for the\n                        solicitor, ordered that he be struck off the Roll of Solicitors. Only\n                        infrequently, particularly in recent years, has it been willing to order the\n                        restoration to the Roll of a solicitor against whom serious dishonesty had\n                        been established, even after a passage of years, and even where the\n                        solicitor had made every effort to re-establish himself and redeem his\n                        reputation. If a solicitor is not shown to have acted dishonestly, but is\n                        shown to have fallen below the required standards of integrity, probity and\n                        trustworthiness, his lapse is less serious but it remains very serious\n                        indeed in a member of a profession whose reputation depends upon trust. A\n                        striking off order will not necessarily follow in such a case, but it may\n                        well. The decision whether to strike off or to suspend will often involve a\n                        fine and difficult exercise of judgment, to be made by the tribunal as an\n                        informed and expert body on all the facts of the case. Only in a very\n                        unusual and venial case of this kind would the tribunal be likely to regard\n                        as appropriate any order less severe than one of suspension. [emphasis\n                        added] Reference may also be made to the decision of this court inLaw Society of Singapore v Ravindra Samuel[1999]\n                    1 SLR(R) 266 (“Ravindra\n                    Samuel”) at [14]–[15]. 33     In assessing the gravity of the misconduct,\n                    and hence the severity of the penalty, the decisions inLaw\n                        Society of Singapore v Wee Wei Fen[1999] 3 SLR(R) 559\n                        (“Wee Wei Fen”) andRe Advani Jiwat G[1988] 1 SLR(R) 98\n                        (“Re Advani Jiwat G”)\n                    are relevant. 34     The fact situation in the present proceedings\n                    may becontrasted withthat inWee Wei Fen, where the lawyer concerned was convicted of two\n                    charges of forgery and one charge of cheating (with ten other charges being\n                    stood down by the Prosecution). The lawyer was subsequently struck off the roll.\n                    It should be noted that the lawyer in question effected forgeries of both a\n                    cheque as well as an order of court in order to deceive the lawyer for the other\n                    party as well as one of her clients, respectively. Indeed, both acts of forgery\n                    were not only carried to completion but also stemmed from the lawyer’s\n                    attempts to cover up her blatant professional inaction in both the situations\n                    concerned. She wasalsofound guilty of cheating\n                    inasmuch as she had utilised a sum in her firm’s client account belonging\n                    to one client in order to make an unauthorised payment to another law firm\n                    pursuant to a settlement which had not in fact been authorised by yet another\n                    client in the first instance. The lawyer pleaded guilty to all three charges and\n                    was sentenced to a total of four months’ imprisonment. As already\n                    mentioned,Wee Wei Fenrelated to disciplinary\n                    proceedings brought against the lawyer pursuant to s 83(2)(a) of the Act (which relates to a situation where an\n                    advocate and solicitor “has been convicted of a criminal offence,\n                    implying a defect of character which makes him unfit for his profession”.\n                    The court observed (at [38]) that “[t]here was no doubt … that all\n                    three offences in this case involved an element ofdishonesty\n                        and fraud” (emphasis added). It proceeded to observe (at\n                    [38]) that: [t]heir gravity was further compounded by the fact that the respondent had\n                        committed them in her professional capacity as an advocate and solicitor and\n                        had abused her position as a member of a respected and honourable profession\n                        … Despite being an officer of the court, the respondent had\n                        nevertheless audaciously sought to pervert the course of justice by\n                        fabricating court documents. She had also consistently failed in her duty to\n                        not one, not two but at least three of her clients to act in their best\n                        interests. In the circumstances, we had no doubt that her behaviour cannot\n                        in any way be countenanced. To do so would be to set an unacceptable\n                        precedent for other like-minded lawyers to do the same. 35     Another decision that might be noted briefly\n                    is that of this court inRe Advani Jiwat G,\n                    where the facts were (like those in the present proceedings) highly unusual. The\n                    lawyer concerned was so distraught on learning of his father-in-law’s\n                    passing that he sought to prepare a forged will purportedly made by the latter\n                    and leaving all the property to his (ie, his late\n                    father-in-law’s) wife (to the exclusion of five daughters, which, of\n                    course, included the said lawyer’s wife). Counsel for the lawyer pointed\n                    out, in this regard (at [5]), that the lawyer “wished to give effect to\n                    the wishes or intention of his late father-in-law, which the latter had\n                    expressed in his lifetime that should he predecease his wife, as it had\n                    happened, all his property should go to his wife”. As it turned out, the\n                    deceased’s five daughters subsequently agreed, in fact, to renounce\n                    whatever claims they had against their late father’s estate in favour of\n                    their mother and effected this through a deed of renunciation. The court held\n                    that no cause of sufficient gravity existed for disciplinary action under what\n                    is presently s 83 of the Act and further held that a severe reprimand from\n                    the Disciplinary Committee would suffice. It was important to note that, in that\n                    case (which did not involve any interaction with clients or the court), the\n                    court took pains (at [6]) to “emphasise strongly the exceptional\n                    circumstances” and the fact that, whilst such conduct was to be\n                    deprecated, such acts also constitutedpreparatoryacts which the lawyerwholly abandonedonce he had\n                    been alerted of their impropriety by his secretary (reference may also be made\n                    to the decision of this court inLaw Society of Singapore v\n                        Tan Buck Chye Dave[2007] 1 SLR(R) 581 as well as\n                    Jeffrey Pinsler,Ethics and Professional Responsibility: A\n                        Code for the Advocate and Solicitor(Academy Publishing, 2007) at\n                    para 01-087). 36     Returning to the facts of the present\n                    proceedings (which, for reasons set out below, lay (in our view) between those\n                    inWee Wei FenandRe Advani\n                        Jiwat G, respectively), we were of the view that the\n                    Respondent’s good intentions could, at the very best, go only towards\n                    mitigating what would have otherwise been a more severe sentence which would\n                    have been meted out on him. If, for example, the Respondent had, in fact,\n                    utilised false court documents to deceive the court in order to gain a personal\n                    advantage for himself, that would have clearly been conduct that justified\n                    striking him off the roll. In the present proceedings, however, the false\n                    documents were only intended to be shown to the complainant’s wife in\n                    order to placate hervis-à-visthe complainant.\n                    The Respondent truly believed he was doing the complainant a favour, although he\n                    now acknowledged that his conduct was improper. On the other hand, we pause to\n                    observe that if such conduct was not sanctioned appropriately, there would (as\n                    the Disciplinary Committee noted (see the Report at [56] as well as above at[15])) also be an undermining of public\n                    confidence in the administration of justice. Indeed, as this court observed inOng Ying Ping(at [66]): We note, further, that the respondent [viz,\n                        the lawyer in the case] is an officer of the court. His task is to aid in\n                        the administration of justice, not to undermine it. Integrity and honesty\n                        are not simply necessary; they are the qualities that every legal\n                        practitioner must possess, for without them, the entire reputation of the\n                        law will be forfeit. The legal profession aids, immeasurably, in the\n                        administration of justice. Its reputation in the eyes of the public must be\n                        maintained and even enhanced wherever possible. The signal importance of\n                        this last-mentioned point centring on public confidence is vital and cannot\n                        be overemphasised. [emphasis in original] In a similar vein, this court observed, inAhmad\n                        Khalis(at [5]): The legitimacy of the administration of justice in the eyes of the public\n                        cannot be gainsaid. Respect for the law as viewed through the lenses of the\n                        public is an indispensable element in the fabric of the system of justice.\n                        Indeed, the public constitutes the ultimate body of individuals for whose\n                        benefit the law and the legal system exist. To this end, anything which\n                        undermines public confidence in the competence and/or professionalism of\n                        lawyers must not - indeed, cannot - be permitted. As we shall elaborate upon\n                        below, the focus should be the precise opposite - to enhance the standing\n                        and (more importantly) accessibility of the legal profession in the eyes of\n                        the public. [emphasis in original] The following observations by this court inRavindra Samuel(at [11], and which also focus on the need to\n                    protect the public against similar defaults by other solicitors) should also be\n                    noted: 11    ... It is not simply a question of punishing the\n                            solicitor concerned. A further consideration must be what course should\n                            the court take to protect the public and to register its disapproval of\n                            the conduct of the solicitor.In the relevant sense,\n                                the protection of the public is not confined to the protection of\n                                the public against further default by the solicitor in question. It\n                                extends also to the protection of the public against similar\n                                defaults by other solicitors through the court publicly marking the\n                                seriousness of what the instant solicitor has done. The orders made\n                                must therefore accord with the seriousness of the default and leave\n                                no doubt as to the standards to be observed by other practitioners.\n                                In short, the orders made should not only have a punitive, but also\n                                a deterrent effect. 12    There are also the interests of the honourable\n                            profession to which the solicitor belongs, and those of the courts\n                            themselves, to consider. The administration of justice can only proceed\n                            on the basis that solicitors can place reliance upon the honesty of the\n                            solicitors with whom they deal.The public too must\n                                be able to repose confidence in a profession which plays so\n                                indispensable a part in the administration of justice.\n                            Similarly, the courts of this country must be able to depend on the\n                            honesty and integrity of all practitioners appearing before them and to\n                            expect that they will maintain the highest standards of personal honesty\n                            and integrity in their dealings with the courts. [emphasis added] 37     However, it was also important to note (as\n                    already alluded to above at[29]) that the\n                    facts of the present proceedings werehighly\n                        unusual, to say the least. In particular, although there were\n                    wider implications as mentioned in the preceding paragraph, the actual effect of\n                    the Respondent’s conduct in the context of the actual situation itself was\n                    very narrow. In those circumstances, and taking into account the fact that the\n                    Respondent was attempting to do the complainant a favour without receiving any\n                    personal benefit in return, we were of the view that suspending the Respondent\n                    from practice for two years was an appropriate sanction. 38     As the Law Society stated that it was not\n                    seeking the costs of the present proceedings, we made no order as to costs, save\n                    that the Respondent was to pay the cost of disbursements to the Law\n                    Society."
    }
}