{
    "case_title": "Tan Huey Kuan (alias Chen Huijuan)\n      v\n      Tan Kok Chye and another",
    "ncitation": "[2011] SGHC 86",
    "coram": "Chan Seng Onn J",
    "sections": {
        "The parties": "1       The plaintiff, Tan Huey Kuan (Chen Huijuan), is a senior accounts manager and a competitive dancer, residing in Singapore. The 1stdefendant, Tan Kok Chye, is a Singaporean, currently living and working as a surgeon in the United States (“US”). The 2nddefendant, Lee Seow Lang, is the mother of the 1stdefendant and is a practicing paediatrician with her own private practice in Singapore.",
        "The dispute": "2       The dispute between the plaintiff and more particularly, the 1stdefendant, was over the ownership and possession of a female black terrier dog called “Pookie”, which was subsequently renamed “Sasha” by the parties. Sasha was adopted when it was about ten weeks old from an adoption kennel in Alabama, US, that was managed by the Greater Birmingham Humane Society (“GBHS”). The two central questions were (a) whether the plaintiff and the 1stdefendant had jointly adopted Sasha under the Adoption Agreement dated 15 August 2008, and if so, then (b) who should have possession of Sasha. If Sasha was not jointly adopted but solely adopted by the 1stdefendant, then there would be no question that the 1stdefendant would be given possession of Sasha.",
        "The Adoption Agreement with GBHS": "3       It was not disputed that “Mrs Connie Tan” referred to in the Adoption Agreement was the plaintiff and not some other person. According to the plaintiff, she was always introduced by the 1stdefendant as “Mrs Connie Tan” for social niceties as they were living together at that time although they were not married. Thus, her name appeared in the Adoption Agreement as “Mrs Connie Tan”. It was also not disputed that the 1stdefendant was referred to as “Mr. Kc Tan” in the Adoption Agreement.",
        "The 1stdefendant’s position": "4       The 1stdefendant said that he loved the dog dearly and wanted it back. The 1stdefendant claimed that he was the sole adopter and sole owner of Sasha under the Adoption Agreement because: (a)     He paid the adoption fee and the plaintiff paid nothing. (b)     He paid the vaccination and veterinary fees which were mandatory requirements by GBHS when adopting the pet. (c)     His US driver’s licence and Social Security Number were used for the adoption process. (d)     The identification computer chip embedded in Sasha’s body stated that he was the owner and his home address was the place to return Sasha. (e)     The opening sentence of the Adoption Agreement clearly stated that: “This placement contract is made by and between the Greater Birmingham Humane Society (the “Society”) and Person ID noted above, being over 19 years of age (the “Adopter”), on this 15th day of August 08”. Particulars of the “Person ID” appearing at the top right hand box of the agreement showed “Person ID: 70520”. The 1stdefendant contended that those particulars were generated based on his US Social Security Number and his US driver’s licence. As such, the Adoption Agreement was only between GBHS and the “Person ID”, which was a reference to him specifically and therefore, the plaintiff never became a party to the Adoption Agreement. (f)     He could not sign the Adoption Agreement because his hand was injured on that day and the plaintiff had to sign the agreement on his behalf.",
        "The plaintiff’s position": "5       The plaintiff maintained that she and the 1stdefendant were joint adopters and owners of the dog. I agreed with her for the following reasons: (a)     Her name was clearly reflected in the Adoption Agreement as one of the two named owners, “Mr. & mrs. Kc & Connie Tan”, under “Owners Name” in the box headed “Owners Details”. (b)     She had signed the Adoption Agreement in three places,viz(1) twice under the sub-heading “Adopter’s Initials”; and (2) once as the “Signature” at the end of the Adoption Agreement. I accepted that she had signed the Adoption Agreement in her personal capacity as an adopter as well as on behalf of the 1stdefendant as the other adopter. Accordingly, they had jointly adopted Sasha. (c)     The 1stdefendant sent an email on 19 March 2010 to the plaintiff’s sister where, after calling the plaintiff a “trouble-maker”, he acknowledged that the plaintiff had signed a contractually binding legal agreement with GBHS by stating as follows: The evidence is plain for all to see ….. “You signed a contractually binding legal agreement with The Greater Birmingham Humane Society (The GBHS) on 8/15/2008.  However, you failed to inform us when you repatriated the animal to Singapore. You are alsoclearly in breach of Clause 2C of the contract, specifically – “to permit a follow up visit or inspection of the animal’s living quarters if so requested by the adoption manager or other authorized humane society representative”.Dr Tan has been unable to comply with our demandsbecause of the placement of “Pookie” in your care in Singapore. Dr. Tan has requested that wegrant you a pardon, and to let the matter rest.  We have given due consideration to his request and we are prepared tomake an exceptionand allow you to keep the dog in Singapore.” (Emphasis in original) By stating that the evidence (as set out in the extract that he took from an email sent by GBHS to the plaintiff) was plain for all to see, the 1stdefendant had basically adopted and agreed with all that GBHS had said in that extract. Not only was the 1stdefendant admitting that the plaintiff was a party to the Adoption Agreement, the 1stdefendant went on to say that the plaintiff was a trouble-maker who had in fact breached the Adoption Agreement. Obviously the plaintiff could have breached the Adoption Agreement only if she was also a party to the Adoption Agreement, which was exactly what the plaintiff had been saying all along. (d)     In a letter dated 11 May 2010 sent to the plaintiff’s solicitors from a US law firm, The Shores Law Firm, LLC representing both the defendants, a document titled “CONTRACT FOR TRANSFER OF OWNERSHIP OF SASHA/POOKIE TO MS CONNIE TAN” was attached. The 1stdefendant and 2nddefendant had signed this document in the presence of witnesses and their signatures were notarised. The preamble read as follows: WHEREAS: by Adoption Agreement dated 15 August, 2008 entered into between Dr K.C. Tan, Connie Tan (stated as Mrs. Connie Tan) and Greater Birmingham Humane Society (GBHS) executed solely by Ms. Connie Tan for adoption of the dog known as (Sasha/Pookie) by Dr. K.C. Tan and Ms. Connie Tan; AND WHEREAS Sasha/Pookie was taken to Singapore and cared for by Ms. Connie Tan since November 2008; …. In my view, that document amounted to a signed statement by the 1stdefendant clearly admitting and recognising that the plaintiff, together with him, were joint parties to the Adoption Agreement. This plainly negated the 1stdefendant’s contention that he was the only party to the Adoption Agreement or that the plaintiff had merely signed on his behalf because she never signed it in her personal capacity. If it were true as alleged by the 1stdefendant that the plaintiff was only signing on his behalf, then the Adoption Agreement could simply have omitted including the plaintiff’s name under the “Owners Details”. I further noted that a representative of GBHS had also signed the same document, which would appear to indicate that they also accepted that GBHS had entered into the Adoption Agreement with both parties (and not just with the 1stdefendant alone with the plaintiff merely signing on his behalf as alleged). (e)     The “Person ID: 70520” apparently was merely a reference number given by GBHS for their record, which upon retrieval would then show who the true adopters were. I noted that the Person ID “705201” number bore no resemblance to the 1stdefendant’s US driver’s licence number 8095956 nor to any number shown on his US Social Security Card. (f)     The Pet’s Microchip ID number 476C007D7D embedded in Sasha contained the pet’s name “Pookie”. The 1stdefendant’s email address and two telephone numbers (his mobile telephone number and home telephone number) were given as the primary contact information. In my view, the telephone numbers, names and addresses of the contact persons which were embedded in microchip for the purpose of the HomeAgain Pet Recovery Service were simply to facilitate the return of the missing dog upon being found, but they would not establish ownershipper se. Names and telephone numbers of others could well be given for this purpose as could be seen in this case where there was an alternate contact by the name of Loretta Mann Phone with her phone number also stored in the microchip. 6       Accordingly, I found that the plaintiff and the 1stdefendant were both joint adopters and owners of Sasha. The next question then was which of the two owners should have possession of Sasha since they no longer stayed together. In fact, they literally lived miles apart.",
        "Who was to have possession of Sasha?": "7       For this question, I considered all the affidavit evidence presented to me in relation to the following: (a)Who had been taking care of Sasha all along?(b)Between the plaintiff and the 1stdefendant, who was closer or more attached to Sasha?(c)Was Sasha more attached to the plaintiff or the 1stdefendant?(d)Who would be better able to take care of Sasha and attend to all its needs?(e)What was the home environment for Sasha going to be like?(f)What should be done in the overall best interest of Sasha?8       The plaintiff had looked after Sasha since the adoption and she continues to look after it with support from her family members. Altogether, the plaintiff had looked after Sasha for about 2½ years till date. I accepted the plaintiff’s evidence that Sasha is extremely happy and has bonded and become part of the plaintiff’s family. From the evidence presented to me, which included numerous photographs provided by the plaintiff, I was left in no doubt that the plaintiff adored and loved Sasha. The plaintiff’s strong attachment to Sasha was shown by the extraordinary efforts that she made to look for Sasha when it was found missing from the plaintiff’s home. Sasha clearly had been very well treated and taken care of by the plaintiff and her family members. The plaintiff had the family support to provide a conducive and loving environment for Sasha. There was every reason to let the plaintiff have possession of the dog. I could see no good reason to disrupt the present arrangements and relocate Sasha to the US to be with the 1stdefendant, who lived alone. Unlike the plaintiff, the 1stdefendant did not have the family support to help to look after Sasha, given that he, as a surgeon, might well have to work fairly long hours.9       On many counts, the balance weighed heavily in favour of the plaintiff having possession of Sasha. This would also be in line with the original understanding between the parties as set out in the 1stdefendant’s email to the plaintiff dated 22 Jan 2009 where he “gave Sasha up” to the plaintiff. The 1stdefendant said:I gave Sasha up even though you would have the benefit of your family in Singapore around you and I do not have anyone.  Sasha would have been a huge relief and joy to me here as I live alone.  She would also remind me of you. Still, I gave her up for your happiness. I love you.The 1stdefendant had willingly given possession of Sasha to the plaintiff. In fact, he allowed the plaintiff to bring Sasha to Singapore and made the arrangements for it. On 17 November 2008, Sasha arrived in Singapore. The plaintiff subsequently registered Sasha with the Agri-Food & Veterinary Authority (“AVA”) of Singapore on 5 December 2008 with the 1stdefendant’s knowledge and consent. The AVA dog licence was issued to the plaintiff as the “dog owner”, and one of the conditions of the dog licence was that Sasha must be kept at the plaintiff’s home. Hence, the necessary regulatory requirements for keeping Sasha in Singapore at the plaintiff’s home had been complied with.Orders made10     I declared that both the plaintiff and the 1stdefendant were joint owners of the dog. I ordered possession of the dog to remain with the plaintiff for the reasons that I have stated. Costs of this application together with the earlier interim injunction application (excluding disbursements) were fixed at $10,000, to be paid by the defendants to the plaintiff.Comment11     I had, prior to the hearing before me, given the parties more than enough time and opportunity to resolve the matter. It was rather unfortunate that this dispute could not be settled. As the defendants have appealed to the Court of Appeal, it would appear that the parties intend to continue relentlessly with their battle for the possession of the dog. Before the hearing takes place at the Court of Appeal, perhaps the parties should consider seeking the services of the Singapore Mediation Centre. With good sense prevailing, I believe that there is a fair chance for the dispute to be resolved amicably through mediation.12     In her affidavit, the plaintiff averred,inter alia, that:The 1stDefendant claims that he cares for Sasha that he wanted her back in his life. The court would have noted from some of the emails that I have exhibited in my 1stAffidavit that the 1stDefendant’s main issue was with me. He wanted me back. He did not make a big issue of wanting Sasha back. Sasha is being used now by him as a tool by him to get back at me for whatever perverse reasons he has.It was clear to me that the plaintiff’s relationship with the 1stdefendant had broken down, and even if there were to be any truth in what the plaintiff had said above, parties should realise that it should not be allowed to stand in the way of an amicable settlement.",
        "Orders made": "10     I declared that both the plaintiff and the 1stdefendant were joint owners of the dog. I ordered possession of the dog to remain with the plaintiff for the reasons that I have stated. Costs of this application together with the earlier interim injunction application (excluding disbursements) were fixed at $10,000, to be paid by the defendants to the plaintiff.",
        "Comment": "11     I had, prior to the hearing before me, given the parties more than enough time and opportunity to resolve the matter. It was rather unfortunate that this dispute could not be settled. As the defendants have appealed to the Court of Appeal, it would appear that the parties intend to continue relentlessly with their battle for the possession of the dog. Before the hearing takes place at the Court of Appeal, perhaps the parties should consider seeking the services of the Singapore Mediation Centre. With good sense prevailing, I believe that there is a fair chance for the dispute to be resolved amicably through mediation. 12     In her affidavit, the plaintiff averred,inter alia, that: The 1stDefendant claims that he cares for Sasha that he wanted her back in his life. The court would have noted from some of the emails that I have exhibited in my 1stAffidavit that the 1stDefendant’s main issue was with me. He wanted me back. He did not make a big issue of wanting Sasha back. Sasha is being used now by him as a tool by him to get back at me for whatever perverse reasons he has. It was clear to me that the plaintiff’s relationship with the 1stdefendant had broken down, and even if there were to be any truth in what the plaintiff had said above, parties should realise that it should not be allowed to stand in the way of an amicable settlement."
    }
}