{
    "case_title": "AJE\n      v\n      AJF",
    "ncitation": "[2011] SGHC 115",
    "coram": "Kan Ting Chiu J",
    "sections": {
        "Whether the husband is liable to maintainB": "7       This issue was not brought up in the court below\n                    where the arguments were centred on the quantum of maintenance. However, in an\n                    application for maintenance, it is essential that there be a duty to maintain;\n                    if there is no duty to maintain, then the application for maintenance must\n                    fail. 8       The claim for maintenance forBwas founded on s 70(1) of the Women’s Charter (Cap\n                    353, 2009 Rev Ed) (all references to sections hereinafter shall be references to\n                    the Women’s Charter unless otherwise stated). Section 70(1), (2) and (3)\n                    state: 70. —(1) Where a person has accepted a child who is not his child as\n                        a member of his family, it shall be his duty to maintain that child while he\n                        remains a child, so far as the father or the mother of the child fails to do\n                        so, and the court may make such orders as may be necessary to ensure the\n                        welfare of the child. (2) The duty imposed by subsection (1) shall cease if the child is taken\n                        away by his father or mother. (3) Any sums expended by a person maintaining that child shall be\n                        recoverable as a debt from the father or mother of the child. 9       The husband argued that s 70 has no\n                    application to him because: (a)the wife has been receiving maintenance of $350\n                            per month forBfrom his biological\n                            father;(b)Bis no longer\n                            living with the husband, and the husband has no legal right of access to\n                            him; and(c)under s 70(3) the husband is entitled to\n                            claim from the wife any maintenance he paid forB, and “[i]t would therefore make no sense for\n                            the Court to order the Husband to pay the Wife maintenance forB, only for the Husband to be able to claim the\n                            money back from the Wife”[note: 1]10     The wife’s response was that:(a)the husband was aware thatB’s biological father was paying maintenance forB;(b)the husband has acknowledged that he had been\n                            paying forB’s tuition fees, school\n                            fees, pocket money, meals and expenses, and had affirmed that he had\n                            been maintainingB; and(c)the husband’s interpretation of\n                            s 70(3) should not be adopted.[note: 2]It is to be noted that the husband did not dispute thatBwas accepted by him as a member of his family, and did\n                    not say that he had been denied access toB.11     On the point thatBwas receiving maintenance from his own father, the\n                    husband’s argument relied on the words “so far as the father or\n                    mother of the child fails to [maintain the child]” in s 70(1). The\n                    phrase could have been made clearer. As it stands, it could be construed as\n                    “failing to maintainat all”, or\n                    “failing to maintainadequately”,\n                    and the husband has adopted the former construction.12     It is useful to read the phrase in the proper\n                    context. Section 70(1) provides that a person who accepts a child as a member of\n                    his family has a duty to maintain the child so far as the parents fail to\n                    maintain the child. The words “so far as” must be understood\n                    properly. They have the same meaning as “to the extent that”. In\n                    other words, the duty only starts upon the parents’ failure to maintain\n                    the child adequately. If the child is already adequately maintained by his or\n                    her parents, there is no duty on the non-parent to provide further maintenance\n                    for the child. However, if the child receivessomemaintenance from the parents, which is insufficient for his requirements, then\n                    the non-parent who has accepted the child as a member of his family has the duty\n                    to provide the child with such additional maintenance within his means as is\n                    reasonable for the child.13     As it was not contended or established that\n                    the $350 per month fromB’s father was\n                    sufficient forB’supkeep,B’s receipt of maintenance from his father did not\n                    release the husband from his duty to provide maintenance forB.14     On the husband’s second ground thatBis no longer living with him, that was\n                    because the husband moved out of the matrimonial home and not thatBwas taken away by his father or mother as contemplated\n                    in s 70(2). The husband had not said that he no longer acceptedBas a member of his family, or thatBdoes not want to be accepted as a member of the\n                family.15     Section 70(1) states that when a person\n                        “has accepteda child ... as a member\n                    of his family, it shall be his duty to maintain” the child. It also\n                    states that the person shall have a duty to continue to maintain the child\n                    “while he remains a child” and not while the child continues to be\n                    accepted as a member of the family. Following from that, once the personhas acceptedthe child as a member of his\n                    family, the duty arises, and only ceases when the child ceases to be a child.\n                    There is one express limitation to the scope of the duty. Section 70(2)\n                    provides that the duty shall cease if the child is taken away by his father or\n                    mother. The person has no right to opt out of the duty – s 70 does\n                    not state that after a person has accepted the child as a member of his family,\n                    he can change his mind and stop maintaining the child. Since family acceptance\n                    is the basis for the duty, it can be argued that the duty ends only when, by\n                    circumstances not of the person’s making, the quasi-familial relationship\n                    between the person and the child ends,eg, when\n                    the child renounces the relationship, or he is taken away by his\n                parent.16     On the husband’s third point that any\n                    maintenance he pays toBis recoverable from the\n                    wife as a debt under s 70(3), the provision raises difficult\n                    questions:(a)as the maintenance is paid in the discharge of\n                            duty imposed by law on the non-parent, why is it recoverable as a debt\n                            from the father or mother of the child?(b)why should the person who had voluntarily\n                            accepted a child as a member of his family have recourse against the\n                            child’s parents for expenditure he incurs on the\n                        child?(c)as the amount of maintenance to be paid is\n                            dependent on the means of the non-parent, why should the father or\n                            mother repay to the non-parent the amount he paid based on his means and\n                            without regard to their means?(d)is the liability of the father or mother to repay\n                            a joint or several liability?17     The husband is relying on s 70(3) because\n                    it is there, and he may not be able to, and in any event, he is not the best\n                    party to answer the questions. It suffices, however, to note that on any reading\n                    of s 70 as a whole, s 70(3) cannot cancel s 70(1).Whether the maintenance for the wife should be varied18     The wife is seeking an upward revision, and\n                    the husband wants a reduction of the maintenance.19     The husband is a successful businessman. He is\n                    the managing director of a reputable construction services company, and has\n                    annual income of $600,000, or $50,000 a month. The wife is not working. She\n                    holds a diploma from an Australian insurance institute and had worked for 10\n                    years as an insurance agent before her marriage to the husband, and continues to\n                    receive $10,000 a year from a former employer.20     The wife claimed $15,000 for maintenance,\n                    excluding payments of housing loans, hospital insurance for herself and the\n                    children and expenses incurred on her child.[note: 3]The husband, on the other\n                    hand, asserted that he had been paying $10,976.67 for the maintenance of the\n                    wife,BandCand\n                    that sum is greater than their needs.[note: 4](That included maintenance\n                    forBas the issues under s 70 were not\n                    raised at that stage.) In the event, the DJ ordered maintenance for the wife,BandCtotalling to $16,155.55, including maintenance forB.21     The husband’s appeal raised the legal\n                    issue under s 70, which I have dealt with. Besides that issue he did not\n                    question the DJ’s quantification of the maintenance forBandC.22     The DJ made his award after he heard the\n                    husband and wife, and he was satisfied that “the husband had cut back the\n                    wife’s access to some of the funds to which she had almost unrestrained\n                    access previously.”[note: 5]23     In arriving at the quantum of the award, the\n                    DJ took into account:(a)the husband’s earnings of $50,000 a\n                            month;(b)the wife’s failure to disclose her\n                            financial resources; and(c)the fact that the wife suffered from depression\n                            which led to her lavish expenditure.[note: 6]24     Having reviewed the evidence and arguments of\n                    both parties, I find that neither party has presented a case for the DJ’s\n                    quantification of maintenance to be disturbed.Whether the maintenance payments should be backdated25     The maintenance order was made on 20 May\n                    2010 to take effect from 1 June 2010. The wife had applied for maintenance\n                    to be backdated to June 2008 on the ground that the husband had neglected\n                    or refused to provide reasonable maintenance since that time.[note: 7]26     When a maintenance order is made, the\n                    operative date of the order is provided. It is usually one of the\n                    following:(a)the date from which the defendant had failed to\n                            pay proper maintenance;(b)the date of the filing of the maintenance\n                            application;(c)the date of the order;(d)the month following the date of the\n                        order.27     The determination of the operative date is\n                    governed by the facts of each case. If the applicant had to incur debts or sell\n                    possessions to make up for the shortfall in maintenance, that would be a strong\n                    ground for backdating the maintenance. On the other hand, if the applicant had\n                    been able to manage with the pre-order maintenance, back-payment would be a\n                    windfall, and the case for backdating would be weaker.28     In the present case, the DJ explained in\n                        [10] of his grounds of decision that\n                    he did not backdate his order because:The court did not find it necessary to backdate the award as there was no\n                        credible evidence before it of the assets of the wife. The husband in his\n                        evidence had made the point that he believed the wife had considerable\n                        assets and could save up to $40,000 to $50,000 a year. The court agreed that\n                        this had to be given due weight particularly in the absence of any\n                        meaningful disclosure by the wife of her own savings and assets.29     The DJ found that “[t]he court had no\n                    evidence ... of the wife’s own financial resources as they were not\n                    disclosed by her”[note: 8]and decided not to backdate the maintenance.\n                    As the wife’s financial circumstances is a factor to be taken into\n                    consideration in deciding whether to backdate maintenance, it cannot be said\n                    that the DJ’s decision was wrong or unreasonable.Whether the order for direct payments should have been made30     The wife’s complaint was\n                        that[note: 9]:To allow the Respondent to continue to yield such control over the sum due\n                        to the Wife (as the Lower Court ordered in this case), accords the Husband\n                        unnecessary and undesirable “control” over the Wife and\n                        children.31     The DJ’s order for the husband to make\n                    direct payments for some items of the maintenance order,eg, conservancy charges for the matrimonial home, car loan\n                    instalments, road tax and insurance, housing loans, fixed loans, property tax,\n                    and to pay other items upon production of proof of payment by the wife, is not\n                    the normal order.32     The DJ did not make this order arbitrarily. He\n                    had noted in the grounds of decision that the wife had withdrawn $18,500 from a\n                    joint bank account with the husband without his knowledge or consent, and that\n                    she was disposed to lavish spending when she was depressed. The DJ had doubts\n                    over her ability to manage money responsibly after having seen and heard both\n                    parties. In any event, those payment terms were not oppressive or unreasonable,\n                    and they should be retained.Whether the wife should be awarded the costs for the\n                application33     The DJ did not address the question of costs\n                    at all in his grounds of decision. The wife had applied for maintenance and\n                    obtained payments which she would not have received otherwise. I am unable to\n                    see why she should be deprived of her costs entirely. However, taking into\n                    account her excessive claim and her failure to disclose her assets, she should\n                    not have full costs. I order that she get half the costs of the\n                    application.Costs for the appeals34     The wife had succeeded partially in the claim\n                    for the costs of the application, but had failed in the other parts of her\n                    appeal. Each party is to bear its own costs in her appeal. The husband appealed\n                    over the quantum of maintenance for the wife and his liability to maintainB, and he had failed on both issues. The wife\n                    will have the costs of his appeal.[note: 1]Appellant’s (Husband) Case, DCA 30 of 2010, paras\n                                        28–30[note: 2]Respondent’s Case DCA30 of 2010, paras 8, 10, 11 and\n                                        17[note: 3]Grounds of\n                                Decision, para 5[note: 4]Grounds of\n                                Decision, para 8[note: 5]Grounds of Decision, para\n                            10[note: 6]Grounds of Decision, para\n                            10[note: 7]Record of Appeal Vol.2, p\n                37[note: 8]Grounds of Decision, para\n                            10[note: 9]Appellant’s Case in DCA 29 of 2010, para\n                                33",
        "Whether the maintenance for the wife should be varied": "18     The wife is seeking an upward revision, and\n                    the husband wants a reduction of the maintenance. 19     The husband is a successful businessman. He is\n                    the managing director of a reputable construction services company, and has\n                    annual income of $600,000, or $50,000 a month. The wife is not working. She\n                    holds a diploma from an Australian insurance institute and had worked for 10\n                    years as an insurance agent before her marriage to the husband, and continues to\n                    receive $10,000 a year from a former employer. 20     The wife claimed $15,000 for maintenance,\n                    excluding payments of housing loans, hospital insurance for herself and the\n                    children and expenses incurred on her child.[note: 3]The husband, on the other\n                    hand, asserted that he had been paying $10,976.67 for the maintenance of the\n                    wife,BandCand\n                    that sum is greater than their needs.[note: 4](That included maintenance\n                    forBas the issues under s 70 were not\n                    raised at that stage.) In the event, the DJ ordered maintenance for the wife,BandCtotalling to $16,155.55, including maintenance forB. 21     The husband’s appeal raised the legal\n                    issue under s 70, which I have dealt with. Besides that issue he did not\n                    question the DJ’s quantification of the maintenance forBandC. 22     The DJ made his award after he heard the\n                    husband and wife, and he was satisfied that “the husband had cut back the\n                    wife’s access to some of the funds to which she had almost unrestrained\n                    access previously.”[note: 5] 23     In arriving at the quantum of the award, the\n                    DJ took into account: (a)the husband’s earnings of $50,000 a\n                            month;(b)the wife’s failure to disclose her\n                            financial resources; and(c)the fact that the wife suffered from depression\n                            which led to her lavish expenditure.[note: 6]24     Having reviewed the evidence and arguments of\n                    both parties, I find that neither party has presented a case for the DJ’s\n                    quantification of maintenance to be disturbed.Whether the maintenance payments should be backdated25     The maintenance order was made on 20 May\n                    2010 to take effect from 1 June 2010. The wife had applied for maintenance\n                    to be backdated to June 2008 on the ground that the husband had neglected\n                    or refused to provide reasonable maintenance since that time.[note: 7]26     When a maintenance order is made, the\n                    operative date of the order is provided. It is usually one of the\n                    following:(a)the date from which the defendant had failed to\n                            pay proper maintenance;(b)the date of the filing of the maintenance\n                            application;(c)the date of the order;(d)the month following the date of the\n                        order.27     The determination of the operative date is\n                    governed by the facts of each case. If the applicant had to incur debts or sell\n                    possessions to make up for the shortfall in maintenance, that would be a strong\n                    ground for backdating the maintenance. On the other hand, if the applicant had\n                    been able to manage with the pre-order maintenance, back-payment would be a\n                    windfall, and the case for backdating would be weaker.28     In the present case, the DJ explained in\n                        [10] of his grounds of decision that\n                    he did not backdate his order because:The court did not find it necessary to backdate the award as there was no\n                        credible evidence before it of the assets of the wife. The husband in his\n                        evidence had made the point that he believed the wife had considerable\n                        assets and could save up to $40,000 to $50,000 a year. The court agreed that\n                        this had to be given due weight particularly in the absence of any\n                        meaningful disclosure by the wife of her own savings and assets.29     The DJ found that “[t]he court had no\n                    evidence ... of the wife’s own financial resources as they were not\n                    disclosed by her”[note: 8]and decided not to backdate the maintenance.\n                    As the wife’s financial circumstances is a factor to be taken into\n                    consideration in deciding whether to backdate maintenance, it cannot be said\n                    that the DJ’s decision was wrong or unreasonable.Whether the order for direct payments should have been made30     The wife’s complaint was\n                        that[note: 9]:To allow the Respondent to continue to yield such control over the sum due\n                        to the Wife (as the Lower Court ordered in this case), accords the Husband\n                        unnecessary and undesirable “control” over the Wife and\n                        children.31     The DJ’s order for the husband to make\n                    direct payments for some items of the maintenance order,eg, conservancy charges for the matrimonial home, car loan\n                    instalments, road tax and insurance, housing loans, fixed loans, property tax,\n                    and to pay other items upon production of proof of payment by the wife, is not\n                    the normal order.32     The DJ did not make this order arbitrarily. He\n                    had noted in the grounds of decision that the wife had withdrawn $18,500 from a\n                    joint bank account with the husband without his knowledge or consent, and that\n                    she was disposed to lavish spending when she was depressed. The DJ had doubts\n                    over her ability to manage money responsibly after having seen and heard both\n                    parties. In any event, those payment terms were not oppressive or unreasonable,\n                    and they should be retained.Whether the wife should be awarded the costs for the\n                application33     The DJ did not address the question of costs\n                    at all in his grounds of decision. The wife had applied for maintenance and\n                    obtained payments which she would not have received otherwise. I am unable to\n                    see why she should be deprived of her costs entirely. However, taking into\n                    account her excessive claim and her failure to disclose her assets, she should\n                    not have full costs. I order that she get half the costs of the\n                    application.Costs for the appeals34     The wife had succeeded partially in the claim\n                    for the costs of the application, but had failed in the other parts of her\n                    appeal. Each party is to bear its own costs in her appeal. The husband appealed\n                    over the quantum of maintenance for the wife and his liability to maintainB, and he had failed on both issues. The wife\n                    will have the costs of his appeal.[note: 1]Appellant’s (Husband) Case, DCA 30 of 2010, paras\n                                        28–30[note: 2]Respondent’s Case DCA30 of 2010, paras 8, 10, 11 and\n                                        17[note: 3]Grounds of\n                                Decision, para 5[note: 4]Grounds of\n                                Decision, para 8[note: 5]Grounds of Decision, para\n                            10[note: 6]Grounds of Decision, para\n                            10[note: 7]Record of Appeal Vol.2, p\n                37[note: 8]Grounds of Decision, para\n                            10[note: 9]Appellant’s Case in DCA 29 of 2010, para\n                                33",
        "Whether the maintenance payments should be backdated": "25     The maintenance order was made on 20 May\n                    2010 to take effect from 1 June 2010. The wife had applied for maintenance\n                    to be backdated to June 2008 on the ground that the husband had neglected\n                    or refused to provide reasonable maintenance since that time.[note: 7] 26     When a maintenance order is made, the\n                    operative date of the order is provided. It is usually one of the\n                    following: (a)the date from which the defendant had failed to\n                            pay proper maintenance;(b)the date of the filing of the maintenance\n                            application;(c)the date of the order;(d)the month following the date of the\n                        order.27     The determination of the operative date is\n                    governed by the facts of each case. If the applicant had to incur debts or sell\n                    possessions to make up for the shortfall in maintenance, that would be a strong\n                    ground for backdating the maintenance. On the other hand, if the applicant had\n                    been able to manage with the pre-order maintenance, back-payment would be a\n                    windfall, and the case for backdating would be weaker.28     In the present case, the DJ explained in\n                        [10] of his grounds of decision that\n                    he did not backdate his order because:The court did not find it necessary to backdate the award as there was no\n                        credible evidence before it of the assets of the wife. The husband in his\n                        evidence had made the point that he believed the wife had considerable\n                        assets and could save up to $40,000 to $50,000 a year. The court agreed that\n                        this had to be given due weight particularly in the absence of any\n                        meaningful disclosure by the wife of her own savings and assets.29     The DJ found that “[t]he court had no\n                    evidence ... of the wife’s own financial resources as they were not\n                    disclosed by her”[note: 8]and decided not to backdate the maintenance.\n                    As the wife’s financial circumstances is a factor to be taken into\n                    consideration in deciding whether to backdate maintenance, it cannot be said\n                    that the DJ’s decision was wrong or unreasonable.Whether the order for direct payments should have been made30     The wife’s complaint was\n                        that[note: 9]:To allow the Respondent to continue to yield such control over the sum due\n                        to the Wife (as the Lower Court ordered in this case), accords the Husband\n                        unnecessary and undesirable “control” over the Wife and\n                        children.31     The DJ’s order for the husband to make\n                    direct payments for some items of the maintenance order,eg, conservancy charges for the matrimonial home, car loan\n                    instalments, road tax and insurance, housing loans, fixed loans, property tax,\n                    and to pay other items upon production of proof of payment by the wife, is not\n                    the normal order.32     The DJ did not make this order arbitrarily. He\n                    had noted in the grounds of decision that the wife had withdrawn $18,500 from a\n                    joint bank account with the husband without his knowledge or consent, and that\n                    she was disposed to lavish spending when she was depressed. The DJ had doubts\n                    over her ability to manage money responsibly after having seen and heard both\n                    parties. In any event, those payment terms were not oppressive or unreasonable,\n                    and they should be retained.Whether the wife should be awarded the costs for the\n                application33     The DJ did not address the question of costs\n                    at all in his grounds of decision. The wife had applied for maintenance and\n                    obtained payments which she would not have received otherwise. I am unable to\n                    see why she should be deprived of her costs entirely. However, taking into\n                    account her excessive claim and her failure to disclose her assets, she should\n                    not have full costs. I order that she get half the costs of the\n                    application.Costs for the appeals34     The wife had succeeded partially in the claim\n                    for the costs of the application, but had failed in the other parts of her\n                    appeal. Each party is to bear its own costs in her appeal. The husband appealed\n                    over the quantum of maintenance for the wife and his liability to maintainB, and he had failed on both issues. The wife\n                    will have the costs of his appeal.[note: 1]Appellant’s (Husband) Case, DCA 30 of 2010, paras\n                                        28–30[note: 2]Respondent’s Case DCA30 of 2010, paras 8, 10, 11 and\n                                        17[note: 3]Grounds of\n                                Decision, para 5[note: 4]Grounds of\n                                Decision, para 8[note: 5]Grounds of Decision, para\n                            10[note: 6]Grounds of Decision, para\n                            10[note: 7]Record of Appeal Vol.2, p\n                37[note: 8]Grounds of Decision, para\n                            10[note: 9]Appellant’s Case in DCA 29 of 2010, para\n                                33",
        "Whether the order for direct payments should have been made": "30     The wife’s complaint was\n                        that[note: 9]: To allow the Respondent to continue to yield such control over the sum due\n                        to the Wife (as the Lower Court ordered in this case), accords the Husband\n                        unnecessary and undesirable “control” over the Wife and\n                        children. 31     The DJ’s order for the husband to make\n                    direct payments for some items of the maintenance order,eg, conservancy charges for the matrimonial home, car loan\n                    instalments, road tax and insurance, housing loans, fixed loans, property tax,\n                    and to pay other items upon production of proof of payment by the wife, is not\n                    the normal order. 32     The DJ did not make this order arbitrarily. He\n                    had noted in the grounds of decision that the wife had withdrawn $18,500 from a\n                    joint bank account with the husband without his knowledge or consent, and that\n                    she was disposed to lavish spending when she was depressed. The DJ had doubts\n                    over her ability to manage money responsibly after having seen and heard both\n                    parties. In any event, those payment terms were not oppressive or unreasonable,\n                    and they should be retained.",
        "Whether the wife should be awarded the costs for the\n                application": "33     The DJ did not address the question of costs\n                    at all in his grounds of decision. The wife had applied for maintenance and\n                    obtained payments which she would not have received otherwise. I am unable to\n                    see why she should be deprived of her costs entirely. However, taking into\n                    account her excessive claim and her failure to disclose her assets, she should\n                    not have full costs. I order that she get half the costs of the\n                    application.",
        "Costs for the appeals": "34     The wife had succeeded partially in the claim\n                    for the costs of the application, but had failed in the other parts of her\n                    appeal. Each party is to bear its own costs in her appeal. The husband appealed\n                    over the quantum of maintenance for the wife and his liability to maintainB, and he had failed on both issues. The wife\n                    will have the costs of his appeal.  [note: 1]Appellant’s (Husband) Case, DCA 30 of 2010, paras\n                                        28–30 [note: 2]Respondent’s Case DCA30 of 2010, paras 8, 10, 11 and\n                                        17 [note: 3]Grounds of\n                                Decision, para 5 [note: 4]Grounds of\n                                Decision, para 8 [note: 5]Grounds of Decision, para\n                            10 [note: 6]Grounds of Decision, para\n                            10 [note: 7]Record of Appeal Vol.2, p\n                37 [note: 8]Grounds of Decision, para\n                            10 [note: 9]Appellant’s Case in DCA 29 of 2010, para\n                                33"
    }
}