{
    "case_title": "Public Prosecutor\n      v\n      Koh Seah Wee and another",
    "ncitation": "[2011] SGHC 240",
    "coram": "Tay Yong Kwang J",
    "sections": {
        "The accused persons": "1       The accused persons were former colleagues in\n                    the Singapore Land Authority (“SLA”). At the material time, Koh\n                    Seah Wee (“Koh”), now 41 years old, was the deputy director of the\n                    SLA’s Technology and Infrastructure (“TI”) department while\n                    Lim Chai Meng (“Lim”), now aged 38, was the said\n                    department’s manager, a position subordinate to that of\n                    Koh’s. 2       Between 11 February 1997 and 20 July\n                    2004, Koh was a consultant in the information technology department of the\n                    Supreme Court. From 21 July 2004 to 11 March 2007, he worked as a\n                    consultant in the information technology department of the Intellectual Property\n                    Office of Singapore (“IPOS”). He then moved to the SLA’s TI\n                    department and worked there until 31 March 2010. For the next two months,\n                    he worked in the Accounting and Corporate Regulatory Authority of\n                    Singapore. 3       Lim was employed as a manager in the TI\n                    department of SLA from 1 July 2006 to 30 April 2010. He resigned from\n                    SLA on 30 April 2010 and remained unemployed thereafter, not bothering to\n                    look for a job as (according to his defence counsel) he knew it was a matter of\n                    time that the law would close in on him.",
        "The charges": "4       Koh faced a total of 372 charges. He pleaded\n                    guilty to 55 charges of which 46 concerned the offences of cheating (s 420 Penal\n                    Code Cap 224) or conspiracy to cheat (s 420 read with s 109 Penal\n                    Code). Nine charges related to concealment or conversion of properties\n                    representing his benefits from criminal conduct punishable under s 47(6) of\n                    the Corruption, Drug Trafficking and Other Serious Crimes (Confiscation of\n                    Benefits) Act (Cap 65A) (“Confiscation of Benefits Act”). The\n                    two categories of offences will be referred to hereafter as the cheating and the\n                    money laundering offences. In addition, Koh admitted and consented to the\n                    remaining 317 charges involving cheating and money laundering offences to be\n                    taken into consideration for the purpose of sentencing. 5       Lim face a total of 309 charges. He pleaded\n                    guilty to 49 charges. Out of these, 40 charges concerned the offence of\n                    conspiracy to cheat SLA and one charge involved a conspiracy to cheat a finance\n                    company, Sing Investments & Finance Limited (“Sing\n                    Investments”). The other 8 charges were for money laundering offences.\n                    Lim also admitted and consented to the remaining 260 charges of cheating and\n                    money laundering offences to be taken into consideration for the purpose of\n                    sentencing.",
        "The factual background": "",
        "Koh and Lim": "6       On 15 June 2010 (after both Koh and Lim\n                    were no longer working in SLA), SLA lodged a police report alleging that goods\n                    and services procured through some purchase orders put up by Lim and\n                    subsequently approved by Koh were fictitious. The Commercial Affairs Department\n                    (“CAD”) commenced investigations which led to the discovery of\n                    more offences committed by Koh during his earlier employment in the Supreme\n                    Court and IPOS. The investigations also revealed that there were seven\n                    accomplices who aided Koh and Lim in the cheating offences, the most notable of\n                    whom was a man named Ho Yen Teck (“Ho”), aged 31, the owner of\n                    seven sole proprietorships and a full-time sales executive of a local company at\n                    the material time. 7       Lim was the procurement/verifying officer\n                    responsible for the requisition of goods and services required by SLA’s TI\n                    department. The procurement procedure to be followed depended on the value of\n                    the goods and services in question. For values of up to $3,000, Lim, the vendors\n                    or an in-house third party vendor would submit the invoices directly to\n                    SLA’s finance department. For values of between $3,001 and $80,000, Lim\n                    would create an Invitation-to-Quote (“ITQ”) in the government\n                    procurement portal known as GeBiz. 8       Part of Lim’s scope of work was to\n                    identify the business needs of the TI department and to justify those needs to\n                    Koh. Once Koh gave the permission to send out an ITQ, Lim would put up the\n                    requirements and specifications on GeBiz. When the quotations were received, Lim\n                    would make recommendations to Koh on whom to award the contract to. Koh could\n                    approve contracts of up to $60,000 in value. 9       Once Koh approved the contract, a purchase order\n                    would be generated and sent to the successful vendor. The vendor would send an\n                    invoice to SLA which would forward the invoice to the TI department for Lim to\n                    verify and for Koh to approve for payment. Upon Koh’s approval,\n                    SLA’s finance department would pay the money to the vendor. 10     Koh and Lim would rig the quotation results by\n                    arranging for their own “vendors” (the accomplices) to offer the\n                    lowest quotations which Lim would recommend and Koh would approve. Lim would\n                    also assist in preparing fictitious invoices for some of the\n                    “vendors” for submission to SLA’s finance\n                department. 11     For contracts not exceeding $3,000 in value,\n                    Lim would ask for quotations directly from the vendor if the price of the item\n                    in question was known and was reasonable. If the price was not known, Lim had\n                    the discretion to ask other vendors to submit quotations. The successful vendor\n                    would submit an invoice to Lim who would pass it on to the finance department.\n                    Alternatively, the vendor would submit an invoice directly to the finance\n                    department. The finance department would then send a system-generated email to\n                    Lim to verify that delivery of goods had been made or the service rendered. Upon\n                    Lim’s verification, an email alert would be sent to Koh for his approval\n                    to make payment to the vendor. For such lower value contracts, Lim would provide\n                    the descriptions and the amounts to the “vendor” for submission of\n                    invoice for payment. 12     All the specifications listed in GeBiz and the\n                    lower value contracts were not required by SLA and were fictitious in one or\n                    more of the following ways in that they were for: (a)     maintenance of equipment which SLA\n                        did not have; (b)     maintenance of equipment for which SLA already had existing agreements with\n                        other vendors; (c)     goods and services which SLA did not need; (d)     duplicated specifications;\n                    and (e)     no goods or\n                        services were actually supplied. Through this fraudulent\n                    scheme, contracts were awarded to the “vendors” which had no\n                    intention of fulfilling them and which were not able to in any case. 282 such\n                    contracts were awarded to 11 “vendors” which were merely façades\n                    operated by the seven accomplices. As a consequence, SLA was dishonestly induced\n                    to pay the “vendors” a sum of more than $12.1m. Once payment was\n                    made by SLA, the money would be withdrawn from the respective vendors’\n                    accounts and the cash would then be handed over to Koh. The accomplices would be\n                    given a share of the money but the bulk of it would go to Koh and Lim. The\n                    prosecution was not able to state the proportions of the loot as between Koh and\n                    Lim.",
        "Koh": "13     The investigations conducted by CAD uncovered\n                    earlier wrongdoing by Koh when he was working at IPOS and the Supreme Court. He\n                    committed fraud at these organizations by dishonestly concealing his financial\n                    interests in the vendors submitting quotations which were evaluated by him and\n                    submitted for approval by his superiors. Further, in most of the 15 contracts in\n                    question at IPOS, the quotations by his accomplice were submitted after the\n                    close of ITQ when all other quotations were already known to Koh, thus enabling\n                    his accomplice to submit the lowest bids. More than half of the contracts were\n                    for goods and services not required by IPOS and were fictitious in one or more\n                    of the ways set out at[12](b), (c) and (d)\n                    above. A total of $254,142 was paid out in these contracts. 14     Koh, who is married and has a young daughter,\n                    used the fraudulently obtained money to buy private properties in his or in his\n                    wife’s name, to open bank accounts in the names of family members,\n                    withdrawing the cash soon after that, to invest in unit trusts and shares, to\n                    buy luxury goods with high retention values and to indulge in expensive cars\n                    such as a limited edition of a Lamborghini LP 670 SV (with number plate SDP\n                    88R), a Mercedes Benz E350 Coupe (registered as SJH 8T) and a Mercedes Benz E200\n                    (registered as SDP 40C). The first two cars were registered in his wife’s\n                    name while the third was registered in his mother’s name. All three cars\n                    were seized and subsequently sold as they were depreciating\n                assets. 15     The CAD managed to seize properties and cash\n                    from Koh and his family worth some $7.54m (not including a number of luxury\n                    watches, luxury bags and jewellery which have not been valued). Out of this\n                    amount, some $1.5m is the subject of adverse claims, the merits of which have\n                    not yet been determined.",
        "Lim": "16     Lim is married and has four children (two of\n                    whom were from his wife’s previous marriage). He used the illegally\n                    obtained money in much the same ways as Koh did. In fact, both accused persons\n                    went together to visit the showroom of the condominium called Optima@Tanah Merah\n                    where Koh purchased unit 08-14 in his wife’s name and Lim booked unit\n                    09-14. This turned out to be a fairly good investment as 09-14 was resold at a\n                    modest profit. Lim also bought another private property with his\n                wife. 17     Lim deposited some of his criminal proceeds\n                    into the bank accounts of his family members and withdrew the cash soon\n                    thereafter. He also opened a bank account in his own name for the purpose of\n                    depositing cash obtained from cheating SLA. 18     Like Koh, Lim also bought expensive cars.\n                    However, unlike Koh, Lim traded in one car for another and did not have three at\n                    the same time. The series of cars included an Audi TT Coupe 2.0, a Porsche\n                    Cayman S Tip and a second-hand Ferrari F430 F1 (bearing the registration plate\n                    SJV 82D). It was in the process of buying the Ferrari that the cheating offence\n                    against Sing Investments was committed. 19     The Ferrari cost some $721,000 and Lim needed\n                    a loan of $350,000 loan from Sing Investments. Based on the salary stated in his\n                    official payslip, he would not have qualified for such an amount in loan. The\n                    owner of the car dealer company selling the Ferrari helped Lim to create a false\n                    document stating that Lim was a consultant of an existing company earning\n                    $20,000 per month, an income level that qualified Lim for the $350,000 loan. The\n                    use of this false document deceived Sing Investments into granting Lim the loan\n                    and he bought the Ferrari. Unfortunately, Lim crashed the Ferrari in an accident\n                    along Nicoll Highway in December 2009 and the car has since been scrapped and\n                    sold for $10,800. Some $210,000 were also received by way of road tax refund and\n                    registration fee and certificate of entitlement rebates. 20     The CAD seized properties and cash from Lim\n                    and his family worth some $1.43m (not including some luxury watches and luxury\n                    bags which have not been valued). Out of this amount, some $38,000 is the\n                    subject of adverse claims, the merits of which have not yet been\n                    determined.",
        "The prosecution’s submissions on sentence": "21     Both Koh and Lim have no criminal record.\n                    However, the prosecution submitted that “a heavy deterrent sentence is\n                    called for in view of the unprecedented scale and magnitude of fraud” in\n                    this case, highlighting the following matters: (a)     The cheating offences were against a\n                        public institution (and against three such institutions in the case of Koh)\n                        over a substantial period of time (more than 10 years for Koh and more than\n                        2 years for Lim), resulting in loss of an astronomically large sum of public\n                        funds. Offences against public institutions impinge on larger national and\n                        public interests; (b)     There was an egregious abuse of trust and position by public servants\n                        in the discharge of official duties; (c)     Such collusive fraud was often hard to\n                    detect; (d)     The accused\n                        persons’ roles as coordinating masterminds of an elaborate and\n                        organized fraud; (e)     The offences seriously undermined public confidence in the integrity\n                        of our country’s public procurement processes; and (f)     The accused persons were sophisticated\n                        offenders who engaged in systematic and elaborate laundering of criminal\n                        proceeds. 22     Due to the circumstances here, the accused\n                    persons should each receive in total more than the maximum imprisonment period\n                    of 14 years that the district court may impose in any one case under the\n                    provisions of the Criminal Procedure Code (Cap 68, 1985 Rev Ed) (it\n                    was not in dispute that the Criminal Procedure Code in force before 2011 applies\n                    to this case). 23     The prosecution argued that the guilty pleas\n                    were not motivated by genuine remorse and should therefore be accorded little\n                    mitigating weight. The accused persons here knew that their game was up when CAD\n                    came into the picture and “their guilty pleas stem from a pragmatic\n                    realization that there is no point in delaying the inevitable”.\n                    “It is all too easy for an offender to say he is sorry when the strong\n                    arm of the law has caught up with him” (Chen WeixiongJerrick v Public Prosecutor[2003]\n                    2 SLR(R) 334 at [23]). 24     The prosecution also contended that there was\n                    no real restitution as most of the assets recovered were seized by the CAD in\n                    the course of its investigations. While the recovered assets would reduce the\n                    overall financial loss caused to SLA, they should not be viewed as evidence of\n                    remorse. 25     The “one transaction rule”\n                    should not apply to this case as there was no proximity in time in the multiple\n                    offences. Consecutive imprisonment terms should be imposed on the accused\n                    persons “for a significant number of charges so that the court may show\n                    its abhorrence of the nefarious conduct” in this case. The prosecution\n                    cited the Court of Appeal’s decision inADF v\n                        PP[2010] 1 SLR 874 for the proposition that more than\n                    two consecutive imprisonment sentences ought to be given serious consideration\n                    in dealing with distinct offences when one or more of the following factors are\n                    present: (a)Persistent or habitual offenders;(b)There is a pressing public interest concern in\n                            discouraging the type of criminal conduct being punished;(c)There are multiple victims; and(d)Other peculiar cumulative aggravating features\n                            are present.26     The sentences on the charges that the\n                    prosecution has proceeded on should also be enhanced in view of the substantial\n                    number of charges taken into consideration. The prosecution referred to three\n                    cases involving large scale fraud heard by the High Court for comparison. They\n                    are:(a)PP v Teo Cheng Kiat[2000] SGHC 129The accused in that case, a supervisor in Singapore Airline,\n                        misappropriated about $35m from the airline. About $24m were recovered. A\n                        high degree of trust was reposed in him. For the 10 charges of criminal\n                        breach of trust by a servant under s 408 Penal Code, with 16 other\n                        charges taken into consideration, he was sentenced to a total of 24 years\n                        imprisonment upon his plea of guilt.(b)PP v Lam Cheng Fong[2002] 2 SLR(R) 599The accused in that case operated a money remittance business\n                        and embezzled almost $8.8m from more than 1,000 foreign workers here within\n                        a period of 3 months. Only $905,000 was recovered while the rest of the\n                        money was squandered by the accused. He pleaded guilty to 20 charges of\n                        criminal breach of trust as an agent under s 409 Penal Code, one charge\n                        of money laundering and one charge under s 241 Penal Code. 1,190 other\n                        charges were taken into consideration for sentencing purposes. The court\n                        imposed a total of 22 years imprisonment.(c)PP v Chia Teck Leng[2004] SGHC 68The accused there was the finance manager of Asia Pacific Brewery\n                    (Singapore) Pte Ltd. He cheated four banks of some $117m and squandered about\n                    $62m in gambling at casinos. He pleaded guilty to 6 charges under s 467\n                    Penal Code and 8 charges under s 420 Penal Code, with 32 other charges\n                    taken into consideration. He received a total of 42 years\n                imprisonment.27     The accomplice Ho has been sentenced by the\n                    district court to 10 years imprisonment. He pleaded guilty to 21 cheating\n                    charges with 174 similar charges taken into consideration. His assistance in the\n                    criminal acts caused SLA to disburse more than $9.7m to the seven sole\n                    proprietorships in his name. His share of the criminal proceeds was about\n                    $200,000 only.28     The prosecution submitted that Koh should be\n                    sentenced to an aggregate imprisonment term of between 20 and 24 years while Lim\n                    should be given a total of between 16 and 20 years.Mitigation for Koh29     Koh’s early guilty plea and full\n                    cooperation with CAD indicated that he was sincerely remorseful over his\n                    actions. He has saved time and effort on the investigators’ part by\n                    admitting his wrongdoing and cooperating with them during investigations and\n                    helping in the tracing of the assets. A protracted trial has also been\n                    obviated.30     Koh was on holiday in the United States of\n                    America when he was informed that the CAD was looking for him. He chose to\n                    return to Singapore to surrender himself after meeting his counsel in Malaysia\n                    and reflecting on the matter for a few days. The CAD was duly informed of the\n                    time and place of Koh’s return to Singapore. He was arrested on\n                    23 June 2010 and charged in court on 25 June 2010 after which he has\n                    remained in remand. He made it clear from the outset that he would be pleading\n                    guilty at the earliest available opportunity. It was argued that a wrong message\n                    would be sent if a heavy sentence were imposed as that would be telling\n                    offenders that if they came back, they would be hammered to a\n                pulp.31     Koh’s wife used to be a home-maker but\n                    has been forced by the circumstances to work part time to support herself and\n                    their 9 year old daughter. They are now living in rented premises. They were\n                    shocked by the revelations as Koh had merely informed his wife that he had made\n                    some good investments in information technology businesses.32     Koh served our nation as a field engineer\n                    officer during his national service. He graduated in electrical engineering with\n                    first class honours from the Queensland University of Technology and was granted\n                    membership in the Golden Key National Honour Society in the said university. He\n                    could have been a very successful person but for the wrongdoing.33     Koh acknowledged that as he was Lim’s\n                    superior officer in SLA, more trust was reposed in him and he was therefore the\n                    more culpable offender between them. He denied however that he instigated Lim to\n                    commit the cheating offences (see Lim’s version at[40]and[41]below). They simply had discussions and both agreed to cheat SLA together. He\n                    maintained that the criminal proceeds between him and Lim were shared equally\n                    while some of the money was given to the accomplices. That was also the case\n                    with the final round of cheating offences in March 2010 against SLA involving\n                    more than $3m (Lim denied this – see[45]below).34     Koh also denied Lim’s allegation (see[46]below) that he had telephoned Lim\n                    to ask him to bear responsibility for all the offences in exchange for $1.5m.\n                    While he did call Lim, he was merely suggesting that they tell CAD that they had\n                    shares in the “vendors” involved and were therefore entitled to\n                    some money paid to the “vendors”.35     SLA has commenced civil proceedings against\n                    Koh, Lim, their family members and the accomplices. It was therefore likely that\n                    the loss occasioned to SLA would be minimal or fully recovered.36     The three High Court cases cited by the\n                    prosecution at[26]above were\n                    distinguishable on the facts. Apart from the fact that some of them concerned\n                    criminal breach of trust rather than cheating, the amounts taken and lost were\n                    much higher in those cases. The sentence imposed on the accomplice, Ho, by the\n                    district court does not constrain the High Court in any way where Koh was\n                    concerned.37     It was suggested that an aggregate\n                    imprisonment term of 16 years, backdated to his date of remand, would suffice\n                    for Koh.Mitigation for Lim38     Lim has an external degree in computer science\n                    from University College London. His wife is 7 years his senior and has two\n                    children from her previous marriage, one of whom is autistic and studying in a\n                    special needs school. They have two other children of their own. His wife has\n                    been unemployed since 2008. She takes care of their four children. Lim’s\n                    mother is 64 and unemployed while his father is 62 and earns a meagre salary as\n                    a security guard. While his family is extremely supportive of Lim, as seen in\n                    their many letters attesting to Lim’s good general character and pleading\n                    for leniency, Lim did not want them to be in court so as to avoid the\n                    media.39     The following information came from a report\n                    dated 26 May 2011 by Dr Stephen Phang, a psychiatrist in the Institute\n                    of Mental Health (tendered as part of the mitigation plea). Lim’s\n                    incarceration led to him developing and suffering from a major depressive\n                    disorder of mild to moderate severity. Prior to the offences, he experienced an\n                    adjustment disorder, possibly with depressed mood, which was ameliorated while\n                    the offences were being committed primarily because of the ill-gotten gains he\n                    received from the offences. His background history is suggestive that he is not,\n                    by any perception, a habitual offender. He is currently on antidepressant\n                    medication.40     Lim stated that when Koh joined SLA in March\n                    2007, Koh became his immediate superior and was in charge of all of Lim’s\n                    work appraisals. Koh made efforts to know Lim and learnt that Lim was in\n                    financial difficulties because his wife was retrenched in 2004 and he had to\n                    support two step-children and two children of his own. Lim was then struggling\n                    with his mortgage payments and his credit card bills. A few months later, Koh\n                    sent Lim an innocuous email stating that he had a scheme to make money and if\n                    Lim was interested, he was to approach Koh to discuss (Koh gave a different\n                    version of the inception of the scheme to defraud – see[33]above)..41     Lim did approach Koh who told him about a flaw\n                    in the GeBiz procurement portal which could be exploited. Koh told Lim to take\n                    care of the purchase orders and other documentation while he would enlist the\n                    help of external vendors. Due to Lim’s adjustment disorder and sense of\n                    desperation, he was enticed into the cheating scheme. He was told that he would\n                    receive about one-third of the criminal proceeds but his eventual share was much\n                    less than that. Koh wanted to do “a few big ones” and then\n                    stop.42     Out of the 11 vendors brought into the\n                    cheating scheme, Lim never met anyone from the eight of them responsible for\n                    cheating SLA of almost $11.5m. Most of them were brought in through Ho,\n                    Koh’s friend, whom Lim has never met. Lim was responsible for bringing in\n                    three vendors which were involved in cheating SLA of about\n                $685,000.43     Lim profited by about $1.87m from the criminal\n                    proceeds. His debts were more than taken care of. Koh advised him not to keep\n                    too much money in the bank to avoid trouble and suggested that Lim invest in\n                    property and luxury goods which would retain their value. Koh also introduced\n                    the contact person for the second-hand Ferrari. He reckoned that Koh took more\n                    than 70% of the criminal proceeds from cheating SLA while he received between\n                    20% and 25% thereof.44     As the adverse claims to the assets recovered\n                    involved about $38,000 only, SLA would be able to recover at least $1.35m\n                    together with another $100,000 or so from the luxury goods. Lim was making no\n                    claim to the assets and there would therefore be savings in legal costs for\n                    SLA.45     In 2010, Lim began to have misgivings about\n                    the cheating scheme and tried to persuade Koh to stop. He told Koh that he\n                    wanted out and would not help him with the transactions in the second half of\n                    March 2010. However, Koh told him that he would be responsible for the last\n                    batch of about 53 transactions. Feeling beholden to Koh, Lim complied with\n                    Koh’s instructions “one last time”. Lim did not take a share\n                    of the proceeds from these transactions while Koh kept the entire amount of $3m\n                    or so (this was disputed by Koh – see[33]above). Lim argued that he could not have had a share of\n                    this amount looking at the value of the assets recovered from him and his\n                    family.46     Lim assisted CAD fully with the\n                    investigations. While he was being interviewed by the CAD officers, Koh called\n                    him from abroad without knowing where Lim was at that time. Koh asked Lim to\n                    take the entire blame for the offences in exchange for $1.5m. Lim refused the\n                    offer and persuaded Koh to return to Singapore. Although the CAD officers could\n                    not hear the conversation, Lim told them about it immediately after ending the\n                    call. Koh’s version about this telephone call is at[34]above.47     Lim is extremely remorseful and makes no\n                    excuse for his actions. He accepted that “his role as Koh’s runner\n                    was essential in carrying out the scheme”. He apologises to all adversely\n                    affected by his foolish actions and finds solace in religion now. He was charged\n                    in court on 6 October 2010 and remanded thereafter. Before that, he was\n                    granted bail by CAD.48     Lim contended that Koh was the one controlling\n                    the whole scheme from beginning to end. While he acknowledged that he was\n                    “not a pawn, he certainly was not the chess master that Koh was”.\n                    He likened his role to that of a knight, “one who was controllable and\n                    whose path was limited in scope but yet important enough in the scheme to ensure\n                    maximum benefit for the chess master who knew how to wield him”. Lim\n                    submitted that his culpability was similar to that of Ho, whom he has never met.\n                    Both of them had been manipulated by Koh.49     “Deterrence must always be tempered by\n                    proportionality in relation to the severity of the offence committed as well as\n                    by the moral and legal culpability of the offender” (Tan Kay Beng v PP[2006] 4 SLR(R) 10). It was\n                    suggested that compassion could still be shown in a deterrent sentence and that\n                    a total custodial sentence of 10 to 12 years would suffice to meet the ends of\n                    justice here. The precedents cited by the prosecution (at[26]above) were inapplicable as s 409 and\n                    s 467 of the old Penal Code provided for even life imprisonment. Moreover,\n                    the amount defrauded and lost in this case was nowhere near the astronomical\n                    sums in those three cases.50     Sing Investments has sued Lim for the $350,000\n                    loan taken out for the ill-fated Ferrari. I was informed by counsel on watching\n                    brief for SLA that the insurers for the Ferrari have repudiated liability on the\n                    ground that the policy was purchased with proceeds from fraud.The decision of the court51     The Penal Code was amended on 1 February\n                    2008. As some of the cheating offences were committed before 1 February\n                    2008, the Penal Code (1985 Rev Ed) (“old Penal Code”) applies\n                    to those. The punishment prescribed under 420 of the old Penal Code was a\n                    maximum imprisonment term of 7 years with a liability to a fine. For the\n                    cheating offences committed on or after 1 February 2008, the Penal Code\n                    (2008 Rev Ed) (“new Penal Code”) applies. The punishment\n                    provided under s 420 of the new Penal Code is 10 years imprisonment and a\n                    liability to a fine. Section 109 in the new Penal Code remains the same as its\n                    predecessor and provides that an abettor of an offence shall be punished with\n                    the punishment provided for the offence abetted if there is no express provision\n                    for the punishment of such abetment. There is no such express provision and,\n                    accordingly, s 420 is the governing provision and imprisonment is mandatory\n                    for the cheating offences.52     Section 47(6)(a) of the Confiscation of\n                    Benefits Act provides that an individual who commits an offence under s 47\n                    shall be liable to a fine not exceeding $500,000 or to imprisonment of up to 7\n                    years or to both.53     The precedents cited by the prosecution at[26]above have a basic common theme\n                    with the present case. They all concern accused persons defrauding others of\n                    millions of dollars and spending their illegally obtained fortunes on\n                    themselves, their families or friends. There are of course differences in the\n                    cases, some of which have been pointed out above. Nevertheless, they serve as\n                    useful comparisons for what the total imprisonment terms ought to be for Koh and\n                    Lim in the present case. As all involved in this case (and similar ones before)\n                    have pragmatically noted, the significance of the sentencing process in such\n                    cases is not what each of the offences deserves but what the aggregate sentence\n                    comprising the consecutive imprisonment terms would be.54     The strongest points in both accused\n                    persons’ favour are that they have pleaded guilty at the first available\n                    opportunity and have rendered assistance to the CAD in the investigations and in\n                    the recovery of the money and assets wholly obtained or tainted by their fraud.\n                    More than $12m were taken by them collectively and some $9m (in money and\n                    assets) were recovered. There are still a number of luxury goods which have not\n                    been valued. Out of the recovered sum, slightly more than $1.5m is the subject\n                    of adverse claims. The total recovery will therefore be between 62.5 and 75%. In\n                    absolute terms, the loss will be between $3m and $4.5m.55     None of the parties in this case could come up\n                    with accurate computations as to what the respective shares of Koh and Lim were\n                    as between themselves since everything was transacted in cash, leaving no\n                    financial trail. Even the accused persons disagreed on what their shares were.\n                    Koh maintained it was 50-50 (see [33])\n                    while Lim surmised it was in the region of 70-30 (at [43]). However, we could fairly say that Koh\n                    gave himself a larger share if we consider the assets seized, bearing in mind\n                    that Lim had admitted he was in a financial mire and therefore would have used\n                    some of the funds to clear his debts and to support his family (his parents, his\n                    wife and their four children), causing him to be less asset-rich than Koh who\n                    did not appear to have any money problems.56     First offenders in the position of Koh and Lim\n                    do not deserve the kind of sympathy reserved for those who transgress for the\n                    first time on an isolated occasion and often out of line with their general\n                    character. A clear distinction has to be drawn between those who break the law\n                    for the first time and those who have been flouting the law with impunity for\n                    years and are finally caught and charged for the first time. The latter class\n                    can hardly be called novices in crime. It would be much more apt to describe\n                    them as seasoned criminals skilled at avoiding detection. This is particularly\n                    true for Koh whose fraudulent acts in his previous workplaces came to light only\n                    fortuitously years after the events.57     Offences involving public funds committed\n                    against public institutions have to be dealt with sternly as they amount to an\n                    assault on the common weal and undermine good administration. It is worse when\n                    such assaults come from within the organization and are initiated by people\n                    trusted to handle public funds and to ensure fair play in commercial dealings\n                    with the organization. Fraud which is carefully planned and coolly played out is\n                    often difficult to uncover even with good checks and balances. It becomes even\n                    more elusive when there is collaboration and collusion from within the\n                    organization defrauded.58     Koh defrauded three public bodies\n                    consecutively while working within them. Lim cheated only one but, like Koh, in\n                    a big way. Koh and Lim siphoned off SLA’s funds stealthily and\n                    systematically over a number of years. They were the safety checks put in place\n                    to administer the technology infrastructure and to prevent financial leakage but\n                    they transformed themselves into surreptitious sluices letting out torrents of\n                    public funds illegally. Koh as the more senior officer between the two of them\n                    naturally bears more culpability but it would diminish Lim’s role\n                    unjustifiably if we forget that the duet of deception could not have been\n                    performed with such virtuosity unless both of them were in complete harmony. Koh\n                    needed Lim and Lim needed Koh.59     Their duty as conscientious employees should\n                    have been to rectify flaws in the system should they come across any. Instead,\n                    they decided to manipulate the system then existing in order to enrich\n                    themselves at public expense. Their brashness and sheer confidence were\n                    evidenced by the fact that they frequently authorised huge payments without even\n                    receiving any of the purported goods and services contracted for. While owners\n                    of property may be expected to exercise some care in protecting their\n                    possessions, our courts do not entertain pleas by cheaters and thieves that they\n                    were tempted by any perceived lack of security or alertness on the\n                    victims’ part, particularly when the defrauders took pains to disguise\n                    themselves and their activities. Organizations large and small, public and\n                    private, may put in place the best systems but if those entrusted with operating\n                    the systems (especially at the higher levels) choose to be dishonest, fraud can\n                    still occur. For this reason, as mentioned in[57]above, fraud from within must be deterred and decisively\n                    punished when it is committed.60     Financial crimes like these often have\n                    repercussions beyond the immediate facts of the case. New and more stringent\n                    checks may have to be introduced to try to prevent a repeat of the cheating.\n                    More levels of authorisation and authentication may have to be put in place. The\n                    result is increased costs in time, manpower and possibly infrastructure which\n                    would have been quite unnecessary if honesty prevails. There is the added\n                    dimension of creating disputes and litigation among those deceived. One example\n                    here is the potential dispute relating to the Ferrari involving the insurers,\n                    Sing Investments and SLA. We also witnessed in recent court history how the\n                    criminal activities inPP v Chia Teck Leng(mentioned at[26]above) generated costly\n                    litigation among the victim organizations.61     Where the money laundering offences were\n                    concerned, the prosecution described Koh and Lim as “highly sophisticated\n                    criminals” capable of “systematic and elaborate laundering of\n                    criminal proceeds”. With respect, I do not quite agree with this\n                    description. They had the commonsense not to leave an audit trail and therefore\n                    transacted in cash only among the accomplices. They did try to camouflage their\n                    huge cash reserves by their various means of investments. However, the\n                    investments were all in Singapore and were readily traceable to them because the\n                    purported owners were not persons of apparent financial means and stature who\n                    could easily explain the source of their wealth. Their rather egoistic acts in\n                    purchasing super cars, especially the attention-grabbing Lamborghini and\n                    Ferrari, in our small island indicated inane vanity rather than sophistication.\n                    They were carelessly inviting questions about their new found wealth,\n                    particularly for Lim, whose recent financial woes must have been known to those\n                    who knew him. They were indeed seasoned in cheating but were hardly\n                    sophisticated money launderers.62     Koh apparently had reservations about\n                    returning to Singapore when he became aware of the investigations by the CAD.\n                    Whatever the true context of that telephone call that he made to Lim, it was at\n                    the very least an attempt to deceive the investigators and to downplay the\n                    enormity of their criminal acts. In any event, he made the correct and\n                    honourable decision to return home to admit to the wrongdoings and to face the\n                    consequences. Belated repentance is still better than total lack of remorse and\n                    blatant refusal to acknowledge guilt.63     Nothing was said about Koh’s motivation\n                    for his criminal activities. He did not appear to have been in debt. Therefore I\n                    can only surmise from the way he spent the criminal proceeds that he craved\n                    luxury but was unwilling to work hard for it.64     Lim’s depression while in custody was\n                    largely induced by his own criminal acts. Further, his pre-existing adjustment\n                    disorder, as noted by Dr Stephen Phang, did not deprive him of the mental\n                    capacity to differentiate between right and wrong. The psychiatrist went on to\n                    opine that “[i]n fact, he would conceivably have required a nimble state\n                    of mind to have successfully engaged in the illicit activities for which he is\n                    presently charged with committing, over an extended period of approximately 3\n                    years”. His mental state therefore carries practically no mitigating\n                    value.65     While I had some sympathy for Lim’s\n                    previous predicament in view of his family commitments, which spurred him to\n                    partner Koh in this criminal enterprise, that unfortunately dissipated quickly\n                    when his needs evolved rapidly into greed. This was particularly the case\n                    concerning the charge involving Sing Investments. There could have been no\n                    justification whatsoever for cheating in order to upgrade from an already\n                    expensive car to a super car, albeit a second hand one.66     Although Lim claimed to have had misgivings\n                    about the cheating scheme in 2010, he nonetheless agreed to help Koh cheat SLA\n                    out of more than $3m in over 50 false transactions within the month of March\n                    2010. As pointed out by the prosecution, that worked out to an average of more\n                    than two fraudulent transactions per working day during that month. The\n                    “one last time” of cheating was truly a grand finale. It certainly\n                    fits into the original plan to do “a few big ones” (see[41]above). Even if Lim did not take any share of\n                    this money, he had again knowingly assisted Koh in cheating a public body in\n                    spectacular fashion.67     Lim’s family members and friends have\n                    written to the court to attest to his general good character and to plead for\n                    leniency for him. I shall mention a sampling of the testimonials here. His wife\n                    wrote to say that he is “a dutiful husband and loving father to our four\n                    children … My family condemned his crime but not him”. His\n                    biological daughter described him as “a good man” and stated that\n                    she “really really miss him very much”. His step-daughter wrote to\n                    say that “he is a kind hearted man, a loving husband and yet a stern\n                    father” and that after her biological father left her, her mother and her\n                    autistic younger brother, Lim’s presence “made a great impact in my\n                    life”. Lim’s former school mate described him as “a very\n                    loyal friend” and “obsessed with cars”. His father also\n                    touched on this issue when he wrote (in Chinese) that Lim’s\n                    “weakness is the love for cars, so in a moment of folly and overcome by\n                    greed, he treaded on the wrong path”. Two of his friends wrote that Lim\n                    was a very responsible man who “has not only taken the responsibility of\n                    a husband but also a father to two kids not of his own as his. This is a very\n                    huge responsibility for anyone what more a young man with no prior parental\n                    experience. Added to this was the fact that one child needed special care for\n                    his autism”. Others stated that Lim has found meaning and solace in his\n                    religion.68     I acknowledge all the testimonials written for\n                    Lim and wish to assure the writers that due consideration has been given to\n                    them. Should the sentence that I am about to pronounce not meet the wishes of\n                    the writers, especially the two daughters, it will not be due to my disbelief or\n                    disregard of their statements and sentiments. To Lim’s children, your\n                    father will return to you one day. Do not forget him, do not stop loving\n                    him.69     In view of the enormity of the criminal\n                    activities in this case, deterrence and retribution have to be clearly reflected\n                    in the sentences to be imposed, tempered by proportionality in relation to the\n                    severity of the offences committed as well as by the moral and legal culpability\n                    of the accused persons here (see[49]above). Although the new Penal Code provides for a higher maximum imprisonment\n                    term for cheating, I decided not to draw a distinction in sentence between the\n                    cheating offences committed under the old Penal Code and those under the new\n                    Penal Code as the substance of the offences committed was essentially the\n                    same.70     I now pronounce the following\n                    sentences.KohFor each of\n                        the 46 cheating\n                        charges       -       4\n                        years imprisonmentFor each of the 9 money laundering\n                        charges       -       3\n                        years imprisonmentThe imprisonment terms in respect of cheating\n                        charges number 1, 44, 185 and 189 and money laundering charges number 238\n                        and 241 are to run consecutively with effect from23 June 2010(date of arrest), making a total\n                        imprisonment term of22 years.LimFor each of the 41\n                        cheating\n                        charges       -       4\n                        years imprisonmentFor each of the 8 money laundering\n                        charges       -       3\n                        years imprisonmentThe imprisonment terms in respect of cheating\n                        charges number 44, 189 and 264 and money laundering charge number 253 are to\n                        run consecutively with effect from6 October\n                            2010(date of remand by district court), making a total\n                        imprisonment term of15\n                years.71     A disposal inquiry is to be conducted in the\n                    Subordinate Courts to deal with all the seized properties in this\n                case.72     I thank the prosecution and the defence\n                    counsel for their able assistance in this matter.",
        "Mitigation for Koh": "29     Koh’s early guilty plea and full\n                    cooperation with CAD indicated that he was sincerely remorseful over his\n                    actions. He has saved time and effort on the investigators’ part by\n                    admitting his wrongdoing and cooperating with them during investigations and\n                    helping in the tracing of the assets. A protracted trial has also been\n                    obviated. 30     Koh was on holiday in the United States of\n                    America when he was informed that the CAD was looking for him. He chose to\n                    return to Singapore to surrender himself after meeting his counsel in Malaysia\n                    and reflecting on the matter for a few days. The CAD was duly informed of the\n                    time and place of Koh’s return to Singapore. He was arrested on\n                    23 June 2010 and charged in court on 25 June 2010 after which he has\n                    remained in remand. He made it clear from the outset that he would be pleading\n                    guilty at the earliest available opportunity. It was argued that a wrong message\n                    would be sent if a heavy sentence were imposed as that would be telling\n                    offenders that if they came back, they would be hammered to a\n                pulp. 31     Koh’s wife used to be a home-maker but\n                    has been forced by the circumstances to work part time to support herself and\n                    their 9 year old daughter. They are now living in rented premises. They were\n                    shocked by the revelations as Koh had merely informed his wife that he had made\n                    some good investments in information technology businesses. 32     Koh served our nation as a field engineer\n                    officer during his national service. He graduated in electrical engineering with\n                    first class honours from the Queensland University of Technology and was granted\n                    membership in the Golden Key National Honour Society in the said university. He\n                    could have been a very successful person but for the wrongdoing. 33     Koh acknowledged that as he was Lim’s\n                    superior officer in SLA, more trust was reposed in him and he was therefore the\n                    more culpable offender between them. He denied however that he instigated Lim to\n                    commit the cheating offences (see Lim’s version at[40]and[41]below). They simply had discussions and both agreed to cheat SLA together. He\n                    maintained that the criminal proceeds between him and Lim were shared equally\n                    while some of the money was given to the accomplices. That was also the case\n                    with the final round of cheating offences in March 2010 against SLA involving\n                    more than $3m (Lim denied this – see[45]below). 34     Koh also denied Lim’s allegation (see[46]below) that he had telephoned Lim\n                    to ask him to bear responsibility for all the offences in exchange for $1.5m.\n                    While he did call Lim, he was merely suggesting that they tell CAD that they had\n                    shares in the “vendors” involved and were therefore entitled to\n                    some money paid to the “vendors”. 35     SLA has commenced civil proceedings against\n                    Koh, Lim, their family members and the accomplices. It was therefore likely that\n                    the loss occasioned to SLA would be minimal or fully recovered. 36     The three High Court cases cited by the\n                    prosecution at[26]above were\n                    distinguishable on the facts. Apart from the fact that some of them concerned\n                    criminal breach of trust rather than cheating, the amounts taken and lost were\n                    much higher in those cases. The sentence imposed on the accomplice, Ho, by the\n                    district court does not constrain the High Court in any way where Koh was\n                    concerned. 37     It was suggested that an aggregate\n                    imprisonment term of 16 years, backdated to his date of remand, would suffice\n                    for Koh.",
        "Mitigation for Lim": "38     Lim has an external degree in computer science\n                    from University College London. His wife is 7 years his senior and has two\n                    children from her previous marriage, one of whom is autistic and studying in a\n                    special needs school. They have two other children of their own. His wife has\n                    been unemployed since 2008. She takes care of their four children. Lim’s\n                    mother is 64 and unemployed while his father is 62 and earns a meagre salary as\n                    a security guard. While his family is extremely supportive of Lim, as seen in\n                    their many letters attesting to Lim’s good general character and pleading\n                    for leniency, Lim did not want them to be in court so as to avoid the\n                    media. 39     The following information came from a report\n                    dated 26 May 2011 by Dr Stephen Phang, a psychiatrist in the Institute\n                    of Mental Health (tendered as part of the mitigation plea). Lim’s\n                    incarceration led to him developing and suffering from a major depressive\n                    disorder of mild to moderate severity. Prior to the offences, he experienced an\n                    adjustment disorder, possibly with depressed mood, which was ameliorated while\n                    the offences were being committed primarily because of the ill-gotten gains he\n                    received from the offences. His background history is suggestive that he is not,\n                    by any perception, a habitual offender. He is currently on antidepressant\n                    medication. 40     Lim stated that when Koh joined SLA in March\n                    2007, Koh became his immediate superior and was in charge of all of Lim’s\n                    work appraisals. Koh made efforts to know Lim and learnt that Lim was in\n                    financial difficulties because his wife was retrenched in 2004 and he had to\n                    support two step-children and two children of his own. Lim was then struggling\n                    with his mortgage payments and his credit card bills. A few months later, Koh\n                    sent Lim an innocuous email stating that he had a scheme to make money and if\n                    Lim was interested, he was to approach Koh to discuss (Koh gave a different\n                    version of the inception of the scheme to defraud – see[33]above).. 41     Lim did approach Koh who told him about a flaw\n                    in the GeBiz procurement portal which could be exploited. Koh told Lim to take\n                    care of the purchase orders and other documentation while he would enlist the\n                    help of external vendors. Due to Lim’s adjustment disorder and sense of\n                    desperation, he was enticed into the cheating scheme. He was told that he would\n                    receive about one-third of the criminal proceeds but his eventual share was much\n                    less than that. Koh wanted to do “a few big ones” and then\n                    stop. 42     Out of the 11 vendors brought into the\n                    cheating scheme, Lim never met anyone from the eight of them responsible for\n                    cheating SLA of almost $11.5m. Most of them were brought in through Ho,\n                    Koh’s friend, whom Lim has never met. Lim was responsible for bringing in\n                    three vendors which were involved in cheating SLA of about\n                $685,000. 43     Lim profited by about $1.87m from the criminal\n                    proceeds. His debts were more than taken care of. Koh advised him not to keep\n                    too much money in the bank to avoid trouble and suggested that Lim invest in\n                    property and luxury goods which would retain their value. Koh also introduced\n                    the contact person for the second-hand Ferrari. He reckoned that Koh took more\n                    than 70% of the criminal proceeds from cheating SLA while he received between\n                    20% and 25% thereof. 44     As the adverse claims to the assets recovered\n                    involved about $38,000 only, SLA would be able to recover at least $1.35m\n                    together with another $100,000 or so from the luxury goods. Lim was making no\n                    claim to the assets and there would therefore be savings in legal costs for\n                    SLA. 45     In 2010, Lim began to have misgivings about\n                    the cheating scheme and tried to persuade Koh to stop. He told Koh that he\n                    wanted out and would not help him with the transactions in the second half of\n                    March 2010. However, Koh told him that he would be responsible for the last\n                    batch of about 53 transactions. Feeling beholden to Koh, Lim complied with\n                    Koh’s instructions “one last time”. Lim did not take a share\n                    of the proceeds from these transactions while Koh kept the entire amount of $3m\n                    or so (this was disputed by Koh – see[33]above). Lim argued that he could not have had a share of\n                    this amount looking at the value of the assets recovered from him and his\n                    family. 46     Lim assisted CAD fully with the\n                    investigations. While he was being interviewed by the CAD officers, Koh called\n                    him from abroad without knowing where Lim was at that time. Koh asked Lim to\n                    take the entire blame for the offences in exchange for $1.5m. Lim refused the\n                    offer and persuaded Koh to return to Singapore. Although the CAD officers could\n                    not hear the conversation, Lim told them about it immediately after ending the\n                    call. Koh’s version about this telephone call is at[34]above. 47     Lim is extremely remorseful and makes no\n                    excuse for his actions. He accepted that “his role as Koh’s runner\n                    was essential in carrying out the scheme”. He apologises to all adversely\n                    affected by his foolish actions and finds solace in religion now. He was charged\n                    in court on 6 October 2010 and remanded thereafter. Before that, he was\n                    granted bail by CAD. 48     Lim contended that Koh was the one controlling\n                    the whole scheme from beginning to end. While he acknowledged that he was\n                    “not a pawn, he certainly was not the chess master that Koh was”.\n                    He likened his role to that of a knight, “one who was controllable and\n                    whose path was limited in scope but yet important enough in the scheme to ensure\n                    maximum benefit for the chess master who knew how to wield him”. Lim\n                    submitted that his culpability was similar to that of Ho, whom he has never met.\n                    Both of them had been manipulated by Koh. 49     “Deterrence must always be tempered by\n                    proportionality in relation to the severity of the offence committed as well as\n                    by the moral and legal culpability of the offender” (Tan Kay Beng v PP[2006] 4 SLR(R) 10). It was\n                    suggested that compassion could still be shown in a deterrent sentence and that\n                    a total custodial sentence of 10 to 12 years would suffice to meet the ends of\n                    justice here. The precedents cited by the prosecution (at[26]above) were inapplicable as s 409 and\n                    s 467 of the old Penal Code provided for even life imprisonment. Moreover,\n                    the amount defrauded and lost in this case was nowhere near the astronomical\n                    sums in those three cases. 50     Sing Investments has sued Lim for the $350,000\n                    loan taken out for the ill-fated Ferrari. I was informed by counsel on watching\n                    brief for SLA that the insurers for the Ferrari have repudiated liability on the\n                    ground that the policy was purchased with proceeds from fraud.",
        "The decision of the court": "51     The Penal Code was amended on 1 February\n                    2008. As some of the cheating offences were committed before 1 February\n                    2008, the Penal Code (1985 Rev Ed) (“old Penal Code”) applies\n                    to those. The punishment prescribed under 420 of the old Penal Code was a\n                    maximum imprisonment term of 7 years with a liability to a fine. For the\n                    cheating offences committed on or after 1 February 2008, the Penal Code\n                    (2008 Rev Ed) (“new Penal Code”) applies. The punishment\n                    provided under s 420 of the new Penal Code is 10 years imprisonment and a\n                    liability to a fine. Section 109 in the new Penal Code remains the same as its\n                    predecessor and provides that an abettor of an offence shall be punished with\n                    the punishment provided for the offence abetted if there is no express provision\n                    for the punishment of such abetment. There is no such express provision and,\n                    accordingly, s 420 is the governing provision and imprisonment is mandatory\n                    for the cheating offences. 52     Section 47(6)(a) of the Confiscation of\n                    Benefits Act provides that an individual who commits an offence under s 47\n                    shall be liable to a fine not exceeding $500,000 or to imprisonment of up to 7\n                    years or to both. 53     The precedents cited by the prosecution at[26]above have a basic common theme\n                    with the present case. They all concern accused persons defrauding others of\n                    millions of dollars and spending their illegally obtained fortunes on\n                    themselves, their families or friends. There are of course differences in the\n                    cases, some of which have been pointed out above. Nevertheless, they serve as\n                    useful comparisons for what the total imprisonment terms ought to be for Koh and\n                    Lim in the present case. As all involved in this case (and similar ones before)\n                    have pragmatically noted, the significance of the sentencing process in such\n                    cases is not what each of the offences deserves but what the aggregate sentence\n                    comprising the consecutive imprisonment terms would be. 54     The strongest points in both accused\n                    persons’ favour are that they have pleaded guilty at the first available\n                    opportunity and have rendered assistance to the CAD in the investigations and in\n                    the recovery of the money and assets wholly obtained or tainted by their fraud.\n                    More than $12m were taken by them collectively and some $9m (in money and\n                    assets) were recovered. There are still a number of luxury goods which have not\n                    been valued. Out of the recovered sum, slightly more than $1.5m is the subject\n                    of adverse claims. The total recovery will therefore be between 62.5 and 75%. In\n                    absolute terms, the loss will be between $3m and $4.5m. 55     None of the parties in this case could come up\n                    with accurate computations as to what the respective shares of Koh and Lim were\n                    as between themselves since everything was transacted in cash, leaving no\n                    financial trail. Even the accused persons disagreed on what their shares were.\n                    Koh maintained it was 50-50 (see [33])\n                    while Lim surmised it was in the region of 70-30 (at [43]). However, we could fairly say that Koh\n                    gave himself a larger share if we consider the assets seized, bearing in mind\n                    that Lim had admitted he was in a financial mire and therefore would have used\n                    some of the funds to clear his debts and to support his family (his parents, his\n                    wife and their four children), causing him to be less asset-rich than Koh who\n                    did not appear to have any money problems. 56     First offenders in the position of Koh and Lim\n                    do not deserve the kind of sympathy reserved for those who transgress for the\n                    first time on an isolated occasion and often out of line with their general\n                    character. A clear distinction has to be drawn between those who break the law\n                    for the first time and those who have been flouting the law with impunity for\n                    years and are finally caught and charged for the first time. The latter class\n                    can hardly be called novices in crime. It would be much more apt to describe\n                    them as seasoned criminals skilled at avoiding detection. This is particularly\n                    true for Koh whose fraudulent acts in his previous workplaces came to light only\n                    fortuitously years after the events. 57     Offences involving public funds committed\n                    against public institutions have to be dealt with sternly as they amount to an\n                    assault on the common weal and undermine good administration. It is worse when\n                    such assaults come from within the organization and are initiated by people\n                    trusted to handle public funds and to ensure fair play in commercial dealings\n                    with the organization. Fraud which is carefully planned and coolly played out is\n                    often difficult to uncover even with good checks and balances. It becomes even\n                    more elusive when there is collaboration and collusion from within the\n                    organization defrauded. 58     Koh defrauded three public bodies\n                    consecutively while working within them. Lim cheated only one but, like Koh, in\n                    a big way. Koh and Lim siphoned off SLA’s funds stealthily and\n                    systematically over a number of years. They were the safety checks put in place\n                    to administer the technology infrastructure and to prevent financial leakage but\n                    they transformed themselves into surreptitious sluices letting out torrents of\n                    public funds illegally. Koh as the more senior officer between the two of them\n                    naturally bears more culpability but it would diminish Lim’s role\n                    unjustifiably if we forget that the duet of deception could not have been\n                    performed with such virtuosity unless both of them were in complete harmony. Koh\n                    needed Lim and Lim needed Koh. 59     Their duty as conscientious employees should\n                    have been to rectify flaws in the system should they come across any. Instead,\n                    they decided to manipulate the system then existing in order to enrich\n                    themselves at public expense. Their brashness and sheer confidence were\n                    evidenced by the fact that they frequently authorised huge payments without even\n                    receiving any of the purported goods and services contracted for. While owners\n                    of property may be expected to exercise some care in protecting their\n                    possessions, our courts do not entertain pleas by cheaters and thieves that they\n                    were tempted by any perceived lack of security or alertness on the\n                    victims’ part, particularly when the defrauders took pains to disguise\n                    themselves and their activities. Organizations large and small, public and\n                    private, may put in place the best systems but if those entrusted with operating\n                    the systems (especially at the higher levels) choose to be dishonest, fraud can\n                    still occur. For this reason, as mentioned in[57]above, fraud from within must be deterred and decisively\n                    punished when it is committed. 60     Financial crimes like these often have\n                    repercussions beyond the immediate facts of the case. New and more stringent\n                    checks may have to be introduced to try to prevent a repeat of the cheating.\n                    More levels of authorisation and authentication may have to be put in place. The\n                    result is increased costs in time, manpower and possibly infrastructure which\n                    would have been quite unnecessary if honesty prevails. There is the added\n                    dimension of creating disputes and litigation among those deceived. One example\n                    here is the potential dispute relating to the Ferrari involving the insurers,\n                    Sing Investments and SLA. We also witnessed in recent court history how the\n                    criminal activities inPP v Chia Teck Leng(mentioned at[26]above) generated costly\n                    litigation among the victim organizations. 61     Where the money laundering offences were\n                    concerned, the prosecution described Koh and Lim as “highly sophisticated\n                    criminals” capable of “systematic and elaborate laundering of\n                    criminal proceeds”. With respect, I do not quite agree with this\n                    description. They had the commonsense not to leave an audit trail and therefore\n                    transacted in cash only among the accomplices. They did try to camouflage their\n                    huge cash reserves by their various means of investments. However, the\n                    investments were all in Singapore and were readily traceable to them because the\n                    purported owners were not persons of apparent financial means and stature who\n                    could easily explain the source of their wealth. Their rather egoistic acts in\n                    purchasing super cars, especially the attention-grabbing Lamborghini and\n                    Ferrari, in our small island indicated inane vanity rather than sophistication.\n                    They were carelessly inviting questions about their new found wealth,\n                    particularly for Lim, whose recent financial woes must have been known to those\n                    who knew him. They were indeed seasoned in cheating but were hardly\n                    sophisticated money launderers. 62     Koh apparently had reservations about\n                    returning to Singapore when he became aware of the investigations by the CAD.\n                    Whatever the true context of that telephone call that he made to Lim, it was at\n                    the very least an attempt to deceive the investigators and to downplay the\n                    enormity of their criminal acts. In any event, he made the correct and\n                    honourable decision to return home to admit to the wrongdoings and to face the\n                    consequences. Belated repentance is still better than total lack of remorse and\n                    blatant refusal to acknowledge guilt. 63     Nothing was said about Koh’s motivation\n                    for his criminal activities. He did not appear to have been in debt. Therefore I\n                    can only surmise from the way he spent the criminal proceeds that he craved\n                    luxury but was unwilling to work hard for it. 64     Lim’s depression while in custody was\n                    largely induced by his own criminal acts. Further, his pre-existing adjustment\n                    disorder, as noted by Dr Stephen Phang, did not deprive him of the mental\n                    capacity to differentiate between right and wrong. The psychiatrist went on to\n                    opine that “[i]n fact, he would conceivably have required a nimble state\n                    of mind to have successfully engaged in the illicit activities for which he is\n                    presently charged with committing, over an extended period of approximately 3\n                    years”. His mental state therefore carries practically no mitigating\n                    value. 65     While I had some sympathy for Lim’s\n                    previous predicament in view of his family commitments, which spurred him to\n                    partner Koh in this criminal enterprise, that unfortunately dissipated quickly\n                    when his needs evolved rapidly into greed. This was particularly the case\n                    concerning the charge involving Sing Investments. There could have been no\n                    justification whatsoever for cheating in order to upgrade from an already\n                    expensive car to a super car, albeit a second hand one. 66     Although Lim claimed to have had misgivings\n                    about the cheating scheme in 2010, he nonetheless agreed to help Koh cheat SLA\n                    out of more than $3m in over 50 false transactions within the month of March\n                    2010. As pointed out by the prosecution, that worked out to an average of more\n                    than two fraudulent transactions per working day during that month. The\n                    “one last time” of cheating was truly a grand finale. It certainly\n                    fits into the original plan to do “a few big ones” (see[41]above). Even if Lim did not take any share of\n                    this money, he had again knowingly assisted Koh in cheating a public body in\n                    spectacular fashion. 67     Lim’s family members and friends have\n                    written to the court to attest to his general good character and to plead for\n                    leniency for him. I shall mention a sampling of the testimonials here. His wife\n                    wrote to say that he is “a dutiful husband and loving father to our four\n                    children … My family condemned his crime but not him”. His\n                    biological daughter described him as “a good man” and stated that\n                    she “really really miss him very much”. His step-daughter wrote to\n                    say that “he is a kind hearted man, a loving husband and yet a stern\n                    father” and that after her biological father left her, her mother and her\n                    autistic younger brother, Lim’s presence “made a great impact in my\n                    life”. Lim’s former school mate described him as “a very\n                    loyal friend” and “obsessed with cars”. His father also\n                    touched on this issue when he wrote (in Chinese) that Lim’s\n                    “weakness is the love for cars, so in a moment of folly and overcome by\n                    greed, he treaded on the wrong path”. Two of his friends wrote that Lim\n                    was a very responsible man who “has not only taken the responsibility of\n                    a husband but also a father to two kids not of his own as his. This is a very\n                    huge responsibility for anyone what more a young man with no prior parental\n                    experience. Added to this was the fact that one child needed special care for\n                    his autism”. Others stated that Lim has found meaning and solace in his\n                    religion. 68     I acknowledge all the testimonials written for\n                    Lim and wish to assure the writers that due consideration has been given to\n                    them. Should the sentence that I am about to pronounce not meet the wishes of\n                    the writers, especially the two daughters, it will not be due to my disbelief or\n                    disregard of their statements and sentiments. To Lim’s children, your\n                    father will return to you one day. Do not forget him, do not stop loving\n                    him. 69     In view of the enormity of the criminal\n                    activities in this case, deterrence and retribution have to be clearly reflected\n                    in the sentences to be imposed, tempered by proportionality in relation to the\n                    severity of the offences committed as well as by the moral and legal culpability\n                    of the accused persons here (see[49]above). Although the new Penal Code provides for a higher maximum imprisonment\n                    term for cheating, I decided not to draw a distinction in sentence between the\n                    cheating offences committed under the old Penal Code and those under the new\n                    Penal Code as the substance of the offences committed was essentially the\n                    same. 70     I now pronounce the following\n                    sentences. Koh For each of\n                        the 46 cheating\n                        charges       -       4\n                        years imprisonment For each of the 9 money laundering\n                        charges       -       3\n                        years imprisonment The imprisonment terms in respect of cheating\n                        charges number 1, 44, 185 and 189 and money laundering charges number 238\n                        and 241 are to run consecutively with effect from23 June 2010(date of arrest), making a total\n                        imprisonment term of22 years. Lim For each of the 41\n                        cheating\n                        charges       -       4\n                        years imprisonment For each of the 8 money laundering\n                        charges       -       3\n                        years imprisonment The imprisonment terms in respect of cheating\n                        charges number 44, 189 and 264 and money laundering charge number 253 are to\n                        run consecutively with effect from6 October\n                            2010(date of remand by district court), making a total\n                        imprisonment term of15\n                years. 71     A disposal inquiry is to be conducted in the\n                    Subordinate Courts to deal with all the seized properties in this\n                case. 72     I thank the prosecution and the defence\n                    counsel for their able assistance in this matter."
    }
}