{
    "case_title": "Loh Kwok Kee\n      v\n      Foo Hee Toon Gilbert and others",
    "ncitation": "[2011] SGHC 116",
    "coram": "Quentin Loh J",
    "sections": {
        "Introduction": "1       The plaintiff (“Loh”) brings this\n                    claim for oppression under s 216 of the Companies Act (Cap 50, 2006 Rev Ed)\n                    (“s 216”) as a minority shareholder in the sixth defendant\n                    (“Hexa Chemicals”). He seeks relief against his fellow\n                    shareholders (the first to fifth defendants), asking that Hexa Chemicals be\n                    wound up or that his shares be bought on terms that this court deems fit and\n                    just.",
        "Facts": "",
        "The parties and the business": "2       Loh and the first to fifth defendants\n                    (“the shareholder defendants”) had previously worked together in\n                    the Chemical Division of Getz Bros & Co (Singapore) Pte Ltd (“Getz\n                    Bros”) where the first defendant, Gilbert Foo, (“Foo”), as\n                    General Manager of that Division headed the team. Their business comprised the\n                    purchase of industrial and commercial chemicals from suppliers abroad and\n                    selling them, usually in smaller quantities, to various manufacturers here and\n                    in the surrounding region. Their customers included in the main those in the\n                    food, plastics and paint industries. Their business therefore involved obtaining\n                    the supply of chemicals that were needed, stocking them and selling them. Like\n                    all stockists, unsold or obsolete inventory, especially of chemicals whose\n                    demand for one reason or another had diminished, would directly hit the bottom\n                    line. Prompt collection from customers and prompt payment to suppliers was\n                    crucial. 3       Besides overseeing the operations of the\n                    Chemical Division, Foo was also involved in sourcing and maintaining agency\n                    lines from the suppliers or manufacturers of these chemicals. The defendants and\n                    Loh himself were all part of Foo’s team and their specific roles were as\n                    follows: (a)     Loh, aged 61 at the time of the trial, was a\n                    Product Manager in the team. He was involved in the sales and marketing of a\n                    portfolio of chemicals. (b)     The second defendant (“Ko”), 49\n                    years old at the time of the trial, was a Technical Sales Manager in Getz Bros.\n                    He was also involved in sales and marketing of chemicals. (c)     The third defendant (“Goh”), 51\n                    years old at the time of the trial, was a Marketing Executive who assisted Foo\n                    in Getz Bros. She also had knowledge of the ink industry and was Foo’s\n                    secretary. (d)     The fourth defendant (“Wee”), 63\n                    years old at the time of the trial, was a Sales Executive in Getz\n                Bros. (e)     The fifth defendant (“Chua”), 38\n                    years old at the time of the trial, was a Sales Co-ordinator in Getz\n                    Bros. 4       It is not in dispute that as colleagues in Getz\n                    Bros, they worked closely as a group. Loh said they lunched together often and\n                    formed the backbone of the Chemical Division. Loh had been working together with\n                    Foo since 1982, starting their working relationship in another company; and by\n                    1997, Loh had worked with the other parties for at least seven years.\n                    Eventually, as a group, they had ideas of striking out on their own. This arose,\n                    according to Loh, around 1995, but Foo said this was not the first time it had\n                    been discussed. Foo was not ready to do so in 1995. It was only in 1997 that the\n                    parties decided to leave and set up on their own. 5       Hexa Chemicals was incorporated in Singapore on\n                    2 September 1997. Just prior to that, in August 1997, Foo, Loh, Ko and Goh, the\n                    main drivers of the group, resigned from Getz Bros. They staggered their joining\n                    Hexa Chemicals as, unsurprisingly, Getz Bros were quite unhappy with this turn\n                    of events and commenced an action against them for conspiracy. This was\n                    subsequently resolved. 6       The position in Hexa Chemicals was as\n                    follows: (a)     Loh joined on 1 November 1997,\n                        as a Marketing Manager, and became a director together with Foo, Ko and Goh\n                        on 5 May 1998. Loh held 21% of the shares. (b)     Foo joined on 1 April 1998 and became its\n                        Managing Director on 5 May 1998. Foo held 31% of the\n                    shares. (c)     Ko, together\n                        with Goh, were the first to leave Getz Bros to set up Hexa Chemicals; (they\n                        initially used proxies, Ko’s brother-in-law and Goh’s friend).\n                        Ko was appointed a director together with Foo and Loh on 5 May 1998 and like\n                        Loh, holds 21% of the shares. Ko started off as a Technical Sales Manager\n                        and was later promoted to General Manager in 2006, after Loh retired. His\n                        work involves sales and marketing, managing the inventories and receivables,\n                        as well as managing the company’s finances and computer\n                        systems. (d)     Goh,\n                        the other ‘founding’ member of Hexa Chemicals, became a director\n                        on 5 May 1998 and holds 15% of the shares. She is the Commercial\n                        Manager in Hexa Chemicals and oversees the areas of human resource, finance\n                        and customer service. She also manages sales in the ink\n                    industry. (e)     Wee joined\n                        Hexa Chemicals on 1 November 2000 but only became a shareholder later\n                        in June 2002 by buying his shares from Loh, Foo and Ko. He is a Product\n                        Manager in Hexa Chemicals and his work involves promoting agency lines in\n                        the food, plastic and paint sectors; maintaining close relationships with\n                        agency principals; monitoring inventory; and collecting debts. Wee is not\n                        one of the major movers of the business, the main players being Foo, Loh and\n                        Ko, and Wee’s 10% shareholding reflects this. (f)     Chua joined Hexa Chemicals on\n                        1 November 1998, but only became a shareholder a year later in November\n                        1999 by buying her shares from Goh. She is the Customer Service Executive in\n                        Hexa Chemicals and her work involves taking calls, receiving orders and\n                        arranging deliveries. She also has duties pertaining to inventory\n                        management, administration, finance and receivables, as well as shipping.\n                        Chua is also not a main mover of the business and is a 2%\n                        shareholder. 7       Hexa Chemicals was initially financed with\n                    $500,000 in equity (500,000 shares of $1 each) and $600,000 in shareholder\n                    loans. The loans would be extended by each shareholder in proportion to his or\n                    her equity ratio. By prior agreement, Wee purchased his shares later from Loh,\n                    Foo and Ko, and Chua purchased her shares from Goh when they were in a position\n                    to do so and take on their proportion of the loan to Hexa Chemicals. Like all\n                    new ventures, everyone worked hard to build up Hexa Chemicals. They ran a tight\n                    ship and managed with a lean team. Their monthly salaries were kept low and in\n                    the case of the main shareholders, their monthly salaries were lower than what\n                    they used to get at Getz Bros to help ease the cashflow. Until the latter part\n                    of 2005, the company only consisted of these six individuals, with no clerks or\n                    secretaries, and one part time book keeper. 8       Loh retired from Hexa Chemicals on\n                    31 December 2005 but remains a 21% shareholder of the company. Even after\n                    Loh retired, Hexa Chemicals only hired sparingly and remained a lean and trim\n                    business unit. 9       Hexa Chemicals has never paid dividends since\n                    its formation. The money made by the company was retained as reserves or\n                    distributed to the shareholders through salaries, directors’ fees and\n                    incentive payments. While the salaries were modest and saw little change, the\n                    shareholders would share in a portion of the profits of the companyviathe variable director’s fees and incentive\n                    payments. 10     Around the middle of September each year, the\n                    directors (Loh, Foo, Ko and Goh) would rely on the latest unaudited management\n                    accounts to decide how much of the gross profits would be distributed to the\n                    shareholders (through directors’ fees for directors and incentive payments\n                    for non-directors) and how much would be retained as reserves. The position\n                    before Loh retired was that each year, each shareholder would be paid a share of\n                    the gross profits (through directors’ fees and incentive payments) that\n                    were allocated for distribution among the shareholders. Each shareholder would\n                    receive a share proportionate to their shareholdings in Hexa. Notably, Wee and\n                    Chua were distributed a share of the gross profits even before they were\n                    shareholders. For Wee, a Directors’ Resolution dated 28 September 2001\n                    resolved that he would receive an amount approximately equivalent to 10% of the\n                    sum allocated for distribution. For Chua, minutes from a Directors’\n                    Meeting of 16 September 1999 recorded that she would receive 1% of the sum\n                    allocated for distribution. They were treated as if they were shareholders\n                    because the agreement was that they would buy their shares and assume their\n                    proportion of the shareholders’ loan when they were ready to do\n                so. 11     After Loh retired, Ko and Goh approached Foo,\n                    asking for Hexa Chemicals to revise its remuneration structure. Foo took some\n                    time to think about it and finally agreed. The gross profits that were allocated\n                    for distribution would be divided into three portions: (a)     One portion would be set aside for flat\n                    incentive payments (ieeach working shareholder\n                    would receive the same amount). (b)     The second portion, consisting of half the\n                    remaining gross profits allocated for distribution, would be distributed to the\n                    working shareholders based on equity percentage. (c)     Finally, the remainder third portion would\n                    be distributed to the working shareholders based on performance. For working\n                    shareholders who were directors, a part of this third portion would be\n                    distributed to them as directors’ fees. Loh, having retired,\n                    was not entitled to any of these payments as he was not a working shareholder.\n                    This gave rise to the dispute which eventually led the parties to\n                court.",
        "The plaintiff’s case": "12     First, Loh claimed that the shareholders of\n                    Hexa Chemicals (ieLoh himself and the shareholder\n                    defendants) conducted themselves on the basis of mutual trust and confidence as\n                    if they were partners and Hexa Chemicals were a partnership. On that basis, Loh\n                    said he was entitled to and did repose trust in all the defendants and that they\n                    must be held to a higher standard of corporate governance. Because of the\n                    informality in which they ran the company, they conducted themselves as\n                    partners, trusting that each would do right by the other. 13     Secondly, Loh claimed that by failing to\n                    distribute the profits of Hexa Chemicals to all shareholders, the defendants had\n                    clearly conducted themselves in a manner oppressive to him. The continued\n                    distribution of the profits to the shareholder defendants in total disregard of\n                    Loh’s shareholdings unfairly discriminated against or was otherwise\n                    prejudicial to him as a shareholder of Hexa Chemicals. He protested but it was\n                    in vain. 14     Thirdly, Loh claimed that he was not paid\n                    director’s fees even though he was a director from 1 October 2005 to 31\n                    December 2005.",
        "The defendants’ case": "15     First, the defendants denied that the\n                    shareholders of Hexa Chemicals had conducted themselves on the basis of mutual\n                    trust and confidence as if they were partners and that Hexa Chemicals were a\n                    partnership. Rather, they argued that Hexa Chemicals was and always had been run\n                    as a company both in fact and in form. Further, the relationship between the\n                    shareholders of Hexa Chemicalsinter sewas and\n                    had always been governed solely by the company’s Memorandum and Articles\n                    of Association (“M & A”). 16     Secondly, the defendants stated that the\n                    directors of Hexa Chemicals had decided that it would be prudent not to\n                    distribute the company’s profits to the shareholders by way of dividends;\n                    and that it would be proper to set aside the profits as business reserves for,inter alia, the maintenance of cash flow.\n                    Further, the defendants stated that the directors of Hexa Chemicals were paid\n                    directors’ fees; and the employees of Hexa Chemicals were paid incentives\n                    as part of the remuneration package for employees. There was a clear\n                    understanding that each shareholder would have to work in order to be\n                    remunerated, no one was allowed to play a passive role and expect his shares to\n                    generate passive income like an investment. There were many more allegations\n                    made in defence to Loh’s claim and they will be dealt with\n                below. 17     Thirdly, the defendants argued that Loh was\n                    not paid director’s fees from 1 October 2005 to 31 December 2005 due to\n                    the non-performance of his duties as a director. The defendants alleged that Loh\n                    had ordered stock without performing due diligence and thus caused losses to\n                    Hexa Chemicals. Further, Loh was on leave from 29 November 2005 until he left\n                    Hexa Chemicals on 31 December 2005.",
        "The law on minority oppression in relation to\n                quasi-partnerships": "18     The law on minority oppression, especially in\n                    relation to quasi-partnerships, has been well elucidated by both the High Court\n                    and the Court of Appeal . Little will be gained by repeating them save to\n                    mention those principles that are applicable here. In my view, this case turned\n                    on its facts. 19     From his case and written submissions tendered\n                    after the trial, Loh was in effect applying for relief under s 216: 163)The\n                            Plaintiff’s prayer is in the alternative – a) either that the 6thDefendant be wound\n                            up; or b) the 1stto\n                                5thDefendants be ordered to purchase the\n                            Plaintiff’s share in the 6thDefendants\n                            at such price and on such terms as the Court may deem fit and\n                            just. 164)In deciding which of the 2 prayers would be the\n                            more appropriate in the current circumstances,the\n                                Court’s discretion under s 216“should be\n                            exercised with a view to bringing to an end or remedying the matters\n                            complained of.” [emphasis added] 20     Section 216(1) of the Companies Act provides\n                    as follows: Personal remedies in cases of oppression or\n                            injustice 216.-(1) Any member or holder of a debenture\n                        of a company or, in the case of a declared company under Part IX, the\n                        Minister may apply to the Court for an order under this section on the\n                        ground - (a) that the affairs of the company are\n                        being conducted or the powers of the directors are being exercised in a\n                        manner oppressive to one or more of the members or holders of debentures\n                        including himself or in disregard of his or their interests as members,\n                        shareholders or holders of debentures of the company; or (b) that some act of the company has been\n                        done or is threatened or that some resolution of the members, holders of\n                        debentures or any class of them has been passed or is proposed which\n                        unfairly discriminates against or is otherwise prejudicial to one or more of\n                        the members or holders of debentures (including himself). 21     InOver & Over Ltd v\n                        Bonvests Holdings Ltd and another[2010] 2 SLR 776\n                        (“Over & Over”), the Court\n                    of Appeal ruled at [70] that s 216\n                    provides four alternative limbs under which relief may be granted - oppression,\n                    disregard of a member's interest, unfair discrimination or otherwise prejudicial\n                    conduct. It went on to observe that “the four limbs are not to be read\n                    disjunctively” and that “[t]he common thread underpinning the\n                    entire section is the element of unfairness.” It also affirmed (at [77])\n                    the formulation of a test for s 216 which was set out in the Privy Council case\n                    ofRe Kong Thai Sawmill (Miri) Sdn Bhd[1978] 2\n                    MLJ 227 and later cited with approval in the Court of Appeal case ofLow Peng Boon v Low Janie and others and other appeals[1999] 1 SLR(R) 337 at [43]: \"a visible departure from the standards of fair dealing and a violation of\n                        the conditions of fair play which a shareholder is entitled to\n                        expect\" 22     There is unfairness when a shareholder’s\n                    legitimate expectations are dashed. InOver &\n                        Over, the Court of Appeal also highlighted the special treatment\n                    of quasi-partnerships in relation to s 216 at [78], stating that in\n                    quasi-partnerships, members might well have legitimate expectations not embodied\n                    in the company’s constitutive documents: “[C]ourts, in deciding whether to grant relief under s 216 of the\n                        Companies Act, must take into account both the legal rights and the\n                        legitimate expectations of members.While these legal\n                            rights and expectations are usually enshrined in the company's\n                            constitution in the majority of cases, a special class of\n                            quasi-partnership companies form an exception to this\n                        rule.” [emphasis added] 23     More specifically, legitimate expectations\n                    might arise from informal understandings between shareholders. The Court of\n                    Appeal went on to hold at [84] that: Consistent with the above concerns,it is\n                            well-established that informal understandings and assumptions may be\n                            taken into account in determining whether the minority has been unfairly\n                            treated. Hoffman LJ insightfully summed up the position inRe Saul D Harrison & Sons plc[1995] 1\n                        BCLC 14 (\"Harrison\") when he stated, at\n                        19-20: Thus the personal relationship between a shareholder and those who\n                            control the company may entitle him to say that it would in certain\n                            circumstances be unfair for them to exercise a power conferred by the\n                            articles upon the board or the company in general meeting. I have in the\n                            past ventured to borrow from public law the term'legitimate expectation'to describe the correlative\n                            'right' in the shareholder to which such a relationship may give rise.It often arises out of a fundamental\n                                understanding between the shareholders which formed the basis of\n                                their association but was not put into contractual form... [original emphasis in italics; emphasis added in bold italics] 24     Not unexpectedly, such informal understandings\n                    have been held to be more easily found in quasi-partnerships than in ordinary\n                    companies (per Chan Seng Onn J inEng Gee Seng v Quek Choon\n                        Teck and others[2010] 1 SLR 241 at [18] to [19]): 18 Quasi-partnerships, however, are formed based on mutual trust and\n                        confidence, and their controllers ought to govern with a certain degree of\n                        integrity. Accordingly, a higher standard of governance is expected of them\n                        as compared with controllers of ordinary companies.Therefore, there should be greater leeway for finding informal\n                            understandings and expectations. This view has been clearly\n                        eludicated in cases such asSim Yong Kim v Evenstar\n                            Investments Pte Ltd[2006] 3 SLR(R) 827 (\"Sim Yong Kim\") andBorden. 19Sim Yong Kimwas a case concerning a\n                        quasi-partnership decided under s 254. Applying the reasoning ofRe A Company,Re Saul D Harrison\n                            & Sons plcandO'Neill, it\n                        is also applicable in the present instance.There, the\n                            Court of Appeal distinguished between situations involving ordinary\n                            companies and that involving quasi-partnerships, implying that the court\n                            would be more willing to find informal understandings and expectations\n                            which could triumph over the formal documents in the latter situation\n                            when equitable considerations make it unfair for those conducting the\n                            affairs of the company to rely upon their strict legal\n                        powers. [emphasis added] 25     Chan J, however, also held (at [10]) that the onus is on the minority to show\n                    the existence of an informal understanding giving rise to the dashed expectation\n                    which the minority claims: 10 These \"rational principles\" [upon which the concept of fairness is\n                        applied judicially] can be found in the law of contract as complemented by\n                        principles of equity. They apply so as to reflect the principle that\n                        promises should be kept and agreements should be honoured. Thus, in the case\n                        of an ordinary company,prima facie, the\n                        company's formal documents lay down the basis of the association\n                        exhaustively. However, there can also exist agreements, understandings or\n                        promises as between members of an association, which are not in those formal\n                        documents, but which may give rise to reasonable or legitimate expectations\n                        on the part of minority members.The onus will then be on\n                            the minority members to show that such informal or implied\n                            understandings, giving rise to certain expectations, exist.\n                        Conduct of the majority which conflicts with such expectations may be\n                        challenged for being unfair. [emphasis added]",
        "Issues": "26     I now consider the three issues that arise in\n                    this case: (i)     The first issue is whether Loh and the\n                    shareholder defendants had formed Hexa Chemicals as a quasi-partnership on the\n                    basis of mutual trust and confidence. (ii)     Following from that, the second issue is\n                    whether Loh rightfully held any legitimate expectations which were unfairly\n                    dashed by the defendants when they failed to distribute the profits of Hexa\n                    Chemicals to Loh in his capacity as a shareholder who had since retired from the\n                    company’s employment. If so, Loh would be entitled to remedies under s\n                    216. (iii)     The third issue is whether Loh was\n                    entitled to director’s fees for the period from 1 October 2005 to 31\n                    December 2005.",
        "(i)   Quasi-partnership, mutual trust and confidence": "27     The burden is on Loh to show that the\n                    relationship of the parties was akin to that of a partnership. In his pleaded\n                    case, Loh contended that Hexa Chemicals was entered into and run from its\n                    inception as if it were a partnership. In his closing submissions, Loh\n                    backtracked and submitted that a quasi-partnership does not require Hexa\n                    Chemicals to be entered into or run as if it were a partnership. Loh admitted\n                    that they consciously chose the company as a vehicle and that no one used or\n                    discussed setting up a partnership. Only the directors were involved in the\n                    management decisions. Wee and Chua never presumed to be entitled to partake in\n                    management of Hexa Chemicals, leaving that to Foo, Loh, Ko and Goh. That is\n                    clear on the evidence and I so find. 28     The parties clearly treated the company\n                    structure as relevant and they were conscious of the position of directors,\n                    shareholders and employees. They had a corporate hierarchy in place and they\n                    certainly did not behave like a partnership in any sense. They paid themselves\n                    salaries, director’s fees and incentives and such payments were booked as\n                    expenses. In addition they also ploughed back the profits. That too was by\n                    agreement. The principal movers of Hexa Chemicals consciously adopted a\n                    corporate structure to limit liability. They also ran Hexa Chemicals in\n                    accordance with their M & A. Loh admitted that no one discussed a\n                    partnership set-up when they were planning to set up on their own[note: 1]and indeed Foo testified emphatically that a\n                    partnership would not work, and that there had to be a hierarchy and the\n                    accountability system which flowed from that.[note: 2] 29     The group did not operate as a partnership in\n                    any sense whilst in Getz Bros. They were employees and they certainly did not\n                    associate on the basis of a personal relationship involving mutual confidence\n                    there or in Hexa Chemicals. They were unrelated to each other. There was no\n                    evidence that they met socially outside work.[note: 3]On the\n                    contrary, there was evidence, which I accept, that Loh was in the habit of\n                    ignoring people and Ko was surprised at Loh’s wedding when Loh introduced\n                    his wife to him. Loh did not introduce his wife to the other defendants and the\n                    fact that Ko was surprised shows they were not as close-knit as Loh put forward.\n                    In fact when pressed, Loh could not point to anything much more than that they\n                    lunched often together in Getz Bros and that they all worked hard and\n                    “were very close” as a team. At the end of the day, he added they\n                    were a quasi-partnership because they also plotted to come out together to do\n                    their business, they dreamt the same dream, they “actualised”\n                    their dream, they went through the ordeal of being sued and went through great\n                    pain.[note: 4]The defendants’ evidence, which I\n                    accept, did not support such a sanguine view of their closeness. Each person had\n                    his own individual interest when considering when to join. Loh clashed a number\n                    of times with Foo. Although the others wanted to, Foo was not ready to move from\n                    Getz Bros until there was a change of management which gave him no support. Wee\n                    only joined Hexa Chemicals in 2002. 30     During the course of cross-examination it\n                    emerged that when Loh subscribed for his shares as well as a portion of\n                    Wee’s shares, in anticipation of Wee taking up his shares at some later\n                    point in time, Loh charged Wee, unknown to the rest, interest on the amount\n                    advanced. None of the others charged Wee or Chua interest for holding their\n                    portion of the shares or taking up their proportion of the shareholders’\n                    loan. I find this, as I find Loh’s retort to the fact that the others did\n                    not charge an interest element: “That’s their choice”,\n                    rather ironic given his claim as to how close they were.[note: 5] 31     From my findings of fact above, Loh has failed\n                    to prove that the parties associated as a quasi-partnership with mutual trust\n                    and confidence in each other. The evidence clearly shows the parties\n                    deliberately adopted a corporate structure and ran it in accordance with that\n                    structure and their M&A.",
        "(ii)   Legitimate Expectations": "32     Even if I had found that Hexa Chemicals was\n                    indeed a quasi-partnership between Loh and the shareholder defendants as Loh\n                    submitted, I hold that Loh would still fail as he did not rightfully hold any\n                    legitimate expectations which were unfairly dashed by the\n                defendants.",
        "Loh’s evidence": "33     In essence, Loh said that when he retired, the\n                    shareholder defendants had an obligation to consider how to continue sharing\n                    Hexa Chemicals’ gross profits with him as a non-working shareholder. Loh\n                    took that position on cross examination: Q.I see. If that's\n                            the case, then all the directors' fees has nothing to do with equity\n                            distribution, right? A.Oh yeah.\n                            After I've left -- I mean, things have changed. Only when I say \"equity\n                            distribution\", it's only when I was there. After I left there is a new\n                            situation, a new structure. Then because it was originally formed with\n                            all the working shareholders, now the situation has\n                        changed. One has retired because of health reasons. Things\n                                have changed. So you must change the structure, the dividend\n                                structure, the way you give directors' fees. You have to re-look on\n                                all of this so that everyone will benefit. It's not that\n                            you just give myself dividend and then the rest, don't give them.\n                            Everyone will get dividends according to the shareholding, then they\n                            also will get the directors' fees if they are directors. [emphasis added] 34     In simple terms, Loh was asserting his\n                    entitlement to a share of the gross profits currently set aside for the working\n                    shareholders which were distributed in the form of directors’ fees and\n                    employee incentive payments. As a non-working shareholder, he could only have\n                    received such a share in his capacity as a shareholder – in the form of\n                    dividends. 35     Loh founded his expectation of dividends on\n                    the basis that common shareholders should be taken care of: Q.And the proper resolutions would have to be passed\n                            for dividends to be declared in Hexa Chemicals, right? A.Because the situation has changed, because there is now a common\n                                shareholder, so I presume that they should actually take care of the\n                                shareholder. [emphasis added] 36     Further, Loh seemed to have viewed his\n                    entitlement as a form of pension, available to working shareholders who retire\n                    because of health reasons: Q.Mr\n                                Loh, you see, if you can get -- if a person can get 80 per cent of\n                                his previous drawings-- let's use that word for the\n                            moment --even after he resigns, don't you think that\n                                all the shareholders would probably resign? A.No, they have no health reason. I have health reason. I actually\n                                not resigned, I retire. I retired for health reasons, as stated in\n                                my letter. So it is not the same as just walking away.\n                            And you press me for 80 per cent: actually to me it doesn't matter\n                            whether 80, 70 per cent or 60 per cent. If I can some kind of return, I\n                            would be happy, but this is already gone because there is no going\n                            back. [emphasis added] 37     As for how much Loh would have been satisfied\n                    with, he was not sure: Q.Let me bring you back to my question before you\n                            talked about public companies. My question was this: how much more would\n                            the directors' fees be, than the dividend you think should be paid to\n                            you? A.I\n                                don't have a fixed mind. I just want some return for my\n                                shareholding. I don't demand what numbers and all that. I never have\n                                thought any demand, but up to now I get\n                        zero. [emphasis added]",
        "The defendants’ evidence": "The 1999 “no work, no pay” understanding 38     The defendants’ strongly denied\n                    Loh’s claims, and alleged that on the contrary, there was in fact an\n                    informal but very clear understanding between the parties that “no\n                    work” meant “no pay”. The defendants contended that this\n                    informal understanding arose in 1999. 39     In 1999, Foo considered taking no-pay leave to\n                    pursue a business opportunity in Indonesia for a period of two years. He\n                    communicated this to the other directors as well as his expectation of a share\n                    of Hexa Chemicals’ profits if it did well. However, the other directors\n                    would not pay or share profits with him if he took no-pay leave. Foo testified\n                    under cross-examination: “Q.And in principle, they already disagreed\n                            that you could leave the company; you could take no pay\n                        leave? A:In principle, if I want to do it, then I have to\n                            abide by the directors' decision on whether I can go on leave, go on two\n                            years leave, but the condition is that there will be no pay and there is\n                            no share of profit. And because of that, I hesitated, and in the end I\n                            abort the whole project.” 40     This was further substantiated by Wee’s\n                    testimony in court, stating that at the age of 63, he continued to work because\n                    he knew that retirement meant no income. COURT:And have you heard of the views of these\n                            directors that, if you don't work, you don't get\n                            money? A.This sentence has been\n                            haunting my mind for many, many years before I get into Hexa. When I was\n                            still with Getz, the 2nd defendant told that they made up some kind of a\n                            landmark, landmark understanding that no work, no pay, in relation to\n                            the 1st defendant who wanted to leave to Indonesia to his, I heard\n                            something like that, for 2 years. But because of the plaintiff, 2nd defendant,\n                                3rddefendant's decision, and they\n                            enforce it, the 1st defendant decided to abort his plans to go to\n                            Indonesia.And that was told to me by the 2nd\n                                defendant, and that goes into my mind that I have to work in order\n                                to get money. I don't have a free ticket. Your Honour, I'm 63 years\n                                old. COURT:I was just going\n                            to ask you that. A.I\n                                nurse the desire to retire, but if I stop, I have no\n                                money. At the moment, I still need money for a while,\n                            until such time, if I prove myself that I'm useless, not providing, not\n                            an asset to the company, I will bow down and call it a\n                        day. [emphasis added] 41     On cross-examination, Goh also gave testimony\n                    that was consistent with that Foo’s and Wee’s statements. As regards\n                    the “no work no pay” understanding, she said: Q.And if Mr Loh, after his retirement, if he was not\n                            working and yet receive money, then you felt that the situation would be\n                            unfair to you who was working? A.That is definitely. Because there is a precedent\n                            set in1999 where the plaintiff was there too. He knew about\n                        it. Also, like Wee, she said she would prefer to resign and receive\n                    payouts in the capacity of a non-working shareholder if this was\n                    possible: Q.Did you go to Mr Foo to say that if Mr Loh was\n                            given a good package when he left, then you would also consider leaving\n                            the company? A.I cannot remember, but if such thing happen, why\n                            not? I rather -- I mean, resign and stay at home and be a housewife, to\n                            look after my children.",
        "Findings": "42     On the evidence, I find and hold that Loh has\n                    not made out his case that he rightfully held legitimate expectations which were\n                    unfairly crushed by the defendants when they failed to distribute the profits of\n                    Hexa Chemicals to him in his capacity as a shareholder after he had retired from\n                    the company’s employment. As a preliminary point, Loh was unable to give\n                    any evidence on how or when this informal understanding came about much less\n                    elaborate on the terms or details of this understanding which gave rise to his\n                    alleged legitimate expectations. The only point that initially stood out like a\n                    flag was that after he retired, there was a change in the remuneration\n                    structure. But when the reasons for that change are examined, it shows that the\n                    change had a legitimate basis. There was no commercial unfairness, prejudicial\n                    conduct or unfair discrimination. 43     I begin by setting out three important factual\n                    findings which pertain to the background of this dispute. The first important\n                    fact was that Hexa Chemicals needed capital to carry out its business. The\n                    evidence shows that the starting point was the capital base Hexa Chemicals\n                    needed to carry on its business of buying industrial and commercial chemicals in\n                    large quantities and re-selling them in smaller quantities to its retail\n                    customers. Borrowing the entire capital would have entailed a high cost. Hence\n                    they reduced the cost of their capital by their equity subscription and\n                    shareholders’ loans. They were “stockists” who had to know\n                    what chemicals were needed by their customers and therefore what to buy and\n                    where to buy it from. They also needed a good inventory and collection control\n                    as well as capital to fund the lag between having to pay their suppliers and\n                    principals and receiving payment from their customers. It was balanced by a\n                    proportion from the subscription for shares and the shareholders’ loan.\n                    The share capital was therefore not seen by the shareholders as an investment in\n                    the commercial sense, it was for working capital. How many shares each person\n                    was to hold was worked out and the loan would be in proportion to their\n                    shareholding. Loh was not able to dispute this. It was best put by Goh who gave\n                    the following evidence on cross-examination that the equity contributions of the\n                    shareholders were made to fund Hexa Chemicals’ business and not for\n                    investment gain: Q.Did it ever occur\n                            to you, after the plaintiff left the company, that as a shareholder, he\n                            should have a share of the profits of the\n                            company? A.In Hexa context, I\n                            never think of that. Q.Right. COURT:Why\n                            did you not think of it? A.Because you see, your Honour, we put in the shares.It is actually for the funding of the business. We never think\n                                about -- it is not an investment company, you know. I put in my\n                                equity side, is actually to fund the business. That's\n                            about all. I mean, we never think about how much the\n                                appreciation of the share and all that. I really never think about\n                                it. And the reserve that we put it inside is actually to maintain\n                                the cash-flow, your Honour -- We never think about the appreciation\n                                of the share, because if I want to buy share, I can\n                            always buy when the economy is down, like SQ, DBS and all this, where I\n                            can make a lot of money. That's what I think, I don't know, because we are a private company,\n                            it's a small company. That's what my feel. I don't know. [emphasis added] 44     The second most important point was that\n                    everyone had to work hard to produce the income. Their main asset was their\n                    personal skills. The agencies were mostly non-exclusive and their success would\n                    depend upon their knowledge of the business and the goodwill they had built up\n                    with their suppliers, principals and customers over the years. The business was\n                    a competitive one, there were others around, and some with deeper pockets, who\n                    could do the same thing. I also accept the defendants’ evidence that\n                    towards the end of 2005, the going got rough from the mergers of suppliers\n                    (including a major supplier which caused Hexa Chemicals to lose its sole\n                    importer status) and changes in the market place, which threatened Hexa\n                    Chemicals’ customer base.[note: 6]That\n                    is why Hexa Chemical’s work force was, until the end of 2005, only the six\n                    of them and one part-time book-keeper, (hence the name ‘Hexa’\n                    representing the six of them). That was why they all accepted low salaries, and\n                    for the principal movers, lower than what they obtained from Getz Bros. The\n                    reward would come from the profits they made. They could not and did not carry\n                    any passengers. The clearest expression of this came from an agreement in 1999\n                    amongst the principal shareholders, and accepted by the two minority\n                    shareholders, that if someone did not work, he would not get paid. 45     Thirdly, it is undeniable that from inception\n                    to 2005, Hexa Chemicals did not declare any dividends. It was also clear, and I\n                    so find, that there was an agreement to plough back profits. Loh himself agreed\n                    that the directors set a target reserve of at least $500,000.[note: 7]However, as noted above until the end of 2005,\n                    all the shareholders were working shareholders. The 1999 “no work, no pay” understanding 46     I also find the following facts as proved by\n                    the defendants. In 1999, Foo wanted to stop working in Hexa Chemicals for two\n                    years to pursue a business opportunity with his brother-in-law in Indonesia. Foo\n                    also expressed the expectation that he would continue to share in the profits of\n                    Hexa Chemicals while he was gone. The others protested, some vigorously. One of\n                    the latter was Loh. There was some argument and debate on this\n                issue. 47     Loh quite naturally did not want to\n                    acknowledge any “no work, no pay” agreement. He said he objected\n                    to Foo taking two years off because Hexa Chemicals needed Foo as the captain of\n                    its ship: Q.And my\n                            instructions are, and my clients will testify, that everyone in the\n                            discussion, including you, agreed that if the 1st defendant was not\n                            working in Hexa Chemicals, he could not get any remuneration, including\n                            share of profits? A.I\n                            disagree. Q.That never\n                            happened? A.The discussion\n                            didn't even progress to that stage, because when he said he wanted to go\n                            to Indonesia to help his brother-in-law to develop the China market, I\n                            was the first one to object. So, we didn't even go to discuss about profit and all that, because I\n                            was telling him:how can a ship without captain. That\n                                means who is going to steer the ship. And we didn't even\n                            progress to the next stage of discussion. It was a very short\n                            discussion, in a very informal environment, and there was no procession\n                            to the next stage. [emphasis added] However, when pressed, Loh also accepted that if Foo was not doing his\n                    job, he should not be paid: Q.You wanted the 1st defendant to stay and bear his\n                            share of the responsibilities for the work of Hexa Chemicals,\n                            right? A.That's correct, to lead the company. Q.That was his job in Hexa Chemicals;\n                        right? A.Exactly. Q.And if he wasn't doing his job, he should not be paid by Hexa\n                                Chemicals; right? A.Correct. [emphasis added] 48     Counsel for the defendants suggested to Loh\n                    that a second reason for Loh’s objection was precisely what Loh had just\n                    accepted,iethat if Foo was not doing his job, he\n                    should not be paid. However, Loh denied that and reiterated that his objection\n                    was because Hexa Chemicals needed a leader: Q.No, I'm asking\n                            you this: I'm saying to you, that is why you objected. Let me make it clear to you. I don't want to be unfair to you.I asked you, if he wasn't doing his job, the 1st\n                                defendant should not be paid by Hexa Chemicals. You said \"Correct\", and then I asked you, \"And that\n                                was why you objected?\"; correct? A.Not\n                            correct. Q.What is not correct\n                            about it? A.Because I objected, not because of pay or profit sharing; it's\n                                because we need a leader, and he should be there, and he\n                            should be there to lead us, and not go away to develop China market for\n                            his brother-in-law. That -- the pay issue and all that, was not --\n                                never in my mind, because it shouldn't happen in the first place, so\n                                there was -- it never in my mind about pay or\n                            profit. [emphasis added] In answer to a question I put to him, Loh also said that if Foo was\n                    not doing his job, he should not be paid and if Foo had wanted to go to\n                    Indonesia nonetheless, he might as well resign.[note: 8] 49     Against Loh’s evidence, the defendants\n                    testified that the “no work, no pay” agreement was the outcome of\n                    the debate among the directors arising from Foo’s proposal to leave Hexa\n                    Chemicals to pursue the opportunity in Indonesia. Although, as stated above, Loh\n                    had said that if Foo wanted to go to Indonesia then he would have told Foo that\n                    Foo might as wellresign, I note that counsel for\n                    Loh herself asked Foo (in cross-examination) whether there was an agreement\n                    among the directors that Foo could takeno pay\n                        leave: Q.And in principle, they [including Loh] already\n                            disagreed that you could leave the company; you could takeno pay leave? [emphasis added] 50     Foo answered that he was allowed to go on\n                    leave but the condition was that he would not be paid and not be allowed to\n                    share in the profit. Thus, he did not go to Indonesia: A.In principle, if\n                            I want to do it, then I have to abide by the directors' decision on\n                            whether I can go on leave, go on two years leave, but the condition is\n                            that there will be no pay and there is no share of profit. And because\n                            of that, I hesitated, and in the end I abort the whole\n                        project. You see, at that time when I brought this up, is because we only have\n                            two agencies, the rest are still not coming yet. So of course I don't\n                            blame, you know, the rest of the directors of their worry about the\n                            survival of the company. So I understand, and I understand that, and I\n                            support their decision for having all these conditions laid. So since then, we also have a discussion that, you know, we must be\n                            working in this company, otherwise none of us will have remuneration.So that is the agreed principle that we set and\n                                we follow through until now. ... Q.And you didn't\n                            have -- this was not reduced into\n                            writing? A.As far as I can\n                            recall, we have a discussion in the conference room among ourselves,\n                            among the directors. But we don't minute it up, I don't remember writing anything on\n                            that. [emphasis added] 51     The establishment of the “no work, no\n                    pay” principle as stated by Foo was corroborated by Ko’s testimony\n                    on cross-examination, when he referred to a meeting in 1999 which was attended\n                    by Loh, Foo, Goh and himself. With respect to the outcome of that meeting, he\n                    stated as follows: MS OEI:To be fair to you, are you referring to\n                            paragraph 27 of your affidavit, on page\n                            9? A.Yes, this is the one I am\n                            referring to. This is the meeting that we had in the conference room of\n                            Hexa Chemicals, and we all sat down at the conference table andwe were talking about Gilbert's intention to take\n                                no pay leave, to work in Indonesia for his\n                            brother-in-law. The final decision that we have reached was that no\n                                work, no pay, including a share of the profit, if the business does\n                                well. Q.At\n                                this alleged meeting in 1999, it was agreed that if you do not work,\n                                you do not get paid? A.Yes. Q.And this was a meeting of all the directors of the\n                            company? A.1999, four directors -- yes. Q.Yes. This agreement is not minuted, isn't it? There\n                            is no written evidence of this agreement; isn't that so,Mr\n                        Ko? A.That is true. There is no written minutes of this\n                            -- [emphasis added] 52     Goh, who was present at that meeting in 1999,\n                    was not cross-examined on Foo’s proposal to leave Hexa Chemicals to pursue\n                    the opportunity in Indonesia. However, she too made a reference to the\n                    “no work, no pay” principle, which she said Loh knew about: Q.And if Mr Loh, after his retirement, if he was not\n                            working and yet receive money, then you felt that the situation would be\n                            unfair to you who was working? A.That is definitely. Because there is a precedent set in1999 where\n                                the plaintiff was there too. He knew about\n                        it. [emphasis added] 53     As for Wee and Chua, Wee testified that Ko had\n                    told him of the “no work, no pay” understanding (which Wee\n                    described as “landmark”) when he was still with Getz (see[41]above); Chua also testified that\n                    she thought she heard about the decision on the “no work, no pay”\n                    principle from Goh, even though she did not participate in the debate which led\n                    to it.[note: 9] 54     I found two points significant. The first was\n                    that when Foo and Ko were cross-examined regarding the directors’\n                    reactions to Foo’s proposal to leave Hexa Chemicals to pursue the\n                    opportunity in Indonesia, counsel for Loh did not suggest to them that the\n                    objections to Foo’s proposal were not based on a “no work, no\n                    pay” principle, but rather based on the reason that Foo was required to\n                    lead Hexa Chemicals, as Loh said his reason for objecting was. Rather, counsel\n                    for Loh merely attacked Foo’s and Ko’s testimony on the basis that\n                    the alleged “no work, no pay” understanding was not put down in\n                    writing – which Foo and Ko candidly admitted to (see above at[50]and[51]respectively). I also noted that counsel for Loh did not even challenge Goh on\n                    the meeting which allegedly led to the “no work, no pay”\n                    understanding. Ko had stated on cross-examination earlier that Goh was present\n                    at that meeting as well (see[51]above). 55     The second point which I found notable was\n                    that it was undisputed (see[49]above where\n                    I noted that counsel for Loh herself asked Foo whether there was an agreement\n                    that Foo could takeno pay leave) that in 1999,\n                    the directors did allow Foo to leave Hexa Chemicals for Indonesia onno pay leave,iethat he\n                    would not receive pay or a share of the Hexa Chemicals’ profits during his\n                    leave period. In my view, this arrangement suggested that the concern of the\n                    directors (besides Foo) was that Foo should not be paid if he were not workingiewhen Foo wanted to resume working, he could\n                    then be paid. It seemed to me that if the primary concern was that Foo, the\n                    so-called captain and leader of Hexa Chemicals, was abandoning ship and leaving\n                    it to sink – then the other directors would have, like Loh said, told Foo\n                    that he “might as well resign”. It seemed more likely that they\n                    would pull out all the stops in getting Foo to stay, as opposed to simply\n                    granting him no-pay leave and allowing him to return whenever he\n                pleased. 56     I should note that Loh was not a satisfactory\n                    witness. He had a fixation that he was hard done by and kept repeating the same\n                    thing – they were very close. Regarding his demeanour as a witness, he\n                    failed to answer questions, there were long pauses before he answered some\n                    awkward questions and he often avoided answering directly any questions which\n                    showed up his position as untenable. He seldom made eye contact with anyone and\n                    kept staring down at a point on the floor next to the Bar table even when he was\n                    answering questions. The defendant’s closing and reply submissions contain\n                    many examples of these instances and it would take too long to set them out\n                    here. The defendants performed far better under cross-examination. They were\n                    candid and seldom hesitated. Many of their answers had the ring of truth to\n                    them. 57     Considering the evidence from both sides, I\n                    accept the evidence from the defendants, and find and hold that they all\n                    accepted the “no work, no pay” principle right from\n                1999. 58     Given the nature of their business, common\n                    sense dictates that there can be no other alternative. If not, it would in fact\n                    be an incentive for the shareholders to retire, let the others slog and make the\n                    profits, and come forward to share in the spoils. Wee said, not without\n                    significance, that he was already 63 years old and would take retirement if he\n                    could continue to receive money after he retired; but he knew that if he did not\n                    work, he would not share in the profits. That was the agreement. Since he needed\n                    the money for a while more, he had to work. Goh gave the same reason, stating\n                    that she would be better off being at home with her family. In his\n                    cross-examination, Loh was unable to answer this indisputable point: Q.If everybody retires, then who will earn the\n                            money? A.But they have no health problem and they are not of\n                            retiring age. Q.Is there a retirement age in the company's M &\n                            A, for example? A.No. Q.In the employment contracts? A.No. Q.There is no retirement age specified for Hexa\n                            Chemicals; correct? A.No. 59     There was certainly no element at all of\n                    reward for investment risk as far as putting up the share capital of Hexa\n                    Chemicals was concerned (see also Goh’s testimony at[43]above). Equity ratio as a proxy for workload 60     Before Loh’s retirement in 2005, the\n                    gross profits of Hexa Chemicals were primarily distributed to its shareholders\n                    according to their respective shareholdings. I accept the defendants’\n                    explanation for this - the gross profits were distributed as remuneration for\n                    work done and the equity ratio was a proxy for what the shareholders thought was\n                    each shareholder’s ability to generate work and income and what therefore\n                    their respective workload was going to be. Loh also agreed that the\n                    directors’ fees and incentives were paid for work done and not because the\n                    recipients were shareholders.[note: 10]Loh’s duties as a\n                director 61     I also accept the following evidence from the\n                    defendants and find them as facts. Loh was slipping at the time he tendered his\n                    resignation in October 2005. There was an email from an important principal,\n                    Eastman Chemicals, severely criticising Loh in unflattering terms and\n                    threatening Loh: “If you [referring to Loh] still do not have any clue about your\n                        business then. I think I need to something in [sic] soon. As I mentioned in the meeting many things has\n                            [sic] changed this way of reporting is not\n                            acceptable.”[note: 11] 62     Loh was clearly embarrassed in\n                    cross-examination by this email and pretended he did not understand what the\n                    writer, one Gunawan Suryawan, was saying in the email.[note: 12]Loh also made some fundamental mistakes in\n                    ordering some chemicals and caused Hexa Chemicals some loss. In one example, he\n                    ordered a quantity of a “single customer product” (iebrought in for sale to only one customer) in excess\n                    of what the customer required without asking for an additional blanket purchase\n                    order to cover the excess quantity, thereby leaving Hexa Chemicals with\n                    unnecessary inventory. In another example, Loh ordered additional 907.2 kg, in\n                    May 2005, of a certain chemical despite having 750 kg of the chemical already in\n                    stock for more than a year; moreover, he failed to realise that the customer had\n                    substituted that item with a cheaper alternative and had stopped buying it from\n                    Hexa Chemicals. Loh’s resignation 63     It is not disputed that on or about January\n                    2004, Loh tendered a first resignation letter, requested that his loan of\n                    $151,500 to Hexa Chemicals be repaid and said he hoped to sell his shares. This\n                    resignation was subsequently withdrawn. But it caused the other directors to set\n                    aside a higher surplus of reserves for Financial Year 2005 in case they had to\n                    repay Loh’s portion of the loan. They must have sensed that he might not\n                    stay on for very long. On or about 12 October 2010, Foo asked Loh to write\n                    to Hexa Chemicals confirming that he would not ask for interest on his loan on\n                    the condition that Hexa Chemicals would fully redeem the loan by way of monthly\n                    instalments from 2006 to 2008. As a prudent measure, the remaining directors\n                    also started making provision for paying back the other shareholders’\n                    loans over a three year period. To date, the shareholder defendants have only\n                    had one third of their loans to Hexa Chemicals repaid. 64     On 31 October 2005, Loh tendered his\n                    resignation, giving two months’ notice, citing health reasons. It is\n                    important to note that his resignation as a director was entirely voluntary. No\n                    one pushed him to resign. He was in fact offered a consultancy role by Foo but\n                    Loh refused it. Loh asked the other directors to inform the bankers of his\n                    resignation and asked that he be released from the joint and several guarantee\n                    to the banks as security for the loans made to Hexa Chemicals. This was done.\n                    Loh was released from all the bank guarantees. Loh’s loan has also been\n                    fully repaid. As noted above, repayment of the loans to the others was halted\n                    after December 2006 as it was required to maintain Hexa Chemical’s\n                    cashflow. Hexa Chemicals after Loh’s resignation 65     I also find that Loh’s resignation also\n                    came at a time when Hexa Chemicals was facing a tough market and great\n                    challenges due to market changes. Hexa Chemicals had also just lost its biggest\n                    customer, Akzo Nobel, which according to Ko accounted for about 23% of their\n                    revenues. This was not challenged. Suppliers merged with others which already\n                    had distributors. Trading on the internet became more prevalent and the role of\n                    the middleman was being eroded. Some shareholders felt Loh bailed out when the\n                    ship was facing ‘choppy’ waters. Such views are not without\n                        foundation.[note: 13]I find that when Loh retired, the\n                    others had to double up as their number had dropped from six to five; and the\n                    one who dropped out was one of the main workers. Ko, especially, had to take\n                    over the principals and customers that Loh usually dealt with. They had to\n                    attend more trade shows, travel more often, meet new suppliers and try to get\n                    new agency lines. They struggled hard but they got through the difficult period.\n                    Ko and Goh then approached Foo and asked for a restructured remuneration package\n                    to place greater emphasis on performance. As noted above, Foo took time to think\n                    about it and subsequently agreed. Foo testified, and I accept his evidence, that\n                    he had to do this to prevent others from following in the footsteps of Loh,ieretiring and leaving him alone in Hexa\n                        Chemicals.[note: 14]This was his top priority. He\n                    could not afford to lose any more key people. Goh herself testified, and I also\n                    accept her evidence, that if she could resign as a director and still receive a\n                    share of the profits, as Loh was proposing, then she too might as well resign as\n                    a director and stay home to look after the children, (see[41]above). 66     This revised remuneration structure was\n                    understandable. An amount, as usual, would be set aside for reserves. The\n                    directors would decide and set aside a total amount to be reserved for\n                    remuneration and incentives at the end of the year. There was a flat incentive\n                    payment component and the balance would be distributed as to half, given to\n                    shareholders according to their percentage shareholding, and the other half\n                    given to working shareholders based on their performance,ie, the incentive component. The directors would receive\n                    directors’ fees out of the incentive allowance component. Foo’s\n                    evidence was that he needed more flexibility and he needed to properly reward\n                    those who were bringing in the revenue. After Loh’s first resignation\n                    letter in January 2005, which was withdrawn, Hexa Chemicals hired one\n                    Ms Jennifer Chen as a sales engineer on 30 September 2005. This was\n                    just as well as Loh tendered his resignation for the second time one month\n                    later. Hexa Chemicals then hired a clerk sometime on or about 10 April\n                    2007, another sales engineer sometime in 2008 and yet one more sales engineer in\n                    2009. 67     I find that it was through the re-doubled\n                    efforts of the remaining members of the team that made this expansion possible.\n                    I also find that after a dip in revenue caused by Loh’s departure, the\n                    remaining team built it back up. There was an increase in the revenue from some\n                    $8.9 million in 2006 and $8.2 million in 2007 to $10.68 million in 2008 and\n                    $9.45 million in 2009. Loh did not contribute to any of this. At the end of the\n                    day, Loh was not able to prove that the defendants dipped into the reserves and\n                    profited themselves at his expense after he left. That is simply not true as a\n                    fact. There was no injustice in the circumstances and facts of this case,\n                    neither was there commercial unfairness. The defendants’ offer to purchase Loh’s shares 68     I now come to another point of note although\n                    it is of no legal consequence in view of my judgment. The defendants offered to\n                    purchase Loh’s shares in accordance with the procedure set out in the\n                    M&A. However, Loh ignored the prescribed procedure which bound his sale of\n                    his shares. 69     Between 23 March 2009 and February 2010 there\n                    was an exchange of letters that culminated in Loh’s demand to be paid a\n                    staggering sum of $1.1 million for his shares and the shareholder\n                    defendants’ counter-offer of $315,000 which was about 14% below valuation.\n                    Loh had first suggested Hexa Chemicals engage a reputable accounting firm to\n                    value the shares and he would seek a second professional opinion if necessary.\n                    The defendants invited Loh to issue an “Article 29” notice to\n                    transfer his shares under the M&A; and stated that the fair value of Hexa\n                    Chemical’s shares would be determined by its auditors in accordance with\n                    Article 31 of the M&A. Loh replied that he was seeking advice before\n                    providing a more substantive response. Loh then changed his position, saying\n                    that he had no wish to offer his shares in the company at that point in time and\n                    alleged for the first time that Hexa Chemicals was formed by its founding\n                    members on terms similar to a partnership. Loh also said he was prepared to\n                    consider selling his shares at $11.27 per share or $1,183,350 for his 21%\n                    shareholding. On 21 July 2009, the company’s auditors, presumably at the\n                    behest of the defendants, determined a fair value to be $3.50 per share. The\n                    defendants then offered to purchase Loh’s shares at $315,000 (working out\n                    to $3.00 per share). The Defendants expected Loh to come back to negotiate but\n                    Loh initiated these proceedings. Loh had no legitimate expectation of dividends 70     Having found that there is no relationship of\n                    mutual trust and confidence between the parties which gives rise to a\n                    quasi-partnership; and having found that there is no informal understanding\n                    between the parties which engenders Loh’s legitimate expectation to have\n                    been paid dividends; I also find that no such legitimate expectation arises from\n                    Hexa Chemicals’ constitutive documents or on any of the other facts of\n                    this case. Loh was not treated unfairly simply by virtue of the fact that he did\n                    not receive dividends from Hexa Chemicals. Indeed, in her book,Minority Shareholders' Rights and Remedies(LexisNexis,\n                    2nd Ed, 2007), Margaret Chew points out (at p 149) that: Generally speaking, a shareholder cannot compel a company to declare\n                        dividends. The declaration of dividends and the quantum of dividends to be\n                        declared are business decisions to be made by the board of directors.\n                        Typically, the board of directors recommend a dividend and the shareholders\n                        declare it. The failure to recommend or effect the declaration of dividends\n                        does not itself amount to unfair conduct impeachable under section 216 of\n                        the Companies Act.",
        "(iii)   Whether Loh was entitled to director’s\n                fees": "71     Finally, as for Loh’s complaint that\n                    Hexa did not pay him director’s fees for the period from October to\n                    December 2005, I have found above that Loh had not performed his duties properly\n                    as a director and had caused Hexa Chemicals loss. I have also found that Loh had\n                    been criticised by an important principal as having “no clue”\n                    about his business. Loh’s response to the defendants’ submissions\n                    was completely unsatisfactory – saying simply this in his\n                    submissions: Although there is no policy of making employees personally responsible for\n                        losses, the 1stto 5thDefendants now seek to make the Plaintiff personally responsible for a loss\n                        of less than $10,000.[note: 15] 72     On the findings that I have made, including\n                    (but not limited to) the basis for and manner of the payment of director’s\n                    fees by Hexa Chemicals, as well as, Loh’s performance as a director during\n                    this period, I find that the other directors and shareholders had reason to\n                    withhold his directors fees for this period. I therefore dismiss Loh’s\n                    complaint and claim in this respect as well.",
        "Conclusion": "73     Having found that Loh was not treated unfairly\n                    by the defendants, I dismiss Loh’s claim as he has not made out any case\n                    for relief under s 216. It is clear that this court cannot exercise or assume\n                    jurisdiction to grant relief under s 216 unless Loh has first of all established\n                    a case of oppression and/or discriminatory and/or prejudicial conduct amounting\n                    to commercial unfairness under s 216: seeHoban Steven\n                        Maurice Dixon and another v Scanlon Graeme John and others.\n                    [2005] 2 SLR(R) 632 (“Hoban Steven”)\n                    per Rajah J, as he then was, at [12]. Although this case went on appeal in Civil Appeal No 129\n                    of 2004, this part of the ruling was not disturbed (seeHoban\n                        Steven Maurice Dixon and another v Scanlon Graeme John and others[2007] 2 SLR(R) at [12]). 74     The parties are therefore left with their\n                    contractual and other remedies. Much as I would like to resolve the dispute\n                    between the parties,eg, by ordering a buy-out and\n                    specifying the terms or basis on which it should be done, I cannot do so as a\n                    matter of law. InHoban Steven, the parties agreed\n                    that they were dropping their disputes and not litigating the s 216 issues,\n                    leaving the issue of the exit mechanism to be contested. This is not the case\n                    here. 75     I express my hope that the defendants will\n                    offer to buy Loh’s shares at a fair price so that the parties can part\n                    ways amicably and move on from this unhappy state of affairs without the need\n                    for further litigation. I note that the defendants have previously offered to\n                    buy Loh’s shares for $315,000 (to be fair to them, they expected Loh to\n                    come back to negotiate), when the company’s auditors valued them at\n                    $367,500. While I express no views on the fairness of those particular figures\n                    and how they were arrived at, it would seem to me that it would serve the\n                    parties well to mediate their differences over the share price. 76     Although I have not heard counsel on costs,\n                    the defendants have contended that this claim should be dismissed with costs.\n                    They have succeeded on all fronts and Loh has not succeeded on any issue. I\n                    therefore award costs to the defendants, if not agreed, then to be taxed. Mr\n                    Alvin Cheng, counsel for Hexa Chemicals quite correctly took the position that\n                    this was a shareholder dispute that did not involve the company. He thus took no\n                    part in the trial. I therefore make no order as to costs for Hexa\n                    Chemicals.  [note: 1]Notes of Evidence, 2 August 2010 at p\n                        106. [note: 2]Notes of\n                                Evidence, 5 August 2010 at p\n                178. [note: 3]Notes of\n                                Evidence, 5 August 2010 at pp 73-74. [note: 4]Notes of Evidence, 2 August 2010 at p\n                            36. [note: 5]Notes of Evidence, 4 August 2010 at p\n                        20. [note: 6]Notes of\n                                Evidence, 5 August 2010 at pp 94-95. [note: 7]Notes of Evidence, 3 August 2010 at p\n                        27. [note: 8]Notes of\n                                Evidence, 3 August 2010 at p\n                33. [note: 9]Notes of Evidence, 6 August 2010 at pp\n                            111-112. [note: 10]Notes of\n                                Evidence, 2 August 2010 at pp 121-122 and\n                        128-129. [note: 11]Agreed\n                                    Bundle of Documents, Volume 2 at p\n                        473. [note: 12]Notes of Evidence, 3 August 2010 at pp\n                        71-76. [note: 13]Notes of Evidence, 5 August 2010 at pp\n                                91-95. [note: 14]Notes of Evidence, 5 August 2010 at pp\n                                141-142. [note: 15]Plaintiff’s Written Submissions at\n                                [161(h)]."
    }
}