{
    "case_title": "Chan Pui Woo Teresa\n      v\n      Ng Fook Khau Michael and another",
    "ncitation": "[2011] SGHC 65",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "Introduction": "1       Chan Pui Woo Teresa (“Teresa”),\n                    who is the plaintiff in this suit, was the unfortunate victim of an advance fee\n                    fraud, more commonly known as the “419 fraud” or “Nigerian\n                    scam”. She sued Ng Fook Khau Michael (“Michael”) who is the\n                    first defendant, and her former colleague Jonathan Tan See Leh\n                    (“Jonathan”) who is the second defendant, holding them responsible\n                    for the money she lost as a result of the fraud. Advance fee fraud comes in many\n                    variations but the basic concept is that the target is induced to part with his\n                    money to the fraudster in the hope of realising a significantly larger gain. The\n                    fraudster first baits the target by, for example, promising him a cut of a large\n                    sum of money locked up somewhere in exchange for his assistance in transferring\n                    the money through his bank account, or informing him that he has won a lottery.\n                    If the target expresses interest, the fraudster would take him through a series\n                    of steps to effect the transfer of the “money”. However, there\n                    would invariably be hurdles along the way and the fraudster would ask the target\n                    to advance some of his own money first to pay administrative fees, deposits,\n                    taxes,etc. The target, lured by the prospect of\n                    easy money, coughs up the sum requested but would then encounter more hurdles\n                    necessitating the payment of further sums of money. The process repeats itself\n                    until the fraudster disappears without a trace or the target realises he has\n                    been deceived. By then, the target would possibly have parted with substantial\n                    amounts of money. 2       The fraud here was apparently perpetuated by\n                    Michael among some members of the Christian community in Singapore which\n                    included Teresa. It is not disputed that Teresa had advanced various sums of\n                    money to Michael, in respect of which she sued him for recovery. Teresa also\n                    claimed damages against Jonathan for fraudulent or negligent misrepresentation\n                    in respect of the fraud. 3       Teresa obtained interlocutory judgment against\n                    Michael on 11 August 2009 due to the latter’s failure to comply with\n                    an “unless” order. The trial before this court was only to\n                    determine Teresa’s claim against Jonathan.",
        "The facts": "4       Teresa and Jonathan were advocates and\n                    solicitors who at the material time practised under the Raffles Group Law\n                    Practice. Teresa joined the group sometime in early 2001 practicing under the\n                    name of C Teresa & Co. She was called to the Singapore Bar in 1982. Jonathan\n                    joined later that same year practicing under the name of Tan Partnership. They\n                    initially got along well together both professionally and socially and this was\n                    in part due to their mutual Christian background. Teresa was a volunteer for her\n                    church in many overseas missions while Jonathan was a pastor. They also worked\n                    together on several cases in their practice and shared legal fees. 5       Sometime in mid-2002, Jonathan introduced\n                    Michael to Teresa and mentioned that Michael was a fellow Christian. Michael had\n                    at that time presented himself as a businessman cum international banker who was\n                    trying to retrieve a sum of US$45.8m from an account with a bank in London\n                    called the “First Merchant Bank”. Apparently, the money belonged\n                    to Michael but in order to obtain the funds, he was first required to pay a tax\n                    to an entity called the “British International Monitory [sic] Fund” (“BIMF”). Michael had\n                    also apparently negotiated with one Dr Paul Smith from BIMF to pay part of\n                    the tax first to secure the release of a proportionate amount of the funds,\n                    which would then be used to pay the remaining tax for the balance. As such,\n                    Michael needed to raise S$150,000 for the purpose and promised a 100% return to\n                    those who could assist him financially to achieve his goal. 6       The events that subsequently transpired between\n                    Teresa and Jonathan are disputed but suffice it to say, Teresa was convinced\n                    enough to participate in Michael’s scheme. By an agreement dated\n                    17 July 2002 (“the First Agreement”), Teresa agreed to\n                    advance S$150,000 to Michael, and handed him two cash cheques (drawn on her\n                    overdraft facilities with her banks) totalling the said amount. In return,\n                    Michael gave Teresa a post-dated cheque for the sum of US$172,911 (equivalent to\n                    S$300,000 at the agreed exchange rate of US$1 to S$1.735). It was not disputed\n                    that the First Agreement was prepared by Jonathan. Michael then remitted the\n                    S$150,000 to a local company called Shankar’s Emporium Pte Ltd (sometimes\n                    misspelled as Shanker’s in the documents), which was supposedly the\n                    authorised revenue collector for BIMF. 7       The funds in Michael’s account with First\n                    Merchant Bank were supposed to have been released shortly after the signing of\n                    the First Agreement but in early August 2002, a new hurdle cropped up.\n                    Michael’s story was that Dr Paul Smith’s superior in BIMF, one Mrs\n                    Margaret York, was now insisting on the full payment of the tax before any funds\n                    would be released. Michael thus needed to raise another US$380,000 to pay the\n                    balance of the tax. Teresa was of course upset by this turn of events and again,\n                    what happened next between her and Jonathan was disputed. 8       In any event, Teresa eventually entered into\n                    another agreement with Michael dated 14 August 2002 (“the Second\n                    Agreement”). Under the Second Agreement, Teresa would advance a further\n                    sum of S$672,600 (equivalent to US$380,000) to Michael, in consideration of\n                    which she was “guaranteed” a dividend of S$1,008,900, amounting to\n                    about a 150% return. The total sum due to Teresa thus increased to S$1,681,500.\n                    The Second Agreement further stipulated that Michael was to pay the S$1,681,500\n                    to Teresa by 26 August 2002, with a penalty of S$5,000 per day chargeable\n                    from 29 August 2002 until payment. Finally, the Second Agreement also varied the\n                    terms of the First Agreement in that Teresa would now stand to collect S$315,000\n                    under the First Agreement, being her principal of S$150,000 and a dividend of\n                    S$165,000. As with the First Agreement, the Second Agreement was also prepared\n                    by Jonathan. 9       In order to raise the additional S$672,600 for\n                    the Second Agreement, Teresa obtained a bank overdraft facility using her\n                    condominium flat as collateral. She then executed a telegraphic transfer of the\n                    funds to Shankar’s Emporium Pte Ltd. Pursuant to the Second Agreement,\n                    Teresa received another post-dated cheque from Michael for US$950,000\n                    (equivalent to S$1,681,500 at the agreed exchange rate of US$1 to\n                    S$1.77). 10     Unfortunately for Teresa, the returns promised\n                    by Michael did not materialise by 26 August 2002 and there were no signs\n                    throughout the rest of the year that she was going to be paid. It is unclear\n                    what happened from here until mid-2003 although Michael apparently flew to\n                    London in late 2002 to enquire about the release of the US$45.8m. It seemed that\n                    Michael was encountering more and more administrative obstacles in his bid to\n                    have the funds released to him. 11     In May 2003, Michael apparently needed more\n                    funds allegedly in connection with the release of the US$45.8m. Thus, by another\n                    agreement dated 13 May 2003 (“the Third Agreement”), Teresa\n                    and Jonathan agreed to advance US$10,000 and US$5,000 to Michael respectively.\n                    In return, Michael promised to pay US$127,500 and US$63,750 to Teresa and\n                    Jonathan respectively by 21 May 2003, with a late payment interest of 10%\n                    per annum. Like the First and Second Agreements, the Third Agreement was also\n                    prepared by Jonathan. 12     Not surprisingly, the promised returns on the\n                    Third Agreement never materialised. Michael’s story to Teresa and Jonathan\n                    was that First Merchant Bank was unable to release the US$45.8m because of a\n                    last minute intervention by the Nigerian government. Apparently, the Nigerian\n                    government had suspected that the funds in the account were illegally siphoned\n                    from Nigeria, and had obtained an injunction against First Merchant Bank\n                    requiring the latter to remit the funds back to Nigeria. After further\n                    investigation by the Nigerian authorities, the funds were found to be legitimate\n                    and were thus transferred to an account with the Union Bank of Switzerland\n                    (“UBS”) to be released to Michael. However, Michael was first\n                    required to pay a “European Union Tax” of 2% (amounting to\n                    US$916,000) plus a further auxiliary sum of US$4,580 to an entity called the\n                    “European Tax Advisory Board” before the funds would be released\n                    to him. 13     Michael thus started roping more people into\n                    the scheme, presumably to raise the funds required to pay off the 2% tax. From\n                    September 2003 onwards, Michael entered into agreements with various\n                    “investors”, promising them an extremely high rate of return\n                    (ranging from 100% to 200%) within 30 days of their initial payment. Some of\n                    those investors appeared as witnesses at the trial and testified that they were\n                    introduced to Michael by mutual Christian friends. While Michael was raising\n                    this money, Jonathan had also been negotiating with one Peter Bockli\n                    (purportedly from UBS) to pay the 2% tax in instalments. 14     Around the same time, the Commercial Affairs\n                    Department (“CAD”) commenced an investigation into Michael’s\n                    affairs. Pursuant to the investigation, Jonathan furnished several documents to\n                    CAD in January 2004 at its request. The documents comprised Michael’s\n                    online account statements with First Merchant Bank and correspondence with both\n                    the bank and BIMF. 15     Michael eventually managed to raise enough\n                    money from his various investors to pay part of the 2% European Union Tax but\n                    this was still not yet the end. Apparently, UBS then insisted on payment of\n                    certain audit fees. In September 2004, Jonathan wrote on Michael’s behalf\n                    to several investors informing them of the development and assuring them that\n                    their monies would be paid with the promised returns in due time. Unfortunately,\n                    it seemed that Michael was unable to raise enough monies to pay the audit fees\n                    in full. From late 2004 to early 2005, Jonathan corresponded with one Vieri\n                    Mallorca and one Lawrence Weinbach, who purportedly worked for UBS, assuring\n                    them that Michael would eventually settle the audit fees to effect the release\n                    of his funds. It was not disputed that until April 2005, Michael was still\n                    entering into new agreements with investors in order to raise funds. All the\n                    agreements for the fund-raising exercise were drafted by Jonathan. 16     However, UBS apparently started to lose\n                    patience with Michael’s inability to pay the audit fees and threatened to\n                    remit the US$45.8m back to Nigeria in early 2005. There was no more\n                    correspondence between Jonathan and the purported UBS officials after April\n                    2005. 17     In August 2005, CAD began another round of\n                    investigations on Michael and he did not enter into any more agreements with\n                    investors thenceforth (save for a single agreement dated 9 May 2006 which\n                    he made with an existing investor). Finally, by a letter to Michael dated\n                    13 July 2006, CAD stated: Our investigations into the case have been completed. We have reasons to\n                        believe that you are a victim of a fraud as the correspondence allegedly\n                        from UBS had been verified to be fictitious in nature. You are hereby advised to refrain from soliciting further loans for such\n                        purposes. You may be liable for criminal conduct if you persist to continue\n                        with such activities. 18     It was unclear what happened to the other\n                    investors eventually but Teresa on her part had not recovered the monies she had\n                    invested with Michael. Understandably, she was completely devastated when she\n                    realised she had been cheated and that the monies she had paid to Michael were\n                    never coming back. To make matters worse, she was saddled with substantial debts\n                    since she had borrowed heavily from her banks to provide funds to Michael under\n                    the First and Second Agreements. Teresa eventually settled her debts by selling\n                    off most of her assets and by drawing on her savings. Subsequently, she made\n                    several enquires and discovered that First Merchant Bank, BIMF, and the European\n                    Tax Advisory Board were entirely fictitious entities.",
        "The claim": "19     Teresa commenced this action against Michael\n                    and Jonathan in July 2008. As noted earlier at[3], Teresa has obtained interlocutory judgment against\n                    Michael. 20     In her statement of claim Teresa alleged that\n                    Jonathan had fraudulently or negligently misrepresented to her that\n                    Michael’s scheme was genuine, which caused her to advance monies to\n                    Michael under the three Agreements which were never repaid. Teresa claimed\n                    damages from Jonathan in respect of those losses. Aside from the three\n                    Agreements, Teresa had also advanced other sums to Michael between 2002 and\n                    2005, presumably in connection with Michael’s scheme, and accordingly\n                    claimed recovery of those sums from Jonathan. The details of the additional\n                    payments are as follows: DateAmountPurpose4 October\n                                        2002S$2,416.66For Michael’s use in\n                                            London27 December\n                                        2002S$1,500For Michael’s use in\n                                            London12 March\n                                        2003S$7,300Interest-free loan to\n                                            Michael17 June\n                                        2003S$4,000Investment with\n                                            Michael26 January\n                                        2005S$4,000Investment with\n                                            Michael27 January\n                                        2005S$3,600Investment with\n                                            Michael   21     It was not disputed that Jonathan was never\n                    involved in the three investments set out in the above table. Those investments\n                    were made between Teresa and Michael and were wholly separate from the three\n                    Agreements. In fact, it was Teresa herself who drafted the agreements for the\n                    three investments",
        "Fraudulent misrepresentation": "22     It was unclear whether Michael was the\n                    ultimate mastermind behind this entire fraud or whether he had been similarly\n                    deceived and ended up dragging many other victims down with him. In the light of\n                    the letter from CAD (referred to at[17]above), and the fact that he had not absconded by the time these proceedings\n                    began, it is more than likely that Michael too was a victim of fraud. The real\n                    perpetrators of the fraud were those who had masqueraded as Paul Smith, Peter\n                    Bockli, and the numerous other individuals and organisations with whom Michael\n                    and Jonathan had corresponded and who remain scot-free to this\n                date. 23     Although Michael was probably not complicit in\n                    the fraud, the evidence at trial strongly suggested that he had, in any event,\n                    been dishonest with Teresa and the other investors from whom he procured funds.\n                    Teresa and Jonathan both testified that Michael had told them he was a director\n                    for Asia of a bank called the “Swiss-Euro Credit Bank”, and had\n                    even given them name cards so stating. However, his professed identity was\n                    clearly false as no such bank existed. No one really knew what Michael did for a\n                    living although it came to light in the course of the trial that he had\n                    previously been convicted and sentenced to nine years’ jail in 1981 for\n                    his involvement in a conspiracy to cheat a bank using false documents to\n                    negotiate letters of credit and making false insurance claims. Unfortunately,\n                    this was not known to Teresa and the other investors, who only knew Michael as a\n                    Christian brother in need of financial assistance. 24     Much of the background evidence adduced at the\n                    trial was incomplete but from available documents, it seemed fairly obvious that\n                    Michael had been lured by unknown scammers with the promise of quick money, and\n                    was so eager to lay his hands on his new-found wealth that he was willing to lie\n                    about himself and promise the moon and more to third parties so that he could\n                    raise the funds needed to unlock the fortune that was awaiting him. The critical\n                    question to ask is whether Jonathan was complicit in Michael’s dishonesty\n                    in promoting the scheme to Teresa. 25     In this regard, Jonathan testified that he had\n                    also been a victim of, rather than an accomplice to, Michael’s schemes. He\n                    deposed in his affidavit of evidence-in-chief (“AEIC”) that even\n                    before the present fraud involving the US$45.8m with First Merchant Bank arose,\n                    he had already lost money in a separate and unrelated investment scheme that\n                    Michael had introduced to him. The scheme apparently involved the raising of\n                    S$100,000 to pay for the release of cash in diplomatic courier boxes located in\n                    London. Jonathan deposed that he, together with his pastor friend Pattamuckil\n                    John Johney (“Pastor John”), invested some money in the scheme\n                    along with some monies belonging to their church (they had convinced their\n                    church council to authorise the investment). However, to date, they had yet to\n                    receive any payment from Michael from that investment. 26     Jonathan further explained that when the\n                    present scheme to retrieve the US$45.8m from First Merchant Bank came up,\n                    Michael had approached Jonathan and Pastor John for more money. However, they\n                    had no more funds to invest and that was when Jonathan suggested that Teresa\n                    might be interested. Jonathan thus introduced Michael to Teresa. Jonathan said\n                    that from then on, the only role he played in the entire scheme was as\n                    Michael’s solicitor. Thus, for the next three years, Jonathan was the\n                    person who corresponded with the fictitious persons and organisations on\n                    Michael’s behalf, and who drafted the various agreements between Michael\n                    and his investors. The only additional investment he made was when he and Teresa\n                    paid Michael US$5,000 and US$10,000 respectively pursuant to the Third\n                    Agreement. 27     Finally, Jonathan also testified (in\n                    re-examination) that he was never paid by Michael for the introduction to Teresa\n                    or for any other assistance he had rendered to Michael. Jonathan explained that\n                    he did not bill Michael for his legal services because there was no prospect of\n                    his being paid and he did not want to be taxed on those unpaid bills had they\n                    been rendered. 28     I find that Jonathan had acted honestly when\n                    he introduced Teresa to Michael and informed her about the latter’s\n                    scheme. As I mentioned earlier (at[22]above), it appeared from the evidence that even Michael himself was unaware that\n                    the entire scheme was a scam. That being the case, Jonathan, who was acting on\n                    Michael’s instructions, would similarly be unaware of the fraud. Although\n                    Michael did behave dishonestly in representing himself as a banker, I did not\n                    think that Jonathan would have known of this as he had no reason to suspect\n                    Michael at the material time. 29     Even if Michael was indeed knowingly complicit\n                    in the entire fraud, the evidence adduced at the trial was nevertheless more\n                    than enough to exonerate Jonathan. There were numerous documents detailing\n                    Jonathan’s correspondence with the faceless individuals who had assumed\n                    the identities of Paul Smith, Peter Bockli, and the other fictitious parties who\n                    were supposedly in control of the US$45.8m belonging to Michael. Those letters\n                    and emails were solely between Jonathan and such other party and showed that\n                    Jonathan had been negotiating and arranging for Michael’s payment of\n                    whatever taxes and fees that were needed for the release of the US$45.8m. Since\n                    all those letters had not been created for the benefit of any other person, the\n                    only possible inference was that Jonathan had truly believed Michael’s\n                    scheme was genuine and was dutifully conveying his client’s instructions\n                    to the fictitious individuals at the other end. 30     Initially, it was difficult to believe that\n                    Jonathan could have acted as Michael’s solicitor throughout without\n                    realising that the entire scheme was a scam. The many letters sent to Michael\n                    and Jonathan by the supposed BIMF and UBS officials were written in an\n                    unprofessional manner in poor English, while the documents they sent\n                    “evidencing” Michael’s ownership of the US$45.8m looked\n                    dubious and amateurish. Moreover, the mere fact that further payments were being\n                    demanded each time without any sight of the promised money should have been\n                    cause for suspicion. Nonetheless, it is a truism that things always look clearer\n                    in hindsight and the evidence clearly showed that Jonathan was taken in by\n                    Michael’s schemes at that time, even after Teresa and the other investors\n                    had been anxiously waiting for their money for months and even years. Since\n                    Jonathan himself had invested some money with Michael, it was more than likely\n                    that he wanted to believe that Michael’s schemes were real and had adopted\n                    an attitude of what can only be described as foolish optimism. 31     Counsel for Teresa (Mr S Gunaseelan)\n                    pointed out that Jonathan had continued to prepare agreements for Michael and\n                    his investors even after January 2004, when he knew that CAD was already\n                    investigating Michael’s affairs. However, Jonathan’s explanation,\n                    which I accept, was that in January 2004, CAD had only asked him to provide them\n                    with documents relating to the US$45.8m account with First Merchant Bank since\n                    he was Michael’s solicitor. He was not given any other information and he\n                    was not privy to CAD’s investigations. It was only when CAD sent its\n                    letter dated 13 July 2006 to Michael (referred to at[17]above), advising him to refrain from\n                    soliciting further loans, that Jonathan ceased to prepare any further agreements\n                    for Michael. 32     Mr Gunaseelan also took issue with\n                    Jonathan’s failure to call Michael as a witness. However, while Michael\n                    would certainly be in a position to shed more light on the relationship between\n                    himself, Teresa and Jonathan, I do not think an adverse inference should be\n                    drawn against Jonathan since the existing evidence was sufficient to show that\n                    Jonathan had acted honestly. I do not believe Michael’s evidence would\n                    have added anything to the facts that were already adduced in court from the\n                    parties and/or from their witnesses. There were no gaps in the testimony that\n                    required Michael’s input to fill. 33     For the above reasons, I am of the view that\n                    Teresa’s claim for fraudulent misrepresentation against Jonathan is\n                    unsustainable. Jonathan may have been a fool to accept without question whatever\n                    Michael said but he was certainly not a knave.",
        "Negligent misrepresentation": "34     The only other issue left to decide is whether\n                    Jonathan is liable to Teresa for negligent misrepresentation. This in turn\n                    depends on whether Jonathan had assumed responsibility to Teresa for whatever\n                    assurances he had given her about Michael’s scheme, and whether Teresa had\n                    relied on such assurances to her detriment in circumstances as to give rise to a\n                    duty of care.",
        "Teresa’s evidence": "35     Teresa deposed in her AEIC that in July 2002,\n                    Jonathan came into her office and told her that he wished to share a secret with\n                    her. He then told her about Michael whom he described as a “very\n                    committed Christian” and a “high-powered senior international\n                    banker”. Jonathan claimed that Michael was managing an international fund\n                    which was making lots of money and wanted to use it to bless fellow Christians.\n                    This was the US$45.8m account with First Merchant Bank. Jonathan then brought up\n                    the problem about the tax which had to be paid to BIMF and said that Michael was\n                    trying to raise money from Christian friends to pay this tax. He also informed\n                    Teresa that he had already recommended her to Michael to join this project and\n                    “be blessed” since he had received many blessings from her in the\n                    past and wanted to return the favour. Jonathan also mentioned that some of the\n                    Christian friends whom Michael had chosen to “bless” were already\n                    in the project with him. 36     Teresa went on to say that she was hesitant to\n                    get involved at the time because she was not a risk-taker by nature. Jonathan,\n                    however, assured her that he had verified that the fund was real because he had\n                    been to London with Michael and Pastor John and met the relevant people. Even\n                    then, she still asked him several times whether the investment was safe, to\n                    which he replied that she could trust him and he would do all the work for her,\n                    including all the due diligence, legal documentation, monitoring and follow-up\n                    work. To give added protection, Jonathan offered to draft an agreement between\n                    Teresa and Michael, and suggested including high percentages of returns as a\n                    reward for Teresa’s participation. Jonathan also suggested adding in a\n                    clause that if Teresa did not receive her money in full by a particular date,\n                    she would be entitled to a penalty payment. 37     Despite all this, Teresa was still hesitant to\n                    commit herself. Jonathan then told her that BIMF had stipulated a timeline for\n                    payment of the tax and if this tax was not paid in time, Michael’s scheme\n                    would fail and the other Christians in the scheme would not be able to receive\n                    their blessings. Teresa thus felt pressured to step in and help Michael and the\n                    other investors. It was on this basis that Jonathan introduced Teresa to\n                    Michael, which led to the conclusion of the First Agreement. Even on\n                    17 July 2002, the day the First Agreement was supposed to be signed, Teresa\n                    still had doubts about the matter. However, Jonathan assured her that\n                    Michael’s scheme was not an investment, but a Christian scheme and\n                    God-sent opportunity for them and other Christians. He told her again to trust\n                    him and reassured her that the transaction was safe. Consequently, Teresa signed\n                    the First Agreement. 38     Throughout the subsequent three tumultuous\n                    years, when Teresa was induced to enter into the Second and Third Agreements and\n                    part with more and more sums of money to Michael, Jonathan kept telling Teresa\n                    to trust him and that she would get her monies back soon. At one point, Jonathan\n                    told her that Michael had a very nice and expensive apartment in Clementi which\n                    he had visited. Thus, even if Michael failed to return Teresa her monies, he\n                    could still sell the apartment and use its proceeds to pay her. 39     There were many other details in\n                    Teresa’s AEIC which need not be repeated here but suffice it to say, the\n                    gist of her testimony was that she had put complete trust and reliance on\n                    Jonathan, who assured her repeatedly that Michael’s scheme was safe and\n                    that he had done the required due diligence. She thus felt cheated and betrayed\n                    by Jonathan when Michael’s entire scheme fell apart. 40     Lastly, Teresa also relied on the evidence of\n                    several investors who subsequently came into Michael’s scheme when he was\n                    raising money to fund the 2% European Union Tax (see[13]above). Those investors testified that they had been\n                    introduced to Michael by mutual Christian friends and had given him various sums\n                    of money in connection with his scheme. They also gave evidence that they had\n                    relied on Jonathan (to differing degrees) in deciding to enter into the\n                    scheme.",
        "Jonathan’s evidence": "41     Jonathan’s evidence was far more concise\n                    and very different. He deposed that he was first introduced to Michael in late\n                    2001 by Pastor John. Pastor John (DW2) testified for Jonathan and said that he\n                    himself became acquainted with Michael earlier that same year through a mutual\n                    friend. Shortly after Michael got to know Jonathan and Pastor John, he\n                    approached both of them with an investment proposal, which was the diplomatic\n                    courier boxes investment referred to earlier (at[25]above). However, the returns on that investment did not\n                    materialise because the British Home Office was apparently asking for a\n                    Certificate of Release and until this was arranged, the funds could not be\n                    released. In 2002, Michael again approached them for help in relation to the\n                    US$45.8m in First Merchant Bank. Michael acknowledged that he still owed\n                    Jonathan and Pastor John the monies from their earlier investment and promised\n                    to repay them. 42     As I noted earlier (at[26]above), Jonathan said that he and Pastor John\n                    had no more money to invest at that time and this was when Jonathan thought\n                    Teresa might be interested in Michael’s scheme. He thus introduced Teresa\n                    to Michael and from then on, the main discussions on the investment took place\n                    between Teresa and Michael directly. It was Michael who showed her the various\n                    documents relating to the existence of the US$45.8m fund and who assured her of\n                    the authenticity of the scheme. As for the legal documentation, it was Teresa\n                    and not Jonathan who dictated the terms of the three Agreements she signed with\n                    Michael. When various hurdles cropped up which required the payment of more\n                    monies, Teresa went to Michael for answers instead of Jonathan. Jonathan further\n                    deposed that his last contact with Teresa prior to this suit was when she met\n                    him and another colleague for lunch (this was at the end of 2005 shortly after\n                    she left Raffles Law Group Practice). The summary of Jonathan’s evidence\n                    therefore was that he was involved in the scheme solely as Michael’s\n                    solicitor and this was a fact known to Teresa. He did not assume any\n                    responsibility towards her and neither did she rely on him in her decision to\n                    invest in the scheme.",
        "The findings": "43     Teresa and Jonathan gave diametrically\n                    opposing versions of events such that if I were to accept one side’s\n                    version, it would naturally mean that the other side had not been truthful.\n                    Having considered the evidence, I am inclined to favour Jonathan’s version\n                    of events over Teresa’s, for a number of reasons which are set out\n                    below. No evidence that Teresa had blamed Jonathan 44     First, there was no evidence that Teresa had\n                    even once blamed Jonathan when the returns on her investment never materialised,\n                    or even when she realised the entire scheme of Michael’s was a complete\n                    scam. On the contrary, the emails produced at trial clearly showed that Teresa\n                    looked only to Michael for her money. For example, there was an email to Michael\n                    dated 4 September 2002 in which Teresa expressed her unhappiness about the delay\n                    in receiving her returns from the Second Agreement, and asked for his\n                    reassurance that he would use his own funds to repay her if the monies from the\n                    US$45.8m did not materialise. The following paragraph from the email is\n                    particularly telling: To arrive at a closure next week, I would like to see your sincerity\n                        towards me and the return of trust (since you have asked\n                            me to trust you so many times... this is one time I am asking\n                        you to return that trust)... [emphasis added] The above paragraph showed that it was Michael, rather than Jonathan,\n                    who had repeatedly asked Teresa to trust in his scheme. 45     There were also two other emails dated 1 and\n                    5 August 2003 in which Teresa again blamed only Michael (in much harsher\n                    tones) for the continued delays in receiving her money. Although she did mention\n                    in the earlier email that Jonathan and Pastor John had a hand in convincing her\n                    to invest her money, her unhappiness was directed only at Michael. Finally, in\n                    an email to Michael dated 9 February 2004, Teresa wrote: Tai Kor [this was how Teresa addressed Michael then], I observe that everybody in your deal gets to know what’s happening,\n                        except me. [Pastor John’s] group is continuously updated by Jonathan,\n                        whereas Philip, John and Johnson are continuously updated by you, and they\n                        would in turn update their investors. As part of your professionalism and ethics, you should inform me\n                        continuously too as I am a large investor, and you should do itautomaticallyinstead of waiting for me to ask.\n                        ... [emphasis in original] 46     All the above emails strongly suggested that\n                    it was Michael, not Jonathan, in whom Teresa placed her trust and who Teresa\n                    expected would update her with news of her investment. Teresa did not produce a\n                    single email or letter to Jonathan in which she sought to blame him for her\n                    predicament, despite her assertions that she had relied on him completely to\n                    look out for her interests. Although Teresa mentioned in cross-examination that\n                    she did write a few angry emails to Jonathan accusing him of putting her in the\n                    current mess, she was unable to produce any of those at trial with the excuse\n                    that she was unable to locate them. I did not believe her explanation as she had\n                    no trouble producing emails she wrote to Michael between 2002 and\n                2004. 47     Teresa also testified that it was around 2004\n                    to 2005 that she concluded that she had been the victim of a fraud perpetrated\n                    by Michael and Jonathan. This was when she was still with Raffles Law Group\n                    Practice. Despite this, after she left the group, she was still able to have\n                    lunch with Jonathan and one Mok Ching Tee who was the leader of the group. When\n                    Teresa was cross-examined on this, she claimed that the purpose of that lunch\n                    was to return her office keys to Mok. She also denied inviting Jonathan to the\n                    lunch, but had simply told Mok that he could bring Jonathan along if he so\n                    wished. I found her explanation to be unconvincing because if she was indeed\n                    angry with Jonathan, she would not even have brought his name up in the first\n                    place let alone lunch with him. It was also not disputed that Teresa did not say\n                    anything to Jonathan at the lunch which would suggest that she blamed him for\n                    being cheated. 48     On the evidence, it is to be noted that the\n                    first time Teresa actually pointed the finger at Jonathan was when she wrote to\n                    CAD on 15 April 2008 accusing Michael and Jonathan of drawing her into the\n                    scam with false assurances. I gave little weight to her self-serving letter\n                    because it was obvious that by then Teresa was about to sue\n                Jonathan. Evidence that showed Teresa was in control and dictated the terms of\n                her various agreements with Michael 49     I also did not believe Teresa’s story\n                    that it was Jonathan who had included the attractive terms in the three\n                    agreements to entice her to invest in Michael’s scheme. Jonathan produced\n                    a note in Teresa’s own handwriting in which she had written out several\n                    terms which were eventually incorporated into the Second Agreement.\n                    Teresa’s explanation in her AEIC was that Jonathan had suggested those\n                    terms for her to scribble down, and she later gave those notes to him for\n                    reference when he prepared her agreements with Michael. I found Teresa’s\n                    explanation unconvincing. The simpler and more probable explanation was that\n                    those terms were dictated by Teresa herself and she scribbled the note to\n                    Jonathan because she knew he was Michael’s solicitor. 50     A more damning piece of evidence was to be\n                    found in a letter from Jonathan to Teresa dated 12 August 2002. In the\n                    letter, Jonathan wrote: Hi Teresa SECOND INVESTMENT AGREEMENT Enclosed is a Draft Agreement as requested. Please note the following: 1.    I have spoken to\n                            Michael Ng about the broad principles, i.e. that you want 150% return on\n                            your 2ndInvestment and he has agreed.\n                            However, please note that with regard to the\n                                1stInvestment of SGD150,000.00, he is\n                            offering to pay you 5% on SGD300,000.00 on late\n                            payment. 2.    I havenotspoken to Michael about the\n                            following: (i)    S$5,000.00 per day for late payment on the\n                                    2ndInvestment; (ii)   Regarding his consent to enter into judgment\n                                for the sale of his flat (on second thoughts, it sounds a bit too\n                                harsh), perhaps you may want to waive this in good\n                            faith. [emphasis in original] 51     It was clearly evident from the above letter\n                    that Teresa was the person dictating the terms of the agreements she signed with\n                    Michael, contrary to her assertion that Jonathan had voluntarily offered to\n                    include those terms “as a reward” for her participation. Teresa\n                    subsequently gave another handwritten note dated 15 August 2002 to Jonathan\n                    in which she stipulated the various modes of payment to her when the monies from\n                    her investment came in. 52     Even more telling was the fact that, Teresa\n                    personally entered into three further investment agreements with Michael (of\n                    which Jonathan was unaware until the commencement of these proceedings) after\n                    she had already signed the three agreements with Michael. Teresa claimed in her\n                    AEIC that Michael had needed to borrow money urgently on those occasions and\n                    that he had suggested that she draw up an agreement using the format of the\n                    agreements Jonathan usually drafted. This explanation was not credible and could\n                    not conceal the fact that even after the three agreements, when Teresa’s\n                    monies were not forthcoming, she was still willing to invest more money with\n                    Michael and continued to dictate the terms of her investments. Although Jonathan\n                    was not involved in those later investment agreements, Teresa nevertheless\n                    claimed damages from him under those transactions. 53     In the light of such evidence, I find that\n                    Teresa was untruthful when she said that she only entered into Michael’s\n                    scheme because she felt pressured by Jonathan to help Michael and his other\n                    investors receive their “Christian blessings”. She saw\n                    Michael’s scheme as an attractive investment, she knew what she wanted\n                    therefrom and she was clearly in control at all times. Teresa was not a babe in\n                    the woods who relied heavily on Jonathan to protect her interests. Evidence from Teresa’s other witnesses. 54     As noted earlier (at[40]above), Teresa called several witnesses who had invested in\n                    Michael’s scheme after September 2003, to testify that they had relied on\n                    Jonathan. I gave no weight to their evidence because it was irrelevant. The\n                    factual issue for this court to determine was whether Jonathan had assumed\n                    responsibility towards Teresa and whether Teresa had in turn relied on Jonathan\n                    to protect her interests. As such, it did not matter whether Michael’s\n                    other investors had relied on Jonathan as they only came into the picture well\n                    after Teresa had agreed to participate in the scheme. 55     In any event I also found that those witnesses\n                    were, for the most part, unreliable. It bears noting that the only person\n                    Jonathan had introduced into Michael’s scheme was Teresa. In fact,\n                    Jonathan had never met any of the other investors prior to their investing in\n                    Michael’s scheme. Despite this, many of the investors gave evidence that\n                    they felt at ease and confident of the scheme upon meeting Jonathan simply\n                    because of his status as a lawyer and church leader, and the fact that he\n                    practiced at an “impressive office”. This was a blatant attempt on\n                    their part to support Teresa’s case. It was also not lost on this court\n                    that despite their purported reliance on Jonathan, none of the witnesses have\n                    sued Jonathan for the losses they suffered in participating in Michael’s\n                    scheme. 56     A number of the witnesses went further and\n                    alleged that Jonathan had assured them he had been to London with Michael and\n                    personally verified the existence of the US$45.8m fund. This was categorically\n                    denied by Jonathan, who said that the only time he had been to London with\n                    Michael was in 2001 along with Pastor John, which trip related to their\n                    investment with the diplomatic courier boxes and had nothing to do with the\n                    US$45.8m in First Merchant Bank. I accept Jonathan’s evidence and find\n                    that the witnesses were untruthful. Other factual inconsistencies 57     There were many other factual inconsistencies\n                    in Teresa’s evidence which cast doubts on her veracity. She mentioned in\n                    her AEIC that sometime in 2003, Michael had told her that he had quarrelled with\n                    Jonathan because Jonathan had apparently demanded US$1m each for himself and\n                    Pastor John as a fee for introducing Teresa to his scheme. I found this story to\n                    be incredible because Teresa’s total investment did not even reach US$1m.\n                    It was also not explained in any event why Teresa did not confront Jonathan or\n                    at least seek an explanation from him on Michael’s\n                allegation. 58     Teresa’s story that Jonathan was\n                    promoting Michael’s scheme as a means to bless fellow Christians from the\n                    start also made little sense because it seemed from the evidence that she was\n                    the only investor at the time when Michael was raising money to pay the BIMF\n                    tax. It was only much later, when the Nigerian government purportedly\n                    transferred the US$45.8m to UBS and Michael started raising money for the 2%\n                    European Union Tax, that there were records of other investors getting\n                    involved. 59     Teresa also mentioned in her AEIC that she had\n                    lodged a caveat over Michael’s HDB flat in March 2003 to protect her\n                    interests. Aside from evidencing that Teresa was capable of looking after her\n                    own interests, this fact contradicted her earlier evidence that Jonathan told\n                    her that Michael had an “expensive apartment” which he could sell\n                    to pay her back if the investment failed. Demeanour of the witnesses at trial 60     I formed the view that Jonathan was a far more\n                    credible witness from observing his demeanour at trial. Jonathan answered\n                    questions in a forthright manner and was candid in cross-examination, even\n                    admitting to the court when he was questioned, that it did not occur to him from\n                    the contents and the letterhead, that a letter dated 15 July 2002 Michael\n                    received from a firm called Michael Baileys & Co (who were purportedly the\n                    English solicitors for First Merchant Bank) could not have been genuine. The\n                    court had pointed out to Jonathan that English solicitors would sign their\n                    letters and it was not usual to stamp the firm’s name with a date and\n                    leave the letter unsigned. The letterhead also appeared suspicious as it looked\n                    like it had been generated by a computer together with the address which was\n                    appended at the bottom of the letter. Moreover, a firm of English solicitors was\n                    unlikely to make such mistakes as writing “$480,000. Us Dollars”\n                    with the letter ‘s’ in lower case. Jonathan revealed that he was not\n                    familiar with UK solicitors. The court also drew to Jonathan’s attention\n                    that the letter purportedly sent by Dr Paul Smith of the British\n                    International Monitory Fund Tax Office Department dated 15 July 2002 could\n                    not possibly have been genuine because of the misspelling of the word\n                    “monetary” not to mention it was also chopped with a rubber stamp.\n                    Again, Jonathan admitted that it did not strike him as unusual that a person\n                    would sign and put a rubber stamp on the letter. Neither did Jonathan suspect\n                    that the word ‘monitory’ should actually be\n                    ‘monetary’. 61     I should point out that Jonathan was called to\n                    the local Bar in 1998 and his field of practice was in bread-and-butter areas\n                    such as family law and debt collection. Consequently, Jonathan had no experience\n                    of and would not be familiar with non-Singapore law firms or with international\n                    bodies and organisations let alone international financial institutions. He was\n                    certainly naïve but he was not dishonest. 62     Teresa’s demeanour, on the other hand,\n                    was far too dramatic and gave the impression that she was putting on an act for\n                    the court’s benefit. While she initially seemed genuinely aggrieved at\n                    Jonathan for his role in the scam, she ultimately seemed too eager to answer\n                    counsel’s questions at times to the point where she volunteered many\n                    unnecessary details. Teresa’s oral testimony was also reflective of her\n                    AEIC; it was embellished to the extent that it no longer sounded believable.\n                    Teresa might have said a lot more than Jonathan but ultimately she left too many\n                    important questions unanswered. Teresa’s email of 17 February 2004 63     I pause here to deal with one of the few\n                    documents that actually supported Teresa’s case. In her email dated\n                    17 February 2004 to one Johnson Wong (who was her witness), Teresa\n                    wrote: Actually, until I got involved with Michael’s deal, life was a\n                        breeze for me. No worries except for the passion of practising law to help\n                        people get the justice they want. Then came Michael’s deal. I got\n                        involved merely out of the good heartedness of mine to help release the\n                        funds of those who had already sunk all they had in it, and had been\n                        awaiting desperately for a long time. I was thus convinced by Jonathan and\n                        [Pastor John] to get involved to help. I trusted them cos [sic] I thought I was dealing with Christians,\n                        pastors, and church money and since they needed help and it was supposed to\n                        be for a short period only (one month was what Michael and gang told me!!!),\n                        that I lent them all I got [sic] !!! Never\n                        realize [sic] how foolish it was of me to\n                        trust people so much. Then when I got into trouble with UOB, Michael kept\n                        telling me not to worry ...he would do something to help me. That promise\n                        went by for one and a half years!!! And he never delivered. That’s why\n                        I am so cross with him. He broke my trust over and over again, until now I\n                        worry whether the deal is a scam or not. 64     Although Teresa’s email did give some\n                    credence to her story that she got involved with Michael’s scheme at\n                    Jonathan’s persuasion and without any intention of profit, this alone was\n                    not enough to tip the scales to her side given the other overwhelming evidence\n                    in favour of Jonathan. It was possible that by the time she wrote this email,\n                    she was having doubts about the entire scheme but still refused to accept,\n                    emotionally, that she might have been fooled by the prospect of a quick profit.\n                    She may have wanted to help Michael, Jonathan and Pastor John along the way but\n                    this was certainly not the only or even the primary reason for her agreeing to\n                    participate in the scheme. It is also noteworthy that even in this email, Teresa\n                    was blaming only Michael and not Jonathan for breaking her trust. 65     I have no doubt that Jonathan and Pastor John\n                    did playsomepart in convincing Teresa to\n                    participate in Michael’s scheme as this was borne out by some of the\n                    emails Teresa wrote. I also note that both of them had a vested interest in\n                    convincing Teresa to invest her monies because if Michael was able to retrieve\n                    the US$45.8m from First Merchant Bank, he would then be able to pay them the\n                    returns from their previous investment with the diplomatic courier boxes.\n                    Nevertheless, in the light of the other factors I have highlighted above, I find\n                    that Jonathan had neither given any assurance to Teresa that he would look out\n                    for her interests, nor did he assume any responsibility for whatever he told her\n                    about Michael’s scheme. I also find that Teresa in any event did not rely\n                    on Jonathan. She well knew that Jonathan was acting only as Michael’s\n                    solicitor and she placed her trust in Michael alone. Consequently, there was no\n                    duty of care owed by Jonathan to Teresa. He is therefore not liable to her for\n                    any negligent statements he might have made.",
        "Conclusion": "66     The fraud in issue was a very unfortunate\n                    episode for all the people who were involved in Michael’s scheme and is a\n                    stark reminder of the adage that if a deal looks too good to be true, it\n                    probably is. While the court is not unsympathetic to Teresa for the losses she\n                    has suffered, it was clearly disingenuous of her to attempt to blame those\n                    losses on Jonathan. It was unfair of Teresa to repeatedly accuse Jonathan in\n                    cross-examination of being a liar when the objective evidence showed\n                    otherwise. 67     For the reasons given earlier, I dismiss\n                    Teresa’s claim against Jonathan with costs on a standard basis to be taxed\n                    unless otherwise agreed."
    }
}