{
    "case_title": "Guy Neale and others (suing as a partnership)\n      v\n      Ku De Ta SG Pte Ltd",
    "ncitation": "[2011] SGHC 136",
    "coram": "Chew Yi-Ling Elaine AR",
    "sections": {
        "Introduction": "1       In this application, the defendant sought to\n                    strike out portions of the plaintiffs’ Statement of Claim filed on 29\n                    December 2010.",
        "Facts": "2       The plaintiffs are a partnership operating a\n                    restaurant and bar in Bali known as “Ku De Ta”. The third\n                    plaintiff registered the trade mark “KU DE TA” in Indonesia in\n                    2000 and holds proprietorship of that mark on behalf of the\n                partnership. 3       The defendant is a company incorporated in\n                    Singapore. In 2010, it opened a restaurant and bar at Marina Bay Sands that was\n                    also styled “Ku De Ta”. In the course of its business, the\n                    defendant used two trade marks incorporating the words “Ku de Ta”.\n                    These trade marks (“the Nine Square Registered Marks”) were\n                    registered in Singapore in 2004 and 2009 respectively by an Australian company,\n                    Nine Squares Pty Ltd (“Nine Squares”). In 2009, the Nine Square\n                    Registered Marks were licensed to Chris Au, who was the Chief Executive Officer\n                    of the defendant. In turn, Chris Au assigned his rights under the license to the\n                    defendant. 4       When the plaintiffs came to know of the\n                    restaurant and bar in Singapore, they took out an action against the defendant,\n                    seeking,inter alia, an order that the\n                    defendant: immediately ceases and be restrained from the use of the name/ mark\n                        “Ku De Ta” or any name / mark similar\n                            thereto…[note: 1] 5       One of the causes of action pleaded in the\n                    Statement of Claim was founded on s 55 of the Trade Marks Act (Cap 322, 2005 Rev\n                    Ed) (“TMA”): Protection of well known trade marks 55. —(1) A well known trade\n                        mark shall be entitled to protection under this section — (a) whether or not the trade mark has been registered in\n                        Singapore, or an application for the registration of the trade mark has\n                        been made to the Registrar; and (b) whether or not the proprietor of the trade mark carries on\n                        business, or has any goodwill, in Singapore. The plaintiffs alleged that the defendant had infringed their rights\n                    as owners of a well known mark protected under this provision. 6       In the Statement of Claim, the plaintiffs set\n                    out that: 32.The name / mark “Ku de Ta” is a well\n                            known trade mark protected under Section 55 of the Trade Marks Act (Cap.\n                            322) (“theAct”), of which\n                            the Ku de Ta Partnership is the proprietor. Paragraphs 6 to 9 and\n                            paragraphs 11 herein are repeated. 33.However, the Defendant has, without the Ku de Ta\n                            Partnership’s consent, used the said trade mark “Ku de\n                            Ta”, of which the Ku de Ta Partnership is the proprietor, in\n                            respect of identical or similar services to the Ku de Ta Partnership.\n                            Paragraphs 19 to 26 herein are repeated. 34.The Defendant’s use of the said trade mark\n                            “Ku de Ta” has caused and/or is likely to cause confusion\n                            to the public and/or would indicate a connection between the goods or\n                            services of the Defendant and the Ku de Ta Partnership. Particulars (a)Ku de Ta Bali and the MBS Restaurant and Club\n                                are both restaurants / bars / clubs. The use of the name “Ku\n                                de Ta” in the name of the MBS Restaurant and Club is\n                                therefore likely to cause confusion on the part of the public by\n                                leading them to believe that the MBS Restaurant and Club is\n                                associated with and/or connected to Ku de Ta Bali. (b)Ku de Ta Bali is the primary business of the\n                                Ku de Ta Partnership. Similarly, the MBS Restaurant and Club is the\n                                primary business of the Defendant. Accordingly, the use of the name\n                                “Ku de Ta” in the corporate name of the Defendant and\n                                in the name of the Defendant’s website at www.kudeta.com.sg is\n                                therefore likely to cause confusion on the part of the public by\n                                leading them to believe that the Defendant is associated with and/or\n                                connected to the Ku de Ta Partnership. (c)The MBS Restaurant and Club has been described\n                                in various magazines, newspapers, websites and other publications in\n                                Singapore and internationally as being associated with and/or\n                                connected to the Ku de Ta Partnership. 35.The Defendant’s use of the said trade mark\n                            “Ku de Ta” would cause dilution in an unfair manner of the\n                            distinctive character of the trade mark “Ku de Ta”, of\n                            which the Ku de Ta Partnership is the proprietor and/or would constitute\n                            the Defendant taking unfair advantage of the distinctive character of\n                            the trade mark “Ku de Ta”, of which the Ku de Ta\n                            Partnership is the proprietor. Particulars (a)The Defendant and the Ku de Ta Partnership are\n                                both in the restaurant, bar and club business. (b)Through the Defendant’s continued use of\n                                the name “Ku de Ta” in its corporate name and in the\n                                course of operating and/or promoting its restaurant, bar, lounge and\n                                club businesses, including but not limited to the MBS Restaurant and\n                                Club, there is a likelihood that the name / mark “Ku de\n                                Ta”, instead of being indicative of Ku de Ta Bali and/or the\n                                Ku de Ta Partnership’s other products and/or services only,\n                                may become indicative of the MBS Restaurant and Club and the\n                                Defendant’s other products and/or services as\n                            well. [emphasis in original] 7       The defendant took out the present application\n                    under O 18 r 19(1)(a) of the Rules of Court (Cap\n                    322, R 5, 2006 Rev Ed), seeking to strike out paragraphs 32 – 35 of the\n                    Statement of Claim (set out above at[6]), on\n                    the basis that those paragraphs disclosed no reasonable cause of\n                action.",
        "The defendant’s case": "8       The protection given to well known trade marks\n                    under s 55 is limited by s 55A of the TMA. Relying on s 55A(2), the defendant\n                    submitted that the paragraphs it sought to strike out, which essentially\n                    contained the plaintiffs’ cause of action based on s 55 of the TMA,\n                    disclosed no reasonable cause of action: Permitted use of well known trade\n                        marks 55A. — … (2) Notwithstanding section 55, the proprietor of a well known\n                        trade mark shall not be entitled to restrain by injunction the use in\n                        Singapore of any registered trade mark in relation to goods or services\n                        for which the latter is registered. In essence, the defendant’s submission was that the Nine Squares\n                    Registered Marks were registered in Singapore. It was a licensed user of those\n                    trade marks. It could therefore avail itself of the s 55A(2) defence. This\n                    provided a complete answer to the plaintiffs’ claim under s 55 of the TMA\n                    such that paras 32 – 35 of the Statement of Claim could disclose no valid\n                    cause of action. Accordingly, those portions of the pleading should be struck\n                    out.",
        "The plaintiffs’ case": "9       The plaintiff, by contrast, submitted that s\n                    55A(2) did not provide an absolute defence to a claim under s 55 of the TMA. The\n                    defence would not apply where the registered trade marks were liable to be\n                    invalidated. In addition to the Suit brought in the High Court against the\n                    defendant, the plaintiffs were seeking the invalidation of the Nine Squares\n                    Registered Marks against Nine Squares. The ability of the defendant to raise the\n                    s 55A(2) defence was contingent on the plaintiffs failing in their invalidation\n                    application, which had yet to be determined. As such, the high threshold for a\n                    striking out application was not met, given that triable issues of law and fact\n                    were present.",
        "My decision": "10     Having heard the submissions of counsel, I\n                    dismissed the application. I now give my reasons. 11     It is trite law that it is only in plain and\n                    obvious cases that recourse should be had to the summary process under O 18 r\n                    19. As set out inSingapore Civil Proceedure 2007(G P Selvam ed) (Sweet & Maxwell, 2007) at para 18/19/10 (“Singapore Civil Procedure”): So long as the statement of claim or the particulars (Davey v. Bentinck[1893] 1 Q.B. 185) disclose some cause of\n                        action, or raise some question fit to be decided by a judge, the mere fact\n                        that the case is weak, and not likely to succeed, is no ground for striking\n                        it out…",
        "Whether s 55A(2) constitutes a complete answer to the\n                plaintiffs’ claim under s 55A(2) of the TMA such that no valid cause of action\n                can be made out": "12     On a perusal of the parliamentary debates (seeSingapore Parliamentary Debates, Official\n                        Report(16 June 2004) vol 78 at col 108 (Professor S Jayakumar,\n                    Minister for Law)), it was discernible that ss 55 and 55A were enacted for the\n                    purpose of: (a)giving protection for well known\n                        marks;(b)implementing the United-States Singapore Free\n                            Trade Agreement (“USSFTA”); and(c)implementing the Joint Recommendation Concerning\n                            Provisions on the Protection of Well Known Marks (1999) (“Joint\n                            Recommendation”), which is an international standard adopted by\n                            the Assembly of the Paris Union for the Protection of Industrial\n                            Property and the General Assembly of the World Intellectual Property\n                            Organisation on the level of protection for well-known\n                        marks.The explanatory statement to the Trade Mark (Amendment) Bill (No.\n                    18/2004) was also particularly illuminating. It disclosed that cl 26, which\n                    deleted the then-existing s 55 and replaced it with the present day\n                    provisions:(a)    repeals and re-enacts section 55 to give effect to\n                            Article 16.1.2 (b)(i) of the USSFTA read\n                            with Articles 4 and 5 of the Joint Recommendation; and(b)    introduces a new section 55A to set out the\n                            permitted uses of well known trade marks for consistency with the\n                            permitted uses of registered trade marks under section 28.13     Pursuant to Article 3 of the Joint\n                    Recommendation, member states are required to protect a well-known mark against\n                    conflicting marks, business and domain names, at least with effect from the time\n                    when the mark has become well known in the member state. When a mark is deemed\n                    to be in conflict with a well-known mark in respect of identical or similar\n                    goods and/or services, member states are obliged to provide certain remedies.\n                    Article 4(2) provides that if the member state’s laws allow third parties\n                    to oppose the registration of a mark, a conflict with a well-known shall\n                    constitute a ground for opposition. Article 4(3) provides that even after\n                    registration, the owner of a well-known mark shall be entitled to request that\n                    the conflicting mark be invalidated. Significantly, Article 4(4) provides that\n                    the owner of the well-known mark shall be entitled to request the prohibition of\n                    the conflicting mark:(4) [Prohibition of Use] The owner of a\n                        well-known mark shall be entitled to request the prohibition, by a decision\n                        of the competent authority, of the use of a mark which is in conflict with\n                        the well-known mark. Such request shall be admissible for a period which\n                        shall not be less than five years beginning from the time the owner of the\n                        well-known mark had knowledge of the use of the conflicting mark. [emphasis\n                        and brackets in original](see also para 4.11 of the Explanatory Notes to the Joint\n                    Recommendation). Member states are clearly obliged to provide the Article 4(4)\n                    remedyin additionto the remedies of commencing\n                    opposition or invalidation procedures provided in Article 4(2) and\n                (3).14     If the defendant’s literal\n                    interpretation of ss 55 and 55A(2) of the TMA were adopted, the owner of a\n                    well-known mark would not be entitled to request the prohibition of the use of a\n                    conflicting mark so long as the latter is a registered trade mark. This would\n                    render Article 4(4) of the Joint Recommendation otiose, instead of giving effect\n                    to it was ss 55 and 55A of the TMA were meant to. Arguably, therefore, s 55A(2)\n                    could not be said to provide a complete answer to a claim under s 55 of the\n                    TMA.15     The interpretation that s 55A(2) is not an\n                    unassailable defence was also buttressed by the consideration that s 55A was\n                    meant to render the permitted uses of well known trade marks consistent with the\n                    permitted uses of registered trade marks under s 28 of the TMA, which\n                    provides:Acts not amounting to infringement28.…(3)    Notwithstanding section 27, a registered trade\n                            mark is not infringed by the use of another registered trade mark in\n                            relation to goods or services for which the latter is\n                        registered.16     As set out in Tan Tee Jee, S.C.,Law of Trade Marks and Passing Off in Singapore(Sweet\n                    & Maxwell, 2nd Ed, 2005) at 263 – 264, the defence in s 28(3) is not a\n                    complete defence if the allegedly offending mark is not validly\n                    registered:Use of a registered trade mark[11.26]    This defence in section 28(3) provides that a\n                            registered trade mark is not infringed by the use of another registered\n                            trade mark in relation to goods or services for which the latter mark is\n                            registered. This means that the proprietor of the other registered mark\n                            can continue to use his mark without infringing the registered trade\n                            mark, provided the use is in relation to goods or services for which his\n                            mark is registered. If the use is in relation to goods or services which\n                            are merelysimilarto those for which the\n                            mark is registered, the defence may not apply.…[11.28]Also, the defence applies\n                                only if the latter mark isvalidlyregistered. In section 23(8) of the 1998\n                            [TMA], it is stated that where the registration of a trade mark is\n                            declared invalid to any extent, the registration shall to that extent be\n                            deemed never to have been made. Similarly, in section 22(8) [of the\n                            TMA], it is provided that where the registration of a trade mark is\n                            revoked to any extent, the rights of the proprietor shall be deemed to\n                            have ceased to that extent as from the date of the application for\n                            revocation or, if the Registrar or the court is satisfied that the\n                            grounds for revocation existed at an earlier date, from that\n                            date.[emphasis in italics in original; emphasis in bold added]This is also the position taken in the UK, where s 11(1) of the Trade\n                    Marks Act 1994 (c. 26) isin pari materiato our\n                    local provision (seeKerly’s Law of Trade Marks and\n                        Trade Names(Sweet & Maxwell, 14th Ed, 2005) at para\n                    14-147). If s 55A(2) is to mirror the scope and application of s 28(3), it\n                    similarly ought not to provide a complete defence where the trade mark\n                    complained of was not validly registered.17     The defendant had suggested that procedurally,\n                    it was premature to bring a cause of action based on s 55 of the TMA before\n                    invalidation proceedings were commenced. It submitted that the proper course, so\n                    as to reconcile ss 55 and 55A(2), was for the registered trade mark to be\n                    properly invalidated before restraining orders were sought. This, purportedly,\n                    would strike the correct balance between the rights of the owner of the\n                    registered trade mark and the rights of the owner of the well known mark. I did\n                    not agree. First, the prolonged use of an invalidly registered trade mark could\n                    result in substantial dilution of the goodwill accruing to the well known mark,\n                    which is a form of damage not easily compensable in monetary terms. While the\n                    owner of the registered trade mark could arguably state similar concerns, s\n                    55(7) of the TMA places the onus on the owner of the well known mark to take\n                    timely action as he loses his entitlement to seek certain remedies if he\n                    acquiesces for a continued period of 5 years in the use of the allegedly\n                    offending registered traade mark. This would limit the damage likely to be\n                    suffered by the owner of the registered trade mark whereas the converse is not\n                    true for the owner of the well known mark who would therefore be inadequately\n                    protected. Second, as already mentioned above (at[12]), one of the purposes of enacting ss 55 and 55A of the TMA\n                    was to give effect to the Joint Recommendation. Paragraph 4.8 of the Explanatory\n                    Notes to the Joint Recommendation suggests that owners of well known marks were\n                    intended to be given early opportunities to take action against conflicting\n                    registered trade marks. Adopting the defendant’s interpretation of the\n                    statutory provision of the TMA would not give effect to this\n                intention.18     Given the above, it was by no means plain and\n                    obvious that paras 32 – 35 of the Statement of Claim could disclose no\n                    valid cause of action based on a statutory interpretation of ss 55 and 55A of\n                    the TMA. At the minimum, the pleadings in the Statement of Claim raised a\n                    triable issue of law.Whether no valid cause of action could be made out when only the\n                allegations in the pleading are considered19     The third plaintiff took out invalidation\n                    proceedings at the Trade Mark Registry against the Nine Squares Registered Marks\n                    in July 2010. On 14 January 2011, he made an application to refer the\n                    invalidation proceedings to the High Court. This was denied by the Trade Mark\n                    Registry on 19 January 2011. The third plaintiff subsequently withdrew his\n                    application to the Trade Mark Registry and instead filed Originating Summons 198\n                    of 2010 in the High Court to invalidate the Nine Squares Registered Marks. The\n                    fact of the invalidation proceedings in the High Court was relied upon in the\n                    plaintiffs’ submission that paras 32 – 35 of the Statement of Claim\n                    should not be struck out.20     In response, the defendant submitted that the\n                    commencement of invalidation proceedings by way of a separate Originating\n                    Summons was irrelevant to the question of whether or not the plaintiffs had a\n                    valid cause of action in the present Suit. This was because the invalidation was\n                    not sought in the pleadings in the present Suit but in separate proceedings\n                    against another separate party. In the Statement of Claim, only the fact of the\n                    invalidation proceedings taken out with the Trade Marks Registry was\n                        pleaded.[note: 2]Since the application to the Trade\n                    Marks Registry had been withdrawn, there was nothing in the Statement of Claim\n                    to show that the Nine Squares Registered Marks were invalid or could be\n                    invalidated even if all the pleadings in the Statement of Claim were proven.\n                    Accordingly, the s 55A(2) defence applied as a complete defence such that no\n                    valid cause of action could be made out against the defendant. The defendant\n                    relied on the rule that a reasonable cause of action is a cause of action which\n                    has some chance of successwhen only the allegations in the\n                        pleadings are considered(seeGabriel Peter\n                        & Partners (suing as a firm) v Wee Chong Jin and\n                    others[1997] 3 SLR(R) 649 at [21]).21     In my view, it was not plain and obvious that\n                    no valid cause of action could be made out even when only the allegations in the\n                    Statement of Claim were considered. On the contrary, the plaintiffs had set out\n                    clearly in their pleadings that “Nine Squares had no right to apply for\n                    the registration of or to register the name / mark “Ku de Ta” in\n                    the Singapore Registry of Trade Marks”.[note: 3]It has also clearly\n                    expressed its intention to seek the invalidation of the Nine Squares Registered\n                        Marks.[note: 4]These facts, if proven, would be sufficient to found a valid cause of action\n                    against the defendant. The means by which the Nine Squares Registered Marks\n                    would be invalidated was a matter of evidence and not fact that need not be set\n                    out in the Statement of Claim. Putting the defendant’s case at the\n                    highest, the plaintiffs’ Statement of Claim lacked sufficient\n                    particularity. However, where a pleading is defective only in not containing\n                    particulars to which the other side is entitled, application should only be made\n                    for particulars under O 18 r 12, and not for an order to strike out the pleading\n                    under O 18 r 19 (Singapore Civil Procedureat para\n                    18/19/11).Conclusion22     In light of the above, I dismissed the\n                    defendant’s application with costs to the plaintiffs.[note: 1]Statement of Claim at\n                                23.[note: 2]Statement of Claim at paras 18, and 27 –\n                                29.[note: 3]Statement of\n                                Claim at para 17.[note: 4]Statement of Claim at para 18",
        "Whether no valid cause of action could be made out when only the\n                allegations in the pleading are considered": "19     The third plaintiff took out invalidation\n                    proceedings at the Trade Mark Registry against the Nine Squares Registered Marks\n                    in July 2010. On 14 January 2011, he made an application to refer the\n                    invalidation proceedings to the High Court. This was denied by the Trade Mark\n                    Registry on 19 January 2011. The third plaintiff subsequently withdrew his\n                    application to the Trade Mark Registry and instead filed Originating Summons 198\n                    of 2010 in the High Court to invalidate the Nine Squares Registered Marks. The\n                    fact of the invalidation proceedings in the High Court was relied upon in the\n                    plaintiffs’ submission that paras 32 – 35 of the Statement of Claim\n                    should not be struck out. 20     In response, the defendant submitted that the\n                    commencement of invalidation proceedings by way of a separate Originating\n                    Summons was irrelevant to the question of whether or not the plaintiffs had a\n                    valid cause of action in the present Suit. This was because the invalidation was\n                    not sought in the pleadings in the present Suit but in separate proceedings\n                    against another separate party. In the Statement of Claim, only the fact of the\n                    invalidation proceedings taken out with the Trade Marks Registry was\n                        pleaded.[note: 2]Since the application to the Trade\n                    Marks Registry had been withdrawn, there was nothing in the Statement of Claim\n                    to show that the Nine Squares Registered Marks were invalid or could be\n                    invalidated even if all the pleadings in the Statement of Claim were proven.\n                    Accordingly, the s 55A(2) defence applied as a complete defence such that no\n                    valid cause of action could be made out against the defendant. The defendant\n                    relied on the rule that a reasonable cause of action is a cause of action which\n                    has some chance of successwhen only the allegations in the\n                        pleadings are considered(seeGabriel Peter\n                        & Partners (suing as a firm) v Wee Chong Jin and\n                    others[1997] 3 SLR(R) 649 at [21]). 21     In my view, it was not plain and obvious that\n                    no valid cause of action could be made out even when only the allegations in the\n                    Statement of Claim were considered. On the contrary, the plaintiffs had set out\n                    clearly in their pleadings that “Nine Squares had no right to apply for\n                    the registration of or to register the name / mark “Ku de Ta” in\n                    the Singapore Registry of Trade Marks”.[note: 3]It has also clearly\n                    expressed its intention to seek the invalidation of the Nine Squares Registered\n                        Marks.[note: 4]These facts, if proven, would be sufficient to found a valid cause of action\n                    against the defendant. The means by which the Nine Squares Registered Marks\n                    would be invalidated was a matter of evidence and not fact that need not be set\n                    out in the Statement of Claim. Putting the defendant’s case at the\n                    highest, the plaintiffs’ Statement of Claim lacked sufficient\n                    particularity. However, where a pleading is defective only in not containing\n                    particulars to which the other side is entitled, application should only be made\n                    for particulars under O 18 r 12, and not for an order to strike out the pleading\n                    under O 18 r 19 (Singapore Civil Procedureat para\n                    18/19/11).",
        "Conclusion": "22     In light of the above, I dismissed the\n                    defendant’s application with costs to the plaintiffs.  [note: 1]Statement of Claim at\n                                23. [note: 2]Statement of Claim at paras 18, and 27 –\n                                29. [note: 3]Statement of\n                                Claim at para 17. [note: 4]Statement of Claim at para 18"
    }
}