{
    "case_title": "Jayasekara Arachchilage Hemantha Neranjan Gamini and\n                another\n      v\n      Public Prosecutor",
    "ncitation": "[2011] SGHC 54",
    "coram": "Steven Chong J",
    "sections": {
        "Introduction": "1       The mostfundamentalfeature of our criminal jurisprudence is the time\n                    honoured principle which mandates that the Prosecution bears the burden to prove\n                    the charge against the accused beyond reasonable doubt. Short of statutory\n                    presumptions enacted by Parliament for specific offences, there can be no doubt\n                    that this principle must be applied strictly. As aptly observed by VK\n                    Rajah J (as he then was) inJagatheesan s/o Krishnasamy\n                        v Public Prosecutor[2006] 4 SLR(R) 45\n                        (“Jagatheesan”), a trial judge\n                    must always bear in mind that the starting point of the analysis of any criminal\n                    case is not neutral. An accused is presumed innocent and this presumption is not\n                    displaced until the Prosecution has discharged its burden of\n                proof. 2       These two appeals have brought to the fore yet\n                    again that this fundamental principle of law must be applied unwaveringly to\n                    prevent any miscarriage of justice. This case serves as a reminder that the\n                    Prosecution’s burden of proof cannot be discharged simply by persuading\n                    the trial judge to accept that the Prosecution’s version of the events is\n                    moreprobablethan the version offered by the\n                    accused without addressing the critical question whether the evidence adduced by\n                    the Prosecution has proved the charge beyond reasonable doubt. When this occurs,\n                    it may lead to an egregious error in conflating and confusing the crucial\n                    difference in the treatment of the burden of proof in a criminal case with that\n                    of a civil trial.",
        "The Charges": "3       The two appellants, Jayasekara Arachchilage\n                    Hemantha Neranjan Gamini (20 years old), and Jullian Hettige Hasitha Migara\n                    Perera (23 years old) (hereinafter referred to as “Jayasekara” and\n                    “Jullian” respectively) were charged for, in furtherance of the\n                    common intention with two other persons, committing robbery of $80 in the\n                    possession of one Manikku Archarige Weerantha Silva (“PW1”) on 4\n                    November 2009 between 4 am to 5 am, under s 392 read with s 34 of the Penal Code\n                    (Cap 224, 2008 Rev Ed). Jayasekara was also charged for voluntarily\n                    causing hurt to one Sembakutti Sudarma De Silva (“PW2”) by kicking\n                    his hip area on 4 November 2009 between 4 am to 5 am, under s 323 of the Penal\n                    Code. 4       The appellants were convicted of the charges by\n                    the district judge (“the DJ”) and were each sentenced to 42\n                    months’ imprisonment and 12 strokes of the cane under s 392. Jayasekara\n                    was sentenced to one week imprisonment for the s 323 offence with the\n                    sentence to run concurrently. The appellants appealed against both convictions\n                    and sentences.",
        "The Prosecution’s case": "5       It was the Prosecution’s case that PW1 and\n                    PW2 were victims of a robbery committed by Jayasekara, Jullian and two other\n                    persons. PW1 and PW2 as well as Jayasekara and Jullian are all Sri Lankan\n                    nationals and were known to each other at the material time. The\n                    Prosecution’s position is that PW1 is a businessman who dealt with the\n                    importation of car spare parts. According to both PW1 and PW2, they were having\n                    drinks with some friends,ieone Danushka and\n                    three of his friends on 4 November 2009 at the coffeeshop on the ground floor of\n                    the Shing building located at Verdun Road when Jayasekara approached PW1 for\n                    some money to buy drinks. After PW1 refused to give any money to Jayasekara, PW1\n                    asked PW2 to leave the coffeeshop as he sensed that there could be trouble. PW1\n                    and PW2 then left the coffeeshop and started walking in the direction away from\n                    Jayasekara and his friends, and walked towards an open space carpark also\n                    located along Verdun Road. 6       As PW1 and PW2 were near the carpark, someone\n                    behind them shouted “Hey Stop” in Sinhala. PW1 and PW2 then saw\n                    the appellants and two other persons running towards them. PW1 and PW2 started\n                    running away from them towards the carpark. As they were being chased, one of\n                    the persons (amongst the appellants and two other persons) threw an empty beer\n                    bottle which landed and broke in front of PW1 and PW2. The appellants then\n                    overtook PW1 and PW2. Simultaneously, one of the two other persons kicked PW1\n                    from behind on his neck. The force was strong enough to cause PW1 to fall down.\n                    At this time, Jayasekara allegedly kicked PW2 on his hip which also caused PW2\n                    to fall down. While PW1 was on the ground, Jayasekara allegedly kicked him on\n                    his left upper arm and asked him for money. Jayasekara allegedly tried to take\n                    PW1’s wallet from his right side pocket, but PW1 rolled onto his side and\n                    used his right hand to prevent his wallet from being taken. As a result of the\n                    struggle, PW1’s left shin suffered some bruises and scratches and his\n                    t-shirt had shoe marks on it from Jayasekara’s kick. PW1 allegedly used\n                    his left hand to prop himself off the ground with a view to escape. This left\n                    PW1’s left side pocket exposed and Jayasekara allegedly reached into his\n                    pocket and robbed him of $80 cash. 7       PW1 then got up and ran towards Mustafa Centre,\n                    and it was alleged that the appellants and the two persons chased after him. PW1\n                    and PW2 ran in separate directions. PW1 headed towards the Shing building and\n                    thereafter hid himself inside Mustafa Shopping Centre. While PW1 was hiding, PW2\n                    walked to the junction of Kitchener Road and Serangoon Road where he encountered\n                    Jullian. According to PW2, Jullian approached him and asked for a cigarette but\n                    PW2 refused. PW2 then went to a café where he waited for PW1. After hiding for\n                    about 45 minutes, PW1 called PW2 on the mobile to meet him at a taxi stand along\n                    Serangoon Road in front of Serangoon Plaza. They met and decided to head for the\n                    Rochor Neighbourhood Police Centre (“Rochor Police Centre”) to\n                    report the robbery.",
        "The Appellants’ defence": "8       The appellants are private students in Singapore\n                    on study passes. It is the appellants’ position that PW1 and PW2 had\n                    fabricated the robbery to frame them due to a grudge that PW1 had with\n                    Jayasekara arising from the latter’s relationship with a prostitute known\n                    as Nirasha; and because of some unpleasant encounters which each of the\n                    appellants had with prostitutes controlled by PW1and PW2 on two separate\n                    occasions in the early hours of 4 November 2009. 9       According to the defence, PW1 was a pimp engaged\n                    in the prostitution of Sri Lankan women in the Serangoon Road area, and PW2 was\n                    his assistant in this prostitution racket. PW1 had brought Sri Lankan girls into\n                    Singapore to work as prostitutes. Sometime in July 2008, PW1 brought Nirasha to\n                    Singapore. Nirasha believed that she was going to work as a dancer. On arrival\n                    in Singapore, Nirasha was, however, forced to work as a prostitute. While in\n                    Singapore, Jayasekara and Nirasha became lovers, a relationship which was\n                    strongly opposed by PW1. According to Jayasekara, PW1 had threatened to assault\n                    him if he did not cease his relationship with Nirasha. In particular, Jayasekara\n                    related an incident where PW1 and some men came to his room one night at around\n                    midnight to warn him to end his relationship with Nirasha. Subsequently, Nirasha\n                    was arrested in or around June 2009. She asked Jayasekara for assistance to\n                    purchase a return air ticket to Sir Lanka. Jayasekara obtained some money from\n                    his mother to purchase the air ticket. Nirasha thereafter left with\n                    Jayasekara’s mother back to Sri Lanka. 10     On 3 November 2009, Jayasekara left his house\n                    at around 11.30 pm to meet one Suda Aiya for drinks. While he was on his way,\n                    Jayasekara met Jullian, who agreed to join him for drinks. At Mustafa Travel\n                    Agency, they met Suda Aiya who arrived with another person.[note: 1]They started drinking at the corner of the\n                    travel agency at about 1 am on 4 November. Jullian left the group some time\n                    before 5 am without informing Jayasekara. 11     Subsequently, Jaysekara borrowed $50 from Suda\n                    Aiya, after which he walked towards the Farrer Park hostel to engage the\n                    services of a Sri Lankan prostitute. According to Jayasekara, as Sri Lankan\n                    prostitutes avoided Sri Lankan customers, he pretended to be from India.\n                    Jayasekara paid the prostitute $50 to have “two shots” of sexual\n                    intercourse with her. However, after they had sexual intercourse for the first\n                    time, the prostitute refused to continue her services after she discovered from\n                    Jayasekara’s mobile ringtone (playing a Sir Lankan tune) that he was a Sri\n                    Lankan. Thereafter the prostitute left and Jayasekara went after her to seek a\n                    refund of $20. When the prostitute refused, PW1 and PW2 appeared. PW1 told\n                    Jayasekara to leave. Jayasekara refused and insisted on getting his refund. PW1\n                    then punched Jayasekara on the left eyebrow and right shoulder. Jayasekara ran\n                    away and rejoined Suda Aiya and Jullian (who had by then returned) at the corner\n                    of the Mustafa Travel Agency and continued to drink and chat. Jayasekara did not\n                    relate the incident to Jullian at that time because he was concerned that\n                    Jullian might start a fight as he was a bit drunk by then and further they had a\n                    rioting charge pending as well. 12     As for Jullian, after he left Jayasekara and\n                    the group before 5 am, he headed to the Shing Hotel to look for a prostitute. He\n                    too engaged the services of a prostitute for $50. After taking the money, the\n                    prostitute refused to go with him after she realised that Jullian was a Sri\n                    Lankan. To resolve the matter, Jullian approached PW1.[note: 2]PW1 informed him that\n                    there was no problem and that he could engage her services.[note: 3]Jullian however told PW1 that he could not force the prostitute. He then decided\n                    to rejoin Suda Aiya for more drinks. About 30 minutes later, PW1 appeared\n                    with the police and the appellants were arrested.",
        "The decision below": "13     The DJ adopted a rather curious route in\n                    arriving at his decision. In his Grounds of Decision (“GD”), he\n                    commenced his analysis by stating that the version of events given by PW1 and\n                    PW2 should be accepted as he was of the view that the evidence adduced by them\n                    was “unshaken”. The sum total of the\n                    DJ’s reasoning in arriving at this finding is set out in 2 paragraphs of\n                    his GD which is reproduced below: 26    I believe and accept the accounts given by PW1 and\n                            PW2. Despite strenuous cross examination, their evidence was unshaken.\n                            While the defence sought to make much of discrepancies between\n                            PW1’s and PW2’s account of the robbery, to the extent of\n                            requiring both witnesses to re-enact PW1’s movements while\n                            struggling on the ground with Jayasekara, I would only note that during\n                            such a chaotic and confused period, exactness of recall is hardly to be\n                            expected and to expect either PW1 or PW2 to remember and to furnish a\n                            blow by blow account of what exactly happened is\n                        unrealistic. 27    In any event, PW2’s account of having been\n                            kicked by Jayasekara in the left hip region was corroborated by the\n                            injury which was noted by PW4. 14     The DJ observed that PW2’s evidence of\n                    having been kicked by Jayasekara in the left hip region was corroborated by PW4\n                    who had noted the injury at the time when PWI and PW2 made the police\n                    report. 15     The DJ found that “in contrast”, the appellants’ evidence was\n                    implausible at some points, and was inconsistent with the accounts provided in\n                    their police statements. Jayasekara had alleged that he met Jullian with two of\n                    Jullian’s friends, but he claimed in his police statement that he was with\n                    two friends and that Jullian was alone. Jullian, on the other hand, had claimed\n                    in his statement that he was with a friend known as Kasun and that he went alone\n                    to meet Jayasekara. This was inconsistent with Jullian’s testimony that he\n                    was with a friend known as Deepal, and not Kasun. The DJ also disbelieved\n                    Jayasekara’s evidence that Suda Aiya, before lending him $50, had told\n                    Jayasekara not to “hang around in the night” since he had a\n                    pending rioting charge. 16     The DJ also observed that Jayasekara’s\n                    alleged injury on his left eyebrow was not corroborated by any police officer,\n                    and that there was a medical note from a doctor who had examined Jayasekara in\n                    which it was expressly recorded that there was no injury to his head region. The\n                    DJ observed that his evidence of an injury on his left eyebrow was inconsistent\n                    with his account in his police statement in which he stated he was hit on his\n                    cheek and on the left side of his face. With this, the DJ found that the claim\n                    that Jayasekara was punched by PW1 was untrue, and found Jullian’s\n                    evidence that he saw Jayasekara’s injury on his left eyebrow was obviously\n                    an attempt to corroborate Jayasekara’s version of events and was equally\n                    untrue. 17     Although the DJ was of the view that it was\n                    not necessary or relevant to make any finding as to PW1’s and PW2’s\n                        “profession”,[note: 4]he observed that if\n                    PW1 had, as alleged by Jayasekara, assaulted him and had operated as a pimp, the\n                    “last thing” that PW1 would want would be to involve the police.\n                    He therefore dismissed Jayasekara’s allegation that he was framed by\n                    PW1. 18     The DJ disbelieved Jullian’s account\n                    that he was prepared to walk away from the prostitute without retrieving his\n                    refund of $50, as it was observed that that amount was half of Jullian’s\n                    disposable income. He was of the view that it was “impossible to\n                    believe” that Jullian would not have asked for the money back and had\n                    simply walked away following the prostitute’s refusal to accede to his\n                    request for a refund. 19     The DJ observed that in spite of the\n                    antagonistic relationship between Jayasekara and PW1 over Nirasha, Jayasekara\n                    had referred to PW1 in his police statements as “the fat male Sri\n                    Lankan” and had also stated that he did not know PW1 but had only seen\n                    him around. 20     In view of the “litany of\n                        discrepancies”[note: 5]in the appellants’\n                    evidence, the DJ held that there was “little or no truth” in their\n                    evidence.",
        "The appeal": "21     In the appeal before me, the appellants relied\n                    on several arguments as the basis of the appeal. It was argued that the DJ had\n                    misdirected himself in failing to apply the trite principle of law that the onus\n                    is on the Prosecution to prove its case and the charge beyond any reasonable\n                    doubt, before a conviction could be made out. The appellants contend that the DJ\n                    had convicted the appellants purely or substantially on the inconsistencies in\n                    the appellants’ evidence and had placed undue weight on the\n                    inconsistencies which he had highlighted. Crucially, it was emphatically\n                    stressed that the DJ had overlooked several fundamental omissions in the\n                    Prosecution’s case and had disregarded serious inconsistencies in the\n                    Prosecution’s own evidence. Amongst the omissions in the\n                    Prosecution’s case which were highlighted by the appellants’\n                    counsel, two of them stand out for particular mention. First, there was no\n                    medical evidence to prove the injuries which were allegedly inflicted on PW1 and\n                    PW2 in the course of the robbery, and second, the cash sum of $80, the fruit of\n                    the robbery, was not recovered from the appellants when they were searched upon\n                    arrest. Both these omissions pertain to critical elements of the accusations\n                    levelled by PW1 and PW2 against the appellants. 22     The appellants relied on the decision ofJagatheesanto emphasise the\n                    Prosecution’s burden of proving its case beyond a reasonable doubt. In\n                    particular, the following observations are pertinent (per V K Rajah J\n                    (as he then was) at [55]–[56]): …As Prof Larry Laudan puts it, \"What\n                            distinguishes a rational doubt from an irrational one is that the former\n                            reacts to a weakness in the case offered by the prosecution, while the\n                            latter does not.\"…Reasonable doubt is, in other words,\n                        a reasoned doubt. The second reason why I am partial to this particular formulation of\n                        reasonable doubt is that it correctly shifts the focus from what could\n                        potentially be a purely subjective call on the part of the trial judge to a\n                        more objective one ofrequiring the trial judge to\n                            \"[reason] through the evidence\": Larry Laudan at 319.\n                        Therefore,it is not sufficient for the trial judge\n                            merely to state whether he has been satisfied beyond reasonable doubt.\n                            He must be able to say precisely why and how the evidence supports the\n                            Prosecution's theory of the accused's guilt. This process of\n                        reasoning is important not only because it constrains the subjectivity of\n                        the trial judge's fact-finding mission; it is crucial because the trial\n                        process should also seek to \"persuade the person whose conduct is under\n                        scrutiny of the truth and justice of its conclusions\": R A Duff, Trials and\n                        Punishment (Cambridge University Press, 1986) at p 116; T R S Allan,\n                        Constitutional Justice: A Liberal Theory of the Rule of Law (Oxford\n                        University Press, 2001) at p 81. [emphasis added] The Court further clarified that (at [61]): …the Prosecution bears the burden of proving its case beyond\n                        reasonable doubt. While this does not mean that the Prosecution has to\n                        dispel all conceivable doubts, the doctrine mandates that, at the very\n                        least, those doubts for which there is a reason that is, in turn, relatable\n                        to and supported by the evidence presented, must be excluded.Reasonable doubt might also arise by virtue of the lack of\n                            evidence submitted, when such evidence is necessary to support the\n                            Prosecution's theory of guilt. Such a definition of reasonable doubt\n                            requires the trial judge to apply his mind to the evidence; to carefully\n                            sift and reason through the evidenceto ensure and affirm\n                        that his finding of guilt or innocence is grounded entirely in logic and\n                        fact. A trial judge must also bear in mind that the starting point of the\n                        analysis is not neutral. An accused is presumed innocent and this\n                        presumption is not displaced until the Prosecution has discharged its burden\n                        of proof.Therefore, if the evidence throws up a\n                            reasonable doubt, it is not so much that the accused should be given the\n                            benefit of the doubt as much as the Prosecution's case simply not being\n                            proved. [emphasis added] 23     The appellants further relied on the Court of\n                    Appeal’s decision ofPublic Prosecutor v Mohammed Liton\n                        Mohammed Syeed Mallik[2008] 1 SLR(R) 601\n                        (“Mohammed Liton”). The Court of\n                    Appeal, in endorsing (at [34]–[35]) the\n                    observations of the trial judge inPublic Proseuctor v\n                        Mohammed Liton Mohammed Syeed Mallik[2007] SGHC 47,\n                    underscored an important reminder that it is not the duty of the trial judge in\n                    a criminal case to choose the more probable version amongst two competing\n                    version of events: Unlike civil cases, where the court may choose between two competing\n                        stories and accept the one on a balance of probabilities, that is to say,\n                        accepting that version because it seemed more plausible than the other, in a\n                        criminal case, there is an important norm to be taken into account at all\n                        times - thatwhere there is a reasonable doubt, that\n                            doubt must be resolved in favour of the accused. It is\n                        inherent [in] the requirement that the prosecution proves its case beyond\n                        reasonable doubt. …What this means is thatunlike a civil case,\n                            the court's verdict might not merely be determined on the basis that as\n                            between the two competing stories, which version was the more plausible\n                            one. In a criminal case, the court may find ... the complainant's story\n                            to be more probable than that of the accused person's version, and yet,\n                            be convinced that there is a reasonable possibility that the accused\n                            person's story could be true. If that were the case, the\n                        court's duty is to acquit. Unlike a civil case,the court\n                            need not make a decision by concentrating on which of the two versions\n                            was more probable. In the criminal trial the court must\n                        remind itself to break from any habitual inclination to contemplate the\n                        question of the burden of proof on the basis of a civil case, and instead,\n                        ask itself whether there was a reasonable possibility that the accused\n                        person's version was true. [emphasis added] 24     In the present case, the appellants submitted\n                    that no explanation whatsoever was provided by the DJ as to why and how he\n                    arrived at the conclusion that the Prosecution’s evidence was unshaken. It\n                    was further submitted that the DJ appeared to have convicted the appellants\n                    simply because he found their version of events to be implausible and by this\n                    process reversed the burden of proof to the appellants to establish their\n                    innocence.",
        "General observations of the Prosecution’s evidence": "25     There are various aspects of the charges which\n                    by its nature are capable of corroboration or proof with reference to objective\n                    evidence. As will be demonstrated below, none was adduced. Without objective\n                    evidence, the case against the appellants at the trial was almost entirely based\n                    on the testimony of PW1 and PW2. In such a case, it is crucial to carefully\n                    evaluate the credibility of the key witnesses which in this case would be PW1\n                    and PW2. This assessment was purportedly carried out by the DJ without stating\n                    his reasons. As will be shown below, the objective evidence before the court,\n                    when properly analysed, in fact cast serious doubts on the credibility of PW1\n                    and PW2. 26     In this connection, it is instructive to refer\n                    to the seminal decision ofJagatheesanwhere the\n                    court observed (at [44]–[45]): There is no absolute prohibition or legal impediment in convicting an\n                        accused on the evidence of a single witness: seeYeo Eng\n                            Siang v PP[2005] 2 SLR(R) 409 at [25] (although inTan\n                            Wei Yi v PP[2005] 3 SLR(R) 471 (“Tan Wei Yi”) at [23] Yong Pung How CJ expressed his reservations in doing\n                        so). Indeed, one wholly honest and reliable witness on one side may often\n                        prove to be far more significant or compelling and outweigh several\n                        witnesses on the other side who may be neither reliable nor\n                        independent. The court must nevertheless be mindful of the inherent dangers of such a\n                        conviction and subject the evidence at hand to close scrutiny: seeLow Lin Lin v PP[2002] 2 SLR(R) 881 at\n                            [49]. This is true whether the\n                        witness is an accomplice (seeChua Poh Kiat Anthony v\n                            PP[1998] 2 SLR(R) 342, or an interested witness\n                        (seeKwang Boon Keong Peter v PP[1998]\n                        2 SLR(R) 211). In such situations, a conviction can only be upheld\n                        if the testimony is so compelling to the extent that a conviction can be\n                        founded entirely and exclusively on it. This means no more than that the\n                        witness’s testimony evidence is so compelling that the\n                        Prosecution’s case is proved beyond reasonable doubt,solelyon the basis of that witness’s\n                        testimony:Teo Keng Pong v PP[1996]\n                        2 SLR(R) 890 (“Teo Keng\n                        Pong”) at [73]. 27     With this caveat, I now direct my attention to\n                    address the various omissions in the Prosecution’s evidence as raised by\n                    the appellants.",
        "Material omissions in Prosecution’s evidence": "",
        "No evidence of the broken beer bottle": "28     According to the account of PW1 and PW2, the\n                    robbery incident started with someone shouting “Hey Stop” followed\n                    by the throwing of a beer bottle which landed and broke in front of PW1 and PW2.\n                    Accordingly, this would be a useful point to commence the analysis of the\n                    evidence or lack thereof in relation to the robbery. 29     There was no evidence of the broken beer\n                    bottle that was allegedly thrown at the open space car park. The police failed\n                    to visit the scene of the alleged robbery to look for the broken pieces of the\n                    alleged broken bottle. Indeed, PW1 testified that he was not even taken to the\n                    carpark where the alleged robbery took place for investigation.[note: 6]This could\n                    and should have been done but was inexplicably not done. 30     The prosecution also failed to call either of\n                    the two other persons who were involved in the alleged robbery to the stand.\n                    Either or both of them would have been a material witness as to whether the beer\n                    bottle was thrown as alleged by PW1 and PW2. This would in turn have shed light\n                    on whether the account provided by PW1 and PW2 was true and\n                accurate.",
        "No evidence of the alleged injuries to the victims": "31     The absence of corroborative evidence in\n                    respect of the injuries allegedly sustained by PW1 and PW2 is particularly\n                    significant. The original charges preferred against the appellants were robbery\n                    with hurt under s 394 of the Penal Code. On the first day of the trial, the\n                    charges were amended to proceed by way of s 392 of the Penal Code instead. The\n                    charges under s 392 of the Penal Code do not necessarily require proof of hurt.\n                    It is not clear why the charges were amended but it was probably no coincidence\n                    that the injuries allegedly sustained by PW1 and PW2 were not supported by any\n                    medical report or even by photographs. Clearly the lack of corroborative\n                    evidence was significant enough to cause the Prosecution to amend the\n                    charges. 32     PW1 claimed that he was hit (by one of the two\n                    persons apart from the appellants) on his neck from behind, and that it was a\n                    very hard blow which caused him to fall.[note: 7]PW1 further claimed that Jayasekara\n                    kicked him on his upper left arm while he was still lying on the\n                        ground[note: 8]and in the course\n                    of the struggle, his left shin also sustained scratches and bruises.[note: 9]PW2 claimed that\n                    Jayasekara also kicked him at his left hip area which caused him to fall down.\n                    PW2 alleged that it was a “tremendous kick” and a “very\n                    hard kick”.[note: 10]Therefore, according to PW1 and PW2, several injuries were allegedly inflicted\n                    by Jayasekara on both of them. 33     However, these assertions were actually\n                    contradicted by independent evidence from more than one police officer. PW5, a\n                    police officer with Rochor Police Centre, had specifically observed PW1’s\n                    neck and found no visible injuries on his neck. In addition, PW1 did not refer\n                    to any other injury allegedly inflicted by the appellants when he was asked at\n                    the police station even though he claimed that he was kicked by Jayasekara on\n                    the upper left arm and sustained bruises and scratches on his left\n                        shin:[note: 11] Q:[The] [c]onversation [between counter officer and\n                            PW1] took place in front of you? A:Yes. ... Q:When counter officer asked [whether] PW1 had any\n                            injuries, PW1 pointed to [the] back of [his] neck? A:Yes. Q:You had look but didn’t\n                                find any injury? A:No visible\n                            injury. ... Q:Did PW1 point out any other part of body to\n                            indicate injury? A:Only recall neck injury be[ing] pointed\n                        out. Q:Did he point to any part of legs? A:PW1? No. [emphasis added] 34     PW5’s evidence is reinforced by\n                    PW4’s evidence that there was no visible injury on PW1’s\n                        neck:[note: 12] Q:[Regarding] PW1[,] [w]hat injuries did he\n                            show? A:Didn’t specifically show any injuries. But\n                            indicated neck and said had bruises and pain on neck. Q:Did not see any bruising of on\n                                neck? A:No. [emphasis added] 35     Indeed, there was inconsistent treatment of\n                    PW4’s evidence, given that the DJ relied on PW4’s evidence to\n                    corroborate the Prosecution’s case as regards PW2’s hip injury but\n                    on the other hand, ignored PW4’s evidence which materially contradicted\n                    the allegations made by PW1as regards his neck injury. The testimonies of PW5\n                    and PW4 that there were no injuries to both PW1 and PW2 were further bolstered\n                    by the evidence of a third police officer, PW3. He testified that there were no\n                    visible injuries onbothPW1 and PW2 and more\n                    significantly neither complained ofanyinjuries:[note: 13] Q:Did either of them [PW1 and PW2] appear to you to\n                            be injured? A:[They] [d]o not have any visible\n                                injuries on them. Q:As far as you know, they [PW1 and PW2] did not\n                            complain to you of any injuries they have suffered? A:They did not complain to\n                                me. ... Q:Did you see PW2 limping when he was walking to\n                            point of arrest? A:No. Did not notice\n                            that. [emphasis added] 36     PW4’s evidence on the bruise found on\n                    PW2 is set out below:[note: 14] Q:PW2: Observe any injuries on him? A:Some bruises on left hip Q:Did you actually see bruise? A:Yes Q:Offer any medical assistance? A:Yes. Did some first aid. Intended to call for\n                            ambulance but they turned down offer 37     However under cross-examination, PW4 gave a\n                    different answer. Contrary to his earlier answer, PW4 testified that he did not\n                    in fact provide first aid to PW2. He had offered it but it was turned down by\n                        PW2.[note: 15]Taking\n                    PW4’s evidence at face value, there is nothing to suggest that the\n                    bruising on PW2’s hip was freshly inflicted or that it was caused by\n                    Jayasekara’s kick. As such, I find that there is no corroborative value in\n                    PW4’s evidence as regards the bruise found on PW2. 38     The DJ should have accorded the requisite\n                    weight to the evidence of PW3, given that PW3 was the officer who had\n                    accompanied PW1 and PW2 to the point of arrest. It is significant that PW2 was\n                    not seen limping throughout the time when he walked with PW3. Furthermore,\n                    although the DJ noted that PW2’s allegation of injury to his hip area was\n                    corroborated by PW4’s evidence, this was contradicted by PW3’s\n                    evidence that there were no visible injuries on either PW1 or PW2 and neither\n                    complained of any injuries, as well as PW5’s material evidence that he did\n                    not witness PW2 showing his alleged hip injury to PW4:[note: 16] Q:Did you see PW2 removed shirt to point out injury\n                            to PW4? A:I didn’t see. Q:Did you at any time have [a] look at PW2’s\n                            hip region? A:No. Q:Did you see PW4 having [a] look at [the] left side\n                            of PW2’s hip? A:No. ... Q:Did PW4 mention injury on PW2 to you? A:No. 39     The absence of evidence in relation to the\n                    alleged injuries is particularly crucial in the present case. Although,\n                    ordinarily, the charges under s 392 of the Penal Code do not necessarily require\n                    proof of hurt, it is pertinent that by the Prosecution’s own account of\n                    events as provided by PW1 and PW2, actual hurt was alleged to have been caused\n                    by the appellants to both of them. In this regard, not only was there no medical\n                    evidence whatsoever to corroborate PW1’s and PW2’s account, the\n                    evidence adduced by the Prosecution’s witnesses had in fact undermined the\n                    Prosecution’s case. Failure to adduce corroborative evidence of the victims’\n                injuries 40     There is no evidence to support PW1’s\n                    alleged injuries apart from his own assertion accompanied by PW2’s\n                    supporting testimony. As highlighted above, PW1’s allegation of injuries\n                    runs contrary to the independent evidence given by several police officers. As\n                    for PW2’s alleged injury to his hip, the Prosecution submitted during the\n                    appeal before me that it was sufficiently corroborated by PW4’s evidence\n                    and medical evidence was therefore not required. The Prosecution relied on the\n                    following passage fromSahadevan s/o Gundan v Public\n                        Prosecutor[2003] 1 SLR(R) 145 (“Sahadevan”) (at [32]): Counsel for the appellant submitted that the district judge had erred in\n                        that Sgt Zul's testimony should not have been relied upon as the basis to\n                        find that hurt had been caused to Pandi. It was further submitted that hurt,\n                        pain and swelling are issues requiring proof by medical experts and Sgt Zul\n                        was not a doctor who could testify on this crucial aspect of the case\n                        against the appellant. I was unable to accept this contention.Whether hurt is caused is a finding of fact, which is not\n                            necessarily to be always corroborated by evidence given by medical\n                            experts.A trial judge is entitled to find\n                            that hurt has been caused, with or without medical evidence,\n                        if he is convinced that it has been proven, in light of all the evidence\n                        before him. [emphasis added] 41     In my view, it is a general principle of law\n                    that, whether corroboration by independent evidencewas\n                        necessary, and if so,what kindof\n                    corroborative evidence was required (such as photographs, medical reports,\n                    doctor’s letter,etc) depends on the facts\n                    and circumstances of each case. Particular consideration should be given to the\n                    strength and sufficiency of the direct and circumstantial evidence available in\n                    each case and whether the evidence is capable of corroboration. All things being\n                    equal, the more specific the allegation of injury, the greater the need for\n                    corroborative evidence to satisfy the burden of proving the specificity of the\n                    allegation. Likewise, the more serious the alleged injury, the more suspect it\n                    would be for failing to adduce corroborative evidence; for a court would view\n                    with circumspection the failure to provide corroborative evidence when such\n                    corroboration was available and where no satisfactory explanation was provided\n                    for its omission. 42     In the present case, there can be no doubt\n                    that the injuries allegedly inflicted on PW1 and PW2 were capable of\n                    corroboration by way of medical reports. At the very least, photographs of the\n                    alleged injuries should have been taken but unfortunately this elementary step\n                    was not carried out by the police investigators. As pointed out, PW4’s\n                    evidence has been thrown into doubt by PW3’s and PW5’s testimony\n                    (see[35]–[38]above). The Prosecution’s failure to produce\n                    independent corroborative evidence had therefore severely weakened its case. The\n                    absence of any objective evidence to substantiate the injury becomes even more\n                    suspect given that PW2 had alleged that he suffered a “tremendous”\n                    and “very hard blow” which caused him to fall to the ground. One\n                    would expect some photograph or medical report to prove the injury particularly\n                    in light of the nature of the injury alleged by PW2. The complete absence of any\n                    objective evidence was therefore highly unsatisfactory. 43     Furthermore, no explanation was given as to\n                    why either of the two other persons who were involved in the alleged robbery was\n                    not called to the stand. Clearly they would have provided material and relevant\n                    evidence; it was after all, not the appellants who had hit PW1 at the back of\n                    his neck which caused him to fall. Instead it was one of the other two persons.\n                    If PW1’s and PW2’ accounts were to be believed, the two persons\n                    would have witnessed Jayasekara’s alleged kick on PW1’s left upper\n                    arm and the alleged kick on PW2’s hip, as well as the robbing of $80 cash\n                    from PW1. Further, Danushka who was in the coffeeshop with PW1 and PW2 when PW1\n                    first spoke to Jayasekara was also not called to corroborate the event that\n                    allegedly led to PW1 and PW2 abruptly leaving the coffeeshop without even\n                    finishing their beer. It was PW2’s evidence that Danushka stayed in the\n                    same place as PW1 but had returned to Sri Lanka by the time of the trial.\n                    Moreover, given that the charges preferred against the appellants were that they\n                    had committed the robbery in furtherance of thecommon\n                        intentionshared with these two persons, it was anomalous that\n                    the two persons were not charged and tried at the same trial with the\n                    appellants. No reason was offered by the Prosecution to explain this\n                    anomaly. 44     Finally, the Prosecution could have adduced\n                    the CCTV footage from Rochor Police Centre. In the course of trial, during\n                    cross-examination of PW3, it was revealed that there was a CCTV at Rochor Police\n                    Centre which would show the persons who walk into the Centre to lodge\n                        complaints:[note: 17] Q:Any CCTV at Rochor Neighbourhood Police to record\n                            who comes in to record complaints? A:There is a CCTV inside Neighbourhood Police\n                            Centre. Q:This CCTV will show who has come in to lodge\n                            complaints? A:Yes. … Q:Who is [the] recorder/archiver? A:Sgt Ho. Q:Full name? A:Do not know. Admin officer in Rochor Neighbourhood\n                            Police Centre. 45     According to the appellants’ counsel, at\n                    the conclusion of this line of questioning, the Prosecution then informed the DJ\n                    that “based on what has come up, [he] will endeavour to locate Sgt Ho and\n                    the CCTV records”. This was asserted by counsel in the closing\n                    submissions at the trial below[note: 18], the written submissions\n                    for the appeal[note: 19], and also during the appeal\n                    hearing before me[note: 20],\n                    and was left undisputed by the Prosecution. In the appeal before me, the\n                    Prosecution explained that the CCTV recording has been recycled. However this\n                    was not told to the appellants’ counsel until the Reply Submissions by the\n                    Prosecution in the court below. However it was not clear from the Reply\n                    Submissions when the CCTV recording was erased. This was unfortunate as the CCTV\n                    records would have provided some evidence to establish the physical state of PW1\n                    and PW2 when they arrived at the police station to file their report. It would\n                    have established whether PW1 was wearing footwear on only one foot in accordance\n                    with PW1’s version of events (he claimed to have lost the other footwear\n                    in the struggle) and whether PW2 was limping (due to the injuries inflicted by\n                    Jayasekara) as claimed.[note: 21] From the above, it is clear that there\n                    were ample opportunities and avenues for the Prosecution to adduce objective\n                    evidence by way of medical reports, photographs of the injuries, remnants of the\n                    broken beer bottle, the CCTV footage or by calling the two friends of the\n                    appellants who were involved in the robbery or Danushka, to corroborate the\n                    testimonies of PW1 and PW2 but curiously none was done. Instead they elected to\n                    proceed solely on the basis of the testimonies of PW1 and PW2. The Prosecution\n                    must therefore stand or fall by their election.",
        "No evidence in relation to the $80 cash": "46     Jayasekara was charged and convicted of\n                    robbing PW1 of $80 cash. Jayasekara was arrested shortly after the alleged\n                    robbery and yet the stolen money was not found on him. InSahadevan, the Court held that there was no general rule which\n                    required the fruits of the crime (in this case, the $80 cash) to be recovered\n                    before a charge of robbery could be made out. In the circumstances ofSahadevanhowever, the Prosecution’s failure to\n                    adduce evidence of the cash that was allegedly robbed considerably weakened its\n                    own case particularly when the victim’s credibility was suspect (at[30]and [35]): Even though… there is really no rule of law that the fruits of a\n                        crime must be recovered before the charge against an accused is proven, I\n                        was of the view that, taking into account the surrounding circumstances of\n                        this case and the need to place a greater scrutiny on Pandi's evidence, the\n                        failure to recover the $50 from the appellantconsiderably weakenedthe Prosecution's case... …the burden of proof was still on the Prosecution to prove the\n                        appellant's guilt beyond a reasonable doubt, however tenuous the defence\n                        might have been: seeTan Edmund v PP[1995]\n                        1 SLR(R) 618. In discharging this burden, it was not at all\n                        sufficient for the Prosecution to merely point to the inadequacies of the\n                        appellant's testimony. [emphasis added] 47     In the present case, the appellants were\n                    searched when they were arrested at about 6.45 am on 4 November 2009. This was\n                    slightly more than an hour after the alleged robbery. However the $80 was not\n                    found on either of them. PW5 testified that nothing incriminating was found on\n                        them.[note: 22]Indeed, less\n                    than $5 was found onone of the appellantsand\n                    surprisingly the Prosecution’s witness was not even clear which of the two\n                    appellants was found with the $5 cash.[note: 23]According to PW6, he was told by PW1\n                    that the $80 which was robbed by Jayasekara comprised one $50 note and three $10\n                        notes.[note: 24]What happened to the balance $75? 48     Furthermore, in my view, in so far as the\n                    establishing of charge required proof of theft, it would be unsafe to prove this\n                    aspect based on the mere say so of PW1, a witness who lacked credibility (this\n                    will be elaborated below at[51]–[58]) and whose\n                    evidence was inconsistent in several material aspects and contradicted by the\n                    evidence from several police officers (as already shown above at[33]–[38]). From this perspective, the Prosecution’s failure to\n                    recover the sum of $80 assumes even more significance. Although there is no\n                    general rule of evidence that the fruits of a crime had to be recovered in order\n                    to establish the charge of robbery, in the present case the appellants were\n                    caught and arrested within a short period of time after the alleged robbery and\n                    no explanation was advanced as to why the cash was not found on them. They were\n                    arrested within metres from the scene of the alleged robbery. The fact that the\n                    appellants were comfortable to remain in the vicinity of the scene of the crime\n                    would suggest that they were not suspecting to be arrested. Therefore it cannot\n                    be and has not been suggested that the appellants had concealed the stolen\n                    money. The need for a viable explanation for the missing $80 cash was especially\n                    crucial since the credibility of PW1, whose testimony was the main evidence\n                    relied by the Prosecution, was highly questionable. In this regard, the DJ did\n                    not provide any reasons for his finding that the Prosecution’s case was\n                    made out despite the Prosecution’s failure to adduce any material evidence\n                    to account for the missing $80 cash. The DJ also omitted to deal with the\n                    Prosecution’s suggestion that the $80 was spent on alcohol, and in\n                    particular, on a bottle of Johnny Walker (Prosecution’s Reply Submissions\n                    dated 31 May 2010 at p 8): …the Victims had been separated from the Accused Persons for about\n                        an hour plus. They did not have the opportunity to continue observing the\n                        Accused Persons. Moreover, when the Accused Persons were arrested, they were\n                        observed to be drunk and, by their own admission, a ‘Johnny\n                        Walker’ bottle was with them. The Accused Persons in our case had both\n                        the time and the means to spend the S$80 which was taken from PW1 because of\n                        the close proximity of shops selling alcoholic drinks in the\n                        vicinity. 49     I am unable to accept the Prosecution’s\n                    suggestion which is speculative at best. Indeed, the DJ in his GD did not even\n                    deal with this suggestion by the Prosecution. In any event, the\n                    Prosecution’s suggestion was based on an incomplete representation of the\n                    evidence. Jayasekara’s testimony that the bottle of Johnny Walker was\n                    purchased by Suda Aiya (and not Jayasekara)[note: 25]was not challenged by the\n                    Prosecution and that it only costs about $39.[note: 26]The\n                    Prosecution did not submit or lead any evidence to suggest that Jayasekara may\n                    have passed the balance cash which he had allegedly robbed from PW1 to Suda\n                    Aiya. In addition, at the time of the arrest, PW5 admitted in court that he had\n                    only looked at the Johnny Walker bottle from a distance, and did not even ask\n                    the appellants whether the bottle was purchased by them.[note: 27]Furthermore, PW5 did not\n                    seize the bottle as he believed that the bottle was not relevant to the\n                        case.[note: 28] 50     It may well be that the failure to account for\n                    the stolen money;orfailure to produce medical\n                    evidence to establish the alleged injuries;orfailure to investigate the scene of the crime to retrieve the broken beer\n                    bottle; may not; when takenin isolationbe,in and of itselffatal to the\n                    Prosecution’s case. However, the various omissions to corroborate, when\n                    takencollectivelyand examined in totality,\n                    presents a very different picture, that is, one which is full of unacceptable\n                    gaps and holes. In his GD, the DJ did not address the above omissions and gaps\n                    in the Prosecution’s evidenceat alland\n                    accordingly failed to giveanyconsideration to\n                    the manifest lack of corroborative evidence.",
        "Doubts about the credibility of PW1 and PW2": "",
        "Inherently incredulous aspects of the Prosecution’s\n                case": "51     Without the assistance of vital corroborative\n                    evidence, the case against the appellants was essentially based on the\n                    testimonies of PW1 and PW2. Under these circumstances, it was,a fortiori, imperative for the DJ to carefully evaluate\n                    the testimonies of PW1 and PW2 to determine whether the charges have been made\n                    out. It is eminently obvious that it would not be sufficient for the DJ to\n                    simply state that he was satisfied that PW1’s and PW2’s testimony\n                    were truthful. It behoved him to explainpreciselywhy and how the evidence supported the Prosecution’s case (seeJagatheesanat [56]). In the present case, it is apparent that, in the whole of\n                    the two paragraphs dedicated to observations on the Prosecution’s\n                        case,[note: 29]no reason whatsoever was provided\n                    by the DJ as to why and how he arrived at the conclusion that the\n                    Prosecution’s evidence was unshaken. No reason was likewise provided by\n                    the DJ to explain theevidentialbasis for\n                    accepting the version of events given by PW1 and PW2. As elaborated above, there\n                    were in fact obvious and material gaps in the Prosecution’s evidence. The\n                    DJ appeared to have accepted the Prosecution’s version because he found\n                    the appellants’ version to be “implausible”. As the analysis\n                    of PW1’s and PW2’s evidence was, unfortunately, not carried out by\n                    the DJ on the face of his GD, it leaves me now to undertake that task with\n                    reference to the evidence before me. 52     Several dubious aspects of PW1’s and\n                    PW2’s evidence were brought to my attention by counsel for the appellants.\n                    First, after PW1 was hit on the neck and fell to the ground, it was alleged that\n                    Jullian pressed on PW1’s feet to hold him down to the ground so that he\n                    could not get up.[note: 30]While being held down, Jayasekara was alleged to have kicked PW1 on his upper\n                    left arm and had taken the $80 cash from PW1’s pocket.[note: 31]At the same time, the\n                    two other persons with the appellants were also around. PW2 was also on the\n                    ground as he was allegedly kicked on the hip by Jayasekara. Given such\n                    significant physical advantage over the victims (four assailants standing\n                    against two victims lying on the ground), it was inexplicable that the\n                    appellants would have robbed PW1 only of $80, and left his handphone[note: 32]and wallet containing\n                    about US$1,000 untouched.[note: 33]This is even more unbelievable as it\n                    was the evidence of PW1 that he was most concerned with his wallet and he was\n                    holding onto it. This would provide even more reason for the appellants to take\n                    PW1’s wallet forcibly from him. 53     According to their own version of events, both\n                    PW1 and PW2 also exhibited quite bizarre behaviour. First, instead of running\n                    straight to Rochor Police Centre or at least seeking help from the people in the\n                    surrounding areas after the alleged robbery, PW1 instead went into Mustafa\n                    Centre to hide for about 45 minutes. I can accept that PW1 being a foreigner may\n                    not be entirely comfortable to report the robbery incident over the phone to the\n                    police and would prefer to make a police report at the station. However, it must\n                    be borne in mind that it was PW1’s evidence that the appellants and their\n                    two friends were chasing him when he ran into Mustafa Centre to hide. PW1 agreed\n                    that when he entered Mustafa Centre, he saw the security guards at the\n                        entrance.[note: 34]However, when he was asked why he did not seek the assistance of the security\n                    guards to inform them that he had just been robbed by four persons and that\n                    these robbers had pursued him to the doorsteps of Mustafa Centre, he provided a\n                    most incredulous response. He testified that he did not complain to the security\n                    guards because “They are not people who will settle outside\n                    problems”! If PW1 is to be believed, this was no “outside\n                    problem” unless the problem was indeed related to the dispute over the\n                    prostitutes as alleged by the appellants. It was, according to PW1, a violent\n                    and traumatic robbery and yet he did not take the most obvious step to alert or\n                    inform the security guards at the entrance of Mustafa Centre. 54     PW2’s version is even more bizarre. He\n                    claimed that he was simply walking around the Serangoon Road area after he fled\n                    from the robbers. To add to the incredulity of his account, Jullian on sighting\n                    PW2, instead of avoiding or running away from him, actually approached PW2 (the\n                    victim of the allegedly violent robbery) to ask for a cigarette! The DJ’s\n                    analysis of this point was odd to say the least. He observed at [39] of his GD: I had pointed out that if PW2 had acceded, PW2 would have equally been\n                        open to the charge of consorting with someone who had just robbed him and\n                        that the inference could not fairly be drawn. At that time, counsel had\n                        agreed and had not pursued the matter. But as it has been referred to in one\n                        of the submissions of the accused, I will simply say that since PW2 would be\n                        open to this accusation whether he agreed or refused, I will not draw an\n                        adverse inference from his conduct. 55     The point was not whether an adverse inference\n                    ought to be drawn against PW2 but rather that his account of the events was\n                    inherently incredulous and should be rejected altogether. Further, the\n                    DJ’s explanation presupposed the “cigarette” incident did\n                    happen. It is Jullian’s case that it did not. The point which was\n                    articulated by counsel for the appellants is that it was outrageous to suggest\n                    that Jullian would approach the victim of a robbery which had just occurred\n                    minutes ago for a cigarette in the middle of Serangoon Road (which was very busy\n                    even at that time of the night[note: 35]) as if nothing had happened. When PW2\n                    was questioned on his reaction to the approach by Jullian some 30 minutes after\n                    the robbery and assault, he answered “I didn’t feel\n                    anything”. Finally, it is difficult to follow the DJ’s reasoning\n                    that if PW2 had acceded to Jullian’s request for a cigarette, PW2 would be\n                    open to a charge of consorting with the robbers. That was for PW2 to explain and\n                    not for the DJ to speculate with an illogical explanation. PW2’s response\n                    was he simply refused. In any event, it was inexplicable why PW2 would be open\n                    to a charge of consorting if he had simply provided the cigarette to Jullian. He\n                    could have done so out of fear if he was to be believed. 56     It was also bewildering that the appellants,\n                    instead of running away to avoid detection and possibly arrest, would instead\n                    return to the coffee shop for drinks some ten metres away from the scene of the\n                    crime. Such behaviour, in my view, was clearly inconsistent with someone who had\n                    just committed an allegedly violent robbery. 57     PW1 claimed that his t-shirt had some shoe\n                    marks and lines as a result of the kick by Jayasekara. These alleged marks would\n                    have again provided some corroborative evidence of the kick, the struggle on the\n                    ground, and the robbery. Yet PW1 testified that before going to the police\n                    station to report the robbery, he had changed into another shirt.[note: 36]According to PW1, he was\n                    so fearful that he hid in Mustafa Centre for some 45 minutes before going to the\n                    police station with PW2 to report the incident, and yet he had time to go back\n                    to change to a new shirt before going to the police station, which in the\n                    process, had conveniently resulted in the removal of evidence that could support\n                    the alleged kick and the ensuing struggle on the ground. 58     It was PW2’s evidence that he heard PW1\n                    telling Jayasekara at the coffeeshop from a distance: “No, I won’t\n                        give”.[note: 37]It must be remembered that it is Jayasekara’s case that he sought a\n                    partial refund of $20 from PW1 when the prostitute refused to continue her\n                    services after she found out that he was a Sri Lankan. PW1 refused and punched\n                    Jayasekara when he refused to leave without the refund. However, it is not\n                    necessary for me to make a finding whether PW1’s refusal was in relation\n                    to Jayasekara’s demand for the refund, suffice to say that perhaps this\n                    ought to have been explored in the court below.",
        "Were PW1 and PW2 involved in the prostitution trade?": "59     The DJ observed that it was neither relevant\n                    nor necessary to make a finding on PW1’s and PW2’s\n                    “profession”. I disagree with the DJ that the issue of PW1’s\n                    and PW2’s trade or profession was irrelevant in the context of this case.\n                    It was the central theme of the appellants’ defence. Jayasekara alleged\n                    that PW1 bore a grudge against him because of his intimate relationship with a\n                    prostitute named Nirasha which PW1 had objected to. Both appellants related\n                    unpleasant incidents with PW1 on 4 November 2009, shortly before the alleged\n                    robbery, over the services of Sri Lankan prostitutes purportedly controlled by\n                    PW1. In my opinion, any evidence which suggests that PW1 and PW2 were engaged in\n                    the prostitution trade would go some way in supporting the veracity of the\n                    appellants’ version of events. 60     It is material that PW1 initially testified in\n                    court that he had never been out with Nirasha.[note: 38]That was entirely inconsistent with\n                    the photograph (exhibit D5) which showed PW1 sitting next to Nirasha while\n                    on an outing. When he was confronted with D5, PW1 changed his evidence and\n                    agreed that he had been out with Nirasha before and claimed that he thought the\n                    earlier question was whether he had eversleptwith her. Further, PW1 also admitted that he was aware from his friends that\n                    Nirasha was working as a prostitute in the Serangoon Road area. As such, there\n                    can be no denial that PW1 was at least familiar with one prostitute. It is\n                    significant that that prostitute was the one with whom Jayasekara claimed to\n                    have an intimate relationship which was objected to by PW1. 61     PW1’s evidence that he chose to stay in\n                    the Serangoon Road area because it was convenient for him to purchase items for\n                    his business[note: 39]was later shown to befalse, where he made a\n                    material admission that he had tried toportrayhimself as a businessman:[note: 40] Q:[You] [s]aid [that you] stayed in Serangoon because\n                            [it was a] convenient location to buy stuff from [that]\n                        area? A:Yes. Q:Agree [that] answer [is] not true since table shows\n                            [that] 13 out of 15 suppliers [are] not near Serangoon at\n                        all? A:Yes. Q:Tried to portray yourself as businessman in car\n                            parts and spectacles? A:Yes. 62     It would appear that the reason provided by\n                    PW1 for staying in the Serangoon Road area was established to be false. The\n                    invoices adduced by PW1 and PW2 in their attempt to prove that they were\n                    legitimate businessman who were engaged,inter\n                        alia, in the importation of car spare parts and spectacle frames\n                    did not support their claim either. Various invoices were submitted in evidence.\n                    Out of the fifteen invoices submitted, nine were dated after 4 November\n                    2009, the day of the alleged robbery. In respect of the invoices which were\n                    dated prior to 4 November 2009, neither PW1’s nor PW2’s names were\n                    stated on them. Instead they were addressed to Anura Diesel House\n                    (“Anura”). PW1 then claimed that he has a business relationship\n                    with Pradeep who was Anura’s purchasing officer. Pradeep was allegedly in\n                    Sri Lanka at the time of the trial.[note: 41]PW1 further claimed that when he visits\n                    Singapore to buy goods, he does not negotiate with the suppliers directly but\n                    buys through Pradeep as the middleman.[note: 42]However, PW1 was able to produce some\n                    invoices bearing his name after the date of the alleged robbery. PW1 claimed\n                    that he first started coming to Singapore to buy goods some four years\n                        ago.[note: 43]Yet despite the alleged length of\n                    time of trading in Singapore, PW1 was not able to produce a single invoice\n                    bearing his name prior to the alleged robbery. It is of course no coincidence\n                    that the area where the Sri Lankan prostitutes ply their trade is in the\n                    Serangoon Road area. Why spin a false story about the reason for staying in the\n                    Serangoon Road area if PW1 was engaged in a legitimate business as he claimed?\n                    Finally, even if PW1 had some business dealings in car spare parts or spectacle\n                    frames, it did not follow that he was not engaged in the prostitution trade as\n                    well. 63     PW1’s assertion that he was in Singapore\n                    previously to conduct legitimate business was also undermined by revelations\n                    that he had used false passports which bore different and false names, to enter\n                    Singapore on seven occasions. In that context, Jayasekara’s counsel, in\n                    cross-examination highlighted his questionable credibility:[note: 44] Q:[For] 6 or 7 times, you deliberately used passport\n                            with false name to enter Singapore? A:Yes. … Q:Admit you were, by such deception, being dishonest\n                            to government officers at Immigration Checkpoint, Changi\n                        Airport? A:Yes. Q:Agree you are, by your own admission, [a] dishonest\n                            person? A:I didn’t think so far. Q:Now [you] have time to think], [do you] admit that\n                            you are, by [your] own admission, a dishonest person? A:Yes. 64     The repeated use of multiple false passports\n                    by PW1 to enter Singapore would be more consistent with an illegitimate\n                    trade. 65     As demonstrated above, there are severalmaterialinconsistencies in the\n                    Prosecution’s evidence. The DJ omitted to explain how, despite these\n                    material omissions and inconsistencies, the Prosecution’s evidence had\n                    remained ‘unshaken’, and how PW1 could\n                    be found to be a credible witness in spite of the inconsistencies in his own\n                    evidence and various incredulous aspects of his evidence. From the bare\n                    treatment accorded to the Prosecution’s case in his GD, it was patently\n                    clear that the DJ had failed to attach any or sufficient weight to the material\n                    omissions and inconsistencies in the Prosecution’s evidence. Although\n                    there is some objective evidence before me to suggest that PW1 and PW2 may have\n                    been engaged in the prostitute trade, in light of my findings as regards the\n                    Prosecution’s evidence, it is strictly not necessary for me to determine\n                    this point. However, it is certainly not as implausible or irrelevant as the DJ\n                    had made it out to be.",
        "The DJ’s assessment of the appellants’ evidence": "66     In my view, the DJ and the Prosecution had\n                    needlessly devoted too much attention in dwelling on immaterial discrepancies in\n                    the evidence of the appellants. It really does not take much away from the\n                    defence, or add much to the Prosecution’s case, whether Jayasekara was\n                    with two friends before he met Jullian; whether Jullian was with Kasun or Deepal\n                    before he met Jayasekara; whether it was plausible that Suda Aiya would, before\n                    lending $50 to Jayasekara, advise him not to “hang around in the\n                    night”; whether it was implausible that Jullian would walk away from the\n                    prostitute without any refund given that $50 represented half of Jullian’s\n                    disposable income; and whether Jayasekara was punched in the left eyebrow, or\n                    the left side of his face or cheek. These are not very significant\n                    discrepancies. As held inChean Siong Guat v Public\n                        Prosecutor[1969] 2 MLJ 63: Discrepancies may, in my view, be found in any case for the simple reason\n                        that no two persons can describe the same thing in exactly the same way.\n                        Sometimes what may appear to be discrepancies are in reality different ways\n                        of describing the same thing, or it may happen that the witnesses who are\n                        describing the same thing might have seen it in different ways and at\n                        different times and that is how discrepancies are likely to arise. These\n                        discrepancies may either be minor or serious discrepancies. Absolute truth\n                        is I think beyond human perception and conflicting versions of an incident,\n                        even by honest and disinterested witnesses, is a common experience. In\n                        weighing the testimony of witnesses, human fallibility in observation,\n                        retention and recollection are often recognised by the court. 67     This observation was endorsed inPublic Prosecutor v Singh Kalpanath[1995]\n                    3 SLR(R) 158 where the Court gave the following guidance in regarding\n                    minor discrepancies (at[60]): Adequate allowance must be accorded to the human fallibility in retention\n                        and recollection. It is also common to find varying accounts of the same\n                        incident by the same person. No one can describe the same thing exactly in\n                        the same way over and over again: seeChean Siong Guat v\n                            PP[1969] 2 MLJ 63 68     Likewise, the Court inLoh\n                        Khoon Hai v Public Prosecutor[1996] 1 SLR(R) 958 gave\n                    the apt reminder that (at [25]): …The above discrepancies could be explained and were not material\n                        so as to affect the credit of Teh. Bearing in mind that the process of\n                        testimony is not a memory test, minor inconsistencies are often inevitable.\n                        Moreover, there may appear to be inconsistencies due to the way questions\n                        are phrased. The crux is whether the totality of the evidence was\n                        believable 69     Furthermore, the Court inSim Teck Meng David v Public Prosecutor[2004] SGHC 119 made similar observations that: At this juncture, I noted that in most criminal trials, there would occur\n                        minor discrepancies between the testimonies of two witnesses. One cannot\n                        expect perfectly compatible testimonies. Such expectations would negate the\n                        fact that between each witness there lay differences in perception,\n                        retention and recollection of events. These are factors that must be taken\n                        into account when a court is faced with discrepant testimonies. 70     I pause to observe that the DJ was, however,\n                    quite generous in his treatment of the inconsistencies in the evidence of PW1\n                    and PW2 at [26] of his GD: While the defence sought to make much of discrepancies between PW1’s\n                        and PW2’s account of the robbery, to the extent of requiring both\n                        witnesses to re-enact PW1’s movements while struggling on the ground\n                        with Jayasekara, I would only note that during such a chaotic and confused\n                        period, exactness of recall is hardly to be expected and to expect either\n                        PW1 or PW2 to remember and to furnish a blow by blow account of what exactly\n                        happened is unrealistic. 71     I have also noted that the DJ thought it fit\n                    to criticise the lack of medical evidence in relation to Jayasekara’s\n                    injuries allegedly inflicted by PW1 but at the same time completely failed to\n                    take cognizance of the lack of objective evidence as well as the contradictory\n                    evidence of the police witnesses in relation to themultipleinjuries allegedly suffered by PW1 and\n                PW2. 72     The DJ observed that although Jayasekara\n                    claimed that he had a long antagonistic relationship with PW1, he found it\n                    noteworthy that Jayasekara in his initial statement of 4 November 2009 did not\n                    name PW1 specifically but referred to him as “the fat male Sri\n                    Lankan”. Further in his subsequent statement of 6 November 2009,\n                    Jayasekara said that he did not know PW1 and only saw him around and did not\n                    know why PW1 would accuse him of robbery. In the immediate preceding sentence of\n                    the same statement, Jayasekara said that he had known PW1 for about two years.\n                    Viewed in context, it was clear that when Jayasekara said that he did not know\n                    PW1, he meant he did not know himpersonally,\n                    otherwise it did not make any sense for him to say in the same breath that he\n                    had known him for about two years. While it was true that Jayasekara did not\n                    reveal his prior antagonistic relationship with PW1 at the time when the\n                    statements were recorded, both appellants had consistently maintained in all\n                    their police statements that PW1 and PW2 were pimps for Sri Lankan prostitutes\n                    operating in the Serangoon Road area. Furthermore, Jayasekara was somewhat\n                    intoxicated and not in a clear mind at that time. Even PW1 testified that\n                    Jayasekara was “drunk” at the time of the alleged\n                        robbery.[note: 45]In fact PW1 was sure that Jayasekara was drunk\n                    because “[o]nce person is drunk, behaviour is\n                        different”.[note: 46] 73     In addition to the above, the DJ disbelieved\n                    the appellants’ case that the victims had operated as pimps, and that the\n                    appellants were framed by PW1 and PW2 due to a prior dispute over Nirasha. In\n                    particular, the DJ observed that if PW1 had assaulted him and had operated as a\n                    pimp as alleged by Jayasekara’s account of events, the “last\n                    thing” that PW1 would want would be police involvement. However, it is\n                    accepted that even if the Defence’s case wasdisbelievedby the trial judge, it remainedimperativefor the Prosecution to discharge its burden of\n                    proving its own case beyond a reasonable doubt. This was emphasised in the\n                    Magistrate’s Appeal decision ofTeo Keng Pong v Public\n                        Prosecutor[1996] 2 SLR(R) 890 (at [67]): In my view, there was nothing in the grounds of judgment to indicate that\n                        the magistrate did not apply the correct burden or standard of proof. No\n                        doubt, the magistrate did not use the words \"beyond reasonable doubt\",\n                        however, it was clear from the manner she approached the issues that she was\n                        looking for proof beyond reasonable doubt. Hence, she addressed herself to\n                        the question whether PW1's evidence was \"unusually convincing\". It is\n                        pertinent to note that she made a finding that it was, before proceeding to\n                        examine the defence evidence.This showed that the\n                            magistrate was aware that even if the Defence's evidence was\n                            disbelieved, the onus was first and foremost on the Prosecution to prove\n                            its case beyond reasonable doubt. The magistrate said that\n                        she was convinced that the Prosecution's evidence represented the truth.\n                        This was simply another way of saying that she had no reasonable\n                        doubt. [emphasis added] Indeed, similar observations were made inSahadevan(at [35]): …the burden of proof was still on the Prosecution to prove the\n                        appellant's guilt beyond a reasonable doubt,however\n                            tenuous the defence might have been… [emphasis added] It was also observed inTan Edmund v Public\n                        Prosecutor[1995] 1 SLR(R) 618 that (at [15]): There is no need to deal in minute detail with the defence of the\n                        appellant; for however tenuous that defence might have been, the burden\n                        still lay on the Prosecution to prove the appellant's guilt beyond\n                        reasonable doubt, and in discharging that burden, it was insufficient for\n                        them to point to the inadequacies of the appellant's or their witnesses'\n                        testimonies. 74     As such,even ifthe DJ was to disbelieve the appellants’ case that the victims had\n                    operated as pimps and that they had framed the appellants due to a dispute over\n                    Nirasha, the onus was, first and foremost, on the Prosecution to establish the\n                    charge beyond a reasonable doubt. As already shown above, the Prosecution has\n                    significantly failed to adduce evidence of the alleged injuries and failed to\n                    provide material corroborative evidence. It was also shown that there were\n                    irreconcilable doubts about the credibility of PW1’s and PW2’s\n                    evidence in view of the inherently incredulous aspects of their accounts.\n                    Moreover, as has already been discussed above ([59]–[65]), far from\n                    being tenuous, the appellants’ case appeared to be supported by some\n                    objective evidence. In this regard, it is helpful to refer to the decision ofSahadevan, where the facts of that case bear\n                    similarities to the present case in several material respects: (a)     Like the present case, there was no\n                        evidence of the fruits of the robbery despite the arrest, hours after the\n                        alleged robbery. (b)     The victim alleged that the accused had burnt his special pass at the\n                        time of the robbery. The police claimed that they searched the area for\n                        evidence of burnt paper and were unable to find anything. Here the police\n                        did not even search the area for the broken beer bottle.A fortiori, likeSahadevan,\n                        any doubt as to whether the beer bottle was thrown at PW1 and PW2 should be\n                        resolved in favour of the appellants. (c)     There was also no medical evidence to support the injury\n                        alleged by the victim. However, the court inSahadevandid not regard this absence as decisive as it was\n                        of the view that a trial judge was entitled to find that hurt has been\n                        caused with or without medical evidence. However, the difference betweenSahadevanand the present case as regards\n                        the lack of medical evidence is that in the present case, the alleged claims\n                        of various injuries werecontradictedby the\n                        testimonies of several police officers,iePW3, PW4 and PW5. (d)     I should add for completeness that inSahadevan, the court also found that there were material\n                        inconsistencies between the allegations stated in the victim’s First\n                        Information Report and his testimony in court. Similarly, there were\n                        material inconsistencies in the evidence of PW1 and PW2. In the present\n                        case, the First Information Report (“FIR”) was unhelpful as it\n                        had only oddly recorded a bare sentence which merely stated “two male\n                        subjects detained” and nothing more.[note: 47]Typically, one would have\n                        thought that the events recorded on the FIR would have preceded any arrest\n                        or detention of suspects. Nonetheless, as counsel for the appellants did not\n                        submit on the unusual nature of the FIR, I shall say no more in that\n                        regard. (e)     The\n                        court inSahadevanalso found inconsistencies\n                        in the evidence of the accused and arrived at the conclusion that\n                        “the appellant was unable to establish an affirmative defence to\n                        prove his innocence” (seeSahadevanat\n                            [36]). 75     On the basis of the evidence before the court,\n                    Yong CJ inSahadevanheld that the conviction was\n                    unsafe and set aside the conviction and the sentence. He stressed that\n                    “[i]n discharging this burden, it was not at all sufficient for the\n                    Prosecution to merely point to the inadequacies of the appellant’s\n                    testimony”.",
        "Conclusion": "76     The appellants’ case theory was that PW1\n                    and PW2 had fabricated the robbery and the alleged injuries to frame them due to\n                    disputes over prostitutes beginning with Jayasekara’s relationship with\n                    Nirasha. In arriving at my decision, it was strictly not necessary for me to\n                    determine the motive behind PW1’s and PW2’s complaint. In making my\n                    decision, the key consideration was the fundamental principle of law which\n                    requires the Prosecution to prove the charges beyond a reasonable doubt. Having\n                    examined the evidence carefully and assessed the case in its entirety, it was\n                    evidently clear that, this was a classic case of the DJreversingthe burden of proof and convicting the appellants\n                    simply because he found various aspects of the appellants’ evidence to be\n                    implausible. From the material inconsistencies found in the Prosecution’s\n                    evidence, the manifest lack of independent corroborative evidence to support the\n                    Prosecution’s case, and the inherently incredulous aspects in the\n                    Prosecution’s version of events, the Prosecution had clearly failed to\n                    prove its case against the appellants beyond a reasonable doubt. 77     I was mindful of the limited situations under\n                    which an appellate court will disturb the findings of fact by the trial judge.\n                    However in this case, the DJ not only misdirected himself on the crucial\n                    question on burden of proof, he also failed to provide any proper basis for his\n                    determination that PW1’s and PW2’s evidence were “unshaken”. Given the absence of any reasoning by\n                    the DJ, the appellate court was free to form its own independent opinion about\n                    the proper inference to be drawn from the evidence before me. 78     For the reasons above, I find the convictions\n                    to be unsafe and accordingly, I allow the appeal and set aside the convictions\n                    and sentences. 79     In arriving at my decision, I was greatly\n                    assisted by Mr Fernando and Mr Lam, counsel for the appellants who pursued the\n                    appeal before me with vigour, passion and conviction. I commend them for theirpro-bonowork.  [note: 1]Record of Proceedings (“ROP”) at\n                            355. [note: 2]ROP at 453. [note: 3]Ibid. [note: 4]See district\n                                judge’s Grounds of Decision at [41]. [note: 5]Ibidat\n                                    [38]. [note: 6]ROP at 110 – 111. [note: 7]ROP at\n                                89. [note: 8]ROP at 92. [note: 9]ROP at 89 and 132. [note: 10]ROP at 191. [note: 11]ROP at 289 –\n                    290. [note: 12]ROP at 269. [note: 13]ROP at 247 –\n                        248. [note: 14]ROP at 241D to\n                        242A. [note: 15]ROP at 275 to 276. [note: 16]ROP at 291 – 292. [note: 17]ROP at\n                    263. [note: 18]Final\n                                Submissions and Bundle of Authorities of the First Accused dated 24\n                                May 2010 at p 20. [note: 19]Skeletal Arguments for the\n                                    1stAppellant dated 9 November 2010\n                                at [76]. [note: 20]Minute Sheet of MA 215 of 2010 and MA\n                                216 of 2010 dated 19 November 2010 at p 3. [note: 21]ROP at\n                    194. [note: 22]ROP at 292. [note: 23]ROP at\n                                293. [note: 24]ROP at 315. [note: 25]ROP at 419\n                                – 420. [note: 26]Ibid. [note: 27]ROP at 255. [note: 28]ROP at 285. [note: 29]See district judge’s Grounds of Decision at\n                                    [26] –\n                                [27]. [note: 30]ROP at 193. [note: 31]ROP at 194. [note: 32]ROP at 156. [note: 33]ROP at\n                                97. [note: 34]ROP at 101. [note: 35]ROP at\n                                183. [note: 36]ROP at 93. [note: 37]ROP at 183. [note: 38]ROP at\n                                114. [note: 39]ROP at 31. [note: 40]ROP at 142\n                                – 143. [note: 41]ROP at\n                                47. [note: 42]ROP at\n                                122. [note: 43]Ibid. [note: 44]ROP at 51 – 52. [note: 45]ROP at 34 and\n                        42. [note: 46]ROP at\n                    43. [note: 47]See\n                                    Exhibit D2."
    }
}