{
    "case_title": "Tan Teck Boon\n      v\n      Lee Gim Siong and others",
    "ncitation": "[2011] SGHC 169",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "Introduction": "1       This was an appeal to a judge in chambers in\n                    Registrar’s Appeal No 115 of 2011 (“the Appeal”) by the\n                    first to third defendantsvizLee Gim Siong, Oh\n                    Geok Chuan and Richland Logistics Services Pte Ltd respectively (“the\n                    Appellants”) against the award of damages made by an Assistant Registrar\n                    (“the AR”) in favour of Tan Teck Boon (“the\n                    plaintiff”). The AR had on 31 March 2011 awarded damages to the plaintiff\n                    for: (a)pain and suffering -- $55,000;(b)future medical expenses --\n                        $10,800;(c)future transport expenses -- $400;(d)loss of future earnings --\n                        $214,613;(e)loss of earning capacity --\n                        $30,000;(f)pre-trial loss of earnings --\n                        $117,271;(g)pre-trial costs for nursing and care --\n                            $12,400;(h)pre-trial medical expenses (agreed) --\n                            $8,203;(i)pre-trial transport expenses (agreed) --\n                            $1,911.30.2       The Appellants appealed to reverse or reduce the\n                    damages awarded for:-(a)loss of future earnings\n                        ($214,613);(b)loss of earning capacity ($30,000);\n                        and(c)loss of pre-trial earnings\n                        ($117,271).3       The other damages awarded by the AR (which\n                    totalled $88,714.30) were not disputed and partial payments were made to the\n                    plaintiff in two tranches on 14 August 2009 and on 27 October 2010\n                    respectively.The factsThe background4       The plaintiff’s injuries stemmed from a\n                    traffic accident with the Appellants on 26 December 2006 which involved the\n                    plaintiff’s motor vehicle and the vehicles driven by the first and second\n                    defendants. The plaintiff sued for his injuries which included fractures to his\n                    right thigh bone, right forearm and left wrist. On 14 December 2009,\n                    interlocutory judgment by consent was entered for the plaintiff against the\n                    Appellants in the proportion of 90% and 10% for the first defendant and jointly\n                    against the second/third defendants respectively.The undisputed facts regarding the plaintiff5       The plaintiff was born in 1977 and was 33 years\n                    of age at the date of assessment. He was/is the sole-proprietor of Tom Express\n                    which is a courier business. Under a “DHL Owner Operator\n                    Agreement” made with DHL Express (Singapore) Pte Ltd\n                    (“DHL”), Tom Express provided express transport services for DHL\n                    over certain routes (“the DHL Agreement”). The DHL Agreement was\n                    given to ex-employees of DHL to run their own business of delivering goods and\n                    documents for DHL. The plaintiff started operating Tom Express in September 2005\n                    and hepersonallycarried out courier assignments\n                    in the Changi South Lane and Bedok North areas. He also paid one Ahmadkalil Bin\n                    Mohamed (“Ahmadkalil”) to carry out courier assignments within the\n                    Tampines Central area.6       The plaintiff would occasionally rely on a\n                    company called i.Logistics Pte Ltd if he or Ahmadkalil were not available to\n                    complete the assigned jobs. After the accident in December 2006, the plaintiff\n                    was unable to personally make courier deliveries and took on what the Appellants\n                    described as a “more managerial role in the\n                business”.7       It was not disputed that the plaintiff’s\n                    business had grown and he was earning more than he did before the accident. From\n                    his tax returns, it was not disputed that the profits earned by Tom Express was\n                    the plaintiff’s only source of income. The table below tabulates the net\n                    profit of Tom Express over the last 5 years:YearFull-Time WorkersPart-time/ad hoc\n                                    servicesProfit2005 (Sept to Dec)PlaintiffAhmadkalili.Logistics Pte LtdGross profit: $37,278Business\n                                            expenses: $28,446Net\n                                                profit: $8,8322006 (Accident happened in\n                                        Dec)PlaintiffAhmadkalili.Logistics Pte LtdTay Buah\n                                            PohGross profit: $131,929Business expenses: $89,356Net profit:\n                                        $42,5732007AhmadkalilNeo Say\n                                            SeongTay Buah Pohi.Supplies Pte\n                                            LtdGross profit: $161,118Business expenses: $117,850Net profit:\n                                        $43,2682008AhmadkalilNeo Say\n                                            SeongGomes Jason Rene\n                                            (“Gomes”)i.Supplies Pte LtdGross profit: $201,974Business expenses: $149,390Net profit:\n                                        $52,5842009AhmadkalilNeo Say\n                                            SeongGomesi.Supplies Pte LtdGross profit: $214,974Business expenses: $161,209Net profit:\n                                        $53,765The disputed facts regarding the extent of the plaintiff’s\n                recovery8       The injuries suffered by the plaintiff were not\n                    disputed. The medical report of his treating doctor, David Paul Bell (“Dr\n                    Bell”), dated 27 March 2009, stated that the plaintiff underwent surgery\n                    for the following injuries:-(a)closed fracture of the shaft of the right\n                            femur;(b)closed fracture of the right ulna;\n                        and(c)closed fracture of the left distal\n                        radius.The AR noted (at [3] of her\n                    Grounds of Decision [the GD”]) that the plaintiff was discharged from\n                    hospital on 3 January 2007 but had two further surgeries for revision of\n                    fixation and bone grafting on 22 February 2007 and 3 October\n                    2007.9       The plaintiff was given hospitalisation leave\n                    continuously from 26 December 2006 to 14 September 2010. Besides\n                    several surgical scars on his right forearm, left wrist, both hips and right\n                    knee caps, the plaintiff suffered residual pain in his right groin (also\n                    referred to as his right inner thigh) and left wrist. His right leg was also\n                    shortened by 1cm.10     The dispute between the parties centred on theextentof the plaintiff’s recovery from\n                    his injuries. The Appellants argued that the plaintiff may need to rely on pain\n                    medication intermittently, but he had recovered uneventfully from his injuries\n                    andcould return to courier work even though he may require\n                        assistance to carry heavy loads. The plaintiff’s position\n                    was that the pain in his right thighprevented him from\n                        continuing to personally carry out courier assignments. The AR\n                    (at [7] of her GD) preferred the opinion\n                    of the plaintiff’s two experts and agreed that he could no longer carry\n                    out courier assignments personally. The Appellants did not appeal against this\n                    finding and it was on the basis that the plaintiff could no longer carry out\n                    courier assignments personally that the loss of pre-trial earnings, loss of\n                    future earnings and loss of earning capacity were assessed.The decision below(i)   Loss of pre-trial earnings11     The AR in her GD, citingChai Kang Wei Samuel v Shaw Linda Gillian[2010]\n                    3 SLR 587 at [29]\n                        (“Chai Kang Wei Samuel”), did\n                    not find it necessary for the plaintiff to prove his business had suffered loss\n                    after his accident in order for him to claim pre-trial loss of earnings. She\n                    found that if the accident had not happened, the plaintiff would have continued\n                    to personally carry out deliveries and would not have needed to pay others to\n                    cover his courier work. In order to put him in the position he had been before\n                    the accident, the AR held that the plaintiff should be compensated for the cost\n                    of paying someone to do his work. The AR then rejected the Appellants’\n                    argument that the plaintiff was not entitled to a claim for loss of earnings\n                    because the profitability of his business increased.12     The plaintiff claimed a total of $146,661 for\n                    loss of pre-trial earnings - $117,271 paid to Neo Say Seong\n                    (“Neo”) and $29,390 paid to i.Supplies Pte Ltd\n                    (“i.Supplies”) to carry out courier assignments on his behalf from\n                    January 2007 to October 2010. The AR only allowed the plaintiff to recover the\n                    sum ($117,271) paid to Neo. The AR found that on the evidence i.Supplies was\n                    hired only when Neo was unable to carry out deliveries and the plaintiff had\n                    conceded that even before the accident, he would hire someone else to take on\n                    his duties during the times he could not report for work. The AR found it\n                    unbelievable that the plaintiff would have “singlehandedly” been\n                    able to do all the work Neo and i.Supplies did (see [41] of the GD).(ii)   Loss of future earnings13     The AR rejected the Appellants’\n                    submission that the plaintiff did not suffer any drop in his assessable income\n                    since his income increased after the accident. The AR stressed again that\n                    “what was important was that but for the accident, the plaintiff could\n                    have earned even more by carrying out courier assignments himself rather than\n                    paying Neo to do so on his behalf” ([44] of the GD).14     The AR also rejected the Appellants’\n                    submission that the plaintiff could still personally deliver the goods, albeit\n                    at a slightly reduced capacity with light loads. The AR found that an award of\n                    loss of future earnings appropriate because there was sufficient evidence before\n                    her to fix a multiplier and multiplicand.15     The AR awarded $214,613 for the loss of future\n                    earnings using as the multiplicand, the average of Neo’s annual pay in\n                    2008 and 2009viz$30,659. For the multiplier, the\n                    AR found that “[b]ut for the uncertainties introduced by the accident,\n                    there was every indication that the plaintiff would continue as a contractor for\n                    DHL using Tom Express” (GD at [50]). The AR found that the\n                    plaintiff’s age (33) was not the only factor to be taken into account\n                    because as a sole-proprietor of a business, there was no fixed retirement age.\n                    The AR also found that the “profit and loss statements of Tom Express\n                    showed that the costs of the business were high, with certain items of expense\n                    appearing obviously inflated and not supported by any documentary\n                    evidence” (GD at [50]). The AR reduced the plaintiff’s multiplier\n                    of 15 to 7.(iii)   Loss of earning capacity16     The AR was satisfied that loss of earning\n                    capacity could also be awarded in this case – based on the evidence, there\n                    was a real risk that the plaintiff, because of his injuries, could lose his\n                    contract with DHL before the estimated end of his working life. The contract\n                    with DHL was Tom Express’ sole business. If Tom Express lost that\n                    contract, the plaintiff’s ability to compete in the labour market would\n                    certainly be diminished whether he chose to continue running Tom Express and\n                    seek alternative sources of business, or look for a different job. The AR noted\n                    that because of the plaintiff’s inability to personally carry out courier\n                    assignments, Tom Express would naturally have higher costs than its competitors\n                    because it would always have to pay for one additional courier. The plaintiff\n                    would suffer from having little opportunity for physical contact with his\n                    customers. The plaintiff was also disadvantaged by being limited to sedentary\n                    occupations and having only primary school qualifications. The AR gave a lump\n                    sum award of $30,000 for the plaintiff’s loss of earning\n                capacity.The issues in the Appeal17     Broadly, did the AR err in law or fact in her\n                    awards for:-(a)loss of pre-trial earnings;(b)loss of future earnings; and(c)loss of earning capacity?Principles applicable to appeals on assessment of damages18     The Court of Appeal inSingapore Airlines Ltd v Tan Shwu Leng[2001] 3 SLR(R) 439 made\n                    it clear that the judge was not constrained by the principles set out inDavies v Powell Duffryn Associated Colleries[1942] AC 601 when considering an appeal on assessment of damages in a\n                    Registrar’s Appeal. The Court of Appeal held at [17] that all appeals from a Registrar to a\n                    judge in chambers were dealt with by an actual rehearing of the application and\n                    the judge was entitled to treat the matter as if it came before him or her for\n                    the first time.(i)   Did the AR err in law or fact in her award for loss of\n                pre-trial earnings?19     The assessment was conducted by the AR over 6\n                    days - 1 to 3 November 2010, 3 to 4 January 2011 and 6 January 2011. Pre-trial\n                    loss of earnings is an item of special damages and needs to be specifically\n                    proven to be recoverable (Wee Sia Tian v Long Thik\n                        Boon[1996] 3 SLR(R) 513 at 517F). The critical\n                    question to answer is, was the plaintiff’s cost of hiring a replacement to\n                    cover his courier assignments from the time of his accident to the date of\n                    assessment a real assessable loss proven by the evidence, notwithstanding that\n                    the plaintiff’s business actually increased in\n                profitability?20     The Appellants argued that the plaintiff had\n                    failed to prove any real assessable drop in earnings because his income actually\n                    increased during the period between the time of accident and the date of\n                    assessment. The Appellants disagreed that his earnings were affected by the sum\n                    total of what he paid an extra worker to do on his behalf. The AR had rejected\n                    the Appellants’ argument that loss of pre-trial earnings can only be\n                    calculated by comparing what the plaintiff earned pre-accident and what he\n                    earned post-accident. The AR cited the proposition inChai\n                        Kang Wei Samuelat [29]\n                    that:The overarching objective of awarding damages is tocompensatethe injured victim by restoring him or her to the\n                        position that he or she would have been (in a monetary sense) had the\n                        accident not happened.(emphasis in original)21     The Appellants had argued that this\n                    proposition was used in the context of loss of future earnings and should not be\n                    applied for pre-trial loss of earnings. This argument of the Appellants is\n                    flawed. While the proposition was used inChai Kang Wei\n                        Samuelin the context of loss of future earnings, the proposition\n                    being applied is clearly ageneralprinciple\n                    embodying the compensatory purpose of damages in personal injuries as stated by\n                    Lord Blackburn inLivingstone v Raywards Coal Co(1880) 5 App Cas 25 at 39:…where any injury is to be compensated by damages, in settling the\n                        sum of money to be given for reparation of damagesyou\n                            should nearly as possible get at that sum of money which will put the\n                            party who has been injured, or who has suffered, in the same position as\n                            he would have been if he had not sustained the wrongfor\n                        which he is now getting his compensation or reparation.(emphasis added)22     InChai Kang Wei\n                        Samuel, the claimant’s post-accident income was slightly\n                    more than her average yearly income pre-accident. However, the Court of Appeal\n                    held at [28] that it would be wholly\n                    inequitable to hold that the victim suffered no loss just because her\n                    post-accident income was slightly more than her average yearly income\n                    pre-accident. The injury had affected the number of hours the claimant was able\n                    to work and a more accurate reflection of her loss was the actual number of\n                    hours she had worked before the accident multiplied by the actual rate she was\n                    earning after the accident (since the rate was normally higher with inflation\n                    and her greater experience).23     In the present case, the AR held that to put\n                    the plaintiff in the position he had been before the accident meant that he\n                    should be compensated for the cost of paying someone to do his work, regardless\n                    of the increased profitability of his business. For sole proprietorship cases, I\n                    am of the view that the nature of the claimant’s job should be carefully\n                    examined. The AR’s reasoning was based on her assumption that to place the\n                    plaintiff in the position he was in before the accident, he should be\n                    compensated for having to hire another driver to replace him in his driving\n                    role. However, the difficulty in assessing the plaintiff’s damages was due\n                    to the fact that he haddualroles – acting\n                    both in amanagerialandoperational(iedriving) capacity\n                    for Tom Express. The Appellants would not be wrong in arguing that it is\n                    possible Tom Express became more profitable because the plaintiff was focusing\n                    his energies more fully on his managerial role. The problem with calculating\n                    loss of earnings and profits in a sole proprietorship context is that there are\n                    many uncertain contingencies that will affect the final profits of a business.\n                    These are valid concerns in assessing pre-trial loss of earnings for the\n                    plaintiff.24     The AR did not refer to other cases besidesChai Kang Wei Samuelin her analysis of\n                    pre-trial loss of earnings. Neither did the parties submit any authorities with\n                    similar facts on point where the Court had awarded loss of pre-trial earnings\n                    despite the victim’s business being more profitable. In this regard, the\n                    English Court of Appeal case ofPhillips v Holliday &\n                        ANR[2001] EWCA Civ 1074 (“Phillips v Holliday”) is particularly useful. InPhillips v Holliday, the claimant was awarded\n                    loss of pre-trial earnings despite his business being more profitable. The\n                    claimant worked for a company both administratively (as a contracts manager) and\n                    manually (painter and decorator). The Court of Appeal treated the profits of the\n                    company as the claimant’s own, as the company was owned fully by the\n                    claimant’s wife with the wife also being the sole director of the company.\n                    Similar to our case, the Court of Appeal found that the claimant’s\n                    injuries severely limited his ability to carry out the manual work he used to be\n                    able to do for the company as a painter and decorator and he could only carry\n                    out administrative work. Most pertinently, the Court of Appeal held at [20] that:… the fact that the claimant has made a success of the business as\n                        an administrator and supervisordoes not mean either that\n                            he might not have been more successful if able to do much of the manual\n                            work himself…[emphasis added].25     The Court of Appeal also addressed another\n                    valid concern in our case at [25]\n                    of:…the fact that the claimant had worked in a\n                            managerial capacity after the accident. How then should that fact be\n                            reflected in this estimate of damages?One would think that\n                        if the claimant was able to spend more time on the administration side of\n                        the business, and if the business as was suggested by the claimant was\n                        growing, then profits would increase as in fact they did.[emphasis added]26     The Court of Appeal recognised that the\n                    inability of the claimant to carry out the manual work that he used to do wasa losseven if the company had an increase in\n                    profit at [30]:The profits then picked up,but if the company would be\n                            having to pay painters to do the work the claimant could otherwise have\n                            done, it is likely that the profitability was not as great as it should\n                            be. If the figure of £269 were made a net figure of say\n                        £200 [the evidence was that the claimant was taking from the business a\n                        figure of around £269 immediately prior to the accident]and if a deduction is made in accordance with the figures shown\n                            in the schedule to Mr Mould’s report (page 118) as those which he\n                            should have earned as an administrator, then on my\n                        calculation one reaches a figure of £18,748 as the loss between\n                        accident and trial.[emphasis added]27     It is also important to consider how the Court\n                    of Appeal inPhillips v Hollidaydistinguished the\n                    case ofAshcroft v Curtin[1971]\n                    1 WLR 1731 (“Ashcroft v\n                    Curtin”) at [30]:This does not seem to me to be a case likeAshcroft v\n                            Curtin[1971] 1 WLR 1731 CA in which the Court of Appeal felt\n                        driven to hold that the records of a business were such that there was\n                        simply no basis for making a calculation. This is a case where albeit it is\n                        difficult to make a calculation the starting point is there and the court\n                        should strive to make a proper deduction in order to reach an appropriate\n                        figure.28     InAshcroft v\n                        Curtin, the claimant was a skilled engineer who carried a\n                    successful business through a private company of which he was the active\n                    managing director. The profits of the company had declined but the claimant had\n                    failed to claim loss of profits owing to his disabilities because the\n                    company’s accounts were unreliable. The Court of Appeal inAshcroft v Curtinhad made an observation that may be\n                    helpful to the present case:But I am very doubtful about the validity of this approach,for if another man had been engaged to do the plaintiff’s\n                            pre-accident work, it does not follow that the profits would have gone\n                            down by the amount of his salary. On the contrary, I see the\n                        force of the observation of Mr. May that, as no\n                            other man was in fact engaged, it is irrelevant to consider what would\n                            have happened if he had been, so far from producing a drop in\n                        profitability, his engagement might equally well have led to a realisation\n                        of the 10 per cent increase which Mr. Boulter assumed would have enured\n                        but for the accident.[emphasis added]Theobiter dictainAshcroft v Curtinsuggests that the Court cannot assume that the\n                    profits may go down by the amount of salary used to hire the replacement for the\n                    pre-accident work, for the replacement may have cause the business to be more\n                    profitable. However, whatPhillips v Hollidayis\n                    stating is thateven if the business becomes more\n                        profitable, the profits could have been even greater if the\n                    claimant did not have to bear the additional cost of hiring the replacement for\n                    doing the work he could have done himself. To prevent over-compensation the\n                    Court of Appeal inPhillips v Hollidaywould then\n                    consider the appropriate deduction for the value of the claimant’s\n                    increased managerial role.29     Therefore, although the claimant inPhillips v Hollidaydid not claim for the expense of\n                    hiring someone to paint on his own behalf as in our case, in principle, the\n                    plaintiff can claim for the cost of paying someone to do his work despite the\n                    increase profits earned by Tom Express. On closer examination of the facts, the\n                    plaintiff had hospitalisation leave from the accident up to 14 September 2010\n                    – he clearly could not physically carry out the courier services he was\n                    contracted to do. He had to hire someone to deliver the goods on his personal\n                    route to maintain the contract with DHL. I note that the plaintiff’s\n                    contract with DHL in 2005 required him to provide two delivery men to carry out\n                    the work while his current contract with DHL requires him to employ at a minimum\n                    of 3 full time delivery men. However, Gee Say Liang (“Gee”), the\n                    manager of DHL had clarified at the assessment hearing that the decision to hire\n                    an extra driver and buy an extra van in 2008 was the plaintiff’s and had\n                    nothing to do with DHL:Q:Did DHL request the Plaintiff to top up his\n                            resources by hiring one extra courier and buying one extra van or was\n                            this decision made by the Plaintiff on his own? This is in\n                        2008.A:That decision was made by the Plaintiff but we sat\n                            down with him and we told him that your area is growing, if you think\n                            you can handle the growth by just maintaining 2 then that is fine, we\n                            are not forcing him to hire 1 extra man. But if he keeps to 2 and he\n                            cannot manage the business then that would affect his performance and\n                            the performance of the company. The decision was made by him – not\n                            something we forced onto him.30     On the evidence, I am of the view that the\n                    plaintiff has proven on a balance of probabilities that he had hired Neo to\n                    replace him in his courier assignments. The plaintiff had also testified that he\n                    had to hire a replacement driver to prevent his contract with DHL from being\n                    terminated. However, the AR was right in rejecting the plaintiff’s claim\n                    for the cost of hiring i.Supplies as pre-trial loss of earning. If the principle\n                    is to compensate the plaintiff for the cost of paying someone to dohis work, it is only reasonable to compensate him for\n                    the cost of the driver he hired to replace him. As the AR stated at GD [41], “[i]t seemed unbelievable that\n                    the plaintiff would have single-handedly been able to do all the work that Neo\n                    and i.Supplies did.”31     Even if I accept the $117,271.00 cost of\n                    hiring Neo from the period of accident to the date of assessment as pre-trial\n                    loss of earnings, the further question that needs to be asked and that was asked\n                    inPhillips v Hollidayis whether an appropriate\n                    deduction should be made for the fact that the plaintiff could take on\n                    additional managerial duties after the accident. The problem when the claimant\n                    used to occupy dual capacities (administrative/managerial and\n                    operational/manual) is the Court is naturally wary of over-compensating the\n                    claimant. InPhillips v Holliday, the Court of\n                    Appeal had data from which to deduct the appropriate amount for the\n                    claimant’s administrative work. In our case, we do not have such data and\n                    the plaintiff submitted that:[he] did not make any significant contribution to his business as his\n                        primary role prior to the accident was to be on the road and make the\n                        courier deliveries.His role post-accident did not evolve\n                            into anything more as there was never any significant or regular\n                            managerial duties to perform.[emphasis added]32     The evidence on record does provide support\n                    for the fact that the plaintiff’s role post-accident did not evolve into\n                    substantial managerial duties. His evidence was that he only needed to go back\n                    to the office to check on matters 4-5 times a year:Q:Am I correct to say that even though you had\n                            hospitalization leave up to 14 September 2010, and aside from the\n                            times you were in hospital for treatment, you had been able to run your\n                            business from accident to date as manager of Tom Express?A:I can run the business but I have nothing to do. At\n                            times I would go back to the office when there are complaints from\n                            customers. Where there is any problem DHL will deal directly with staff\n                            who is in my office. But they would prefer to deal directly with us than\n                            with my staff because they cannot communicate very well. I will go back\n                            to the office 4-5 times a year to settle the complaints. At other times\n                            I would go back to office to ensure things are going well, about once a\n                            month. I am very worried and scared that I will lose this agreement with\n                            DHL.Neo, the plaintiff’s driver, also supported the\n                    plaintiff’s evidence that the plaintiff only came to office a few times a\n                    year; Neo testified that:Q:How many times a year?A:[The Plaintiff] would come over whenever DHL holds\n                            meetings for contractors. This would be about 3-4 times a year. He would\n                            buy the refreshments and bring them over whenever there is such a\n                            meeting.…Q:In your daily work for Tom Express delivering for\n                            DHL, how often do you have to communicate with the\n                        Plaintiff?A:I do not have to communicate with him all the time.\n                            For e.g. where there are certain things brought up during courier\n                            meetings that we have to let him know I will update him.…Q:Based on what you said earlier, that the Plaintiff\n                            goes for 3-4 contractors’ meetings and sometimes he has\n                            instructions. How many times a year does he convey instructions to\n                            you?A:Twice.Gee also testified that the plaintiff only had to attend monthly\n                    meetings with DHL:Q:You meet the Plaintiff 3-4 times a\n                        year?A:More than that. We have monthly meetings at least\n                            once a month with all our contractors. That is when we go through\n                            performance reviews with them. Monthly meeting to find out if there are\n                            any issues in the company.33     Tom Express was started only in 2005 and while\n                    the business had expanded from 2 to 3 drivers and two lorries, the business is\n                    admittedly still small-scale. In the circumstances, any additional value of the\n                    plaintiff’s administrative work from the date of accident to the\n                    assessment would likely be nominal. It would be fair to award him the sum of\n                    $117,271 as pre-trial loss of earnings for the cost of hiring Neo without any\n                    deduction for administrative work. Accordingly, I uphold the AR’s award\n                    for pre-trial loss of earnings.(ii)   Did the AR err in law or fact in her award for loss of\n                future earnings?34     The AR’s reasoning for this award was\n                    similar to her reasoning for pre-trial loss of earnings. At [44] of the GD, the AR said:…what was important was that but for the accident, the Plaintiff\n                        could have earned even more by carrying out courier assignments himself\n                        rather than paying Neo to do so on his behalf. In my judgment, the Plaintiff\n                        was unlikely to be able to return to carrying out courier assignments\n                        personally in the near future and would continue to need to hire someone to\n                        cover him.The AR also found that there was sufficient evidence before her to fix\n                    a multiplier and multiplicand to award the Plaintiff loss of future\n                    earnings.35     InPhillips v\n                        Holliday, the Court of Appeal had also awarded loss of future\n                    earnings to the claimant at [33]:By being able to spend more time on administration and supervision it\n                        seems at least that the business has improved from the pre-accident\n                        position.It might however have improved further if the\n                            claimant had been able to do more manual workand there is no\n                        doubt that if the business does not flourish the claimant is at a serious\n                        disadvantage in the labour market. The claimant is entitled to damages to\n                        reflect both aspects.[emphasis added]The Court of Appeal had also added at [34] that “[t]he next question is what deduction should\n                    be made for the fact thatmoney will still be paid out to the\n                        claimant albeit his role will be that of administratorand the\n                    manual work that he can do will be much more limited”. Previously for\n                    pre-trial loss of earnings, the concern was also that the claimant may be\n                    overcompensated if there was no appropriate deduction for the value of the\n                    claimant’s increased capacity for managerial work. It was noted that the\n                    Court of Appeal inPhillips v Hollidayawarded a\n                    sum for loss of future earnings and loss of earning capacity together, but it\n                    would be more appropriate to assess them separately in this case.36     I believe from her GD that the AR may have not\n                    fully considered the aspect of deducting the value of the plaintiff’s\n                    increased managerial role after the accident. For pre-trial loss of earnings,\n                    the evidence did show that the plaintiff’s administrative work did not\n                    change substantially from what he carried out pre-accident. However, in light of\n                    the fact that the plaintiff’s business is expanding and increasing in\n                    profits, it would be unsafe to assume that in future he will always be a full\n                    time driver for his company concurrently with his increasing managerial\n                    role.37     A number of local cases of claimants in sole\n                    proprietorships may provide some guidance. InWong Kim Lan v\n                        Christie Kolandasamy[2004] SGDC 234 (“Wong Kim Lan”), the District Court awarded a sole\n                    proprietor a sum of $45,000 for loss of earning capacity. The sole proprietor\n                    designed jewellery for manufacture within her own factories and recommended\n                    designs to customers. The Court drew an adverse inference against the sole\n                    proprietor and held that she had earned more after the accident because she\n                    failed to produce evidence to prove her post-accident income. Although the sole\n                    proprietor hired more designers to assist her in her work, she did not claim as\n                    in the present case that she should be compensated for the additional cost of\n                    designers and therefore there was also no evidence provided for this aspect. A\n                    key distinguishing factor ofWong Kim Lanfrom the\n                    present case is that the business of the sole proprietor there was on a much\n                    larger scale than the plaintiff’s -- her business had grown from 5 in\n                    Singapore and 200 in China to 10 in Singapore and 300 in China.Wong Kim Lanwould be a situation where it was so clear\n                    that the claimant was more profitable in his or her managerial role that the\n                    appropriate deduction of the claimant’s managerial work would likely leave\n                    no claim left for loss of future earnings.38     InKoh Soon Pheng v Tan Kah\n                        Eng[2003] 2 SLR(R) 538 (“Koh\n                        Soon Pheng”), the High Court upheld an AR’s award of\n                    $180,000 for loss of earning capacity to a 42 year old sole-proprietor who owned\n                    a motorcycle workshop and whose specific skill was to repair large motorcycles\n                    with high capacity engines. The High Court had upheld the AR’s award for\n                    loss of earning capacity instead of loss of future earnings as the High Court\n                    had found that it was too speculative to determine how well the claimant’s\n                    business would perform in future. It is noteworthy that the Court stated at\n                        [17]:No doubt the plaintiff would earn a little less because\n                            he would have to incur wages which would not have been payable had he\n                            remained able to do the work on his own, but this does not\n                        mean that the plaintiff’s business cannot still be brought back to a\n                        profitable situation.[emphasis added]While the Court recognised the loss of earnings similar to the present\n                    case when the claimant had to hire someone to do the work he used to do, no\n                    award was made since the claimant there did not actually claim to have hired\n                    someone to supplement his reduced working abilities. InKoh\n                        Soon Pheng, the business was also making losses.39     InAng Leng Hock v Leo Ee\n                        Ah[2004] 2 SLR(R) 361 (“Ang\n                        Leng Hock”) , the claimant was an independent contractor\n                    for Grand Court providing services for outdoor catering functions. He was\n                    awarded loss of earning capacity at a multiplicand of $1,100 with a multiplier\n                    of 10 to compensate for his injury that prevented him from being able to carry\n                    heavy loads. The multiplicand of $1,100 was to reflect the cost of hiring a\n                    worker to help the claimant carry heavy loads. The plaintiff relied on this case\n                    to support his claim for loss of future earnings. However, while it was clear inAng Leng Hockthat the award would compensate\n                    for the claimant’s inability to carry heavy loads in his job, the\n                    plaintiff would still need to prove that he needed to be compensated as afull timedriver of Tom Express despite his\n                    increased managerial role.40     On an examination of the other cases, it is\n                    clear that the award in each case was confined to the specific facts and\n                    evidence produced before the Court, because the Court would be unable to award\n                    loss of future earnings when it cannot fix a proper multiplicand and multiplier.\n                    The Court must also be wary of the fact that some of the older cases beforeChai Kang Wei Samueloperated on the premise\n                    that loss of future earnings and loss of earning capacity were awarded asalternativesand did not see them as\n                    conceptually distinct heads of damages.41     The plaintiff had claimed before the AR a sum\n                    of $495,000 for loss of future earnings based on Neo’s monthly fees of\n                    $2,750 as a multiplicand and a multiplier of 15 years, taking into account the\n                    plaintiff’s young age of 33 at the time of assessment. The AR had averaged\n                    the figures of Neo’s annual pay in 2008 and 2009 to a multiplicand of\n                    $30,659. The AR had then considered the inevitable business fluctuations of the\n                    plaintiff’s business and the fact that “the profit and loss\n                    statements of Tom Express showed that the costs of the business were high, with\n                    certain items of expense appearing obviously inflated and not supported by any\n                    documentary evidence” ([50] of the GD) to reduce the multiplier submitted\n                    by the plaintiff by half to 7. The AR awarded the plaintiff $214,613 for loss of\n                    future earnings.42     The basis for using the average figures of\n                    Neo’s annual pay in 2008 and 2009 as the multiplicand would not reflect\n                    what loss of future earnings is meant to compensate. If loss of future earnings\n                    is to compensate the plaintiff for his additional expense of always having to\n                    hire an additional courier to do the work he used to carry out personally, it\n                    would be more logical on the evidence provided to take the average annual salary\n                    of the drivers in the plaintiff’s business. The plaintiff had 3 drivers\n                    and Neo’s monthly salary used to be the highest of all the 3 drivers until\n                    Ahmadkalil had a raise in May 2010. The figures are set out below:NoDriverAnnual Salary in 2008Annual Salary in 20091Ahmadkalil$32,400$32,4002Gomes (only hired in October\n                                        2008)-$30,0003Neo$31,403$29,915Only the annual salary for 2008 and 2009 was taken as there was\n                    insufficient evidence to calculate the annual salaries of the drives for 2010. I\n                    am of the view that the appropriate multiplicand (averaging the annual salary of\n                    all 3 drivers for 2008 and 2009) would be $31,223.60.43     The parties did not submit that the award for\n                    loss of future earnings should be reduced by income tax payable and the\n                    AR’s award did not deduct any income tax. I believe it should and a fair\n                    deduction to reflect the income tax for the plaintiff’s income bracket\n                    would be $2,000 from the multiplicand. Therefore, making the appropriate\n                    reduction for the plaintiff’s income tax, I find that the multiplicand for\n                    loss of future earnings should be $29,223.60.44     While the AR reduced the multiplier to take\n                    account of the inevitable fluctuations in the business of Tom Express and the\n                    inflated expenses of plaintiff’s business accounts, she did not make the\n                    appropriate deduction for the value received by the plaintiff in carrying out a\n                    greater managerial role in Tom Express. Due weight should have been given to the\n                    fact that the plaintiff had always performeddualroles (both managerial and operational) and the reality of the business was that\n                    it had grown from a 2 man 1 vehicle sole-proprietorship to one having 3 drivers\n                    and 2 lorries with the evidence suggesting that it was likely to grow further in\n                    the future. Hence, the necessary and appropriate deduction for the value of the\n                    plaintiff’s increased capacity for managerial work in future would be to\n                    reduce the multiplier to 3. This would more fairly reflect what the plaintiff\n                    had actually lost. I therefore reduce the AR’s award for loss of future\n                    earnings to $87,670.80.(iii)   Did the AR err in law or fact in her award for loss of\n                earning capacity?45     The Appellant submitted that the plaintiff at\n                    the hearing below did not submit on a claim for loss of earning capacity in\n                    addition to an award for loss of future earnings. This is not entirely correct\n                    as the plaintiff’s submissions below did argue for an award of loss of\n                    earning capacity as in the alternative to loss of future earnings. Furthermore,\n                    since an award for loss of earning capacity is part of general damages, it need\n                    not be specifically pleaded. The plaintiff had submitted that:[h]ad the [AR] awarded a multiplier closer to 15, the Plaintiff would\n                        agree that the award for loss of earning capacity would have been excessive\n                        and overlapping with the award for loss of future earnings.46     I am of the view that the AR applied the\n                    correct legal test for an award for loss of earning capacity – and had\n                    carefully assessed if (i) there was a substantial or real risk that the\n                    plaintiff would lose his present job at some time or before the estimated end of\n                    his working life and (ii) whether the plaintiff would be disadvantaged in the\n                    open employment market because of his injuries. The evidence did support the\n                    plaintiff’s contention that there was a real risk that he would lose the\n                    ability to sustain Tom Express. His business was highly dependent on his\n                    contract with DHL and Gee of DHL had testified that the plaintiff’s\n                    inability to personally drive and meet customers would be a factor relevant in\n                    the renewal of the DHL contract. However, the AR was right in assessing this\n                    risk conservatively as it was undisputed that DHL had renewed the\n                    plaintiff’s contract twice after the accident, despite the fact that the\n                    plaintiff could no longer personally delivery the goods.47     If the plaintiff was unable to run Tom Express\n                    and had to seek alternative employment, he would be seriously disadvantaged as\n                    he has been a driver all his life. However, he would not be able to tap on his\n                    driving experience whilst his highest educational qualification was only\n                    completion of his primary school examinations. Any sedentary job the plaintiff\n                    could manage to get in the open market would pay him far below what he was\n                    earning now. Consequently, the AR’s lump sum award of $30,000 for loss of\n                    earning capacity was fair and is accordingly upheld.Conclusion48     While I accept that the AR’s award for\n                    pre-trial loss of earnings and loss of earning capacity should be upheld, her\n                    award for loss of future earnings should be reduced from $214,613 to $\n                    87,670.80.49     Although the award to the plaintiff for loss\n                    of future earnings has been substantially reduced, I note that the Appellants\n                    have only succeeded on one of their three main grounds of appeal. Consequently,\n                    although they are entitled to costs of the Appeal, I reduce the costs to the\n                    Appellants by two-thirds from $3,000 to $1,000 but with disbursements to them on\n                    a reimbursement basis. I will not disturb the costs order made\n                below.",
        "The facts": "",
        "The background": "4       The plaintiff’s injuries stemmed from a\n                    traffic accident with the Appellants on 26 December 2006 which involved the\n                    plaintiff’s motor vehicle and the vehicles driven by the first and second\n                    defendants. The plaintiff sued for his injuries which included fractures to his\n                    right thigh bone, right forearm and left wrist. On 14 December 2009,\n                    interlocutory judgment by consent was entered for the plaintiff against the\n                    Appellants in the proportion of 90% and 10% for the first defendant and jointly\n                    against the second/third defendants respectively.",
        "The undisputed facts regarding the plaintiff": "5       The plaintiff was born in 1977 and was 33 years\n                    of age at the date of assessment. He was/is the sole-proprietor of Tom Express\n                    which is a courier business. Under a “DHL Owner Operator\n                    Agreement” made with DHL Express (Singapore) Pte Ltd\n                    (“DHL”), Tom Express provided express transport services for DHL\n                    over certain routes (“the DHL Agreement”). The DHL Agreement was\n                    given to ex-employees of DHL to run their own business of delivering goods and\n                    documents for DHL. The plaintiff started operating Tom Express in September 2005\n                    and hepersonallycarried out courier assignments\n                    in the Changi South Lane and Bedok North areas. He also paid one Ahmadkalil Bin\n                    Mohamed (“Ahmadkalil”) to carry out courier assignments within the\n                    Tampines Central area. 6       The plaintiff would occasionally rely on a\n                    company called i.Logistics Pte Ltd if he or Ahmadkalil were not available to\n                    complete the assigned jobs. After the accident in December 2006, the plaintiff\n                    was unable to personally make courier deliveries and took on what the Appellants\n                    described as a “more managerial role in the\n                business”. 7       It was not disputed that the plaintiff’s\n                    business had grown and he was earning more than he did before the accident. From\n                    his tax returns, it was not disputed that the profits earned by Tom Express was\n                    the plaintiff’s only source of income. The table below tabulates the net\n                    profit of Tom Express over the last 5 years: YearFull-Time WorkersPart-time/ad hoc\n                                    servicesProfit2005 (Sept to Dec)PlaintiffAhmadkalili.Logistics Pte LtdGross profit: $37,278Business\n                                            expenses: $28,446Net\n                                                profit: $8,8322006 (Accident happened in\n                                        Dec)PlaintiffAhmadkalili.Logistics Pte LtdTay Buah\n                                            PohGross profit: $131,929Business expenses: $89,356Net profit:\n                                        $42,5732007AhmadkalilNeo Say\n                                            SeongTay Buah Pohi.Supplies Pte\n                                            LtdGross profit: $161,118Business expenses: $117,850Net profit:\n                                        $43,2682008AhmadkalilNeo Say\n                                            SeongGomes Jason Rene\n                                            (“Gomes”)i.Supplies Pte LtdGross profit: $201,974Business expenses: $149,390Net profit:\n                                        $52,5842009AhmadkalilNeo Say\n                                            SeongGomesi.Supplies Pte LtdGross profit: $214,974Business expenses: $161,209Net profit:\n                                        $53,765",
        "The disputed facts regarding the extent of the plaintiff’s\n                recovery": "8       The injuries suffered by the plaintiff were not\n                    disputed. The medical report of his treating doctor, David Paul Bell (“Dr\n                    Bell”), dated 27 March 2009, stated that the plaintiff underwent surgery\n                    for the following injuries:- (a)closed fracture of the shaft of the right\n                            femur;(b)closed fracture of the right ulna;\n                        and(c)closed fracture of the left distal\n                        radius.The AR noted (at [3] of her\n                    Grounds of Decision [the GD”]) that the plaintiff was discharged from\n                    hospital on 3 January 2007 but had two further surgeries for revision of\n                    fixation and bone grafting on 22 February 2007 and 3 October\n                    2007.9       The plaintiff was given hospitalisation leave\n                    continuously from 26 December 2006 to 14 September 2010. Besides\n                    several surgical scars on his right forearm, left wrist, both hips and right\n                    knee caps, the plaintiff suffered residual pain in his right groin (also\n                    referred to as his right inner thigh) and left wrist. His right leg was also\n                    shortened by 1cm.10     The dispute between the parties centred on theextentof the plaintiff’s recovery from\n                    his injuries. The Appellants argued that the plaintiff may need to rely on pain\n                    medication intermittently, but he had recovered uneventfully from his injuries\n                    andcould return to courier work even though he may require\n                        assistance to carry heavy loads. The plaintiff’s position\n                    was that the pain in his right thighprevented him from\n                        continuing to personally carry out courier assignments. The AR\n                    (at [7] of her GD) preferred the opinion\n                    of the plaintiff’s two experts and agreed that he could no longer carry\n                    out courier assignments personally. The Appellants did not appeal against this\n                    finding and it was on the basis that the plaintiff could no longer carry out\n                    courier assignments personally that the loss of pre-trial earnings, loss of\n                    future earnings and loss of earning capacity were assessed.The decision below(i)   Loss of pre-trial earnings11     The AR in her GD, citingChai Kang Wei Samuel v Shaw Linda Gillian[2010]\n                    3 SLR 587 at [29]\n                        (“Chai Kang Wei Samuel”), did\n                    not find it necessary for the plaintiff to prove his business had suffered loss\n                    after his accident in order for him to claim pre-trial loss of earnings. She\n                    found that if the accident had not happened, the plaintiff would have continued\n                    to personally carry out deliveries and would not have needed to pay others to\n                    cover his courier work. In order to put him in the position he had been before\n                    the accident, the AR held that the plaintiff should be compensated for the cost\n                    of paying someone to do his work. The AR then rejected the Appellants’\n                    argument that the plaintiff was not entitled to a claim for loss of earnings\n                    because the profitability of his business increased.12     The plaintiff claimed a total of $146,661 for\n                    loss of pre-trial earnings - $117,271 paid to Neo Say Seong\n                    (“Neo”) and $29,390 paid to i.Supplies Pte Ltd\n                    (“i.Supplies”) to carry out courier assignments on his behalf from\n                    January 2007 to October 2010. The AR only allowed the plaintiff to recover the\n                    sum ($117,271) paid to Neo. The AR found that on the evidence i.Supplies was\n                    hired only when Neo was unable to carry out deliveries and the plaintiff had\n                    conceded that even before the accident, he would hire someone else to take on\n                    his duties during the times he could not report for work. The AR found it\n                    unbelievable that the plaintiff would have “singlehandedly” been\n                    able to do all the work Neo and i.Supplies did (see [41] of the GD).(ii)   Loss of future earnings13     The AR rejected the Appellants’\n                    submission that the plaintiff did not suffer any drop in his assessable income\n                    since his income increased after the accident. The AR stressed again that\n                    “what was important was that but for the accident, the plaintiff could\n                    have earned even more by carrying out courier assignments himself rather than\n                    paying Neo to do so on his behalf” ([44] of the GD).14     The AR also rejected the Appellants’\n                    submission that the plaintiff could still personally deliver the goods, albeit\n                    at a slightly reduced capacity with light loads. The AR found that an award of\n                    loss of future earnings appropriate because there was sufficient evidence before\n                    her to fix a multiplier and multiplicand.15     The AR awarded $214,613 for the loss of future\n                    earnings using as the multiplicand, the average of Neo’s annual pay in\n                    2008 and 2009viz$30,659. For the multiplier, the\n                    AR found that “[b]ut for the uncertainties introduced by the accident,\n                    there was every indication that the plaintiff would continue as a contractor for\n                    DHL using Tom Express” (GD at [50]). The AR found that the\n                    plaintiff’s age (33) was not the only factor to be taken into account\n                    because as a sole-proprietor of a business, there was no fixed retirement age.\n                    The AR also found that the “profit and loss statements of Tom Express\n                    showed that the costs of the business were high, with certain items of expense\n                    appearing obviously inflated and not supported by any documentary\n                    evidence” (GD at [50]). The AR reduced the plaintiff’s multiplier\n                    of 15 to 7.(iii)   Loss of earning capacity16     The AR was satisfied that loss of earning\n                    capacity could also be awarded in this case – based on the evidence, there\n                    was a real risk that the plaintiff, because of his injuries, could lose his\n                    contract with DHL before the estimated end of his working life. The contract\n                    with DHL was Tom Express’ sole business. If Tom Express lost that\n                    contract, the plaintiff’s ability to compete in the labour market would\n                    certainly be diminished whether he chose to continue running Tom Express and\n                    seek alternative sources of business, or look for a different job. The AR noted\n                    that because of the plaintiff’s inability to personally carry out courier\n                    assignments, Tom Express would naturally have higher costs than its competitors\n                    because it would always have to pay for one additional courier. The plaintiff\n                    would suffer from having little opportunity for physical contact with his\n                    customers. The plaintiff was also disadvantaged by being limited to sedentary\n                    occupations and having only primary school qualifications. The AR gave a lump\n                    sum award of $30,000 for the plaintiff’s loss of earning\n                capacity.The issues in the Appeal17     Broadly, did the AR err in law or fact in her\n                    awards for:-(a)loss of pre-trial earnings;(b)loss of future earnings; and(c)loss of earning capacity?Principles applicable to appeals on assessment of damages18     The Court of Appeal inSingapore Airlines Ltd v Tan Shwu Leng[2001] 3 SLR(R) 439 made\n                    it clear that the judge was not constrained by the principles set out inDavies v Powell Duffryn Associated Colleries[1942] AC 601 when considering an appeal on assessment of damages in a\n                    Registrar’s Appeal. The Court of Appeal held at [17] that all appeals from a Registrar to a\n                    judge in chambers were dealt with by an actual rehearing of the application and\n                    the judge was entitled to treat the matter as if it came before him or her for\n                    the first time.(i)   Did the AR err in law or fact in her award for loss of\n                pre-trial earnings?19     The assessment was conducted by the AR over 6\n                    days - 1 to 3 November 2010, 3 to 4 January 2011 and 6 January 2011. Pre-trial\n                    loss of earnings is an item of special damages and needs to be specifically\n                    proven to be recoverable (Wee Sia Tian v Long Thik\n                        Boon[1996] 3 SLR(R) 513 at 517F). The critical\n                    question to answer is, was the plaintiff’s cost of hiring a replacement to\n                    cover his courier assignments from the time of his accident to the date of\n                    assessment a real assessable loss proven by the evidence, notwithstanding that\n                    the plaintiff’s business actually increased in\n                profitability?20     The Appellants argued that the plaintiff had\n                    failed to prove any real assessable drop in earnings because his income actually\n                    increased during the period between the time of accident and the date of\n                    assessment. The Appellants disagreed that his earnings were affected by the sum\n                    total of what he paid an extra worker to do on his behalf. The AR had rejected\n                    the Appellants’ argument that loss of pre-trial earnings can only be\n                    calculated by comparing what the plaintiff earned pre-accident and what he\n                    earned post-accident. The AR cited the proposition inChai\n                        Kang Wei Samuelat [29]\n                    that:The overarching objective of awarding damages is tocompensatethe injured victim by restoring him or her to the\n                        position that he or she would have been (in a monetary sense) had the\n                        accident not happened.(emphasis in original)21     The Appellants had argued that this\n                    proposition was used in the context of loss of future earnings and should not be\n                    applied for pre-trial loss of earnings. This argument of the Appellants is\n                    flawed. While the proposition was used inChai Kang Wei\n                        Samuelin the context of loss of future earnings, the proposition\n                    being applied is clearly ageneralprinciple\n                    embodying the compensatory purpose of damages in personal injuries as stated by\n                    Lord Blackburn inLivingstone v Raywards Coal Co(1880) 5 App Cas 25 at 39:…where any injury is to be compensated by damages, in settling the\n                        sum of money to be given for reparation of damagesyou\n                            should nearly as possible get at that sum of money which will put the\n                            party who has been injured, or who has suffered, in the same position as\n                            he would have been if he had not sustained the wrongfor\n                        which he is now getting his compensation or reparation.(emphasis added)22     InChai Kang Wei\n                        Samuel, the claimant’s post-accident income was slightly\n                    more than her average yearly income pre-accident. However, the Court of Appeal\n                    held at [28] that it would be wholly\n                    inequitable to hold that the victim suffered no loss just because her\n                    post-accident income was slightly more than her average yearly income\n                    pre-accident. The injury had affected the number of hours the claimant was able\n                    to work and a more accurate reflection of her loss was the actual number of\n                    hours she had worked before the accident multiplied by the actual rate she was\n                    earning after the accident (since the rate was normally higher with inflation\n                    and her greater experience).23     In the present case, the AR held that to put\n                    the plaintiff in the position he had been before the accident meant that he\n                    should be compensated for the cost of paying someone to do his work, regardless\n                    of the increased profitability of his business. For sole proprietorship cases, I\n                    am of the view that the nature of the claimant’s job should be carefully\n                    examined. The AR’s reasoning was based on her assumption that to place the\n                    plaintiff in the position he was in before the accident, he should be\n                    compensated for having to hire another driver to replace him in his driving\n                    role. However, the difficulty in assessing the plaintiff’s damages was due\n                    to the fact that he haddualroles – acting\n                    both in amanagerialandoperational(iedriving) capacity\n                    for Tom Express. The Appellants would not be wrong in arguing that it is\n                    possible Tom Express became more profitable because the plaintiff was focusing\n                    his energies more fully on his managerial role. The problem with calculating\n                    loss of earnings and profits in a sole proprietorship context is that there are\n                    many uncertain contingencies that will affect the final profits of a business.\n                    These are valid concerns in assessing pre-trial loss of earnings for the\n                    plaintiff.24     The AR did not refer to other cases besidesChai Kang Wei Samuelin her analysis of\n                    pre-trial loss of earnings. Neither did the parties submit any authorities with\n                    similar facts on point where the Court had awarded loss of pre-trial earnings\n                    despite the victim’s business being more profitable. In this regard, the\n                    English Court of Appeal case ofPhillips v Holliday &\n                        ANR[2001] EWCA Civ 1074 (“Phillips v Holliday”) is particularly useful. InPhillips v Holliday, the claimant was awarded\n                    loss of pre-trial earnings despite his business being more profitable. The\n                    claimant worked for a company both administratively (as a contracts manager) and\n                    manually (painter and decorator). The Court of Appeal treated the profits of the\n                    company as the claimant’s own, as the company was owned fully by the\n                    claimant’s wife with the wife also being the sole director of the company.\n                    Similar to our case, the Court of Appeal found that the claimant’s\n                    injuries severely limited his ability to carry out the manual work he used to be\n                    able to do for the company as a painter and decorator and he could only carry\n                    out administrative work. Most pertinently, the Court of Appeal held at [20] that:… the fact that the claimant has made a success of the business as\n                        an administrator and supervisordoes not mean either that\n                            he might not have been more successful if able to do much of the manual\n                            work himself…[emphasis added].25     The Court of Appeal also addressed another\n                    valid concern in our case at [25]\n                    of:…the fact that the claimant had worked in a\n                            managerial capacity after the accident. How then should that fact be\n                            reflected in this estimate of damages?One would think that\n                        if the claimant was able to spend more time on the administration side of\n                        the business, and if the business as was suggested by the claimant was\n                        growing, then profits would increase as in fact they did.[emphasis added]26     The Court of Appeal recognised that the\n                    inability of the claimant to carry out the manual work that he used to do wasa losseven if the company had an increase in\n                    profit at [30]:The profits then picked up,but if the company would be\n                            having to pay painters to do the work the claimant could otherwise have\n                            done, it is likely that the profitability was not as great as it should\n                            be. If the figure of £269 were made a net figure of say\n                        £200 [the evidence was that the claimant was taking from the business a\n                        figure of around £269 immediately prior to the accident]and if a deduction is made in accordance with the figures shown\n                            in the schedule to Mr Mould’s report (page 118) as those which he\n                            should have earned as an administrator, then on my\n                        calculation one reaches a figure of £18,748 as the loss between\n                        accident and trial.[emphasis added]27     It is also important to consider how the Court\n                    of Appeal inPhillips v Hollidaydistinguished the\n                    case ofAshcroft v Curtin[1971]\n                    1 WLR 1731 (“Ashcroft v\n                    Curtin”) at [30]:This does not seem to me to be a case likeAshcroft v\n                            Curtin[1971] 1 WLR 1731 CA in which the Court of Appeal felt\n                        driven to hold that the records of a business were such that there was\n                        simply no basis for making a calculation. This is a case where albeit it is\n                        difficult to make a calculation the starting point is there and the court\n                        should strive to make a proper deduction in order to reach an appropriate\n                        figure.28     InAshcroft v\n                        Curtin, the claimant was a skilled engineer who carried a\n                    successful business through a private company of which he was the active\n                    managing director. The profits of the company had declined but the claimant had\n                    failed to claim loss of profits owing to his disabilities because the\n                    company’s accounts were unreliable. The Court of Appeal inAshcroft v Curtinhad made an observation that may be\n                    helpful to the present case:But I am very doubtful about the validity of this approach,for if another man had been engaged to do the plaintiff’s\n                            pre-accident work, it does not follow that the profits would have gone\n                            down by the amount of his salary. On the contrary, I see the\n                        force of the observation of Mr. May that, as no\n                            other man was in fact engaged, it is irrelevant to consider what would\n                            have happened if he had been, so far from producing a drop in\n                        profitability, his engagement might equally well have led to a realisation\n                        of the 10 per cent increase which Mr. Boulter assumed would have enured\n                        but for the accident.[emphasis added]Theobiter dictainAshcroft v Curtinsuggests that the Court cannot assume that the\n                    profits may go down by the amount of salary used to hire the replacement for the\n                    pre-accident work, for the replacement may have cause the business to be more\n                    profitable. However, whatPhillips v Hollidayis\n                    stating is thateven if the business becomes more\n                        profitable, the profits could have been even greater if the\n                    claimant did not have to bear the additional cost of hiring the replacement for\n                    doing the work he could have done himself. To prevent over-compensation the\n                    Court of Appeal inPhillips v Hollidaywould then\n                    consider the appropriate deduction for the value of the claimant’s\n                    increased managerial role.29     Therefore, although the claimant inPhillips v Hollidaydid not claim for the expense of\n                    hiring someone to paint on his own behalf as in our case, in principle, the\n                    plaintiff can claim for the cost of paying someone to do his work despite the\n                    increase profits earned by Tom Express. On closer examination of the facts, the\n                    plaintiff had hospitalisation leave from the accident up to 14 September 2010\n                    – he clearly could not physically carry out the courier services he was\n                    contracted to do. He had to hire someone to deliver the goods on his personal\n                    route to maintain the contract with DHL. I note that the plaintiff’s\n                    contract with DHL in 2005 required him to provide two delivery men to carry out\n                    the work while his current contract with DHL requires him to employ at a minimum\n                    of 3 full time delivery men. However, Gee Say Liang (“Gee”), the\n                    manager of DHL had clarified at the assessment hearing that the decision to hire\n                    an extra driver and buy an extra van in 2008 was the plaintiff’s and had\n                    nothing to do with DHL:Q:Did DHL request the Plaintiff to top up his\n                            resources by hiring one extra courier and buying one extra van or was\n                            this decision made by the Plaintiff on his own? This is in\n                        2008.A:That decision was made by the Plaintiff but we sat\n                            down with him and we told him that your area is growing, if you think\n                            you can handle the growth by just maintaining 2 then that is fine, we\n                            are not forcing him to hire 1 extra man. But if he keeps to 2 and he\n                            cannot manage the business then that would affect his performance and\n                            the performance of the company. The decision was made by him – not\n                            something we forced onto him.30     On the evidence, I am of the view that the\n                    plaintiff has proven on a balance of probabilities that he had hired Neo to\n                    replace him in his courier assignments. The plaintiff had also testified that he\n                    had to hire a replacement driver to prevent his contract with DHL from being\n                    terminated. However, the AR was right in rejecting the plaintiff’s claim\n                    for the cost of hiring i.Supplies as pre-trial loss of earning. If the principle\n                    is to compensate the plaintiff for the cost of paying someone to dohis work, it is only reasonable to compensate him for\n                    the cost of the driver he hired to replace him. As the AR stated at GD [41], “[i]t seemed unbelievable that\n                    the plaintiff would have single-handedly been able to do all the work that Neo\n                    and i.Supplies did.”31     Even if I accept the $117,271.00 cost of\n                    hiring Neo from the period of accident to the date of assessment as pre-trial\n                    loss of earnings, the further question that needs to be asked and that was asked\n                    inPhillips v Hollidayis whether an appropriate\n                    deduction should be made for the fact that the plaintiff could take on\n                    additional managerial duties after the accident. The problem when the claimant\n                    used to occupy dual capacities (administrative/managerial and\n                    operational/manual) is the Court is naturally wary of over-compensating the\n                    claimant. InPhillips v Holliday, the Court of\n                    Appeal had data from which to deduct the appropriate amount for the\n                    claimant’s administrative work. In our case, we do not have such data and\n                    the plaintiff submitted that:[he] did not make any significant contribution to his business as his\n                        primary role prior to the accident was to be on the road and make the\n                        courier deliveries.His role post-accident did not evolve\n                            into anything more as there was never any significant or regular\n                            managerial duties to perform.[emphasis added]32     The evidence on record does provide support\n                    for the fact that the plaintiff’s role post-accident did not evolve into\n                    substantial managerial duties. His evidence was that he only needed to go back\n                    to the office to check on matters 4-5 times a year:Q:Am I correct to say that even though you had\n                            hospitalization leave up to 14 September 2010, and aside from the\n                            times you were in hospital for treatment, you had been able to run your\n                            business from accident to date as manager of Tom Express?A:I can run the business but I have nothing to do. At\n                            times I would go back to the office when there are complaints from\n                            customers. Where there is any problem DHL will deal directly with staff\n                            who is in my office. But they would prefer to deal directly with us than\n                            with my staff because they cannot communicate very well. I will go back\n                            to the office 4-5 times a year to settle the complaints. At other times\n                            I would go back to office to ensure things are going well, about once a\n                            month. I am very worried and scared that I will lose this agreement with\n                            DHL.Neo, the plaintiff’s driver, also supported the\n                    plaintiff’s evidence that the plaintiff only came to office a few times a\n                    year; Neo testified that:Q:How many times a year?A:[The Plaintiff] would come over whenever DHL holds\n                            meetings for contractors. This would be about 3-4 times a year. He would\n                            buy the refreshments and bring them over whenever there is such a\n                            meeting.…Q:In your daily work for Tom Express delivering for\n                            DHL, how often do you have to communicate with the\n                        Plaintiff?A:I do not have to communicate with him all the time.\n                            For e.g. where there are certain things brought up during courier\n                            meetings that we have to let him know I will update him.…Q:Based on what you said earlier, that the Plaintiff\n                            goes for 3-4 contractors’ meetings and sometimes he has\n                            instructions. How many times a year does he convey instructions to\n                            you?A:Twice.Gee also testified that the plaintiff only had to attend monthly\n                    meetings with DHL:Q:You meet the Plaintiff 3-4 times a\n                        year?A:More than that. We have monthly meetings at least\n                            once a month with all our contractors. That is when we go through\n                            performance reviews with them. Monthly meeting to find out if there are\n                            any issues in the company.33     Tom Express was started only in 2005 and while\n                    the business had expanded from 2 to 3 drivers and two lorries, the business is\n                    admittedly still small-scale. In the circumstances, any additional value of the\n                    plaintiff’s administrative work from the date of accident to the\n                    assessment would likely be nominal. It would be fair to award him the sum of\n                    $117,271 as pre-trial loss of earnings for the cost of hiring Neo without any\n                    deduction for administrative work. Accordingly, I uphold the AR’s award\n                    for pre-trial loss of earnings.(ii)   Did the AR err in law or fact in her award for loss of\n                future earnings?34     The AR’s reasoning for this award was\n                    similar to her reasoning for pre-trial loss of earnings. At [44] of the GD, the AR said:…what was important was that but for the accident, the Plaintiff\n                        could have earned even more by carrying out courier assignments himself\n                        rather than paying Neo to do so on his behalf. In my judgment, the Plaintiff\n                        was unlikely to be able to return to carrying out courier assignments\n                        personally in the near future and would continue to need to hire someone to\n                        cover him.The AR also found that there was sufficient evidence before her to fix\n                    a multiplier and multiplicand to award the Plaintiff loss of future\n                    earnings.35     InPhillips v\n                        Holliday, the Court of Appeal had also awarded loss of future\n                    earnings to the claimant at [33]:By being able to spend more time on administration and supervision it\n                        seems at least that the business has improved from the pre-accident\n                        position.It might however have improved further if the\n                            claimant had been able to do more manual workand there is no\n                        doubt that if the business does not flourish the claimant is at a serious\n                        disadvantage in the labour market. The claimant is entitled to damages to\n                        reflect both aspects.[emphasis added]The Court of Appeal had also added at [34] that “[t]he next question is what deduction should\n                    be made for the fact thatmoney will still be paid out to the\n                        claimant albeit his role will be that of administratorand the\n                    manual work that he can do will be much more limited”. Previously for\n                    pre-trial loss of earnings, the concern was also that the claimant may be\n                    overcompensated if there was no appropriate deduction for the value of the\n                    claimant’s increased capacity for managerial work. It was noted that the\n                    Court of Appeal inPhillips v Hollidayawarded a\n                    sum for loss of future earnings and loss of earning capacity together, but it\n                    would be more appropriate to assess them separately in this case.36     I believe from her GD that the AR may have not\n                    fully considered the aspect of deducting the value of the plaintiff’s\n                    increased managerial role after the accident. For pre-trial loss of earnings,\n                    the evidence did show that the plaintiff’s administrative work did not\n                    change substantially from what he carried out pre-accident. However, in light of\n                    the fact that the plaintiff’s business is expanding and increasing in\n                    profits, it would be unsafe to assume that in future he will always be a full\n                    time driver for his company concurrently with his increasing managerial\n                    role.37     A number of local cases of claimants in sole\n                    proprietorships may provide some guidance. InWong Kim Lan v\n                        Christie Kolandasamy[2004] SGDC 234 (“Wong Kim Lan”), the District Court awarded a sole\n                    proprietor a sum of $45,000 for loss of earning capacity. The sole proprietor\n                    designed jewellery for manufacture within her own factories and recommended\n                    designs to customers. The Court drew an adverse inference against the sole\n                    proprietor and held that she had earned more after the accident because she\n                    failed to produce evidence to prove her post-accident income. Although the sole\n                    proprietor hired more designers to assist her in her work, she did not claim as\n                    in the present case that she should be compensated for the additional cost of\n                    designers and therefore there was also no evidence provided for this aspect. A\n                    key distinguishing factor ofWong Kim Lanfrom the\n                    present case is that the business of the sole proprietor there was on a much\n                    larger scale than the plaintiff’s -- her business had grown from 5 in\n                    Singapore and 200 in China to 10 in Singapore and 300 in China.Wong Kim Lanwould be a situation where it was so clear\n                    that the claimant was more profitable in his or her managerial role that the\n                    appropriate deduction of the claimant’s managerial work would likely leave\n                    no claim left for loss of future earnings.38     InKoh Soon Pheng v Tan Kah\n                        Eng[2003] 2 SLR(R) 538 (“Koh\n                        Soon Pheng”), the High Court upheld an AR’s award of\n                    $180,000 for loss of earning capacity to a 42 year old sole-proprietor who owned\n                    a motorcycle workshop and whose specific skill was to repair large motorcycles\n                    with high capacity engines. The High Court had upheld the AR’s award for\n                    loss of earning capacity instead of loss of future earnings as the High Court\n                    had found that it was too speculative to determine how well the claimant’s\n                    business would perform in future. It is noteworthy that the Court stated at\n                        [17]:No doubt the plaintiff would earn a little less because\n                            he would have to incur wages which would not have been payable had he\n                            remained able to do the work on his own, but this does not\n                        mean that the plaintiff’s business cannot still be brought back to a\n                        profitable situation.[emphasis added]While the Court recognised the loss of earnings similar to the present\n                    case when the claimant had to hire someone to do the work he used to do, no\n                    award was made since the claimant there did not actually claim to have hired\n                    someone to supplement his reduced working abilities. InKoh\n                        Soon Pheng, the business was also making losses.39     InAng Leng Hock v Leo Ee\n                        Ah[2004] 2 SLR(R) 361 (“Ang\n                        Leng Hock”) , the claimant was an independent contractor\n                    for Grand Court providing services for outdoor catering functions. He was\n                    awarded loss of earning capacity at a multiplicand of $1,100 with a multiplier\n                    of 10 to compensate for his injury that prevented him from being able to carry\n                    heavy loads. The multiplicand of $1,100 was to reflect the cost of hiring a\n                    worker to help the claimant carry heavy loads. The plaintiff relied on this case\n                    to support his claim for loss of future earnings. However, while it was clear inAng Leng Hockthat the award would compensate\n                    for the claimant’s inability to carry heavy loads in his job, the\n                    plaintiff would still need to prove that he needed to be compensated as afull timedriver of Tom Express despite his\n                    increased managerial role.40     On an examination of the other cases, it is\n                    clear that the award in each case was confined to the specific facts and\n                    evidence produced before the Court, because the Court would be unable to award\n                    loss of future earnings when it cannot fix a proper multiplicand and multiplier.\n                    The Court must also be wary of the fact that some of the older cases beforeChai Kang Wei Samueloperated on the premise\n                    that loss of future earnings and loss of earning capacity were awarded asalternativesand did not see them as\n                    conceptually distinct heads of damages.41     The plaintiff had claimed before the AR a sum\n                    of $495,000 for loss of future earnings based on Neo’s monthly fees of\n                    $2,750 as a multiplicand and a multiplier of 15 years, taking into account the\n                    plaintiff’s young age of 33 at the time of assessment. The AR had averaged\n                    the figures of Neo’s annual pay in 2008 and 2009 to a multiplicand of\n                    $30,659. The AR had then considered the inevitable business fluctuations of the\n                    plaintiff’s business and the fact that “the profit and loss\n                    statements of Tom Express showed that the costs of the business were high, with\n                    certain items of expense appearing obviously inflated and not supported by any\n                    documentary evidence” ([50] of the GD) to reduce the multiplier submitted\n                    by the plaintiff by half to 7. The AR awarded the plaintiff $214,613 for loss of\n                    future earnings.42     The basis for using the average figures of\n                    Neo’s annual pay in 2008 and 2009 as the multiplicand would not reflect\n                    what loss of future earnings is meant to compensate. If loss of future earnings\n                    is to compensate the plaintiff for his additional expense of always having to\n                    hire an additional courier to do the work he used to carry out personally, it\n                    would be more logical on the evidence provided to take the average annual salary\n                    of the drivers in the plaintiff’s business. The plaintiff had 3 drivers\n                    and Neo’s monthly salary used to be the highest of all the 3 drivers until\n                    Ahmadkalil had a raise in May 2010. The figures are set out below:NoDriverAnnual Salary in 2008Annual Salary in 20091Ahmadkalil$32,400$32,4002Gomes (only hired in October\n                                        2008)-$30,0003Neo$31,403$29,915Only the annual salary for 2008 and 2009 was taken as there was\n                    insufficient evidence to calculate the annual salaries of the drives for 2010. I\n                    am of the view that the appropriate multiplicand (averaging the annual salary of\n                    all 3 drivers for 2008 and 2009) would be $31,223.60.43     The parties did not submit that the award for\n                    loss of future earnings should be reduced by income tax payable and the\n                    AR’s award did not deduct any income tax. I believe it should and a fair\n                    deduction to reflect the income tax for the plaintiff’s income bracket\n                    would be $2,000 from the multiplicand. Therefore, making the appropriate\n                    reduction for the plaintiff’s income tax, I find that the multiplicand for\n                    loss of future earnings should be $29,223.60.44     While the AR reduced the multiplier to take\n                    account of the inevitable fluctuations in the business of Tom Express and the\n                    inflated expenses of plaintiff’s business accounts, she did not make the\n                    appropriate deduction for the value received by the plaintiff in carrying out a\n                    greater managerial role in Tom Express. Due weight should have been given to the\n                    fact that the plaintiff had always performeddualroles (both managerial and operational) and the reality of the business was that\n                    it had grown from a 2 man 1 vehicle sole-proprietorship to one having 3 drivers\n                    and 2 lorries with the evidence suggesting that it was likely to grow further in\n                    the future. Hence, the necessary and appropriate deduction for the value of the\n                    plaintiff’s increased capacity for managerial work in future would be to\n                    reduce the multiplier to 3. This would more fairly reflect what the plaintiff\n                    had actually lost. I therefore reduce the AR’s award for loss of future\n                    earnings to $87,670.80.(iii)   Did the AR err in law or fact in her award for loss of\n                earning capacity?45     The Appellant submitted that the plaintiff at\n                    the hearing below did not submit on a claim for loss of earning capacity in\n                    addition to an award for loss of future earnings. This is not entirely correct\n                    as the plaintiff’s submissions below did argue for an award of loss of\n                    earning capacity as in the alternative to loss of future earnings. Furthermore,\n                    since an award for loss of earning capacity is part of general damages, it need\n                    not be specifically pleaded. The plaintiff had submitted that:[h]ad the [AR] awarded a multiplier closer to 15, the Plaintiff would\n                        agree that the award for loss of earning capacity would have been excessive\n                        and overlapping with the award for loss of future earnings.46     I am of the view that the AR applied the\n                    correct legal test for an award for loss of earning capacity – and had\n                    carefully assessed if (i) there was a substantial or real risk that the\n                    plaintiff would lose his present job at some time or before the estimated end of\n                    his working life and (ii) whether the plaintiff would be disadvantaged in the\n                    open employment market because of his injuries. The evidence did support the\n                    plaintiff’s contention that there was a real risk that he would lose the\n                    ability to sustain Tom Express. His business was highly dependent on his\n                    contract with DHL and Gee of DHL had testified that the plaintiff’s\n                    inability to personally drive and meet customers would be a factor relevant in\n                    the renewal of the DHL contract. However, the AR was right in assessing this\n                    risk conservatively as it was undisputed that DHL had renewed the\n                    plaintiff’s contract twice after the accident, despite the fact that the\n                    plaintiff could no longer personally delivery the goods.47     If the plaintiff was unable to run Tom Express\n                    and had to seek alternative employment, he would be seriously disadvantaged as\n                    he has been a driver all his life. However, he would not be able to tap on his\n                    driving experience whilst his highest educational qualification was only\n                    completion of his primary school examinations. Any sedentary job the plaintiff\n                    could manage to get in the open market would pay him far below what he was\n                    earning now. Consequently, the AR’s lump sum award of $30,000 for loss of\n                    earning capacity was fair and is accordingly upheld.Conclusion48     While I accept that the AR’s award for\n                    pre-trial loss of earnings and loss of earning capacity should be upheld, her\n                    award for loss of future earnings should be reduced from $214,613 to $\n                    87,670.80.49     Although the award to the plaintiff for loss\n                    of future earnings has been substantially reduced, I note that the Appellants\n                    have only succeeded on one of their three main grounds of appeal. Consequently,\n                    although they are entitled to costs of the Appeal, I reduce the costs to the\n                    Appellants by two-thirds from $3,000 to $1,000 but with disbursements to them on\n                    a reimbursement basis. I will not disturb the costs order made\n                below.",
        "The decision below": "",
        "(i)   Loss of pre-trial earnings": "11     The AR in her GD, citingChai Kang Wei Samuel v Shaw Linda Gillian[2010]\n                    3 SLR 587 at [29]\n                        (“Chai Kang Wei Samuel”), did\n                    not find it necessary for the plaintiff to prove his business had suffered loss\n                    after his accident in order for him to claim pre-trial loss of earnings. She\n                    found that if the accident had not happened, the plaintiff would have continued\n                    to personally carry out deliveries and would not have needed to pay others to\n                    cover his courier work. In order to put him in the position he had been before\n                    the accident, the AR held that the plaintiff should be compensated for the cost\n                    of paying someone to do his work. The AR then rejected the Appellants’\n                    argument that the plaintiff was not entitled to a claim for loss of earnings\n                    because the profitability of his business increased. 12     The plaintiff claimed a total of $146,661 for\n                    loss of pre-trial earnings - $117,271 paid to Neo Say Seong\n                    (“Neo”) and $29,390 paid to i.Supplies Pte Ltd\n                    (“i.Supplies”) to carry out courier assignments on his behalf from\n                    January 2007 to October 2010. The AR only allowed the plaintiff to recover the\n                    sum ($117,271) paid to Neo. The AR found that on the evidence i.Supplies was\n                    hired only when Neo was unable to carry out deliveries and the plaintiff had\n                    conceded that even before the accident, he would hire someone else to take on\n                    his duties during the times he could not report for work. The AR found it\n                    unbelievable that the plaintiff would have “singlehandedly” been\n                    able to do all the work Neo and i.Supplies did (see [41] of the GD).",
        "(ii)   Loss of future earnings": "13     The AR rejected the Appellants’\n                    submission that the plaintiff did not suffer any drop in his assessable income\n                    since his income increased after the accident. The AR stressed again that\n                    “what was important was that but for the accident, the plaintiff could\n                    have earned even more by carrying out courier assignments himself rather than\n                    paying Neo to do so on his behalf” ([44] of the GD). 14     The AR also rejected the Appellants’\n                    submission that the plaintiff could still personally deliver the goods, albeit\n                    at a slightly reduced capacity with light loads. The AR found that an award of\n                    loss of future earnings appropriate because there was sufficient evidence before\n                    her to fix a multiplier and multiplicand. 15     The AR awarded $214,613 for the loss of future\n                    earnings using as the multiplicand, the average of Neo’s annual pay in\n                    2008 and 2009viz$30,659. For the multiplier, the\n                    AR found that “[b]ut for the uncertainties introduced by the accident,\n                    there was every indication that the plaintiff would continue as a contractor for\n                    DHL using Tom Express” (GD at [50]). The AR found that the\n                    plaintiff’s age (33) was not the only factor to be taken into account\n                    because as a sole-proprietor of a business, there was no fixed retirement age.\n                    The AR also found that the “profit and loss statements of Tom Express\n                    showed that the costs of the business were high, with certain items of expense\n                    appearing obviously inflated and not supported by any documentary\n                    evidence” (GD at [50]). The AR reduced the plaintiff’s multiplier\n                    of 15 to 7.",
        "(iii)   Loss of earning capacity": "16     The AR was satisfied that loss of earning\n                    capacity could also be awarded in this case – based on the evidence, there\n                    was a real risk that the plaintiff, because of his injuries, could lose his\n                    contract with DHL before the estimated end of his working life. The contract\n                    with DHL was Tom Express’ sole business. If Tom Express lost that\n                    contract, the plaintiff’s ability to compete in the labour market would\n                    certainly be diminished whether he chose to continue running Tom Express and\n                    seek alternative sources of business, or look for a different job. The AR noted\n                    that because of the plaintiff’s inability to personally carry out courier\n                    assignments, Tom Express would naturally have higher costs than its competitors\n                    because it would always have to pay for one additional courier. The plaintiff\n                    would suffer from having little opportunity for physical contact with his\n                    customers. The plaintiff was also disadvantaged by being limited to sedentary\n                    occupations and having only primary school qualifications. The AR gave a lump\n                    sum award of $30,000 for the plaintiff’s loss of earning\n                capacity.",
        "The issues in the Appeal": "17     Broadly, did the AR err in law or fact in her\n                    awards for:- (a)loss of pre-trial earnings;(b)loss of future earnings; and(c)loss of earning capacity?Principles applicable to appeals on assessment of damages18     The Court of Appeal inSingapore Airlines Ltd v Tan Shwu Leng[2001] 3 SLR(R) 439 made\n                    it clear that the judge was not constrained by the principles set out inDavies v Powell Duffryn Associated Colleries[1942] AC 601 when considering an appeal on assessment of damages in a\n                    Registrar’s Appeal. The Court of Appeal held at [17] that all appeals from a Registrar to a\n                    judge in chambers were dealt with by an actual rehearing of the application and\n                    the judge was entitled to treat the matter as if it came before him or her for\n                    the first time.(i)   Did the AR err in law or fact in her award for loss of\n                pre-trial earnings?19     The assessment was conducted by the AR over 6\n                    days - 1 to 3 November 2010, 3 to 4 January 2011 and 6 January 2011. Pre-trial\n                    loss of earnings is an item of special damages and needs to be specifically\n                    proven to be recoverable (Wee Sia Tian v Long Thik\n                        Boon[1996] 3 SLR(R) 513 at 517F). The critical\n                    question to answer is, was the plaintiff’s cost of hiring a replacement to\n                    cover his courier assignments from the time of his accident to the date of\n                    assessment a real assessable loss proven by the evidence, notwithstanding that\n                    the plaintiff’s business actually increased in\n                profitability?20     The Appellants argued that the plaintiff had\n                    failed to prove any real assessable drop in earnings because his income actually\n                    increased during the period between the time of accident and the date of\n                    assessment. The Appellants disagreed that his earnings were affected by the sum\n                    total of what he paid an extra worker to do on his behalf. The AR had rejected\n                    the Appellants’ argument that loss of pre-trial earnings can only be\n                    calculated by comparing what the plaintiff earned pre-accident and what he\n                    earned post-accident. The AR cited the proposition inChai\n                        Kang Wei Samuelat [29]\n                    that:The overarching objective of awarding damages is tocompensatethe injured victim by restoring him or her to the\n                        position that he or she would have been (in a monetary sense) had the\n                        accident not happened.(emphasis in original)21     The Appellants had argued that this\n                    proposition was used in the context of loss of future earnings and should not be\n                    applied for pre-trial loss of earnings. This argument of the Appellants is\n                    flawed. While the proposition was used inChai Kang Wei\n                        Samuelin the context of loss of future earnings, the proposition\n                    being applied is clearly ageneralprinciple\n                    embodying the compensatory purpose of damages in personal injuries as stated by\n                    Lord Blackburn inLivingstone v Raywards Coal Co(1880) 5 App Cas 25 at 39:…where any injury is to be compensated by damages, in settling the\n                        sum of money to be given for reparation of damagesyou\n                            should nearly as possible get at that sum of money which will put the\n                            party who has been injured, or who has suffered, in the same position as\n                            he would have been if he had not sustained the wrongfor\n                        which he is now getting his compensation or reparation.(emphasis added)22     InChai Kang Wei\n                        Samuel, the claimant’s post-accident income was slightly\n                    more than her average yearly income pre-accident. However, the Court of Appeal\n                    held at [28] that it would be wholly\n                    inequitable to hold that the victim suffered no loss just because her\n                    post-accident income was slightly more than her average yearly income\n                    pre-accident. The injury had affected the number of hours the claimant was able\n                    to work and a more accurate reflection of her loss was the actual number of\n                    hours she had worked before the accident multiplied by the actual rate she was\n                    earning after the accident (since the rate was normally higher with inflation\n                    and her greater experience).23     In the present case, the AR held that to put\n                    the plaintiff in the position he had been before the accident meant that he\n                    should be compensated for the cost of paying someone to do his work, regardless\n                    of the increased profitability of his business. For sole proprietorship cases, I\n                    am of the view that the nature of the claimant’s job should be carefully\n                    examined. The AR’s reasoning was based on her assumption that to place the\n                    plaintiff in the position he was in before the accident, he should be\n                    compensated for having to hire another driver to replace him in his driving\n                    role. However, the difficulty in assessing the plaintiff’s damages was due\n                    to the fact that he haddualroles – acting\n                    both in amanagerialandoperational(iedriving) capacity\n                    for Tom Express. The Appellants would not be wrong in arguing that it is\n                    possible Tom Express became more profitable because the plaintiff was focusing\n                    his energies more fully on his managerial role. The problem with calculating\n                    loss of earnings and profits in a sole proprietorship context is that there are\n                    many uncertain contingencies that will affect the final profits of a business.\n                    These are valid concerns in assessing pre-trial loss of earnings for the\n                    plaintiff.24     The AR did not refer to other cases besidesChai Kang Wei Samuelin her analysis of\n                    pre-trial loss of earnings. Neither did the parties submit any authorities with\n                    similar facts on point where the Court had awarded loss of pre-trial earnings\n                    despite the victim’s business being more profitable. In this regard, the\n                    English Court of Appeal case ofPhillips v Holliday &\n                        ANR[2001] EWCA Civ 1074 (“Phillips v Holliday”) is particularly useful. InPhillips v Holliday, the claimant was awarded\n                    loss of pre-trial earnings despite his business being more profitable. The\n                    claimant worked for a company both administratively (as a contracts manager) and\n                    manually (painter and decorator). The Court of Appeal treated the profits of the\n                    company as the claimant’s own, as the company was owned fully by the\n                    claimant’s wife with the wife also being the sole director of the company.\n                    Similar to our case, the Court of Appeal found that the claimant’s\n                    injuries severely limited his ability to carry out the manual work he used to be\n                    able to do for the company as a painter and decorator and he could only carry\n                    out administrative work. Most pertinently, the Court of Appeal held at [20] that:… the fact that the claimant has made a success of the business as\n                        an administrator and supervisordoes not mean either that\n                            he might not have been more successful if able to do much of the manual\n                            work himself…[emphasis added].25     The Court of Appeal also addressed another\n                    valid concern in our case at [25]\n                    of:…the fact that the claimant had worked in a\n                            managerial capacity after the accident. How then should that fact be\n                            reflected in this estimate of damages?One would think that\n                        if the claimant was able to spend more time on the administration side of\n                        the business, and if the business as was suggested by the claimant was\n                        growing, then profits would increase as in fact they did.[emphasis added]26     The Court of Appeal recognised that the\n                    inability of the claimant to carry out the manual work that he used to do wasa losseven if the company had an increase in\n                    profit at [30]:The profits then picked up,but if the company would be\n                            having to pay painters to do the work the claimant could otherwise have\n                            done, it is likely that the profitability was not as great as it should\n                            be. If the figure of £269 were made a net figure of say\n                        £200 [the evidence was that the claimant was taking from the business a\n                        figure of around £269 immediately prior to the accident]and if a deduction is made in accordance with the figures shown\n                            in the schedule to Mr Mould’s report (page 118) as those which he\n                            should have earned as an administrator, then on my\n                        calculation one reaches a figure of £18,748 as the loss between\n                        accident and trial.[emphasis added]27     It is also important to consider how the Court\n                    of Appeal inPhillips v Hollidaydistinguished the\n                    case ofAshcroft v Curtin[1971]\n                    1 WLR 1731 (“Ashcroft v\n                    Curtin”) at [30]:This does not seem to me to be a case likeAshcroft v\n                            Curtin[1971] 1 WLR 1731 CA in which the Court of Appeal felt\n                        driven to hold that the records of a business were such that there was\n                        simply no basis for making a calculation. This is a case where albeit it is\n                        difficult to make a calculation the starting point is there and the court\n                        should strive to make a proper deduction in order to reach an appropriate\n                        figure.28     InAshcroft v\n                        Curtin, the claimant was a skilled engineer who carried a\n                    successful business through a private company of which he was the active\n                    managing director. The profits of the company had declined but the claimant had\n                    failed to claim loss of profits owing to his disabilities because the\n                    company’s accounts were unreliable. The Court of Appeal inAshcroft v Curtinhad made an observation that may be\n                    helpful to the present case:But I am very doubtful about the validity of this approach,for if another man had been engaged to do the plaintiff’s\n                            pre-accident work, it does not follow that the profits would have gone\n                            down by the amount of his salary. On the contrary, I see the\n                        force of the observation of Mr. May that, as no\n                            other man was in fact engaged, it is irrelevant to consider what would\n                            have happened if he had been, so far from producing a drop in\n                        profitability, his engagement might equally well have led to a realisation\n                        of the 10 per cent increase which Mr. Boulter assumed would have enured\n                        but for the accident.[emphasis added]Theobiter dictainAshcroft v Curtinsuggests that the Court cannot assume that the\n                    profits may go down by the amount of salary used to hire the replacement for the\n                    pre-accident work, for the replacement may have cause the business to be more\n                    profitable. However, whatPhillips v Hollidayis\n                    stating is thateven if the business becomes more\n                        profitable, the profits could have been even greater if the\n                    claimant did not have to bear the additional cost of hiring the replacement for\n                    doing the work he could have done himself. To prevent over-compensation the\n                    Court of Appeal inPhillips v Hollidaywould then\n                    consider the appropriate deduction for the value of the claimant’s\n                    increased managerial role.29     Therefore, although the claimant inPhillips v Hollidaydid not claim for the expense of\n                    hiring someone to paint on his own behalf as in our case, in principle, the\n                    plaintiff can claim for the cost of paying someone to do his work despite the\n                    increase profits earned by Tom Express. On closer examination of the facts, the\n                    plaintiff had hospitalisation leave from the accident up to 14 September 2010\n                    – he clearly could not physically carry out the courier services he was\n                    contracted to do. He had to hire someone to deliver the goods on his personal\n                    route to maintain the contract with DHL. I note that the plaintiff’s\n                    contract with DHL in 2005 required him to provide two delivery men to carry out\n                    the work while his current contract with DHL requires him to employ at a minimum\n                    of 3 full time delivery men. However, Gee Say Liang (“Gee”), the\n                    manager of DHL had clarified at the assessment hearing that the decision to hire\n                    an extra driver and buy an extra van in 2008 was the plaintiff’s and had\n                    nothing to do with DHL:Q:Did DHL request the Plaintiff to top up his\n                            resources by hiring one extra courier and buying one extra van or was\n                            this decision made by the Plaintiff on his own? This is in\n                        2008.A:That decision was made by the Plaintiff but we sat\n                            down with him and we told him that your area is growing, if you think\n                            you can handle the growth by just maintaining 2 then that is fine, we\n                            are not forcing him to hire 1 extra man. But if he keeps to 2 and he\n                            cannot manage the business then that would affect his performance and\n                            the performance of the company. The decision was made by him – not\n                            something we forced onto him.30     On the evidence, I am of the view that the\n                    plaintiff has proven on a balance of probabilities that he had hired Neo to\n                    replace him in his courier assignments. The plaintiff had also testified that he\n                    had to hire a replacement driver to prevent his contract with DHL from being\n                    terminated. However, the AR was right in rejecting the plaintiff’s claim\n                    for the cost of hiring i.Supplies as pre-trial loss of earning. If the principle\n                    is to compensate the plaintiff for the cost of paying someone to dohis work, it is only reasonable to compensate him for\n                    the cost of the driver he hired to replace him. As the AR stated at GD [41], “[i]t seemed unbelievable that\n                    the plaintiff would have single-handedly been able to do all the work that Neo\n                    and i.Supplies did.”31     Even if I accept the $117,271.00 cost of\n                    hiring Neo from the period of accident to the date of assessment as pre-trial\n                    loss of earnings, the further question that needs to be asked and that was asked\n                    inPhillips v Hollidayis whether an appropriate\n                    deduction should be made for the fact that the plaintiff could take on\n                    additional managerial duties after the accident. The problem when the claimant\n                    used to occupy dual capacities (administrative/managerial and\n                    operational/manual) is the Court is naturally wary of over-compensating the\n                    claimant. InPhillips v Holliday, the Court of\n                    Appeal had data from which to deduct the appropriate amount for the\n                    claimant’s administrative work. In our case, we do not have such data and\n                    the plaintiff submitted that:[he] did not make any significant contribution to his business as his\n                        primary role prior to the accident was to be on the road and make the\n                        courier deliveries.His role post-accident did not evolve\n                            into anything more as there was never any significant or regular\n                            managerial duties to perform.[emphasis added]32     The evidence on record does provide support\n                    for the fact that the plaintiff’s role post-accident did not evolve into\n                    substantial managerial duties. His evidence was that he only needed to go back\n                    to the office to check on matters 4-5 times a year:Q:Am I correct to say that even though you had\n                            hospitalization leave up to 14 September 2010, and aside from the\n                            times you were in hospital for treatment, you had been able to run your\n                            business from accident to date as manager of Tom Express?A:I can run the business but I have nothing to do. At\n                            times I would go back to the office when there are complaints from\n                            customers. Where there is any problem DHL will deal directly with staff\n                            who is in my office. But they would prefer to deal directly with us than\n                            with my staff because they cannot communicate very well. I will go back\n                            to the office 4-5 times a year to settle the complaints. At other times\n                            I would go back to office to ensure things are going well, about once a\n                            month. I am very worried and scared that I will lose this agreement with\n                            DHL.Neo, the plaintiff’s driver, also supported the\n                    plaintiff’s evidence that the plaintiff only came to office a few times a\n                    year; Neo testified that:Q:How many times a year?A:[The Plaintiff] would come over whenever DHL holds\n                            meetings for contractors. This would be about 3-4 times a year. He would\n                            buy the refreshments and bring them over whenever there is such a\n                            meeting.…Q:In your daily work for Tom Express delivering for\n                            DHL, how often do you have to communicate with the\n                        Plaintiff?A:I do not have to communicate with him all the time.\n                            For e.g. where there are certain things brought up during courier\n                            meetings that we have to let him know I will update him.…Q:Based on what you said earlier, that the Plaintiff\n                            goes for 3-4 contractors’ meetings and sometimes he has\n                            instructions. How many times a year does he convey instructions to\n                            you?A:Twice.Gee also testified that the plaintiff only had to attend monthly\n                    meetings with DHL:Q:You meet the Plaintiff 3-4 times a\n                        year?A:More than that. We have monthly meetings at least\n                            once a month with all our contractors. That is when we go through\n                            performance reviews with them. Monthly meeting to find out if there are\n                            any issues in the company.33     Tom Express was started only in 2005 and while\n                    the business had expanded from 2 to 3 drivers and two lorries, the business is\n                    admittedly still small-scale. In the circumstances, any additional value of the\n                    plaintiff’s administrative work from the date of accident to the\n                    assessment would likely be nominal. It would be fair to award him the sum of\n                    $117,271 as pre-trial loss of earnings for the cost of hiring Neo without any\n                    deduction for administrative work. Accordingly, I uphold the AR’s award\n                    for pre-trial loss of earnings.(ii)   Did the AR err in law or fact in her award for loss of\n                future earnings?34     The AR’s reasoning for this award was\n                    similar to her reasoning for pre-trial loss of earnings. At [44] of the GD, the AR said:…what was important was that but for the accident, the Plaintiff\n                        could have earned even more by carrying out courier assignments himself\n                        rather than paying Neo to do so on his behalf. In my judgment, the Plaintiff\n                        was unlikely to be able to return to carrying out courier assignments\n                        personally in the near future and would continue to need to hire someone to\n                        cover him.The AR also found that there was sufficient evidence before her to fix\n                    a multiplier and multiplicand to award the Plaintiff loss of future\n                    earnings.35     InPhillips v\n                        Holliday, the Court of Appeal had also awarded loss of future\n                    earnings to the claimant at [33]:By being able to spend more time on administration and supervision it\n                        seems at least that the business has improved from the pre-accident\n                        position.It might however have improved further if the\n                            claimant had been able to do more manual workand there is no\n                        doubt that if the business does not flourish the claimant is at a serious\n                        disadvantage in the labour market. The claimant is entitled to damages to\n                        reflect both aspects.[emphasis added]The Court of Appeal had also added at [34] that “[t]he next question is what deduction should\n                    be made for the fact thatmoney will still be paid out to the\n                        claimant albeit his role will be that of administratorand the\n                    manual work that he can do will be much more limited”. Previously for\n                    pre-trial loss of earnings, the concern was also that the claimant may be\n                    overcompensated if there was no appropriate deduction for the value of the\n                    claimant’s increased capacity for managerial work. It was noted that the\n                    Court of Appeal inPhillips v Hollidayawarded a\n                    sum for loss of future earnings and loss of earning capacity together, but it\n                    would be more appropriate to assess them separately in this case.36     I believe from her GD that the AR may have not\n                    fully considered the aspect of deducting the value of the plaintiff’s\n                    increased managerial role after the accident. For pre-trial loss of earnings,\n                    the evidence did show that the plaintiff’s administrative work did not\n                    change substantially from what he carried out pre-accident. However, in light of\n                    the fact that the plaintiff’s business is expanding and increasing in\n                    profits, it would be unsafe to assume that in future he will always be a full\n                    time driver for his company concurrently with his increasing managerial\n                    role.37     A number of local cases of claimants in sole\n                    proprietorships may provide some guidance. InWong Kim Lan v\n                        Christie Kolandasamy[2004] SGDC 234 (“Wong Kim Lan”), the District Court awarded a sole\n                    proprietor a sum of $45,000 for loss of earning capacity. The sole proprietor\n                    designed jewellery for manufacture within her own factories and recommended\n                    designs to customers. The Court drew an adverse inference against the sole\n                    proprietor and held that she had earned more after the accident because she\n                    failed to produce evidence to prove her post-accident income. Although the sole\n                    proprietor hired more designers to assist her in her work, she did not claim as\n                    in the present case that she should be compensated for the additional cost of\n                    designers and therefore there was also no evidence provided for this aspect. A\n                    key distinguishing factor ofWong Kim Lanfrom the\n                    present case is that the business of the sole proprietor there was on a much\n                    larger scale than the plaintiff’s -- her business had grown from 5 in\n                    Singapore and 200 in China to 10 in Singapore and 300 in China.Wong Kim Lanwould be a situation where it was so clear\n                    that the claimant was more profitable in his or her managerial role that the\n                    appropriate deduction of the claimant’s managerial work would likely leave\n                    no claim left for loss of future earnings.38     InKoh Soon Pheng v Tan Kah\n                        Eng[2003] 2 SLR(R) 538 (“Koh\n                        Soon Pheng”), the High Court upheld an AR’s award of\n                    $180,000 for loss of earning capacity to a 42 year old sole-proprietor who owned\n                    a motorcycle workshop and whose specific skill was to repair large motorcycles\n                    with high capacity engines. The High Court had upheld the AR’s award for\n                    loss of earning capacity instead of loss of future earnings as the High Court\n                    had found that it was too speculative to determine how well the claimant’s\n                    business would perform in future. It is noteworthy that the Court stated at\n                        [17]:No doubt the plaintiff would earn a little less because\n                            he would have to incur wages which would not have been payable had he\n                            remained able to do the work on his own, but this does not\n                        mean that the plaintiff’s business cannot still be brought back to a\n                        profitable situation.[emphasis added]While the Court recognised the loss of earnings similar to the present\n                    case when the claimant had to hire someone to do the work he used to do, no\n                    award was made since the claimant there did not actually claim to have hired\n                    someone to supplement his reduced working abilities. InKoh\n                        Soon Pheng, the business was also making losses.39     InAng Leng Hock v Leo Ee\n                        Ah[2004] 2 SLR(R) 361 (“Ang\n                        Leng Hock”) , the claimant was an independent contractor\n                    for Grand Court providing services for outdoor catering functions. He was\n                    awarded loss of earning capacity at a multiplicand of $1,100 with a multiplier\n                    of 10 to compensate for his injury that prevented him from being able to carry\n                    heavy loads. The multiplicand of $1,100 was to reflect the cost of hiring a\n                    worker to help the claimant carry heavy loads. The plaintiff relied on this case\n                    to support his claim for loss of future earnings. However, while it was clear inAng Leng Hockthat the award would compensate\n                    for the claimant’s inability to carry heavy loads in his job, the\n                    plaintiff would still need to prove that he needed to be compensated as afull timedriver of Tom Express despite his\n                    increased managerial role.40     On an examination of the other cases, it is\n                    clear that the award in each case was confined to the specific facts and\n                    evidence produced before the Court, because the Court would be unable to award\n                    loss of future earnings when it cannot fix a proper multiplicand and multiplier.\n                    The Court must also be wary of the fact that some of the older cases beforeChai Kang Wei Samueloperated on the premise\n                    that loss of future earnings and loss of earning capacity were awarded asalternativesand did not see them as\n                    conceptually distinct heads of damages.41     The plaintiff had claimed before the AR a sum\n                    of $495,000 for loss of future earnings based on Neo’s monthly fees of\n                    $2,750 as a multiplicand and a multiplier of 15 years, taking into account the\n                    plaintiff’s young age of 33 at the time of assessment. The AR had averaged\n                    the figures of Neo’s annual pay in 2008 and 2009 to a multiplicand of\n                    $30,659. The AR had then considered the inevitable business fluctuations of the\n                    plaintiff’s business and the fact that “the profit and loss\n                    statements of Tom Express showed that the costs of the business were high, with\n                    certain items of expense appearing obviously inflated and not supported by any\n                    documentary evidence” ([50] of the GD) to reduce the multiplier submitted\n                    by the plaintiff by half to 7. The AR awarded the plaintiff $214,613 for loss of\n                    future earnings.42     The basis for using the average figures of\n                    Neo’s annual pay in 2008 and 2009 as the multiplicand would not reflect\n                    what loss of future earnings is meant to compensate. If loss of future earnings\n                    is to compensate the plaintiff for his additional expense of always having to\n                    hire an additional courier to do the work he used to carry out personally, it\n                    would be more logical on the evidence provided to take the average annual salary\n                    of the drivers in the plaintiff’s business. The plaintiff had 3 drivers\n                    and Neo’s monthly salary used to be the highest of all the 3 drivers until\n                    Ahmadkalil had a raise in May 2010. The figures are set out below:NoDriverAnnual Salary in 2008Annual Salary in 20091Ahmadkalil$32,400$32,4002Gomes (only hired in October\n                                        2008)-$30,0003Neo$31,403$29,915Only the annual salary for 2008 and 2009 was taken as there was\n                    insufficient evidence to calculate the annual salaries of the drives for 2010. I\n                    am of the view that the appropriate multiplicand (averaging the annual salary of\n                    all 3 drivers for 2008 and 2009) would be $31,223.60.43     The parties did not submit that the award for\n                    loss of future earnings should be reduced by income tax payable and the\n                    AR’s award did not deduct any income tax. I believe it should and a fair\n                    deduction to reflect the income tax for the plaintiff’s income bracket\n                    would be $2,000 from the multiplicand. Therefore, making the appropriate\n                    reduction for the plaintiff’s income tax, I find that the multiplicand for\n                    loss of future earnings should be $29,223.60.44     While the AR reduced the multiplier to take\n                    account of the inevitable fluctuations in the business of Tom Express and the\n                    inflated expenses of plaintiff’s business accounts, she did not make the\n                    appropriate deduction for the value received by the plaintiff in carrying out a\n                    greater managerial role in Tom Express. Due weight should have been given to the\n                    fact that the plaintiff had always performeddualroles (both managerial and operational) and the reality of the business was that\n                    it had grown from a 2 man 1 vehicle sole-proprietorship to one having 3 drivers\n                    and 2 lorries with the evidence suggesting that it was likely to grow further in\n                    the future. Hence, the necessary and appropriate deduction for the value of the\n                    plaintiff’s increased capacity for managerial work in future would be to\n                    reduce the multiplier to 3. This would more fairly reflect what the plaintiff\n                    had actually lost. I therefore reduce the AR’s award for loss of future\n                    earnings to $87,670.80.(iii)   Did the AR err in law or fact in her award for loss of\n                earning capacity?45     The Appellant submitted that the plaintiff at\n                    the hearing below did not submit on a claim for loss of earning capacity in\n                    addition to an award for loss of future earnings. This is not entirely correct\n                    as the plaintiff’s submissions below did argue for an award of loss of\n                    earning capacity as in the alternative to loss of future earnings. Furthermore,\n                    since an award for loss of earning capacity is part of general damages, it need\n                    not be specifically pleaded. The plaintiff had submitted that:[h]ad the [AR] awarded a multiplier closer to 15, the Plaintiff would\n                        agree that the award for loss of earning capacity would have been excessive\n                        and overlapping with the award for loss of future earnings.46     I am of the view that the AR applied the\n                    correct legal test for an award for loss of earning capacity – and had\n                    carefully assessed if (i) there was a substantial or real risk that the\n                    plaintiff would lose his present job at some time or before the estimated end of\n                    his working life and (ii) whether the plaintiff would be disadvantaged in the\n                    open employment market because of his injuries. The evidence did support the\n                    plaintiff’s contention that there was a real risk that he would lose the\n                    ability to sustain Tom Express. His business was highly dependent on his\n                    contract with DHL and Gee of DHL had testified that the plaintiff’s\n                    inability to personally drive and meet customers would be a factor relevant in\n                    the renewal of the DHL contract. However, the AR was right in assessing this\n                    risk conservatively as it was undisputed that DHL had renewed the\n                    plaintiff’s contract twice after the accident, despite the fact that the\n                    plaintiff could no longer personally delivery the goods.47     If the plaintiff was unable to run Tom Express\n                    and had to seek alternative employment, he would be seriously disadvantaged as\n                    he has been a driver all his life. However, he would not be able to tap on his\n                    driving experience whilst his highest educational qualification was only\n                    completion of his primary school examinations. Any sedentary job the plaintiff\n                    could manage to get in the open market would pay him far below what he was\n                    earning now. Consequently, the AR’s lump sum award of $30,000 for loss of\n                    earning capacity was fair and is accordingly upheld.Conclusion48     While I accept that the AR’s award for\n                    pre-trial loss of earnings and loss of earning capacity should be upheld, her\n                    award for loss of future earnings should be reduced from $214,613 to $\n                    87,670.80.49     Although the award to the plaintiff for loss\n                    of future earnings has been substantially reduced, I note that the Appellants\n                    have only succeeded on one of their three main grounds of appeal. Consequently,\n                    although they are entitled to costs of the Appeal, I reduce the costs to the\n                    Appellants by two-thirds from $3,000 to $1,000 but with disbursements to them on\n                    a reimbursement basis. I will not disturb the costs order made\n                below.",
        "Principles applicable to appeals on assessment of damages": "18     The Court of Appeal inSingapore Airlines Ltd v Tan Shwu Leng[2001] 3 SLR(R) 439 made\n                    it clear that the judge was not constrained by the principles set out inDavies v Powell Duffryn Associated Colleries[1942] AC 601 when considering an appeal on assessment of damages in a\n                    Registrar’s Appeal. The Court of Appeal held at [17] that all appeals from a Registrar to a\n                    judge in chambers were dealt with by an actual rehearing of the application and\n                    the judge was entitled to treat the matter as if it came before him or her for\n                    the first time.",
        "(i)   Did the AR err in law or fact in her award for loss of\n                pre-trial earnings?": "19     The assessment was conducted by the AR over 6\n                    days - 1 to 3 November 2010, 3 to 4 January 2011 and 6 January 2011. Pre-trial\n                    loss of earnings is an item of special damages and needs to be specifically\n                    proven to be recoverable (Wee Sia Tian v Long Thik\n                        Boon[1996] 3 SLR(R) 513 at 517F). The critical\n                    question to answer is, was the plaintiff’s cost of hiring a replacement to\n                    cover his courier assignments from the time of his accident to the date of\n                    assessment a real assessable loss proven by the evidence, notwithstanding that\n                    the plaintiff’s business actually increased in\n                profitability? 20     The Appellants argued that the plaintiff had\n                    failed to prove any real assessable drop in earnings because his income actually\n                    increased during the period between the time of accident and the date of\n                    assessment. The Appellants disagreed that his earnings were affected by the sum\n                    total of what he paid an extra worker to do on his behalf. The AR had rejected\n                    the Appellants’ argument that loss of pre-trial earnings can only be\n                    calculated by comparing what the plaintiff earned pre-accident and what he\n                    earned post-accident. The AR cited the proposition inChai\n                        Kang Wei Samuelat [29]\n                    that: The overarching objective of awarding damages is tocompensatethe injured victim by restoring him or her to the\n                        position that he or she would have been (in a monetary sense) had the\n                        accident not happened. (emphasis in original) 21     The Appellants had argued that this\n                    proposition was used in the context of loss of future earnings and should not be\n                    applied for pre-trial loss of earnings. This argument of the Appellants is\n                    flawed. While the proposition was used inChai Kang Wei\n                        Samuelin the context of loss of future earnings, the proposition\n                    being applied is clearly ageneralprinciple\n                    embodying the compensatory purpose of damages in personal injuries as stated by\n                    Lord Blackburn inLivingstone v Raywards Coal Co(1880) 5 App Cas 25 at 39: …where any injury is to be compensated by damages, in settling the\n                        sum of money to be given for reparation of damagesyou\n                            should nearly as possible get at that sum of money which will put the\n                            party who has been injured, or who has suffered, in the same position as\n                            he would have been if he had not sustained the wrongfor\n                        which he is now getting his compensation or reparation. (emphasis added) 22     InChai Kang Wei\n                        Samuel, the claimant’s post-accident income was slightly\n                    more than her average yearly income pre-accident. However, the Court of Appeal\n                    held at [28] that it would be wholly\n                    inequitable to hold that the victim suffered no loss just because her\n                    post-accident income was slightly more than her average yearly income\n                    pre-accident. The injury had affected the number of hours the claimant was able\n                    to work and a more accurate reflection of her loss was the actual number of\n                    hours she had worked before the accident multiplied by the actual rate she was\n                    earning after the accident (since the rate was normally higher with inflation\n                    and her greater experience). 23     In the present case, the AR held that to put\n                    the plaintiff in the position he had been before the accident meant that he\n                    should be compensated for the cost of paying someone to do his work, regardless\n                    of the increased profitability of his business. For sole proprietorship cases, I\n                    am of the view that the nature of the claimant’s job should be carefully\n                    examined. The AR’s reasoning was based on her assumption that to place the\n                    plaintiff in the position he was in before the accident, he should be\n                    compensated for having to hire another driver to replace him in his driving\n                    role. However, the difficulty in assessing the plaintiff’s damages was due\n                    to the fact that he haddualroles – acting\n                    both in amanagerialandoperational(iedriving) capacity\n                    for Tom Express. The Appellants would not be wrong in arguing that it is\n                    possible Tom Express became more profitable because the plaintiff was focusing\n                    his energies more fully on his managerial role. The problem with calculating\n                    loss of earnings and profits in a sole proprietorship context is that there are\n                    many uncertain contingencies that will affect the final profits of a business.\n                    These are valid concerns in assessing pre-trial loss of earnings for the\n                    plaintiff. 24     The AR did not refer to other cases besidesChai Kang Wei Samuelin her analysis of\n                    pre-trial loss of earnings. Neither did the parties submit any authorities with\n                    similar facts on point where the Court had awarded loss of pre-trial earnings\n                    despite the victim’s business being more profitable. In this regard, the\n                    English Court of Appeal case ofPhillips v Holliday &\n                        ANR[2001] EWCA Civ 1074 (“Phillips v Holliday”) is particularly useful. InPhillips v Holliday, the claimant was awarded\n                    loss of pre-trial earnings despite his business being more profitable. The\n                    claimant worked for a company both administratively (as a contracts manager) and\n                    manually (painter and decorator). The Court of Appeal treated the profits of the\n                    company as the claimant’s own, as the company was owned fully by the\n                    claimant’s wife with the wife also being the sole director of the company.\n                    Similar to our case, the Court of Appeal found that the claimant’s\n                    injuries severely limited his ability to carry out the manual work he used to be\n                    able to do for the company as a painter and decorator and he could only carry\n                    out administrative work. Most pertinently, the Court of Appeal held at [20] that: … the fact that the claimant has made a success of the business as\n                        an administrator and supervisordoes not mean either that\n                            he might not have been more successful if able to do much of the manual\n                            work himself… [emphasis added]. 25     The Court of Appeal also addressed another\n                    valid concern in our case at [25]\n                    of: …the fact that the claimant had worked in a\n                            managerial capacity after the accident. How then should that fact be\n                            reflected in this estimate of damages?One would think that\n                        if the claimant was able to spend more time on the administration side of\n                        the business, and if the business as was suggested by the claimant was\n                        growing, then profits would increase as in fact they did. [emphasis added] 26     The Court of Appeal recognised that the\n                    inability of the claimant to carry out the manual work that he used to do wasa losseven if the company had an increase in\n                    profit at [30]: The profits then picked up,but if the company would be\n                            having to pay painters to do the work the claimant could otherwise have\n                            done, it is likely that the profitability was not as great as it should\n                            be. If the figure of £269 were made a net figure of say\n                        £200 [the evidence was that the claimant was taking from the business a\n                        figure of around £269 immediately prior to the accident]and if a deduction is made in accordance with the figures shown\n                            in the schedule to Mr Mould’s report (page 118) as those which he\n                            should have earned as an administrator, then on my\n                        calculation one reaches a figure of £18,748 as the loss between\n                        accident and trial. [emphasis added] 27     It is also important to consider how the Court\n                    of Appeal inPhillips v Hollidaydistinguished the\n                    case ofAshcroft v Curtin[1971]\n                    1 WLR 1731 (“Ashcroft v\n                    Curtin”) at [30]: This does not seem to me to be a case likeAshcroft v\n                            Curtin[1971] 1 WLR 1731 CA in which the Court of Appeal felt\n                        driven to hold that the records of a business were such that there was\n                        simply no basis for making a calculation. This is a case where albeit it is\n                        difficult to make a calculation the starting point is there and the court\n                        should strive to make a proper deduction in order to reach an appropriate\n                        figure. 28     InAshcroft v\n                        Curtin, the claimant was a skilled engineer who carried a\n                    successful business through a private company of which he was the active\n                    managing director. The profits of the company had declined but the claimant had\n                    failed to claim loss of profits owing to his disabilities because the\n                    company’s accounts were unreliable. The Court of Appeal inAshcroft v Curtinhad made an observation that may be\n                    helpful to the present case: But I am very doubtful about the validity of this approach,for if another man had been engaged to do the plaintiff’s\n                            pre-accident work, it does not follow that the profits would have gone\n                            down by the amount of his salary. On the contrary, I see the\n                        force of the observation of Mr. May that, as no\n                            other man was in fact engaged, it is irrelevant to consider what would\n                            have happened if he had been, so far from producing a drop in\n                        profitability, his engagement might equally well have led to a realisation\n                        of the 10 per cent increase which Mr. Boulter assumed would have enured\n                        but for the accident. [emphasis added] Theobiter dictainAshcroft v Curtinsuggests that the Court cannot assume that the\n                    profits may go down by the amount of salary used to hire the replacement for the\n                    pre-accident work, for the replacement may have cause the business to be more\n                    profitable. However, whatPhillips v Hollidayis\n                    stating is thateven if the business becomes more\n                        profitable, the profits could have been even greater if the\n                    claimant did not have to bear the additional cost of hiring the replacement for\n                    doing the work he could have done himself. To prevent over-compensation the\n                    Court of Appeal inPhillips v Hollidaywould then\n                    consider the appropriate deduction for the value of the claimant’s\n                    increased managerial role. 29     Therefore, although the claimant inPhillips v Hollidaydid not claim for the expense of\n                    hiring someone to paint on his own behalf as in our case, in principle, the\n                    plaintiff can claim for the cost of paying someone to do his work despite the\n                    increase profits earned by Tom Express. On closer examination of the facts, the\n                    plaintiff had hospitalisation leave from the accident up to 14 September 2010\n                    – he clearly could not physically carry out the courier services he was\n                    contracted to do. He had to hire someone to deliver the goods on his personal\n                    route to maintain the contract with DHL. I note that the plaintiff’s\n                    contract with DHL in 2005 required him to provide two delivery men to carry out\n                    the work while his current contract with DHL requires him to employ at a minimum\n                    of 3 full time delivery men. However, Gee Say Liang (“Gee”), the\n                    manager of DHL had clarified at the assessment hearing that the decision to hire\n                    an extra driver and buy an extra van in 2008 was the plaintiff’s and had\n                    nothing to do with DHL: Q:Did DHL request the Plaintiff to top up his\n                            resources by hiring one extra courier and buying one extra van or was\n                            this decision made by the Plaintiff on his own? This is in\n                        2008. A:That decision was made by the Plaintiff but we sat\n                            down with him and we told him that your area is growing, if you think\n                            you can handle the growth by just maintaining 2 then that is fine, we\n                            are not forcing him to hire 1 extra man. But if he keeps to 2 and he\n                            cannot manage the business then that would affect his performance and\n                            the performance of the company. The decision was made by him – not\n                            something we forced onto him. 30     On the evidence, I am of the view that the\n                    plaintiff has proven on a balance of probabilities that he had hired Neo to\n                    replace him in his courier assignments. The plaintiff had also testified that he\n                    had to hire a replacement driver to prevent his contract with DHL from being\n                    terminated. However, the AR was right in rejecting the plaintiff’s claim\n                    for the cost of hiring i.Supplies as pre-trial loss of earning. If the principle\n                    is to compensate the plaintiff for the cost of paying someone to dohis work, it is only reasonable to compensate him for\n                    the cost of the driver he hired to replace him. As the AR stated at GD [41], “[i]t seemed unbelievable that\n                    the plaintiff would have single-handedly been able to do all the work that Neo\n                    and i.Supplies did.” 31     Even if I accept the $117,271.00 cost of\n                    hiring Neo from the period of accident to the date of assessment as pre-trial\n                    loss of earnings, the further question that needs to be asked and that was asked\n                    inPhillips v Hollidayis whether an appropriate\n                    deduction should be made for the fact that the plaintiff could take on\n                    additional managerial duties after the accident. The problem when the claimant\n                    used to occupy dual capacities (administrative/managerial and\n                    operational/manual) is the Court is naturally wary of over-compensating the\n                    claimant. InPhillips v Holliday, the Court of\n                    Appeal had data from which to deduct the appropriate amount for the\n                    claimant’s administrative work. In our case, we do not have such data and\n                    the plaintiff submitted that: [he] did not make any significant contribution to his business as his\n                        primary role prior to the accident was to be on the road and make the\n                        courier deliveries.His role post-accident did not evolve\n                            into anything more as there was never any significant or regular\n                            managerial duties to perform. [emphasis added] 32     The evidence on record does provide support\n                    for the fact that the plaintiff’s role post-accident did not evolve into\n                    substantial managerial duties. His evidence was that he only needed to go back\n                    to the office to check on matters 4-5 times a year: Q:Am I correct to say that even though you had\n                            hospitalization leave up to 14 September 2010, and aside from the\n                            times you were in hospital for treatment, you had been able to run your\n                            business from accident to date as manager of Tom Express? A:I can run the business but I have nothing to do. At\n                            times I would go back to the office when there are complaints from\n                            customers. Where there is any problem DHL will deal directly with staff\n                            who is in my office. But they would prefer to deal directly with us than\n                            with my staff because they cannot communicate very well. I will go back\n                            to the office 4-5 times a year to settle the complaints. At other times\n                            I would go back to office to ensure things are going well, about once a\n                            month. I am very worried and scared that I will lose this agreement with\n                            DHL. Neo, the plaintiff’s driver, also supported the\n                    plaintiff’s evidence that the plaintiff only came to office a few times a\n                    year; Neo testified that: Q:How many times a year? A:[The Plaintiff] would come over whenever DHL holds\n                            meetings for contractors. This would be about 3-4 times a year. He would\n                            buy the refreshments and bring them over whenever there is such a\n                            meeting. … Q:In your daily work for Tom Express delivering for\n                            DHL, how often do you have to communicate with the\n                        Plaintiff? A:I do not have to communicate with him all the time.\n                            For e.g. where there are certain things brought up during courier\n                            meetings that we have to let him know I will update him. … Q:Based on what you said earlier, that the Plaintiff\n                            goes for 3-4 contractors’ meetings and sometimes he has\n                            instructions. How many times a year does he convey instructions to\n                            you? A:Twice. Gee also testified that the plaintiff only had to attend monthly\n                    meetings with DHL: Q:You meet the Plaintiff 3-4 times a\n                        year? A:More than that. We have monthly meetings at least\n                            once a month with all our contractors. That is when we go through\n                            performance reviews with them. Monthly meeting to find out if there are\n                            any issues in the company. 33     Tom Express was started only in 2005 and while\n                    the business had expanded from 2 to 3 drivers and two lorries, the business is\n                    admittedly still small-scale. In the circumstances, any additional value of the\n                    plaintiff’s administrative work from the date of accident to the\n                    assessment would likely be nominal. It would be fair to award him the sum of\n                    $117,271 as pre-trial loss of earnings for the cost of hiring Neo without any\n                    deduction for administrative work. Accordingly, I uphold the AR’s award\n                    for pre-trial loss of earnings.",
        "(ii)   Did the AR err in law or fact in her award for loss of\n                future earnings?": "34     The AR’s reasoning for this award was\n                    similar to her reasoning for pre-trial loss of earnings. At [44] of the GD, the AR said: …what was important was that but for the accident, the Plaintiff\n                        could have earned even more by carrying out courier assignments himself\n                        rather than paying Neo to do so on his behalf. In my judgment, the Plaintiff\n                        was unlikely to be able to return to carrying out courier assignments\n                        personally in the near future and would continue to need to hire someone to\n                        cover him. The AR also found that there was sufficient evidence before her to fix\n                    a multiplier and multiplicand to award the Plaintiff loss of future\n                    earnings. 35     InPhillips v\n                        Holliday, the Court of Appeal had also awarded loss of future\n                    earnings to the claimant at [33]: By being able to spend more time on administration and supervision it\n                        seems at least that the business has improved from the pre-accident\n                        position.It might however have improved further if the\n                            claimant had been able to do more manual workand there is no\n                        doubt that if the business does not flourish the claimant is at a serious\n                        disadvantage in the labour market. The claimant is entitled to damages to\n                        reflect both aspects. [emphasis added] The Court of Appeal had also added at [34] that “[t]he next question is what deduction should\n                    be made for the fact thatmoney will still be paid out to the\n                        claimant albeit his role will be that of administratorand the\n                    manual work that he can do will be much more limited”. Previously for\n                    pre-trial loss of earnings, the concern was also that the claimant may be\n                    overcompensated if there was no appropriate deduction for the value of the\n                    claimant’s increased capacity for managerial work. It was noted that the\n                    Court of Appeal inPhillips v Hollidayawarded a\n                    sum for loss of future earnings and loss of earning capacity together, but it\n                    would be more appropriate to assess them separately in this case. 36     I believe from her GD that the AR may have not\n                    fully considered the aspect of deducting the value of the plaintiff’s\n                    increased managerial role after the accident. For pre-trial loss of earnings,\n                    the evidence did show that the plaintiff’s administrative work did not\n                    change substantially from what he carried out pre-accident. However, in light of\n                    the fact that the plaintiff’s business is expanding and increasing in\n                    profits, it would be unsafe to assume that in future he will always be a full\n                    time driver for his company concurrently with his increasing managerial\n                    role. 37     A number of local cases of claimants in sole\n                    proprietorships may provide some guidance. InWong Kim Lan v\n                        Christie Kolandasamy[2004] SGDC 234 (“Wong Kim Lan”), the District Court awarded a sole\n                    proprietor a sum of $45,000 for loss of earning capacity. The sole proprietor\n                    designed jewellery for manufacture within her own factories and recommended\n                    designs to customers. The Court drew an adverse inference against the sole\n                    proprietor and held that she had earned more after the accident because she\n                    failed to produce evidence to prove her post-accident income. Although the sole\n                    proprietor hired more designers to assist her in her work, she did not claim as\n                    in the present case that she should be compensated for the additional cost of\n                    designers and therefore there was also no evidence provided for this aspect. A\n                    key distinguishing factor ofWong Kim Lanfrom the\n                    present case is that the business of the sole proprietor there was on a much\n                    larger scale than the plaintiff’s -- her business had grown from 5 in\n                    Singapore and 200 in China to 10 in Singapore and 300 in China.Wong Kim Lanwould be a situation where it was so clear\n                    that the claimant was more profitable in his or her managerial role that the\n                    appropriate deduction of the claimant’s managerial work would likely leave\n                    no claim left for loss of future earnings. 38     InKoh Soon Pheng v Tan Kah\n                        Eng[2003] 2 SLR(R) 538 (“Koh\n                        Soon Pheng”), the High Court upheld an AR’s award of\n                    $180,000 for loss of earning capacity to a 42 year old sole-proprietor who owned\n                    a motorcycle workshop and whose specific skill was to repair large motorcycles\n                    with high capacity engines. The High Court had upheld the AR’s award for\n                    loss of earning capacity instead of loss of future earnings as the High Court\n                    had found that it was too speculative to determine how well the claimant’s\n                    business would perform in future. It is noteworthy that the Court stated at\n                        [17]: No doubt the plaintiff would earn a little less because\n                            he would have to incur wages which would not have been payable had he\n                            remained able to do the work on his own, but this does not\n                        mean that the plaintiff’s business cannot still be brought back to a\n                        profitable situation. [emphasis added] While the Court recognised the loss of earnings similar to the present\n                    case when the claimant had to hire someone to do the work he used to do, no\n                    award was made since the claimant there did not actually claim to have hired\n                    someone to supplement his reduced working abilities. InKoh\n                        Soon Pheng, the business was also making losses. 39     InAng Leng Hock v Leo Ee\n                        Ah[2004] 2 SLR(R) 361 (“Ang\n                        Leng Hock”) , the claimant was an independent contractor\n                    for Grand Court providing services for outdoor catering functions. He was\n                    awarded loss of earning capacity at a multiplicand of $1,100 with a multiplier\n                    of 10 to compensate for his injury that prevented him from being able to carry\n                    heavy loads. The multiplicand of $1,100 was to reflect the cost of hiring a\n                    worker to help the claimant carry heavy loads. The plaintiff relied on this case\n                    to support his claim for loss of future earnings. However, while it was clear inAng Leng Hockthat the award would compensate\n                    for the claimant’s inability to carry heavy loads in his job, the\n                    plaintiff would still need to prove that he needed to be compensated as afull timedriver of Tom Express despite his\n                    increased managerial role. 40     On an examination of the other cases, it is\n                    clear that the award in each case was confined to the specific facts and\n                    evidence produced before the Court, because the Court would be unable to award\n                    loss of future earnings when it cannot fix a proper multiplicand and multiplier.\n                    The Court must also be wary of the fact that some of the older cases beforeChai Kang Wei Samueloperated on the premise\n                    that loss of future earnings and loss of earning capacity were awarded asalternativesand did not see them as\n                    conceptually distinct heads of damages. 41     The plaintiff had claimed before the AR a sum\n                    of $495,000 for loss of future earnings based on Neo’s monthly fees of\n                    $2,750 as a multiplicand and a multiplier of 15 years, taking into account the\n                    plaintiff’s young age of 33 at the time of assessment. The AR had averaged\n                    the figures of Neo’s annual pay in 2008 and 2009 to a multiplicand of\n                    $30,659. The AR had then considered the inevitable business fluctuations of the\n                    plaintiff’s business and the fact that “the profit and loss\n                    statements of Tom Express showed that the costs of the business were high, with\n                    certain items of expense appearing obviously inflated and not supported by any\n                    documentary evidence” ([50] of the GD) to reduce the multiplier submitted\n                    by the plaintiff by half to 7. The AR awarded the plaintiff $214,613 for loss of\n                    future earnings. 42     The basis for using the average figures of\n                    Neo’s annual pay in 2008 and 2009 as the multiplicand would not reflect\n                    what loss of future earnings is meant to compensate. If loss of future earnings\n                    is to compensate the plaintiff for his additional expense of always having to\n                    hire an additional courier to do the work he used to carry out personally, it\n                    would be more logical on the evidence provided to take the average annual salary\n                    of the drivers in the plaintiff’s business. The plaintiff had 3 drivers\n                    and Neo’s monthly salary used to be the highest of all the 3 drivers until\n                    Ahmadkalil had a raise in May 2010. The figures are set out below: NoDriverAnnual Salary in 2008Annual Salary in 20091Ahmadkalil$32,400$32,4002Gomes (only hired in October\n                                        2008)-$30,0003Neo$31,403$29,915   Only the annual salary for 2008 and 2009 was taken as there was\n                    insufficient evidence to calculate the annual salaries of the drives for 2010. I\n                    am of the view that the appropriate multiplicand (averaging the annual salary of\n                    all 3 drivers for 2008 and 2009) would be $31,223.60. 43     The parties did not submit that the award for\n                    loss of future earnings should be reduced by income tax payable and the\n                    AR’s award did not deduct any income tax. I believe it should and a fair\n                    deduction to reflect the income tax for the plaintiff’s income bracket\n                    would be $2,000 from the multiplicand. Therefore, making the appropriate\n                    reduction for the plaintiff’s income tax, I find that the multiplicand for\n                    loss of future earnings should be $29,223.60. 44     While the AR reduced the multiplier to take\n                    account of the inevitable fluctuations in the business of Tom Express and the\n                    inflated expenses of plaintiff’s business accounts, she did not make the\n                    appropriate deduction for the value received by the plaintiff in carrying out a\n                    greater managerial role in Tom Express. Due weight should have been given to the\n                    fact that the plaintiff had always performeddualroles (both managerial and operational) and the reality of the business was that\n                    it had grown from a 2 man 1 vehicle sole-proprietorship to one having 3 drivers\n                    and 2 lorries with the evidence suggesting that it was likely to grow further in\n                    the future. Hence, the necessary and appropriate deduction for the value of the\n                    plaintiff’s increased capacity for managerial work in future would be to\n                    reduce the multiplier to 3. This would more fairly reflect what the plaintiff\n                    had actually lost. I therefore reduce the AR’s award for loss of future\n                    earnings to $87,670.80.",
        "(iii)   Did the AR err in law or fact in her award for loss of\n                earning capacity?": "45     The Appellant submitted that the plaintiff at\n                    the hearing below did not submit on a claim for loss of earning capacity in\n                    addition to an award for loss of future earnings. This is not entirely correct\n                    as the plaintiff’s submissions below did argue for an award of loss of\n                    earning capacity as in the alternative to loss of future earnings. Furthermore,\n                    since an award for loss of earning capacity is part of general damages, it need\n                    not be specifically pleaded. The plaintiff had submitted that: [h]ad the [AR] awarded a multiplier closer to 15, the Plaintiff would\n                        agree that the award for loss of earning capacity would have been excessive\n                        and overlapping with the award for loss of future earnings. 46     I am of the view that the AR applied the\n                    correct legal test for an award for loss of earning capacity – and had\n                    carefully assessed if (i) there was a substantial or real risk that the\n                    plaintiff would lose his present job at some time or before the estimated end of\n                    his working life and (ii) whether the plaintiff would be disadvantaged in the\n                    open employment market because of his injuries. The evidence did support the\n                    plaintiff’s contention that there was a real risk that he would lose the\n                    ability to sustain Tom Express. His business was highly dependent on his\n                    contract with DHL and Gee of DHL had testified that the plaintiff’s\n                    inability to personally drive and meet customers would be a factor relevant in\n                    the renewal of the DHL contract. However, the AR was right in assessing this\n                    risk conservatively as it was undisputed that DHL had renewed the\n                    plaintiff’s contract twice after the accident, despite the fact that the\n                    plaintiff could no longer personally delivery the goods. 47     If the plaintiff was unable to run Tom Express\n                    and had to seek alternative employment, he would be seriously disadvantaged as\n                    he has been a driver all his life. However, he would not be able to tap on his\n                    driving experience whilst his highest educational qualification was only\n                    completion of his primary school examinations. Any sedentary job the plaintiff\n                    could manage to get in the open market would pay him far below what he was\n                    earning now. Consequently, the AR’s lump sum award of $30,000 for loss of\n                    earning capacity was fair and is accordingly upheld.",
        "Conclusion": "48     While I accept that the AR’s award for\n                    pre-trial loss of earnings and loss of earning capacity should be upheld, her\n                    award for loss of future earnings should be reduced from $214,613 to $\n                    87,670.80. 49     Although the award to the plaintiff for loss\n                    of future earnings has been substantially reduced, I note that the Appellants\n                    have only succeeded on one of their three main grounds of appeal. Consequently,\n                    although they are entitled to costs of the Appeal, I reduce the costs to the\n                    Appellants by two-thirds from $3,000 to $1,000 but with disbursements to them on\n                    a reimbursement basis. I will not disturb the costs order made\n                below."
    }
}