{
    "case_title": "Valency International Trading Pte Ltd\n      v\n      Alton International Resources Pte Ltd",
    "ncitation": "[2011] SGHC 50",
    "coram": "Jordan Tan AR",
    "sections": {
        "Introduction": "1       This is an application by the defendant to\n                    strike out the plaintiff’s statement of claim under Order 18 rule 19 of\n                    the Rules of Court (Cap 322, R 5, 2006 Rev Ed) on the ground that\n                    the plaintiff’s claim is frivolous and vexatious as well as an abuse of\n                    the process of the Court. The defendant’s counsel, Mr Toh Kian Sing\n                    SC, says this is so because the plaintiff’s claim is obviously\n                    unsustainable.",
        "The plaintiff’s claim": "2       The plaintiff’s pleaded case is as\n                    follows. Through email correspondence, the parties entered into an agreement on\n                    27 July 2009 for the defendant to sell to the plaintiff 65,000 metric tonnes\n                    (more or less 10% at the defendant’s option) of iron ore fines at US$86\n                    per dry metric ton, with a laycan period from 1 to 10 August 2009. To record the\n                    terms of this agreement, the plaintiff forwarded a formal purchase contract to\n                    the defendant. There was, however, an error in this document. It stated that\n                    payment was to be made in two stages with 97% through a letter of credit and a\n                    balance of 3% through telegraphic transfer instead of the agreed 100% payment\n                    through a letter of credit. Despite this error, a binding agreement had already\n                    been concluded through the email correspondence and this contract was a mere\n                    formality to record the terms of the agreement. 3       Four days later, on 31 July 2009, a\n                    representative of the defendant sent an email to the plaintiff denying that an\n                    agreement had been reached between the parties, citing the error in the formal\n                    purchase contract. In so doing, the defendant had repudiated the agreement and\n                    the plaintiff has suffered loss. The plaintiff claimed US$1,353,105 in\n                    damages.",
        "Sole issue raised": "4       For the purposes of this application,\n                    Mr Toh said the defendant would take the plaintiff’s pleaded case at\n                    its highest because even then, it is obviously unsustainable. Specifically, even\n                    if it were true that an agreement had been concluded, in failing to open a\n                    letter of credit before the laycan period, the plaintiff had itself breached a\n                    condition precedent to the defendant’s performance. As a result, the\n                    defendant need not have performed. 5       The plaintiff’s counsel,\n                    Mr Srivathsan, accepted that the opening of a letter of credit before the\n                    laycan period was a condition precedent to the shipment of the goods. However,\n                    he argued that in the face of the defendant’s renunciation of the\n                    agreement through the email of 31 July 2009 by wrongfully denying its\n                    existence, it would be futile for the plaintiff to open a letter of credit. This\n                    was why the plaintiff did not open a letter of credit but instead wrote to the\n                    defendant, through its representative, on 1 August 2009 (and on 3 and\n                    7 August thereafter) to ask the defendant to sign a version of the formal\n                    purchase contract correcting the aforesaid errors. 6       Because the defendant has taken the position\n                    that for the purpose of this application it will take the plaintiff’s\n                    pleaded case at its highest, I proceed on the assumption that (1) the agreement\n                    for the sale of iron ore fines was valid; and (2) the defendant had communicated\n                    unequivocally, through its representative, on 31 July 2009 that this\n                    agreement did not exist. 7       Hence, the single issue raised is whether the\n                    defendant’s renunciation of the agreement on 31 July 2009 freed the\n                    plaintiff from its obligation to open the letter of credit. If it did not, the\n                    plaintiff’s claim is obviously unsustainable and should be struck out\n                    because, even taking its case at its highest, the plaintiff has breached a\n                    condition precedent with the result that the defendant did not have to perform.\n                    If it did, the plaintiff has a viable claim and there is no reason to strike it\n                    out.",
        "My decision": "8       The issue raised turns on the question of\n                    whether an innocent party, in the face of the wrongdoer’s renunciation of\n                    the contract, has an option, in addition to (1) acceptance of the renunciation\n                    so as to terminate and sue for damages or (2) affirmation of the contract and to\n                    continue to perform, to affirm the contract but be absolved from tendering\n                    further performance unless and until the wrongdoer gives reasonable notice that\n                    he is once again able and willing to perform (“the third\n                    option”). 9       The third option has been considered and\n                    rejected in English jurisprudence. InFercometal SARL v\n                        Mediterranean Shipping[1989] 1 AC 788\n                        (“Fercometal”), Lord Ackner,\n                    with whom the other law lords agreed, stated (at 805): When A wrongfully repudiates his contractual obligations in anticipation\n                        of the time for their performance, he presents the innocent party B with two\n                        choices. He may either affirm the contract by treating it as still in force\n                        or he may treat it as finally and conclusively discharged. There is no third\n                        choice, as a sort of via media, to affirm the contract and yet to be\n                        absolved from tendering further performance unless and until A gives\n                        reasonable notice that he is once again able and willing to perform. Such a\n                        choice would negate the contract being kept alive for the benefit ofbothparties and would deny the party who\n                        unsuccessfully sought to rescind, the right to take advantage of any\n                        supervening circumstance which would justify him in declining to complete.\n                        [emphasis original] 10     Nonetheless, there is of course some time\n                    given to the innocent party before he is due to perform to decide whether to\n                    terminate or affirm the contract (seeStocznia Gdanska SA v\n                        Latvian Shipping Co (No 2)[2002] 2 Lloyd’s\n                    Rep 436;Chitty on Contractsvol 1 (London:\n                    Sweet & Maxwell, 30thEd, 2008)\n                        (“Chitty on Contracts”) at\n                    [24-002]). 11     The Australian position is different. It\n                    accepts the existence of the third option. InPeter Turnbull\n                        & Co Pty Ltd v Mundas Trading Co (Australia) Pty Ltd(1954)\n                    90 CLR 235 (“Peter\n                    Turnbull”), a decision of the High Court of Australia, the\n                    parties had entered into an agreement for the sale of a quantity of oats to be\n                    shipped from Sydney. The appellant was obliged to nominate a ship to load the\n                    oats from Sydney in January or February 1951 and to give the respondent 14\n                    days’ notice of such nomination. In January, the respondent informed the\n                    appellant that they could not ship from Sydney and would ship from Melbourne\n                    instead. The appellant did not accept this proposal. The respondent persisted in\n                    its assertion that it could only ship from Melbourne. The sale did not go\n                    through and the appellant sued for damages. The issue before the court was\n                    whether the appellant’s failure to nominate a ship and give notice of such\n                    nomination precluded it from claiming damages for the respondent’s\n                    breach. 12     Dixon CJ held (at 248) that the\n                    respondent’s persistence in its position that it could not ship from\n                    Sydney, excused the appellant from its obligation to nominate a ship and to give\n                    notice of such nomination. Webb and Kitto JJ agreed. Kitto J took the\n                    view (at 251) that: The principle, which applies whenever the promise of one party, A, is\n                        subject to a condition to be fulfilled by the other party, B, may, I think,\n                        be stated as follows. If, although B is ready and willing to perform the\n                        contract in all respects on his part, A absolutely refuses to carry out the\n                        contract, and persists in the refusal until a time arrives at which\n                        performance of his promise would have been due if the condition had been\n                        fulfilled by B, A is liable to B in damages for breach of his promise\n                        although the condition remains unfulfilled. 13     Taylor J dissented. He rejected the third\n                    option, making the following observations (at 262): [The future rights of the innocent party] must also be determined\n                        according to his election; he may retain the benefitand\n                            riskof the contract or he may rescind and recover damages.\n                        But that he may not have both is, I should think, clear beyond doubt. Nor,\n                        having elected to keep the contract on foot, may he, after having failed to\n                        fulfil a condition precedent to his right to performance on the part of the\n                        other party, rescind upon a refusal, then continued, to perform the contract\n                        for,ex hypothesi, whatever ground is assigned\n                        for such a continued refusal the other party is not then under any\n                        obligation to perform the contract. 14Peter Turnbullwas one of the cases cited by counsel inFercometal(seeFercometalat\n                    792), but it was not discussed in the judgments of the law Lords. Nonetheless,\n                    the decision of the House of Lords to reject the third option makes it clear\n                    that it did not take the same position as the Australian High Court inPeter Turnbull. 15     The Australian High Court had the opportunity\n                    to reconsider its position inPeter Turnbullin\n                    the light ofFercometal. InForan and another v Wight and another(1989)\n                    168 CLR 385 (“Foran”), the\n                    vendors of certain property informed the purchasers two days before the date of\n                    completion that they were unable to register a right of way which was required\n                    of them under the sale and purchase agreement. On the date of completion,\n                    neither party took steps to complete. Two days thereafter, the purchasers gave\n                    the vendors a notice of rescission. The purchasers sought a declaration that\n                    they had rescinded the contract and sought a return of the deposit. The vendors\n                    contended that the notice of rescission was invalid on the ground that the\n                    purchasers themselves were not ready and willing to complete on the due date for\n                    want of funds. The vendors succeeded. 16     On appeal, the High Court held (with a\n                    majority of four to one) that the purchasers’ notice of appeal was not\n                    invalid and that they were entitled to the return of their deposit. Various\n                    reasons were given by the majority for this decision. Brennan and Dawson JJ\n                    took the view that although the purchasers were required to show that they were\n                    ready and willing to perform, the fact that the vendors had intimated that they\n                    were unable to complete relieved the purchasers of the need to show more than\n                    that they were not incapacitated from raising the necessary funds and had not\n                    resolved against doing so, and on the evidence they had discharged that burden.\n                    Brennan J (at 421-422) made the following observations: I would hold, in accordance withPeter\n                            TurnbullandMahoney v Lindsay... that an intimation of non-performance of an essential term of a contract\n                        amounts to repudiation and dispenses a party who acts upon it from\n                        performance of his dependent obligation though he does not rescind the\n                        contract. Therefore, I am unable, with respect, to agree with Lord\n                        Ackner’s rejection of what his Lordship described as a “third\n                        choice” in [Fercometal]: “When A wrongfully repudiates his contractual obligations in\n                            anticipation of the time for their performance, he presents the innocent\n                            party B with two choices. He may either affirm the contract by treating\n                            it as still in force or he may treat it as finally and conclusively\n                            discharged. There is no third choice, as a sort of via media, to affirm\n                            the contract and yet to be absolved from tendering further performance\n                            unless and until A gives reasonable notice that he is once again able\n                            and willing to perform. Such a choice would negate the contract being\n                            kept alive for the benefit ofbothparties\n                            and would deny the party who unsuccessfully sought to rescind, the right\n                            to take advantage of any supervening circumstance which would justify\n                            him in declining to complete.” The proposition that, if repudiation by anticipatory breach\n                        is not accepted, the contract subsists is undoubted; but it does not follow\n                        that an intimation by one party that tender of performance by the other will\n                        be nugatory cannot, if acted on, dispense the other from his obligation of\n                        performance under the contract by raising an equitable estoppel. It may be\n                        that Lord Ackner acknowledges some role for estoppels in this context for he\n                        said ...: “it is always open to [B], who has refused to accept\n                            [A’s] repudiation of the contract, and thereby kept the contract\n                            alive, to contend that in relation to a particular right or obligation\n                            under the contract, [A] is stopped from contending that he, [A], is\n                            entitled to exercise that right or that he, [B], has remained bound by\n                            that obligation. If [A] represents to [B] that he no longer intends to\n                            exercise that right or requires that obligation to be fulfilled by [B]\n                            and [B] acts upon that representation, then clearly [A] cannot be heard\n                            thereafter to say that he is entitled to exercise that right or that [B]\n                            is in breach of contract by not fulfilling that\n                            obligation.” In my view, an equity created by estoppels arising from an intimation by A\n                        that he does not intend to perform which conveys to B that performance by\n                        him would be nugatory absolves B “from tendering further performance\n                        unless and until A gives reasonable notice that he is once again able and\n                        willing to perform”. 17     It appears that although Brennan J finds\n                    support for acceptance of the third option (though the learned judge seemed to\n                    prefer not to use that terminology) in the decision inPeter\n                        Turnbull, his reasoning is different. Dixon CJ and Kitto\n                    J’s conclusion inPeter Turnbullthat an\n                    intimation by the wrongdoer of an intention not to perform absolves the innocent\n                    party from performance was derived from an extrapolation of principles stated inJones v Barkley(1781) 99 ER 434\n                        (“Jones”) (if the wrongdoer\n                    manifests an intention not to perform his part, it is not necessary for the\n                    innocent party to go father, and do a nugatory act) as well asRipley v M’Clure(1849) 154 ER 1245\n                        (“Ripley”) andCort v The Ambergate &c Railway Co(1851)\n                    117 ER 1229 (“Cort”), both\n                    of which state the same principle as that stated inJones. InCort, it was further\n                    stated, by Campbell CJ, thatRipleycould be\n                    explained in terms of a waiver, in that the wrongdoer’s refusal to perform\n                    was evidence of a continuing refusal and waiver of the condition precedent which\n                    the innocent party had to perform. 18     Dixon CJ states (at 247) that the\n                    principle inJones“in [his] opinion,\n                    controls the decision of [the] appeal [before him].” Kitto J also\n                    acknowledges (at 250) that “the principle which is decisive [of the\n                    appeal before him] is that which is illustrated by [Campbell CJ’s]\n                    statement in [Cort] of the decision in [Ripley].” Brennan J’s reasoning for\n                    accepting the third option, that the intimation of the wrongdoer of its\n                    intention not to perform and the reliance of the innocent party thereon raises\n                    an estoppel in favour of the latter, is therefore quite different. 19     Furthermore, with respect, I do not think that\n                    the part of Lord Ackner’s observations on estoppel referred to by\n                    Brennan J (see[16]above, second quote\n                    of Lord Ackner’s observations) supports his general proposition that an\n                    innocent party is absolved from performance if the wrongdoer conveys to the\n                    former his intention not to perform so that the former’s performance is\n                    nugatory. Lord Ackner’s observations must be read in context. Lord Ackner\n                    characterises that passage quoted by Brennan J as a response to an\n                    “essentially ... new point” raised by counsel (which is separate\n                    from the issue of whether there exists the third option) (seeFercometalat 805). Lord Ackner then goes on to comment whether,\n                    on the facts, an estoppel could arise. It is clear that Lord Ackner was not\n                    making ageneral pronouncementof law\n                    acknowledging the existence of the third option (as defined above at[8]) but an assessmenton the\n                        factsas to whether an estoppel could arise. 20     Be that as it may, the decision inForanaffirms the position inPeter\n                        Turnbull, although the rationalisations may be different. The\n                    Australian position remains different from the English position. 21     Locally, the Court of Appeal inStraits Engineering Contracting Pte Ltd v Merteks Pte\n                        Ltd[1995] 3 SLR(R) 864 (“Straits Engineering”) has citedPeter\n                        Turnbullfavourably. In that case, the appellant had entered into\n                    an agreement to sell all the shares in one of its wholly owned subsidiary to the\n                    respondent. The appellant subsequently insisted on a sale on the basis of a\n                    “clean company” without trade debtors and trade creditors. The\n                    respondent disagreed and brought a claim against the appellant, alleging breach\n                    of contract, for specific performance and damages. The judge found that there\n                    was no agreement that the sale would be on the basis of a “clean\n                    company”. The Court of Appeal allowed the appeal in part in relation to\n                    the judge’s assessment of the damages. 22     The Court of Appeal, nonetheless, citedPeter TurnbullandForanfavourably in dicta. L P Thean JA (delivering\n                    the judgment of the court) made the following observations: 24 ... There was nothing to suggest that the respondents had not intended\n                        to complete the transaction but for the new term introduced by the\n                        appellants [requiring that the sale be on the basis of a “clean\n                        company”]. In such circumstances, it would be futile and nugatory for\n                        the respondents to tender the balance purchase price with a view to\n                        completing the purchase in terms of the March Agreement. 25 In [Peter Turnbull,]\n                        Dixon CJ said, at p 245: ... I think that the plaintiff is entitled to succeed on the ground\n                            that, in so far as there was a non-fulfilment of the condition requiring\n                            the nomination of a February ship and the giving of 14 days’\n                            notice of the ship and shipping date, the defendant dispensed the\n                            plaintiff from such fulfilment. 26 His Honour gave the reasons as follows, at\n                        p 246: The defendant persisted up to 2 March that it could perform the\n                            contract only in one way, namely, by substituting a shipment by the same\n                            vessel in Melbourne for that in Sydney contracted for. By seeking the\n                            plaintiff’s help in an attempt to effect this substitution and at\n                            the same time persisting that it could not perform the contract\n                            according to its terms, the defendant clearly intimated to the plaintiff\n                            that it was useless to pursue the conditions of the contract applicable\n                            to shipment in Sydney and that the plaintiff need not do so. L P Thean JA then referred favourably (at\n                        [27]) to Brennan J’s decision\n                    inForan. 23     InSiti and another v Lee\n                        Kay Li[1996] 2 SLR(R) 934 (“Siti”), L P Thean JA (delivering the judgment\n                    of the court) referred to and reiterated the point made in [24] ofStraits\n                        Trading(quoted above at[22]). 24     It must be noted that in bothStraits TradingandSiti,Fercometalwas neither cited nor discussed.\n                    This is why Mr Toh submitted that those decisions were decidedper incuriam. 25     Subsequent to those decisions,Fercometalhas received the endorsement of the High\n                    Court. Choo Han Teck J inSilverlink Holdings Ltd v\n                        Rockline Ltd and others[2011] SGHC 10\n                        (“Silverlink Holdings”) at\n                        [11]-[12] accepted counsel’s argument based onFercometal, commenting that: “[i]t cannot be the\n                    case that the wrongful party continues to be bound by the terms of a repudiated\n                    contract, while the innocent party is not.”Fercometalwas also endorsed by Lai Siu\n                    Chiu J inStork Technology Services Asia Pte Ltd v First\n                        Capital Insurance Limited[2006] 3 SLR(R) 652 at [92]\n                    and by G P Selvam J inMP-Bilt Pte Ltd v Oey\n                        Widarto[1999] 1 SLR(R) 908 at [56].SitiandStraits Tradingwere not\n                    discussed in these decisions. 26     I respectfully agree with the position taken\n                    by the High Court and would depart from thedictaof the Court of Appeal inSitiandStraits Trading. Mr Toh had sought to convince me\n                    that in any event the Court of Appeal’s pronouncements inSitiandStraits Tradingin reference toPeter TurnbullandForancould be distinguished from the present\n                    application on the ground that the cases before the Court of Appeal were\n                    concerned withconcurrentobligations and not a\n                    condition precedent with which this application is concerned. With respect, I do\n                    not agree.Peter Turnbullwas a case concerning a\n                    breach of a condition precedent on the part of the innocent party as a result of\n                    an intimation of an intention not to perform by the wrongdoer: the innocent\n                    party had to nominate a ship and given notice of such nominationbeforethe wrongdoer could perform.\n                    Dixon CJ’s observations (inPeter\n                        Turnbullat 246-247) also make it clear that the principle\n                    enunciated inPeter Turnbullapplies with equal\n                    force to situations concerning a breach of a condition precedent and not just to\n                    a situation concerning concurrent obligations: Now long before the doctrine of anticipatory breach of contract was\n                        developed it was always the law that,if a contracting\n                            party prevented the fulfilment by the opposite party to the contract of\n                            a condition precedent therein expressed or implied, it was equal to\n                            performance thereof... But a plaintiff may be dispensed from\n                        performing a condition by the defendant expressly or impliedly intimating\n                        that it is useless for him to perform it and requesting him not to do so.If the plaintiff acts upon the intimation it is just\n                            as effectual as actual prevention. [emphasis added] 27     Hence, although the decision inPeter Turnbullwas based onJones, a case concerned with concurrent obligations, it was\n                    clear that the principle enunciated inPeter\n                        Turnbullwas intended to also cover situations concerning a\n                    condition precedent. Furthermore, when the High Court of Australia had the\n                    opportunity to reconsiderPeter TurnbullinForan, a case concerning concurrent\n                    obligations, it did not qualifyPeter Turnbullto\n                    limit its application to such cases. The Court of Appeal inStraits TradingandSitialso made\n                    no such qualification when referring toPeter\n                        Turnbull. 28     Furthermore, I do not think such a distinction\n                    can be justified as a matter of principle if one examines the rationale\n                    underlying the decision inPeter Turnbullto\n                    accept the existence of the third option. It seems to me that the third option\n                    was developed as a result of a commonsensical concern on the need to reduce\n                    commercial wastage. Simply put, if the wrongdoer makes it clear that he is not\n                    going to perform so that the innocent party’s performance would be an act\n                    in futility, why should the law require the innocent party to perform? This is a\n                    valid concern regardless of whether the innocent party has to perform a\n                    condition precedent or carry out a concurrent obligation. If the wrongdoer has\n                    made it clear that he will not perform, the innocent party’s acts in\n                    fulfilment of a condition precedent or a concurrent obligation would be futile\n                    in both situations. 29     And it is for these reasons that I do not\n                    thinkStraits TradingandSitican be distinguished in the way urged by Mr Toh. But I\n                    would depart nonetheless from the position stated in thedictaof those cases. 30     I agree with the position taken inFercometalfor two reasons. First, even through the\n                    innocent party’s performance in the face of a clear refusal to perform by\n                    the wrongdoer is an effort in futility, where repudiation has not been accepted,\n                    the contract is kept alive for both parties and does not exist for one but not\n                    the other (see alsoChitty on Contractsat\n                    [24-011];Silverlink Holdingsat [12]). To hold otherwise would be contrary to\n                    basic principles of fairness as between contracting parties for one side is held\n                    to the bargain, while the other is not. 31     Second, although the appeal to prevent\n                    commercial wastage resulting from the futile acts of the innocent party (see\n                    also[28]above) is, at first blush, a\n                    persuasive argument for the recognition of the third option, the existing\n                    principles of contract law in the absence of the third option allow for\n                    substantially the same result to obtain without its problems (as stated in the\n                    preceding paragraph). The innocent party may accept the renunciation, terminate\n                    and renegotiate a new contract. In so doing, the innocent party may still claim\n                    damages and be absolved from acting in futility because it is no longer required\n                    to perform. Although successful renegotiations would require the assent of the\n                    wrongdoer, so would the third option which requires the wrongdoer to give\n                    reasonable notice that he is once again willing to perform for the contract to\n                    be back on track. 32     For these reasons, I accept the position inFercometaland reject the existence of the\n                    third option. 33     I agree with Mr Toh that the\n                    plaintiff’s claim is obviously unsustainable even taking the\n                    plaintiff’s case at its highest. The plaintiff did not accept the\n                    renunciation of the agreement and instead persisted in seeking its performance\n                    through the email communication on 1 August 2009 asking the defendant\n                    to sign the corrected version of the formal purchase contract. The contract was\n                    not terminated and the plaintiff had to satisfy the condition precedent by\n                    procuring a letter of credit. It failed to do so and therefore the\n                    defendant’s failure to perform is not wrongful. 34     There is one last point I would address. The\n                    plaintiff had sought, in the alternative, to rely on the doctrines of waiver and\n                    estoppel. If by reference to these doctrines, Mr Srivathsan had sought to\n                    persuade me of their applicability in the form envisioned by Brennan J,ieas a general principle of law that a\n                    renunciation by a wrongdoer absolves the innocent party from performance, I\n                    cannot agree for reasons already stated (see also[19]above). If he is instead arguing thaton\n                        the factsan estoppel or waiver can be found, I would simply say\n                    that the facts pleaded do not support the finding of an estoppel or waiver of\n                    the condition precedent requiring the plaintiff to open the letter of credit.\n                    The defendant may have intimated that it would not perform and that it took the\n                    view that there was no agreement between the parties but this without more does\n                    not ground an estoppel or waiver.",
        "Conclusion": "35     For the reasons stated, I strike out the\n                    plaintiff’s statement of claim and dismiss the plaintiff’s\n                    action. 36     I will hear the parties on\n                costs."
    }
}