{
    "case_title": "Nanyang Law LLC\n      v\n      Alphomega Research Group Ltd",
    "ncitation": "[2011] SGHC 117",
    "coram": "Leo Zhen Wei Lionel AR",
    "sections": {
        "Introduction": "1       The three applications before me were for orders\n                    that the plaintiff in the counterclaim, Alphomega Research Group Ltd\n                    (“Alphomega”), furnish security for the costs of various\n                    defendants in the counterclaim. The details of the three applications are as\n                    follows: (a)     Summons No 3314 of 2010 was taken out\n                        by the 5th defendant in the counterclaim, Ms Yeoh Lay Cheng\n                        (“Yeoh”), and the security requested was for the sum of\n                        $80,000 up until parties exchange their Affidavits of Evidence-in-Chief\n                        (“AEICs”). (b)     Summons No 3525 of 2010 was taken out by the 4th defendant\n                        in the counterclaim, Mr Heng Jee Kian (“Heng”), and the\n                        security requested was for the sum of $100,000 up until parties exchange\n                        their AEICs. (c)     Summons No 5783 of 2010 was taken out by the 1st and 2nd defendants in the\n                        counterclaim, Nanyang Law LLC (“Nanyang Law”) and Mr Ng\n                        Kim Tean (“Ng”) respectively, and the security requested was\n                        for the sum of $80,000 up to the Summons for Directions stage of the\n                        proceedings. 2       The applications were taken out pursuant to s\n                    388(1) of the Companies Act (Cap 50, 2006 Rev Ed) (“the Act”).\n                    Although the applications were brought separately and were in fact heard on two\n                    separate occasions, the determinative issue in all three applications is the\n                    same, namely, whether Alphomega will be able to pay the costs of the various\n                    defendants in the counterclaim should they succeed at trial.",
        "Background": "3       The present action was commenced by Nanyang Law\n                    against Alphomega for the recovery of legal costs amounting to a sum of\n                    $332,229.40. This sum represented the outstanding amount in respect of registrar\n                    certificates which had been issued pursuant to the taxation of various Bills of\n                    Costs drawn up for work done during the period between April 2008 and February\n                    2009. 4       Alphomega failed to enter an appearance and\n                    Nanyang Law obtained a judgment in default of appearance (“the default\n                    judgment”). However, Alphomega subsequently succeeded in setting aside\n                    the default judgment on the basis that it had,prima\n                        facie, a right of set-off (seeNanyang Law LLC\n                        v Alphomega Research Group Ltd[2010] 3 SLR 914 at\n                        [23] to [25]). 5       Alphomega takes the position that the present\n                    action is a sequel to the shareholders’ dispute which culminated in a\n                    minority oppression action brought by a minority shareholder, Dr Tan Choon\n                    Yong (“Dr Tan”). Dr Tan had been the CEO and director of\n                    Alphomega until he was removed during a board meeting by the majority\n                    shareholders. The majority shareholders were the 3rd defendant in the\n                    counterclaim, Mr Goh Jon Keat (“Goh”), and Heng’s wife,\n                    Ms Tan Hui Kiang (“Ms Tan”). InTan Choon Yong\n                        v Goh Jon Keat and Ors[2009] 3 SLR(R) 840\n                        (“Tan Choon Yong”), Tan Lee\n                    Meng J (“Tan J”) found in favour of\n                Dr Tan. 6       Relying on Tan J’s decision and\n                    findings inTan Choon Yong, Alphomega\n                    counterclaimed against Nanyang Law, Ng (as Nanyang Law’s Chairman), and\n                    the previous board of directors which included Yeoh and Heng (as a\n                    “shadow director”). The causes of action against them were for,inter alia, breaches of the duty to act in the\n                    best interest of Alphomega, and conspiracy to misuse Alphomega’s resources\n                    to oppress Dr Tan’s rights as a minority shareholder.",
        "The law on security for costs": "7       Section 388(1) of the Act provides\n                    that: Security for costs 388. (1) Where a corporation\n                        is plaintiff in any action or other legal proceeding the court having\n                        jurisdiction in the matter may,if it appears by\n                            credible testimony that there is reason to believe that the\n                            corporation will be unable to pay the costs of the defendant if\n                            successful in his defence, require sufficient security\n                        to be given for those costs and stay all proceedings until the security\n                        is given. [emphasis added] 8       If the court is satisfied that there is credible\n                    evidence that the plaintiff will be unable to pay the defendant’s costs\n                    should the defendant succeed at trial, the court’s discretion to order\n                    security for costs (“security”) is invoked. However, even if the\n                    defendant discharges its burden of showing credible evidence of the\n                    plaintiff’s inability to pay costs, this does not mean that security would\n                    be ordered as of course. As held inCreative Elegance (M) Sdn\n                        Bhd v Puay Kim Seng[1999] 1 SLR 60 (“Creative Elegance”) at [13], the court will have to consider all\n                    relevant circumstances and decide whether it is just to order that the plaintiff\n                    provide security. Several of the factors that the courts have found to be\n                    relevant at this stage include whether the ordering of security is being used\n                    oppressively to stifle a genuine claim (seeCreative\n                        Eleganceat [32]), and whether the plaintiff’s want of\n                    means was brought about by the conduct of the defendants (seeFrantonios Marine Services Pte Ltd v Kay Swee Tuan[2008]\n                    4 SLR(R) 237 (“Frantonios”) at [38]). As held inOmar Ali\n                        bin Mohd v Syed Jafaralsadeg bin Abdulkadir Alhadad[1995]\n                    2 SLR(R) 407 (“Omar Ali”)\n                    at [21] and [37], the court should not\n                    generally go into a detailed examination of the merits of the action because the\n                    merits would not be relevant unless there appears to be a high degree of\n                    probability in one direction or another.",
        "Whether the court ought to consider the applications\n                separately": "9       Before delving into the substance of this\n                    application, it is necessary that I deal with one preliminary matter. Given that\n                    multiple parties have applied for security, an issue arose as to whether the\n                    applications should be considered together or separately. In other words, would\n                    the discretion to order security be invoked as regards a particular application\n                    for security if the plaintiff is able to pay the costs of that defendant, but\n                    not the costs of the other defendants as well? 10     In the present case, Nanyang Law and Ng had\n                    applied for $80,000 in security, Yeoh had applied for $80,000 in security, and\n                    Heng had applied for $100,000 in security. Therefore, it is crucial to determine\n                    whether the discretion to order security would be invoked in respect of each\n                    defendant on a showing that Alphomega would be unable to pay the costs of that\n                    defendant ($80,000 in the case of Nanyang Law and Ng as well as Yeoh, and\n                    $100,000 in the case of Heng) or of all the defendants ($260,000). This issue\n                    could prove to be determinative should Alphomega be able to pay, for instance,\n                    $100,000 in costs, but not more. 11     Although there appears to be no local\n                    authority directly addressing this issue, some guidance can be gleaned from the\n                    decision ofTjong Very Sumito & Ors v Chan Sing En &\n                        Ors[2010] SGHC 344 (“Tjong\n                        Very Sumito”). InTjong Very\n                        Sumito, Andrew Ang J (“Ang J”) heard a\n                    registrar’s appeal by the 1st defendant who had failed to obtain security\n                    against the plaintiff together with applications by the 5th and 6th defendants\n                    for security. The plaintiff’s solicitor argued that while his clients had\n                    the ability to pay the costs of the 1st, 5th, and 6th defendants’, if all\n                    the other eight defendants applied similarly for security, the plaintiff’s\n                    claim may be stifled. In response to this argument, Ang J stated, at [46],\n                    that: 46    ... I take on board that likelihood. Should it\n                            transpire that the other defendants similarly apply for security for\n                            costs against the plaintiffs,I direct that their\n                                applications be fixed before me. Each application should be\n                                considered separately, and the likelihood of stifling of the\n                                plaintiffs’ claims should be assessed separately in each\n                                application. [emphasis added] Although Ang J’s observations were made in the context\n                    of a consideration of whether the application for security would stifle the\n                    plaintiff’s claim (and this relates to the exercise of the discretion to\n                    order security, and not whether the discretion is invoked in the first place),\n                    it is clear that the approach taken was that of assessing the merits and\n                    circumstances of each application for security independently of other similar\n                    applications for security against the same plaintiff. 12     In light of the court’s approach inTjong Very Sumito, I am of the view that each\n                    application for security should be considered separately insofar as the question\n                    is whether the discretion to order security is invoked. In reaching this\n                    conclusion, I am fortified by three considerations. First, the plain words of s\n                    388(1) of the Act state that the question is whether the plaintiff will be\n                    unable to pay the “costs of the defendant if successful in his\n                    defence”. The reference to “costs of the defendant”\n                    suggests that the inquiry focuses on the costs of the particular defendant\n                    applying for security, and not on the potential costs of other defendants.\n                    Second, where a plaintiff claims against multiple defendants, it could well be\n                    that some defendants might successfully defend against the claim while others\n                    would be found liable. In such a case, to consider all the applications together\n                    could result in the unfair result that security might be ordered even if thepotentialfor liability in costs against some\n                    defendants is remote. Third, if the applications for security are brought one at\n                    a time, the court hearing the first application would not ordinarily consider,\n                    in deciding whether the discretion to order security is invoked, the possibility\n                    that another defendant might take out an application for security. It would not\n                    be logical, in principle, that the defendants could put themselves in a better\n                    position to obtain security simply by bringing their applications at the same\n                    time (although this could be desirable from a policy point of\n                view). 13     It should be emphasised that although the\n                    applications for security should be considered separately, this doesnotmean that the costs that may be payable to other\n                    defendants is irrelevant. What this means is that the court must satisfy itself\n                    that the plaintiff will be unable to pay the costs ofthe\n                        particular defendant applying for security(eg, $80,000 in the case of Yeoh) and not the costs of all the\n                    defendants. However, in assessing whether the plaintiff can pay costs of this\n                    amount, the court can take into accountpotential\n                        liabilities, and the costs that may be payable to other\n                    defendants is one such potential liability. Nevertheless, the court must be\n                    mindful not to ascribe too much weight to potential liabilities as such\n                    liabilities have not been incurred and may not actually materialise in the\n                    future. Furthermore, if potential liabilities are considered, the court should\n                    likewise, in fairness, consider potential streams of income. Given that\n                    potential liabilities and potential streams of income are both inherently\n                    speculative, a broad approach should be taken, and such matters should only be\n                    determinative in borderline cases.",
        "The applications for security": "14     In order to invoke the court’s\n                    discretion to order security, the court has to determine whether there is\n                    credible evidence that the plaintiffwillbe\n                    unable to pay the defendant’s costs. In my view, the court should approach\n                    this determination from two angles. (a)     First, the court should consider the\n                        plaintiff’s assets and liabilities to ascertain whether there would be\n                        sufficient assets, after paying off liabilities, to satisfy a costs order in\n                        favour of the defendant (seeFrantoniosat\n                        [34]). As observed inHo Pak Kim Realty Co Pte Ltd v\n                            Revitech Pte Ltd[2008] SGHC 230 (“Ho Pak Kim”) at [8], the most obvious way for the court to gain insight into\n                        such matters is through an examination of the plaintiff’s audited\n                        accounts. Accordingly, as held inHo Pak Kimat [12], the failure to file audited\n                        accounts for an extended period of time can be circumstantial evidence of a\n                        plaintiff’s inability to pay costs although this failure would not\n                        ordinarily, in itself, be sufficient to satisfy the condition in\n                        s 388(1). Apart from audited accounts, bank statements are important as\n                        they shed light on the plaintiff’s cash position. Similarly, documents\n                        evidencing ownership of other assets that could be used to satisfy a cost\n                        order in the defendant’s favour would be relevant. Liabilities would\n                        include monies that the plaintiff will have to pay towards the fulfilment of\n                        contracts, loan agreements, and judgments. Furthermore, as discussed above\n                        at [13], potential streams of income\n                        and potential liabilities can be taken into account, although care must be\n                        taken not to place undue weight on such matters. (b)     Second, the court should consider\n                        whether the plaintiff is a going concern, or a mere “shell”.\n                        If the plaintiff is a mere “shell”, there would be a distinct\n                        possibility that the plaintiff would be wound up should the defendant\n                        succeed at trial since there would be little point for the plaintiff to pay\n                        costs when it is not going to carry on business. In such a situation, the\n                        defendant would be left with an unfulfilled costs order, which is precisely\n                        what s 388(1) of the Act seeks to guard against. Conversely, a\n                        plaintiff that is a going concern is less likely to institute a frivolous\n                        claim as the potential for adverse costs order and possible damage to\n                        reputation would have to be weighed against the chances of the claim\n                        actually succeeding.",
        "Alphomega’s failure to file audited accounts": "15     In the present case, Alphomega has not laid\n                    its audited accounts before an Annual General Meeting for almost two years, and\n                    the last audited accounts were for the period ending 31 March 2008. As held\n                    inHo Pak Kimat [12], the failure to file audited accounts for an extended\n                    period of time can becircumstantial evidenceof a\n                    plaintiff’s inability to pay costs. 16     However, a plaintiff’s failure to file\n                    audited accounts must be seen in light ofall the relevant\n                        circumstances. Alphomega appeared to have been an inactive\n                    company after Tan J ruled in favour of Dr Tan in his minority\n                    oppression action on 30 April 2009 (seeTan Choon\n                        Yong). The new management, led by Dr Tan, only stepped back\n                    into the picture in September 2009, and a new Board of Directors was appointed\n                    in November 2009. Counsel for Alphomega submitted that the old management had\n                    left the accounts in a state of mess, and that this accounted for the difficulty\n                    in reconstructing the accounts. He submitted that the reconstruction of accounts\n                    was further delayed because of the need to resuscitate Alphomega as well as the\n                    efforts taken to defend against various claims by Nanyang Law and other\n                    creditors. The new management had initially attempted to get the original\n                    auditors to reconstruct the accounts, but subsequently new auditors had to be\n                    appointed on 30 July 2010. 17     Since the new Board of Directors was appointed\n                    in November 2009, the new management has been in control of Alphomega for at\n                    least 15 months. In my view, this should have been more than sufficient time to\n                    reconstruct Alphomega’s accounts. Therefore, I took the failure to file\n                    audited accounts to be circumstantial evidence that Alphomega would not be able\n                    to pay costs. However, this circumstantial evidence did not point as strongly\n                    towards an inability to pay as in the case ofHo Pak\n                        Kim. First, assuming that a reasonable time to reconstruct\n                    Alphomega’s accounts was six months, the delay in filing audited accounts\n                    in the present case was less than a year compared to four years inHo Pak Kim. In my view, it is also relevant that ACRA\n                    had temporarily withheld prosecuting Alphomega after the company’s\n                    solicitors made representations explaining the failure to file its Annual\n                    Return. Second, a plausible explanation for the delay was proffered in the\n                    present case whereas the plaintiff inHo Pak Kimhad merely asserted that while it was admittedly poorly administered, this did\n                    not mean it was impecunious. Third, Alphomega had produced other evidence of\n                    assets (eg, a bank statement of the balance in its\n                    bank account with UOB) whereas the plaintiff inHo Pak\n                        Kimrelied solely on a bare assertion by one of its directors\n                    that the company was capable of paying its costs.",
        "Assessment of Alpomega’s assets and liabilities": "18     Alphomega’s last audited accounts were\n                    for the period between March 2007 and March 2008. These audited accounts did not\n                    shed much light on the current financial position of Alphomega for two reasons.\n                    First, these audited accounts must be read in light of the fact that Alphomega\n                    was only incorporated in February 2007 and would thus have incurred start-up\n                    costs without immediately being able to generate revenue. Second, more than\n                    three years have passed since March 2008, and Alphomega’s financial\n                    position would likely have changed substantially given the events leading up to\n                    and culminating in the minority oppression action (seeTan\n                        Choon Yong) as well as the subsequent change of management after\n                    a period of inactivity. 19     Without the benefit of audited accounts, I\n                    turn to a consideration of the assets and liabilities identified by parties in\n                    their submissions. The assets that Alphomega could point to in the present case\n                    are as follows: (a)     The sum of $1,152,370.06 in its bank\n                        account with UOB (accurate as at 31 October 2010). (b)     The sum of $126,244.65 garnished from\n                        its bank accounts with UBS AG and OCBC in respect of Nanyang Law’s\n                        claim. (c)     The sum\n                        of $250,000 deposited in its client’s account with Drew & Napier\n                        LLC (“Drew & Napier”) that is being held by Drew &\n                        Napier as stakeholder in respect of Nanyang Law’s\n                    claim. The liabilities that Alphomega has incurred or will\n                    incur after 31 October 2010 which the defendants to the counterclaimed\n                    identified are as follows: (a)     The sum of $250,000 was paid to\n                        Lim Hwee Hai on 18 November 2010. (b)     On 8 November 2010, Alphomega entered into two\n                        investment agreements with a Cambodian company to invest $200,000 and\n                        $300,000 (“the investment agreements”). 20     In addition, multiple lawsuits had been filed\n                    against Alphomega, and judgments had been awarded against Alphomega: (a)     The sum of $47,708.20 was awarded\n                        against Alphomega in respect of a suit filed by KPMG. (b)     The sum of $15,236.72 was awarded\n                        against Alphomega in respect of a suit filed by Orix Capital Ltd\n                        (“Orix”). (c)     The sum of $19,995.00 was awarded against Alphomega in\n                        respect of a suit filed by Hitachi Capital Singapore Pte Ltd\n                        (“Hitachi”). (d)     Suit No 35 of 2009 was filed by Habib Ali for the sum of\n                        $750,000. This action has been settled, but the terms of the settlement are\n                        confidential. 21     Finally, should Nanyang Law succeed in its\n                    claim, Alphomega would have to pay Nanyang Law the sum of $265,231.40. If\n                    Alphomega also fails in its counterclaim, it would then potentially be liable to\n                    pay costs of up to $260,000 in respect of Nanyang Law, Ng, Yeoh and Heng as well\n                    as further costs in respect of the 3rd and 6th defendants in the\n                    counterclaim. Application for security taken out by Nanyang Law and Ng 22     I now turn to the application for security\n                    taken out by Nanyang Law and Ng. As mentioned above at[19], Nanyang Law has garnished the sum of $126,244.65 from\n                    Alphomega’s bank accounts with UBS AG and OCBC, and a further sum of\n                    $250,000 is being held by Drew & Napier as stakeholders with regard to\n                    Nanyang Law’s claim. Therefore, Alphomega would have excess funds\n                    amounting to $110,993.25 even if it pays the $265,231.40 allegedly owed to\n                    Nanyang Law. These excess funds exceed the $80,000 which Nanyang Law and Ng are\n                    requesting as security. Although the sums are held in respect of Nanyang\n                    Law’s claim and not in respect of the counterclaim or Ng, the fact remains\n                    that these monies would be available to satisfy a costs order should Nanyang Law\n                    and Ng successfully defend against Alphomega’s counterclaim. Therefore, I\n                    am of the view that this fact points strongly towards a finding that the\n                    condition in s 388(1) is not fulfilled insofar as the application by\n                    Nanyang Law and Ng is concerned. Applications for security taken out by Heng and Yeoh 23     As discussed at[22], Nanyang Law’s claim and any potential costs orders\n                    in relation to Nanyang Law and Ng can be fulfilled by the sum garnished and the\n                    sum being held by Drew & Napier as stakeholders. As such, these matters can\n                    be disregarded for the purposes of the applications for security by Heng and\n                    Yeoh. 24     Taking into account the $250,000 paid to Lim\n                    Hwee Hai and the $500,000 invested under the two investment agreements, the\n                    balance remaining in Alphomega’s UOB bank account is likely to be\n                    approximately $402,370.06. This sum would be far in excess of the security\n                    requested by Heng ($100,000) and Yeoh ($80,000). 25     I am cognizant of the fact that $82,939.92\n                    would have been due under the judgments obtained by KPMG, Orix and Hitachi.\n                    Habib Ali’s claim for $750,000 has also been settled, and a settlement sum\n                    would have to be paid, although the exact figure of this sum was not disclosed\n                    due to the confidentiality of the settlement agreement. In my view, the sum of\n                    $82,939.92 due under the judgments obtained by KPMG, Orix and Hitachi should not\n                    be taken into account because the acting General Manager of Alphomega has stated\n                    on affidavit that this sum has been settled, and the defendants in the\n                    counterclaim have not adduced any evidence to the contrary. However, the fact\n                    that a settlement sum would have to be paid to Habib Ali should be taken into\n                    account although the weight given to this is reduced because the settlement sum\n                    is unlikely to have been for the full $750,000 claimed and there is no evidence\n                    that Alphomega has not been able to meet whatever payments are due to Habib Ali\n                    (whether such payments are for a lump sum or by instalments). 26     As discussed at[13], the potential costs payable to the other defendants in the\n                    counterclaim (and this includes the 3rd and 6th defendants in the counterclaim,\n                    but not Nanyang Law and Ng) are also relevant. However, if potential liabilities\n                    are taken into account, so should potential streams of income. In this regard,\n                    Alphomega’s investments in the Cambodian company are likely to generate\n                    some revenue. In particular, Alphomega estimates that the revenue from the\n                    project to build the Chea Sim Humanitarian Hospital is likely to be 2% of the\n                    US$100 m budget (ie, US$2 m). The revenue from the\n                    project to build the Brunei International Airport (“the Brunei\n                    project”), if this materialises, would be approximately $900,000.\n                    Furthermore, Alphomega has signed a letter of intent with a local company to\n                    have an equity stake in the latter, and this letter of intent clearly indicates\n                    Alphomega’s intention to be re-listed on OTC Capital. If Alphomega were to\n                    re-list on OTC Capital, this would likely result in significant inflows of\n                    capital. 27     I note that the figures regarding revenue are\n                    merely estimates, and are no guarantee of the revenue that Alphomega will\n                    actually earn. It is also unclear whether the Brunei project will actually\n                    materialise (since the letter of intent had expired, and government approval is\n                    still pending). Likewise, there is no guarantee that Alphomega will be able to\n                    re-list on OTC Capital. However, in the totality of the circumstances, it did\n                    appear that Alphomega was a going concern with a viable revenue stream. Taken\n                    together with the fact that there is no evidence that Alphomega has not been\n                    able to meet any of its debt obligations (eg, to\n                    KPMG, Orix, Hitachi or Habib Ali), I am of the view that it is more likely than\n                    not that future revenue would be able to sufficiently supplement the $402,370.06\n                    in Alphomega’s UOB bank account such that Alphomega would be able to meet\n                    any costs orders that may be made against it should Heng and Yeoh succeed at\n                    trial. Therefore, I am of the view that the condition in s 388(1) for invoking\n                    the court’s discretion to order security is not fulfilled.",
        "Whether Alphomega is a going concern": "28     As stated at[27], my decision is influenced, in part, by the fact that I\n                    consider Alphomega to be a going concern. The defendants in the counterclaim\n                    took a different position, and argued that Alphomega is not a going concern\n                    because it has severely curtailed its business operations. In this regard, the\n                    defendants in the counterclaim pointed to the fact that Alphomega had sold its\n                    only substantial asset, a property at 6 Sungei Kadut Way (“the\n                    property”), and had sold rigs belonging to its subsidiary, Thalpha.\n                    However, Alphomega explained that the selling of the property and the rigs were\n                    commercial decisions consistent with the company’s new strategy of\n                    focusing on research and consultancy. In particular, the rigs had been sold\n                    because the micro piling industry had been undergoing a downturn, and the cost\n                    of replacing accessories that had gone missing outweighed the profits from\n                    potential contracts in the near future. 29     In support of its contention that Alphomega is\n                    a going concern focused on research and consultancy, Alphomega pointed to the\n                    investment agreements with the Cambodian company, the letter of intent (and a\n                    subsequent email) in relation to the Brunei project, and the letter of intent it\n                    had signed with a local company to have an equity stake in the latter. In my\n                    view, the investment agreements and letters of intent point towards Alphomega\n                    being a going concern. More importantly, if the new management did not intend to\n                    run Alphomega as a viable business, there would be no reason for them to take\n                    control of the company, settle debts, appoint new auditors, and enter into\n                    investment agreements. Therefore, I consider Alphomega to be a going concern,\n                    and this weighs against a finding that Alphomega will be unable to pay its\n                    costs.",
        "Conclusion": "30     For the foregoing reasons, I am of the view\n                    that the defendants in the counterclaim have not adduced credible evidence that\n                    Alphomega will be unable to pay their costs should they succeed at trial.\n                    Therefore, the discretion to order security is not invoked. Since the discretion\n                    to order security is not invoked, there is no need to consider whether the\n                    discretion to order security should be exercised. 31     In the circumstances, the applications for\n                    security by Nanyang Law, Ng, Yeoh and Heng are dismissed. I will hear parties on\n                    costs at a later date."
    }
}