{
    "case_title": "SetClear Pte Ltd and others\n      v\n      Ashlock William Grover",
    "ncitation": "[2011] SGHC 130",
    "coram": "Woo Bih Li J",
    "sections": {
        "Introduction": "1       This is an action by five plaintiffs against the\n                    defendant (“Mr Ashlock”). The first to fourth plaintiffs are\n                    part of a group referred to as the CLSA Group. The fifth plaintiff is\n                    beneficially owned by the second plaintiff. 2       Between 3 March 2006 and 28 February\n                    2009, Mr Ashlock was employed by different companies in the CLSA Group as\n                    follows: (a)     by the fifth plaintiff pursuant to\n                        its letter of appointment dated 3 March 2006 and counter-signed by\n                        Mr Ashlock on 8 March 2006; and (b)     by the first plaintiff pursuant to its letter\n                        dated 10 May 2007 and counter-signed by Mr Ashlock on 13 May\n                        2007. 3       By a termination agreement dated 17 July\n                    2008 (“the TA”) between the first plaintiff and Mr Ashlock,\n                    Mr Ashlock’s employment with the first plaintiff was\n                    terminated. 4       Clause 14 of the TA states: 14.Final Settlement By signing this letter and accepting the abovementioned payments, this\n                        represents full and final settlement of all and any claims against SetClear\n                        Pte Ltd and its affiliated companies. Additionally, it confirms that you\n                        agree not to pursue any future claim against SetClear Pte. Ltd and its\n                        affiliated companies. 5       The plaintiffs said that the terms of the TA\n                    were subsequently reaffirmed in two letters dated 9 October 2008 and\n                    28 February 2009 which were counter-signed by\n                Mr Ashlock. 6       On 20 January 2010, Mr Ashlock\n                    commenced proceedings against the five plaintiffs and one Jonathan Slone\n                    (“Mr Slone”) in Civil Action No 10-CV-0453(GBD) in the United\n                    States District Court, Southern District of New York (“the American\n                    Action”) based on various causes of action in respect of equity which has\n                    been referred to as “founder benefits” or “Founder’s\n                    Equity”. I will adopt the reference “founder’s\n                    benefits” for convenience. 7       The position of the five plaintiffs in the\n                    present action in Singapore (“the Singapore Action”) is that\n                    Mr Ashlock is precluded from commencing and continuing the American Action\n                    against them in view of the TA and, in particular, cl 14 thereof, which was\n                    subsequently reaffirmed by the two letters stated above. They sought the\n                    following primary reliefs in the Singapore Action: 1.    A declaration that the Defendant is not entitled,\n                            under a severance agreement dated 17 July 2008 entered into between\n                            the 1st Plaintiff and the Defendant and reaffirmed by way of two letters\n                            from the 1st Plaintiff to the Defendant dated 9 October 2008 and\n                            28 February 2009 (collectively the “Severance\n                            Agreement”), to bring any claim against the 1st Plaintiff and/or\n                            its affiliated companies, including but not limited to the 2nd to 5th\n                            Plaintiffs, in connection with and/or in relation to the\n                            Defendant’s employment and/or association with the 1st Plaintiff\n                            and its affiliated companies, such claims including but not limited to a\n                            claim for “founder” benefits which the Defendant alleges\n                            were conferred upon him by the 1st Plaintiff and/or its affiliated\n                            companies. 2.    A declaration that the Defendant breached the\n                            Severance Agreement by commencing and maintaining Civil Action No.\n                            10-CV-0453(GBD) against the 1st to 5th Plaintiffs in the United States\n                            District Court, Southern District of New York (“US\n                            Proceedings”) in respect of the Defendant’s alleged\n                            “founder” benefits. 3.    An order that the Defendant do pay the Plaintiffs\n                            damages to be assessed in respect of all costs, expenses and losses\n                            incurred by the Plaintiffs arising out of or in connection with the\n                            Defendant’s breach of the Severance Agreement. 4.    An order restraining the Defendant from continuing\n                            the US Proceedings or commencing any further or other proceedings in the\n                            United States of America or elsewhere against the Plaintiffs in respect\n                            of his alleged “founder” benefits. ... 8       Mr Ashlock’s position was that the\n                    plaintiffs were not entitled to the declarations sought in prayers 1 and 2 or\n                    the order in prayer 3 or the anti-suit injunction sought in prayer 4 of the\n                    Singapore Action.",
        "The court’s conclusion and reasons": "9       Mr Ashlock sought to show that the American\n                    Action was in an advanced stage. The American Action was commenced on\n                    20 January 2010. The third and fourth plaintiffs had already relied on the\n                    TA in their Answers filed in that action. The second plaintiff had been served\n                    with the papers in the American Action although it was contesting the\n                    jurisdiction of the US District Court over it. Mr Slone had been served and\n                    had filed an Answer in the American Action. Mr Ashlock had been advised by\n                    his US attorney that a substantial part of the pre-trial process had been\n                    concluded and all that remained was for depositions to be conducted. Thereafter\n                    the matter would proceed to trial. 10     Mr Ashlock said that the plaintiffs had\n                    delayed filing the Singapore Action until 17 February 2011. He suggested\n                    that the Singapore Action was filed because the second plaintiff was afraid that\n                    the outcome of its application to contest the jurisdiction of the US District\n                    Court might be unfavourable to it from a tax perspective. 11     The plaintiffs said that the American Action\n                    was at a preliminary stage. In addition to the second plaintiff’s contest\n                    of jurisdiction, the first and fifth plaintiffs had not even been served with\n                    the American Action although I should mention that this was because they refused\n                    to co-operate with Mr Ashlock on the issue of service. 12     It seemed to me that the American Action was\n                    not at the advanced stage that Mr Ashlock was saying. As mentioned above,\n                    the first and fifth plaintiffs had not yet been served and the second plaintiff\n                    was contesting the jurisdiction of the US District Court over it. 13     More importantly, it was irrelevant whether\n                    the American Action was at an advanced stage or not. Mr Ashlock did not\n                    apply to stay the Singapore Action or for an anti-suit injunction to stop the\n                    plaintiffs from continuing with the Singapore Action. In the circumstances, it\n                    was also irrelevant that the plaintiffs had filed the Singapore action only\n                    recently. 14     Accordingly, I had only to decide whether I\n                    could hear the action immediately or whether it should proceed to trial in\n                    Singapore at the same time as the proceedings in America were\n                continuing. 15     Mr Kelvin Tan, counsel for\n                    Mr Ashlock, submitted that I had to consider a matrix of facts leading up\n                    to and subsequent to the signing of the TA in order to interpret cl 14\n                    thereof: (a)     Mr Ashlock’s willingness\n                        to participate in the fifth plaintiff’s start-up in exchange for an\n                        equitable share in the business. (b)     The scope of discussions between Mr Ashlock and\n                        Mr Slone in respect of the founder’s benefits which purportedly\n                        led to an agreement thereon. (c)     The circumstances under which Mr Ashlock signed the\n                        TA. (d)     Email\n                        correspondence between Mr Ashlock and Mr Laurie James Young (the\n                        Managing Director – Organizational Development of the CLSA Group)\n                        after the signing of the TA. (e)     The conduct of the plaintiffs in the American\n                        Action. 16     In my view, sub-paras (a) and (b) of[15]above would not assist the court in\n                    interpreting cl 14. They would be relevant only if the court were to\n                    conclude that cl 14 does not preclude Mr Ashlock from pursuing his\n                    claims in respect of founder’s benefits against the five\n                    plaintiffs. 17     As for the circumstances under which\n                    Mr Ashlock signed the TA, he suggested that the court take into account two\n                    matters. 18     Firstly, since April 2008, he had been\n                    suffering from intense dizzy spells, loss of balance and severe loss of hearing\n                    in his right ear. In early August 2008, he was diagnosed with a brain tumour\n                    which was eventually found to be benign. 19     Secondly, he received a telephone call from\n                    Mr Young on 17 July 2008 to meet him at the lobby of the Fullerton\n                    Hotel for a discussion. However, instead of a discussion, Mr Young\n                    presented him with a copy of the TA and told him that he would either agree to\n                    it or be fired. Mr Ashlock had no other income to support his family and he\n                    was concerned that if a diagnosis revealed a serious medical condition, the\n                    medical bills would impose a tremendous financial burden on his family. In the\n                    circumstances, he said he had no choice but to sign the TA. 20     He also said he thought that the TA resolved\n                    issues pertaining to his employment only and not to the founder’s\n                    benefits. It was only about three hours after the meeting that he sought to\n                    clarify with Mr Young that cl 14 did not prevent him from making a\n                    claim in respect of the founder’s benefits. I will elaborate on this\n                    purported clarification later. 21     Mr Young did not agree with\n                    Mr Ashlock’s suggestion that he had been compelled to sign the\n                    TA. 22     In any event, Mr Ashlock was not seeking\n                    to set aside the TA on any ground,eg, mistake,\n                    duress or undue influence. Accordingly, the two matters he raised were\n                    irrelevant. I would add that he learned about the diagnosis of his brain tumour\n                    in August 2008 which was after the TA was signed on 17 July\n                2008. 23     As for the clarification which Mr Ashlock\n                    had purportedly sought from Mr Young, Mr Ashlock had sent an email\n                    dated 17 July 2008 to Mr Young which stated: Laurie, I want to go on record with you that it is my understanding that by\n                        signing the resignation agreement today that I am acting in good faith that\n                        a subsequent agreement will be reached in terms of my relationship with CLSA\n                        and insurance for 2009 as well as my founder status. I signed the agreement\n                        believing that section 14 does not preclude an agreement or possible actions\n                        should we not be able to reach an agreement. Please let me know if this\n                        undersanding [sic] differs from yours. Regards, Bill 24     The material part of Mr Young’s\n                    email reply dated 18 July 2008 stated: I believe our conversations over the last few days have been conducted in\n                        a very constructive and cordial manner. I will continue to search for a\n                        mutually acceptable agreement covering a future relationship with CLSA and\n                        medical coverage in the US. Clause 14 of the separation agreement must stand on its merits Bill as was\n                        the intention of the document you signed. Laurie 25     Mr Ashlock accepted that Mr Young\n                    did not agree with him that he could still pursue a claim on the founder’s\n                    benefits. However, he disingenuously suggested that Mr Young did not\n                    disagree. 26     It was clear to me that Mr Young did\n                    disagree although he did so politely and that Mr Ashlock knew that\n                    Mr Young was disagreeing. I was of the view that Mr Ashlock’s\n                    email dated 17 July 2008 was a self-serving one and did not assist me in\n                    the interpretation of cl 14. 27     As for the plaintiffs, they sought to rely on\n                    two letters which Mr Ashlock counter-signed to argue that he had accepted\n                    Mr Young’s stand on cl 14. 28     The first is a letter dated 9 October\n                    2008 from the first plaintiff to Mr Ashlock. It states: Dear Bill, Further to our letter dated 17 July 2008, I am writing\n                        to confirm the following: •    You will remain on the SetClear Pte. Ltd.\n                                payroll through until 30 June 2009; •    The Company will continue to reimburse you\n                                the cost of maintaining your Cobra medical insurance up to and\n                                including 30 June 2009 as per Cobra Scheme rules. These additional arrangements are provided to you in good faith by the\n                        Company to assist you as you work through this difficult period. We are proposing this strictly on condition that you confirm that the\n                        terms and conditions which have been previously agreed by you, per your\n                        separation agreement dated 17 July 2008, remain in full force and effect and\n                        are re-confirmed by you. Yours sincerely,  Toni Carroll For and on behalf of SetClear Pte. Ltd.     I hereby agree and accept the terms and conditions as set out\n                        above:  ____________________ Name: Mr Bill Ashlock Date: 29     The second is a letter dated 28 February\n                    2009 from the first plaintiff to Mr Ashlock. It states: Dear Bill, Following your recent conversation with Laurie Young I am writing to\n                        confirm that your final day of employment with SetClear Pte Ltd will be\n                        28 February 2009. As agreed, your salary and benefits have been calculated and paid up to\n                        31 December 2008 and you have been on unpaid leave up to and including\n                        28 February 2009. All other terms agreed with you and confirmed in our letters dated\n                        17 July 2008 and 9 October 2008 remain unchanged. Yours sincerely,  Toni Carroll For and on behalf of SetClear Pte. Ltd  I hereby understand and agree to the terms and conditions that are set out\n                        above.  Signed:\n                                        _____________Bill\n                                    AshlockDate: 28/02/09   30     The reference to a 17 July 2008 letter\n                    was in fact to the TA dated 17 July 2008. 31     As mentioned above, Mr Ashlock had\n                    counter-signed these two letters. I was of the view that by counter-signing\n                    these two letters, Mr Ashlock had affirmed the TA and it was too late for\n                    him to resile from it. This was an additional reason why his allegations about\n                    his health and about being compelled to sign the TA were irrelevant. However,\n                    the counter-signing of the two letters did not necessarily mean that he had\n                    agreed with Mr Young’s view on cl 14. 32     The above discussion covers sub-paras (c) and\n                    (d) of[15]above. As for sub-para (e) of[15]above, I did not see how the\n                    conduct of the plaintiffs in the American Action would affect the interpretation\n                    of cl 14. Indeed, Mr Tan did not substantiate his argument that such\n                    conduct would affect the said interpretation. 33     As regards the governing law of the TA, the\n                    plaintiffs contended that the governing law was Singapore law. Mr Ashlock\n                    apparently did not agree but he did not say what the governing law was. The\n                    employment which was terminated by the TA was the subject of a letter from the\n                    first plaintiff to Mr Ashlock dated 10 May 2007 and counter-signed by\n                    him on 13 May 2007 (see[2]above). The\n                    terms thereof expressly stated that the governing law was Singapore law. The\n                    first plaintiff is a company incorporated in Singapore and Mr Ashlock was\n                    stationed in Singapore while he was employed by the first plaintiff. The TA was\n                    signed in Singapore. In the circumstances, I concluded that Singapore law was\n                    the governing law of the TA. 34     I would also mention that although the TA was\n                    entered into between the first plaintiff and Mr Ashlock, the second to\n                    fourth plaintiffs were also seeking to enforce it by relying on\n                        s 2(1)(b) and 2(3) of the Contracts\n                    (Rights of Third Parties) Act (Cap 53B, 2002 Rev Ed). Mr Alvin Yeo,\n                    SC, counsel for the plaintiffs, submitted that the second to fourth plaintiffs\n                    were affiliated companies of the first plaintiff for the purpose of cl 14.\n                    Mr Tan did not contest these submissions. In any event, even if the second\n                    to fourth plaintiffs were not entitled to enforce the TA, it was accepted that\n                    the first plaintiff certainly was. 35     Mr Ashlock contended that the TA only\n                    resolved issues relating to his employment and cl 14 did not preclude him\n                    from claiming the founder’s benefits against any of the plaintiffs. His\n                    contention ignored the obvious point that the resolution was on certain terms,\n                    one of which was cl 14, and that it was open to the parties to agree that\n                    he was not to make any claim against the plaintiffs as part of the terms of the\n                    resolution. 36     In my view, the terms of cl 14 were\n                    simple and clear (see[4]above). The TA was\n                    in full and final settlement of all claims by Mr Ashlock against the\n                    plaintiffs. The sentence that Mr Ashlock agrees not to pursue any future\n                    claim against the plaintiffs was really a consequence of the full and final\n                    settlement. Therefore, Mr Ashlock was not entitled to commence or continue\n                    with the American Action against the plaintiffs. 37     I would add that Mr Ashlock sought to\n                    rely on some conversations between him and Mr Young subsequent to the TA\n                    and an email dated 13 January 2009 from him to Mr Young to show that\n                    the issue of the founder’s benefits was still kept alive after the TA was\n                    signed. However, Mr Young said that he had only agreed to speak to\n                    Mr Slone about such benefits and that that was a matter between the two\n                    individuals. I would add that an earlier email from Mr Young dated\n                    11 January 2009 supported Mr Young’s version which I\n                    accepted. 38     In any event, subsequent statements do not,\n                    generally speaking, affect the interpretation of a provision unless they\n                    constitute an estoppel. Mr Ashlock was not relying on estoppel. Neither was\n                    he relying on a waiver or a variation. 39     In the circumstances, I was of the view that\n                    the plaintiffs were entitled to the declarations sought in prayers 1 and\n                    2. 40     As for prayer 4 about an anti-suit injunction,\n                    Mr Tan referred to various authorities and in particular,John Reginald Stott Kirkham and others v Trane US Inc and\n                        others[2009] 4 SLR(R) 428 to support\n                    Mr Ashlock’s position that an anti-suit injunction ought not to be\n                    granted against Mr Ashlock even if I were to rule on the interpretation of\n                    cl 14 in the plaintiffs’ favour. He stressed that the American Action\n                    was not vexatious or oppressive to the plaintiffs. In that case, the Court of\n                    Appeal stated at [28] and [29]: 28 InEvergreen International SA v\n                            Volkswagen Group Singapore Pte Ltd[2004] 2 SLR(R) 457\n                            (\"Evergreen International SA\"), Belinda\n                        Ang Saw Ean J (\"Ang J\") stated that she had to consider the\n                        following elements in determining whether an anti-suit injunction ought to\n                        be granted in the case (at [16]): (a) whether the defendants are amenable to the jurisdiction of the\n                            Singapore court; (b) the natural forum for resolution of the dispute between the\n                            parties; (c) the alleged vexation or oppression to the plaintiffs if the\n                            foreign proceedings are to continue; and (d) the alleged injustice to the defendants as an injunction would\n                            deprive the defendants of the advantages sought in the foreign\n                            proceedings. 29 In our view, this is as good a list as any with only one qualification,\n                        which would constitute a fifth element - whether the institution of the\n                        foreign proceedings is in breach of any agreement between the parties (seeSouth Carolina Insurance Co v Assurantie Maatschappij\n                            \"De Zeven Provincien\"NV [1987] AC 24). Where there is such\n                        an agreement, the court may not feel diffident about granting an anti-suit\n                        injunction as it would only be enforcing a contractual promise and the\n                        question of international comity is not as relevant (seeThe Angelic Grace[1995] 1 Lloyd's Rep 87 at 96 andWSG Nimbus Pte Ltd v Board of Control for Cricket in\n                            Sri Lanka[2002] 1 SLR(R) 1088 at [91]). However, as far as\n                        the present case was concerned, this element did not come into play as there\n                        was no such agreement between the parties. That said, we will now examined\n                        each of these elements in relation to the facts and circumstances of the\n                        present case, although one could say that the third and fourth elements are\n                        really quite closely related, being two sides of the same coin. 41     In the present case, Mr Ashlock had\n                    agreed under cl 14 not to pursue any future claim against the first\n                    defendant and its affiliated companies. This was a consequence of the full and\n                    final settlement of all his claims (see[36]above). Moreover, the cases which Mr Tan relied on were cases in which the\n                    court was asked to grant an interlocutory anti-suit injunction to restrain a\n                    party from proceeding with a foreign action pending the outcome of the\n                    proceedings in the jurisdiction from which the injunction was sought. In the\n                    case before me, the plaintiffs were not seeking an interlocutory anti-suit\n                    injunction but a permanent one on the premise that the court would be able to\n                    and would make a finding in their favour on the interpretation of\n                    cl 14. 42     I agreed with Mr Yeo that if I were to\n                    interpret cl 14 in the plaintiffs’ favour, then an anti-suit\n                    injunction ought, generally speaking, to be granted to enforce my ruling since\n                    Mr Ashlock had submitted to the jurisdiction of the Singapore courts.\n                    Indeed he is currently working in Singapore. The general rule is subject to\n                    Mr Ashlock showing a special or exceptional reason why the injunction\n                    should not be granted. No such reason was shown. All Mr Tan could say was\n                    that the American Action was at an advanced stage but that was no reason to\n                    allow Mr Ashlock to continue with it once a final ruling was given by a\n                    competent court whose jurisdiction he had submitted to. In the light of my\n                    ruling on the interpretation of cl 14, the American Action against the\n                    plaintiffs was both in breach of cl 14 and vexatious and\n                oppressive. 43     In the circumstances, I made the declarations\n                    sought in prayers 1 and 2 and granted the anti-suit injunction sought in prayer\n                    4. I did not grant prayer 3 for Mr Ashlock to pay damages to be assessed\n                    because the American Action had not caused any damage to the plaintiffs, leaving\n                    aside the question of costs. I was also of the view that any costs incurred by\n                    the second, third or fourth plaintiffs (or by any other plaintiff) in respect of\n                    the American Action ought to be dealt with by the US District Court and so I did\n                    not deal with such costs. However, I did order Mr Ashlock to pay the costs\n                    of the plaintiffs in respect of the Singapore Action which I fixed at $15,000. I\n                    also made it clear that my decision did not preclude Mr Ashlock from\n                    continuing with the American Action against Mr Slone."
    }
}