{
    "case_title": "Prestige Marine Services Pte Ltd\n      v\n      Marubeni International Petroleum (S) Pte Ltd",
    "ncitation": "[2011] SGHC 270",
    "coram": "Tan Lee Meng J",
    "sections": {
        "Background": "2       Marubeni, the claimant in the arbitration\n                    proceedings, entered into a contract to sell Prestige 120,000 mt of High Sulphur\n                    Fuel Oil with viscosity of 380 centistokes (“HSFO 380CST”)\n                    (“the cargo”) to be delivered in July, August and September 2008.\n                    Prestige was required to lift 40,000 mt of the cargo during each of the three\n                    months. The contract price for the cargo was determined on the basis of the\n                    average prices reported on Platts Asia Pacific, an industry newsletter report,\n                    for that month plus USD3.25 per mt. 3       Prestige failed to lift approximately 21,761 mt\n                    of the August 2008 cargo as at 1 October 2008. As of that date, the entire\n                    40,000 mt of the September 2008 cargo had not been lifted. As such, around\n                    61,761 mt of the agreed cargo of 120,000 mt remained unlifted. 4       Although the deadline for lifting the agreed\n                    cargo expired on 30 September 2008, there were on-going negotiations\n                    between the parties for Prestige to continue to lift the unlifted cargo. Such\n                    lifting after the deadline is known as a “rollover” of cargo.\n                    During this “rollover” period, Prestige arranged for two more\n                    letters of credit that enabled 10,955 mt of the outstanding August 2008\n                    contractual quantities to be lifted by the early hours of 11 October 2008\n                    on the basis of the August 2008 price for the cargo. As such, the unlifted cargo\n                    was reduced to around 50,805.9 mt. 5       In the meantime, the parties considered\n                    “booking-out” the August 2008 cargo that remained unlifted as well\n                    as rolling over the September 2008 cargo, which totalled 40,000 mt. Under a\n                    “book-out” arrangement, the buyer agrees to resell to the seller\n                    the agreed cargo. No physical delivery of the cargo is required and the\n                    difference between the contract price and the book-out price is paid to the\n                    party entitled to it. 6       On 10 October 2008, Marubeni sent Prestige\n                    a letter setting out letters of credit projections relating to the\n                    August/September 2008 outstanding cargo. Annoyed, Prestige replied on the same\n                    day as follows: .... Even [though] there were backlogs and we were losing lots of money, we\n                        still load your cargoes. By pushing us to the corner, we have [the] right to\n                        terminate the contracts due to this non-performance.... 7       On the same day, Marubeni sent a second letter\n                    to Prestige to remind the latter to procure the issuance of letters of credit\n                    for the remaining unlifted cargo. 8       On 14 and 15 October 2008, the parties met\n                    again to discuss a possible booking-out of the unlifted cargo. On\n                    14 October 2008, Marubeni emailed Prestige as follows: As you are aware, you have not completed performance of Aug-priced\n                        liftings and Sept-priced liftings which until early last week indications\n                        that you will lift before the Oct-priced cargo. Our acceptance of your\n                        nomination is therefore without prejudice to your obligations to clear the\n                        Aug and Sept cargoes first. Prestige did not reply to this email. 9       With the failure of the negotiations on\n                    booking-out the cargo, Marubeni began to take a grim view of its\n                    “financial exposure” under its contract with Prestige by\n                    16 October 2008. It decided to rely on cl 10(a) of the contract, which\n                    provided that if Prestige’s “reliability or financial\n                    responsibility” should become “impaired or unsatisfactory”\n                    in Marubeni’s “reasonable opinion”, Prestige could be\n                    required to procure a standby letter of credit to cover Marubeni’s\n                    financial exposure under the contract. If such a demand is made under\n                    cl 10(a) of the contract, the standby letter of credit must be furnished by\n                    5 pm on the second banking day in Singapore following the written request,\n                    failing which Marubeni would be entitled to terminate the contract\n                    forthwith. 10     On 17 October 2008, Marubeni served the\n                    requisite written demand under cl 10(a) on Prestige for a standby letter of\n                    credit for US$12m to be issued in its favour. Marubeni claimed that in order to\n                    ascertain its total financial exposure for the unlifted cargo, it sold paper\n                    positions on another type of fuel oil, HSFO 180CST, on 16 and 17 October\n                    2008. Another such sale was made on 24 October 2008. HSFO 180CST is a\n                    little less viscous that HSFO 380CST, which was the agreed cargo, and has\n                    slightly different specifications from the agreed cargo. Apparently, these\n                    transactions (“the paper transactions”), which do not result in\n                    any physical delivery of the oil, were carried out for HSFO180CST fuel oil and\n                    not HSFO 380CST fuel oil because it is a more “liquid” commodity\n                    in the oil paper trade. Based on the paper transactions, Marubeni fixed the\n                    amount of standby letter of credit required under clause 10(a) at\n                US$12m. 11     On the same day that Marubeni effected a sale\n                    of HSFO 180CST in the paper transactions, it bought back the cargo that it had\n                    sold. As the buying back price was fixed on the basis of November and December\n                    2008 prices for the fuel oil, Marubeni alone bore the risk of fluctuations in\n                    the re-purchase in the paper transactions. Prestige claimed that Marubeni made a\n                    profit on the paper transactions and that the alleged profits should be taken\n                    into account to reduce Marubeni’s losses but Marubeni contended that the\n                    paper transactions had nothing to do with its losses arising from\n                    Prestige’s failure to lift the entire agreed cargo. More will be said\n                    about the paper transactions later on. What needs to be noted here is that at\n                    the time Marubeni entered into the paper transactions, it had to hold on to the\n                    physical stocks of the unlifted cargo that it had sold to Prestige as the said\n                    stocks would have to be delivered to Prestige if the latter complied with its\n                    demand for a standby letter of credit under clause 10(a). 12     Under clause 10(a) of the contract, the\n                    standby letter of credit had to be issued by 5 pm on 21 October 2008. As it\n                    was not issued by the deadline, Marubeni’s solicitors, Rajah & Tann,\n                    wrote to Prestige on 22 October 2008 to accept the latter’s\n                    repudiatory conduct, and to terminate the contract. 13     Marubeni claimed that after terminating the\n                    contract on 22 October 2008, it tried to dispose of the unlifted cargo.\n                    However, the unlifted cargo had to be sold in smaller quantities on a\n                    “spot” basis in a rapidly falling market. The first spot contract\n                    was made on 13 November 2008 and the remaining unlifted cargo was sold by\n                    Marubeni to various third parties under 10 spot contracts from 14 November\n                    2008 to 1 December 2009. Based on the difference between the contract price\n                    of the cargo and the sale price under the said spot contracts, Marubeni’s\n                    losses totalled around US$19.26m. 14     In accordance with the terms of the contract,\n                    which required the parties to resolve their differences under the contract by\n                    means of arbitration, the dispute between the parties was referred to an\n                    Arbitrator.",
        "The Arbitrator’s decision": "15     The Arbitrator found that it was only on\n                    22 October 2008 that Prestige had by its conduct clearly and unequivocally\n                    repudiated the contract. By that date, Prestige had not caused the standby\n                    letter of credit demanded by Marubeni pursuant to clause 10(a) of the contract\n                    to be issued before the deadline on the evening of 21 October 2008. It was\n                    also evident by then that the parties’ attempt to agree on a booking-out\n                    arrangement for the remaining unlifted cargo was unsuccessful. 16     It was common ground that if Marubeni was\n                    entitled to damages, the position was governed by s 50(3) of the Sale of\n                    Goods Act (Cap 393, 1999 Rev Ed) (“the SGA”), which\n                    provides as follows: Where there is an available market for the goods in question, the measure\n                        of damages is prima facie to be ascertained by the difference between the\n                        contract price and the market or current price at the timeor times when the goods ought to have been accepted or (if no\n                            time was fixed for acceptance) at the time of the refusal to\n                            accept. [emphasis added] 17     The relevant market price was the\n                    “Ex-Wharf Price” for HSFO 380CST. Applying the second limb of\n                    s 50(3) of the SGA, the Arbitrator decided that 22 October 2008 was\n                    the relevant date for determining the market price of the unlifted cargo for the\n                    purpose of awarding Marubeni damages. As such, he awarded Marubeni the\n                    difference between the contractual price of the cargo and the market price as at\n                    22 October 2008. Prestige was required to pay Marubeni US$11,957,748.43,\n                    after setting off a sum of USD 795,685.80, which Marubeni admitted owing to\n                    Prestige with respect to other transactions between them. Prestige was also\n                    ordered to pay interest on the sum awarded and costs. 18     Dissatisfied with the Award, Prestige sought\n                    to set aside the Award as well as to appeal on four questions of law in relation\n                    to the Award.",
        "The application to set aside the Award": "19     Prestige’s primary reason for having the\n                    Award set aside concerned the Arbitrator’s refusal to take into account\n                    Marubeni’s alleged profits from the paper transactions for the purpose of\n                    reducing the damages awarded to Marubeni. Prestige asserted that the Award\n                    should be set aside because it appeared from paragraph 213 of the Award that the\n                    Arbitrator had relied on a deleted part of Marubeni’s pleadings with\n                    respect to hedging to come to his decision that the alleged profits from the\n                    paper transactions should not be taken into account when computing\n                    Marubeni’s losses. Paragraph 213 of the Award reads as follows: However, the evidence establishes that the Claimant sold\n                        “paper” HSFO180CST positions it had entered into earlier, in\n                        the same quantities as the outstanding unlifted quantities under the\n                        Contract, to crystallize/quantify its losses arising from Respondent’s\n                        repudiatory breach of the Contract for the purposes of the issuance of the\n                        Clause 10(a) notice on 17 October 2008 (the ‘Sale\n                        Transactions’). These Sale Transactions also functioned as ahedgefor the physical 50,800 metric tons of\n                        HSFO380CST purchased by the Claimant over 2 to 8 October 2008 for\n                        potential onward supply to the Respondent…. The re-purchase of the\n                        ‘paper’ HSFO180CST positions sold earlier via the Purchase\n                        Transactions served as ahedgeagainst the\n                        Claimant’s disposal of the physical 50,800 metric tons of HSFO380CST\n                        of outstanding contractual quantities from November to December 2008. In\n                        other words, a physical sale position is cancelled out by a paper purchase\n                        position and vice-versa. [emphasis added] 20     Prestige pointed out that while the question\n                    of hedging was initially canvassed by Marubeni, the latter had abandoned this\n                    defence and the latter’s Statement of Case in its final form contained no\n                    assertion that the paper transactions were intended to be\n                    “hedges”. As such, Prestige contended that it was not open to the\n                    Arbitrator to decide in paragraph 213 of the Award that the paper transactions\n                    were “hedges” for the re-sale by Marubeni of 50,800 mt of the\n                    physical cargo that remained unlifted. 21     Marubeni disagreed with Prestige’s\n                    reading of paragraph 213 of the Award and submitted that the Arbitrator did not\n                    rely on the deleted part of it pleadings relating to hedging. 22     At a hearing on 8 February 2011, the\n                    parties agreed to seek a clarification from the Arbitrator as to what the word\n                    “hedge” in paragraph 213 meant and the court recorded the\n                    following consent order (“the consent order”): 1    In respect of the\n                            Arbitration Award dated 11 October 2010 (the “Award”)\n                            issued by Mr Lim Joo Toon (the “Arbitrator”) in SIAC\n                            Arb No 085 of 2008 (the “Arbitration”), the Arbitrator be\n                            directed to state in relation to paragraph 213 of the Award, whether the\n                            word “hedge” (or its grammatical variants)appearing in\n                            that paragraph: (a)    Had the same meaning as the word\n                                “hedge” (or its grammatical variants) as the latter\n                                was used in Paragraph 20 and the Particulars thereto, as well as\n                                Paragraph 28 of the Amended Statement of Case which the Defendant to\n                                the Originating Summons (ie, Marubeni International Petroleum (S)\n                                Pte Ltd) had withdrawn by way of its amendments to these Paragraphs;\n                                and which were struck through in the final version of the Amended\n                                Statement of Case dated 6 February 2010, as well as in\n                                Paragraph 43(a) of Andrew Chan’s Supplementary Witness\n                                Statement dated 19 January 2010, which was withdrawn on\n                                2 February 2010; or (b)    Meant that the sale of “paper”\n                                HSFO180CST positions on 16, 17 and 24 October 2008 by the\n                                Defendant (the “Sale Transactions”) functioned as\n                                counter-transactions for the 50,800 metric tons of physical HSFO\n                                380CST purchased by the Defendant over 2 to 8 October 2008 for\n                                potential onward supply to the Plaintiff in the Originating Summons\n                                (ie, Prestige Marine Services Pte Ltd) under the Contract, and that\n                                the re-purchase of the “paper” HSFO180CST positions\n                                sold earlier (the “Purchase Transactions”) functioned\n                                as counter-transactions to the Defendant’s disposal of the\n                                physical 50,800 metric tons of HSFO380CST of outstanding contractual\n                                quantities from November to December 2008; in other words, a\n                                physical sale position was cancelled out by a paper purchase\n                                position and vice-versa, or (c)    Was used to convey another meaning, and if so,\n                                what is that other meaning. 2    The Arbitrator is to provide Parties with his\n                            statement on the above within 21 days of this Order\n                        hereto. 3    Parties are at liberty to provide the Arbitrator\n                            with copies of this Order of Court, the Originating Summons, and a\n                            summary of their case on the above issue which shall not exceed 8\n                            pages. The position stated in subparagraph 1(a) of the consent order\n                    encapsulated Prestige’s position while subparagraph 1(b) of the said order\n                    was what Marubeni thought the Arbitrator had meant in paragraph 213 of the\n                    Award. Subparagraph 1(c) of the consent order allowed the Arbitrator to state\n                    what he meant by the use of “hedge” in paragraph 213 of the Award\n                    if he did not agree with the positions outlined in subparagraphs 1(a) and 1(b)\n                    of the consent order. 23     It is noteworthy that at the hearing on\n                    8 February 2011, Marubeni had wanted the following additional paragraph to\n                    be included in the consent order: In the event that the Arbitrator states that the word\n                        “hedge” (or its grammatical variants) appearing in paragraph\n                        213 of the Award has the meaning as is set out in paragraph 1(b)\n                        hereinabove, the Plaintiff hereby withdraws Prayer 1 and 2 of the\n                        Originating Summons. 24     Prestige’s counsel, Mr Andre Maniam\n                    SC (for WongPartnership), thought that the Arbitrator should not be informed\n                    that if he answered the question posed to him in the consent order in a\n                    particular way, the setting aside application will be abandoned. Consequently,\n                    the said additional paragraph was not included in the consent order. However,\n                    Prestige agreed, and this was recorded by the court, that if the Arbitrator\n                    clarified that he did not use the word “hedge” in the manner\n                    stated in subparagraph 1(a) of the consent order but in the sense advanced by\n                    Marubeni in subparagraph 1(b) of the said order, it would not proceed with\n                    prayers 1 and 2 in Originating Summons No 1143 of 2010, which concerned the\n                    setting aside of the Award. 25     The parties forwarded their written\n                    submissions to the Arbitrator. In addition, on 9 March 2011,\n                    WongPartnership (see [24]) instead wrote\n                    to the Arbitrator about his options and stated as follows: 6    …. The Order does not in any way prevent you\n                            from saying what you meant by the word “hedge” in [213] of\n                            the Award. To the contrary, the whole point of the Order is to seek your\n                            clarification as to what you had meant.If you should\n                                consider that the Order restricts you from stating what you had\n                                meant, we invite you to say so when you provide your statement on\n                                the matter. 7    In particular,the Order isnota\n                                directive that the word “hedge” cannot mean what is in\n                                both 1(a) and 1(b). [underlining in original, emphasis added in italics] 26     In his letter dated 11 March 2011 to the\n                    solicitors of both parties, the Arbitrator stated what he meant by\n                    “hedge” in para 213 of the Award as follows: I confirm that the word “hedge (or its grammatical\n                        variants)” appearing in paragraph 213 of the Award had the same\n                        meaning as that set out in paragraph 1(b) of the Order, that is to\n                        say, “meant that the sale of\n                                “paper” HSFO180CST positions on 16, 17 and\n                                24 October 2008 by the Defendant (the “Sale\n                                Transactions”) functioned as counter-transactions for the\n                                50,800 metric tons of physical HSFO380CST purchased by the Defendant\n                                over 2 to 8 October 2008 for potential onward supply to the\n                                Plaintiff in the Originating Summons (ie, Prestige Marine Services\n                                Pte Ltd) under the Contract, and that the re-purchase of the\n                                “paper” HSFO180CST sold earlier (the “Purchase\n                                Transactions”) functioned as counter-transactions to the\n                                Defendant’s disposal of the physical 50,800 metric tons of\n                                HSFO380CST of outstanding contractual quantities from November to\n                                December 2008; in other words, a physical sale position was\n                                cancelled out by a paper purchase position and\n                                vice-versa. 27     As the Arbitrator had adopted Marubeni’s\n                    interpretation of the word “hedge” in paragraph 213, Prestige was\n                    obliged to abandon its attempt to set aside the Award. However, on 11 March\n                    2011, WongPartnership wrote to the Arbitrator to seek a clarification of the\n                    latter’s letter of the same date. It stated as follows: 2    Further, we note at paragraph 3 of your letter, you\n                            confirm that the word “hedge” (or its grammatical\n                            variants)” appearing in paragraph 213 of the Award had the same\n                            meaning as set out under paragraph 1(b) of the Order. Please let us know\n                            if the word “hedge (or its grammatical variants)” also had\n                            the same meaning as that set out under paragraph 1(a) of the\n                            Order. 3    If you feel that the terms of the Order do not allow\n                            you to select both meanings (ie that under paragraphs 1(a)and1(b), please let us know. [emphasis in original] 28     Marubeni regarded Prestige’s attempt to\n                    get the Arbitrator to clarify the position again as nothing more than wanting a\n                    second bite of the proverbial cherry. On 14 March 2011, its solicitors,\n                    Rajah & Tann, wrote to the Arbitrator as follows: Paragraph 3 of your letter confirms that the word “hedge”\n                        (or its grammatical variants)” appearing in paragraph 213 of the\n                        Award dated 11 October 2011 had the same meaning as that set out under\n                        paragraph 1(b) [of the Consent Order]. We are respectfully of the view that\n                        it must follow that neither the meaning as set out in paragraph 1(a) nor any\n                        other meaning including 1(a) read with 1(b) could be ascribed to the word\n                        “hedge” in view of your statement. Your statement as to what\n                        you meant by your use of the word “hedge” (or its grammatical\n                        variants) in paragraph 213 of the award is clear and unambiguous.\n                        Accordingly, we see no reason for the clarification sought in paragraph 2 of\n                        M/s WongPartnership’s letter. 29     On 16 March 2011, the Arbitrator replied\n                    to WongPartnership as follows: 1    I refer to your letters dated 11 March 2011 and\n                            15 March 2011. 2    The terms of the Order of Court dated\n                            8 February 2011 are clear: they only require me to state which of\n                            the 3 sub-paragraphs 1(a), 1(b) or 1(c), the word “hedge”\n                            in paragraph [213] of the Award meant. I am respectfully of the view\n                            that I have by my letter dated 11 March 2011 complied with the\n                            Order by stating that it meant sub-paragraph 1(b). Your requests as\n                            stated in your abovementioned letters are beyond the terms of the Order\n                            of Court. 30     On 18 March 2011, Rajah & Tann wrote\n                    to the Supreme Court Registry as follows: .... 3    As far as Marubeni is concerned, the effect of the\n                            Arbitrator’s position is clear and unambiguous: prayers 1 and 2 of\n                            the captioned Originating Summons are withdrawn. Therefore Marubeni does\n                            not see what there is for Prestige to address the Honourable\n                            Court. 4    Only Prestige’s application for leave to\n                            appeal on questions of law under prayers 3 to 8 of the captioned\n                            Originating Summons remain to be determined by the Honourable\n                            Court.... 31     At the hearing before me on 22 September\n                    2011, Prestige asserted that the Arbitrator had not stated his position clearly\n                    and that he should be asked to do so. Prestige’s position was untenable.\n                    As has been mentioned, on 9 March 2011, WongPartnership had written to the\n                    Arbitrator to say that if the Order restricted him from stating what he had\n                    meant in paragraph 213, he should say so. WongPartnership went so far as to add\n                    that the Order was not a directive that the word “hedge” cannot\n                    mean what is in both 1(a) and 1(b). 32     Two days after having been advised by\n                    WongPartnership on his options, the Arbitrator chose to confirm in his letter\n                    dated 11 March 2011 to the solicitors of both parties that subparagraph\n                    1(b) of the consent order reflected what he meant by the word\n                    “hedge” in paragraph 213 of the Award and he reiterated this in\n                    his letter to WongPartnership dated 16 March 2011. It is noteworthy that if\n                    the Arbitrator had intended to convey a meaning different from that stated in\n                    subparagraphs 1(a) or 1(b), he was entitled under subparagraph (c) of the\n                    consent order to explain that other meaning. 33     As the Arbitrator had adopted Marubeni’s\n                    interpretation of paragraph 213 of the Award, Prestige must honour its agreement\n                    not to proceed with prayers (1) and (2) of the Originating Summons.\n                    Consequently, no order was made to require the Arbitrator to further clarify the\n                    matter.",
        "The application for leave to appeal on questions of law": "34     As I ruled that Prestige was obliged to honour\n                    its commitment to abandon its attempt to set aside the Award if the Arbitrator\n                    agreed with Marubeni’s interpretation of para 213 of the Award, I\n                    proceeded to hear the parties’ arguments on Prestige’s application\n                    for leave to appeal on questions of law.",
        "Section 49 of the Arbitration Act": "35     Section 49(1) of the Arbitration Act\n                    (Cap 10, 2002 Rev Ed) (“the Act”) provides that a party\n                    to arbitration proceedings may appeal to the Court on a question of law arising\n                    out of an award in the proceedings. An appeal may not, however, be brought\n                    except with the agreement of all the parties to the proceedings or with the\n                    leave of the court (see s 49(3) of the Act). The conditions for obtaining\n                    leave are set out in s 49(5), which provides as follows: Leave to appeal shall be given only if the Court is satisfied that\n                        – (a)    the determination\n                            of the question will substantially affect the rights of one or more of\n                            the parties; (b)    the question is\n                            one which the arbitral tribunal was asked to\n                            determine; (c)    on the basis of\n                            the findings of fact in the award — (i)    the decision of the arbitral tribunal on the\n                                question is obviously wrong; or (ii)   the question is one of general public\n                                importance and the decision of the arbitral tribunal is at least\n                                open to serious doubt; and (d)    despite the agreement of the parties to resolve\n                            the matter by arbitration, it is just and proper in all the\n                            circumstances for the Court to determine the question. 36     In relation to Prestige’s application\n                    for leave to appeal, a number of other points ought to be noted. First, for\n                    “one-off” contracts, such as the contract presently being\n                    considered, the discretion to grant leave to appeal is strictly exercised: seePioneer Shipping Ltd v BTP Tioxide Ltd (The\n                        Nema)[1982] AC 724 andAntaiosCompaniaNaviera\n                        SA v SalenRederierna AB (The\n                        Antaios)[1985] AC 191. In fact, inThe Antaios, Lord Diplock stated (at p 206) that the test\n                    in situations involving a one-off clause or event is “whether the\n                    arbitrator was, in the judge’s view so obviously wrong as to preclude the\n                    possibility that he might be right”. InAmerican Home\n                        Assurance Co v Hong Lam Marine Pte Ltd[1999]\n                    2 SLR(R) 992 (“American Home Assurance\n                        Co”), the Court of Appeal reiterated (at [20]) that in the case of a \"one-off\" contract\n                    or clause, leave to appeal would normally be refused unless the judge is\n                    satisfied that the construction given by the arbitrator is \"obviously wrong\".\n                    The Court added that the important question is whether an error can be\n                    demonstrated quickly and easily, and if hours of legal argument are required,\n                    the applicant will not have succeeded in satisfying the court that the award is\n                    obviously wrong. In the present case, the arguments as to whether the Arbitrator\n                    was right or wrong were complex and took several hours. 37     Secondly, a distinction is made between a\n                    question of law and an error of law, in respect of which there is no appeal. InAhongConstuction (S) Pte\n                        Ltd v United Boulevard Pte Ltd[1993] 2 SLR(R) 208, GP\n                    Selvam JC explained (at [7]-[8]): 7    A question of law means a point of law in\n                            controversy which has to be resolved after opposing views and arguments\n                            have been considered.... If the point of law is settled and not\n                            something novel and it is contended that the arbitrator made an error in\n                            the application of the law there lies no appeal against that error for\n                            there is no question of law which calls for an opinion of the\n                            court.... 8    An error in law ... by itself does not confer a\n                            right of appeal.... 38     Selvam JC’s views were endorsed inNorthern Elevator Manufacturing SdnBhd v United Engineers (Singapore) Pte Ltd[2004]\n                    2 SLR(R) 494 by the Court of Appeal, which added (at [19]): A “question of law” must necessarily be a finding of law\n                        which the parties dispute, that requires the guidance of the court to\n                        resolve. When an arbitrator does not apply a principle of law correctly,\n                        that failure is a mere “error of law” (but more explicitly, an\n                        erroneous application of the law) which does not entitle an aggrieved party\n                        to appeal. 39     More recently, inNg Eng\n                        Ghee and Others v MamataKapildev Dave and\n                        others (Horizon Partners Pte Ltd, intervener) and another appeal[2009] 3 SLR(R) 109, the Court of Appeal, while explaining what an\n                    error of law entails in the context of an appeal to the High Court from a\n                    decision of the Strata Titles Board, endorsed (at [90]) the following passage inHalsbury’s Laws of EnglandVol 1(1),\n                    Butterworths, 4thEd Reissue, 1989: Errors of law include misinterpretation of a statute or any other legal\n                        document or a rule of common law; asking oneself and answering the wrong\n                        question, taking irrelevant considerations into account or failing to take\n                        relevant considerations into account when purporting to apply the law to the\n                        facts; admitting inadmissible evidence or rejecting admissible and relevant\n                        evidence; exercising a discretion on the basis of incorrect legal\n                        principles; giving reasons which disclose faulty reasoning or which are\n                        inadequate to fulfil an express duty to give reasons; and misdirecting\n                        oneself as to the burden of proof. It is noteworthy that in this case, VK Rajah JA, while observing that\n                    the definition of a question of law in each context may be wider or narrower\n                    depending on the underlying policy considerations, added (at [100]) that it\n                    “can be persuasively said that policy considerations undergirding the\n                    arbitration scheme, where party autonomy is the primary consideration, are quite\n                    different” from those of other schemes.",
        "Whether leave to appeal should be granted": "40     Prestige sought leave to appeal on questions\n                    of law in respect of four allegedly erroneous findings by the Arbitrator, which\n                    were listed in its skeletal submissions at paragraph 14 as follows: (a)    that where damages are assessed based on market\n                            price under section 50(3) of the [SGA], one can nevertheless take into\n                            account the actual re-sale price of the goods (at [211]-[218] and [227]\n                            of the Award (see 1stquestion of\n                            law); (b)    that there is no need for a party to mitigate its\n                            losses after breach by the other party of the contract; he would only\n                            need to mitigate losses after the contract had been terminated (at [211]\n                            of the Award) (see 2ndquestion of\n                            law); (c)    that the relevant date to take the market price\n                            under section 50(3) of the [SGA] is on the date of termination of the\n                            contract, rather than on the date of breach of the contract (at [173],\n                            [207]-[209] of the Award) (see 3rdquestion\n                            of law); (d)    that damages under section 50(3) of the [SGA] for\n                            a contract with a fixed time for performance, should be assessed on the\n                            basis of “the time of [Prestige’s] refusal to accept\n                            [Marubeni’s] [cargo]” rather than “at the time or\n                            times when the goods ought to have been accepted” (at [202]-[203]\n                            of the Award) (see 4thquestion of\n                            law). 41     Prestige contended that the four questions in\n                    respect of which leave to appeal was sought concerned matters of general public\n                    importance and that the threshold for leave (under s 49(5)(c)(ii))was thus\n                    that the Arbitrator’s decision is open to serious doubt and not the higher\n                    test for other matters, which is that the Arbitrator was obviously\n                wrong. 42     Whether the test for the granting of leave to\n                    appeal is that the Arbitrator’s decision is obviously wrong or that it is\n                    open to serious doubt, Prestige faced insurmountable hurdles in complying with\n                    the pre-conditions in s 49(5) of the Act. Furthermore, if one looks at the\n                    questions carefully, what Prestige was mainly complaining about were in fact the\n                    Arbitrator’s alleged errors of law, in respect of which there can be no\n                    appeal. The first question of law 43     The first question of law (“the first\n                    question”) was framed as follows: In relation to the Arbitrator’s decision that damages payable by the\n                        Plaintiff should not be reduced by the USD 6,433,522.73 profit made by the\n                        Defendant from its “paper” HSFO 180CST swap transactions on\n                        16, 17 and 24 October 2008 (to the extent of the balance of cargo under\n                        the contract): 1stQuestion of\n                            law Where damages are assessed based on market price under section 50(3) of\n                        the Sale of Goods Act ... can the actual re-sale price of the goods\n                        nevertheless be taken into account? 44     The application for leave to appeal on the\n                    first question was fundamentally flawed as it was based on two false\n                    assumptions. The first was that the Arbitrator had found that Marubeni made a\n                    profit of US$6,433,522.73 from the paper transactions (“the alleged\n                    profit”). The Arbitrator made no such finding and had merely referred to\n                    this sum as the “alleged” profit. 45     The other false assumption was that the\n                    Arbitrator had taken into account the re-sale price of the unlifted cargo. The\n                    Arbitrator, who made it clear that the damages awarded to Marubeni were based on\n                    the difference between the contract price and the market price on\n                    22 October 2008, discussed the actual re-sale price of the cargo in the\n                    context of Prestige’s assertion that it was entitled to deduct the alleged\n                    profit from the damages awarded to Marubeni. The Arbitrator considered this\n                    argument and pointed out that if Prestige wanted to deduct the alleged profit,\n                    the losses from the sale of the physical stocks of the unlifted cargo, which\n                    amounted to around USD 19.26m, must likewise be taken into account since the\n                    paper transactions were inextricably linked to the purchase and sale of the\n                    physical stocks of the unlifted cargo. It was in this context that the\n                    Arbitrator pointed out that if all these inextricably linked transactions were\n                    taken into account, Marubeni’s loss would be US$12,833,905.82, a sum which\n                    was “broadly similar” to the amount of damages under the market\n                    price rule based on the price of the unlifted cargo on 22 October 2008.\n                    There was thus no basis for saying that the Arbitrator took the actual re-sale\n                    prices into account, and especially so when he made it absolutely clear in\n                    paragraph 228 of the Award that Marubeni was entitled to the difference between\n                    the August and September 2008 contract prices and the market price of the\n                    unlifted cargo on 22 October 2008. 46     Secondly, the first question runs afoul of\n                    s 49(5)(a) of the Act as its determination will not substantially affect\n                    Prestige’s rights. Even if the first question is answered in\n                    Prestige’s favour, the paper transactions cannot be taken into account to\n                    reduce the damages awarded to Marubeni because the Arbitrator found that there\n                    was no causal connection between the alleged profits from the paper transactions\n                    and Prestige’s breach. There was no appeal by Prestige in relation to this\n                    finding. 47     Thirdly, as the first question was not one\n                    which the Arbitrator was asked to determine, the condition precedent in\n                    s 49(5)(b) of the Arbitration Act was not met. This question did not\n                    feature in the list of 10 issues set out by the Arbitrator in paragraph 46 of\n                    the Award when he discussed the issues for determination in the\n                    arbitration. 48     Finally, Prestige correctly asserted in\n                    paragraph 109 of its skeletal submissions dated 7 February 2011 that it is\n                    “trite” law that when the market price rule is applicable, the\n                    actual price of a subsequent resale of the goods is irrelevant. As the first\n                    question involves a trite principle of law, Prestige can only say that the\n                    Arbitrator misapplied this trite principle and even if Prestige is right, there\n                    can be no appeal against this error of law. 49     As it was clear that the underlying factual\n                    premise for the first question was erroneous, that the Arbitrator was not asked\n                    to consider the question, that the answer to the said question will not\n                    substantially affect Prestige’s rights, and that Prestige is really\n                    complaining about an error of law, leave to appeal cannot be granted with\n                    respect to this question. The second question of law 50     The second question of law (“the second\n                    question”) was framed as follows: In relation to the Arbitrator’s decision that damages payable by the\n                        Plaintiff should not be reduced by the USD 6,433,522.73 profit made by the\n                        Defendant from its “paper” HSFO 180CST swap transactions on\n                        16, 17 and 24 October 2008 (to the extent of the balance of cargo under\n                        the contract): 2ndQuestion of\n                            law Does a party who suffers loss from a breach of contract have no duty to\n                        mitigate such loss, until after the contract has been terminated? 51     The second question is flawed because it\n                    assumed that the alleged profit from the paper transactions is the result of\n                    Marubeni’s attempt to mitigate the loss resulting from Prestige’s\n                    failure to take over the unlifted cargo. Prestige, with its eye on the higher\n                    sale prices for the unlifted cargo at around 10 October 2008, as compared\n                    to 22 October 2008, asserted that Marubeni should have mitigated its lossbefore22 October 2008 when the prices of\n                    the cargo were higher. However, as the Arbitrator found that it was only on\n                    22 October 208 that it became clear that Prestige was no longer going to or\n                    was unable to continue to perform its outstanding obligations, Marubeni could\n                    not have mitigated its loss by selling the physical stocks of the unlifted cargo\n                    before 22 October 2008 as it would have been obliged to supply the unlifted\n                    cargo to Prestige had the latter complied with the notice under clause 10 of the\n                    contract and caused a letter of credit to be issued in Marubeni’s favour.\n                    As such, the question of taking steps before 22 October 2008 to mitigate\n                    the loss did not arise and the second question should not be posed to the\n                    court. 52     Leave to appeal on the second question should\n                    also not be granted as the answer to this question will not substantially affect\n                    Prestige’s rights. As such, the requirement in s 49(5)(a) of the Act\n                    has not been met. The Arbitrator had given a number of other reasons for not\n                    taking the alleged profits into account for the computation of damages for\n                    Prestige’s breach of contract. It may be recalled that the first reason\n                    was that even if there was a profit on the paper transactions, it was dwarfed by\n                    the massive losses of around US$19 m sustained by Marubeni in the sale of the\n                    unlifted physical stocks in November and December 2008. Another reason given by\n                    the Arbitrator for not taking into account the alleged profits is that there was\n                    no causative link between Prestige’s breach of contract and the alleged\n                    profits. Marubeni alone bore the risk of either future profits or losses from\n                    the paper transactions and its future profits or losses were independent of\n                    Prestige’s breach of contract. The Arbitrator citedCampbell Mostyn (Provisions) Ltd v Barnett Trading Company[1954] 1 Lloyd’s Rep 65 andAKAS Jamal v MoollaDawood Sons & Co[1916]\n                    1 AC 175 (“Jamal”) to\n                    support his finding. Prestige has not sought leave to challenge these aspects of\n                    the Arbitrator’s decision or his reasoning that the paper transactions\n                    were “inextricably linked” with the transactions with respect to\n                    the sale of the physical cargo. As such, even if the second question was\n                    answered in Prestige’s favour, its position would not be altered as the\n                    Arbitrator would still have been entitled to disregard the alleged profits on\n                    the other grounds he had given. 53     In any case, the Arbitrator’s decision\n                    not to take into account the alleged profits when assessing Marubeni’s\n                    damages was neither obviously wrong nor open to serious doubt. A seller who\n                    wishes to speculate on the price of goods, as Marubeni did in its paper\n                    transactions, is not in a position to foist his speculation losses onto the\n                    buyer. The Arbitrator rightly noted that Marubeni alone bore the risk of the\n                    paper transactions. Had it made a huge loss by selling and buying back the\n                    HSFO180CST fuel oil in the paper transactions, it could not have held Prestige\n                    responsible for the loss. Similarly, Marubeni need not account to Prestige for\n                    any profit made in the paper transactions. InJamal, the Privy Council explained at p 179: If ...the purchaser is entitled to the benefit of subsequent sales, it\n                        must also be true that he must bear the burden of subsequent losses.The latter proposition is in their Lordships’\n                            opinion impossible andthe former is equally unsound....\n                        [T]he speculation as to the way the market will subsequently go is the\n                        speculation of the seller, not the buyer;the seller\n                            cannot recover from the buyer the loss below the market price at the\n                            date of the breach if the market falls, not is he liable to the\n                            purchaser for the profit if the market rises. [emphasis added] 54     For the reasons stated, the second question\n                    need not be further considered. The third and fourth questions of law 55     Both the third and fourth questions of law\n                    (“the third and fourth question” respectively) were also intended\n                    to cast doubt on the Arbitrator’s application of s 50(3) of the SGA.\n                    They were framed as follows: In relation to the Arbitrator’s decision to assess damages based on\n                        the market price: (a) as at 22 October 2008 – the date on which\n                        [Marubeni] wrote to terminate the contract, rather than (b) as at\n                        11 October 2008 – beyond which there was no further performance\n                        of the contract (the market price as at 11 October 2008 (a Saturday)\n                        being the same as that as at 10 October 2008 (Friday); resulting in a\n                        difference of US$5,055,187.85: 3rdQuestion of\n                            law (c)    Under section 50(3) of the [SGA], is the relevant\n                            market price that on the date when the contract is terminated, or when\n                            the contract is breached? 4th Question of law (d)    Under section 50(3) of the [SGA], where the time\n                            contractually stipulated for performance has been exceeded, is the\n                            relevant market price that on the date when performance has ceased\n                            (“when the goods ought to have been accepted”), or when\n                            there is refusal to perform any further (“at the time of the\n                            refusal to accept [the goods]”).” 56     Marubeni pointed out that the third question\n                    was inappropriately framed as s 50(3) of the SGA refers neither to the date\n                    when a contract is terminated or when the contract is breached. Instead,\n                    s 50(3) refers to the time when the goods ought to have been accepted and\n                    the time when the party in breach refused to accept the goods if no time was\n                    fixed for acceptance. 57     As for Prestige’s argument in the\n                    present proceedings that the relevant date of its breach was 11 October\n                    2008, Marubeni pointed out that this was not its pleaded position during\n                    arbitration proceedings. Prestige’s primary position was that damages\n                    should be assessed on the basis of the market price of the unlifted cargo on\n                    10 October 2008, the date it claimed to have terminated the contract, or\n                    alternatively on 14 or 15 October 2008. In its closing submissions,\n                    Prestige reiterated its pleaded position by stating: In the circumstances, the date at which Marubeni’s damages should be\n                        referenced to is 10 October 2008, which is the date by which Prestige\n                        had made it clear it would not perform the [contract] further and indeed\n                        purported to terminate it. 58     The Arbitrator had considered all the dates\n                    submitted by both parties. In his Table at p 74 of the Award, he referred\n                    to the main and alternative dates put forward by both parties for assessment of\n                    damages and accepted Marubeni’s primary position, which was that the\n                    market price should be determined on 22 October 2008. 59     Although Prestige contended that the\n                    Arbitrator found that it was in breach as at 11 October 2008 by failing to\n                    load the unlifted balance of the cargo, it conveniently ignored the\n                    Arbitrator’s finding that whatever may have passed between the parties\n                    before 22 October 2008, it was only on that date that Prestige was inrepudiatorybreach of contract. 60     The Arbitrator was mindful of Prestige’s\n                    assertion that it had in a letter to Marubeni on 10 October 2008 terminated\n                    the contract. However, he pointed out that Prestige did not state in that letter\n                    that it was terminating the contract or that it was no longer going to perform\n                    its own outstanding obligations under the contract. In fact, he found that\n                    Prestige was still trying to perform its outstanding obligations on\n                    11 October 2008. Furthermore, the Arbitrator took the view that a meeting\n                    on 14 October 2008 between the parties reinforced Marubeni’s\n                    understanding that Prestige was, at that point, still trying to perform its\n                    obligation to lift the outstanding cargo. At paragraph 202 of the Award, the\n                    Arbitrator concluded: Considered in totality, the actions of [Prestige] cannot be reasonably\n                        construed as a clear indication on their part in refusing to perform their\n                        end of the contract under section 50(3) of the Sale of Goods Act. For there\n                        to be repudiatory conduct, or in this context, a refusal on a buyer’s\n                        part to accept delivery, there must be a clear and unequivocal refusal to\n                        perform their end of the bargain.... 61     The Arbitrator also referred to\n                    Prestige’s solicitor’s letter of 28 October 2008, which claimed\n                    that Marubeni’s letter of termination of 22 October 2008 constituted\n                    “further repudiatory conduct by Marubeni”. Crucially, the\n                    solicitors added: On the basis of Marubeni’s repudiatory breaches, Prestige hereby\n                        terminates the contract. The Arbitrator noted that if, as Prestige claimed, the contract had\n                    already been terminated on 10 October 2008, its solicitors would not have\n                    used the phrase “herebyterminates the\n                    contract” on 28 October 2008. 62     It is not for this court to interfere with the\n                    important findings by the Arbitrator that Prestige had not terminated the\n                    contract on 11 October 2008 and that the relevant market price for\n                    assessment of damages was that on 22 October 2008. In any event, I do not\n                    think that the Arbitrator has made a mistake in his finding regarding the\n                    relevant date for determining the market price of the unlifted cargo but even if\n                    he did, he had reached his decision by applying s 50(3) of the SGA.\n                    Prestige may be unhappy with the Arbitrator’s reading of s 50(3) of\n                    the SGA but the alleged error in relation to his reading comes within the ambit\n                    of an error of law. 63     As for the fourth question, which concerns a\n                    situation where, as in the present case, the time for the buyer’s\n                    performance of contractual obligations has been extended, Prestige was\n                    confronted with other difficulties. Prestige contended that the Arbitrator\n                    should have assessed damages under the first limb of s 50(3) of the SGA,\n                    which refers to “the time or times when the goods ought to have been\n                    accepted”. However, during the arbitration proceedings, both Prestige and\n                    Marubeni relied on the second limb of s 50(3), which concerns the position\n                    where no date of acceptance has been agreed upon. Having relied on the second\n                    limb of s 50(3), Prestige is in no position to now assert that the\n                    Arbitrator should have applied the first limb of s 50(3). In any case, this\n                    complaint relates to an error of law, in respect of which there is no\n                    appeal. 64     Prestige clutched at straws when it contended\n                    that the second limb of s 50(3) of the SGA was inapplicable as the time\n                    fixed for acceptance was 30 September 2008. This argument has no merit\n                    because with the roll-over, the time for performance had been extended by\n                    Marubeni beyond 30 September 2008. That was why Prestige could lift more\n                    cargo right up to 11 October 2008. Furthermore, the possibility of a\n                    booking-out arrangement for the remaining unlifted cargo was discussed. As the\n                    date for acceptance had been extended beyond 30 September 2008 to a date\n                    that had not been fixed, it was understandable that the Arbitrator relied on the\n                    second limb of s 50(3) of the SGA to determine the damages to which\n                    Marubeni was entitled for Prestige’s repuditory breach. There is much\n                    support for the view that when the contractual date for performance has passed\n                    but the parties agree to extend that date and continue to perform their\n                    obligations beyond that date, the market price of the goods at the date of the\n                    breach may not be the relevant date for assessment of damages. InJohnson v Agnew[1980] AC 367,\n                    pp 400-401, Lord Wilberforce explained: .... Where the contract is one of sale, this principle normally leads to\n                        assessment of damages as at the date of the breach.... But this is not an\n                        absolute rule: if to follow it would give rise to injustice, the court has\n                        power to fix such other date as may be appropriate in the\n                        circumstances. In cases where a breach of a contract for sale has\n                            occurred, and the innocent party reasonably continues to try to have the\n                            contract completed, it would to me appear more logical and just rather\n                            than tie him to the date of the original breach, to assess damages as at\n                            the date when (otherwise than by his default) the contract is\n                            lost.... [emphasis added] 65     InBenjamin’s Sale of\n                        Goods(Sweet & Maxwell, 8thEd,\n                    2010), the position was summed up as follows in paragraph 16-073: [I]f the seller agreed to waive the original delivery date but no definite\n                        date or period was substituted by agreement, the calculation of damages will\n                        be made at the market price at a reasonable time after the last request by\n                        the buyer for postponement of delivery, or at the date when the seller\n                        refused to give any further time. 66     McGregor on Damages (Sweet & Maxwell, 18th\n                    ed 2010) echoes the same position as it states at paragraph 20-120 as\n                    follows: Where the time fixed for acceptance has been postponed at the\n                        buyer’s request and he ultimately fails to accept in the extended\n                        period, the point in time at which breach takes place is deferred and the\n                        damages will be calculated at the market price on the last day to which the\n                        contract was extended if a date was fixed, or at the date when the claimant\n                        refused to grant further indulgence, or at a reasonable period after his\n                        last grant of indulgence. 67     The Arbitrator, having heard the witnesses and\n                    considered the documents, was entitled to take the view that as the original\n                    date for performance of Prestige’s obligations had passed, the market\n                    price on 22 October 2008 was the relevant date for determining\n                    Marubeni’s loss. His decision was not obviously wrong and even if the\n                    questions posed by Prestige were of general public importance, his decision was\n                    not open to serious doubt. As such, the third and fourth questions need not be\n                    further considered. Just and proper in all the circumstances for leave to be\n                granted 68     Section 49(5)(d) of the Arbitration Act\n                    provides that leave to appeal shall be given only if the Court is satisfied that\n                    despite the agreement of the parties to resolve the matter by arbitration, it is\n                    just and proper in all the circumstances for the Court to determine the\n                    question. This is a requirement that must be satisfied even if the other\n                    conditions precedent in s 49(5) have been met. In the 2001 companion volume\n                    to Mustill and Boyd: Commercial Arbitration second edition (Butterworths, 2001),\n                    the authors, while referring to the corresponding provisions in the Arbitration\n                    Act 1996 (c 23)(UK), stated at pp 357-358: There is now a further requirement that “despite the agreement of\n                        the parties to resolve the matter by arbitration, it is just and proper in\n                        all the circumstances for the court to determine the question”....This requirement is plainly not satisfied simply by\n                            demonstrating that the other requirements of [the sub-section] are\n                            satisfied, for otherwise [sub-section (d)] would be unnecessary.Some further reason for intervention must\n                            be present:the court is likely to refuse leave to appeal if\n                        there are circumstances which indicate that the parties wished speed and\n                        finality to prevail even if the tribunal decided a question of law in a way\n                        which was obviously wrong, or at least open to serious doubt. [emphasis added] 69     InGold and Resource\n                        Developments (NZ) Ltd v Doug Hood Ltd[2000] NZCA 131, Blanchard\n                    J, who delivered the judgment of the New Zealand Court of Appeal, listed a\n                    number of factors which the court could take into account, one of which was\n                    whether the contract provides for the arbitral award to be final and binding. In\n                    regard to this factor, he stated (at [54]): .... (7)Whether the contract\n                            provides for the arbitral award to be final and\n                        binding Where there is such a clause, it will not be determinative, but it will be\n                        an important consideration. It will indicate that the parties did not\n                        contemplate becoming involved in litigation over the arbitral award. The\n                        High Court should lean towards giving effect to the stated [preference of\n                        the parties for finality. 70     In the present case, the arbitration clause\n                    provided that “any dispute arising out of or in connection with this\n                    contract “shall be referred to andfinally\n                        resolvedby arbitration in Singapore” (emphasis added).\n                    Clearly, Prestige and Marubeni had intended that where possible, there should be\n                    a final resolution of any dispute arising out of the contract by means of\n                    arbitration and without involving the courts unnecessarily. It follows that\n                    apart from failing to meet some of the other conditions precedent in\n                    s 49(5) of the Act, Prestige’s failure to show that it would be just\n                    and proper for the court to grant leave to appeal is another reason why its\n                    application must be dismissed.",
        "Conclusion on the application for leave to appeal": "71     For the reasons stated, Prestige’s\n                    application for leave to appeal is dismissed with costs."
    }
}