{
    "case_title": "Azman bin Kamis\n      v\n      Saag Oilfield Engineering (S) Pte Ltd (formerly known as Derrick Services\n                Singapore Pte Ltd) and another suit",
    "ncitation": "[2011] SGHC 181",
    "coram": "Philip Pillai J",
    "sections": {
        "Introduction": "1       The parties in Suit No 183 of 2010 and Suit\n                    No 717 of 2009, posed a question of law under O 14, r 12 of the Rules\n                    of Court (Cap 322, R 5, 2006 Rev Ed) to be determined on the agreed\n                    facts set out below. The question of law, as amended by consent of the parties\n                    and with leave of the court, reads as follows: Whether the Plaintiff’s causes of action in Suit No 183 of 2010\n                        [or Suit No 717 of 2009] against the Defendant [or the First Defendant,\n                        in the case of Suit No 717 of 2009] have been extinguished and/or barred\n                        and/or precluded from being maintained consequent to the Scheme of\n                        Compromise and Arrangement dated 3 July 2008 which has been duly\n                        completed, performed and fulfilled according to its terms by 4 May\n                        2009. 2       Having heard counsels’ submissions, I\n                    delivered my decision that the plaintiff’s causes of action in\n                    Suit 183 of 2010 and, subject to the assumption in[14]below, the plaintiff’s causes of action in\n                    Suit 717 of 2009, respectively, against the defendant/first defendant have\n                    not been extinguished and/or barred and/or precluded from being maintained\n                    consequent to the Scheme of Compromise and Arrangement dated 3 July 2008\n                    (“the Scheme”) which was by 4 May 2009 successfully completed\n                    and terminated. I now set out the grounds for my decision on this question of\n                    law on the following agreed facts.",
        "Summons No 2768 of 2010 in Suit No 183 of 2010": "3       The plaintiff in Suit No 183 of 2010\n                    suffered injuries due to an industrial accident on 14 August 2007. On\n                    21 September 2007, the plaintiff’s solicitors wrote to the defendant\n                    (then known as “Derrick Services Singapore Pte Ltd”) to request\n                    for the defendant’s industrial accident report on the full nature of the\n                    accident, the plaintiff’s injuries and the scope and costs of the\n                    treatments which the plaintiff had to undergo as a consequence of the\n                    accident. 4       On 21 November 2007, the Ministry of\n                    Manpower (“MOM”) wrote to the Company to request for Azman’s\n                    medical report. Azman later filed a claim under the “Workmen’s\n                    Compensation Act” on 7 April 2008 (“Azman’s WCA\n                    Claim”). It should be noted that the Company’s liability to Azman\n                    whether under WCA or at common law was and continues to be covered by a valid\n                    insurance policy taken out by the Company. Azman’s solicitors subsequently\n                    wrote to the MOM on 15 March 2010 to inform it that Azman had decided to\n                    pursue his claim for damages under common law and that the MOM was to hold the\n                    matter in abeyance until further notice. The MOM later replied to Azman’s\n                    solicitors to inform them that it considered Azman’s WCA Claim to be\n                    withdrawn. 5       Azman then filed a writ for breach of\n                    employers’ duty and breach of statutory duty on 16 March 2010 against\n                    the Company, his employer. 6       Shortly after Azman first filed his WCA Claim,\n                    the provisional liquidators of the Company procured an investor who pursuant to\n                    an investment agreement conditional upon creditor approval of a scheme of\n                    arrangement, would acquire control of the Company. The Company then issued a\n                    notice to creditors of a meeting to be convened on 25 July 2008 to consider\n                    the Scheme. This notice was sent to all Scheme Creditors (as that term is\n                    defined in the Scheme – see below at[17]). Azman averred that he did not receive any notice of the\n                    Scheme. The Scheme’s meeting of creditors was advertised inThe Straits Timeson 3 July 2008. Azman avers that\n                    he was unaware of the advertisement as he does not read the English newspapers.\n                    The Scheme was duly approved by creditors attending the creditors’ meeting\n                    and a notice was issued and advertised inThe Straits\n                        Timeson 8 August 2008 of a court hearing on 25 August\n                    2008 for court approval of the Scheme that had been approved by the creditors.\n                    The court approved the Scheme on 25 August 2008 and the Scheme took effect\n                    on 26 August 2008 when the Scheme and court approval were filed with the\n                    Accounting and Corporate Regulatory Authority. 7       The Company admits that it had been notified and\n                    was aware of Azman’s industrial accident prior to the approval of the\n                    Scheme. It is not disputed that the Company is covered by a valid insurance\n                    policy in respect of Azman’s claim. 8       The Scheme provided that the cut-off date to\n                    submit proofs of debt (“the Claims Cut-Off Date”) was\n                    22 October 2008. Azman did not submit any proof of debt by this date or\n                    thereafter. Azman did not participate in the Scheme nor did he receive any\n                    payments under the Scheme. The Scheme was terminated on 4 May 2009 by the\n                    Scheme’s manager (“the Scheme Manager”), upon the fulfilment\n                    of all its terms. The Scheme Manager was then discharged on 11 May 2009.\n                    The Company, having successfully restructured and compromised its debts, is now\n                    operating unburdened by the Scheme.",
        "Summons No 4266 of 2010 in Suit No 717 of 2009": "9       The plaintiff in Suit No 717 of 2010, Shaik\n                    Abu Bakar bin Abdul Sukol (“Shaik”), suffered injuries due to an\n                    industrial accident on 4 February 2008. Shaik was also an employee of the\n                    Company. The Company then filed a report of the accident with the MOM. The\n                    report, which was filed on 11 February 2008, indicated that it was filed\n                    under the “WCA Act [sic] [ie, the Workmen’s Compensation Act] only”.\n                    This report indicated that Shaik was claiming for “Workmen Injury\n                    Compensation” (“Shaik’s WCA Claim”). 10     Shortly thereafter, the Company went into\n                    provisional liquidation on 24 March 2008 and it subsequently entered into\n                    the Scheme (see[6], above). Unlike the\n                    situation with Azman, Shaik had earlier notice of the creditors’ meeting.\n                    Shaik had also received notification on 27 August 2008 that the court had\n                    approved the Scheme and that he was to file a proof of debt. 11     Shaik had also submitted original medical\n                    bills to the Scheme Manager on 14 August 2008 after the meetings of the\n                    creditors to consider the Scheme were held. The Scheme Manager submitted to the\n                    Company’s insurance company the bills which had not been paid. The MOM\n                    later issued a “notice of assessment of compensation” under the\n                    “Work Injury Compensation Act” for the sum of $29,400 on\n                    20 October 2008. The insurance company filed its objection to the notice of\n                    assessment. Apparently, the Scheme Manager later issued a cheque for $1,235.25\n                    to Shaik in “full and final settlement” of his claim on\n                    9 January 2009. 12     Like Azman, Shaik did not submit any proof of\n                    debt by the Claims Cut-Off Date. 13     Shortly before the Scheme was discharged, on\n                    8 April 2009 Shaik gave notice to the MOM of his intention to proceed with\n                    a claim under common law and, accordingly, he withdrew his WCA Claim. On\n                    20 August 2009, Shaik commenced this suit against the first and second\n                    defendants. 14     Some preliminary points pertaining to\n                    Shaik’s case should be noted, before I proceed further. It is worth\n                    reiterating that Shaik neither submitted a proof of debt nor did he vote in the\n                    creditors’ meeting. It is also worth noting that it was common ground that\n                    merely making his WCA Claim does not abrogate his common law claims and that he\n                    is entitled to withdraw his application and pursue his common law claims in\n                    court (seeYing Tai Plastic & Metal Manufacturing (S) Pte\n                        Ltd v Zahrin bin Rabu[1983-1984] SLR(R) 212 at [25]). The final preliminary point is that the\n                    legal significance of the Scheme Manager’s payment to Shaik of a cheque\n                    for $1,235.25 in “full and final settlement” of his claims in\n                    respect of the MOM’s assessment of the payable sum of $29,400 on his\n                    common law causes of action in Suit No 717 of 2009 was not argued before\n                    me. There was only a reference, without further elaboration, in Shaik’s\n                    affidavit that he had received a cheque for that amount in “full and\n                    final settlement of [his] claim against the [Company]”. For the purpose\n                    of the question of law before me, I expressed to the parties that I would be\n                    assuming for the purpose of this question of law, that the part payment by the\n                    Scheme Manager did not amount to a compromise by agreement within or apart from\n                    the Scheme, between the Scheme Manager or the Company and Shaik of his WCA Claim\n                    and his common law causes of action. If the part payment made by the Scheme\n                    Manager or the Company was in fact a “full and final settlement”\n                    of Shaik’s compromised claims and common law causes of action, then he\n                    would be barred from pursuing Suit No 717 of 2009 for reasons independent\n                    of the question of law posed before me.",
        "The factual setting of the question of law": "15     The question of law posed on these agreed\n                    facts is a novel but fundamental one which does not appear to have been\n                    addressed head on. This is either because the principles of law relating to the\n                    legal effect of schemes of arrangement are well settled or because the question\n                    of law on the factual matrices of these claims has not hitherto been squarely\n                    posed. I should begin by saying that the question of law is posed on the agreed\n                    factual matrix of a successfully completed and terminated scheme. The question\n                    is not posed within the context of an ongoing scheme. Now that the Scheme has\n                    been successfully completed and terminated in accordance with its terms, are\n                    Azman and Shaik (collectively referred to hereafter as “the\n                    plaintiffs”) barred as a matter of law from instituting their claims\n                    against the Company by reason of the Scheme? It is common ground that these\n                    claims are not barred by any statute of limitation. 16     The Company submits that the Scheme had the\n                    legal effect even after the successful completion and termination of the Scheme,\n                    of extinguishing the insured contingent tortious claims because the plaintiffs\n                    had not filed a proof of debt as required by the Scheme document. Therefore, it\n                    is argued that the Company is completely and absolutely discharged from all such\n                    unproven claims as provided by clause 5.4 of the Scheme.",
        "The relevant provisions of the Scheme": "17     The relevant provisions of the Scheme document\n                    are set out as follows: 1.Definitions 1.1    In this Scheme, except where the context or\n                            subject matter otherwise indicates or requires, the following\n                            expressions shall have the meaning set out opposite or following the\n                            expressions respectively: ... Excluded Creditorsmeans Preferential\n                        Creditors hereto and persons to whom any rights of the foregoing persons\n                        have been assigned or transferred, and Excluded Creditor means any one of\n                        the Excluded Creditors; … Preferential Creditorsmeans any person who\n                        has a claim against the Company that would be entitled to priority in the\n                        case of a winding-up of the Company as set out in Schedule 1. [Namely, “4) fourthly, all amounts due in respect of\n                        workmen’s compensation under the Workmen’s Compensation Act\n                        accrued before, on or after the commencement of winding up”;] … Distribution Summeans the aggregate sum\n                        of: (i)the sums realized by the Provisional\n                            Liquidator; (ii)the sums realized and/or to be realized by the\n                            Scheme Manager; (iii)the sum of US$1,000,000 less GBP 100,000 paid to\n                            the Company pursuant to the investment agreement signed between the\n                            Company, SAAG (S) Pte Ltd, Deradmin and the administrators of Deradmin\n                            dated 30 May 2008; less (i)the sums set aside for payment to Preferential\n                            Creditors; and (ii)the sums set aside for the fees, remuneration\n                            including legal fees and others expenses of the Provisional Liquidator\n                            and the Scheme Manager. … Liabilitymeans any obligation, liability or\n                        indebtedness of a person whether it is present, future, prospective or\n                        contingent, whether its amount is fixed or unliquidated, whether it arises\n                        in contract, tort, restitution or otherwise, whether or not it involves the\n                        payment of money, which arises at common law, in equity, by statute (in\n                        Singapore or in any other jurisdiction) or which arises pursuant to a valid\n                        assignment or a valid authority to pay any amount on behalf of a person or\n                        in any other manner whatsoever provided that such expression does not\n                        include any obligation or liability which is barred by statute or one for\n                        which no remedy may be granted or is otherwise unenforceable. For the\n                        avoidance of doubt, where any obligation or liability under a contract or\n                        policy is void or, being voidable, has been duly avoided, no obligation or\n                        liability shall arise in respect of such obligation or liability; … Proof of Debtmeans a declaration executed\n                        by a Scheme Creditor in respect of the Scheme Claims claimed against the\n                        Company, in the form annexed hereto as Schedule 4, or in such other\n                        form acceptable to the Scheme Manager; … Schememeans this scheme of compromise and\n                        arrangement including all such amendments, additions and variations thereto\n                        as may be required, approved or sanctioned by the Court in accordance with\n                        the relevant provisions of the Act; Scheme Claimin relation to any Scheme\n                        Creditor means the total amount of Liabilities (including any Liabilities\n                        that had been agreed between the Company and the respective Scheme Creditor\n                        but had not paid prior to 24 March 2008), if any, as at 24 March\n                        2008 for which the Company is or may be liable to that Scheme Creditor\n                        (whether contingently or otherwise) after deducting the value of any\n                        Security held by the Scheme Creditor, in respect of or arising from any and\n                        all act, omissions, agreements, transactions, dealings, matters and events\n                        whatsoever effected, occurring or otherwise taking place at any time prior\n                        to the 24 March 2008, and which determination shall be subject to the\n                        provisions of this Scheme; Scheme Creditormeans a creditor of the\n                        Company (other than an Excluded Creditor) who has a Scheme Claim; … Scheme Creditor’s Resolutionmeans a\n                        resolution passed at any Scheme Creditors’ Meeting with the support of\n                        a majority in number of the Scheme Creditors present and voting (whether in\n                        person or by proxy) on the resolution and whose Scheme Claim at that time in\n                        aggregate constitutes more than 50% of the total of the Scheme Claims of all\n                        the Scheme Creditors present and voting on the resolution; ... 2.   The Scheme 2.1Preliminary 2.1.1The purposes of this Scheme which is proposed by\n                            the Company are to procure, in consideration of the matters set out in\n                            this Scheme the discharge and release of all claims by Scheme Creditors\n                            relating to the Scheme Claims against the Company. 2.1.2The Company proposes and agrees, subject to\n                            acceptance by the requisite majority of Scheme Creditors at the Court\n                            Meeting and approval by the Court of this Scheme pursuant to\n                            Section 210 of the Act, to implement this Scheme. … 3.Proof of\n                            Debts, Barring of Claims and Dispute\n                        Resolution 3.1    The admission of any proof of debt or any voting\n                            formfor the purpose of votingat the\n                            Court meeting convened for any purpose including the purpose of\n                            approving this Scheme shallnotconstitute an admission of the proof of debt or voting form by the\n                            Scheme Manager or the Company to any claim or the amount claimed in the\n                            proof of debt or voting form for the purpose of distribution and payment\n                            of the Cash Entitlement. 3.2    For the purpose of seeking payment in respect of a\n                            Scheme Claim, each Scheme Creditor of the Company shall, no later than\n                            the Claims Cut-Off Date, submit by way ofpre-paid\n                                registered post or personal delivery, to the Scheme\n                            Manager at the Specified Address, a Proof of Debt relating to that\n                            Scheme Creditor’s Scheme Claim. 3.3    The value of all Scheme Claims of any Scheme\n                            Creditor who fails to submit a Proof of Debt on or before the Claims\n                            Cut-Off Date shall be deemed to be zero. For the avoidance of doubt, and\n                            as an independent stipulation, in such a situation, the relevant Scheme\n                            Creditor shall be bound by the terms of the Scheme. 3.4    The amount of the Scheme Claims of each and all\n                            the Scheme Creditors shall be determined by the Scheme Manager, and\n                            notified by the Scheme Manager to the Company and each and all the\n                            Scheme Creditors, within seven (7) Business Days of the Scheme\n                            Manager’s Ascertainment Date. 4.Ascertainment\n                            of Scheme Claims 4.1    The amount of the Liability of the Company to each\n                            and all the Scheme Creditors in respect of their Scheme Claims shall be\n                            determined by the Scheme Manager. 4.2    Each Scheme Creditor and the Company shall be\n                            deemed to have agreed and accepted the Scheme Manager’s\n                            determination of the amount of the Scheme Creditor’s Scheme Claim\n                            for the purposes of payment of the Cash Entitlement as set out in the\n                            notice issued by the Scheme Manager pursuant to Clause 3.4, save\n                            and to the extent of any notice of the Scheme Creditor or the Company\n                            submit to the Scheme Manager, by way ofpre-paid\n                                registered post or personal delivery, at the Specified\n                            Address stating that it disagrees with and or disputes such amount of\n                            the Scheme Creditor’s Scheme Claim …. 4.3    In the event that the Company or any Scheme\n                            Creditor submits to the Scheme Manager a notice … stating that it\n                            disagrees with or disputes the amount of its Scheme Claim determined by\n                            the Scheme Manager, then, unless otherwise agreed in writing between the\n                            Scheme Creditor and the Company the amount of the Scheme Claim of that\n                            Scheme Creditor shall be determined by the Independent Adjudicator.\n                            … … 4.5    Subject to any mandatory applicable law, the\n                            determination of the Independent Adjudicator in respect of any\n                            differences or disputes referred to him pursuant to any provision of\n                            this Scheme shall be final and binding on the Company and the Scheme\n                            Creditor, and there shall be no right of appeal therefrom, and no right\n                            to make any claim against the Independent Adjudicator in respect\n                            thereof. 5.Payment to\n                            Scheme Creditors 5.1Payment of Cash\n                            Entitlement 5.1.1The Company shall make or procure the payment in\n                            full to Scheme Creditors in respect of their Cash Entitlements by or no\n                            later than seven (7) Business Days after the Independent\n                            Adjudicator’s Ascertainment Date, in the Reference\n                            Currency. … 5.3Unclaimed\n                            Payments If a Scheme Creditor to whom a cheque has been despatched in accordance\n                        with Clause 5.2.1 has not presented it for payment before it expires\n                        (such expiry date being six months from the date of issue), such failure to\n                        present the cheque will be deemed to be a discharge of the Company’s\n                        obligations to that Scheme Creditor in respect of that payment.\n                        … 5.4    Notwithstanding anything to the contrary herein,\n                            any Scheme Creditor who has failed to submit to the Scheme Manager at\n                            the Specified Address, a Proof of Debt in respect of its Scheme Claim on\n                            or before the Claim Cut-Off Date, shall not be entitled to payment of\n                            his Scheme Claim, and with effect from the Claims Cut-Off Date, the\n                            Company shall be completely and absolutely discharged from that Scheme\n                            Creditor’s Scheme Claim. ... 7.Effect of\n                            Scheme 7.1    The Scheme shall take effect upon the lodgement of\n                            a copy of the Approval Order with the Registrar in accordance with\n                            Section 210(5) of the Act. 7.2    Save as provided for and permitted in this Scheme,\n                            no Scheme Creditor shall, be entitled to take any action or commence or\n                            continue any proceedings against the Company in any jurisdiction after\n                            the Court Meeting Date for or in connection with the payment or recovery\n                            of any sum in respect of or in connection with the Scheme\n                            Creditor’s Scheme Claim. 7.3    Nothing in this Scheme shall affect the rights of\n                            any Scheme Creditor in respect of its Security, or in respect of that\n                            portion of its Scheme Claim secured by the Security, to the extent, in\n                            both instances, of the value of such Security as has been valued in the\n                            process of determination of the amount of the Approved Scheme\n                            Claim. 7.4    This Scheme constitutes all the terms and\n                            conditions agreed upon between the Company and each of the Scheme\n                            Creditors as to the matters dealt with herein and supersedes and cancels\n                            in all respects all previous arrangements, agreements, compromise or\n                            negotiations relating to the Scheme Claim of each Scheme\n                            Creditor. 7.5    Nothing in this Scheme shall entitle any person\n                            purporting to be a Scheme Creditor to file or make any claim or remedy\n                            under and in connection with this Scheme that has been barred by reason\n                            of any limitation of time whether statutory, contractual or otherwise\n                            prior to the Effective Date. ... 11Termination\n                            of Scheme 11.1  This Scheme shall terminate immediately in the\n                            event that:- 11.1.1    The last telegraphic transfer is made or the\n                            last cheque is dispatched to the Scheme Creditors in accordance with\n                            Clause 5.2; and /or 11.1.2    The investment agreement between the Company,\n                            SAAG (S) Pte Ltd, Deradmin and the administrators of Deradmin dated\n                            30 May 2008 is not completed by the Completion Date (as defined in\n                            the aforesaid investment agreement). 12Miscellaneous … 12.2  All the statements in this document are made\n                            solely in connection with this Scheme. Accordingly, they do not\n                            constitute, and should not be deemed to be, admissions of Liability on\n                            the part of the Company or any other party. Nothing herein shall\n                            prejudice any right of the Company in any pending or future legal or\n                            other proceedings to dispute the claim of any person in respect of or in\n                            connection with any indebtedness or the amounts of such indebtedness and\n                            nothing shall imply that any person described herein as a Creditor or\n                            Scheme Creditor or having the benefit of a claim has a valid claim\n                            against the Company or any other parties. 12.3  Details of Scheme Claims provided to the Company\n                            for the purposes of the Court Meeting, the amount in respect of which\n                            the Scheme Creditor votes at the Court Meeting and any determination\n                            relating to the value of the Scheme Creditor’s claim for those\n                            purposes shall not be binding on anyone other than for the purposes of\n                            voting at the Court Meeting and the computation of votes for the\n                            purposes of obtaining approval of the Scheme under Section 210 of\n                            the Act. … [emphasis in original]",
        "Analysis": "18     Although the industrial accidents occurred\n                    prior to the commencement of the Scheme, the plaintiffs’ writs were filed\n                    in 2009 and 2010 respectively, after the successful completion and termination\n                    of the Scheme. The question is whether the plaintiffs are, by reason of the\n                    Scheme, now barred, after the completion and termination of the Scheme, from\n                    pursuing their respective insured claims in those writs against the\n                    Company. 19     This question falls in law to be determined by\n                    the terms and the scope of s 210 of the Companies Act (Cap 50, 2006\n                    Rev Ed) (“the Companies Act”) in the first instance and,\n                    secondarily, by the terms and effects of the Scheme document\n                itself.",
        "Section 210 of the Companies Act": "The purpose, text and scope of s 210 of the Companies\n                Act 20     I first examine s 210 of the Companies\n                    Act to determine whether anything within its purpose, text or scope supports the\n                    argued proposition that the insured contingent tortious claims of the plaintiffs\n                    are, after the completion and termination of the Scheme, barred. Section 210(3)\n                    of the Companies Act provides for the effect of a duly approved and confirmed\n                    scheme to be as follows: (3) If a majority in number representing three-fourths in value of the\n                        creditors or class of creditors or members or class of members present and\n                        voting either in person or by proxy at the meeting or the adjourned meeting\n                        agrees to any compromise or arrangement, the compromise or arrangement\n                        shall, if approved by order of the Court, be binding on all the creditors or\n                        class of creditors or on the members or class of members, as the case may\n                        be, and also on the company or, in the case of a company in the course of\n                        being wound up, on the liquidator and contributories of the company. 21     The purpose and function of the antecedents of\n                    s 210 of the Companies Act have been set out and approved by the Court of\n                    Appeal inThe Oriental Insurance Co Ltd v Reliance National\n                        Asia Re Pte Ltd[2008] 3 SLR(R) 121 (“Oriental Insurance”) at [38] and [40] in the following terms: 38    … InRe Norfolk Island And Byron Bay Whaling Co\n                                Ltd(1969) 90 WN (Pt 1) (NSW) 351, Street J summarised\n                            the purpose behind the then equivalent of the Australian s 411 as\n                            follows (at 354): The section is intended to provide machinery\n                                (i) for overcoming the impossibility or impracticability of\n                                obtaining the individual consent of every member of the class\n                                intended to be bound thereby [ie, by the scheme of arrangement], and\n                                (ii) for preventing, in appropriate circumstances, a minority\n                                of class members frustrating a beneficial scheme. As\n                            Younger J. said in 1917 [inIn re Guardian\n                                Assurance Company[1917] 1 Ch 431 at 441] of the\n                            corresponding English section [viz,\n                            s 120 of the Companies (Consolidation) Act 1908 (c 69) (UK)], in\n                            terms later quoted by Astbury J. inIn re\n                                Anglo-Continental Supply Co. Ltd. [[1922] 2 Ch 723]:\n                            “Its purpose is strictly limited; it does not confer powers; its\n                            only effect at any time is to supply, by recourse to the procedure\n                            thereby prescribed, the absence of that individual agreement by every\n                            member of the class to be bound by the scheme which would otherwise be\n                            necessary to give it validity” [emphasis added] ... 40    A leading local\n                            commentary on companies law shares the same view as well (seeWalter Woon on Company Law(Tan Cheng Han gen\n                            ed) (Sweet & Maxwell Asia, 3rd Ed, 2005) (“Walter Woon”) at para 16.2): Section 210 [of the Companies Act (Cap 50, 1994 Rev\n                            Ed)] provides for schemes of arrangement to be binding on creditors and\n                            members alike after the requisite approval by the specified majority and\n                            upon confirmation by the court.This section obviates\n                                the need for a messy and complicated series of negotiations with a\n                                view to obtaining the unanimous approval of the members or creditors\n                                to a novation or assignment or other variation of their\n                                rights. A scheme of arrangement may be proposed where it\n                            is desired to adjust members’ or creditors’ rightsinter se, or to reorganize the share capital of\n                            the company, or in the case of a group, … [with a view to]\n                            reconstruction or merger. In particular, recourse to s 210 is often\n                            made when it [is] desired to compromise creditors’ claims against\n                            an insolvent company. [emphasis added] 22     The scope and procedural object of schemes of\n                    arrangements or compromises are further outlined by Peter Gibson LJ inSEA Assets Limited v Perusahaan Perseroan(Persero)PT Perusahaan\n                        Penerbangan Garuda Indonesia[2001] EWCA Civ 1696 at [2]: It has been the legislative policy for well over a century to encourage\n                        compromise and arrangements between a company and its creditors or members.\n                        That has been achieved by the enactment of a statutory mechanism to enable\n                        the absence of consent of minority creditors or members to be overcome,\n                        provided that a sufficient number of the relevant creditors or members agree\n                        with the proposed compromise or arrangement and the court gives its\n                        approval. If that occurs, then the dissentient minority will be bound by\n                        that compromise or arrangement. That of course in the case of a creditor is\n                        an encroachment on his right to be paid what he is owed in accordance with\n                        the contractual terms. But the utility of the statutory mechanism is\n                        particularly obvious in a case where a company is in financial difficulties\n                        but can persuade most, but not all, of the relevant creditors that the\n                        company’s debts should be restructured rather than that those\n                        creditors should exercise their rights, including the right to put the\n                        company into liquidation. Finally, inIn re T & N Ltd and\n                        others[2006] 1 WLR 1728 (“In re T\n                        & N”), David Richards J described the purposes of\n                    a scheme of arrangement in the following terms (at [40]): ... one of recognised purposes of section 425 [of the Companies Act\n                        1985 (c 6) (UK)] is to encourage arrangements with creditors which avoid\n                        liquidation and facilitate the financial rehabilitation of the company\n                        … 23     The courts have given effect to the underlying\n                    legislative policy of the antecedents of s 210 of the Companies Act by\n                    holding that such creditor and court approved schemes of compromise or\n                    arrangement bind all creditors. I should underscore that what binds the\n                    creditors is the compromise or arrangement set out in the scheme. A compromise\n                    or arrangement ordinarily means a variation by way of restructuring and/or\n                    rescheduling of the company’s debts owed to creditors. The question here\n                    is whether a scheme has the effect in law of unilaterallyextinguishingan insured claim in totality, quite apart from\n                    compromising it. A careful reading of s 210 of the Companies Act and the\n                    underlying legislative policy set out in the cases cited above, reveals nothing\n                    which supports the proposition that s 210 of the Companies Act by its terms\n                    confers a statutory result that the scheme extinguishes an insured claim against\n                    a company, after the completion and termination of a scheme. Debts or claims can\n                    ordinarily only becompromisedto the extent\n                    provided and performed by the company as set out in the schemevis-à-viseach individual creditor or\n                claimant. 24     Once a scheme has been duly approved by the\n                    creditors and the court, the scheme will be binding on all creditors, whether\n                    proven or unproven, and the courts will not vary or amend the scheme save for\n                    fraud, obvious mistakes in the scheme document and, in Singapore, our courts\n                    will on occasion extend the time for an unproven creditor to prove his debt and\n                    participate in the scheme (seeOriental Insuranceat [66] and [69]). A duly approved scheme may also, in principle, be amended by\n                    another duly approved scheme. This guarded approach provides finality, clarity\n                    and certainty for such approved schemes (seeOriental\n                        Insuranceat [66] and [69]), and facilitates corporate\n                    rehabilitation. 25     Where a scheme has been proposed between the\n                    company and its creditors, the court is empowered under s 210(10) of the\n                    Companies Act upon the application of the company or any member or creditor of\n                    the company to restrain further proceedings in any action or proceeding against\n                    the company except by leave of the court and subject to such terms as the court\n                    imposes. What this means is that once the scheme has been approved by the court,\n                    for the duration of the scheme, the status of any further court proceedings\n                    against the company will be determined by the court before which such\n                    proceedings were commenced, either by reason of s 210(10) of the Companies\n                    Act or by reason of any moratorium against actions provided for in the scheme\n                    document itself. Are the plaintiffs “creditors” within the meaning of\n                s 210(3) of the Companies Act? 26     I turn next to consider the meaning of the\n                    word “creditors” in s 210(3) of the Companies Act. The word\n                    is not defined in the Companies Act. Courts elsewhere have adopted different\n                    interpretations of the word. A summary of the relevant case law may be found inPacrim Investments Pte Ltd v Tan Mui Keow Claire and\n                        another[2010] SGHC 134 at [24]–[31] and inAustralian Corporation Law: Principles and\n                        Practice(Butterworths, Looseleaf Ed, 1991, November 2010 issue)\n                    at para 5.1.0035. 27     On one view, “creditors” may\n                    refer to all persons who have claims which may be admitted to proof in the\n                    winding up of the company (seeRe Glendale Land Development\n                        (in liq)(1982) ACLC 562 at 564; followed inRe Huon Valley Springs Pty Ltd (Receivers and Managers\n                        appointed)(1986) 10 ACLR 883). Applying this view in the\n                    context of the relevant legislation in Singapore, unliquidated tort claimants\n                    such as the plaintiffs would not be “creditors” within the meaning\n                    of s 210(3) of the Companies Act. This is because s 327(2) of the\n                    Companies Act provides that, in the winding up of an insolvent company, the same\n                    rules that prevail in relation to bankrupt persons are applicable with regard\n                    to,inter alia, the debts that are provable.\n                    Reference must then be made to the Bankruptcy Act (Cap 20, 2009 Rev Ed)\n                    (“the Bankruptcy Act”) to determine whether unliquidated tort\n                    claims may be provable in the winding up of an insolvent company. Section 87(1)\n                    of the Bankruptcy Act provides, in effect, that such claims shall not be\n                    provable: Description of debts provable in bankruptcy 87. —(1) Demands in the nature of unliquidated damages arisingotherwise than by reason of a contract, promise or\n                            breach of trustshallnotbe\n                        provable in bankruptcy. … [emphasis added in bold italics] 28     Another view is that the definition of\n                    “creditors” for the purpose of schemes of arrangement extends\n                    beyond persons with claims provable in winding up (seeIn re\n                        T & Nat [40]).\n                    However, even if a broader view is adopted, it is not entirely clear whether a\n                    person with an unliquidated claim in tort is a creditor for the purpose of a\n                    scheme of arrangement. There is Australian case law to the effect that such\n                    claimants are not creditors (seeTrocko v Renlita Products\n                        Pty Ltd; The Commonwealth Trading Bank and Shepherd (Claimants)[1973] 5 SASR 207 at 209–210,In re Waymouth\n                        Guarantee and Discount Co[1975] 10 SASR 407 at 457 (per\n                    Walters J)). There is case law to the contrary as well (seeRe R L Child & Co Pty Ltd(1986) 10 ACLR\n                    673). 29     However, it was not necessary for me to reach\n                    a conclusion as to whether unliquidated tort claimants, in general, are\n                    “creditors” within the meaning of s 210(3) of the Companies\n                    Act. 30     It is appropriate that the courts adopt an\n                    approach which gives the broadest scope to creditors for the purpose of\n                    facilitating corporate rehabilitations. Thus an insured unliquidated tort\n                    claimant may opt in to participate in a scheme, receive compromised payments\n                    thereunder and be bound by the scheme. Other insured unliquidated tort claimants\n                    may elect to opt out of the scheme and commence court actions against the\n                    company between the period where the company has proposed scheme and right up to\n                    the termination of the scheme. Claimants who opt out run the risk of any\n                    moratorium that might arise either out of s 210(10) of the Companies Act or\n                    from the terms of the scheme document. 31     Nothing in s 210 of the Companies Act is\n                    directed to address post-completion and post-scheme termination events.\n                    Section 210 of the Companies Act quite naturally does not go further to\n                    prescribe consequences that follow the completion and termination of schemes of\n                    arrangement, it being concerned only to facilitate the corporate rehabilitation\n                    process. The practical reality before me, is that the Company’s insurer is\n                    the person who bears the liability to meet the unliquidated tort claims should\n                    the plaintiffs succeed. It would not serve any statutory purpose of\n                    s 210(3) of the Companies Act, which is to facilitate rehabilitation of\n                    companies in financial difficulty, and neither is there any language in\n                    s 210(3) of the Companies Act which provides any basis to conclude that a\n                    scheme may statutorily extinguish the insured claims of persons such as the\n                    plaintiffs, which have no real impact on the Company’s assets or its\n                    rehabilitation, and who did not participate in the scheme in any\n                way.",
        "The terms of the Scheme": "32     I next turn to the Scheme document on how it\n                    defines Scheme Creditors and the scope and effects expressed within it. The\n                    material definition clauses are as follows: Scheme Creditormeans a creditor of the\n                        Company (other than an Excluded Creditor) who has a Scheme Claim; Scheme Claimin relation to any Scheme\n                        Creditor means the total amount of Liabilities (including any Liabilities\n                        that had been agreed between the Company and the respective Scheme Creditor\n                        but had not paid prior to 24 March 2008), if any, as at 24 March\n                        2008for which the Company is or may be liable to that\n                            Scheme Creditor (whether contingently or otherwise)… Liabilitymeans any obligation, liability or\n                        indebtedness of a person whether it is present, future, prospective or\n                        contingent, whether its amount is fixed or unliquidated, whether it arises\n                        in contract, tort, restitution or otherwise, whether or not it involves the\n                        payment of money, which arises at common law, in equity, by statute (in\n                        Singapore or in any other jurisdiction) or which arises pursuant to a valid\n                        assignment or a valid authority to pay any amount on behalf of a person or\n                        in any other manner whatsoever provided that such expression does not\n                        include any obligation or liability which is barred by statute or one for\n                        which no remedy may be granted or is otherwise unenforceable. For the\n                        avoidance of doubt, where any obligation or liability under a contract or\n                        policy is void or, being voidable, has been duly avoided, no obligation or\n                        liability shall arise in respect of such obligation or liability; [emphasis added in bold italics] 33     It is clear that each Scheme Claim is defined\n                    to mean a claim “for which the Company is or may be liable to that Scheme\n                    Creditor”. The definition of “liability” which is defined\n                    to aggregate all liabilities in their totality and to comprise individual claims\n                    for which the company is or may be liable to that Scheme Creditor, resonates the\n                    same point. I note that an Australian court has following its construction of\n                    the scheme document held that an unliquidated tort claimant was not a creditor\n                    bound by a scheme of arrangement (seeSmith v Carr and\n                        others(1993) 10 ACSR 427). As a matter of construction of\n                    the Scheme document’s definition clauses, the plaintiffs’ insured\n                    claims for which the Company bears no substantive actual or contingent liability\n                    would not, in my view, be claims for which the Company “is or may be\n                    liable ... (whether contingently or otherwise)”. 34     Even if insured claims were to be construed to\n                    be within the Scheme definitions, the next question is whether the Scheme\n                    document has overreaching effects after the conclusion and termination of the\n                    Scheme. The critical clause which is invoked by the Company to close out the\n                    plaintiffs’ claims is clause 5.4 of the Scheme which reads as\n                    follows: 5.4    Notwithstanding anything to the contrary herein,\n                            any Scheme Creditor who has failed to submit to the Scheme Manager at\n                            the Specified Address, a Proof of Debt in respect of its Scheme Claim on\n                            or before the Claim Cut-Off Date,shall not be\n                                entitled to payment of his Scheme Claim, and with effect from the\n                                Claims Cut-Off Date,the Company\n                                shall be completely and absolutely discharged from that Scheme\n                                Creditor’s Scheme Claim. [emphasis added in italics and bold italics] 35     In order for a scheme to achieve its purpose\n                    of binding minority creditors, the statutory conditions in s 210(3) of the\n                    Companies Act must be followed and court approval of the scheme must be\n                    obtained. In order to fulfil the statutory conditions in s 210(3) of the\n                    Companies Act, the company has to identify its creditors and settle the amounts\n                    payable to them in order that the necessary numerical and value votes may be\n                    determined. Clause 5.4 is designed to determine the classes of eligible\n                    Scheme Creditors and the amounts due to them for this purpose. In order to\n                    determine the relevant numbers and values, clause 3.3 treats unproven debts\n                    or claims to be computed as zero and then clause 5.4 treats such unproven\n                    creditors as not being entitled to participate in payments under the Scheme and\n                    as having had their debts discharged from the Claims Cut-off Date for the\n                    purposes of the Scheme. Clauses 3 and 5 accordingly set out the mechanics\n                    of determining the number and value of eligible creditors for purposes of\n                    computing the statutory thresholds and for determining the persons entitled to\n                    receive the compromised payments as set out in the Scheme. 36     What is clear is that such unproven creditors\n                    are not entitled to receive any payments made to proven creditors under the\n                    Scheme and for this purpose his claim is to be treated as discharged. As noted\n                    above, the unproven creditor would find himself closed out from participating in\n                    the Scheme save in exceptional circumstances (see[24], above). What is not expressed in clause 5.4, however,\n                    is that all unproven claims are to be treated as unilaterally discharged beyond\n                    the life of the Scheme. 37     The heart and effects of the Scheme is set out\n                    in clause 2.1.1 of the Scheme as follows: The purposes of this Scheme which is proposed by the Company are to\n                        procure,in consideration of the mattersset\n                        out in this Scheme the discharge and release of all claims by Scheme\n                        Creditors relating to the Scheme Claims against the Company. [emphasis added in bold italics] Clause 2.1.1 expressly contemplates that the Company has to\n                    provide some consideration to Scheme Creditors in exchange for which the claims\n                    as compromised will be discharged and released. Clause 5.4 does not have an\n                    independent life of its own but is subject to clause 2.1.1. The compromise\n                    is ordinarily structured by a variety and combination of means including\n                    reduction/forgiveness of principal and/or interest (referred to as\n                    “haircuts”), equity for debt exchanges, and the\n                    rescheduling/postponement of repayment. This comports with the basic legal\n                    principle that a legal obligation cannot be unilaterally disclaimed by one party\n                    save by mutual agreement. Neither clause 2.1.1 nor clause 5.4 have,\n                    following the completion and termination of the Scheme, the overreaching effect\n                    of enabling the company to have unilaterally extinguished debts or claims which\n                    were unproven and which did not participate in the scheme. 38     I am mindful of the wider market implications\n                    of this question of law and I accordingly frame my decision within the narrow\n                    context of the agreed facts (see[3]–[13], above) and\n                    test it against the legislative policy of s 210 of the Companies Act. The\n                    legislative policy is to facilitate companies to reach a compromise and\n                    arrangement with their creditors in order to obviate the need for liquidation\n                    and to facilitate financial rehabilitation of the company, where the prescribed\n                    majority of creditors agree to such compromise or arrangement (see above at[21]–[22]). This policy is achieved by ensuring finality to the\n                    process of identifying and quantifying the value of outstanding debts and claims\n                    in order to determine whether the prescribed majority agree to the proposed\n                    compromise. This legislative policy will not be undermined by holding that\n                    unproven and insured unliquidated tort claimants whose claims have no\n                    substantive effect on the Company’s assets, are not barred from pursuing\n                    their claims in court after the successful completion and termination of the\n                    Scheme. I have addressed the risks that such insured claimants take in\n                    commencing actions in court once a scheme has been proposed and up to the\n                    termination of a creditor and court approved scheme above at[30]. 39     In the light of the above, I would hold that\n                    the plaintiffs’ unproven insured contingent tortious claims against the\n                    Company are not within the definition of creditors in the Scheme document. Even\n                    if they were to be regarded as within such definition, the Scheme document does\n                    not have overreaching effects following the completion and termination of the\n                    Scheme so as to unilaterally completely and absolutely discharge the Company\n                    from the plaintiffs’ claims.",
        "Conclusion": "40     For all these reasons, I decided that, in\n                    these circumstances: (i)     Azman’s causes of action in\n                        Suit No 183 of 2010 against the Company have not been extinguished\n                        and/or barred and/or precluded from being maintained consequent to the\n                        Scheme of Compromise and Arrangement dated 3 July 2008 which had been\n                        duly completed, performed and fulfilled according to its terms by 4 May\n                        2009; and (ii)     Shaik’s causes of action in Suit No 717 of 2009 against the\n                        Company, assuming that his receipt of part payment from the Scheme Manager\n                        was not in full and final settlement of his claim and causes of action,\n                        either in or apart from the Scheme, have not been extinguished and/or barred\n                        and/or precluded from being maintained consequent to the Scheme of\n                        Compromise and Arrangement dated 3 July 2008 which had been duly\n                        completed, performed and fulfilled according to its terms by 4 May\n                        2009."
    }
}