{
    "case_title": "Law Society of Singapore\n      v\n      Zulkifli bin Mohd Amin and another matter",
    "ncitation": "[2011] SGHC 19",
    "coram": "Chan Sek Keong CJ; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1       Originating Summons No 219 of 2010\n                    (“OS 219”) was an application by the Law Society of Singapore\n                    (“the Law Society”) for three advocates and solicitors who were\n                    all partners of M/s Sadique Marican & Z M Amin (“the Firm”) to\n                    show cause why they should not be sanctioned under s 83(1) of the Legal\n                    Profession Act (Cap 161, 2009 Rev Ed) (“the Act”). All\n                    three respondents, Mr Zulkifli bin Mohd Amin (“Zulkifli”),\n                    Mr Mohd Sadique bin Ibrahim Marican (“Sadique”), and\n                    Mr Anand Kumar s/o Toofani Beldar (“Anand”) were admitted as\n                    advocates and solicitors in 2000. The disciplinary proceedings came about as a\n                    result of misappropriations by Zulkifli, in 2007, of clients’ monies in\n                    excess of $11m. 2       Originating Summons No 1292 of 2009\n                    (“OS 1292”) was an earlier show-cause application against\n                    Zulkifli for grossly improper conduct under s 83(2)(b) of the Act in a property transaction in failing to: (a)     use reasonably available legal means\n                        consistent with his retainer to advance his clients’\n                    interest; (b)     keep his\n                        clients reasonably informed of the progress of the transaction;\n                    and (c)     explain to his\n                        clients certain letters or notices received from the vendor’s\n                        solicitors.",
        "The facts in OS 219": "3       Zulkifli and Sadique set up the Firm in 2004 as\n                    equity partners, with Anand as a salaried partner. 4       Zulkifli was the managing partner, and he\n                    managed the Firm’s client and office accounts. He was also in charge of\n                    budgeting. Sadique and Anand had responsibility for matters concerning staff\n                    salaries and monthly reviews of the balances in the client\n                account. 5       The Firm did not have an accounts clerk. From\n                    1 March 2006 to 31 July 2007, the Firm employed one Ms Sally Ang\n                    (“Sally”) as finance and human resource manager. She worked under\n                    Zulkifli. Sadique explained how the Firm was managed as follows: [I]n fact the whole accounting role was in a way performed by all of the\n                        staff who were handling the files because they prepared and assisted in the\n                        preparation of the documents in support of the payment vouchers and\n                        submission of the payment vouchers and copies of the cheques. This was to\n                        ensure their accountability for each of the file that they carry... it would\n                        be every single staff who handled a file and relating to a client account...\n                        No member of the staff kept account books. It was kept by Zulkifli and in\n                        Sally Ang’s room... As to the exact person or persons who fill up the\n                        books, I would not know. This is simply because the system in the firm,\n                        since we started, was one of accountability between the partners... we were\n                        not comfortable to allow a person in charge of the accounts to be –\n                        like a staff to be in charge of the accounts. So what we did was, as we did\n                        from the start, for a partner to be accountable to other partners as to how\n                        the accounts were kept. So I ensured that the books were there, and I also\n                        ensured that monthly reconciliations were sighted by myself and\n                        [Anand]. 6       On 31 July 2007, Sally left the Firm.\n                    Subsequently, it was discovered that she had misappropriated $838,200 from the\n                    Firm. She has since been prosecuted and convicted of seven counts of criminal\n                    breach of trust under s 408 of the Penal Code (Cap 224, 2008 Rev\n                    Ed), as well as two offences under s 47(1)(b) of\n                    the Corruption, Drug Trafficking & Other Serious Crimes (Confiscation of\n                    Benefits) Act (Cap 65A, 2000 Rev Ed), and has been sentenced to five\n                    years’ imprisonment. According to Sadique, Zulkifli took charge of the\n                    Firm’s accounts after Sally left. He did not know whether Zulkifli was\n                    assisted by anyone. This admission showed that he did not know what was going on\n                    in the Firm in relation to their finances and clients’\n                monies. 7       The manner in which the Firm’s client\n                    account was managed was explained in a letter written by Sadique and Anand to\n                    the Law Society on 28 December 2007: Essentially, the operation and management of the Client account is for\n                        conveyancing matters, of which Mr Zulkifli was the Managing Partner and\n                        Conveyancing Partner, to principally handle monies for conveyancing\n                        transactions. … Mr Zulkifli continued therefore to be in charge ofinter aliathe engagement of a book-keeper to maintain all\n                        cash books, ledgers, journals and reconciliation of the accounts. The supervision over the Client account was ensured by having in place\n                        three signatories to the Client Account of which the mandate to the bank was\n                        for any two of the three signatories to sign, namely Zulkifli Bin Mohd Amin,\n                        Sadique Marican and Anand Kumar. Zulkifli Bin Mohd Amin is the main\n                        signatory. The mandate given to the Bank was for any two of the three signatories and\n                        forany amountfrom the client\n                        account. [emphasis in original] 8       Sadique and Anand claimed that stringent\n                    controls were in place as “every payment out from the client account had\n                    to be supported by payment vouchers, evidence of deposits, completion account\n                    breakdowns and other forms of paper work, as the case may be.” These\n                    controls were obviously not carried out in practice. 9       On 19 November 2007, Sadique and Anand\n                    discovered that both the Firm’s client and office accounts had been\n                    overdrawn. On 20 November 2007, Zulkifli absconded. Two days later, Sadique\n                    and Anand informed Ms Yashodhara Dhoraisingam (“Yashodhara”),\n                    a Senior Director of the Law Society’s Compliance and Conduct Department,\n                    that Zulkifli was missing and that they suspected him of misappropriating monies\n                    from both the client and office accounts. Sadique and Anand made a police report\n                    on the same day. 10     On 23 November 2007, Yashodhara informed\n                    Sadique and Anand that pursuant to rule 12 of the Legal Profession\n                    (Solicitors’ Accounts) Rules (Cap 161, R 8, 1999 Rev Ed)\n                    (“the SAR”), the Council of the Law Society (“the\n                    Council”) would inspect the Firm’s accounts for the period of\n                    1 January 2007 to 22 November 2007 and requested them to deliver\n                    various books of accounts and other accounting records to the Law\n                    Society. 11     The inspection was conducted by the Law\n                    Society with the assistance of Mr Kon Yin Tong of Foo Kon Tan Grant Thornton.\n                    The inspection revealed that the Firm had not prepared any bank reconciliation\n                    statements after July 2007; that, contrary to the SAR, the Firm had issued cash\n                    cheques for a total of $5,660,357.02; and that the propriety of issuing these\n                    cheques could not be verified due to insufficient documentation supporting the\n                    payments. 12     On 23 January 2008, the Law Society\n                    sought a written undertaking from Sadique and Anand that they would cease to\n                    hold and receive clients’ monies or act as signatories to the client\n                    account of any law practice. On 1 February 2008, the undertaking, effective\n                    as from 29 February 2008, was furnished. 13     Pursuant to s 85(2) of the Act, on\n                    3 June 2008, the Council referred the matter to an Inquiry Committee\n                    (“IC”), which recommended a formal investigation by a Disciplinary\n                    Tribunal (“DT”) pursuant to s 89(1) of the Act.",
        "The Charges": "",
        "Charges against Zulkifli": "14     A total of 211 charges were brought against\n                    Zulkifli for various breaches of the SAR. The 1st to 208th charges concerned the\n                    making of unauthorized withdrawals from the Firm’s client account in\n                    breach of rule 7(1)(a) of the SAR, which\n                    states: There may be drawn from a client account — (a)    in the case of client’s money\n                                — (i)    money properly required for a payment to\n                                    or on behalf of the client; (ii)   money properly required in full or\n                                    partial reimbursement of money expended by the solicitor on\n                                    behalf of the client; (iii)   money drawn on the client’s\n                                    authority; (iv)   money properly required for or towards\n                                    payment of the solicitor’s costs where a bill of costs or\n                                    other written intimation of the amount of the costs incurred has\n                                    been delivered to the client and the client has been notified\n                                    that money held for him will be applied towards or in\n                                    satisfaction of such costs; and (v)    money to be transferred to another client\n                                    account. The 209th charge concerned his failure\n                    to ensure that the Firm’s client account was not overdrawn on\n                    19 November 2007 pursuant to rule 7(2) of the SAR, which provides as\n                    follows: In the case of client’s money and trust money referred to in\n                        paragraph (1)(a) and (b), the money so drawn shall not exceed the total of the\n                        money held for the time being in the client account on account of the client\n                        or trust. The 210th charge concerned his failure to record all transactions\n                    concerning the Firm’s client account in a ledger required to be maintained\n                    under rule 11(1) and (2) of the SAR, which reads: (1)    Every solicitor\n                            shall at all times keep properly written up in the English language such\n                            cash books, ledgers and journals and such other books and accounts as\n                            may be necessary — (a)    to show all his dealings with\n                                — (i)    client’s money received, held or\n                                    paid by him; and (ii)   any other money dealt with by him through\n                                    a client account; (b)    to show\n                                separately in respect of each client all money of the categories\n                                specified in sub-paragraph (a) which\n                                is received, held or paid by him on account of that client;\n                                and (c)    to distinguish\n                                all money of the categories mentioned in sub-paragraph (b) received, held or paid by him, from any\n                                other money received, held or paid by him. (2)    All dealings\n                            referred to in paragraph (1)(a) shall be\n                            recorded as may be appropriate — (a)    in a\n                                client’s cash book or a client’s column of a cash book;\n                                or (b)    in a record of\n                                sums transferred from the ledger account of one client to that of\n                                another, and in addition — (i)    in a client’s ledger or a\n                                    client’s column of a ledger; and (ii)   in a journal. Finally, the 211th charge concerned\n                    his failure to cause the balance shown in the clients’ cash books to be\n                    reconciled with the monthly bank statements of the Firm’s client account\n                    under rule 11(4) of the SAR, which states: Every solicitor shall within one month of his commencing practice on his\n                        own account (either alone or in partnership) and thereafter not less than\n                        once in every succeeding month cause the balance of his clients’ cash\n                        books (or clients’ column of his cash book) to be reconciled with his\n                        clients’ bank statements and shall keep in the cash book or other\n                        appropriate place a statement showing the reconciliation. The Law Society’s case was that these breaches of the\n                    above-mentioned rules amounted to grossly improper conduct under\n                        s 83(2)(b) of the Act.",
        "Charges against Sadique and Anand": "15     The Law Society preferred three charges\n                    against Sadique and Anand. The 1st charge concerned a breach of rule 11(4)\n                    of the SAR. The charge was that they had failed to conduct, from August to\n                    October 2007, any reconciliation of the balances in the clients’ cash\n                    books and the monthly bank statements of the Firm’s client account, and\n                    also to keep a statement showing the reconciliation in a cash book or other\n                    appropriate accounting document. The Law Society’s case was that this\n                    failure amounted to grossly improper conduct within the meaning of\n                        s 83(2)(b) of the Act, or alternatively,\n                    to misconduct unbefitting an advocate and solicitor within the meaning of\n                        s 83(2)(h) of the Act. 16     The 2nd charge concerned a breach of\n                    rules 11(1) and (2) of the SAR. The charge was that for the period of\n                    3 January 2007 to 20 November 2007, Sadique and Anand had failed to\n                    record, or cause to be recorded, all transactions concerning the Firm’s\n                    client account in ledgers required to be maintained. As with the 1st charge, it\n                    was also alleged that this failure amounted to grossly improper conduct within\n                    the meaning of s 83(2)(b) of the Act, or\n                    alternatively, to misconduct unbefitting an advocate and solicitor within the\n                    meaning of s 83(2)(h) of the\n                Act. 17     The 3rd charge was that between 3 January\n                    2007 and 20 November 2007, Sadique and Anand breached their duties as\n                    co-signatories of the Firm’s client account by failing to adequately\n                    supervise transactions involving the said account and by failing to safeguard\n                    clients’ monies in that account such that unauthorized transactions were\n                    made from it. It was alleged that the breach amounted to misconduct unbefitting\n                    an advocate and solicitor within the meaning of s 83(2)(h) of the Act.",
        "The DT’s Findings": "18     On 5 August 2009, a DT was appointed by\n                    the Chief Justice pursuant to s 90 of the Act to hear the complaints\n                    against the three respondents. 19     Zulkifli was not present at the hearing.\n                    Attempts to contact him at his last known residential and business addresses to\n                    notify him of the hearing before the DT proved fruitless. Notices had also been\n                    posted on both the Supreme Court notice board and in newspapers but to no\n                    avail. 20     At the conclusion of the hearing, the DT found\n                    all the charges had been proven against Zulkifli, and that cause of sufficient\n                    gravity for disciplinary action under s 83 of the Act to be taken had been\n                    made out. 21     With regard to Sadique and Anand, the DT found\n                    that the 1st charge was proven only in relation to the month of October 2007,\n                    but not August and September 2007. The DT also found Sadique and Anand guilty of\n                    the 2nd charge, which concerned their failure to record all transactions\n                    concerning the Firm’s client account in ledgers and of the 3rd charge,\n                    regarding their failure as co-signatories to adequately supervise transactions\n                    involving clients’ monies in the Firm’s client account and to\n                    safeguard the said monies. In the DT’s view, there was sufficient cause\n                    for disciplinary action under s 83 of the Act to be taken.",
        "Proceedings before this Court": "",
        "The parties’ arguments": "22     Zulkifli did not appear personally or by\n                    counsel to defend the charges against him. 23     In regard to Sadique and Anand, the Law\n                    Society agreed with the DT’s findings on the 2nd and 3rd charges, but\n                    contended that the DT erred in finding that the 1st charge had only been made\n                    out in relation to the Firm’s accounts for October 2007. 24     In reply, counsel for Sadique and Anand,\n                    Professor Tan Cheng Han SC (“Prof Tan”) argued that the DT erred\n                    in finding that all the three charges had been made out against his clients.\n                    With regard to the 1st charge, he argued that reconciliation statements had been\n                    prepared for the relevant months but they could not be produced to the DT as the\n                    statements went missing when Zulkifli absconded. 25     With regard to the 2nd charge, Prof Tan argued\n                    that although the ledgers could not be found, it was evident that there had been\n                    ledgers as the Firm’s accounts had been satisfactorily audited in 2006,\n                    and monthly reconciliation statements had been drawn up. 26     With respect to the 3rd charge against Sadique\n                    and Anand, Prof Tan made two procedural arguments. The first was that the Law\n                    Society had failed to comply with s 87(1A) of the Act, which provides as\n                    follows: Where the Council has determined under subsection\n                            (1)(d) that a matter be referred back to\n                        the Inquiry Committee for reconsideration or a further report — (a)    the Council\n                                shall notify the Inquiry Committee accordingly; (b)    the Inquiry\n                                Committee shall submit its response or further report to the Council\n                                within 4 weeks from the date of the Council’s notification;\n                                and … 27     Prof Tan’s complaint was that although\n                    the Council had notified the IC through the Chairman of the Inquiry Panel\n                    (“IP”) on 6 July 2009 that a further report was required in\n                    relation to the 3rd charge, the IC submitted its further report on\n                    14 August 2009 to the Chairman of the IP, who submitted it to the Council\n                    only on 28 August 2009. Hence, Prof Tan argued that the report had been\n                    received by the Council 22 days after the statutory period had expired. This\n                    resulted in a breach of s 87(1A)(b) of the Act. 28     Prof Tan’s second argument was that as\n                    Sadique and Anand had not been informed of the Council’s decision to ask\n                    the IC for a further report on 6 July 2009, there was also a breach of\n                    s 87(4) of the Act, which provides: The Council shall inform the advocate and solicitor and the person who\n                        made the complaint of the manner in which it has determined the complaint\n                        within 14 days of the determination, and in the event of the determination\n                        being that a formal investigation is unnecessary, the Council shall on the\n                        request of the person furnish him with its reasons in writing. 29     Prof Tan argued that the effect of these two\n                    breaches was that the Law Society should not have been allowed to exercise its\n                    statutory powers under s 87(2)(b) of the Act\n                    to convene a DT to hear the 3rd charge. 30     In relation to the substance of the 3rd\n                    charge, Prof Tan argued that as Zulkifli had forged the signatures of Sadique\n                    and Anand in the course of his misappropriation, Sadique and Anand could not\n                    have breached their duties as co-signatories of the Firm’s client account\n                    since the documents were never placed before them in the first place. As such,\n                    it was argued that Sadique and Anand were not guilty of the 3rd\n                charge.",
        "Our decision": "",
        "The charges against Zulkifli": "31     Zulkifli did not appear to defend the 211\n                    charges against him. We agreed with the DT that those charges had been proved\n                    against Zulkifli.",
        "The charges against Sadique": "32     With respect to the 1st charge against\n                    Sadique, we affirmed the DT’s finding that the reconciliation statements\n                    for October 2007 had not been prepared. However, we could not, with respect,\n                    agree with the DT’s finding that the August and September 2007\n                    reconciliation statements werein all probabilityprepared because reconciliation statements had been prepared from January to\n                    July 2007. We had two reasons for coming to this conclusion. First, the\n                    reconciliation statements that were produced to the DT were reconstructed\n                    statements. Sadique asserted that the contemporaneous reconciliation statements\n                    were missing only after Zulkifli absconded but no witness was called to confirm\n                    that contemporaneous reconciliation statements had been prepared. The second\n                    reason was that Sally left suddenly on 31 July 2007 but her position was\n                    not filled. Zulkifli started misappropriating clients’ and the\n                    Firm’s monies from January 2007 and there was no reason for him to keep\n                    proper records. 33     With regard to the 2nd charge, we agreed with\n                    the DT’s findings with respect to Sadique. He could not produce the\n                    Firm’s actual ledger as he claimed that it went missing. All that he\n                    produced was an Excel document called the “Transaction Listing”,\n                    which recorded payments into and out of the client account. As the DT rightly\n                    noted, this document was insufficient to constitute a ledger. It is also\n                    noteworthy that Sally stated in her testimony to the DT that she did not\n                    maintain anyclient ledger, cashbook or journal\n                    and that no one else maintained one. 34     With respect to Prof Tan’s procedural\n                    arguments in relation to the 3rd charge against Sadique, we agreed that the Law\n                    Society was in breach of both s 87(1A) and s 87(4) of the Act. In\n                    relation to s 87(1A) of the Act, the Council received the further report\n                    only 22 days after the statutory period of four weeks had expired. 35     However, we could not agree with Prof\n                    Tan’s argument that a breach of s 87(1A)(a) of the Act would disempower the Law Society from referring\n                    the matter to this court. Section 87(1A) of the Act merely sets timelines\n                    for certain actions to be taken by the Law Society in certain circumstances.\n                    They were not meant to be condition precedents necessary for the exercise of the\n                    Law Society’s powers to refer the findings of the DT to this court. The\n                    modern approach as to the effect of a breach of a statutory provision is not to\n                    treat every breach as a disempowering or invalidating event. InNg Swee Lang and another v Sassoon Samuel Bernard and\n                        others[2008] 2 SLR(R) 597, the Court of Appeal\n                    endorsed the modern approach in these words (at [21]): The Judge applied this modern approach to statutory interpretation, which\n                        requires the court (see [43] of the GD): ... [to look] at the whole scheme and purpose of the Act and ... [weigh]\n                        the importance of the particular requirement in the context of that purpose\n                        and [ask] whether the Legislature would have intended the consequences of a\n                        strict construction, having regard to the prejudice to private rights and\n                        the claims of the public interest (if any). The modern approach was further stated by Simon Brown LJ inAhmed v Kennedy[2003] 1 WLR 1820 in the form\n                    of the following question (at [29]): [D]oes this legislation on its true construction give the court a\n                        discretion to waive these petitioners’ timeous non-compliance or must\n                        it be regarded as fatal to their proceedings? 36     The question therefore was whether\n                    non-compliance with the time periods in s 87(1A) of the Act was fatal to\n                    the present proceedings. In our view, the answer was “no” as these\n                    provisions were enacted for the purpose of expediting the disposal of\n                    disciplinary proceedings – see the Second Reading speech of the Minister\n                    for Law in Parliament when moving the amendment bill (Singapore Parliamentary Debates, Official Report(26 August\n                    2008) vol 84 at col 3187). The amendments were not enacted to put obstacles in\n                    the way of disciplining errant advocates and solicitors who were guilty of\n                    professional misconduct. In this connection, we might add that counsel for the\n                    Law Society, instead of expressing his regret for the carelessness of the Law\n                    Society in this regard, and giving his assurance that such mistakes would not be\n                    made again, sought to argue that Sadique had not suffered any prejudice as a\n                    result of the delay. We agreed with counsel’s legal submission, but not\n                    with the moral sentiment in which it was made. 37     Similarly, the Law Society also breached\n                    s 87(4) of the Act in failing to inform Sadique of its decision to ask the\n                    IC for a further report on 6 July 2009, but this did not prevent the\n                    Council from convening a DT pursuant to s 87(2)(b) of the Act. Again, a breach of this nature was not regarded\n                    as serious since it did not prejudice the solicitor complained against.\n                    Nevertheless, it is not a desirable state of affairs that the Law Society, the\n                    statutory governing body of the profession, should find itself unable to comply\n                    with simple statutory requirements, since it reflects a lack of the same degree\n                    of professional standard that it expects of its members. As disciplining errant\n                    lawyers is one of the most important statutory functions of the Law Society, the\n                    Council should ensure that this function is carried out expeditiously and\n                    properly and we trust that such a breach will not recur in the\n                future. 38     Having disposed of the two preliminary\n                    objections to the 3rd charge, we agreed with the DT’s finding that the 3rd\n                    charge was made out against Sadique. The very fact that Zulkifli was able to\n                    abscond with more than $11m showed that Sadique breached his duty as a\n                    co-signatory to supervise the client account. Sadique’s cavalier attitude\n                    towards supervising the Firm’s accounts facilitated Zulkifli’s\n                    crime. His argument that he had agreed with Zulkifli to divide responsibilities\n                    between themselves and was thus not liable for his failure to supervise the\n                    accounts as this task fell under Zulkifli’s purview, was completely\n                    without merit. Equity partners have a special responsibility to safeguard\n                    clients’ monies and not to abdicate such responsibility by delegating it\n                    to one or two partners, without any adequate system of periodic checks. On the\n                    facts of the present case, Sadique had abdicated such responsibility entirely to\n                    Zulkifli. Sadique failed to put in place an adequate system of periodic checks,\n                    as a result of which Zulkifli was able, over a comparatively short period of\n                    time, to commit a massive fraud. Sadique’s blatant contravention of the\n                    SAR undoubtedly amounted to grossly improper conduct within the meaning of\n                        s 83(2)(b) of the Act.",
        "The charges against Anand": "39     Anand was merely a salaried partner. He was in\n                    effect an employee of the Firm. Even if he had undertaken responsibilities in\n                    relation to the accounts, this was an arrangement between him and the partners\n                    of the Firm. Such an undertaking would merely have been a voluntary one.\n                    Whatever may be his liability to third parties, the law should not, without\n                    more, impose obligations on a salaried partner such as Anand to supervise the\n                    Firm’s client account. This responsibility is a non-delegable\n                    responsibility of the equity partners of the firm. As such, we disagreed with\n                    the DT’s finding that all the three charges levelled against Anand were\n                    made out and we acquitted him of all the said charges.",
        "The appropriate penalty": "40     For the purpose of determining the appropriate\n                    penalty against Zulkifli and Sadique, reference may first be made to\n                    s 83(1) of the Act, which provides: All advocates and solicitors shall be subject to the control\n                        of the Supreme Court and shall be liable on due cause shown — (a)to be struck off\n                                the roll; (b)to be suspended\n                                from practice for a period not exceeding 5 years; (c)to pay a penalty\n                                of not more than $100,000; (d)to be censured;\n                                or (e)to suffer the\n                                punishment referred to in paragraph (c) in addition to the punishment referred to in\n                                paragraph (b) or (d).",
        "Penalty for Zulkifli": "41     Zulkifli was patently dishonest when he\n                    misappropriated more than $11m of his clients’ funds. It is trite that\n                    “where solicitors have dishonestly misappropriated their clients’\n                    monies, they have inevitably been struck off the roll” (seeLaw Society of Singapore v Rasif David[2008]\n                    2 SLR(R) 955 (at [35])). It follows that Zulkifli, who had embezzled\n                    around $11m of his clients’ monies, must be struck off the roll, which we\n                    so ordered. In view of this, it was not necessary to consider the charges\n                    against him in OS 1292.",
        "Penalty for Sadique": "42     In the present case, Sadique did not\n                    misappropriate monies belonging to the Firm’s clients. There was no\n                    dishonesty on his part. However, there was gross dereliction of duty in allowing\n                    his equity partner to manage the accounts of the firm alone without putting in\n                    place a framework for periodic checks. In fact, no check was made at any time\n                    during the period when the misappropriations were taking place. Sadique would\n                    have known that the firm had a sizable conveyancing practice and that the\n                    Firm’s client account would have had substantial amounts of clients’\n                    monies in it. By his dereliction of duty, he contributed to the misappropriation\n                    by his partner of over $11m. This was undoubtedly a serious matter, as the loss\n                    was sure to have caused serious economic harm to the clients. That an advocate\n                    and solicitor may be struck off the roll of advocates and solicitors for serious\n                    transgressions other than dishonesty was pointed out by this court inLaw Society of Singapore v Tay Eng Kwee Edwin[2007]\n                        4 SLR(R) 171(“Edwin\n                    Tay”), as follows (at [20]): It is the settled practice of this court that should it find a solicitor\n                        to be dishonest, it will almost invariably direct that his name be struck\n                        off the roll.That said, even if no apparent dishonesty\n                            is involved, a solicitor may be struck off the roll if the lapse is of\n                            such a nature as to indicate that he lacks the requisite qualities of\n                            character and trustworthiness expected of all solicitors: seeLaw Society of Singapore v Ravindra Samuel[1999] 1 SLR 696 at [15]; cited inSelena\n                            Chiongat [27]. [emphasis added] 43Edwin Tayshows\n                    that although as a general rule the court would not strike an advocate and\n                    solicitor off the roll, it may do so in exceptional circumstances. We regarded\n                    this as an exceptional case because of the exceptional financial loss caused to\n                    clients. This court expects the highest professional standards from lawyers to\n                    keep their clients’ monies safe from the depredations of their dishonest\n                    partners. 44     Equity partners of law firms who leave the\n                    management of clients’ monies entirely to one or two partners without any\n                    kind of checking mechanism must answer for their omission, if it facilitated the\n                    misappropriation of clients’ monies by the other partner(s). In the\n                    present case, Sadique’s dereliction of duty was a serious breach of\n                    professional responsibility as it facilitated the loss to more than 80 clients\n                    of a sum in excess of $11m. The loss cannot be fully compensated. As such, we\n                    were of the view that the most severe sanction had to be imposed on\n                    Sadique. 45     Imposing severe sanctions for breaches of the\n                    SAR is consistent with the stand taken by other jurisdictions with respect to\n                    breaches of accounting rules by partners of law firms. An English case,Re A Solicitor(The\n                        Times15 July 1998), offers some guidance on when striking\n                    off the roll may be appropriate. That case involved a three-partner firm, with\n                    two equity partners and one salaried partner. W, an equity partner, was unaware\n                    that his partner was transferring clients’ monies to office accounts to\n                    meet the liabilities of the practice. Nevertheless, the English Court of Appeal\n                    upheld the Disciplinary Tribunal’s decision to strike him off the roll on\n                    the basis that in such a small practice, W had a responsibility to ensure that\n                    he knew what was going on with the firm’s accounts and he ought to have\n                    been put on enquiry when he was asked to sign a cheque of 60,000 pounds to HM\n                    Customs & Excise at a time when he knew of the firm’s parlous\n                    financial state. 46     Similarly, inRe Mayes and\n                        the Legal Practitioners Act[1974] 1 NSWLR 19, the New\n                    South Wales Court of Appeal stressed the importance of a partner’s duty to\n                    supervise accounts (at 25): It is no answer for the appellant to claim that he left the conduct of the\n                        financial affairs of the firm to his partner. It would be no answer\n                        generally and certainly not in this case where the appellant neglected his\n                        responsibilities despite warnings that all was not well.  Feelings of\n                        delicacy in the belief that queries or checks might be regarded as offensive\n                        to the spirit of mutual trust between the partners do not, as claimed,\n                        excuse or justify an abdication of responsibility. Instances of defalcation\n                        by persons of apparently excellent character are not unknown, and every\n                        solicitor should appreciate that there is some risk involved if he allows\n                        one partner to be in the position of a sole practitioner so far as control\n                        of the trust account is concerned.  This is what the appellant\n                        did. The extent to which each partner must concern himself with the financial\n                        controls in a partnership necessarily varies with the size of the\n                        partnership and the office organization, but each has the responsibility to\n                        see that there is in existence a proper system to which each has access to\n                        see that the rules are being obeyed and to check the system.  The\n                        existence of a system cannot relieve partners from personal\n                        vigilance. We entirely reject the argument that a solicitor who is in partnership\n                        can, without being guilty of professional misconduct, simply leave the\n                        management of their joint trust account to his partner after he has reason\n                        to be apprehensive as to his misuse of it, if it subsequently appears that\n                        this facilitated misappropriation. 47     Sadique asserted that in considering the\n                    appropriate penalty, account should be taken of the fact that the Firm had\n                    effected payment of around $1,034,918.60 to its clients after Zulkifli\n                    absconded. He also pointed out that he had a good record prior to the incident.\n                    Finally, he submitted that it is relevant that he and Anand were themselves the\n                    “whistle-blowers” who reported the matter to the Law Society and\n                    the Commercial Affairs Department (“the CAD”). While Sadique may\n                    have had a good record previously and the Firm has paid around $1m to its\n                    clients, the fact remains that the said clients are still owed about $10m due to\n                    his dereliction of duty as an equity partner in a small firm with a not\n                    inconsiderable conveyancing practice. We did not regard his reporting of his\n                    partner’s misappropriations to the Law Society and the CAD as a mitigating\n                    factor: in the circumstances, the reporting was much too late for any person to\n                    take remedial action. The errant partner had fled the jurisdiction and there was\n                    nothing left for him to do but to make the report to the CAD. 48     For the above reasons, we also ordered that\n                    Sadique be struck off the roll of advocates and solicitors.",
        "Costs": "49     We ordered costs in favour of the Law Society\n                    with regard to the proceedings against Zulkifli and Sadique, and made no order\n                    as to costs in the case of Anand."
    }
}