{
    "case_title": "Madihill Development Sdn Bhd and another\n      v\n      Sinesinga Sdn Bhd (transferee to part of the assets of United Merchant\n                Finance Bhd)",
    "ncitation": "[2011] SGHC 230",
    "coram": "Quentin Loh J",
    "sections": {
        "Chronology": "3       A chronology would be helpful: DateEvent24 August 2009SSB obtained judgment against MDS and RT\n                                            in the High Court in Kuala Lumpur,\n                                        Malaysia.15 September 2009MDS and RT filed a Notice of Appeal to the\n                                            Malaysian Court of Appeal against the\n                                        judgment.17 February 2010SSB filed Originating Summons No 187\n                                            of 2010/D (“OS 187/2010”), in\n                                            Singapore to register the Malaysian judgment in\n                                            Singapore under RECJA.18 February 2010SSB obtained an Order in OS 187/2010 to\n                                            Register the Malaysian judgment in\n                                        Singapore.16 March 2010SSB obtained an Adjudication Order and\n                                            Receiving Order (“the Bankruptcy Orders”),\n                                            in Malaysia against RT.19 March 2010RT filed a Notice of Appeal in Malaysia\n                                            against the Bankruptcy Orders.7 April 2010RT filed an application in\n                                            OS 187/2010 (Summons No 1545 of 2010) to set\n                                            aside the 18 February 2010 Order to Register the\n                                            Malaysian judgment.30 April 2010RT applied to the Malaysian Official\n                                            Assignee for sanction to continue with the appeal to the\n                                            Malaysian Court of Appeal.12 November 2010The Malaysian Official Assignee gave his\n                                            in-principle sanction for RT’s appeal to the\n                                            Malaysian Court of Appeal.2 March 2011The Malaysian Court of Appeal dismissed\n                                            MDS and RT’s appeals.15 March 2011MDS and RT file a Notice of Motion to the\n                                            Malaysian Federal Court for leave to appeal against the\n                                            Malaysian Court of Appeal’s dismissal of their\n                                            appeal.14 June 2011MDS and RT’s application for leave\n                                            to appeal to the Malaysian Federal Court was\n                                            dismissed.17 June 2011RT’s application in Summons 1545 of\n                                            2010 in OS 187/2010 to set aside the 18 February\n                                            2010 Order of Court (registering the Malaysian judgment\n                                            in Singapore), is dismissed by an Assistant Registrar\n                                            (“the AR”).27 June 2011RT filed a Notice of Appeal against the\n                                            AR’s dismissal of RT’s application in\n                                            Summons 1545 of 2010.",
        "The issue": "4       RT’s appeal is based on a short point. At\n                    the time the Malaysian judgment was registered under RECJA, there was an\n                    incurable defect as there was a pending appeal before the Malaysian Court of\n                    Appeal. Section 3(2)(e) reads: 3. … Restrictions on registration. (2) No judgment shall be ordered to be registered under this section if\n                        – ... (e) the judgment debtor satisfies the registering court either that an\n                        appeal is pending, or that he is entitled and intends to appeal, against the\n                        judgment; … RT characterised this as a strict legislative prohibition against\n                    registration of a foreign judgment so long as an appeal or a right and intention\n                    to appeal is extant. The application was therefore wrong from the outset and had\n                    to be set aside. 5       SSB relies on s 3(1) as well as case law.\n                    Section 3(1) states: 3.—(1) Where a judgment has been obtained in a superior court of the\n                        United Kingdom of Great Britain and Northern Ireland the judgment creditor\n                        may apply to the High Court at any time within 12 months after the date of\n                        the judgment, or such longer period as may be allowed by the Court, to have\n                        the judgment registered in the Court, and on any such application the High\n                        Court may, if in all the circumstances of the case it thinks it is just and\n                        convenient that the judgment should be enforced in Singapore, and subject to\n                        this section, order the judgment to be registered accordingly. SSB further contends that there is no longer any pending appeal as RT\n                    has exhausted all avenues of appeal in Malaysia and it is therefore just and\n                    convenient to dismiss RT’s application and to allow the 18 February 2010\n                    registration of the Malaysian judgment to stand.",
        "Analysis of the authorities cited": "6       Mr Fan Kin Ning (“Mr Fan”),\n                    counsel for RT, did not produce any authorities and only relied on the statutory\n                    provisions and what he contended was the proper construction. Mr Chua Beng\n                    Chye (“Mr Chua”), counsel for SSB, relied on four cases for his\n                    argument that RT’s construction of ss 3(1) and (2) was wrong.\n                    Strictly speaking, none of the authorities relied on by Mr Chua were\n                    applicable or relevant on their facts. 7       In the first case,Perwira\n                        Ariffin Bank Bhd (formerly known as Perwira Habib Bank Malaysia Bhd) v Lee\n                        Hai Pey and another[1997] 2 SLR(R) 498\n                        (“Perwira Ariffin Bank”), a bank\n                    had obtained summary judgment in September 1998 in Malaysia against its borrower\n                    company and the individual guarantors. The successive appeals were dismissed in\n                    October 1990 and in November 1994. On 28 October 1996, the plaintiff\n                    appliedex parteto register the Malaysian\n                    judgment in Singapore under the RECJA. The guarantor applied to set the\n                    Singapore judgment aside on the ground that the Malaysian judgment was no longer\n                    enforceable as more than 6 years had passed since the Malaysian judgment was\n                    issued. The bank thereupon successfully applied in Malaysia,ex parte, on 23 May 1996 for leave to enforce the Malaysian\n                    judgment. With the Malaysian court order in hand, the bank applied afresh to\n                    register the Malaysian judgment. On 30 December 1996, the borrower company\n                    successfully set aside the Malaysian court order granting leave to enforce the\n                    judgment but the guarantor was unsuccessful. The bank and the guarantor filed\n                    appeals. The guarantor then applied to set aside the registration of the\n                    Malaysian judgment in Singapore pending the determination of the enforceability\n                    of the Malaysian judgment by the Malaysian appeal court. His application before\n                    the registrar failed and he appealed. On appeal, Warren\n                    L H Khoo J held that since the Malaysian judgment before him\n                    ceased to be enforceable unless leave of court was obtained, and leave had been\n                    obtainedex parteand confirmed by aninter parteshearing, the defendant was entitled to\n                    appeal against that decision and had done so. He therefore ordered a stay,\n                    pending the outcome of the appeal, as there was no telling which way the\n                    judgment will go on appeal. 8       Mr Chua submitted that a pending appeal in the\n                    Malaysian court did not prevent the registration of the Malaysian judgment in\n                    Singapore, citingPerwira Ariffin Bankat\n                        [10]: I took the view that sub-s (2) does not, and is not intended to, set out\n                        in any exhaustive way the circumstances in which a judgment should not be\n                        registered. There is a general requirement, set out in sub-s (1), that the\n                        court must be satisfied that in all the circumstances it is just and\n                        convenient that the judgment be allowed to be enforced. … That paragraph must be read in the context of the factual matrix. The\n                    judgment establishing the debt in that case was no longer under appeal. What was\n                    under appeal was the order of the Malaysian court granting leave to enforce a\n                    judgment after the passage of more than six years after its publication.\n                    Section 3(2)(e) therefore was not in issue. In that context, what was\n                    before the learned judge was the s 3(1) requirement as to whether in all\n                    the circumstances it was just and convenient that the judgment be allowed to be\n                    enforced in Singapore. The learned judge cannot be said to have read s 3(2)\n                    as subordinate to s 3(1)’s requirements.Perwira\n                        Ariffin Banktherefore does not really answer RT’s\n                    contention. 9       The second case relied upon by Mr Chua,Perwira Affin Bank Bhd (formerly known as Perwira Habib\n                        Bank Malaysia Bhd) v Lee Hai Pey and another[2007]\n                    3 SLR(R) 218, involved the same parties. By now, the appeals against\n                    the enforceability of the Malaysian judgment had come to an end. Judith\n                    Prakash J held that Khoo J had stayed enforcement as there were\n                    appeals pending and since those appeals had been finally dealt with, it was just\n                    and convenient to allow the Malaysian judgment to be enforced despite the long\n                    delays which had resulted from the guarantors’ utilisation of his right of\n                    appeal and not any dilatoriness by the bank. There is nothing in this judgment\n                    that assists SSB’s case. 10     The third case cited by Mr Chua is the\n                    Singapore Court of Appeal’s decision inLiao Eng Kiat v\n                        Burswood Nominees Ltd[2004] 4 SLR(R) 690\n                        (“Burswood Nominees”). Although\n                    the ratio of that case involved the enforceability of a foreign judgment from\n                    Western Australia under RECJA in respect of a dishonoured cheque given to a\n                    casino to obtain gambling chips and considerations of public policy against\n                    gaming and wagering contracts under s 5(2) of the Civil Law Act\n                    (Cap 43, 1994 Rev Ed) and s 3(2)(f) of the RECJA, that judgment\n                    needs to be read with some care. 11     At [13] of the judgment, the Court of Appeal stated that: …Registration will not be ordered if the appellant is able\n                            to establish any one of the limited number of exceptions in s 3(2)\n                            of the RECJA. The principal issue canvassed on appeal was\n                        whether s 5(2) of the [Civil Law Act (Cap 43, 1994 Rev Ed)] and\n                        s 3(2)(f) of the RECJA precluded registration of the Australian\n                        judgment on grounds of public policy. … [emphasis added] A proper reading of the judgment however will show that the Court of\n                    Appeal was not ruling,ex cathedra, on a proper\n                    construction of s 3(2). The judgment went on to a careful analysis of the\n                    approach a Singapore court should take. At the end of the judgment under the\n                    heading ‘Conclusion’ the Court of Appeal stated (at [47]): … Whilst s 3(2) of the RECJA lays down various restrictions on\n                        the court’s power to order the registration of foreign judgments,\n                        s 3(1) of the RECJA gives the court the general discretion to order the\n                        registration of a foreign judgment if “in all the circumstances of\n                        the case [the court] thinks it isjust and\n                            convenientthat the judgment should be enforced in\n                        Singapore” [emphasis added]. … [emphasis in original] On the surface, this appears to be the same approach adopted by\n                    Khoo J inPerwira Ariffin Bank. In its\n                    judgment, the Court of Appeal stated at [39] and [40] that both the New York\n                    Convention and the RECJA were enacted with the basic aim of removing\n                    pre-existing obstacles to the enforcement of foreign awards or judgments and a\n                    narrow reading of the public policy defence in s 3(2)(f) would help further\n                    this aim and the considerations of reciprocity enjoin the courts to invoke the\n                    public policy defence with caution. 12     Neither counsel raisedPoh\n                        Soon Kiat v Desert Palace Inc (trading as Caesars Palace)[2010]\n                    1 SLR 1129 (“Poh Soon\n                    Kiat”), a later Singapore Court of Appeal decision which said\n                    thatBurswood Nomineeswas unsound because there\n                    was no legal basis for reading a higher public policy threshold into\n                    s 3(2)(f) and that its decision should be reviewed should the same issue\n                    come before the Court of Appeal in the future. The Court of Appeal agreed with\n                    Prof Yeo Tiong Min in his article “Statute and Public Policy in Private\n                    International Law: Gambling Contracts and Foreign Judgments” (2005) SYBIL\n                    133 that the decision was not defensible in light of the express words in\n                    s 3(2)(f) and stated clearly at [114] that the Western Australian judgment\n                    inBurswood Nomineescould not be registered under\n                    s 3(2)(f) on the ground that the judgment was based on a cause of action\n                    which could not, by virtue of the public policy encapsulated in s 5(2) of\n                    the Civil Law Act (Cap 43, 1999 Rev Ed), be maintained in Singapore. The Court\n                    of Appeal said, at [61], that s 3(2)(f) “expresslyprohibits the registration of a Commonwealth judgment\n                    if it was obtained ‘in respect of a cause of action which for reasons of\n                    public policy … could not have been entertained by [a Singapore]\n                    court.’” (emphasis in original). 13     The fourth case cited by Mr Cheng wasWestacre Investments Inc v The State-Owned Company\n                        Yugoimport SDPR (also known as Jugoimport-SDPR)[2009]\n                    2 SLR(R) 166 (“Westacre\n                        Investments”). However that case involved considerations\n                    of what was “just and convenient” in s 3(1) in enforcing an\n                    English judgment that emanated from an arbitration award published in 1994 which\n                    was duly registered as a judgment in England in December 1997. An appeal\n                    therefrom was dismissed in May 1999 and the House of Lords refused leave to\n                    appeal. Registration of the English judgment in Singapore was only sought in\n                    July 2004 when it was realised that there may be assets in Singapore. Those\n                    issues do not arise here and the only principle that may be of some relevance is\n                    that under s 3(1), the court must consider all the circumstances of the\n                    case and should permit registration of the Commonwealth judgment only if\n                    “it is just and convenient that the judgment should be enforced in\n                    Singapore” (seeWestacre Investmentsat\n                        [20], [21] and [52]). This included, but was not limited to having\n                    regard to the rights of the parties, parties’ conduct, diligence and\n                    persistence of the judgment creditor in pursuing its rights, the judgment\n                    debtor’s knowledge of the judgment creditor’s intentionsvis-á-visenforcement of the judgment and steps taken by\n                    the judgment debtor to obstruct discovery of its assets.",
        "The statutory scheme": "14     There is also a House of Lords decision that\n                    was not cited by counsel,viz,Owens Bank Ltd v Bracco and Another[1992] 2 AC 443\n                        (“Owens Bank”). This case\n                    involved the enforcement of a judgment obtained by a bank against the borrower,\n                    an Italian company, and the president of the Italian company in the High Court\n                    of St Vincent and the Grenadines under s 9 of the Administration of Justice\n                    Act 1920 (c 81) (UK) (“AJA”), which isin\n                        pari materiawith s 3 of the RECJA. The loan documents had a\n                    provision giving the St Vincent court jurisdiction in the event of a dispute.\n                    The president of the Italian company alleged the documents were forgeries and\n                    the Italian company contended that the president had no authority to enter into\n                    any such transaction. The trial judge gave judgment for CHF 9 million together\n                    with interest and costs against both defendants. The St Vincent Court of Appeal\n                    upheld his judgment. Proceedings were also commenced in Italy where the issue of\n                    fraud was raised. The bank applied to register the St Vincent judgment in\n                    England as the defendants had assets there. The issue there was different,viz, whether in construing the\n                    “fraud” exception in the equivalent to s 3(2)(d) of the\n                    RECJA, the English court was entitled or bound to go into allegations of fraud\n                    raised by a defendant in England when those allegations have been decided\n                    against the defendant and in favour of the plaintiff in the foreign Commonwealth\n                    court. The House of Lords endorsed the English Court of Appeal decisions ofAbouloff v Oppenheimer & Co(1882)\n                    10 QBD 295 andVadala v Lawes(1890)\n                    25 QBD 310, which had held that the English court was entitled and\n                    bound to go into those allegations once more. 15Owens Bankis of\n                    interest because it explains the background to the AJA, which is equivalent to\n                    our RECJA. It explains that the common law rule of finality of judgments that\n                    applies to English judgments and the restrictions placed upon a party’s\n                    ability to re-open the litigation, even in the case of fraud, was placed within\n                    very restrictive limits, but that the common law declined to give that same\n                    finality to foreign judgments preferring to give primacy to the principle that\n                    fraud unravels everything (seeOwens Bankat\n                    489C–H). In the Judgments Extension Act 1868 (c 54) (UK), the United\n                    Kingdom Parliament gave full reciprocal enforceability as between the judgments\n                    of the different superior courts within the United Kingdom with no obstacle\n                    placed in the way of registration but, by contrast, in enacting the AJA, the\n                    judgment creditor seeking registration must first surmount the obstacles which s\n                    9(2) of the AJA (the equivalent of s 3(2) of the RECJA) places in his way\n                    and therefore denies finality by the adoption of the common law approach to\n                    foreign judgments that are alleged to be obtained by fraud. 16     As this is a statutory scheme, we should turn\n                    to the provisions of the RECJA and O 67 of the Rules of Court\n                    (Cap 322, R 5, 2006 Rev Ed) (“ROC”). O 67\n                    envisages two stages. The first stage is anex\n                        parteapplication by the judgment creditor, supported by an\n                    affidavit, for registration of the Commonwealth judgment. The ensuing\n                    registration, is straightforward and usually granted, provided the almost, as it\n                    were, formal requirements of O 67 r 3 of the ROC are satisfied. The\n                    usual order granted must stipulate a period within which an applicant can apply\n                    to set aside the registration and, importantly, that execution will not issue\n                    until after the expiration of that period (see O 67 r 5(2) of the\n                    ROC). This, coupled with the requirement that notice of the registration of the\n                    judgment must be served on the judgment debtor with the particulars set out in\n                    O 67 r 7(3) of the ROC, gives the judgment debtor notice of the\n                    registration of the Commonwealth judgment in Singapore, and the opportunity, if\n                    he so wishes, to apply to set aside that registration. 17     This brings us to the second stage. The\n                    applicant, usually the foreign judgment debtor, is given an opportunity to apply\n                    to set aside the registration. That application must also be supported by an\n                    affidavit setting out the grounds upon which the applicant applies to have the\n                    registration set aside (see O 67 r 9(1) of the ROC). If the court\n                    hearing the setting aside application is satisfied that the judgment falls\n                    within any of the cases where a judgment should not be ordered to be registered\n                    under s 3(2), or that it is not just or convenient that the judgment should\n                    be enforced or that there is some other sufficient reason for setting aside the\n                    registration, it may order the registration of the judgment to be set aside on\n                    such terms as it thinks fit (see O 67 r 9(3) of the\n                ROC). 18     However, the provisions of the RECJA do not\n                    make any distinction between the first stage and the second stage. What is the\n                    statutory scheme? Section 3(2) sets out specific instances where a Commonwealth\n                    judgment will not be registered. It covers instances where it is known from the\n                    time of registration at the first stage that an impediment against registration\n                    exists as well as those where any impediment can only be known or ascertained at\n                    a later stage. Take s 3(2)(e) itself. It may well be that at the first\n                    stage, the judgment creditor is unaware that the judgment debtor has filed an\n                    appeal and it may equally be the case that after having obtained registration at\n                    the first stage, the judgment debtor comes before the Singapore court at the\n                    second stage and satisfies the court that he intends to appeal against the\n                    foreign judgment. A judgment debtor may file a notice of appeal but yet not\n                    proceed with the appeal at any stage. Again, a judgment creditor may not know\n                    that the public policy of Singapore will not allow the enforcement of his\n                    Commonwealth judgment. Whether the enforcement of a Commonwealth judgment is\n                    contrary to the public policy of Singapore may be a contentious issue. In this\n                    context it will be noted that the Court of Appeal made observations in December\n                    2009 inPoh Soon Kiatwhich were contrary to the\n                    earlier Court of Appeal decision inBurswood\n                        Nomineesin October 2004. The same goes for arguments on\n                    jurisdiction under s 3(2)(a). It is not always easy to ascertain if\n                    s 3(2)(a) is satisfied until it is authoritatively adjudicated by a court\n                    of competent jurisdiction. In practice, such grounds are only raised at the\n                    second stage when the judgment debtor comes forward to set aside the\n                    registration. Section 3(1) gives an overarching discretion. Even if none of the\n                    specific instances in s 3(2) apply, a Singapore court may still refuse to\n                    enforce an otherwise registrable Commonwealth judgment if, in its view, it was\n                    in all the circumstances of the case not just and convenient to do so. This is\n                    consistent with the statements cited from previous judgments (see[8]and[10]above). 19     It is only when we turn to O 67 of the\n                    ROC that we find the provision of the two stage process. These are procedural\n                    rules. They were made for the orderly, efficient and convenient disposal of\n                    legal processes brought before our courts. They can be amended by the Rules\n                    Committee and with the approval of the Chief Justice (see s 80(5) of the\n                    Supreme Court of Judicature Act (Cap 322, 2007 Rev Ed). Finality\n                    to the first stage comes early when the debtor fails to challenge the\n                    registration. This usually happens when there is no defence and especially where\n                    the defendant is insolvent. There is no need to proceed to the second stage and\n                    the registration becomes final. 20     I therefore cannot accept Mr Fan’s\n                    argument that since an appeal was extant at the time SSB applied for\n                    registration at the first stage, there was a fatal flaw in the registration\n                    granted on 18 February 2011 as that Malaysian judgment was incapable of\n                    registration at the first stage. If that is correct then it must follow that a\n                    foreign judgment is incapable of registration at the first stage if, unknown to\n                    the judgment creditor, the judgment debtorintendsto but has not yet appealed. What if the judgment debtor yet later on abandons\n                    his appeal before it is heard? InSingapore Civil Procedure 2007(G P\n                    Selvam gen ed) (Sweet & Maxwell Asia, 2007) at para 67/9/1, it is\n                    stated, correctly, that although a judgment has been registered, its status is\n                    still challengeable and “[t]he party against whom the registered judgment\n                    may be enforced is at liberty to apply to have it set\n                aside.” 21     I should also mention two old cases which\n                    support my view of the statutory scheme. Neither counsel brought these cases to\n                    my attention. 22     The first isIn The Matter\n                        Of Enactment No 10 Of 1922, The Judgments (Reciprocity) Enactment; Ho Hong\n                        Bank Ltd v Ho Kai Neo & Anor[1932] MLJ 76\n                        (“Ho Kai Neo”). The plaintiff\n                    had appliedex partefor leave to register a\n                    Singapore judgment in Johore under the Reciprocal Enforcement of Judgments\n                    Enactment (Enactment No 2 of 1922) (FMS) (“the Enactment”).\n                    Thorne J, in the court below had refused registration at theex partestage because he took the view that default\n                    judgments were not registrable under s 3(2)(c) of the Enactment, which isin pari materiato s 3(2)(c) of the\n                    RECJA. On appeal, Sproule and Terrell JJ were of the view that the\n                    registration should have been allowed as a matter of course and that, in any\n                    case, the interpretation of the court below of s 3(2)(c) of the Enactment\n                    was wrong. Sproule J’s judgment at pages 76 and 80 are\n                    relevant: In my view, a judgment holder is entitled under the Enactment and Rules to\n                        his provisional orderas a matter of course, and an onus\n                            is cast upon the debtor to assail registration later, he having already\n                            suffered judgment in the original Court. In our case the\n                        burden was in fact thrown upon the judgment creditor, instead, to support\n                        his judgment and not as against his debtor, but against the Court. With\n                        great respect, I do not think the Court would be justified in so acting\n                        except in some such extreme case as that the foreign judgment was so\n                        manifestly incompetent as to render the application on the face of it an\n                        abuse of the process of the Court. … In my opinion, therefore, the order appealed from was wrong. An order nisi\n                        for provisional registration should have been granted as of course.Section 3(2) applies to final registration,\n                            thereafter, giving the judgment debtor certain restricted grounds upon\n                            which he could assail the competence or correctness of the Judgment of\n                            the Supreme Court of the Colony in avoidance of final registration.\n                            These were not the concern of the Johore Court upon the original ex\n                            parte application for provisional registration. But even\n                        if they were, then the learned Judge in the Court below was wrong in his\n                        construction of s 3(2) in general or its cl (c) in particular; and if\n                        indeed he relied upon any theory of non-finality of a judgment by default,\n                        then he was again wrong. [emphasis added] 23     InLam Soon Cannery Co v H\n                        W Hooper & Co[1965] MLJ 135 (“Lam Soon Cannery”), one of the arguments raised\n                    at the application to set aside (ie, theinter partesstage) was that the original court had\n                    acted without jurisdiction. Counsel argued that Sproule J inHo Kai Neowas wrong. A V Winslow J\n                    disagreed, stating at 136-137): An application for provisional registration is, under the relevant rules,\n                        madeex partebefore a judge of the High Court\n                        in chambers. I do not think that any judge would make an order as a matter\n                        of course having regard to the provisions of sub-section (2) of section 3\n                        which impose restrictions on such registration. In fact the Rules made under\n                        the Reciprocal Enforcement of Judgments Ordinance (GN No 122 of 1938) make\n                        special provision for the procedure to be adopted on such applications which\n                        must be supported by an affidavit of the facts. I do not think that\n                        Sproule J intended to exclude the exercise of discretion by the judge\n                        because, after stating that the judgment holder is entitled to a provisional\n                        order as a matter of course, and that the onus is cast upon the debtor to\n                        assail registration later, he continues, \"In our case the burden was in fact\n                        thrown upon the judgment creditor, instead, to support his judgment and not\n                        as against his debtor, but against the court. With great respect, I do not\n                        think the court would be justified in so acting except in some such extreme\n                        case as that the foreign judgment was so manifestly incompetent as to render\n                        the application on the face of it an abuse of the process of the court.\" In\n                        this last sentence Sproule J, according to my understanding of what he\n                        says, exemplifies the kind of application for provisional registration which\n                        it would not be just and convenient to grant. In my opinion, on an ex parte application, supported by\n                            an affidavit, which ex facie satisfies the requirements of the Ordinance\n                            and the Rules, the judge who has no other materials before him, will be\n                            hard put to it to decide that it would not be just and convenient to\n                            enforce the judgment in the State in the absence of grounds which are\n                            also apparent from the record before him. This he can only do in some\n                            such extreme case as Sproule J has described or where it would\n                            appear to be inconvenient to enforce the judgment here on the ground,\n                            for example, that the debtor has no assets within the local\n                            jurisdiction. [emphasis added] Although Winslow J’s judgment was allowed on appeal (seeLam Soon Cannery Co v Hooper & Co[1965–1967] SLR(R) 149) on other grounds, the above portion of\n                    Winslow J’s judgment was not, however, disturbed. In fact, the Court of\n                    Appeal supported Winslow J’s reasoning (at [34]–[36]): 34    Rule 9(1), as it stands, plainly takes no account\n                            of the one side of the coin, while looking only at the other, with the\n                            result that the rule has rendered the provisions of s 3(1)\n                            nugatory.Registration being ex parte, and\n                                consequently a matter of course, it was at that stage manifestly\n                                premature to anticipate and consider whether or not the judgment\n                                debtor might be able to show grounds against enforcement of the\n                                judgment. 35    As Winslow J puts it: “In my opinion,\n                            on anex parteapplication, supported by\n                            an affidavit, whichex faciesatisfies the\n                            requirements of the Ordinance and the rules, the judge who has no other\n                            material before him, will be hard put to it to decide that it would not\n                            be just and convenient to enforce the judgment in the State, in the\n                            absence of grounds which are also apparent from the record before\n                            him.” 36Logically the time for the\n                                judgment debtor to show cause why enforcement would not be just or\n                                convenient is when he applies for the registration to be set\n                                aside. That is the practice in England and it was the\n                            practice in Singapore until the former r 12 ceased to be in force.\n                            Can a rule be valid which is in conflict with the law contained in the\n                            statute under which the rule itself came to be made? The law on this\n                            point is clear. Section 23(c) of the Interpretation and General Clauses\n                            Ordinance (Cap 2) provides that “no subsidiary legislation made\n                            under an Ordinance shall be inconsistent with the provisions of any\n                            Ordinance.” In my view r 9(1) so offends. The rule cannot\n                            have the effect of denying to the judge the discretion vested in him by\n                            sub-s (1) of s 3. To that extent I hold that r 9(1) is ultra\n                            vires and should be read in the sense one understands the former\n                            r 12 to mean. [emphasis added] Both cases support my views of the statutory scheme and the two stage\n                    process laid down in O 67. In so saying, I am not advocating the view that\n                    a court can never refuse registration at the first stage. Ordinarily, if the\n                    judgment creditor knows that an appeal has been filed, he should not make an\n                    application at the first stage. Also there may well be cases where it is so\n                    clear that registration will be refused at the first stage. It all depends on\n                    the circumstances of each case. 24     I now turn to another point. O 67\n                    r 3 of the ROC sets out the various requirements of the supporting\n                    affidavit. Under r 3(1)(c)(iii) there is a requirement for a statement that\n                    to the best of the deponent’s information and belief, the judgment sought\n                    to be registered does not fall within any of the categories listed in\n                    s 3(2) of the RECJA. There is a rule applicable to allex parteapplications, and O 67 r 3 is no exception,\n                    that the applicant has a duty to make full and frank disclosure (seeThe “Vasiliy Golovnin”[2008]\n                    4 SLR(R) 994 (“Vasiliy\n                    Golovnin”) at [83]–[93] (in the context of an\n                    application for a warrant of arrest in admiralty proceedings) andBahtera Offshore (M) Sdn Bhd v Sim Kok Beng and another[2009] 4 SLR(R) 365 at [18]–[33] (in the context of aMarevainjunction)). 25     I note that one Andrew John Newton Lee\n                    (“Mr Andrew Lee”) had affirmed an affidavit on behalf of SSB on\n                    17 February 2010 where he had deposed, at [14], that the Malaysian judgment, if registered in the High\n                    Court of Singapore, will not be liable to be set aside with respect to the said\n                    registration under s 3(2) of the RECJA as the same does not fall within any\n                    of the cases mentioned in s 3(2) of the RECJA when in fact, about 5 months\n                    earlier, MDS and RT had filed their appeals against the Malaysia\n                    judgment. 26     However, I am satisfied that on balance, this\n                    was not a deliberate statement made to mislead the court; it was probably due to\n                    some miscommunication. The fact that the appeals had been filed was not\n                    something that was or could be hidden. No one raised this allegation below. RT\n                    has not suffered any prejudice. Furthermore, the first objections raised by RT\n                    in his affidavit sworn on 7 April 2010 was that (i) he was not duly served\n                    with the process of the original court, (ii) there was no such action as\n                    described by SSB,viz, Civil Suit No. D7\n                    (D9)(d1)-22-888-2200 in the High Court of Malaya at Kuala Lumpur and (iii) the\n                    foreign judgment does not exist. What had happened was a typographical error:\n                    the last four digits of the Malaysian judgment should have read\n                    “2000” and not “2200”. It was only in his 27 April\n                    2010 affidavit that RT deposed that he had filed an appeal on 15 September 2009.\n                    By this time RT had been made a bankrupt in Malaysia. SSB also applied and was\n                    granted an order to correct the reference to the Malaysian suit to read as\n                    “Civil Suit No. D7 (D9)(d1)-22-888-2000”. There were then\n                    long delays to the continued hearing of these proceedings whilst RT obtained\n                    sanction of the Official Assignee of Malaysia to continue with this application.\n                    The matter was only heard below on the merits on 17 June 2011. RT does not\n                    appear to have raised any arguments based on authorities such asVasiliy Golovinbelow (see written submissions dated\n                    30 March 2011 and the learned AR’s Notes of Evidence). It was only in\n                    RT’s written submissions filed on 14 July 2011 for this appeal that\n                    RT alleged SSB “misled” the court by Mr Andrew Lee’s\n                    affidavit but this point was not pursued before me. 27     RT’s last avenue for an appeal, an\n                    application for leave to appeal to the Malaysian Federal Court, was dismissed on\n                    14 June 2011. By 17 June 2011, the date when the learned AR dismissed\n                    RT’s application, all avenues of appeal had been exhausted by RT.\n                    SSB’s claim against RT is on his guarantee against default and non-payment\n                    of facilities granted by SSB (UMF) to MDS. The vast majority of such claims are\n                    straightforward and given on a summary basis, as was this judgment. It is\n                    unsurprising that the learned AR below dismissed RT’s application to set\n                    aside the registration of the Malaysian judgment. 28     Even if Mr Fan’s contention is\n                    correct, and I do not, with respect, believe it is, there is no utility or\n                    practical consideration that requires the setting aside of the registration just\n                    for SSB to apply once more to register the Malaysian judgment. Such over\n                    emphasis on technicalities no longer has any place in modern civil procedure.\n                    Khoo J’s approach inPerwira Ariffin Bank,\n                    in which he stayed the setting aside proceedings pending the outcome of an\n                    appeal, has everything to recommend it.",
        "Conclusion": "29     In all the circumstances of this case, it was\n                    just and convenient to register and enforce this Malaysian judgment in\n                    Singapore. I therefore dismissed the appeal with costs fixed at $1,500 all\n                    in."
    }
}