{
    "case_title": "Tan Holdings Pte Ltd (in creditor’s voluntary\n                liquidation)\n      v\n      Prosperity Steel (Asia) Co Ltd and others",
    "ncitation": "[2011] SGHC 219",
    "coram": "Steven Chong J",
    "sections": {
        "Introduction": "1       This case concerns an application by a receiver\n                    appointed by a judgment creditor to claim for “bonus” shares in a\n                    Singapore listed company that the judgment debtor was allegedly entitled to.\n                    However the application was challenged at the threshold level that the receiver\n                    lackedlocus standito claim the\n                    “bonus” shares as the receivership order did not purport to permit\n                    the receiver to bring the action on behalf of the judgment debtor. Instead the\n                    receivership order merely authorised the action to be brought in the name of the\n                    judgment creditor and indeed the application was filed on that\n                basis. 2       In addition, the application was also opposed on\n                    the merits that the judgment debtor was not entitled to the\n                    “bonus” shares in the first place and if it did, the right had\n                    been transferred to another party in any event. After hearing the parties, I\n                    dismissed the application both on thelocus standiissue as well as on the merits. 3       In dismissing the application, I had provided my\n                    brief oral grounds which I have elaborated below. This decision will examine the\n                    circumstances under which a receiver could be appointed by way of equitable\n                    execution in respect of a chose in action allegedly vested in a judgment debtor.\n                    The facts of this case were rather complex and needed to be set out in some\n                    detail in order to fully understand the nature and origin of the application. It\n                    underwent several routes with a view to achieving its objective and along the\n                    way, the pivotallocus standiissue was raised but\n                    unfortunately, it remained unresolved when the application finally came before\n                    me for determination.",
        "Background": "",
        "The parties": "4       The plaintiff, Tan Holdings Pte Ltd (“Tan\n                    Holdings”), is a company incorporated in Singapore. On 20 June 2006, Tan\n                    Holdings was placed under insolvent voluntary liquidation pursuant to section\n                    290 of the Companies Act (Cap 50, 2006 Rev Ed). Mr Bob Yap Cheng Ghee\n                    (“Mr Bob Yap”) of KPMG Advisory Services Pte Ltd\n                    (“KPMG”) was appointed as the sole liquidator of Tan\n                    Holdings. 5       The first defendant, Prosperity Steel (Asia)\n                    Company Limited (“Prosperity”), is a company incorporated in Hong\n                    Kong. It is currently inactive. 6       The second defendant, Abterra Limited\n                    (“Abterra”), is a company incorporated in Singapore, and is listed\n                    on the mainboard of the Singapore Exchange Securities Trading Limited. Abterra\n                    was formerly known as Hua Kok International Ltd. 7       The third defendant, General Nice Resources\n                    (Hong Kong) Limited (“GNR”), is also a company incorporated in\n                    Hong Kong. Unlike Prosperity, GNR is presently still an active\n                company.",
        "The Strategic Subscription and New Business Agreement between\n                Prosperity and Abterra": "8       Sometime in 2004, Abterra ran into financial\n                    difficulties. As part of Abterra’s efforts to restructure its debts, it\n                    entered into a Scheme of Arrangement (“the Abterra Scheme”) with\n                    its creditors. The Abterra Scheme was sanctioned by an order of court dated 12\n                    January 2005 and Mr Bob Yap was appointed as the Scheme Manager of the Abterra\n                    Scheme. 9       Prior to the sanction of the Abterra Scheme, on\n                    30 August 2004, as part of Abterra’s efforts to raise capital, Abterra had\n                    entered into a Strategic Subscription and New Business Agreement\n                    (“SSA”) with Prosperity. The SSA provided that Prosperity would\n                    invest S$6 million in Abterra by subscribing for shares in Abterra with the\n                    result that Prosperity became its majority shareholder that ultimately\n                    translated into a 70% stake in Abterra. Essentially, Prosperity was to be the\n                    “white knight” of Abterra. 10     Under the Abterra Scheme, “Contingent\n                    Creditors” were to receive “Contingent Conversion Shares”\n                    in lieu of their claims against Abterra upon the crystallization of\n                    “Contingent Liabilities” as defined under the SSA. In order to\n                    preserve Prosperity’s 70% shareholding in Abterra, Prosperity was entitled\n                    to call on Abterra for the allotment of “Further Strategic Shares”\n                    (“FSS”) whenever “Contingent Conversion Shares” were\n                    allotted to the “Contingent Creditors” under clause 8A.5 of the\n                    SSA which provided,inter alia, as follows: 8A.5In the event\n                            that the Contingent Creditors referred to in Recital (F) are bound in\n                            theAgreed Periodto receive Contingent\n                            Conversion Shares in discharge of the Crystallized Liabilities,\n                            Prosperity shall have the right to request the Company, and the Company\n                            shall agree, to issue bonus shares in the capital of the Company to\n                            Prosperity, such shares to be fully paid-up upon issue\n                                (“Further Strategic\n                            Shares”), at the ratio of :- (a)seven (7) Further Strategic Shares for every\n                                three (3) Contingent Conversion Shares when neither of Value Event A\n                                or Value Event B is applicable; [emphasis in original in bold, emphasis added in italics] 11     On 29 December 2004, before the court\n                    sanctioned the Abterra Scheme, Prosperity and Abterra entered into the First\n                    Supplementary SSA to vary certain terms of the SSA. 12     Paragraph 2.9 of the First Supplementary SSA\n                    read: 2.9Clause 8A.5 As the claims of Contingent Creditors may crystallize after three\n                            years from the date of the [SSA], the reference to “in the Agreed\n                            Period” in Clause 8A.5 of the [SSA] shall be deleted. 13     On 14 March 2005, after the court had\n                    sanctioned the Abterra Scheme, Prosperity and Abterra entered into a Second\n                    Supplementary SSA to vary certain terms of the SSA as amended by the First\n                    Supplementary SSA. 14     Paragraph 3.11 of the Second Supplementary SSA\n                    read: 3.11Clause 8A.5 The existing Clause 8A.5 shall be deleted and replaced with the\n                            following:- “8A.5In the event that the Contingent\n                                Creditors referred to in Recital (F) are bound in the Agreed Period\n                                to receive Contingent Conversion Shares in discharge of the\n                                Crystallized Liabilities, Prosperity shall have the right to request\n                                the Company, and the Company shall agree, to issue bonus shares in\n                                the capital of the Company to Prosperity, such shares to be fully\n                                paid-up upon issue (“Further Strategic\n                                    Shares”), at the ratio of seven (7) Further\n                                Strategic Shares for every three (3) Contingent Conversion\n                                Shares.” [emphasis in original] 15     I pause to observe that the reference to the\n                    “Agreed Period” in clause 8A.5 of the SSA was initially\n                    removedviathe First Supplementary SSA, but was\n                    reinstated pursuant to the Second Supplementary SSA. 16     On 17 May 2005, Prosperity and Abterra entered\n                    into a Third Supplementary SSA. However, as the Third Supplementary SSA did not\n                    vary clause 8A.5 further, it is not relevant to the present\n                application.",
        "The Loan Agreement between Tan Holdings and Prosperity": "17     The genesis of this application could be\n                    traced to a Loan and Assignment Agreement dated 20 January 2005 (“the\n                    Loan Agreement”) between Tan Holdings, Prosperity and Bumiputra Commerce\n                    Bank Berhad, Singapore (“BCB”). Under the Loan Agreement,\n                    Prosperity extended a loan of S$800,000 to Tan Holdings in exchange for which\n                    Tan Holdings pledged 60 million shares that it held in Abterra to\n                    Prosperity. 18     Tan Holdings in turn used the S$800,000 loan\n                    to purchase Abterra’s outstanding debt to BCB.",
        "Suit No 899 of 2008": "19     A dispute eventually arose in relation to the\n                    Loan Agreement that led to the commencement of Suit No 899 of 2008\n                    (“S 899/2008”) on 28 November 2008 by the\n                    liquidator of Tan Holdings (“the Liquidator”) against Prosperity\n                    for breach of certain implied terms of the Loan Agreement. The details of the\n                    Liquidator’s claim in S 899/2008 are strictly irrelevant to the present\n                    application. Suffice it to say that Prosperity did not enter an appearance to S\n                    899/2008, and consequently, on 27 February 2009, default judgment was\n                    obtained by the Liquidator against Prosperity for the sum of some S$4.4\n                    million.",
        "Summons No 2983 of 2009: Receivership Order": "20     To enforce the default judgment, on 2 July\n                    2009, the Liquidator applied by way of anex partesummons before Judith Prakash J in Summons No 2983 of 2009 (“SUM\n                    2983/2009”) and obtained an order (“the Receivership\n                    Order”) appointing Mr Lai Seng Kwoon as receiver (“the\n                    Receiver”) to receive the profits and moneys receivable in respect of\n                    Prosperity’s interest in the FSS under the SSA. 21     The Liquidator took the position that\n                    Prosperity was entitled to 291,515,259 FSS which was derived as follows: (a)     First, he relied on two\n                        announcements made by Abterra dated 28 December 2007 and 24 December 2008 on\n                        the allotments of Contingent Conversion Shares to Contingent\n                        Creditors. (b)     Pursuant to the 28 December 2007 announcement under which United Overseas\n                        Bank’s (“UOB”) claim for S$397,800.28 under a corporate\n                        guarantee (“the 2007 UOB claim”) was admitted, Abterra\n                        allotted 3,043,800 Contingent Conversion Shares to UOB. (c)     Pursuant to the 24 December 2008\n                        announcement under which ECICS Credit and Guarantee Company (Singapore) Pte\n                        Ltd’s (“ECICS”) claim for S$9,307.36 under a performance\n                        guarantee (“the ECICS claim”), UOB’s claim for\n                        S$1,587,572.51 under a corporate guarantee (“the 2008 UOB\n                        claim”) and Malayan Banking Berhad’s (“MBB”)\n                        claim for S$1,084,728.97 under a corporate guarantee (“the MBB\n                        claim”) were admitted, Abterra allotted a total of 121,891,311\n                        Contingent Conversion Shares to the said Contingent\n                    Creditors. (d)     Given\n                        that seven FSS were to be allotted for every three Contingent Conversion\n                        Shares under clause 8A.5 of the SSA, the total number of FSS that Prosperity\n                        was entitled to worked out to be 291,515,259. 22     Upon hearing SUM 2983/2009, Prakash J granted\n                    the Receivership Order of which paragraphs 1 and 5 read as follows: 1    The Plaintiff being answerable for the acts and\n                            defaults of the receiver, it is ordered that LAI SENG KWOON (NRIC No.\n                            S1287640H), care of 8 Robinson Road, #13-00 ASO Building Singapore\n                            048544, be and is hereby appointed to receive the profits and moneys\n                            receivable in respect of the abovenamed Defendant’s interest in\n                            the following property, namely the Further Strategic Shares to be issued\n                            pursuant to the [SSA] dated August 2004 between Abterra Ltd (formerly\n                            known as “Hua Kok International Ltd”) and the Defendant\n                            but the Plaintiff shall not receive more than the amount of the judgment\n                            debt (including interest and costs as set out in paragraph 5 below) and\n                            the allowed costs of obtaining this order without leave of the\n                            Court. ... 5.    The receiver shall on the 5th day of October 2009\n                            (3 months after the date of the order) and at such further and\n                            other times may be ordered by the Registrar leave and pass his accounts,\n                            and shall on the 3rd day of November 2009 (4 months after the date\n                            of order), and such further and other times as may be hereafter ordered\n                            by the Registrar pay the balance or balances appearing due on the\n                            accounts so left, or such part thereof as shall be certified as proper\n                            to be so paid, such sums to be paid in or towards satisfaction of what\n                            shall for the time being be due in respect of the judgment signed on the\n                            27th day of February 2009 for the sums of S$4,404,590.33 debt, interest\n                            at the rate of 5.33% per annum on such debt calculated from the date of\n                            the commencement of proceedings herein until payment is received in full\n                            by the Plaintiff and S$7,500 costs. [emphasis added] 23     Following the Receivership Order, the Receiver\n                    wrote to Abterra to issue 78,694,000 FSS in satisfaction of the judgment debt.\n                    In response, Abterra through its solicitor’s letter dated 13 August 2009,\n                    declined to do so,inter alia, on the premise that\n                    the Receivership Order did not empower the Receiver to request for the FSS on\n                    behalf of Prosperity. It would appear that thelocus\n                        standiissue was flagged by Abterra at a very early\n                stage.",
        "Summons No 4903 of 2009: Construction of clause 8A.5 before Kan\n                J": "24     Given Abterra’s refusal to allot the FSS\n                    to the Receiver, the Liquidator took out Summons No 4903 of 2009 (“SUM\n                    4903/2009”) on 1 October 2009 in S 899/2008 before Kan Ting Chiu J for\n                    determination of the true and proper construction of clause 8A.5 as it stood\n                    amended by the Second Supplementary SSA and that pending such determination, the\n                    Receiver was not required to comply with paragraph 5 of the Receivership Order.\n                    The application in SUM 4903/2009 was contested by both Abterra and GNR as\n                    interested parties even though they were not direct parties to S\n                    899/2008. 25     At the hearing of SUM 4903/2009, Kan J noted\n                    that since Abterra was not a party to S 899/2008, it was not desirable to make a\n                    determination on the effect of clause 8A.5. The Liquidator then applied for\n                    leave to withdraw SUM 4903/2009 so that a fresh application could be filed\n                    for the same relief naming Abterra as a party. Kan J granted the leave sought\n                    and ordered,inter alia: 1.That pending the determination\n                                by agreement or adjudication on the effect of Clause 8A.5of the [SSA] dated 30 August 2004 entered into between Abterra Ltd\n                            (formerly known as “Hua Kok International Ltd”) and the\n                            Defendant and read with the Scheme of Arrangement proposed by and\n                            entered into between Abterra Ltd and certain of its creditors, the Receiver shall not be required to comply with\n                                paragraph 5 of the Order of Court dated 2 July\n                            2009. [emphasis added]",
        "The Sale and Purchase Agreement between Prosperity and GNR": "26     At this juncture, I would pause to take note\n                    of one other event. Prior to the commencement of S 899/2008, an intervening\n                    development took place in relation to Prosperity’s shares in Abterra which\n                    has a material bearing on the right to the FSS. On 1 September 2006, Prosperity\n                    entered into a Sale and Purchase Agreement (“SPA”) with GNR\n                    whereby Prosperity sold some 1.337 billion shares it held in Abterra to GNR\n                    at the price of about S$4.95 million. According to GNR, the sale took place\n                    because Prosperity was looking to exit from Abterra and, at the same time, GNR\n                    was looking to acquire a controlling interest in a Singapore listed\n                    company. 27     The two material clauses in the SPA which were\n                    relevant to the issues before me were clauses 2.1 and 1.1. 28     Clause 2.1 of the SPA read: 2.1Subject to the terms and conditions of this\n                            Agreement, the Vendor agrees to sell to the Purchaser and the Purchaser\n                            shall purchase from the Vendor, the Sale Shares absolutely free and\n                            clear from all Encumbrances of whatsoever nature andwith all rights, benefits and entitlements now or thereafter\n                                attaching thereto with effect from 1 September\n                            2006. [emphasis added] 29     The term “Sale Shares” was\n                    defined in clause 1.1 as follows: 1.DEFINITIONS AND\n                                INTERPRETATION 1.1    [...] “Sale Shares” means\n                            1,337,592,585 ordinary shares, representing 65% of the issued shares of\n                            the Company as at the date hereof, to be sold by the Vendor to the\n                            Purchaser under this Agreement. [emphasis in original] 30     At the time of sale under the SPA, Prosperity\n                    held 70% of the shares in Abterra. As a result of the sale, Prosperity was left\n                    with only 5% of the shares in Abterra, whereas GNR, having bought shares in\n                    Abterra from Prosperity as well other sources, now holds over 92% of the shares\n                    in Abterra.",
        "Originating Summons No 726 of 2010: The present action": "31     Arising from the order made by Kan J in SUM\n                    4903/2009, the Liquidator then commenced the present action in Originating\n                    Summons No 726 of 2010 (“OS 726/2010”) on 16 July 2010,\n                    naming Prosperity, Abterra and GNR as the first, second and third defendants\n                    respectively. In OS 726/2010, the Liquidator sought a declaration\n                    that: (a)     on a true and proper construction of\n                        clause 8A.5 of the SSA dated 30 August 2004 and amended by the Second\n                        Supplementary SSA on 14 March 2005, Prosperity had a present right to call\n                        on Abterra to issue the FSS as defined in the SSA; and (b)     the right to call on the FSS did not\n                        pass from Prosperity to GNR pursuant to the SPA.",
        "Summons No 2161 of 2011: Amendment of the Receivership\n                Order": "32     About a year later, on 19 May 2011, the\n                    Liquidator applied by way ofex partesummons to\n                    amend the Receivership Order in Summons No 2161 of 2011 (“SUM\n                    2161/2011”). It was necessary to first explain the circumstances that led\n                    to the amendment application. 33     In a separate application initiated by Abterra\n                    in Originating Summons No 1185 of 2010 to enjoin the Liquidator from using\n                    information which came into his possessionquascheme administrator of the Abterra Scheme, Woo Bih Li J remarked during the\n                    hearing on 25 March 2011 that the correct plaintiff for OS 726/2010 should\n                    perhaps have been the receiver of Prosperity instead. 34     During the hearing before me, Mr David Chan,\n                    counsel for the Receiver (“Mr Chan”), accepted that thelocus standiof the proper applicant to claim for the\n                    FSS became a “live issue” following the observation by Woo J and\n                    that the amendment application was made to address the shortcomings of the\n                    Receivership Order. The Receiver in his supporting affidavit explained,inter alia, that the Receivership Order did\n                    not expressly empower him to call on Abterra to issue the FSS or to commence\n                    proceedings to claim for the FSS. 35     I found it curious that the amendment\n                    application was heard on anex partebasis.\n                    Thereafter I discovered that although the solicitors of Abterra were initially\n                    notified of the amendment application by the Registry of the Supreme Court\n                    (“the Registry”), following a telephone call from the solicitors\n                    for the Liquidator, the Registry subsequently notified Abterra’s\n                    solicitors in writing that their attendance was not required “since you\n                    are not acting for any party in this matter”. 36     As I was concerned about the circumstances\n                    that eventually resulted in the amendment application being heard on anex partebasis, I directed the\n                    Liquidator’s solicitors to formally explain the circumstances surrounding\n                    the telephone call to the Registry. Following their detailed explanation as well\n                    as Abterra’s response, I was satisfied that there was nothing improper in\n                    the telephone call by the Liquidator’s solicitors. In essence, they\n                    explained that they did not believe that the amendment application needed to be\n                    served on Abterra since they were not direct parties to S 899/2008 or to the\n                    original application that led to the Receivership Order. Indeed, the\n                    notification of the amendment application to Abterra’s solicitors was\n                    subsequently withdrawn by the Registry on this basis. It was also clear that\n                    Abterra’s solicitors were at least aware of the amendment application\n                    through the notification from the Registry and therefore could have sought for\n                    more information if they were interested to attend the hearing even though the\n                    amendment application was never formally served on them. 37     Having said that, given the contentious\n                    background, particularly the acknowledged shortcomings of the Receivership Order\n                    and the earlier participation of Abterra and GNR in SUM 4903/2009 before Kan J,\n                    the better and prudent course was for the Liquidator’s solicitors to have\n                    served the amendment application on all the interested parties including Abterra\n                    and GNR so that all relevant arguments could have been adequately ventilated at\n                    an earlier stage. 38     In any event, Prakash J heard the application\n                    on anex partebasis in SUM 2161/2011 and granted\n                    the amendments to the Receivership Order sought by the Liquidator (“the\n                    Amended Receivership Order”). 39     Paragraphs 1, 2 and 3 of the Amended\n                    Receivership Order read: 1.The Plaintiff\n                            being answerable for the acts and defaults of the receiver, it is\n                            ordered thatLAI SENG KWOON(NRIC No.\n                            S1287640H), care of 8 Robinson Road, #13-00 ASO Building Singapore\n                            048544, be and is hereby appointed (“the Receiver”) to do\n                            all such things as are necessary in the Defendant’s stead to call\n                            on and/or demand and receive the Further Strategic Shares to be issued\n                            pursuant to the Strategic Subscription and New Business Agreement dated\n                            August 2004 between Abterra Ltd. (formerly known as “Hua Kok\n                            International Ltd”) and the Defendant (the “Share\n                            Subscription\n                            Agreement”). 2.The\n                            Receiver shall be permitted and empowered, if necessary,\n                        to: a.Appoint a solicitor to assist him in his\n                                duties; and b.Bring or defend and/or continue any action or\n                                other legal proceeding in the name and on behalf of the Plaintiff\n                                but only in so far as it is necessary and in pursuance and/or\n                                facilitation of paragraph 1 above. 3.The Receiver shall receive and sell the Further\n                            Strategic Shares and use the proceeds of the sale to satisfy the\n                            judgment debt but the Plaintiff shall not receive more than the amount\n                            of the judgment debt (including interest and costs as set out in\n                            paragraph 7 below) and the allowed costs of obtaining this order without\n                            leave of the Court. [emphasis in original] 40     It was apparent from the terms of the Amended\n                    Receivership Order that the amendments were indeed intended to address the\n                    shortcomings as identified in the supporting affidavit filed by the Receiver.\n                    Following the Amended Receivership Order, the Receiver took over conduct of\n                    OS 726/2010.",
        "Issues": "41     The above summary of the material facts\n                    provided the backdrop under which the following issues came before me for\n                    determination: (a)     First, does the Receiver have thelocus standito bring the present\n                        application for the FSS under clause 8A.5 of SSA as it stood amended by the\n                        Second Supplementary SSA? (b)     Secondly, if the Receiver hadlocus\n                            standi, whether upon a true and proper construction of\n                        clause 8A.5 of the SSA, Prosperity still had the right to claim for the\n                        FSS? (c)     Thirdly,\n                        if Prosperity still had the right to claim for the FSS, whether the right\n                        still remained with Prosperity or had been transferred to GNR pursuant to\n                        the SPA? 42     To succeed in OS 726/2010, Mr Chan accepted\n                    that the Receiver had to overcome all three hurdles. Having considered the\n                    evidence before me and the respective parties’ submissions, I arrived at\n                    the conclusion that the Receiver had failed in all three respects.",
        "Nature of a Receivership Order": "43     Before examining thelocus\n                        standiissue, it is perhaps useful to understand the nature of a\n                    receivership order and, in particular, whether a chose in action could properly\n                    be the subject matter of such an order. 44     A clear exposition of the effect and nature of\n                    a receivership order was expounded by Collins LJ inMasri v\n                        Consolidated Contractors Int (UK) Ltd (No 2)[2009] 1 QB 450.\n                    Collins LJ held (at [52]–[53]) that: 52    The starting point\n                            is the effect of the receivership order. Receivership by way of\n                            equitable execution is summarised inSnell,Equity, 31st ed (2005),\n                            para 17-25: “A judgment creditor normally obtains satisfaction of his\n                            judgment by execution at common law, using the writ of fieri facias,\n                            attachment of debts and, formerly, in the case of land, the writ of\n                            elegit. There were cases, however, where the creditor could not levy\n                            execution at law owing to the nature of the property, the principal case\n                            being where the property was merely equitable, such as an interest under\n                            a trust or an equity of redemption. Another example was a covenant of\n                            indemnity or other chose in action of which the debtor has the benefit,\n                            but which could not be reached by attachment. In order to meet this\n                            difficulty, the Court of Chancery evolved a process of execution by way\n                            of appointing a receiver of the equitable interest, and if necessary\n                            supplemented this by an injunction restraining the judgment debtor from\n                            disposing of his interest in the property. This process was not\n                            ‘execution’ in the ordinary sense of the word, but a form of\n                            equitable relief for cases where execution was not possible. The effect\n                            of such an appointment ‘is that it does not create a charge on the\n                            property, but that it operates as an injunction against the judgment\n                            debtor receiving the income’ or dealing with the property to the\n                            prejudice of the judgment creditor.” 53    The authorities bear out the proposition, important\n                            in this case, that the appointment does not have a proprietary effect.\n                            It has effect as an injunction restraining the judgment debtor from\n                            receiving any part of the property which it covers, if that property is\n                            not already in his possession, but it does not vest the property in the\n                            receiver. As Lindley LJ said inIn re\n                                Sartoris’s Estate[1892] 1 Ch 11, 22 :\n                            “It operates as an injunction restraining the defendant from\n                            getting in money which the receiver is appointed to receive.” See\n                            alsoStevens v Hutchinson[1953] 1 Ch 299,\n                            305. The judgment creditor receives no interest in the received property\n                            until it is transferred to him in satisfaction of the judgment debt:In re Potts[1893] 1 QB 648,\n                            661. 45     Cotton LJ observed inIn re\n                        Shephard(1889) 43 Ch D 131 that it might be somewhat confusing\n                    to refer to the appointment of a receiver as a form of “equitable\n                    execution”. Cotton LJ held (at 135) that: Confusion of ideas has arisen from the use of the term “equitable\n                        execution.” The expression tends to error. It has often been used by\n                        judges, and occurs in some orders, as a short expression indicating that the\n                        person who obtains the order gets the same benefit as he would have got from\n                        legal execution. But what he gets by the appointment of a receiver is not\n                        execution, but equitable relief, which is granted on the ground that there\n                        is no remedy by execution at law; it is a taking out of the way a hindrance\n                        which prevents execution at common law.",
        "Subject matter of a receivership order": "46     The power of the court to appoint a receiver\n                    is set out under paragraph 5(a) of the First Schedule of the Supreme Court\n                    of Judicature Act (Cap 322, 2007 Rev Ed), which provides as follows: Preservation of subject-matter, evidence and assets to\n                            satisfy judgment 5. Power before or after any proceedings are commenced to provide for\n                        — (a) the interim preservation of property which is the subject-matter of\n                        the proceedings by sale or by injunction or the appointment of receiver or\n                        the registration of a caveat or a lis pendens or in any manner\n                        whatsoever; (b) the preservation of evidence by seizure, detention, inspection,\n                        photographing, the taking of samples, the conduct of experiments or in any\n                        manner; and (c) the preservation of assets for the satisfaction of any judgment which\n                        has been or may be made. 47     Here, the “property” over which\n                    the Receivership Order was obtained related to an alleged right of the judgment\n                    debtor,ie, Prosperity’s right to the FSS\n                    under clause 8A.5 of the SSA. It was accepted by all parties that such a right\n                    was strictly a chose in action. All parties were also in agreement that a chose\n                    in action could legitimately be the subject matter of a receivership order and\n                    relied on the same authorities in support of this proposition of\n                law. 48     InBourne v Colodense\n                        Ltd[1985] ICR 291 (“Bourne”), the plaintiff developed health issues which were\n                    believed to have been caused by the defendant’s negligent use of a toxic\n                    substance at the work place. The plaintiff then applied to his trade union for\n                    assistance to sue the defendant whereupon the trade union appointed a solicitor\n                    to act on his behalf. The action was eventually dismissed with costs after a\n                    lengthy trial. As the plaintiff was elderly and sick with no assets, it was\n                    accepted that bankruptcy and execution would not produce any recovery for the\n                    defendant. It was the understanding that the trade union had financed the\n                    litigation and would pick up the costs which the plaintiff was liable to pay to\n                    the defendant but it refused to do so. As the trade union was not a direct party\n                    to the litigation, it could not be ordered to pay the costs of the action. Under\n                    those circumstances, the defendant applied for and obtained an order to appoint\n                    a receiver by way of equitable execution for liberty to commence proceedings in\n                    the name of the plaintiff to claim an indemnity against the trade union in\n                    respect of costs which the plaintiff was liable to pay the defendant following\n                    the dismissal of the claim. 49Bournewas cited\n                    with approval inMaclaine Watson v International Tin\n                        Council[1987] 3 WLR 508 (“Maclaine”). LikeBourne,\n                    the subject matter of the application for the appointment of a receiver inMaclainewas also a chose in action. In an\n                    arbitration to which the International Tin Council (“ITC”)\n                    submitted, an award was made against the ITC which it defaulted in paying. Leave\n                    of court was subsequently obtained to enforce the award and judgment was\n                    accordingly entered. When the judgment remained unsatisfied, the applicant\n                    applied to appoint a receiver over the assets of ITC in order to make formal\n                    demands in the name of ITC against its member states for contributions in\n                    respect of the judgment debt. 50     As a matter of principle, Millett J held inMaclainethat he had the jurisdiction to\n                    appoint a receiver. However, the application was disallowed because Millett J\n                    found (at 518E) that the applicant had failed to demonstrate anarguable casethat ITC had any cause of action against\n                    its member states which was not derived from international treaty, it being\n                    accepted that a claim based on an international treaty was not justiciable\n                    before the English court. 51     Having stated the position in law that a chose\n                    in action could properly be the subject matter of a receivership order, it is\n                    necessary to explain when a chose in action is suitable and appropriate for the\n                    appointment of a receiver. Can a receiver be appointed in respect of adisputedchose in action? In this respect, it was also\n                    common ground amongst all parties that a receiver could be appointed even if the\n                    chose in action was disputed. In bothBourneandMaclaine, the courts held that it was\n                    essential for the applicant to show an arguable case (seeMaclaineat 513H) or aprima faciecase on the merits (seeBourneat 294). On the\n                    other hand, it is equally clear that a court would not appoint a receiver if it\n                        “was satisfied that the appointment would be\n                        fruitless because there was nothing for the receiver to get\n                    in” (perDhillon LJ inBourneat 302) [emphasis added].",
        "The locus standi issue": "52     It was common ground amongst all parties that\n                    in order for the Receiver to seek declaratory relief under\n                    O 15 r 16 of the Rules of Court (Cap 322, R 5, 2006 Rev\n                    Ed) (“Rules of Court”), six requirements laid down by the\n                    Singapore Court of Appeal inKaraha Bodas Co LLC v Pertamina\n                        Energy Trading Ltd and another appeal[2006] 1 SLR(R) 112\n                        (“Karaha Bodas”) must be\n                    satisfied. The Court of Appeal inKaraha Bodasheld (at [14]) that: 14    [...] the following\n                            are the requirements that must be satisfied before the court grants such\n                            relief: (a)    the court must have the jurisdiction and power\n                                to award the remedy; (b)    the matter must be justiciable in the\n                                court; (c)    as a declaration is a discretionary remedy, it\n                                must be justified by the circumstances of the case; (d)the plaintiff must\n                                    havelocus standito bring the\n                                    suit and there must be a real controversy for the court to\n                                    resolve; (e)    any person whose interests might be affected\n                                by the declaration should be before the court; and (f)    there must be some ambiguity or uncertainty\n                                about the issue in respect of which the declaration is asked for so\n                                that the court’s determination would have the effect of laying\n                                such doubts to rest. [emphasis added] 53     The Receiver’slocus\n                        standiwas challenged on the fundamental premise that Tan\n                    Holdings was not a party to the SSA and that the Amended Receivership Order did\n                    not purport to empower the Receiver to commence proceedings in the name of\n                    Prosperity who was the relevant party under the SSA to take out the\n                    application. 54     The Court of Appeal inKaraha Bodasheld (at [19]) that a plaintiff does not have the standing to seek a\n                    declaration regarding the rights of two other parties as opposed to a right\n                    which it could claim for itself. In so holding, the Court of Appeal endorsed the\n                    approach of Lord Diplock inGouriet v Union of Post Office\n                        Workers[1978] AC 435 at 501 that: .... the jurisdiction of the court to make declarations of rights was\n                        confined to declaring contested legal rights of the parties represented in\n                        the litigation. 55     Counsel for the second defendant, Mr Giam Chin\n                    Toon SC (“Mr Giam SC”) helpfully referred the court to\n                    the English Court of Appeal’s decision ofR v Secretary\n                        of State for Social Services and another, ex parte Child Poverty Action\n                        Group and others[1990] 2 QB 540 (“ex\n                        parte CPAG”) for the proposition that thelocus standiof an applicant for declaratory relief goes\n                    to the jurisdiction of the court and must be satisfied even if it was not\n                    contested. Inex parte CPAG, Woolf LJ held at 556\n                    that: However, we make it clear that in our viewthe question\n                            oflocus standigoes to jurisdiction of\n                            the courtand therefore the approach adopted by the\n                        department in this case, while understandable, is not appropriate.The parties are not entitled to confer jurisdiction, which the\n                            court does not have, on the court by consentand, if this\n                        court had been minded to grant declaratory relief, would have had to advance\n                        any arguments which were available to them or to accept the consequences of\n                        not doing so. [emphasis added] 56     Before me, Mr Chan accepted that the\n                    Receiver’s case onlocus standiwould stand\n                    or fall on the Amended Receivership Order dated 24 May 2011. In particular, Mr\n                    Chan relied on paragraphs 1, 2 and 3 of the Amended Receivership\n                Order. 57     Before examining the terms of the Amended\n                    Receivership Order, it is apposite to note that inBourneandMaclainewhere\n                    receivers were appointed to enforce a chose in action, the receivership order\n                    had specifically empowered the receiver to take steps or commence proceedingsin the name of the judgment debtor. InBourne, the order expressly authorised the\n                    receiver to recover the costsin the name of the\n                        plaintiffagainst the trade union. Similarly, inMaclaine, the applicant sought an order to appoint a\n                    receiver by way of equitable execution to authorise the receiver,in the name of ITCto make formal demands against its\n                    member states for contributions. In this way, there would be no issue of a party\n                    seeking a declaration of rights concerningother\n                        partiesas was disapproved by the Court of Appeal inKaraha Bodas. 58     The law of receivership is well settled in\n                    Singapore. InLee Kuan Yew v Tang Liang Hong and another and\n                        other suits[1997] 1 SLR(R) 328, Lai Kew Chai J held (at\n                        [7]) that: 7    [...] His main function is the identification,\n                            collection and protection or preservation of property which he must hold\n                            to abide by the outcome of the action in which he is appointed.A receiver appointed by a court derives his\n                                powers from the terms of the order appointing him. If\n                            necessary, he may apply to court for further powers and\n                            directions. [emphasis added] 59     A receiver, as an officer of the court,\n                    derives his powers solely from the terms of the court order appointing him. It\n                    follows that his powers are defined by the terms of the court order. What the\n                    receiver can or cannot do is a matter of construction of the terms of the\n                    receivership order. If a receivership order does not specifically empower the\n                    receiver to bring an action on behalf of a particular party, it must follow that\n                    he has no power to do so. 60     Under paragraph 1 of the Amended Receivership\n                    Order, the Receiver was only empowered to “call on and/or demand and\n                    receive the Further Strategic Shares”. The Amended Receivership Order did\n                    not expressly empower the Receiver to bring an action on behalf of Prosperity.\n                    Given that Prosperity was the first defendant in OS 726/2010, it would have been\n                    odd for the Receiver to obtain an order empowering him to proceed in the name of\n                    Prosperity against several defendantsincludingProsperity. 61     The lack of power on the part of the Receiver\n                    to commence proceedings in the name of Prosperity became even clearer when\n                    paragraph 2(b) of the Amended Receivership Order was examined.\n                    Paragraph 2(b) stated that: 2. The Receiver shall be permitted and empowered, if necessary, to: ... b.Bring or defend and/or continue\n                                any action or other legal proceeding in the name and on behalf of\n                                the Plaintiffbut only in so far as it is necessary and\n                            in pursuance and/or facilitation of paragraph 1 above. [emphasis added] 62     The language used here was plain. Paragraph\n                    2(b) of the Amended Receivership Orderonlyempowered the Receiver to bring an action on behalf of the plaintiff and not on\n                    behalf of Prosperity. Consistent with the lack of power to commence OS 726/2010\n                    in the name of Prosperity, the Receiver had instead commenced proceedings in the\n                    name of Tan Holdings. Paragraph 3 of the Amended Receivership Order merely\n                    empowered the Receiver to receive and sell the FSS and did not assist in\n                    addressing thelocus standiissue\n                either. 63     In response to Abterra’s solicitors, the\n                    solicitors for the Receiver by letter dated 30 May 2011 stated that the Receiver\n                    “is now empowered and does again make a requeston\n                        behalf of Prosperity” [emphasis added] for the allotment\n                    of the FSS and therefore had implicitly recognised that the claim ought to\n                    brought in the name of Prosperity. In spite of that, it was puzzling that the\n                    Amended Receivership Order only empowered the Receiver to claim in his capacity\n                    as Receiveron behalf of the Liquidator of Tan\n                        Holdings. 64     Mr Chan, in his further submissions after\n                    delivery of my oral decision, relied on the English Court of Appeal’s\n                    decision inGuaranty Trust Company of New York v Hannay &\n                        Company[1915] KB 536 (“Guaranty\n                        Trust”) at 562 for the proposition that O 15 r 16 allowed\n                    “any party who is interested in the subject matter of the\n                    declaration” to seek declaratory relief. 65     In my view, the decision inGuaranty Trustdid not advance the Receiver’s case any\n                    further on thelocus standiissue. That case\n                    concerned an application by a plaintiff for a declaration that it was not liable\n                    to the defendant in respect of monies paid under a bill of exchange. The\n                    objection to the declaration was that the plaintiff had no cause of action and\n                    further that it was seeking a declaration that it had no obligation instead of a\n                    declaration of a right. 66     The same passage inGuaranty Trustwas in fact considered inKaraha Bodas(at [16])\n                    where the Court of Appeal observed that the plaintiff inGuaranty Trustwas “asserting the recognition of a\n                    ‘right’ personal to him even if he was not making a\n                    ‘claim’ against the defendants in England”. The plaintiff was\n                    a United States bank which purchased the bill of exchange which was drawn by the\n                    defendant. It was therefore a party to the bill of exchange unlike the present\n                    case where Tan Holdings was neither a party to the SSA nor the\n                SPA. 67     As such, there was no question of Tan\n                    Holdings, and consequently the Receiver, asserting any rightpersonalunder the SSA or the SPA. Furthermore, inKaraha Bodas, the Court of Appeal also noted the dictum\n                    by Pickford LJ inGuaranty Trustthat was\n                    considered inIn re S (Hospital Patient: Court’s\n                        Jurisdiction)[1995] Fam 26. It was held inKaraha Bodas(at [16])\n                    that: 16    [...] As was noted\n                            inRe Sby Hale J ([12]supraat 34): It is argued on behalf of the plaintiff that declaratory\n                            relief can be sought by anyone with a sufficient interest even if that\n                            person’s own legal rights or liabilities are not in issue.\n                            Reliance is placed on the well known words of Pickford L.J. in\n                                [Guaranty Trust Co]: I think therefore that the effect of the rule [the predecessor to\n                                R.S.C., Ord. 15, r. 16] is to give a general power to make a\n                                declaration whether there be a cause of action or not, and at the\n                                instance of any party who is interested in the subject matter of the\n                                declaration. However,it is noteworthy in that case\n                                that it was the plaintiff’s own legal position which was in\n                                issue. Moreover, Pickford L.J. [inGuaranty Trust Co] went on to say: It does not extend to enable any stranger to\n                                    the transaction to go and ask the court to express its opinion\n                                    in order to help him in other transactions. [emphasis added] 68     In the present context, Tan Holdings was\n                    indeed astrangerto both the SSA and the SPA. In\n                    my view, the holding inGuaranty Trustas regards\n                    “a party having an interest in the subject matter of the\n                    declaration” was intended to address the issue that the plaintiff need\n                    not have a cause of action against the defendant in seeking declaratory relief.\n                    It was not intended to dispense with the overarching requirement to demonstratelocus standiin order to pursue declaratory\n                    relief under O 15 r 16. 69     In my judgment, the Amended Receivership Order\n                    failed to adequately address the lack oflocus\n                        standion the part of the Receiver to commence OS 726/2010\n                    to claim for the FSS under the SSA. Tan Holdings was not a party to the SSA and\n                    had no rights thereunder. On this ground alone, the application failedin limine. However, in case I was wrong on the thresholdlocus standiissue, I had nonetheless\n                    considered the merits of the application. 70     For completeness, after delivering my oral\n                    grounds, I invited all parties to address the court as to whether the Receiver\n                    could have validly obtained an order to commence proceedings to claim for the\n                    FSS in the name of Prosperity. In this connection, all parties, relying onBourneandMaclaine, were also in agreement that such an ordercouldin principle have been obtained. 71     However, parties adopted different positions\n                    as to whether such an orderwouldorshouldhave been issued on the specific facts in this\n                    case. Mr Giam SC submitted it was not “just and convenient”\n                    for the Receiver to have been appointed as Prosperity was in all likelihood\n                    insolvent. As such, any disposal or sale of the FSS (believed to be the only\n                    known “asset” of Abterra) for the benefit of Tan Holdings would\n                    infringe thepari passudistribution rule for all\n                    unsecured creditors. 72     More fundamentally, Mr Giam SC added that\n                    given the court’s finding on the lack of merits in the Receiver’s\n                    construction of clause 8A.5 of the SSA (which is dealt with below), there would\n                    be no purpose in granting an order for the Receiver to claim the FSS in the name\n                    of Prosperity. Therefore, while a receiver could be appointed in respect of adisputedchose in action in the sense that the\n                    defaulting party has refused to pay without the commencement of court\n                    proceedings, such an order should not be made if it is clear that there is no\n                    arguable case as was found to be the case inMaclaine. 73     In the present case, the substantive merits of\n                    the application ultimately turned on the true construction of the terms of the\n                    SSA and the SPA, both of which could be dealt with summarily given that there\n                    was no dispute on the material facts. On that note, I now turn my attention to\n                    deal with the construction of the terms of the SSA and the SPA.",
        "Construction of clause 8A.5 of the SSA": "74     The Receiver’s claim for the FSS rested\n                    on clause 8A.5 of the SSA. 75     Clause 8A.5 of the SSA referred to the\n                    following four essential terms: (a)Contingent Creditors;(b)Agreed Period;(c)Contingent Conversion Shares; and(d)Crystallized Liabilities.76     These four terms were defined in Recital (F)\n                    of the SSA, which reads:(F)    The Company has\n                            contingent liabilities under:-(1)a corporate guarantee of up to approximately\n                                S$8.5 million issued to the Lending Banks (as defined hereunder) in\n                                support of the existing bank borrowings of the World Spa Group of\n                                companies;(2)possible costs and disbursements pursuant to\n                                the liquidation of Hua Kok Precast Pte Ltd;(3)a corporate guarantee given to ECICS Credit\n                                and Guarantee Company (Singapore) Ltd issued in support of the bank\n                                borrowings arising from a joint venture project undertaken by HKR;\n                                and(4)a corporate guarantee given to Malayan Banking\n                                Berhad in support of secured bank borrowings of HKR (which as at the\n                                date hereof is regarded as unlikely to crystailize as the security\n                                provided to Malayan Banking Berhad is more than the outstanding bank\n                                borrowings,(collectively, the “Contingent\n                                Liabilities”, and collectively, the contingent\n                            creditors above shall be referred to as the “Contingent Creditors”). The Restructuring shall\n                            include the Contingent Creditors agreeing that in the event the\n                            Contingent Liabilities crystallize and become actual liabilities to the\n                            Contingent Creditors (the “Crystallized\n                                Liabilities”), the relevant Contingent Creditors\n                            in recourse against the Company under the corporate guarantees or\n                            indemnities shall be bound to receive new shares of the Company at the\n                            same price as the Deemed Unsecured Conversion Share Issue Price in\n                            discharge of the Crystallized Liabilities. Such new shares shall also be\n                            referred to as the “Contingent Conversion\n                                Shares”.In connection therewith, the Company shall use it best efforts to\n                            arrange for the Lending Banks to agree to maintain their banking\n                            facilities with the World Spa Group for the next three years (the\n                                “Agreed Period”), and\n                            during the Agreed Period, the Company shall in cooperation with the\n                            minority shareholders of the World Spa Group, use its best endeavor to\n                            divest its 60% stake and for the purchaser to assume responsibility\n                            under the aforesaid corporate guarantee.The Company shall further use its reasonable endeavours to incorporate\n                            a provision that if the then prevailing market price of HKI Shares as\n                            traded on the SGX-ST is higher than the Deemed Unsecured Conversion\n                            Share Issue Price, that the Contingent Conversion Shares may be issued\n                            at that higher market price.[emphasis in original]77     In my view, clause 8A.5 was to be construed as\n                    follows:(a)     First, the Contingent Creditors must\n                        become bound to receive the Contingent Conversion Shares.(b)     Second, the obligation of the\n                        Contingent Creditors to receive the Contingent Conversion Shares was in\n                        discharge of Crystallized Liabilities,ie, the\n                        Liabilities must first become crystallized.(c)     Third, Prosperity’s right to request for\n                        the FSS would only arise if the Contingent Creditors became bound to receive\n                        the Contingent Conversion Shares in the Agreed Period,ie, by 29 August 2007.78     Both the Abterra Scheme and the SSA were\n                    inextricably linked. In fact, under clause 2.1(c) of the SSA, the rights and\n                    obligations of the parties under the SSA were made conditional upon the approval\n                    of the Abterra Scheme. Under the Abterra Scheme, crystallization of liabilities\n                    occurred when the Contingent Creditors made payment and thereafter upon demand\n                    being made against Abterra. I therefore disagreed with Mr Chan that the\n                    Contingent Liabilities became crystallized when the Abterra Scheme became\n                    effective on or about 17 May 2005.79     In support of its claim for the FSS, the\n                    Receiver relied on two announcements as described in[21]above under which various Contingent Liabilities became\n                    crystallized which led to the allotment of various Contingent Conversion\n                    Shares.80     The “Agreed Period” of three\n                    years from the date of the SSA expired on 29 August 2007. Therefore, save for\n                    the 2007 UOB claim, the other Contingent Liabilities had crystallized outside\n                    the “Agreed Period”. Prosperity, therefore, had no entitlement to\n                    request for the FSS in respect of the 2008 UOB claim, MBB claim and ECICS claim\n                    since those claims had crystallized outside the “Agreed\n                    Period”.81     In an attempt to overcome the above finding,\n                    Mr Chan submitted that the reinstatement of the “Agreed Period” to\n                    clause 8A.5 in the Second Supplementary SSA was a mere clerical mistake. I\n                    disagreed. First, there was no evidence to support such an alleged mistake. None\n                    of the parties to the SSA had alleged any mistake. It certainly did not lie in\n                    the mouth of a non-party of the SSA to allege such a mistake. Second, given the\n                    history behind the various amendments to clause 8A.5, specifically in relation\n                    to the “Agreed Period”, it was clear from the objective evidence\n                    before me that it wasdeliberatelyreintroduced to\n                    restrict Prosperity’s entitlement to the FSS provided the Contingent\n                    Liabilities became crystallized within the “Agreed\n                Period”.82     As regards Mr Chan’s alternative\n                    submission that the reference to the “Agreed Period” in clause\n                    8A.5 was superfluous, counsel for the Scheme Administrator, Mr Tan Cheng Han SC\n                    (“Mr Tan SC”), raised three succinct and cogent reasons why this\n                    could not have been the case:(a)     He first pointed out that although\n                        Recital F of the SSA referred to both “Contingent Liabilities”\n                        and “Contingent Creditors”, conspicuously, it was not\n                        qualified by any reference to the “Agreed Period”. He reasoned\n                        that although the “Contingent Creditors” might be bound to\n                        receive the “Contingent Conversion Shares”duringandafterthe “Agreed Period”, Prosperity’s rights under clause\n                        8A.5 of the SSA to receive the FSS, on the other hand, was restricted only\n                        if the Contingent Creditors became bound to receive the Contingent\n                        Conversion Shares within the “Agreed Period”. In other words,\n                        the “Agreed Period” only governed the allotment of FSS between\n                        Prosperity and Abterra.(b)     Further, Mr Tan SC added that under clause 8A.8 of the\n                        SSA, the directors of Abterra who were connected directly or indirectly with\n                        Prosperity were required to abstain in any discussion in dealing with the\n                        “Contingent Creditors” or “Contingent\n                        Liabilities” or “Crystallized Liabilities” because\n                        Prosperity’s entitlement to the FSS was dependent on whether and when\n                        crystallization of the Contingent Liabilities occurs. It would therefore\n                        follow that the reinstatement of the “Agreed Period” in clause\n                        8A.5 was intentional so as to restrict Prosperity’s entitlement to the\n                        FSS.(c)     For this\n                        reason, it was brought to my attention that of the two allotments, the first\n                        allotment of 3,043,800 Contingent Conversion Shares was within the\n                        “Agreed Period” while the second and significantly larger\n                        allotment for 121,891,311 Contingent Conversion Shares wasoutsidethe “Agreed Period”.\n                        Consistent with the purpose of reinstating the “Agreed Period”\n                        to clause 8A.5, Prosperity’s entitlement to the FSS wasin factrestricted by the actual timings in the\n                        allotments of the Contingent Conversion Shares.83     Further, and more importantly, I find that the\n                    purpose of clause 8A.5 was to maintain Prosperity’s 70% shareholding in\n                    Abterra and to ensure that such 70% shareholding was not diluted by the issuance\n                    of the Contingent Conversion Shares to the Contingent Creditors. This was clear\n                    from the ratio of FSS to the Contingent Conversion Shares as stipulated in\n                    clause 8A.5 as well as clause 4.2 of the SSA which provided as follows:4.2Subject to the terms and conditions of [the SSA],\n                            [Abterra] shall issue and allot on Completion the Strategic Shares, each\n                            Strategic Share at the Deemed Strategic Share Issue Price such that the\n                            number of Strategic Shares in the capital of [Abterra] to be issued is\n                            equivalent to 70% of the enlarged share capital of [Abterra] (such\n                            enlarged issued share capital to be ascertained after taking into\n                            account the Strategic Shares, the Unsecured Conversion Shares and the\n                            Secured Conversion Shares).[emphasis added]84     Although the 2007 UOB claim was technically\n                    within the “Agreed Period”, Prosperity nonetheless had no right to\n                    request for the FSS because by the time the 2007 UOB claim became crystallized,\n                    Prosperity had already sold 65% of its shares to GNR. The shares were sold by\n                    Prosperity to GNR one yearpriorto the\n                    crystallization of the 2007 UOB claim, pursuant to the SPA entered into on 1\n                    September 2006.85     For the above reasons, I found that Prosperity\n                    was, in any event, not entitled to the FSS under clause 8A.5 of the\n                SSA.Was the right to the FSS transferred to GNR pursuant to the\n                SPA?86     This issue would only arise for determination\n                    if Prosperity was found to be entitled to claim for the FSS in spite of the\n                    allotment of the Contingent Conversion Shares outside the “Agreed\n                    Period” or that Prosperity had since ceased to own 70% of the Abterra\n                    shares.87     As explained above, 65% of the Abterra shares\n                    were sold by Prosperity to GNR pursuant to the SPA on 1 September 2006, one yearpriorto the expiration of the “Agreed\n                    Period”. Was there any compelling reason why the right to the FSS had not\n                    been transferred to GNR pursuant to the SPA? In this regard, the Receiver\n                    submitted that the right to the FSS was not transferred to GNR since consent had\n                    not been obtained from Abterra in breach of clause 10.3 of the SSA which\n                    provided as follows:10.3No Party may assign or transfer all or part of\n                            its rights or obligations under this Agreement without the consent in\n                            writing of the other Party.88     In my view, such a breach did not affect the\n                    validity of the transfer. Furthermore, the breach was for Abterra to object to\n                    and I have noted that no such objection was ever raised by Abterra. As was\n                    correctly pointed out by counsel for GNR, Mr Chew Kei-Jin, the plaintiff’s\n                    lack oflocus standiwas equally relevant in this\n                    context. The Receiver was essentially seeking a declaration on the construction\n                    of certain clauses of the SPA, to which Tan Holdings was not a party\n                to.89     Nonetheless, under clause 2.1 of the SPA (see[28]above), all the rights, benefits\n                    and entitlements attaching to the shares were transferred to GNR upon sale. Such\n                    rights, benefits and entitlements clearly included the right to the FSS. It must\n                    be right as a matter of construction since the FSS did not exist independently\n                    without reference to the shares in Abterra.90     There was no merit in Mr Chan’s\n                    submission that the right to the FSS could not have been transferred to GNR\n                    because there was no evidence that GNR was even aware of the FSS at the time of\n                    the sale. The right to the FSS was a contractual right arising from the SPA.\n                    Such a right exists as a matter of construction of the terms of the SPA and not\n                    upon the subjective knowledge of GNR. On a true construction of clause 2.1 of\n                    the SPA, it clearly covered all rights, benefits and entitlements attaching to\n                    the shares including the right to the FSS.Conclusion91     In summary, I found that:(a)the Receiver lackedlocus\n                                standito claim for the FSS;(b)on a true construction of clause 8A.5 of the SSA,\n                            Prosperity no longer had the right to claim for the FSS;\n                        and(c)the right to the FSS, if any, had been\n                            transferred from Prosperity to GNR under the SPA.92     In the result, I dismissed the\n                    Receiver’s application with costs fixed at $25,000 payable to Abterra\n                    together with reasonable disbursements and $10,000 payable to GNR inclusive of\n                    disbursements.",
        "Was the right to the FSS transferred to GNR pursuant to the\n                SPA?": "86     This issue would only arise for determination\n                    if Prosperity was found to be entitled to claim for the FSS in spite of the\n                    allotment of the Contingent Conversion Shares outside the “Agreed\n                    Period” or that Prosperity had since ceased to own 70% of the Abterra\n                    shares. 87     As explained above, 65% of the Abterra shares\n                    were sold by Prosperity to GNR pursuant to the SPA on 1 September 2006, one yearpriorto the expiration of the “Agreed\n                    Period”. Was there any compelling reason why the right to the FSS had not\n                    been transferred to GNR pursuant to the SPA? In this regard, the Receiver\n                    submitted that the right to the FSS was not transferred to GNR since consent had\n                    not been obtained from Abterra in breach of clause 10.3 of the SSA which\n                    provided as follows: 10.3No Party may assign or transfer all or part of\n                            its rights or obligations under this Agreement without the consent in\n                            writing of the other Party. 88     In my view, such a breach did not affect the\n                    validity of the transfer. Furthermore, the breach was for Abterra to object to\n                    and I have noted that no such objection was ever raised by Abterra. As was\n                    correctly pointed out by counsel for GNR, Mr Chew Kei-Jin, the plaintiff’s\n                    lack oflocus standiwas equally relevant in this\n                    context. The Receiver was essentially seeking a declaration on the construction\n                    of certain clauses of the SPA, to which Tan Holdings was not a party\n                to. 89     Nonetheless, under clause 2.1 of the SPA (see[28]above), all the rights, benefits\n                    and entitlements attaching to the shares were transferred to GNR upon sale. Such\n                    rights, benefits and entitlements clearly included the right to the FSS. It must\n                    be right as a matter of construction since the FSS did not exist independently\n                    without reference to the shares in Abterra. 90     There was no merit in Mr Chan’s\n                    submission that the right to the FSS could not have been transferred to GNR\n                    because there was no evidence that GNR was even aware of the FSS at the time of\n                    the sale. The right to the FSS was a contractual right arising from the SPA.\n                    Such a right exists as a matter of construction of the terms of the SPA and not\n                    upon the subjective knowledge of GNR. On a true construction of clause 2.1 of\n                    the SPA, it clearly covered all rights, benefits and entitlements attaching to\n                    the shares including the right to the FSS.",
        "Conclusion": "91     In summary, I found that: (a)the Receiver lackedlocus\n                                standito claim for the FSS;(b)on a true construction of clause 8A.5 of the SSA,\n                            Prosperity no longer had the right to claim for the FSS;\n                        and(c)the right to the FSS, if any, had been\n                            transferred from Prosperity to GNR under the SPA.92     In the result, I dismissed the\n                    Receiver’s application with costs fixed at $25,000 payable to Abterra\n                    together with reasonable disbursements and $10,000 payable to GNR inclusive of\n                    disbursements."
    }
}