{
    "case_title": "Public Prosecutor\n      v\n      Tay Sheo Tang Elvilin",
    "ncitation": "[2011] SGHC 141",
    "coram": "V K Rajah JA",
    "sections": {
        "Introduction": "1       This is an appeal by the Prosecution against\n                    sentence. The respondent, a 35-year-old police officer holding the rank of\n                    Sergeant, claimed trial to five charges under s 6(b) of the Prevention of Corruption Act (Cap 241,\n                    1993 Rev Ed) (“the Act”). Four of these charges were for\n                    corruptly giving gratification to four of his fellow police officers as\n                    inducement for forbearing to report him to his supervisor for misappropriating a\n                    wallet containing a stack of $50 notes and a carton of cigarettes which were\n                    found during an unscheduled raid. The remaining charge was for corruptly\n                    offering gratification to another fellow police officer for the same\n                    purpose. 2       The punishment prescribed for an offence of\n                    corruptly offering or giving gratification under s 6(b) of the Act is imprisonment of a term of up to five years, or\n                    a fine up to $100,000, or both. The appellant has no criminal\n                    antecedents. 3       A District Judge (“DJ”) found that\n                    the Prosecution had proved its case against the respondent beyond reasonable\n                    doubt on the five charges. Accordingly, she convicted and sentenced the\n                    respondent to three months’ imprisonment for each of the five charges,\n                    with the sentences for two charges ordered to run consecutively, making a total\n                    sentence of six months’ imprisonment. 4       I allowed the Prosecution’s appeal and\n                    enhanced the sentence for each of the five charges before me to six monthsper charge, with the imprisonment sentences\n                    for three of the charges to run consecutively to give an aggregate sentence of\n                    18 months’ imprisonment. These are my detailed grounds of decision that\n                    explain why I allowed the Prosecution’s appeal.",
        "Factual background": "5       The detailed facts of this case have already\n                    been comprehensively set out by the DJ in her grounds of decision atPublic Prosecutor v Tay Sheo Tang Elvilin (Zheng Shaodong,\n                        Elvilin)[2011] SGDC 27. I will therefore set out only the\n                    salient facts which are necessary for an understanding of the context of the\n                    present appeal. 6       The respondent initiated an unscheduled raid on\n                    24 January 2009 to arrest illegal immigrants in the forested area near the\n                    Seletar Range (“the forested area”). During this raid, which\n                    involved three other officers, a number of makeshift huts were found. Upon\n                    searching the huts, the respondent found a carton of contraband cigarettes and a\n                    wallet containing a stack of $50 notes. He removed the money, and threw the\n                    wallet into the bushes. Upon leaving the scene, he also took the carton of\n                    cigarettes with him. Only one police officer, Woman Sergeant Norhasidah binte\n                    Mohamed Said (“WSgt Norhasidah”), knew that the respondent had\n                    found and misappropriated the two items. The respondent instructed WSgt\n                    Norhasidah to lodge the arrest report for an illegal immigrant arrested in this\n                    raid “as per normal”[note: 1]–\n                    her eventual report stated that the arrest had taken place along Upper Thompson\n                    Road, and not in the forested area. It also did not mention the items which were\n                    misappropriated by the respondent. 7       That afternoon, the respondent took out some\n                    packets of cigarettes at the Neighbourhood Police Post (“NPP”)\n                    rest area in the presence of three other officers. He told them that he had\n                    found these contraband cigarettes in the forested area and intended to give them\n                    to another officer as a present. The respondent then offered Staff Sergeant\n                    Zulkifli bin Mohamad (“SSgt Zulkifli”), who was his group\n                    leader and an officer of superior rank, $50 in exchange for his silence about\n                    the respondent’s actions, but the respondent was rebuffed. The respondent\n                    then gave $50 to the two other officers present and told them not to disclose to\n                    anyone what had transpired in the forested area. 8       When the respondent met WSgt Norhasidah\n                    later, he also gave her $50 and told her not to reveal what had happened in the\n                    forested area. He also gave her another $50 to hand to another officer involved\n                    in the raid, stating that this was to keep him quiet. WSgt Norhasidah later\n                    handed the money to that officer. These four gifts and one offer of $50 were the\n                    subject of the five charges of corruption which the respondent was convicted\n                    on.",
        "The DJ’s decision": "9       The DJ rightly acknowledged that the aggravating\n                    factors in this case were serious and that there were substantial and compelling\n                    circumstances that justified the imposition of a deterrent sentence here,\n                    especially since the respondent’s behaviour resulted in the corruption of\n                    four fellow officers and compromised their police duties. 10     Nevertheless, she felt that the facts of this\n                    case were distinguishable from the precedent cases where sentences of nine\n                    months and above had been imposed. She observed that the sentences of nine\n                    months’ imprisonment and upwards were often imposed in cases which\n                    involved more serious corrupt conduct on the part of the police officers as\n                    compared to the corrupt conduct in this case. 11     Here, the respondent’s corrupt conduct\n                    did not involve solicitation of gratification from members of public, and\n                    therefore did not publicly undermine the integrity of the police force. The\n                    respondent also did not compromise any police investigations or operations.\n                    Further, while the respondent was mainly motivated by greed when he corrupted\n                    the four junior officers, his conduct was not as serious as the conduct of those\n                    officers who blatantly and deliberately assisted illegal moneylenders, importers\n                    of uncustomed goods or owners of massage establishments in escaping criminal\n                    liability. 12     Hence, the DJ sentenced the respondent to\n                    three months’ imprisonment on each of the five charges, with two charges\n                    ordered to run consecutively, making a total sentence of six months’\n                    imprisonment.",
        "The Prosecution’s case": "13     The Prosecution forcefully contended that the\n                    DJ had erred in her approach. In particular, the Prosecution submitted that the\n                    DJ had failed to accord due weight to the aggravating factors surrounding the\n                    commission of the offences (despite correctly identifying them), and this\n                    resulted in her finding that the present case was not as serious as the\n                    precedent cases and in her failure to appreciate the serious adverse impact of\n                    the appellant’s corrupt acts. 14     My attention was also drawn to the cases ofLim Poh Tee v Public Prosecutor[2001] 1\n                    SLR(R) 241 (“Lim Poh Tee”), where\n                    the fact that a police officer drew two junior officers into a web of corruption\n                    was regarded by the Court as being highly aggravating, andPandiyan Thanaraju Rogers v Public Prosecutor[2001] 2 SLR(R)\n                    217 (“Pandiyan Thanaraju Rogers”),\n                    where a police officer accepted $2,000 as a bribe from a moneylender in exchange\n                    for future help in police matters. InPandiyan Thanaraju\n                        Rogers, Yong Pung How CJ observed at [49] that in recent\n                    cases, the sentences meted out to police officers convicted of corruption have\n                    ranged from nine months and upwards, before dismissing the police\n                    officer’s appeal against sentence and enhancing the sentence to nine\n                    months’ imprisonment. 15     While acknowledging that the benchmark for\n                    members of the public offering bribes to police officers is between six\n                    weeks’ to three months’ imprisonment, the Prosecution submitted that\n                    the present case should be distinguished as the respondent himself was the\n                    offender in question, and was a police officer of some seniority, holding the\n                    rank of Sergeant. The Prosecution submitted that the sentence should be enhanced\n                    to nine months’ imprisonment per charge, and that three sentences should\n                    run consecutively as general deterrence is the most important consideration for\n                    such offences. 16     In response, the respondent, who was\n                    unrepresented, pleaded that he had been adequately punished and the amounts\n                    involved were small.",
        "The Court’s decision on sentence": "17     I agreed with the Prosecution that the DJ had\n                    failed to accord due weight to the aggravating factors surrounding the\n                    commission of the offences, which were: (a)     the offences involved a serious\n                        abuse of position and betrayal of public trust by a police officer who had\n                        committed criminal misappropriation of property during a police raid when he\n                        was expected to uphold the law with integrity; (b)     the respondent perverted the course of justice\n                        when he went a step further to instigate his fellow police officers to act\n                        contrary to their enforcement duties by offering them bribes so that they\n                        would conceal the crime he had committed. I also note that the respondent\n                        had sufficient time, from the time he found the items in the forested area\n                        in the morning of 24 January 2009 until he showed the cigarettes to his\n                        fellow police officers at the NPP rest area in the afternoon of the same\n                        day, to report the items he found in accordance with proper police\n                        procedure, but he made a conscious decision not to do so; (c)     the respondent initiated and organised\n                        the unscheduled raid, and decided to misappropriate the items found in the\n                        raid instead of reporting the exhibits in accordance with police\n                        procedure; (d)     the\n                        respondent preyed on the vulnerability of the illegal immigrants as he would\n                        be aware, as a police officer, that it would be very difficult for them to\n                        prove that the items had been wrongfully removed from their makeshift huts.\n                        Moreover, given their status as illegal immigrants, they were also unlikely\n                        to report the loss of the items to the authorities and thereby expose his\n                        misconduct; and (e)     the respondent was brazen in distributing his ill-gotten proceeds and\n                        enticing his fellow police officers with bribes in the very place where the\n                        sanctity of the law is supposed to be upheld – a police\n                        station. 18     More importantly, the DJ erred in finding that\n                    the present case was distinguishable from the precedent cases where sentences of\n                    nine months and above had been imposed because the offence in question here was\n                    of a less serious nature. 19     InPublic Prosecutor v\n                        Loqmanul Hakim bin Buang[2007] 4 SLR(R) 753\n                        (“Loqmanul Hakim bin Buang”), I\n                    observed at [43] and [76] that: 43    … Public confidence in the enforcement\n                            agencies can be corroded by the irresponsible criminal acts of\n                            avaricious, reckless and foolish like offenders.The\n                                abuse of the trust and confidence placed in CISCO and/or police\n                                officers, if left unchecked, could result in enforcement agencies,\n                                in general, having diminished legitimacy and public\n                                acceptance. … 76    As the guardians and enforcers of the law, law\n                            enforcement and/or security officers are not only expected to enforce\n                            and maintain the lawvis-à-visothers, but\n                            are expected to conduct themselves in a befitting manner that would\n                            uphold their legitimacy to enforce such laws. It should be intuitively\n                            commonsensical that the members of the police force and auxiliary police\n                            force must be seen toobeythe law\n                            themselves if they are to possess any legitimacy inupholdingit. [emphasis in original, emphasis added in bold italics] 20     Although the respondent’s corrupt\n                    conduct did not involve solicitation of gratification from members of public,\n                    this did not mean the integrity of the police force was not being seriously\n                    undermined. Corruption within the police force is no less serious than\n                    corruption involving the solicitation of gratification by a police officer from\n                    members of the public, and both have the effect of publicly undermining the\n                    integrity of the police force. Indeed, if anything, it is even more disturbing.\n                    If police officers such as the respondent who engage in corrupt activities\n                    within the police force itself to cover up their wrongdoings are left unchecked,\n                    the abuse of trust and confidence placed in the police force could, as pointed\n                    out inLoqmanul Hakim bin Buang, result in\n                    enforcement agencies, in general, having diminished legitimacy and public\n                    acceptance. 21     The DJ erred in concluding that because the\n                    respondent did not compromise any police investigations or operations or\n                    interfere with the proper administration of justice, his conduct was less\n                    odious. Here, the respondent had blatantly instigated his fellow police officers\n                    to commit several breaches of police procedure and to compromise their duties in\n                    the course of police operations. For example, not only did the respondent\n                    instruct WSgt Norhasidah to lodge an inaccurate record of the raid, he also\n                    made repeated attempts to offer a bribe to his group leader and superior\n                    officer, SSgt Zulkifli, so that the latter would “keep quiet”\n                    about the respondent’s illegal actions. It was unfortunate that the\n                    respondent eventually succeeded in bribing some of his fellow police officers so\n                    that they would remain silent about his reprehensible actions.Such corrupt conduct by a police officer must be unequivocally\n                        denounced as it will have an adverse effect on the discipline of the police\n                        force and the proper administration of justice. 22     I also disagreed with the DJ’s finding\n                    that the respondent’s conduct was not as serious as the conduct of those\n                    officers in the precedent cases who flagrantly assisted illegal moneylenders,\n                    importers of uncustomed goods or owners of massage establishments to escape\n                    criminal liability. The very purpose of the respondent’s actions in\n                    bribing his fellow police officers was to facilitate and conceal his own\n                    criminal act of misappropriating the items found in the raid.More importantly, the serious adverse impact of the respondent’s\n                        conduct in drawing his fellow police officers into this “web of\n                        corruption” cannot be underestimated. With the exception\n                    of SSgt Zulkifli, all the other police officers were junior in rank to the\n                    respondent; indeed, one of the police officers was a young policeman serving his\n                    national service at the material time. Instead of setting a good example to\n                    these junior officers, the respondent cloaked his corrupt behaviour with a veil\n                    of normalcy and acceptability by intimating that wrongdoing in the police force\n                    could be tolerated. The respondent informed them that such conduct could be\n                    concealed because “if everyone keeps quiet then nothing will\n                        happen”.[note: 2]I agreed with the Prosecution\n                    that the deplorable attitude and conduct displayed by the respondent must be\n                    unequivocally denounced and nipped in the bud. Condign punishment was\n                    required. 23Lim Poh Teemade\n                    it clear that stiff sentences will be imposed when police officers draw fellow\n                    officers into a web of corruption within the police force. In that case, the\n                    Court observed,inter alia, that it was\n                    “highly reprehensible” and an aggravating factor that the police\n                    officer intentionally drew two junior officers into the web of corruption and\n                    accordingly rendered more police officers beholden to the corrupt gratification\n                    given by one Chua Tiong Tiong, a notorious illegal moneylender (at[31]). 24     Here, as inLim Poh\n                        Tee, not only did the respondent misappropriate the money and\n                    cigarettes while on duty as a police officer, he took the further step of\n                    corrupting the junior officers in his team who would have regarded him as a role\n                    model and for guidance. It was precisely because the junior officers looked up\n                    to him that all of them complied with his instructions to keep quiet about what\n                    had happened at the forested area in breach of their solemn duties as police\n                    officers. If not for an unnamed informant who stepped up to do the right thing,ie, report the respondent’s actions to\n                    the Corrupt Practices Investigations Bureau, the respondent’s corrupt\n                    actions may not have seen the light of the day. A sentencing court should bear\n                    in mind that offences of this nature that are often hard to detect and that is a\n                    factor which must factor in the sentencing equation (see\n                        Public Prosecutor v Law Aik Meng[2007] 2 SLR(R) 814 at [27]). 25     I note with interest that the approach adopted\n                    here is not dissimilar to that taken in other jurisdictions. They usually come\n                    down hard on corruption in law enforcement agencies such as the police\n                    force. 26     InR. v Mark Edward\n                        Bohannan[2010] EWCA Crim 2261, where a police officer provided\n                    assistance to a drug-dealer in his drug-dealing activities in return for a free\n                    supply of cocaine for the consumption of the officer’s wife and also cash\n                    payments, the English Court of Appeal (Criminal Division) declared at [64]\n                    that: First, punishment and deterrence are always important elements …not only must police officers be deterred from\n                            misconduct, but also the public must see that condign punishment will be\n                            visited on police officers who betray the trust reposed in them and do\n                            not live up to the high standards of the police service.\n                        Secondly,an incentive (usually money but it need not be)\n                            inevitably increases the seriousness of the offence. Third,\n                        misconduct, which encourages or permits criminals to behave in the belief\n                        that they will be kept informed of areas to avoid in connection with their\n                        criminal activities, or of those who might be informing on the police also\n                        increases its gravity … Fourth, any misconduct that impacts on police\n                        operations moves the offence into a different category of gravity. [emphasis\n                        added] 27     InDirector of Public\n                        Prosecutions v Mark Armstrong[2007] VSCA 34, a police officer\n                    engaged in corrupt behaviour in dealing with criminals by extorting money from\n                    them in return for the police officer’s silence about their criminal\n                    activities. In enhancing the sentence meted out to the police officer, the Court\n                    of Appeal of the Supreme Court of Victoria held at [34]–[35] that; 34    Corruption in those responsible for enforcing the\n                            law has significant social consequences. As was discussed by the learned\n                            sentencing judge,it may undermine public confidence\n                                in the police force, erode the morale of honest police officers and\n                                encourage other police to turn a blind eye to similar behaviour. The\n                                community is entitled to rely on the integrity of members of the\n                                police force in investigating and prosecuting offenders.\n                            Mr Armstrong's moral culpability is not reduced because, as counsel\n                            for the respondent put it, Mr On and Mr Coombes were not\n                            “lily whites” themselves. 35    The temptation to extort money or abuse power is\n                            likely to be considerable when police are dealing with offenders who are\n                            reluctant to complain about corruption, because this will reveal that\n                            they themselves had committed offences. For this reason corrupt\n                            practices in dealing with criminals may be even more insidious than the\n                            corruption which affects honest members of the community, who are more\n                            likely to report police attempts to extort money from them.Sentences imposed for such offences must reflect public\n                                denunciation of the behaviour of the offender and deter other police\n                                from committing similar offences. General deterrence must therefore\n                                be given significant weight in sentencing a member of the police\n                                force for offences involving corruption or\n                            extortion. [emphasis added] 28     A similarly stiff approach was also adopted by\n                    the Hong Kong Court of Appeal inHKSAR v Lau Kwowk &\n                        others[2003] HKEC 674. In that case, two police officers\n                    participated in an elaborate and well-planned scheme to help several suspects in\n                    a wounding case avoid conviction in return for cash payments for their\n                    “efforts”. In dismissing the police officers’ appeal against\n                    their sentences of four years’ imprisonment respectively, the Court held\n                    at [35]–[36] that: 35.    A1 and A2 were both police officers. A2 was the\n                            investigating officer in the wounding case. Instead of carrying out\n                            their duties properly, they chose to assist suspects to escape justice\n                            for monetary rewards. What they did had the result of allowing criminals\n                            in a wounding case to go unpunished.What A1 and A2\n                                did is despicable. It is an affront to the rule of law and the\n                                administration of justice. It must be\n                        deterred. 36.    With respect, the judge was fully justified in\n                            imposing heavier sentence on A1 and A2. [emphasis added] The Court concluded with the important observation at [50]\n                    that: 50.    Integrity of law enforcement officers is the\n                            linchpin of the proper administration of justice and the corner stone of\n                            a just and fair society.Law enforcement officers who\n                                abuse their positions and conspire to defeat the end of justice must\n                                be punished severely or else the confidence of the public cannot be\n                                maintained. [emphasis added] 29     In light of the above considerations, it was\n                    clear that the actions of the respondent were at the very least as serious as\n                    the precedent cases involving the corruption of police officers even though the\n                    amounts involved were small.I was satisfied that a stiff\n                        custodial sentence was necessary in the present case so as to send a clear\n                        message to other serving officers that such transgressions will not be\n                        condoned and that there is no place for any form of corruption in our\n                        enforcement agencies. 30     InADF v Public Prosecutor\n                        and another appeal[2010] 1 SLR 874, I stated at [146]\n                    that: A decision to impose more than two consecutive sentences ought not to be\n                        lightly made and, indeed, should usually only be imposed in compelling\n                        circumstances. … On the other hand, the totality principle cannot be\n                        unthinkingly invoked to minimise punishment for those who maliciously pursue\n                        a deliberate course of criminal behaviour. … [A]n order formore thantwo sentences to run consecutively ought\n                        to be given serious consideration in dealing with distinct offenceswhen one or more of the following circumstances are\n                            present, viz: (a)    dealing with persistent or habitual offenders\n                            … ; (b)there is a pressing public\n                                interest concern in discouraging the type of criminal conduct being\n                                punished… ; (c)    there are multiple victims; and (d)    other peculiar cumulative aggravating features are\n                            present ... In particular, where the overall criminality of the\n                            offender's conduct cannot be encompassed in two consecutive sentences,\n                            further consecutive sentences ought to be considered. I\n                        reiterate that the above circumstances are non-exhaustive and should not be\n                        taken as rigid guidelines to constrain or shackle a sentencing court's\n                        powers. [emphasis in original, emphasis in bold italics added] In the present case, there is a clear pressing public interest concern\n                    in discouraging the type of criminal conduct being punished,ie, corruption within law enforcement agencies. In the\n                    circumstances, I find that this is an appropriate case whereby more than two\n                    sentences imposed on the respondent ought to run consecutively.",
        "Conclusion": "31     In the result, I allowed the appeal and set\n                    aside the DJ’s sentence, substituting it with a sentence of six\n                    months’ imprisonment for each of the five charges. The sentences for\n                    District Arrest Case Nos 61472, 61473 and 61474 of 2009 were to run\n                    consecutively, making a total sentence of 18 months’ imprisonment. These\n                    sentences reflect society’s particular condemnation for such offences,\n                    which if unchecked, could corrode the integrity and high standing of the police\n                    force.  [note: 1]See Record of\n                                Proceedings, pp 326, 350 and 420. [note: 2]Record of Proceedings,\n                                p 379."
    }
}