{
    "case_title": "PMA Credit Opportunities Fund and others\n      v\n      Tantono Tiny (representative of the estate of Lim Susanto,\n                deceased)",
    "ncitation": "[2011] SGHC 89",
    "coram": "Woo Bih Li J",
    "sections": {
        "Introduction": "1       The Respondents in this action applied in\n                    Summons No 4095 of 2010 for summary judgment against the Appellant, the estate\n                    of the late Susanto Lim (“Susanto”), for a total sum of\n                    S$133,478,558.52 (as at 15 July 2009) due to the Respondents under a Deed\n                    of Personal Guarantee No 284 dated 20 December 2006 (“the\n                    PG”). On 14 January 2011, an Assistant Registrar\n                    (“AR”) granted summary judgment in favour of the\n                    Respondents. 2       The Appellant then appealed to this Court in\n                    Registrar’s Appeal No 18 of 2011 (“RA 18/2011”) to set aside\n                    the order made by the AR for summary judgment or, alternatively, to give the\n                    Appellant unconditional leave to defend. 3       I heard the appeal on 2 March 2011 and dismissed\n                    it. 4       An appeal has been filed to the Court of Appeal\n                    by the Appellant against my decision. I shall state my reasons for my decision\n                    after recounting the salient facts.",
        "Facts": "",
        "Parties": "5       PMA Credit Opportunities Fund, PMA Temple Fund\n                    and Diversified Asian Strategies Fund are the First, Second and Third\n                    Respondents respectively. They are investment funds registered in the Cayman\n                    Islands. 6       The Fourth Respondent, Arch Advisory Limited, is\n                    a limited liability company incorporated in Labuan and in the business of\n                    providing securities, investment advisory and financial planning services. The\n                    Fifth Respondent, Goldman Sachs Foreign Exchange (Singapore) Pte, is a limited\n                    liability company incorporated in Singapore and in the business of providing\n                    financial advisory, securities brokerage and investment management services. The\n                    Sixth Respondent, Standard Chartered Bank, is a limited liability company\n                    incorporated in England and Wales and in the business of providing banking and\n                    other financial services. The Seventh Respondent, Intertrust (Singapore) Limited\n                    (formerly known as Fortis Intertrust (Singapore) Limited) is a limited liability\n                    company incorporated in Singapore and in the business of providing corporate,\n                    private wealth management and other specialised services. 7       The Appellant, Tiny Tantono\n                    (“Tiny”), is the widow of the late Susanto. Susanto passed away in\n                    Singapore on 15 October 2009. By an Order of Court dated 9 April 2010\n                    (as varied by an Order of Court dated 27 May 2010), Tiny was joined as a\n                    Defendant (now Appellant) in this action as the representative and heir of the\n                    estate of the late Susanto. The order further stated that the proceedings in\n                    this action be carried on and maintained against Tiny as if she had been\n                    substituted for Susanto. 8       Susanto was an experienced and wealthy\n                    Indonesian businessman, reported by Forbes to be amongst the top 100 richest\n                    individuals in Indonesia in 2007. He was the indirect beneficial owner and chief\n                    executive officer of the Sawit Mas Group, a conglomerate specialising in\n                    oleochemicals and palm oil products.",
        "Background": "9       By an agreement dated 15 December 2006 (the\n                    “Facility Agreement”), the First Respondent extended a US$140\n                    million syndicated loan facility (“the Facility”) to one Palm\n                    Optics Enterprise Pte Ltd (the “Borrower”). The Borrower is part\n                    of the Sawit Mas Group. The Sixth and Seventh Respondents were the Onshore and\n                    Offshore Security Agents respectively under the Facility Agreement. The First to\n                    Fifth Respondents are Lenders under the Facility Agreement. 10     In consideration for the Facility, Susanto\n                    furnished the PG in favour of the Sixth Respondent, acting as a Security Agent\n                    for the beneficiaries (defined by Art 1.1 of the PG to include the First to\n                    Fifth Respondents and the Seventh Respondent). 11     Article 2 of the PG states: 2.1The Guarantor ... guarantees to the Security Agent\n                            for and on behalf of the Beneficiaries, the due and punctual payment by\n                            [the Borrower] of the Secured Obligations and absolutely, irrevocably\n                            and unconditionally undertakes to pay the Secured Obligations as his own\n                            debt to the Security Agent for and on behalf of the Beneficiaries\n                            forthwith upon first written demand by the Security Agent in the\n                            currency and in the manner required of the Borrower\n                        thereunder. 2.2The Guarantor ... agrees as a primary obligation\n                            and not as sureties only... (b) to indemnify each of the Beneficiaries\n                            against any loss, cost or expense (including legal fees on a full\n                            indemnity basis) which they (or any one or more of them) may sustain or\n                            incur as a consequence of any default or whatsoever nature by [the\n                            Borrower] in the performance of the obligations expressed to be assumed\n                            by [the Borrower] under or in connection with any Finance\n                            Document... 2.4Notwithstanding any provision of any of the\n                            Finance Documents, the Guarantor... as primary obligor, and not as\n                            sureties only, agrees that the Beneficiaries shall be entitled to\n                            recover from the Guarantor all amounts due from [the Borrower] to the\n                            Beneficiaries under or in connection with any Finance\n                        Document. 12     In addition, Art 18 of the PG provides that\n                    Susanto shall indemnify and hold harmless, on first demand, all of the\n                    Respondents against any and all actions, claims, demands, proceedings,\n                    judgments, causes of action, losses, liabilities, costs, charges and expenses\n                    (including without limitation all services, value added and other duties or\n                    taxes payable on such costs, charges and expenses) which may be suffered or\n                    incurred by any of them as a result of: (a)     any breach of warranties or\n                        undertakings made or assumed by Susanto under the PG; (b)     the existence or use of rights\n                        conferred on, amongst others, the Respondents under the PG;\n                    and (c)     the perfection,\n                        exercise, enforcement or the preservation of any rights under the PG, or any\n                        other matter arising out of or in connection with the\n                PG. 13     Art 24 of the PG provides that the PG shall be\n                    governed by and construed in accordance with the laws of the Republic of\n                    Indonesia. 14     Tiny signed a Spousal Consent to the PG on the\n                    day that Susanto signed the PG. 15     Following the execution of the Facility\n                    Agreement, the Borrower drew down the following sums under the Facility\n                    Agreement: (a)     on or about 7 and 14 February\n                        2007, the sums of US$56 million and US$2 million respectively under a\n                        facility; and (b)     on or about 7 February 2007, the sum of US$70 million under another\n                        facility. 16     On or about 7 November 2008, an amount of\n                    US$1,508,000 of principal and US$2,876,001.93 of interest fell due and payable\n                    under the Facility Agreement. The Borrower defaulted on its obligation under the\n                    Facility Agreement to pay the sums. 17     Despite demands made by the Seventh\n                    Respondent, as a Security Agent, on 19 November 2008 and 6 January\n                    2009 to the Borrower (copied to Susanto), the Borrower failed to satisfy the\n                    outstanding amounts due. By Notices of Demand dated 5 May 2009 and\n                    13 May 2009 issued by the Sixth Respondent, as a Security Agent, to\n                    Susanto, the Respondents demanded payment from Susanto of the sum of\n                    US$122,780,000 and interest of US$6,656,517.27 then due and outstanding under\n                    the Facility for which he was liable under the PG. Susanto did not respond to\n                    the Notices of Demand. 18     Consequently, on 3 August 2009, this\n                    action was formally commenced against Susanto. He entered an appearance through\n                    his then solicitors Drew & Napier LLC on 22 September 2009. However, on\n                    15 October 2009, he passed away in Singapore. 19     On or about 8 December 2009, the\n                    Respondents received a letter from the Borrower signed by Ferry Tanudjaya,\n                    Susanto’s brother-in-law, requesting the Respondents’ consent to a\n                    proposed sale of shares in various companies and for the PG, including all\n                    antecedent breaches and accrued rights thereunder, to be absolutely and\n                    unconditionally discharged, waived and released. 20     Subsequently, following an Order of Court\n                    dated 9 April 2010 (as varied by an Order of Court dated 27 May 2010),\n                    Tiny was ordered to be substituted as Defendant (now Appellant) to this action\n                    in her capacity as representative of Susanto’s estate. 21     The Defence was filed on 18 June\n                    2010.",
        "Pleaded defences and show cause defences": "22     In the Defence, the Appellant essentially\n                    denied liability under the PG on the following grounds: (a)     The PG is not binding on Susanto. He\n                        did not know how to read or understand English when he signed the PG and the\n                        terms of the PG were not fully and properly explained to him. Under\n                        Indonesian law (Art 24 of the PG), the PG is not enforceable against a\n                        person who could not read and understand the terms of the agreement that he\n                        had signed. (b)     The\n                        PG is not binding on the Appellant under Indonesian law as the Respondents\n                        have failed to fulfil their obligations under the Facility Agreement and\n                        instead, varied the Facility Agreement by way of a letter dated\n                        5 February 2007 without the consent of the\n                Appellant. 23     The Appellant did not provide any particulars\n                    in support of the above defences. 24     However, the Appellant later went on to file\n                    eight affidavits in response to the application for summary judgment, comprising\n                    six factual affidavits and two expert affidavits (“the show cause\n                    affidavits”). 25     In these affidavits, the Appellant alleged\n                    that: (a)     Under Indonesian law, the PG ought\n                        to have been explained or translated by the Notary Public (“the\n                        Notary”) (or a translator) to Susanto, and to Tiny also, before\n                        Susanto executed the PG and before Tiny executed the Spousal\n                    Consent. (b)     Susanto\n                        had only completed primary school education. He spoke primarily Hokkien and\n                        sometimes “pasar bahasa” (ie,\n                        informal Bahasa Indonesia). He did not speak or write formal Bahasa\n                        Indonesia, only “pasar bahasa”. He was not able to speak, read\n                        or write English beyond simple words and phrases like “yes”,\n                        “no”, “good morning” and “how are\n                        you”. (c)     The Notary before whom the PG and a Spousal Consent were signed, did not\n                        read or explain the terms of the PG to Susanto line by line in either\n                        Hokkien or Bahasa Indonesia. Susanto was unaware that the PG created a\n                        primary obligation on him in that the Lenders need not first make reasonable\n                        attempts to enforce the Facility Agreement against the Borrowers before the\n                        PG can be enforced. (d)     The contents of the PG and a Spousal Consent were not read or\n                        explained to Tiny prior to her signing them. She did not know the contents\n                        and legal effect of these documents. 26     The Appellant’s “full”\n                    defence (ie, pleaded defences and show cause\n                    defences combined) to the summary judgment claim may therefore be summarised as\n                    follows: (a)     Defences under Indonesian\n                        law: (i)       procedural defence of the\n                            Notary’s failure to explain or translate line by line the PG to\n                            Susanto and to Tiny; and (ii)       substantive defence of mistake by Susanto in\n                            executing the PG and by Tiny in executing the Spousal\n                        Consent. (b)     Defence that the Appellant had been discharged from any and all obligations\n                        under the PG because the Respondents failed to fulfil their obligations\n                        under the Facility Agreement and because the Respondents unilaterally varied\n                        the Facility Agreement without the Appellant’s consent on\n                        5 February 2007. 27     At the appeal before me, however, the\n                    Appellant did not rely on the allegation that the PG was not binding because the\n                    Respondents had failed to fulfil their obligations under the Facility Agreement\n                    or because of a variation of the Facility Agreement. 28     It must also be noted that the allegation that\n                    the PG was not read or explained to Tiny or that her Spousal Consent was\n                    executed under a mistake was not pleaded in the Defence.",
        "The Issues": "29     At the appeal, the issues which came before me\n                    were: (a)     Must an allegation raised for the\n                        purpose of challenging an application for summary judgment be pleaded in a\n                        Defence? (b)     Did\n                        the Appellant raise any triable issue?",
        "Raising of defences for the purpose of challenging O 14\n                applications": "30     As mentioned above, the allegation in respect\n                    of Tiny was not pleaded in the Defence. 31     At the appeal, counsel for the Respondents\n                    submitted that it is well established that in the absence of any good reason,\n                    the party challenging an O 14, Rules of Court (Cap 322 R5, 2006 Rev Ed)\n                    (“Rules of Court”) application is not entitled to rely on or raise\n                    any unpleaded defence. In support of this principle, counsel for the Respondents\n                    cited two High Court decisions, namelyLim Leong Huat v Chip\n                        Hup Hup Kee Construction Pte Ltd[2008] 2 SLR(R) 786\n                        (“Lim Leong Huat”) andUnited States Trading Co Pte Ltd v Ting Boon Aun[2008]\n                    2 SLR(R) 981 (“United States\n                        Trading”).Lim Leong Huatwas a decision of mine. I delivered the grounds of decision on 25 January\n                    2008 andUnited States Tradingwas a decision of\n                    Judith Prakash J who delivered her judgment on 30 January 2008. These two\n                    cases reversed the previous principle which did not bind the defendant to the\n                    four corners of his pleading (seeLin Securities (Pte) v\n                        Noone & Co Sdn Bhd[1989] 1 MLJ 321\n                        (“Lin Securities”), cited inUnited States Tradingat [24]-[25]). Consequently, theSingapore Court\n                        Practice 2009(Jeffrey Pinsler, SC gen ed) (LexisNexis, 2009)\n                    (“theSingapore Court Practice\n                    2009”) refers to the new principle at para\n                14/3/2A. 32     However, counsel for the Appellant argued that\n                    the principle inLim Leong HuatandUnited States Tradingdid not survive the 2009 case ofPoh Soon Kiat v Desert Palace Inc (trading as Caesars\n                        Palace)[2010] 1 SLR 1129 (“Poh Soon Kiat”). The judgment inPoh\n                        Soon Kiatwas delivered on 8 December 2009. At [15] of that judgment, the Court of Appeal\n                    endorsed the previous principle. The Court of Appeal citedSingapore Civil Procedure 2007(G P Selvam ed) (Sweet &\n                    Maxwell, 2007) (“theSingapore Civil Procedure\n                        2007”) at para 14/2/12: [the appellant] is bound by the four corners of his pleadings [only] at\n                        the trial of the action, but ... not ... [in] the O. 14 proceedings. The only case cited in support of this principle was the case ofLin Securities, which was no longer applicable\n                    in view ofLim Leong HuatandUnited States Trading. 33     It seemed that the Court of Appeal’s\n                    attention was not drawn to the two cases decided afterLin\n                        Securitiesor theSingapore Court Practice\n                        2009. However, its decision was not givenper\n                        incuriamas the two High Court decisions are not binding on the\n                    Court of Appeal (see the judgment of Lord Simon of Glaisdale inMiliangos v Frank (Textiles) Ltd[1976] AC 443\n                    at 477). The decision of the Court of Appeal was binding on me and so the\n                    Appellant was not precluded by its defence from raising the allegation in\n                    respect of Tiny. For completeness, I would add that on 3 March 2010, I\n                    reiterated my decision inLim Leong Huatat\n                        [21] of my decision inHSBC Institutional Trust Services (Singapore) Ltd v Elchemi Assets\n                        Pte Ltd and another[2010] SGHC 67. At that time, I was\n                    not aware of the Court of Appeal’s decision inPoh Soon\n                        Kiaton the same issue. In addition, I have also recently learned\n                    that the same issue was raised inRankine Bernadette Adeline\n                        v Chenet Finance Limited[2011] SGHC 79. The grounds of\n                    decision were delivered by Kan Ting Chiu J on 31 March 2011. Kan J did not\n                    have to decide the issue. Nevertheless, he mentioned at [23] thereof that there is a possibility that\n                    the Court of Appeal would have dealt with the issue differently if its attention\n                    had been drawn toLim Leong HuatandUnited States Tradingand we would have to wait till the\n                    question goes before the Court again to have an answer.",
        "Did the Appellant establish any triable issue?": "34     A defendant has the burden of establishing\n                    that “there is an issue or question in dispute which ought to be\n                    tried” (O 14 r 3 Rules of Court). Put in another way, the Appellant had\n                    the burden of establishing a triable issue to avoid summary\n                judgment. 35     Relying on para 14/4/8 of theSingapore Civil Procedure 2007, counsel for the\n                    Appellant submitted that “[i]f foreign law applies to the contract being\n                    considered, that alone provides sufficient cause for leave to defend to be\n                    granted”. However,Singapore Court Practice\n                        2009at para 14/12/1 reads:- Where a point of law arises out of a foreign law which applies to the\n                        case, the court isreluctantto try the issue\n                        on the basis of affidavit evidence, particularly if there is a hint of legal\n                        complexity. [emphasis added] 36     Furthermore, in the case of “The Hung Vuong-2” [2000] 2 SLR(R) 11,\n                    the Court of Appeal rejected the opinion advanced by the appellant’s\n                    Vietnamese legal expert on the basis,inter alia,\n                    that it was “clearly unsustainable” (at [19]) in the light of the relevant provision\n                    of the Vietnamese Maritime Code. Instead, the Court preferred the opinion of the\n                    respondent’s legal expert, which was found to be “wholly logical\n                    and sensible” at ([18]). At\n                        [16] of the judgment, the Court of\n                    Appeal held that: We recognise that questions of foreign law are questions of fact and where\n                        the opinions of experts conflict on such foreign law, the court should as a\n                        general rule refrain from making a determination on the basis of affidavit\n                        evidence... But it does not follow that in every instance where there is a\n                        conflict of opinions, the Singapore courts should always shy away from\n                        examining the opinions given. ... 37     On the points of Indonesian law, the Court was\n                    assisted by the affidavit evidence of Mr Erman Rajagukguk\n                    (“Mr Raja”) for the Appellant and Mr Wahyuni Bahar\n                    (“Mr Bahar”) for the Respondents, who rendered two opinions\n                    each. 38     Mr Raja is a Professor of Law at the\n                    Fakultas Hukum Universitas Indonesia in Jakarta, Indonesia. He has been a\n                    Professor of Law for 13 years and specialises in the Law of Contract, Law of\n                    Corporation, Investment Law, Secured Transaction and the Civil Code of\n                    Indonesia. He is admitted to practise law in Indonesia. Mr Raja’s\n                    opinion was that the PG is invalid under Indonesian law because: (a)     the procedures for notarisation of\n                        such a document under Indonesian Law were not complied\n                    with; (b)     the terms and\n                        substance of the PG (which was written in English) were not explained to\n                        Susanto (who was not able to read, write or converse in English) before\n                        Susanto signed the PG; and (c)     the Spousal Consent signed by Tiny did not constitute\n                        informed consent. In particular, he relied on Arts 43 and\n                    44 of Law No 30 of 2004 in his first opinion. The English translation reads as\n                    follows: Article 43 (a)The deed shall be prepared in Bahasa\n                            Indonesia; (b)If a party to the deed does not understand the\n                            language used in the deed, the notary shall be obliged to translate or\n                            explain the said deed in a language understood by the party\n                            concerned; (c)If the notary cannot translate or explain as\n                            required under paragraph (b) above, the said deed shall be translated or\n                            explained by an official translator; (d)The deed may be prepared in any other language\n                            understood by the notary and the witnesses if stakeholders require it\n                            and the law does not stipulate differently; and (e)If the deed is prepared as stipulated in paragraph\n                            (d) above, the notary shall be obliged to translate it to Bahasa\n                            Indonesia to the parties. Article 44 (a)The moment following the deed being read out, the\n                            said deed shall be signed by the parties attending, the witnesses, and\n                            the notary, unless if there is party attended who may not sign for\n                            certain reasons; (b)The reasons as stipulated in paragraph (a) shall\n                            be clearly stated in the deed; (c)If there is any translation or explanation as\n                            stipulated in (c) above, the deed shall be signed by the parties, the\n                            notary, the witnesses, and the official translator; and (d)The reading out, translation or explanation and\n                            signature of the deed as stipulated in paragraph (a) above shall be\n                            stated clearly in writing at the end of the deed. 39     According to the Appellant, the Notary did not\n                    read, explain or translate the contents of the PG to Susanto in either Hokkien\n                    or Bahasa Indonesia, or explain it in such a language that he fully understood\n                    the terms and substance of the PG before signing it. According to Mr Raja,\n                    the failure to comply with the procedural requirements under Arts 43 and 44\n                    rendered the PG invalid and unenforceable. However, as can be seen, Arts 43\n                    and 44 do not expressly state the consequence of non-compliance. 40     In addition to the improper notarisation,\n                    Mr Raja said that Susanto did not in fact fully understand the terms of the\n                    PG and the representatives of the Sixth Respondent was aware of this because the\n                    PG was not translated and read to Susanto in a language of his preference. Under\n                    Art 1320 of the Indonesian Civil Code, an agreement must meet four\n                    requirements to be valid and one of them was that the consent of the parties\n                    must have been present. I will set out Art 1320 later. In\n                    Mr Raja’s opinion, a brief explanation of the PG was not sufficient.\n                    It contained special terms. For example, there was a special term for the waiver\n                    of the right to demand that the Respondents must first make reasonable attempts\n                    to enforce the Facility Agreement against the Borrower (which must have failed)\n                    before any enforcement of the PG can be done. Such a special term must have been\n                    fully explained to Susanto before he signed the PG. 41     The third ground of invalidity was that\n                    Tiny’s Spousal Consent was not informed consent because the PG was not\n                    read and explained to her and she was not asked to read it before she signed\n                    it. 42     Mr Raja also opined that the evidence of\n                    the Notary was crucial if the dispute was before an Indonesian\n                court. 43     The expert for the Respondents was\n                    Mr Bahar. He had been practising law for 20 years, specialising in capital\n                    market, financing and other corporate structuring transactions. He had also\n                    lectured in two universities, one in Bandung and one in Jakarta for eight and\n                    two years respectively. 44     In his first opinion dated 18 November\n                    2010, Mr Bahar did not agree that the PG had to be translated or explained\n                    line by line to Susanto. Furthermore, he opined that even if Art 43 (or\n                    Art 44) of Law No 30 of 2004 was not complied with, such a non-compliance\n                    would not render the PG invalid and unenforceable. Mr Bahar said that Law\n                    No 30 of 2004 was to regulate the scope of a Notary’s duties and\n                    obligations and not to affect the validity and enforcement of contracts. The\n                    latter is governed by the Indonesian Civil Code (“the\n                    ICC”). 45     Mr Bahar said that the sanction or\n                    consequence for non-compliance with, say, Art 44 was set out in Art 84\n                    of Law No 30 of 2004. The English translation states: Any violation by a notary of provisions in Article 16 paragraph (1) letter\n                        i, Article 16 paragraph (1) letter k, Article 41, Article 44, Article 48,\n                        Article 49, Article 50, Article 51 or Article 52, which cause the deed to\n                        only have power of authentication as a private deed or the deed being null\n                        and void, may become a basis to the party suffering the loss to ask for the\n                        costs, damages and interest to the notary. 46     Mr Bahar said that Art 44 prescribes\n                    the Notary’s duty to record any reading, explanation or translation at the\n                    end of the relevant deed which is distinct from the requirement to translate the\n                    contents of the deed into a language understood by the party concerned. The\n                    sanction mentioned in Art 84 applies to a breach of Art 44 but not\n                    Art 43. He implied that any breach was of Art 43 but not\n                    Art 44. 47     He said that even a breach of Art 44 did\n                    not render the deed invalid or unenforceable. What Art 84 did was to state\n                    that if a violation of the relevant article results in a deed being null and\n                    void, that may be a basis for the party suffering the loss to make a claim\n                    against the Notary. Article 84 does not in itself render a deed null and\n                    void for failure to comply with Art 44. 48     As for the ICC, he referred to Arts 1320,\n                    1321, 1322 thereof which were translated as follows: Article 1320 a.The parties must consent to their respective rights\n                            and obligations under the contract; b.It must be concluded by competent\n                        parties; c.The contract must have a definite object;\n                            and d.The contract must have a lawful cause or\n                            purpose. Article 1321 There is no valid consent if such consent is given by mistake, or is\n                        obtained by violence extortion or by fraud. Article 1322 The mistake does not result in the cancellation of an agreement unless\n                        that mistake is happened to the nature of the object which forms the\n                        principle of the agreement. 49     Mr Bahar noted that Susanto had signed\n                    the PG before the Notary and two other witnesses. In addition, Mr Bahar\n                    also noted that: (a)     according to an affidavit of Tiny\n                        herself, the Notary’s assistant had (at least) briefly explained the\n                        nature of the PG to Susanto and to her in Bahasa\n                    Indonesia; (b)     the\n                        present dispute was not that Susanto had failed to understand that he was\n                        signing a guarantee but that it was alleged that he had believed that the\n                        Respondents had to commence legal proceedings against the Borrower first. On\n                        this point, Susanto had allegedly mentioned this belief to an employee of\n                        the Borrower, one Kasan Tjokromulia (“Kasan”) (who had\n                        allegedly then checked the issue and told Susanto that there was no need for\n                        the Respondents to sue the Borrower first); (c)     Susanto had not said that he did not fully\n                        understood the PG when he signed it; and (d)     according to an affidavit and a statutory\n                        declaration signed for the Respondents, the contents of the PG was explained\n                        in Bahasa Indonesia by the Notary to Susanto and Tiny and the PG was\n                        negotiated by Susanto’s lawyers who were also present at the time he\n                        signed the PG. 50     In view of the above and even without taking\n                    into account (d) above, Mr Bahar was of the view that a plea of mistake\n                    would not be made out. 51     As for Tiny’s Spousal Consent,\n                    Mr Bahar noted that: (a)     Tiny had signed the Spousal\n                        Consent; (b)     according to an affidavit of Tiny herself, she was informed by the\n                        Notary’s assistant that her consent was required for Susanto to sign\n                        the document which he had signed; (c)     according to a statutory declaration signed for the\n                        Respondents, the PG and the Spousal Consent were explained in Bahasa\n                        Indonesia to Susanto and to Tiny by the Notary; and (d)     Tiny had been accompanied by Susanto\n                        and their lawyers on 20 November 2006 when she signed the Spousal\n                        Consent before a Notary and these lawyers had negotiated the terms of the\n                        PG. 52     In view of the above and even without taking\n                    into account (c) and (d) above, Mr Bahar was of the view that the Spousal\n                    Consent was valid. 53     Mr Raja’s second opinion, in\n                    response, was dated 20 December 2010. He maintained that the Notary was\n                    obliged to explain or translate the PG in Bahasa Indonesia to\n                Susanto. 54     He also maintained that a failure by the\n                    Notary to do so would “necessarily mean” that the PG is not valid\n                    and is unenforceable pursuant to Art 1320 of the ICC. He relied on\n                    Art 84 of Law No 30 of 2004 (see[45]above). 55     In his opinion, a breach of Art 44\n                    “could have the effect” of rendering the PG null and void. In his\n                    view, both Arts 43 and 44 of Law No 30 of 2004 had been breached. He was\n                    also of the view that “because Art 44 deals with parties’\n                    understanding of the contents of the document before providing their consent to\n                    execute the document”, a breach of Art 44 would mean that there was\n                    no informed consent as required under Art 1320 of the ICC. 56     Mr Raja did not disagree with\n                    Mr Bahar’s opinion on Arts 1321 and 1322 of the ICC. However,\n                    Mr Raja maintained in [51] of his\n                    second opinion that: In the present case, it is asserted that [Susanto] could not read, write\n                        or speak in English and therefore could not and did not fully understand the\n                        terms of the [PG] before he signed the document. For [Susanto] to have the\n                        requisite understanding of the [PG] required to execute the [PG] before the\n                        Notary, the terms and substance of the [PG] must be translated and read to\n                        [Susanto] in a language of his preference until he acknowledges that he\n                        fully understands the substance and terms of the [PG]. This was not done in\n                        the present case. 57     Mr Raja was of the opinion that Susanto\n                    was mistaken as to the “nature of the object which forms the principle of\n                    the agreement” pursuant to Art 1322 of the ICC if he was mistaken or\n                    unaware of specific terms, for example, that he had waived his right to require\n                    that the Plaintiffs must first make reasonable attempts to enforce the Facility\n                    Agreement against the Borrower. 58     He expressed a similar opinion in respect of\n                    Tiny’s Spousal Consent. 59     Mr Bahar’s second opinion, in\n                    response to Mr Raja’s second opinion, was dated 10 January 2011.\n                    Besides reiterating his first opinion, Mr Bahar disagreed that it is\n                    sufficient for a party to be mistaken or unaware of the specific terms of a\n                    document which impact on that party’s rights. In his opinion, this is an\n                    “impossibly low threshold to annul a contract on the ground of\n                    mistake” (see para 50 of his second opinion). In support, he\n                    referred to an opinion of Professor R Subekti from R Subekti,Hukum Perjanjian (Contract Law)( PT Intermasa, 4th Ed, 1976) at\n                    pp 22-23. The English translation reads: A mistake occurs in the event a party makes a mistake regarding the\n                        principal matters in the agreement or the important nature of the\n                        subject-matter of the agreement or regarding the persons with whom the\n                        agreement is entered. The mistake must be in such a way that if the person\n                        makes no such mistake regarding the matter, then he/she will not give a\n                        consent. ... The counterparty must be aware of the mistake or at least ought\n                        to have been aware that it was facing persons laboring under the mistake. If\n                        the counterparty is not aware of the mistake or could not have been aware\n                        that it is facing persons laboring under the mistake, then it is unfair to\n                        annul the agreement. 60     Mr Raja also said that it was not\n                    asserted or shown that Susanto would not have signed the PG had he been fully\n                    apprised of the effect of each of the terms of the PG and there were more than\n                    sufficient grounds for the Respondents to believe that Susanto understood the\n                    nature and contents of the PG. 61     Before I continue, I would mention that the\n                    Appellant sought to dilute Mr Bahar’s opinions by pointing to a\n                    qualification which he included near the end of each of his opinions. The\n                    qualification states: My opinion that an obligation or document is enforceable means that the\n                        courts of the Republic of Indonesia should enforce such obligation or\n                        document. It is not to be taken as meaning that the obligation or document\n                        will necessarily be enforced in accordance with its terms in all\n                        circumstances. Enforceability in the Republic of Indonesia may be subject to\n                        the principles of good faith, fairness, reasonableness, and public policy\n                        and the general discretion of such courts of the Republic of Indonesia to\n                        apply such principles. The interpretation by the courts of those principles\n                        in certain circumstances may limit or preclude the reliance on, or\n                        enforcement of, contractual terms and provisions. 62     In my view, that qualification was a standard\n                    one used by Mr Bahar as a matter of caution to avoid any liability in case\n                    an Indonesian court should come to a decision contrary to his opinion. It did\n                    not suggest a lack of conviction in his own opinion. 63     Bearing in mind the nature of their\n                    application for summary judgment, the Respondents proceeded on the assumption,\n                    for the present purpose, that the Notary did not read or explain or translate\n                    the PG to Susanto and also did not do so line by line. The evidence of the\n                    Notary was therefore not relevant for the present purpose. 64     I agreed with Mr Bahar that Arts 43\n                    and 44 of Law No 30 of 2004 do not cover the same activity. That is evident from\n                    a reading of those provisions. Art 43 refers to a Notary’s obligation\n                    to translate or explain if a party does not understand the language used in the\n                    deed. Article 44 refers to the requirement that the deed shall be signed by\n                    the parties and the Notary and the witnesses and the translator but that assumes\n                    that there is a translator. Article 44 also states that the reading, translation\n                    or explanation shall be stated clearly in writing at the end of the deed. That\n                    assumes that there was a translation or explanation. 65     It seemed to me that there was, at most, a\n                    breach of Art 43. Mr Raja had suggested that a breach of Art 43\n                    necessarily meant a breach of Art 44 because he knew that Art 84 of\n                    Law No 30 of 2004 applied to a breach of Art 44 but not of\n                    Art 43. 66     Even if Art 84 applied to the facts of\n                    the present case, I agreed with Mr Bahar that Art 84 does not in\n                    itself state that a breach of Art 44 renders the PG invalid or\n                    unenforceable. That is clear from the terms of Art 84 itself. All it does\n                    is to state that the party suffering the loss may make a claim against the\n                    Notary where the deed is rendered void. 67     The consequence of a breach of Art 43 (or\n                    Art 44) depends on Arts 1320 to 1322 of the ICC as opined by\n                    Mr Bahar. Significantly, Mr Raja did not say that these Articles were\n                    irrelevant so long as Art 43 or 44 of Law No 30 of 2004 was breached.\n                    Therefore, if a deed was not translated or explained to a guarantor but the\n                    facts show that he understood the nature of the object which forms the principal\n                    matters of the deed, the deed is not rendered invalid just because of a breach\n                    of Art 43 (or 44). 68     The above accords with commercial common\n                    sense. Why should a guarantee be rendered invalid or unenforceable for lack of\n                    explanation or translation by a Notary if in fact the guarantor understood the\n                    nature of the guarantee without the need for such an explanation or\n                    translation? 69     Indonesian law does not lead to the conclusion\n                    advocated by Mr Raja who had assumed that a Notary’s failure to\n                    explain or translate to Susanto in a language or dialect he understood\n                    necessarily meant that Susanto did not understand the nature of the PG or was\n                    unaware or mistaken about a specific term therein. 70     The Appellant’s allegation about\n                    Susanto’s unawareness was in respect of a term that the Respondents did\n                    not have to proceed first against the Borrower before taking action against\n                    Susanto. This allegation arose from what Kasan had said (see [49(b)]\n                    above). 71     Counsel for the Appellant, Mr Daniel,\n                    submitted that if Susanto was under the impression that the Respondents had to\n                    proceed first against the Borrower, that was a mistake as to the nature of his\n                    obligation,ie, he had thought his obligation was\n                    secondary to that of the Borrower and not a primary obligation to the\n                    Respondents. This was a sufficient mistake to render the PG invalid and\n                    unenforceable; it was at the least a triable issue. 72     I was of the view that even if such a mistake\n                    could arguably render the PG invalid and unenforceable, the allegation about\n                    that mistake was a sham. 73     In the first place, the Defence did not allude\n                    to such a mistake. Instead, it suggested that Susanto did not even know he was\n                    signing a guarantee (see[22]above). 74     If I was not bound by the decision inPoh Soon Kiat, I would have decided that it\n                    was not open to the Appellant to raise the allegation that Susanto was unaware\n                    of his primary obligation. 75     In any event, the failure by the Appellant to\n                    specifically raise Susanto’s unawareness of his primary obligation in the\n                    Defence suggested a sham. 76     Secondly, if the allegation was true, Susanto\n                    would have raised it to the Respondents at the earliest opportunity after he\n                    received the letters of demand and after Kasan had allegedly checked and told\n                    him that it was not necessary for the Respondents to commence legal proceedings\n                    against the Borrower first (see [49(b)] above). Yet, there was nary a protest by\n                    Susanto to the Respondents when he was alive. No explanation was given for this\n                    omission. 77     Thirdly, as mentioned above at[19], on or about 8 December 2009, the\n                    Respondents received a letter from the Borrower signed by Ferry Tanudjaya,\n                    Susanto’s brother-in-law. That letter requested the Respondents’\n                    consent to a proposed sale of shares in various companies and for the PG to be\n                    discharged. 78     No explanation was given by the Appellant as\n                    to why this letter was sent without mentioning that Susanto was unaware of his\n                    primary obligation under the PG. 79     Fourthly, Susanto was an experienced\n                    businessman. He must have been familiar with or at least aware of facilities\n                    like those under the Facility Agreement and the terms thereof and the\n                    requirement of a guarantee including the primary obligation provision. Indeed,\n                    he had signed a guarantee previously dated 17 October 2005 (also in the\n                    English language) which the Respondents said effectively had a similar provision\n                    as that found in the PG which allowed action to be taken against him without\n                    having to take action against the Borrower first. This also contradicted\n                    Kasan’s affidavit of 4 October 2010 when he said that as far as he\n                    knew, the PG (before me) was the first one that Susanto had signed in the\n                    English language. Likewise, Tiny must have been aware that her husband’s\n                    business required funding and that he might have to give a personal guarantee\n                    for which her consent was required. She too had signed a similar spousal consent\n                    for the previous guarantee dated 17 October 2005. There was no suggestion\n                    that the terms of the PG were unusual. 80     Fifthly, the Borrower was advised by both\n                    foreign and Indonesian lawyers,ie, Milbank,\n                    Tweek, Hadley & McCloy LLP (“Milbank”) and Indrawan, Heisky\n                    & Partners (“IHP”). The terms of the Facility Agreement were\n                    negotiated over some months. Comments were also given by Milbank and/or IHP on\n                    the terms of the PG. While Mr Daniel sought to argue that the lawyers were\n                    not engaged by Susanto, this was based on the technical point that the invoice\n                    of the lawyers were not sent to or paid by Susanto personally. It was clear to\n                    me that they were nevertheless looking after Susanto’s personal interest\n                    also, as well as Tiny’s interest I might add. This was not a case of their\n                    interests being overlooked or their being hung out to dry. It was also not in\n                    dispute that lawyers from IHP accompanied Susanto and Tiny on the day the PG and\n                    Spousal Consent were signed in the presence of the Notary. 81     According to Kasan’s affidavit of\n                    16 December 2010, Milbank did not explain or translate any of the\n                    transaction documents including the PG to Susanto. Neither did IHP. IHP was not\n                    requested to explain any of the transaction documents including the PG to\n                    Susanto and therefore did not do so. This begged the question as to why no one\n                    asked IHP to do so and why an experienced businessman like Susanto was\n                    nevertheless willing to sign the PG. He must have been familiar with his\n                    obligations thereunder. 82     As for the Spousal Consent, Tiny stated at\n                    paras 6 to 9 of her second affidavit affirmed on 5 October\n                    2010: 6    When it came to my turn to sign the Spousal Consent,\n                            I was informed by the Notary Public’s assistant that my consent\n                            was required for my late husband to sign the documents that he had\n                            signed. However, none of those documents were read or explained to me at\n                            all by the Notary Public or his assistant. I was also not asked to read\n                            any of the documents by myself. 7    I can read, speak and understand some English, but\n                            my abilities in this regard are limited, and I require someone to read\n                            out the document to me and explain slowly and carefully. For instance,\n                            when my previous affidavit in this action was signed and when I signed\n                            this affidavit, my solicitors, along with my late husband’s\n                            colleagues, slowly and carefully explained the contents to me, ensured\n                            that I understood, and only then did I sign. 8    I never knew the contents and legal effects of the\n                            documents that I had signed at the Notary’s office because none of\n                            those documents were read or explained to me at all by the Notary Public\n                            or his assistant. I was also not asked to read any of the documents by\n                            myself. 9    Consequently, while I may have signed the Spousal\n                            Consent, it was not informed consent as no one read or explained any of\n                            the documents to me at all. 83     Yet, when I asked Mr Daniel what Tiny was\n                    not able to understand specifically, he accepted that she had not addressed this\n                    point. Her position seemed to be that there was no informed consent on her part\n                    just because no one read or explained any document to her at all. 84     Bearing in mind that she did not explain what\n                    she did not understand specifically, the fact that the allegation in respect of\n                    the Spousal Consent was raised so late in the day (ie, in her second affidavit of 5 October 2010 for the first\n                    time) and the points mentioned in[79]and[80]above, I concluded that this was a\n                    sham allegation as well. 85     In the circumstances, I did not think that\n                    there was a triable issue and I dismissed the appeal with costs."
    }
}