{
    "case_title": "AQB \n      v\n      AQC",
    "ncitation": "[2011] SGHC 101",
    "coram": "Tay Yong Kwang J",
    "sections": {
        "Facts": "2       The parties, whom I shall refer to as husband\n                    and wife, were married on 2 November 2003. The wife is a Singapore citizen\n                    while the husband is a citizen of the United States of America. 3       On 23 January 2008, the wife filed for\n                    divorce on the ground that the marriage had irretrievably broken down. The fact\n                    relied on to prove the irretrievable breakdown was that the husband had behaved\n                    in such a way that the wife could not reasonably be expected to live with him\n                    (section 95(3)(b) of the Women’s Charter). 4       The interim judgment of divorce was granted on\n                    30 January 2009 by the Family Court. The three-month period for cause to be\n                    shown (see section 99(1) of the Women’s Charter) why the interim judgment\n                    should not be made final lapsed on 30 April 2009. No application to show\n                    cause was made by anyone in this case and neither did the wife apply for the\n                    interim judgment to be made final. 5       In 2010, the husband applied for leave to make\n                    the interim judgment final. This was opposed by the wife. On 20 October\n                    2010, the leave sought was granted by the deputy registrar who made no order as\n                    to costs (“the 20 October 2010 order”). Pursuant to the\n                    20 October 2010 order, the Certificate of Making Interim Judgment Final was\n                    issued on 26 October 2010. 6       The wife appealed against the decision of the\n                    deputy registrar. The appeal was heard and dismissed with costs fixed at $1,000\n                    by a district judge on 25 November 2010 (“the 25 November 2010\n                    order”). 7       In the present appeal before me, the wife sought\n                    to set aside the 25 November 2010 order, the 20 October 2010 order\n                    and, consequently, the Certificate of Making Interim Judgment Final dated\n                    26 October 2010. 8       There are two young children of the marriage,\n                    born in 2004 and 2006 respectively. The prayers relating to the ancillary\n                    matters have not been concluded. The ancillary matters cover custody, care and\n                    control of the two children, maintenance for the wife and the two children and\n                    division of matrimonial assets. However, there are interim orders with regard to\n                    maintenance for the children, custody, care and control and access. There have\n                    been numerous applications for discovery and interrogatories and also committal\n                    proceedings. 9       The husband and his new partner have a young\n                    child born in 2010 and are expecting a second child. They are hoping to\n                    formalize their union by marriage as quickly as possible for the sake of this\n                    child and the imminent one.",
        "The effect of section 123 of the Women’s Charter": "10     Section 99(3) of the Women’s Charter\n                    provides: Where an interim judgment of divorce has been granted and no\n                        application for it to be made final has been made by the party to whom it\n                        was granted, then, at any time after the expiration of 3 months from the\n                        earliest date on which that party could have made such an application, the\n                        party against whom it was granted may make an application to the court and\n                        on that application, the court may – (a)    notwithstanding subsection (1), make the\n                                judgment final; (b)    rescind the interim judgment; (c)    require further inquiry; or (d)    otherwise deal with the case as it thinks\n                                fit. 11     Pursuant to section 123 of the Women’s\n                    Charter, the court has discretion to refuse to make the interim judgment final\n                    where the arrangements for the welfare of the child are not satisfactory: 123. (1) Subject to this\n                        section, the court shall not make final any judgment of divorce or nullity\n                        of marriage or grant a judgment of judicial separation unless the court is\n                        satisfied as respects every child — (a)that arrangements have been made for the\n                                welfare of the child and that those arrangements are satisfactory or\n                                are the best that can be devised in the circumstances;\n                            or (b)that it is impracticable for the party or\n                                parties appearing before the court to make any such\n                                arrangements. (2) The court may, if it thinks fit, proceed without\n                        observing the requirements of subsection (1) if — (a)it appears that there are circumstances making\n                                it desirable that the interim judgment be made final or, as the case\n                                may be, that the judgment of judicial separation should be granted\n                                without delay; and (b)the court has obtained a satisfactory\n                                undertaking from either or both of the parties to bring the question\n                                of the arrangements for the child before the court within a\n                                specified time. 12     “Child” in section 123 is\n                    defined as a “child of the marriage” who is below 21 years of age\n                    (section 122 read with section 92 of the Women’s Charter). Section 123\n                    therefore obliges the court to consider whether satisfactory arrangements have\n                    been made for the welfare of the two children of the husband and the wife in the\n                    present case. 13     The husband contended that the threshold for\n                    the court’s satisfaction was not a high one, relying onZK v ZL[2008] SGDC 376 which held that: [8] ...all that is required for the\n                        test to be met is that arrangements have been made for the welfare of the\n                        children and that those arrangements are satisfactory. The function of the\n                        court at this stage is quite different from its function in the hearing for\n                        ancillary relief.The test at this stage is not whether\n                            the arrangements for the children are ideal or the best. The purpose of\n                            the provision is to make sure that the welfare of the children is not\n                            overlooked before the judgment is made final. [emphasis added] 14     In ancillary matters, with regard to custody,\n                    care and control, access and maintenance for the children, it is settled law\n                    that the first and paramount consideration of the court is the welfare of the\n                    children. The protection of the children’s welfare is thus assured in the\n                    hearing of the ancillaries. Therefore, at the stage of making the interim\n                    judgment final, all the court needs to ensure is that parties involved have\n                    addressed their minds to the welfare of their children. Rule 8 of the MPR 2006\n                    reinforces the importance of the children’s welfare by requiring the\n                    plaintiff filing the writ for divorce to also submit an agreed parenting plan\n                    or, failing agreement with the other spouse, a proposed parenting plan. If the\n                    children have been provided for, then, as recognised by Lord Wright inFender v St John-Mildmay[1938] AC 1 at [45] –\n                    [46], “the parties are entitled to provide for their future, at the end\n                    of the period fixed for the [interim judgment to be made final]”. This\n                    was quoted with approval inSivakolunthu Kumarasamy v\n                        Shanmugam Nagaiah[1987] SLR 182 at [23]. Therefore, the role of the court at this stage is to\n                    recognise the realities of the situation and allow the parties to move on with\n                    their separate lives, provided that they have made satisfactory arrangements for\n                    their children’s welfare. 15     Section 123(3) of the Women’s\n                    Charter states that welfare “includes the custody and education of the\n                    child and financial provision for him”. In the present appeal, the\n                    parties have joint custody and the issue of custody is not in dispute. Pursuant\n                    to an order of court, the wife was granted interim care and control of the\n                    children, with access to the husband. The husband is not disputing the issue of\n                    interim care and control. All outstanding applications relating to access have\n                    been determined by the High Court. There is no longer a dispute relating to the\n                    education of the children. There is an existing maintenance order relating to\n                    the children’s interim maintenance. Further, both the husband and the wife\n                    are well-off financially and each is able to provide for the children’s\n                    needs. Therefore, the welfare of the children in this case has not been\n                    overlooked and satisfactory arrangements have been made for their welfare.\n                    Accordingly, the condition under section 123(1)(a) for the interim judgment\n                    to be made final has been met.",
        "Rule 59(3)(a) of the MPR 2006": "16     The wife contended that in addition to section\n                    123 of the Women’s Charter, r 59(3) of the MPR 2006 has to be\n                    complied with before an interim judgment can be made final. The relevant\n                    paragraphs of R 59 state: 59. —(1)    An application by a\n                            party to make final an interim judgment pronounced in his favour may be\n                            made on any day after the expiration of the period fixed by the court\n                            for making the judgment\n                            final. (2)    … (3)    An application\n                            referred to in paragraph (1) shall not be made — (a)before the hearing of all applications for\n                                ancillary relief has been concluded; or (b)after the expiration of one year from the date\n                                of the interim judgment or the expiration of 3 months from the date\n                                of the last hearing of an application for ancillary relief in the\n                                writ or defence, whichever is the later, without the leave of the\n                                court. (4)    Upon the filing of the application, the court may\n                            make the interim judgment final. (5)    An application by a spouse to make final an\n                            interim judgment pronounced against him shall be by summons on not less\n                            than 4 days’ notice. (6)    On any application under paragraph (5), the court\n                            may make such order as it thinks fit. (7)    … (8)    … 17     The wife submitted that as there were\n                    outstanding ancillary matters, the filing of an application to make final the\n                    interim judgment was prohibited under r 59(3)(a). She argued that on the\n                    face of r 59(3)(a), the rule is absolute and therefore no question of leave\n                    of court arises before the conclusion of all the hearings for ancillary relief.\n                    It is only in respect of r 59(3)(b) that an application for such leave is\n                    permissible. 18     The husband submitted that even if this\n                    reading of r 59(3) is correct, it has no application to the present\n                    situation. Rule 59(1), (2), (3) and (4) of the MPR 2006 only apply where\n                    the party seeking to make the interim judgment final is the party in whose\n                    favour the interim judgment was pronounced. In the present appeal, this would be\n                    the wife. As it was the husband who has applied to make the interim judgment\n                    final, it was submitted that the relevant provisions were r 59(5) and (6)\n                    and that r 59(3) was inapplicable. 19     The contention in[18]above was also raised before the district judge inZK v ZL. At [11] of that case, the district judge opined: However that was a minor issue as regardless whether the application is\n                        made under rule 59(3) by the party in whose favour judgment was given or by\n                        the spouse against whom judgment was given under rule 59(5) the same\n                        principles apply. I agree that the same principles ought to apply whoever the applicant\n                    might be although, in the vast majority of cases, it is likely to be the party\n                    who has obtained an interim judgment in his/her favour. There is no\n                    justification for a different set of principles to apply merely because the\n                    party applying is the spouse against whom the interim judgment was pronounced.\n                    Accordingly, r 59(1) to (3) apply equally to an application by the husband\n                    in this case as they would to an application by the wife. 20     While a literal reading of r 59(3) might\n                    lead to the conclusion contended for by the wife, I am of the view that the\n                    clause “without the leave of the court” actually applies to both\n                    limbs of r 59(3) and not just to (b). This view is supported upon review of\n                    the earlier editions of the MPR which I directed counsel for both parties to\n                    look at and submit further on after the first hearing before me. The evolution\n                    of the present r 59(3) is as follows: MPR 2003 & Rev Ed 2004MPR 2005MPR Rev Ed 2006Decree absolute34.— (3) An application\n                                            referred to in paragraph (1) shall not be made\n                                            —(a)    before\n                                            the hearing of all applications for ancillary relief has\n                                            been concluded; or(b)    after the\n                                            expiration of one year from the date of the decree nisi\n                                            or the expiration of 3 months from the date of the last\n                                            hearing of the application for ancillary relief in the\n                                            petition or answer, whichever is the\n                                        later,without\n                                                the leave of the court.Final judgment59. —(3) An\n                                            application referred to in paragraph (1) shall not be\n                                            made —(a)    before\n                                            the hearing of all applications for ancillary relief has\n                                            been concluded; or(b)    after the\n                                            expiration of one year from the date of the interim\n                                            judgment or the expiration of 3 months from the date of\n                                            the last hearing of an application for ancillary relief\n                                            in the writ or defence, whichever is the later,without the leave of the\n                                                court.Final judgment59. —(3) An\n                                            application referred to in paragraph (1) shall not be\n                                            made —(a)    before\n                                            the hearing of all applications for ancillary relief has\n                                            been concluded; or(b)    after the\n                                            expiration of one year from the date of the interim\n                                            judgment or the expiration of 3 months from the date of\n                                            the last hearing of an application for ancillary relief\n                                            in the writ or defence, whichever is the later,without the leave of the\n                                                court.   [Emphasis added] 21     The current r 59(3)(a) of the MPR 2006\n                    was introduced in the 2003 amendments to the MPR. The guide to the 2003\n                        amendments[note: 1]provides that: [7.2.2] Under the new rule: An application to make a Decree Nisi Absolute shall not be made absolute\n                        until all the ancillary matters have been dealt with,unless the court has given leave. [emphasis added] The MPR 2003 shows clearly that the clause relating to leave applied\n                    to both limbs (a) and (b). The issue is therefore whether the 2005 amendments to\n                    the MPR were intended to bring about any substantive change by confining the\n                    court’s discretion to grant leave to limb (b). 22     Neither the summary of the\n                        amendments[note: 2]nor the guide to the 2005 amendments[note: 3]mentions a change to the wording of what was formerly r 34. When the\n                    Statutes (Miscellaneous Amendments) (No. 2) Act 2005 (No 42 of 2005)\n                    (“the 2005 Act”) was enacted, it brought about a change in legal\n                    terminology. Part X of the Women’s Charter was replaced by the current\n                    Part X that substitutes, among other things, ‘judgment’ for\n                    ‘decree’ and ‘interim judgment’ for ‘decree\n                    nisi’. The language used in the MPR was correspondingly changed. There was\n                    no indication that the regulatory scheme pertaining to the finalisation of an\n                    interim judgment was intended to be changed as well. 23     In the light of the above analysis, the most\n                    probable explanation for the change in wording was that a setting error occurred\n                    in the 2005 edition of the MPR which appended the clause “without the\n                    leave of court” to only r 59(3)(b). Accordingly, I hold that the\n                    said clause applies to both r 59(3)(a) and (b). I note that counsel inZK v ZLaccepted this position although the\n                    legal basis for doing so was not articulated in the district judge’s\n                    grounds. The district judge’s decision in that case to allow the\n                    application to make the interim judgment final was affirmed by the High Court\n                    but no written judgment was issued. 24     Pursuant to my decision, it follows that the\n                    court retains its discretion to grant leave to an applicant to make final an\n                    interim judgment under r 59(3)(a) even where there are outstanding\n                    ancillary matters before the court. The next issue to consider therefore is\n                    whether the court should exercise its discretion in favour of the husband in the\n                    present case. 25     The wife argued that the court’s\n                    discretion ought not to be exercised in favour of the husband. It was submitted\n                    that one must comply with the obligations of a first marriage before entering\n                    into a second one. The interests of the two children of the marriage would be\n                    compromised if the husband were allowed to set up another family now. There was\n                    also no urgency as the child of the husband and his new partner was already born\n                    and there was therefore no question of trying to legitimise him at birth. The\n                    wife contended that the husband is irresponsible and has no regard for the\n                    feelings of the two children of the marriage who have to go (during access time)\n                    to be with a woman who is not their mother but who is in the position of one.\n                    There were also allegations that the husband caused much of the delay in the\n                    ancillary proceedings. 26     The husband submitted that both parties are\n                    “mega-rich” and own many properties. The wife is a private banker\n                    and the husband is retired. There was no question of anyone, in particular the\n                    two children of the marriage, being left without financial support. In any case,\n                    satisfactory arrangements for the welfare of the two children have been made.\n                    After the wife’s appeal was dismissed by the district judge below, the\n                    husband proceeded to marry his new partner and she is now pregnant with their\n                    second child. He argued that the first marriage was over and that it was not\n                    irresponsible for him to want to put his second relationship on a proper footing\n                    especially when his new partner is expecting another child. He denied that he\n                    was delaying the resolution of the ancillary matters as he wanted to conclude\n                    the matrimonial proceedings in order to move on with his new life. 27     While there are outstanding ancillary matters\n                    in this case, satisfactory arrangements for the welfare of the two children of\n                    the marriage have been made (see[15]above)\n                    and while these arrangements could be fine-tuned along the way, there was no\n                    question that the two children were more than adequately taken care of. The wife\n                    is a wealthy and capable lady who does not require the husband’s financial\n                    support. While the husband’s conduct may not be that of an exemplary\n                    husband and father, there is really no point in visiting the consequences of his\n                    conduct on the innocent children of the second union, especially the imminent\n                    one who should not, like its elder sibling, be born out of\n                wedlock. 28     On the facts of this case, the husband has\n                    satisfied the requirements of section 123 of the Women’s Charter and has\n                    shown good reasons for the court to exercise its discretion in his favour under\n                    r 59(3)(a). I therefore uphold the district judge’s decision to grant\n                    him leave to make the interim judgment final. The wife’s appeal was\n                    dismissed accordingly. I awarded the husband costs of $1,000 for the factual\n                    arguments only since the arguments on the legal issues before me took a somewhat\n                    different route from that pursued by the parties in the Family\n                Court.  [note: 1]Guide to the Amendments to the Rules\n                                Governing Matrimonial Proceedings—(The Women’s Charter\n                                (Matrimonial Proceedings) Rules 2003) available at:\n                                http://www.familycourtofsingapore.gov.sg/principles/NewMPR2003/GuideAmendments.pdf [note: 2]Women’s Charter (Matrimonial\n                                Proceedings) (Amendment) Rules 2005 and Practice Direction No. 2 of\n                                2005 — Summary of Amendments to the Women’s Charter\n                                (Matrimonial Proceedings Rules) 2003 available at:\n                                http://www.familycourtofsingapore.gov.sg/principles/articles/SummaryOfAmendments2005.pdf [note: 3]Guide to the\n                                Amendments to the Women’s Charter (Matrimonial Proceedings)\n                                Rules 2003—Women’s Charter (Matrimonial Proceedings)\n                                (Amendment) Rules 2005 and Practice Direction No. 2 of 2005\n                                available at:\n                                http://www.lawgazette.com.sg/2005-6/June05-col1.htm"
    }
}