{
    "case_title": "IBM Singapore Pte Ltd\n      v\n      Beans Group Pte Ltd",
    "ncitation": "[2011] SGHC 269",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "Background": "2       The plaintiff is a company incorporated in Singapore and is in the business of providing information technology services and business consulting. The defendant is also a company incorporated in Singapore, and is in the business of developing software and programming activities. The plaintiff had on 20 March 2009 entered into an Annual Maintenance Service Agreement with Singalab Pte Ltd (“the Agreement”) for the provision and maintenance of information technology services at the premises (“the site”) of Media Development Authority (“MDA”). In or about March 2010, there was a novation of the Agreement, with the defendant assuming Singalab Pte Ltd’s obligation to make payment to the plaintiff. 3       Under the Agreement, the plaintiff and the defendant were project joint owners, with the defendant as the main contractor, and the plaintiff as sub-contractor. The end date of the Agreement was 31 March 2011, after which the plaintiff was to hand over the entire project to the defendant. 4       Between July 2010 and March 2011, four invoices were issued by the plaintiff to the defendant for services rendered by the plaintiff under the Agreement, for an amount totalling $753,387.00. The defendant did not dispute or take issue with any of the invoices. 5       As the defendant failed to make payment under the invoices, they were subject to late payment fees under the Agreement. Further invoices were thus issued to the defendant for the late payment fees. Likewise, the defendant did not dispute any of those late payment fee invoices. In the aggregate, the total outstanding sum due and owing from the defendant to the plaintiff (pursuant to the 4 main invoices and 6 late payment fee invoices) was $798,454.52. 6       Prompted by the defendant’s failure to either dispute or make payment on any of the invoices, the plaintiff sent three letters, dated 2 November 2010, 2 December 2010 and 3 January 2011, to demand payment. The defendant did not respond to any of those letters. It was only after the plaintiff sent a formal Notice of Demand for payment of $494,875.00 (due and payable under Tax Invoices No. 6X8515 and 6X9487) on 21 February 2011, that the defendant finally responded. While the defendant admitted to owing the plaintiff the sum of $494,875.00 and promised to make payment, it asked for more time until 31 March 2011 as it was purportedly undergoing a merger. However, despite the defendant’s promise, the plaintiff did not hear further from the defendant. 7       The plaintiff then sent a letter of demand on 11 May 2011, claiming the aggregate sum of $798,454.52. Unsurprisingly, the defendant again failed to respond or make any payment. 8       The plaintiff thus commenced this suit claiming the sum of $798,454.52. Default judgment was entered against the defendant on 7 June 2011 and the formal judgment was served on the defendant on 8 June 2011. On 16 June 2011, the defendant’s solicitors wrote to the plaintiff’s solicitors requesting a copy of the Writ of Summons. At this stage, there was still no indication by the defendant or its solicitors that the former intended to dispute liability under the invoices. 9       The defendant took no further action until the plaintiff applied for and obtained a garnishee ordernisiagainst DBS Bank Limited (“DBS”), with which defendant had an account. It was on 12 July 2011, on the eve of the hearing to make the garnishee order absolute, that the defendant finally filed its application to set aside the judgment in Summons No 3050 of 2011 and sought a stay of execution. The affidavit of Ng Kek Wee (“Ng”), its managing director, was filed on 18 July 2011, in support of the defendant’s setting aside application. It was only in Ng’s affidavit that the defendant first raised its objections to the plaintiff’s claim on the outstanding invoices. 10     At the hearing before the Assistant Registrar on 27 July 2011, the defendant admitted it had failed to raise any triable issues with respect amount of $539,942.52, but disputed the plaintiff’s claim for the sum. The Assistant Registrar granted the plaintiff judgment for $539,942.52, but allowed the defendant leave to defend the sum on the condition that the defendant provide security by way of a bankers’ guarantee or a solicitor’s undertaking for the same.",
        "The plaintiff’s position": "11     The plaintiff pointed out that the defendant never disputed the plaintiff’s claim for the sum since the time the plaintiff’s invoices were issued. It was not until the garnishee proceedings when DBS responded to say that there was money available to be garnished in the defendant’s bank account that the defendant first raised its objections to the sum. The plaintiff submitted that the conspicuous silence of the defendant to dispute or protest the plaintiff’s claim for such a long period of time showed that the defendant’s belated objections were, an afterthought. The plaintiff also highlighted that the assertions contained in the affidavit of Ng were bare and unsupported by contemporaneous correspondence and documents.",
        "The law on setting aside of a default judgment": "12     Before I address the defendant’s purported defences to the plaintiff’s claim, it is apposite to first consider the law on setting aside of a regular default judgment, and the granting of conditional leave to defend. Order 13 r 8 of the Rules of Court (Cap 332, R5, 2006 Rev Ed) provides: The Court may, on such terms as it thinks just, set aside or vary any judgment entered in pursuance of this Order. 13     InMercurine Pte Ltd v Canberra Development Pte Ltd[2008] 4 SLR(R) 907 at [60], the Court of Appeal unequivocally established that the test in deciding whether to set aside a regular default judgment is whether the defendant can establish aprima faciedefence in the sense of showing that there are triable or arguable issues. This test is similar to that for obtaining leave to defend in an O 14 application. 14     In allowing an application to set aside a judgment in default of appearance or defence, the court has the discretion to require the defendant to provide security for the plaintiff’s claim where this would be just (as when the defendant’s veracity is in doubt and his defence suspect) (seeSingapore Court Practice 2009(Jeffrey Pinsler gen ed) (LexisNexis, 2009) at para 13/8/5 andTR Networks Ltd & Ors v Elixir Health Holdings Pte Ltd & Ors[2005] SGHC 106 at [37]). 15     In the case ofAbdul SalamAsanaruPillai v Nomanbhoy & Sons Pte Ltd[2007] 2 SLR(R) 856 (“Abdul Salam”) at [43] and [44], Menon JC set out the principles applicable in deciding whether a condition should be imposed in granting the defendant leave to defend: 43    However, the question then was whether I should impose a condition. There is a multitude of terms that have evolved over the years to express the circumstances in which this would be appropriate. These include such terms as “a real doubt about the defendant’s good faith”, “shadowy”, “sham”, “suspicious”, “hardly of substance” and so on. 44    These terms are somewhat pejorative and this may obscure the true principle. In my judgment, a condition is appropriate when the court has the sense that although it cannot be said that the claimed defence is so hopeless that, in truth, there is no defence, the overall impression is such that some demonstration of commitment on the part of the defendant to the claimed defence is called for. 16     It should also be noted that while it is not appropriate for the court, at this stage, to delve into a precise evaluation of the merits of the rival contentions or to assess the relative probabilities, the court should also not assume that every sworn averment is to be accepted as true (seeAbdul Salamat [36] and [38]). InGohChok Tong v Chee Soon Juan[2003] 3 SLR(R) 32 (“GohChok Tong”) at [25], the Court of Appeal made it clear that leave to defend will not be granted based upon “mere assertions” by defendants; instead, the court will look at the whole situation critically to examine whether the defence is credible: It is a settled principle of law that in an application for summary judgment, the defendant will not be given leave to defend based on mere assertions alone:Banque de Paris et des Pays-Bas (Suisse) SA v Costa de Naray and Christopher John Walters[1984] 1 Lloyd's Rep 21 at 23. The court must be convinced that there is a reasonable probability that the defendant has a real orbona fidedefence in relation to the issues. In this regard, the standard to be applied was well-articulated by Laddie J inMicrosoft Corporation v Electro-Wide Limited[1997] FSR 580, where he said at 593 to 594 that: [I]t is not sufficient just to look at each factual issue one by one and to consider whether it is possible that the defendant's story in relation to that issue is credible. The court must look at the complete account of events put forward by both the plaintiff and the defendants and ... look at the whole situation. The mere fact that the defendants support their defence by sworn evidence does not mean that the court is obliged to suspend its critical faculties and accept that evidence as if it was probably accurate. If, having regard to inconsistency with contemporaneous documents, inherent implausibility and other compelling evidence, the defence is not credible, the court must say so. It should not let the filing of evidence which surpasses belief deprive a plaintiff of its entitlement to relief. 17     With the above principles in mind, I turn now to consider the defendant’s position.",
        "The defendant’s position": "18     The thrust of the defendant’s case was that prior to 31 March 2011, which was the date the plaintiff handed over the project, the defendant was unaware of the breaches by the plaintiff of its obligations under the Agreement. Thus, the defendant sought to explain away its failure to dispute the plaintiff’s claim under the invoices by claiming that it was only after the plaintiff exited the site on 31 March 2011, and after the client notified the defendant of the unresolved issues left behind by the plaintiff, that the defendant became apprised of the extent of unfinished work left behind by the plaintiff.",
        "The decision": "19     Looking at the account of events put forward by both parties, the defendant’s assertion that it was totally ignorant of the alleged breaches of the Agreement by the plaintiff prior to 31 March 2011 was wholly unconvincing. The defendant pointed to the summarized errors logged in the issue tracking system as evidence that the plaintiff breached its obligations. However, it was noted that all of the errors were logged into the system before 31 March 2011. Since (by the defendant’s own account) the issue tracking system was accessible to all parties involved, including both the plaintiff and defendant, this rendered the defendant’s claim that it was totally unaware of the alleged breaches by the plaintiff inherently implausible. Indeed, the defendant had only two days before, on 29 March 2011, signed off on the “Completion Report for IBM Services”, which certified unequivocally that all work and services had been satisfactorily completed by the plaintiff. 20     Even accepting the defendant’s version of events that it only discovered the true state of affairs on 31 March 2011, the defendant’s position remained untenable. Nothing was done by the defendant to indicate its protest or dissatisfaction even after 31 March 2011. The plaintiff’s letter of demand, sent on 11 May 2011, received no response. This was in spite of the fact that this was the very date that MDA had sent an email to the defendant, indicating that MDA was withholding the security deposit as there were outstanding unresolved issues. If the defendant really took issue with the plaintiff’s performance, one would have expected the defendant to have raised its objections there and then, or soon after. Instead, the defendant still maintained its silence even after the plaintiff applied for and obtained default judgment on 7 June 2011, and even after the judgment was served on the defendant on 8 June 2011, together with a winding up statutory demand. Notably, when the defendant’s solicitors wrote to the plaintiff’s solicitors on 16 June 2011 requesting for a copy of the Writ of Summons, there was no allegations against the plaintiff. For the defendant to neither dispute nor challenge the numerous invoices sent by the plaintiff, but to raise fresh allegations just before the plaintiff’s judgment was to be executed by a garnishee order absolute, called into serious question thebona fidesof its defence.",
        "Conclusion": "21     In my view, it was clear that the defendant’s conduct was such as to give an overall impression that it had no basis for its purported defence. I therefore dismissed the Appeal and fixed costs at S$2,500 to the plaintiff."
    }
}