{
    "case_title": "Public Prosecutor\n      v\n      Nelson Jeyaraj s/o Chandran",
    "ncitation": "[2011] SGHC 33",
    "coram": "Steven Chong J",
    "sections": {
        "Introduction": "1       This is an appeal by the Prosecution against\n                    sentence. The respondent pleaded guilty to and was convicted of six charges\n                    under the Moneylenders Act (Cap 188, 2010 Rev Ed) (“the current\n                    Moneylenders Act”) of which five related to acts of harassment with the\n                    use of kerosene to set fire to the doors of five Housing and Development Board\n                    (“HDB”) flats. Four other charges were taken into consideration\n                    for sentencing. The Prosecution’s appeal pertains only to the sentences in\n                    respect of the five harassment charges. 2       For the five harassment charges under\n                    s 28(2)(a) read with s 28(3)(b)(i) of the current Moneylenders Act,\n                    the District Judge sentenced the respondent to a term of 12 months’\n                    imprisonment for each of the charges and 3 strokes of the cane for each charge,\n                    with the imprisonment sentences for three of the harassment charges to run\n                    consecutively. The total sentence was therefore 36 months and 15 strokes of\n                    the cane for the five harassment charges. Before me, the Prosecution pressed for\n                    a deterrent sentence of 24 monthsper\n                    charge. 3       The punishment prescribed for an offence under\n                    s 28(2)(a) read with s 28(3)(b)(i) of the current Moneylenders Act for\n                    a first-time offender is mandatory imprisonment for a term not exceeding 5 years\n                    and a discretionary fine of not less than $5,000 and not more than $50,000. In\n                    addition, the offender shall on conviction be punished with not less than 3 and\n                    not more than 6 strokes of the cane if it is proved to the satisfaction of the\n                    court that, in the course of committing the offence, damage was caused to any\n                    property. 4       I allowed the appeal and enhanced the sentence\n                    for each of the five harassment convictions before me to 18 monthsper charge, with the imprisonment sentences for three of\n                    the harassment charges to run consecutively as ordered below. I have noted with\n                    some concern the increasing trend of such offences and how they have recently\n                    evolved to include the more hazardous use of fire to harass debtors and their\n                    families. It is hoped that this decision will provide some useful sentencing\n                    guidelines on the treatment of such offences, in particular the use of fire for\n                    harassment purposes.",
        "Facts": "5       The facts of this case are relatively\n                    straightforward and have been admitted by the respondent. Sometime in early\n                    2008, the respondent had confided in one of his acquaintances known as\n                    “Ah Huat” whom he had gotten to know during his incarceration in\n                    2006 that he was in financial difficulties. “Ah Huat” told him\n                    that that he (the respondent) could obtain loans from a loanshark known as\n                    “Ah Boy”. The respondent subsequently obtained several loans from\n                    “Ah Boy” and paid them off in a timely manner. 6       In November 2008 and July 2009, the respondent\n                    took two additional loans of $5,000 each from “Ah Boy”. However,\n                    this time, the respondent was unable to service his loan repayments and called\n                    “Ah Boy” to negotiate the repayment. 7       To repay his debts, the respondent worked as a\n                    runner for “Ah Boy” for some time, primarily checking for evidence\n                    of harassment and reporting back to “Ah Boy”. For his work as a\n                    runner, the respondent was paid $60 per day. After some time, “Ah\n                    Boy” offered the respondent harassment work. The respondent was offered\n                    $60 per unit to commit harassment by splashing paint and scribbling loanshark\n                    writings, and $150 per unit to commit harassment by setting the main door on\n                    fire. The respondent agreed and chose to commit harassment by setting fire since\n                    the payment was more attractive. 8       In order to repay his debts to a loanshark, the\n                    respondent carried out several acts of harassment over three days at a total of\n                    six different locations. The respondent cycled to each of the six target units\n                    during the wee hours to commit harassment by scribbling loanshark writings on\n                    the wall using indelible markers or spray paint and by using cloth dampened with\n                    kerosene to set the main doors on fire. “Ah Huat” acted as his\n                    lookout on some of the occasions.",
        "The District Judge’s decision": "9       The District Judge agreed with the Prosecution\n                    that a deterrent sentence was called for. He accepted that the range of\n                    precedent sentences for harassment of debtors under the current Moneylenders Act\n                    was between 10 to 14 months’ imprisonment. 10     Nevertheless, he imposed the sentence of 12\n                    months’ imprisonment and 3 strokes of the cane (the minimum number of\n                    strokes) in respect of each harassment charge for the following reasons: (a)the aggregate sentence should not have the effect\n                            of imposing a crushing sentence on the offender (the totality\n                            principle);(b)the harassment charges carry caning of between 3\n                            to 6 strokes of the cane per charge; and(c)the sentence of 12 months’ imprisonment and\n                            3 strokes of the cane is already at the higher range for such\n                            offences.The Prosecution’s appeal11     The Prosecution appealed against the\n                    individual sentences imposed in respect of the harassment by fire charges on the\n                    basis that the District Judge:(a)failed to give sufficient weight to the need for\n                            general deterrence;(b)failed to give sufficient weight to the need for\n                            specific deterrence, in light of the respondent’s\n                            antecedents;(c)failed to give sufficient weight to\n                            Parliament’s intention to take a tougher stance against\n                            loansharking-related offences under the current Moneylenders\n                        Act;(d)failed to give adequate consideration to the\n                            sentencing precedents for the offence of harassing debtors on behalf of\n                            unlicensed moneylenders under the current Moneylenders Act, as well as\n                            under s 28(2)(a) read with 28(3)(a)(i) of the previous Moneylenders\n                            Act (Act No 31 of 2008) (“the previous Moneylenders\n                            Act”);(e)failed to give adequate consideration to the\n                            sentencing precedents for the offence of mischief by fire under\n                            s 435 of the Penal Code (Cap 224, 2008 Rev Ed)\n                            (“the Penal Code”);(f)failed to place adequate weight on the\n                            aggravating factors of the present case, in particular:(i)the number of units affected and the\n                                    geographical reach of the offences;(ii)the role played by the accused and his\n                                    deliberateness as well as premeditation; and(iii)his motivation of getting easy\n                                    money.(g)placed undue weight on the alleged mitigating\n                            factors;(h)placed undue weight on the totality principle;\n                            and(i)placed undue weight on the fact that the\n                            harassment charges carried caning of between 3 to 6 strokes per\n                            charge.I will deal with each ground of appeal in turn.The need for general deterrence12     InPublic Prosecutor v Law\n                        Aik Meng[2007] 2 SLR(R) 814 (“Law Aik Meng”), VK Rajah JA identified\n                    several types of offences which by their nature warrant general deterrence at\n                    [24]:(a)offences against or relating to public\n                            institutions, such as the courts, the police and the civil\n                            service;(b)offences against vulnerable\n                        victims;(c)offences involving professional or corporate\n                            integrity or abuse of authority;(d)offences affecting public safety, public health,\n                            public services, public or widely used facilities or public\n                            security;(e)offences affecting the delivery of financial\n                            services and/or the integrity of the economic infrastructure;\n                        and(f)offences involving community and/or race\n                            relations.Rajah JA also gave examples of particular circumstances of an\n                    offence which may attract general deterrence at [25]:(a)prevalence of the offence;(b)group/syndicate offences;(c)public disquiet;(d)difficulty of detection and/or apprehension;\n                            and(e)offences affecting several\n                        victims.13     The offence of harassment by fire on behalf of\n                    unlicensed moneylenders falls within several of the broadly defined areas of\n                    misfeasance that attract general deterrence as a sentencing consideration. The\n                    offence is worryingly prevalent, greatly affects public safety, usually takes\n                    place in the context of a syndicate, and has resulted in public disquiet. The\n                    presence of these factors supports the need for a strong deterrent sentence in\n                    the present case. I will deal with each of these factors in turn.The prevalence of unlicensed moneylending and related\n                offences14     The disturbing trend of prevalence of\n                    unlicensed moneylending and harassment offences can be seen from the statistics\n                    reproduced below:15     The statistics for unlicensed moneylending and\n                    related harassment cases for 2008 and 2009 were recently highlighted in\n                    Parliament (seeSingapore Parliamentary Debates, Official\n                        Report(12 January 2010) vol 86 at col 2051)\n                    (“Second Reading of the 2010 amendment bill”). In 2008, there was\n                    a total of 11,879 unlicensed moneylending and harassment cases reported and in\n                    2009, a total of 18,645 such cases was reported. It appears that such harassment\n                    offences have also been increasing exponentially. A table showing the number of\n                    harassment cases reported for the years 2005 to 2010 follows:Number of harassment cases reported20052006200720082009Jan – Sep 2010No of cases81749912936611,40017,88312,81016     Furthermore, a new alarming trend has surfaced\n                    in which harassers have escalated their tactics with the use of fire. The\n                    statistics for harassment cases involving the setting of fire to property and,\n                    even more seriously, to premises, are as follows:Number of reported harassment cases in which fire was\n                                        used20052006200720082009Jan – Sep 2010Set property on fire0043358Set premises on fire0030131617     It can be seen that although there has been a\n                    decrease in cases involving fire tomovable\n                        property, this change has been accompanied by a shift towards\n                    even more dangerous tactics whereby thepremisesthemselves are set on fire. In the present case, the respondent’s offences\n                    belonged in the more serious category of cases as he had set fire to the doors\n                    of several HDB units.18     I also note that runners have degenerated to\n                    this new mode of harassment using fire. On 8 January 2011, the Straits\n                    Times published an article titled “Jail, caning for car-burning loan\n                    shark runner; Judge says case of debtor-turned-harasser is one of the\n                    worst”, stating that a debtor-turned-harasser had torched cars in a\n                    multi-storey carpark near a debtor’s home in Choa Chu Kang and also set\n                    fire to some newspapers in front of the flat of another debtor in Hougang after\n                    scribbling repayment demands at a nearby lift landing.19     Based on the above statistics, harassment\n                    offences, in particular those which involve setting the premises on fire, appear\n                    to be on the rise. Such offences which are usually carried out at public housing\n                    estates can and do cause public disquiet. Moreover, in the present case, the\n                    respondent committed the five harassment offences between 1am and 5am, when the\n                    residents and neighbours were likely to be sound asleep. Thismodus operanditherefore has the grave potential to delay early\n                    detection and consequently inflict serious damage to both lives and property. I\n                    should add that the offence is equally grave even if it is committed in broad\n                    daylight. Accordingly, it is both important and necessary for the courts to\n                    impose a deterrent sentence to send out a clear and strong message that such\n                    offences cannot be tolerated at all.Impact on public: safety and security20     Harassment offences threaten the safety of a\n                    considerably wider scope of persons beyond the debtors and/or sureties. Innocent\n                    victims are often utilised as deliberate targets, not because of any prior\n                    association with the illegal moneylenders, but because the unlicensed\n                    moneylenders and their “runners” see them as nothing more than a\n                    pawn in order to pressure the actual debtors to pay up. At the Second Reading of\n                    the 2010 amendment bill which brought the Moneylenders Act to its current form,\n                    the Senior Minister of State for Home Affairs [Assoc Prof Ho Peng Kee] said at\n                    col 2051:Loansharks now increasingly target innocent neighbouring households by\n                        splashing paint on their doors, or to their cars in multi-storey carparks,\n                        hoping that peer pressure would force the borrowers to pay up. Indeed, in\n                        some instances, knowing that innocent parties are frustrated, loansharks\n                        demand that they pay up on behalf of the actual debtors! These acts, though\n                        generally, non-confrontational in nature and non-life threatening,\n                        nevertheless disrupt the community’s sense of well-being.21     As a result, these innocent victims suffer\n                    much distress, even to the point of placing newspaper advertisements in a\n                    desperate attempt to inform the loansharks that they are innocent third parties:\n                    see The New Paper article titled “2 men harassed by loan sharks\n                    though they say they never borrowed money” which was published on\n                    16 September 2010. More recently, an innocent victim also wrote to the\n                    Straits Times to express her anguish and frustration at being harassed by a\n                    loanshark ever since she bought her flat from a debtor of a loan-shark three\n                    years ago: see the Straits Time article titled “Innocent loan-shark\n                    victim’s 3-year tale of endless woe” which was published on\n                    19 January 2011. In one extreme case, this frustration compelled the\n                    victims of loanshark harassment to brutally assault an innocent man who was\n                    mistaken as a runner. For the assault, the victims were sentenced to between 1\n                    to 12 months’ imprisonment: see The Straits Times article titled\n                    “Three relatives jailed for assault” which was published on\n                    15 February 2011.22     Acts of harassment also invariably create an\n                    atmosphere of fear in the neighbourhood. This is a regrettable development which\n                    must be arrested. As the court rightly pointed out inPublic\n                        Prosecutor v Soh Yew Heng[2007] SGDC 49 at\n                    [15]:There are costs and harm imposed on society by these acts of harassment.\n                        The harassment at the very least creates a breach of the peace and good\n                        public order.It fosters an atmosphere of threat and\n                            danger because of the damage to property and warning messages scrawled\n                            on walls. Residents of our various housing estates are entitled to live\n                            in surroundings free from such disturbances… The response of the\n                            Courts should therefore be both punitive and\n                        deterrent.[emphasis added]23     Such offences also cause damage to property.\n                    On 15 January 2010, the Straits Times published an article titled\n                    “Loan sharks’ vandalism costs town councils”, stating that\n                    eight town councils incur annual expenses of between $15,000 to $70,000 to\n                    rectify damage to property caused by loansharks.24     In harassment by fire cases, the adverse\n                    impact on public safety and security, as well as the economic cost, is\n                    amplified. The scope of property damage and the potential risk to human life and\n                    safety increases significantly when fire is used. The serious extent of property\n                    damage that can be caused by fire is apparent from the photographs of the fires\n                    that were set by the respondent in the present case. The fires spread to the\n                    ceiling, melting the ceiling lamps and the insulation of the electrical wirings\n                    in the common corridor. In one instance it spread close to the gas supply pipes.\n                    The total cost of the damage to property (private and public) in the present\n                    case amounted to $5,222.30. In such cases, if the fire should get out of control\n                    and spread to the electrical wiring and the gas supply pipes, it would have\n                    endangered not only the occupants of the unit being harassed but also those in\n                    the adjoining flats. The results could be catastrophic, especially in the older,\n                    narrower and more cramped HDB flats.25     Parliament has correctly recognised that\n                    harassment by fire constitutes a special category of harassment that warrants\n                    the full brunt of the law. In Parliamentary proceedings on 18 August 2009,\n                    Assoc Prof Ho stated (Singapore Parliamentary\n                        Debates,Official Report(18 August 2009), vol 86 at col 963):[W]e have enhanced penalties over the years. So in 2005, we enhanced the\n                        penalties, and in 2008, last year, we enhanced them further and upcoming, we\n                        want to enhance the penalties even more.But, really, for\n                            those harassers who cause damage to property or injury to persons, we\n                            want to emphasise the caning and indeed for those who damage property or\n                            harm persons, the element of a mandatory minimum caning will be imposed\n                            because, after all, they are threatening the well-being of others. So I\n                            think there is no question about it, these are dangerous acts and we\n                            must nip them in the bud. When Police can charge harassers\n                        under other more serious sections, eg, mischief by fire – I think\n                        there were about 35 instances this year when items had been lit outside\n                        flats and indeed like Mdm Phua said under her ward, petrol bombs were thrown\n                        – when the facts are proven, Police will also impose a higher charge\n                        to send the right signal. So let that be clear.[emphasis added]Similarly, in the Second Reading of the 2010 amendment bill, Assoc\n                    Prof Ho stated at col 2051:[T]he Police is closely monitoring the dangerous tactics employed by some\n                        loansharks, if not all, of locking people up in their homes or setting on\n                        fire items found outside their homes. If caught,these\n                            harassers will be punished with the full brunt of the\n                        law.[emphasis added]26     It is clear from the above that Parliament has\n                    recognised acts of harassment by fire to be one of the most egregious forms of\n                    harassment. Thus, the sentences imposed should be calibrated to reflect\n                    society’s particular opprobrium of such offences which have a deep\n                    negative impact on public safety and security.Syndicate offence27     Syndicate offences have been recognised as a\n                    category of offence that attracts the principle of general deterrence:Law Aik Mengat [25].28     The Second Reading of the 2010 amendment bill\n                    marked a paradigm shift in the way Parliament views loansharking and related\n                    activities. Such offences are now characterised as “syndicate”\n                    offences, carried out usually by operations with multiple layers, typically\n                    involving a financier (or “towkay”),\n                    an “ah long” who operates the\n                    “stall” which issues loans, and runners who commit acts of\n                    harassment and conduct other ground operations.29     Assoc Prof Ho stated in the Second Reading of\n                    the 2010 amendment bill at col 2051:How loanshark syndicates have evolved in other jurisdictions, including\n                        the use of violence, the cross-participation with other organised criminal\n                        activities like drug-trafficking, has convinced us that we must take tough\n                        actions to deal with this scourge before it grows to become a greater threat\n                        to our citizens’ safety.[W]e needed to shift our paradigm as to how we view loanshark syndicates,\n                        that is, from unscrupulous moneylenders charging exorbitant interest rates\n                        to being a pernicious form of organised crime. Criminal acts perpetrated by\n                        organised criminal groups are a threat to society as they are tougher to\n                        eradicate and can create greater community impact.30     In the present case, the respondent became\n                    involved in a syndicated offence when he agreed to act as a\n                    “runner” for an unlicensed moneylender “Ah Boy”. The\n                    respondent never knew who “Ah Boy” was. He interacted entirely\n                    with “Ah Huat” who handed him the necessary materials for his\n                    harassment acts and acted as a lookout for him. This is typical of how\n                    syndicated unlicensed moneylenders operate and explains why syndicate offences\n                    are particularly difficult to subdue. As Assoc Prof Ho elucidated in the Second\n                    Reading of the 2010 amendment bill at col 2051:Now, loansharks have taken to outsourcing their \"business functions\" to\n                        debtors or youths, who appear easy targets for recruitment. These operatives\n                        carry out functions ranging from assisting the loansharks in the collection\n                        of money, to effecting transfers of money electronically, to carrying out\n                        acts of harassment. They add to the layers surrounding the loanshark\n                        syndicate, shielding the leaders from direct exposure. Members are also\n                        fearful to testify against the \"ah longs\" and\n                            \"towkays\" for fear of reprisal to\n                        themselves and their families. And business continuity is high as,\n                        characteristically, the syndicates’ structure enables them to elude\n                        Police enforcement, replace lower rung members, reorganise their resources\n                        and perpetuate their criminal activities.31     I accept the Prosecution’s argument that\n                    this is a relevant consideration which attracts the application of the general\n                    deterrence principle thereby warranting an enhancement of the present sentence.\n                    Unless we cut through the layers surrounding illegal moneylenders, there will no\n                    realistic prospect of dealing with the kingpins themselves and the scourge of\n                    moneylending and their attendant offences will continue to plague\n                    society.Public disquiet32     It is apparent from the widespread coverage of\n                    harassment cases in 2010 that such cases have created a sense of fear and\n                    trepidation in the community. The installation of ever increasing number of\n                    video surveillance equipment in various HDB common corridors as well as the\n                    formation of numerous citizens’ patrol and watch groups (see the Second\n                    Reading of the 2010 amendment bill at para 4) are further testament to the\n                    unease that has been engendered amongst the members of the community by the\n                    alarming prevalence of such offences.33     Needless to say, an offence affecting a larger\n                    number of people covering a wider geographical area is more serious than one\n                    that affects few people in a limited area. In the present case, the respondent\n                    had harassed not one, but six units at different locations. This was not a case\n                    where the respondent had committed a one-off offence in a moment of folly.\n                    Rather, he persisted in his conduct and harassed several HDB units over three\n                    separate days.34     Furthermore, his offences had a wide\n                    geographical reach, from Woodlands and Yishun in the North, Hougang and\n                    Anchorvale (Sengkang) in the North East, and Geylang Bahru in the Central area,\n                    to Geylang East in the East. He therefore encroached on the safety and serenity\n                    of more than one neighbourhood. That said, this should not typically be viewed\n                    as an independent aggravating factor as it would be taken care of in sentencing\n                    by virtue of the multiple charges for which two or three would be ordered to run\n                    consecutively. Indeed in the present case, the District Judge ordered three of\n                    the sentences to run consecutively. Therefore to treat it as an independent\n                    aggravating factor would amount to double counting.The need for specific deterrence35     The principle of specific deterrence merits\n                    consideration in the present case. The respondent is no stranger to the courts,\n                    having been convicted on several occasions for different offences. Although the\n                    respondent does not have loansharking or related antecedents, his chequered past\n                    is a relevant factor for sentencing as it clearly demonstrates his cavalier\n                    disregard for the law: seeTan Kay Beng v Public\n                        Prosecutor[2006] 4 SLR(R) 10 at\n                    [14]–[16].36     Given his long list of antecedents, it would\n                    not be an exaggeration to say that the respondent has re-offended almost\n                    immediately each time after he underwent punishment for a prior offence. He was\n                    given the opportunity of rehabilitation in 2003 when he was ordered to undergo\n                    probation for theft and road traffic offences but re-offended in 2004 for\n                    similar offences. Even then, he was given another opportunity and was sentenced\n                    to reformative training. However, he still did not realise the error of his ways\n                    and went on to commit the offence of affray for which he was fined in 2007. The\n                    respondent was finally sentenced to 6 months’ imprisonment in 2009 for\n                    theft (again), together with even more serious offences (against persons). Soon\n                    after his release from prison for those offences, in January 2010, he was\n                    convicted and sentenced to 5 months’ imprisonment for road traffic\n                    offences.37     His most recent infractions show that he has\n                    escalated his criminal conduct even further in committing more serious offences\n                    involving the use of fire for harassment purposes. A sufficiently severe\n                    sentence is therefore mandated to steer him away from the path of\n                crime.Legislative Changes to the Moneylenders Act38     The legislative history of the penalty\n                    provisions for harassment offences demonstrates Parliament’s clear intent\n                    in enacting harsher penalties in order to stem the ever-increasing tide of such\n                    offences. This intent is manifested in the following changes to the punishment\n                    provisions for harassment offences resulting in property damage:(a)     with effect from 16 August\n                        1983, the punishment was revised todiscretionary\n                            imprisonmentfor a term not exceeding 12 months and/or\n                        discretionary fine of not less than $2,000 and not more than\n                    $20,000;(b)     with\n                        effect from 1 January 2006, the punishment was revised todiscretionary imprisonmentfor a term not exceeding 3 years\n                        and/or discretionary fine of not less than $4,000 and not more than $40,000.\n                        In addition, there would also bediscretionary\n                            caningof not more than 4 strokes if it is proved to the\n                        satisfaction of the court that, in the course of committing the offence,\n                        damage was caused to any property; and(c)     with effect from 11 February 2010, the punishment\n                        was revised tomandatory imprisonmentfor a\n                        term not exceeding 5 years, discretionary fine of not less than $5,000 and\n                        not more than $50,000, andmandatory caningof\n                        not less than 3 and not more than 6 strokes if it is proved to the\n                        satisfaction of the court that, in the course of committing the offence,\n                        damage was caused to any property.39     From the above summary, the penalty provisions\n                    have undergone several revisions over the years, each time resulting in harsher\n                    penalties being imposed for such offences. This amply demonstrates that the task\n                    of curbing harassment activities has been an uphill one, necessitating the\n                    enactment of increasingly severe penalties from discretionary imprisonment and\n                    caning to mandatory imprisonment and caning.40     Parliament has repeatedly articulated the need\n                    for a strong stance or a “zero tolerance” approach in order to\n                    stem the rising numbers of such offences. In the Second Reading of the 2005\n                    amendment bill (which was passed as Act 44 of 2005) that increased the maximum\n                    imprisonment term from 12 months to 3 years and also doubled the minimum and\n                    maximum fines from $2,000 to $4,000 and $20,000 to $40,000 respectively,\n                    Assoc Prof Ho stated (seeSingapore Parliamentary\n                        Debates, Official Report(21 November 2005, vol 80 at\n                    col 1831):Sir, the number of unlicensed moneylending and related harassment cases,\n                        however, continues to rise from some 1,500 cases in 1995 to almost 6,000\n                        cases last year, ie, about a four-fold increase. In some instances, parties\n                        who did not borrow money were also harassed. For example, new occupants of\n                        dwellings that were formerly occupied by debtors, and people who had lost or\n                        misplaced their identity cards. In addition, the number of arrests made in\n                        unlicensed moneylending and related harassment cases increased by almost 20%\n                        in one year, from 330 arrests in 2003 to 393 arrests in 2004.Sir, we must tackle the rise in illegal moneylending cases resolutely,\n                        adopting a comprehensive approach…Sir, as for these amendments which are under consideration, Parliament\n                        should send a strong signal to loansharks that we will not tolerate the\n                        conduct of unlicensed moneylending activities, where exorbitant interest\n                        rates are charged and borrowers and even non-borrowers are harassed in their\n                        own homes.…In conclusion, Sir, these amendments are needed to send a strong signal\n                        thatthe Government has zero tolerance for unlicensed\n                            moneylending activities. The enhanced deterrent effect should\n                        also help stem the increase that we have seen in such activities.[emphasis added]41     Unfortunately, the 2005 amendments did not\n                    succeed in curbing harassment activities. Parliament’s intent to take an\n                    even harsher stand against such activities is evident from the Second Reading\n                    speech of the 2010 amendment bill. In that speech, Assoc Prof Ho noted that the\n                    number of loanshark and harassment cases continued to increase: except for a\n                    brief respite in 2007, when the numbers of such cases dropped slightly.\n                    Professor Ho observed that the number of reports has continued to rise with\n                    11,879 cases reported in 2008 and 18,645 cases reported in 2009.42     As pointed out above, the 2010 amendments\n                    which introducedboth mandatory imprisonment and\n                        caningmarked a paradigm shift in Parliament’s treatment of\n                    unlicensed moneylending and related offences. Henceforth, they are to be viewed\n                    as syndicate offences that are particularly pernicious and must be met with the\n                    full brunt of the law.43     In light of the recent legislative changes\n                    leading to the current Moneylenders Act, Parliament has clearly adopted an even\n                    more robust stance against such harassment offences.Sentencing benchmarks44     I note that there are no reported decisions at\n                    the appellate level on cases of harassment resulting in property damage (whether\n                    by fire or other means) under the previous or current Moneylenders\n                Act.45     The present case therefore presents an\n                    opportunity for this Court to take cognizance of the recent legislative changes\n                    so as to provide guidance by clarifying the benchmark sentences that should be\n                    imposed in respect of both non-fire and fire harassment cases under the previous\n                    and current Moneylenders Act.46     Under the previous Moneylenders Act (ie, after Act 31 of 2008), sentences of between 8 to 12\n                    months’ imprisonment and 1 to 2 strokes of the cane have generally been\n                    imposed for adult offenders who carry out non-fire acts of harassment (ie, use of paint, markers, even bicycle locks) on behalf\n                    of unlicensed moneylenders: seeJoseph Ong Dick Tat v Public\n                        ProsecutorMagistrate’s Appeal No 142 of 2008 andPublic Prosecutor v Fazlie bin HasnieDAC 14581/2010. It\n                    is pertinent to highlight that the sentences were imposed when imprisonment and\n                    caning were discretionary.47     Under the current Moneylenders Act, sentences\n                    of 12 months’ imprisonment and the mandatory minimum 3 strokes of the cane\n                    have generally been imposed for non-fire with property damage cases: seePublic Prosecutor v Wu Wei ChunDAC 31830/2010\n                    andPublic Prosecutor v Kau Wui KeongDAC 19918/2010. The increase in the tariff for non-fire with property\n                    damage cases is in line with and gives effect to Parliament’s intent to\n                    take an even stronger stance on such offences. I see no reason why the benchmark\n                    for non-fire with property damage cases should be revised.48     In my view, it is manifestly clear that a\n                    distinction needs to be drawn between non-fire with property damage cases,ie, by splashing paint or scribbling with\n                    indelible ink, and fire with property damage cases such as the instant case\n                    whereby doors were set on fire with kerosene. The use of kerosene to set fire\n                    causes more significant damage to the property and endangers the lives of the\n                    occupants. Moreover, the potential to cause harm to innocent neighbouring\n                    residents and their property cannot be overlooked.49     I am of the view that the benchmark sentence\n                    for fire with property damage cases should be set at 18 months’\n                    imprisonment and 3 strokes of the caneper charge.\n                    The reason for the enhanced sentence is the aggravating nature of such offences\n                    as explained in[13]–[38]above. I should add that this benchmark is\n                    also in line with the recent unreported case ofPublic\n                        Prosecutor v Ow Chia Chye(DAC 14403/2010 & ors). In that\n                    case, the accused had committed a range of harassment offences on behalf of an\n                    unlicensed moneylender, including splashing paint and scrawling graffiti. He had\n                    set fire to a unit on one occasion. For the setting of fire, he was sentenced\n                    under the current Moneylenders Act to 18 months’ imprisonment, 3 strokes\n                    of the cane and a fine of $5,000.50     In deciding on the 18-month benchmark, I took\n                    cognizance of the benchmark sentence for causing mischief by fire under\n                    s 435 of the Penal Code. Generally, an imprisonment sentence of 3 years has\n                    typically been imposed for offences under s 435 of the Penal Code: seePublic Prosecutor v Zuraimi Bin Abdul RahimDAC 42206/2009, DAC 43200/2009, DAC 4201/2009 andPublic\n                        Prosecutor v Thiam Chin LoongDAC 32851/2009. The ingredients for\n                    a conviction under s 435 of the Penal Code and s 28(2)(a) read with\n                    s 28(3)(b)(i) of the current Moneylenders Act are practically identical.\n                    However, it was fairly highlighted to my attention by the Prosecution that a\n                    direct comparison between the two offences may not be entirely accurate because\n                    there is no provision for caning in respect of convictions under s 435 of\n                    the Penal Code. Nonetheless despite the difference, the 3-year benchmark\n                    sentence for a conviction under s 435 of the Penal Code at least provides\n                    some measure of direction on the appropriate sentence for fire harassment\n                    convictions under the current Moneylenders Act. Parliament has clearly decided\n                    that mandatory caning together with mandatory imprisonment would be more\n                    effective to deal with such insidious offences.51     The 18-month benchmark for fire harassment\n                    cases should be increased in appropriate situations where for instance the fire\n                    caused extensive damage beyond the door of the unit into the premises or onto\n                    the neighbouring unit. Any increase beyond the 18-month benchmark should be\n                    calibrated according to the extent and severity of the damage. I should add that\n                    if injuries are caused to the residents arising from the fire, thismaynot necessarily constitute an aggravating factor\n                    since separate and more serious charges would be levied against the accused\n                    under s 321 or s 322 of the Penal Code for voluntarily causing hurt or\n                    grievous hurt depending on the nature of the injuries. However, I do not rule\n                    out the possibility that injuries to resident may in appropriate cases amount to\n                    an aggravating factor for sentencing purposes.Absence of mitigating factors52     In his mitigation plea, the respondent stated\n                    that he committed the offences out of desperation due to his difficult financial\n                    circumstances, and in order to avoid harassment to himself and his\n                    family.53     It is trite that financial difficulties cannot\n                    be relied upon in mitigation of an offence save in the most exceptional or\n                    extreme of circumstances: seeLai Oei Mui Jenny v Public\n                        Prosecutor[1993] 2 SLR(R) 406 at [10].54     In keeping with this principle, the courts\n                    have generally not accorded any mitigating weight to claims that the offences in\n                    question were committed to repay loansharks. For example, inPublic Prosecutor v Ong Ker Seng[2001] 3 SLR(R) 134 at\n                    [30], the High Court did not attach any mitigating weight to the accused\n                    person’s claim that he was driven to commit the offence of obtaining loans\n                    without disclosing his undischarged bankrupt status in his desperate bid to\n                    repay loansharks who were hounding him. InSim Yeow Seng v\n                        Public Prosecutor[1995] 2 SLR(R) 466 at [10], the High\n                    Court similarly rejected the argument that the accused had committed the offence\n                    of criminal breach of trust in order to pay off loansharks.55A fortiori, no\n                    distinction should be drawn between these cases and the harassment cases.\n                    Indeed, debtors-turned-runners who have first-hand experience of what it is like\n                    to be hounded by loansharks should know better than to revisit such hardship\n                    upon third parties in a bid to escape their own predicament.56     In line with Parliament’s aim of\n                    curtailing harassment offences, I find that no mitigating weight should be\n                    accorded to the argument that the offender only committed harassment to avoid\n                    harassment of himself and his family. Many harassment acts are carried out by\n                    such debtors-turned-runners. If the Court were to impose lenient sentences on\n                    the basis of sympathy for their conundrum, the inadvertent effect would be to\n                    further encourage the continued exploitation of easy prey.57     It is clear that the law does not view an\n                    accused person’s financial plight as a mitigating factor particularly\n                    where the offence was motivated by greed and the lure of easy money. InZhao Zhipeng v Public Prosecutor[2008]\n                    4 SLR(R) 879, it was stated at [37] that:Persons who act out of pure self-interest and greed will rarely be treated\n                        with much sympathy; conversely, those who are motivated by fear will usually\n                        be found to be less blameworthy.58     In the present case, the respondent had\n                    consciously chosen to carry out harassment by fire because this would allow him\n                    to earn $150 per unit, compared with harassment using spray paint which would\n                    only earn him $60 per unit.59     As for the respondent’s submission that\n                    he was not a member of an illegal unlicensed moneylending syndicate, this\n                    utterly misses the point because by agreeing to be a runner and carrying out the\n                    offences on the instructions of an unlicensed moneylender, he had become an\n                    integral part of the moneylending ecosystem that has been characterised by\n                    Parliament as a syndicate.60     Finally, he raised a most audacious point in\n                    mitigation. He claimed that the doors to the HDB flats were incombustible and\n                    hence the fires would not have hurt anyone. However, it cannot be ignored that\n                    it is quite common for residents to place items such as shoe racks, empty boxes\n                    and other items which are combustible outside the doors and along the corridors.\n                    The risk of such items catching fire is both real and possible. In fact in the\n                    present case, the fire did cause the electrical wiring and the ceiling lamp\n                    along the common corridor to melt. In one case, the fire spread to an area which\n                    was close to the gas supply pipes.61     For the above reasons, I find that the\n                    respondent’s mitigation plea disclosed no basis whatsoever for a lighter\n                    sentence in the present case.Undue weight placed on the totality principle62     I cannot agree with the District Judge’s\n                    decision to impose a lighter sentence for each of the individual harassment by\n                    fire charges on the basis of the totality principle. In this regard, I accept\n                    the Prosecution’s submission that the imposition of low sentences for such\n                    charges would invariably have a “downstream” effect on the\n                    sentences for non-fire with property damage cases. In other words, the low\n                    sentence for fire with property damage cases would push the sentences for\n                    non-fire cases downwards correspondingly. This would be inconsistent with\n                    Parliament’s intent of taking a stronger stance on harassment activities\n                    as exemplified in the 2010 amendments.63     For example, if the sentence for each of the\n                    harassment by fire charges were to remain at 12 months’ imprisonment with\n                    the mandatory minimum 3 strokes of the cane, the sentence for non-fire with\n                    property damage cases under the current Moneylenders Act should logically have\n                    to be less than 12 months’ imprisonment with the mandatory minimum 3\n                    strokes of the cane. In other words, the sentencing tariff for non-fire with\n                    property damage cases under the present Moneylenders Act would not have\n                    increased from the previous Moneylenders Act. Such a token increase in the\n                    sentencing tariff is unlikely to have the deterrent effect that was envisaged by\n                    Parliament in enacting the 2010 amendments.Mandatory caning should not affect custodial term64     It also appears that the District Judge had\n                    taken into account the mandatory caning of at least 3 strokes per charge for\n                    fire harassment cases in arriving at the 12-month imprisonment term that was\n                    imposed on the respondent.65     It might be argued that the custodial terms\n                    for harassment offences under the current Moneylenders Act should be calibrated\n                    to reflect the fact that there is a mandatory minimum of 3 strokes of the\n                    cane.66     However, this could not have been\n                    Parliament’s intent in enacting the current Moneylenders Act.\n                    Parliament’s intent was to take a harsher stance on unlicensed\n                    moneylending and related offences because it was evident that the previous\n                    penalties were not sufficiently effectual in reducing such crimes.67     If the courts were to “soften”\n                    the custodial sentences under the current Moneylenders Act to\n                    “offset” the caning imposed, the net deterrent effect would not be\n                    as significant as intended. This would undermine the purpose of enhancing the\n                    penalties as a deterrent against such offences.68     Accordingly, I find that the present sentence\n                    of 12 months’ imprisonment and 3 strokes of the cane per harassment charge\n                    would not adequately reflect the heightened seriousness with which Parliament\n                    views such offences.Conclusion69     Taking into account all the above\n                    considerations, in particular the actual damage caused by the fires and the\n                    potential risk to human life and safety, I am of the view that it is sufficient\n                    to enhance the sentence for each of the five harassment convictions before me to\n                    18 months. The imprisonment sentences for three of the harassment charges are to\n                    run consecutively, totalling 54 months’ imprisonment. These sentences\n                    reflect society’s particular opprobrium of such offences which have a deep\n                    negative impact on public safety and security. If the damage to the properties\n                    had been more serious, I would have no hesitation in imposing a stiffer term of\n                    imprisonment. The imprisonment sentences for the two remaining harassment\n                    charges and the charge for assisting in the moneylending business as ordered\n                    below are to run concurrently with the 54 months’ imprisonment sentence.\n                    There will be no change to the 15 strokes of cane ordered below.70     Accordingly, the total sentence for DAC 18860\n                    of 2010, DAC 19746 to 19749 of 2010, and DAC 19751 of 2010 is therefore 54\n                    months’ imprisonment and 15 strokes of the cane. As the offender has been\n                    in remand since 30 April 2010, the sentence of imprisonment is to take effect\n                    from that date.71     It leaves me to record my gratitude and\n                    appreciation to Mr Hay Hung Chun and Ms Peggy Pao for their comprehensive and\n                    well-researched submissions which provided considerable assistance to me in the\n                    drafting of this decision.",
        "The Prosecution’s appeal": "11     The Prosecution appealed against the\n                    individual sentences imposed in respect of the harassment by fire charges on the\n                    basis that the District Judge: (a)failed to give sufficient weight to the need for\n                            general deterrence;(b)failed to give sufficient weight to the need for\n                            specific deterrence, in light of the respondent’s\n                            antecedents;(c)failed to give sufficient weight to\n                            Parliament’s intention to take a tougher stance against\n                            loansharking-related offences under the current Moneylenders\n                        Act;(d)failed to give adequate consideration to the\n                            sentencing precedents for the offence of harassing debtors on behalf of\n                            unlicensed moneylenders under the current Moneylenders Act, as well as\n                            under s 28(2)(a) read with 28(3)(a)(i) of the previous Moneylenders\n                            Act (Act No 31 of 2008) (“the previous Moneylenders\n                            Act”);(e)failed to give adequate consideration to the\n                            sentencing precedents for the offence of mischief by fire under\n                            s 435 of the Penal Code (Cap 224, 2008 Rev Ed)\n                            (“the Penal Code”);(f)failed to place adequate weight on the\n                            aggravating factors of the present case, in particular:(i)the number of units affected and the\n                                    geographical reach of the offences;(ii)the role played by the accused and his\n                                    deliberateness as well as premeditation; and(iii)his motivation of getting easy\n                                    money.(g)placed undue weight on the alleged mitigating\n                            factors;(h)placed undue weight on the totality principle;\n                            and(i)placed undue weight on the fact that the\n                            harassment charges carried caning of between 3 to 6 strokes per\n                            charge.I will deal with each ground of appeal in turn.The need for general deterrence12     InPublic Prosecutor v Law\n                        Aik Meng[2007] 2 SLR(R) 814 (“Law Aik Meng”), VK Rajah JA identified\n                    several types of offences which by their nature warrant general deterrence at\n                    [24]:(a)offences against or relating to public\n                            institutions, such as the courts, the police and the civil\n                            service;(b)offences against vulnerable\n                        victims;(c)offences involving professional or corporate\n                            integrity or abuse of authority;(d)offences affecting public safety, public health,\n                            public services, public or widely used facilities or public\n                            security;(e)offences affecting the delivery of financial\n                            services and/or the integrity of the economic infrastructure;\n                        and(f)offences involving community and/or race\n                            relations.Rajah JA also gave examples of particular circumstances of an\n                    offence which may attract general deterrence at [25]:(a)prevalence of the offence;(b)group/syndicate offences;(c)public disquiet;(d)difficulty of detection and/or apprehension;\n                            and(e)offences affecting several\n                        victims.13     The offence of harassment by fire on behalf of\n                    unlicensed moneylenders falls within several of the broadly defined areas of\n                    misfeasance that attract general deterrence as a sentencing consideration. The\n                    offence is worryingly prevalent, greatly affects public safety, usually takes\n                    place in the context of a syndicate, and has resulted in public disquiet. The\n                    presence of these factors supports the need for a strong deterrent sentence in\n                    the present case. I will deal with each of these factors in turn.The prevalence of unlicensed moneylending and related\n                offences14     The disturbing trend of prevalence of\n                    unlicensed moneylending and harassment offences can be seen from the statistics\n                    reproduced below:15     The statistics for unlicensed moneylending and\n                    related harassment cases for 2008 and 2009 were recently highlighted in\n                    Parliament (seeSingapore Parliamentary Debates, Official\n                        Report(12 January 2010) vol 86 at col 2051)\n                    (“Second Reading of the 2010 amendment bill”). In 2008, there was\n                    a total of 11,879 unlicensed moneylending and harassment cases reported and in\n                    2009, a total of 18,645 such cases was reported. It appears that such harassment\n                    offences have also been increasing exponentially. A table showing the number of\n                    harassment cases reported for the years 2005 to 2010 follows:Number of harassment cases reported20052006200720082009Jan – Sep 2010No of cases81749912936611,40017,88312,81016     Furthermore, a new alarming trend has surfaced\n                    in which harassers have escalated their tactics with the use of fire. The\n                    statistics for harassment cases involving the setting of fire to property and,\n                    even more seriously, to premises, are as follows:Number of reported harassment cases in which fire was\n                                        used20052006200720082009Jan – Sep 2010Set property on fire0043358Set premises on fire0030131617     It can be seen that although there has been a\n                    decrease in cases involving fire tomovable\n                        property, this change has been accompanied by a shift towards\n                    even more dangerous tactics whereby thepremisesthemselves are set on fire. In the present case, the respondent’s offences\n                    belonged in the more serious category of cases as he had set fire to the doors\n                    of several HDB units.18     I also note that runners have degenerated to\n                    this new mode of harassment using fire. On 8 January 2011, the Straits\n                    Times published an article titled “Jail, caning for car-burning loan\n                    shark runner; Judge says case of debtor-turned-harasser is one of the\n                    worst”, stating that a debtor-turned-harasser had torched cars in a\n                    multi-storey carpark near a debtor’s home in Choa Chu Kang and also set\n                    fire to some newspapers in front of the flat of another debtor in Hougang after\n                    scribbling repayment demands at a nearby lift landing.19     Based on the above statistics, harassment\n                    offences, in particular those which involve setting the premises on fire, appear\n                    to be on the rise. Such offences which are usually carried out at public housing\n                    estates can and do cause public disquiet. Moreover, in the present case, the\n                    respondent committed the five harassment offences between 1am and 5am, when the\n                    residents and neighbours were likely to be sound asleep. Thismodus operanditherefore has the grave potential to delay early\n                    detection and consequently inflict serious damage to both lives and property. I\n                    should add that the offence is equally grave even if it is committed in broad\n                    daylight. Accordingly, it is both important and necessary for the courts to\n                    impose a deterrent sentence to send out a clear and strong message that such\n                    offences cannot be tolerated at all.Impact on public: safety and security20     Harassment offences threaten the safety of a\n                    considerably wider scope of persons beyond the debtors and/or sureties. Innocent\n                    victims are often utilised as deliberate targets, not because of any prior\n                    association with the illegal moneylenders, but because the unlicensed\n                    moneylenders and their “runners” see them as nothing more than a\n                    pawn in order to pressure the actual debtors to pay up. At the Second Reading of\n                    the 2010 amendment bill which brought the Moneylenders Act to its current form,\n                    the Senior Minister of State for Home Affairs [Assoc Prof Ho Peng Kee] said at\n                    col 2051:Loansharks now increasingly target innocent neighbouring households by\n                        splashing paint on their doors, or to their cars in multi-storey carparks,\n                        hoping that peer pressure would force the borrowers to pay up. Indeed, in\n                        some instances, knowing that innocent parties are frustrated, loansharks\n                        demand that they pay up on behalf of the actual debtors! These acts, though\n                        generally, non-confrontational in nature and non-life threatening,\n                        nevertheless disrupt the community’s sense of well-being.21     As a result, these innocent victims suffer\n                    much distress, even to the point of placing newspaper advertisements in a\n                    desperate attempt to inform the loansharks that they are innocent third parties:\n                    see The New Paper article titled “2 men harassed by loan sharks\n                    though they say they never borrowed money” which was published on\n                    16 September 2010. More recently, an innocent victim also wrote to the\n                    Straits Times to express her anguish and frustration at being harassed by a\n                    loanshark ever since she bought her flat from a debtor of a loan-shark three\n                    years ago: see the Straits Time article titled “Innocent loan-shark\n                    victim’s 3-year tale of endless woe” which was published on\n                    19 January 2011. In one extreme case, this frustration compelled the\n                    victims of loanshark harassment to brutally assault an innocent man who was\n                    mistaken as a runner. For the assault, the victims were sentenced to between 1\n                    to 12 months’ imprisonment: see The Straits Times article titled\n                    “Three relatives jailed for assault” which was published on\n                    15 February 2011.22     Acts of harassment also invariably create an\n                    atmosphere of fear in the neighbourhood. This is a regrettable development which\n                    must be arrested. As the court rightly pointed out inPublic\n                        Prosecutor v Soh Yew Heng[2007] SGDC 49 at\n                    [15]:There are costs and harm imposed on society by these acts of harassment.\n                        The harassment at the very least creates a breach of the peace and good\n                        public order.It fosters an atmosphere of threat and\n                            danger because of the damage to property and warning messages scrawled\n                            on walls. Residents of our various housing estates are entitled to live\n                            in surroundings free from such disturbances… The response of the\n                            Courts should therefore be both punitive and\n                        deterrent.[emphasis added]23     Such offences also cause damage to property.\n                    On 15 January 2010, the Straits Times published an article titled\n                    “Loan sharks’ vandalism costs town councils”, stating that\n                    eight town councils incur annual expenses of between $15,000 to $70,000 to\n                    rectify damage to property caused by loansharks.24     In harassment by fire cases, the adverse\n                    impact on public safety and security, as well as the economic cost, is\n                    amplified. The scope of property damage and the potential risk to human life and\n                    safety increases significantly when fire is used. The serious extent of property\n                    damage that can be caused by fire is apparent from the photographs of the fires\n                    that were set by the respondent in the present case. The fires spread to the\n                    ceiling, melting the ceiling lamps and the insulation of the electrical wirings\n                    in the common corridor. In one instance it spread close to the gas supply pipes.\n                    The total cost of the damage to property (private and public) in the present\n                    case amounted to $5,222.30. In such cases, if the fire should get out of control\n                    and spread to the electrical wiring and the gas supply pipes, it would have\n                    endangered not only the occupants of the unit being harassed but also those in\n                    the adjoining flats. The results could be catastrophic, especially in the older,\n                    narrower and more cramped HDB flats.25     Parliament has correctly recognised that\n                    harassment by fire constitutes a special category of harassment that warrants\n                    the full brunt of the law. In Parliamentary proceedings on 18 August 2009,\n                    Assoc Prof Ho stated (Singapore Parliamentary\n                        Debates,Official Report(18 August 2009), vol 86 at col 963):[W]e have enhanced penalties over the years. So in 2005, we enhanced the\n                        penalties, and in 2008, last year, we enhanced them further and upcoming, we\n                        want to enhance the penalties even more.But, really, for\n                            those harassers who cause damage to property or injury to persons, we\n                            want to emphasise the caning and indeed for those who damage property or\n                            harm persons, the element of a mandatory minimum caning will be imposed\n                            because, after all, they are threatening the well-being of others. So I\n                            think there is no question about it, these are dangerous acts and we\n                            must nip them in the bud. When Police can charge harassers\n                        under other more serious sections, eg, mischief by fire – I think\n                        there were about 35 instances this year when items had been lit outside\n                        flats and indeed like Mdm Phua said under her ward, petrol bombs were thrown\n                        – when the facts are proven, Police will also impose a higher charge\n                        to send the right signal. So let that be clear.[emphasis added]Similarly, in the Second Reading of the 2010 amendment bill, Assoc\n                    Prof Ho stated at col 2051:[T]he Police is closely monitoring the dangerous tactics employed by some\n                        loansharks, if not all, of locking people up in their homes or setting on\n                        fire items found outside their homes. If caught,these\n                            harassers will be punished with the full brunt of the\n                        law.[emphasis added]26     It is clear from the above that Parliament has\n                    recognised acts of harassment by fire to be one of the most egregious forms of\n                    harassment. Thus, the sentences imposed should be calibrated to reflect\n                    society’s particular opprobrium of such offences which have a deep\n                    negative impact on public safety and security.Syndicate offence27     Syndicate offences have been recognised as a\n                    category of offence that attracts the principle of general deterrence:Law Aik Mengat [25].28     The Second Reading of the 2010 amendment bill\n                    marked a paradigm shift in the way Parliament views loansharking and related\n                    activities. Such offences are now characterised as “syndicate”\n                    offences, carried out usually by operations with multiple layers, typically\n                    involving a financier (or “towkay”),\n                    an “ah long” who operates the\n                    “stall” which issues loans, and runners who commit acts of\n                    harassment and conduct other ground operations.29     Assoc Prof Ho stated in the Second Reading of\n                    the 2010 amendment bill at col 2051:How loanshark syndicates have evolved in other jurisdictions, including\n                        the use of violence, the cross-participation with other organised criminal\n                        activities like drug-trafficking, has convinced us that we must take tough\n                        actions to deal with this scourge before it grows to become a greater threat\n                        to our citizens’ safety.[W]e needed to shift our paradigm as to how we view loanshark syndicates,\n                        that is, from unscrupulous moneylenders charging exorbitant interest rates\n                        to being a pernicious form of organised crime. Criminal acts perpetrated by\n                        organised criminal groups are a threat to society as they are tougher to\n                        eradicate and can create greater community impact.30     In the present case, the respondent became\n                    involved in a syndicated offence when he agreed to act as a\n                    “runner” for an unlicensed moneylender “Ah Boy”. The\n                    respondent never knew who “Ah Boy” was. He interacted entirely\n                    with “Ah Huat” who handed him the necessary materials for his\n                    harassment acts and acted as a lookout for him. This is typical of how\n                    syndicated unlicensed moneylenders operate and explains why syndicate offences\n                    are particularly difficult to subdue. As Assoc Prof Ho elucidated in the Second\n                    Reading of the 2010 amendment bill at col 2051:Now, loansharks have taken to outsourcing their \"business functions\" to\n                        debtors or youths, who appear easy targets for recruitment. These operatives\n                        carry out functions ranging from assisting the loansharks in the collection\n                        of money, to effecting transfers of money electronically, to carrying out\n                        acts of harassment. They add to the layers surrounding the loanshark\n                        syndicate, shielding the leaders from direct exposure. Members are also\n                        fearful to testify against the \"ah longs\" and\n                            \"towkays\" for fear of reprisal to\n                        themselves and their families. And business continuity is high as,\n                        characteristically, the syndicates’ structure enables them to elude\n                        Police enforcement, replace lower rung members, reorganise their resources\n                        and perpetuate their criminal activities.31     I accept the Prosecution’s argument that\n                    this is a relevant consideration which attracts the application of the general\n                    deterrence principle thereby warranting an enhancement of the present sentence.\n                    Unless we cut through the layers surrounding illegal moneylenders, there will no\n                    realistic prospect of dealing with the kingpins themselves and the scourge of\n                    moneylending and their attendant offences will continue to plague\n                    society.Public disquiet32     It is apparent from the widespread coverage of\n                    harassment cases in 2010 that such cases have created a sense of fear and\n                    trepidation in the community. The installation of ever increasing number of\n                    video surveillance equipment in various HDB common corridors as well as the\n                    formation of numerous citizens’ patrol and watch groups (see the Second\n                    Reading of the 2010 amendment bill at para 4) are further testament to the\n                    unease that has been engendered amongst the members of the community by the\n                    alarming prevalence of such offences.33     Needless to say, an offence affecting a larger\n                    number of people covering a wider geographical area is more serious than one\n                    that affects few people in a limited area. In the present case, the respondent\n                    had harassed not one, but six units at different locations. This was not a case\n                    where the respondent had committed a one-off offence in a moment of folly.\n                    Rather, he persisted in his conduct and harassed several HDB units over three\n                    separate days.34     Furthermore, his offences had a wide\n                    geographical reach, from Woodlands and Yishun in the North, Hougang and\n                    Anchorvale (Sengkang) in the North East, and Geylang Bahru in the Central area,\n                    to Geylang East in the East. He therefore encroached on the safety and serenity\n                    of more than one neighbourhood. That said, this should not typically be viewed\n                    as an independent aggravating factor as it would be taken care of in sentencing\n                    by virtue of the multiple charges for which two or three would be ordered to run\n                    consecutively. Indeed in the present case, the District Judge ordered three of\n                    the sentences to run consecutively. Therefore to treat it as an independent\n                    aggravating factor would amount to double counting.The need for specific deterrence35     The principle of specific deterrence merits\n                    consideration in the present case. The respondent is no stranger to the courts,\n                    having been convicted on several occasions for different offences. Although the\n                    respondent does not have loansharking or related antecedents, his chequered past\n                    is a relevant factor for sentencing as it clearly demonstrates his cavalier\n                    disregard for the law: seeTan Kay Beng v Public\n                        Prosecutor[2006] 4 SLR(R) 10 at\n                    [14]–[16].36     Given his long list of antecedents, it would\n                    not be an exaggeration to say that the respondent has re-offended almost\n                    immediately each time after he underwent punishment for a prior offence. He was\n                    given the opportunity of rehabilitation in 2003 when he was ordered to undergo\n                    probation for theft and road traffic offences but re-offended in 2004 for\n                    similar offences. Even then, he was given another opportunity and was sentenced\n                    to reformative training. However, he still did not realise the error of his ways\n                    and went on to commit the offence of affray for which he was fined in 2007. The\n                    respondent was finally sentenced to 6 months’ imprisonment in 2009 for\n                    theft (again), together with even more serious offences (against persons). Soon\n                    after his release from prison for those offences, in January 2010, he was\n                    convicted and sentenced to 5 months’ imprisonment for road traffic\n                    offences.37     His most recent infractions show that he has\n                    escalated his criminal conduct even further in committing more serious offences\n                    involving the use of fire for harassment purposes. A sufficiently severe\n                    sentence is therefore mandated to steer him away from the path of\n                crime.Legislative Changes to the Moneylenders Act38     The legislative history of the penalty\n                    provisions for harassment offences demonstrates Parliament’s clear intent\n                    in enacting harsher penalties in order to stem the ever-increasing tide of such\n                    offences. This intent is manifested in the following changes to the punishment\n                    provisions for harassment offences resulting in property damage:(a)     with effect from 16 August\n                        1983, the punishment was revised todiscretionary\n                            imprisonmentfor a term not exceeding 12 months and/or\n                        discretionary fine of not less than $2,000 and not more than\n                    $20,000;(b)     with\n                        effect from 1 January 2006, the punishment was revised todiscretionary imprisonmentfor a term not exceeding 3 years\n                        and/or discretionary fine of not less than $4,000 and not more than $40,000.\n                        In addition, there would also bediscretionary\n                            caningof not more than 4 strokes if it is proved to the\n                        satisfaction of the court that, in the course of committing the offence,\n                        damage was caused to any property; and(c)     with effect from 11 February 2010, the punishment\n                        was revised tomandatory imprisonmentfor a\n                        term not exceeding 5 years, discretionary fine of not less than $5,000 and\n                        not more than $50,000, andmandatory caningof\n                        not less than 3 and not more than 6 strokes if it is proved to the\n                        satisfaction of the court that, in the course of committing the offence,\n                        damage was caused to any property.39     From the above summary, the penalty provisions\n                    have undergone several revisions over the years, each time resulting in harsher\n                    penalties being imposed for such offences. This amply demonstrates that the task\n                    of curbing harassment activities has been an uphill one, necessitating the\n                    enactment of increasingly severe penalties from discretionary imprisonment and\n                    caning to mandatory imprisonment and caning.40     Parliament has repeatedly articulated the need\n                    for a strong stance or a “zero tolerance” approach in order to\n                    stem the rising numbers of such offences. In the Second Reading of the 2005\n                    amendment bill (which was passed as Act 44 of 2005) that increased the maximum\n                    imprisonment term from 12 months to 3 years and also doubled the minimum and\n                    maximum fines from $2,000 to $4,000 and $20,000 to $40,000 respectively,\n                    Assoc Prof Ho stated (seeSingapore Parliamentary\n                        Debates, Official Report(21 November 2005, vol 80 at\n                    col 1831):Sir, the number of unlicensed moneylending and related harassment cases,\n                        however, continues to rise from some 1,500 cases in 1995 to almost 6,000\n                        cases last year, ie, about a four-fold increase. In some instances, parties\n                        who did not borrow money were also harassed. For example, new occupants of\n                        dwellings that were formerly occupied by debtors, and people who had lost or\n                        misplaced their identity cards. In addition, the number of arrests made in\n                        unlicensed moneylending and related harassment cases increased by almost 20%\n                        in one year, from 330 arrests in 2003 to 393 arrests in 2004.Sir, we must tackle the rise in illegal moneylending cases resolutely,\n                        adopting a comprehensive approach…Sir, as for these amendments which are under consideration, Parliament\n                        should send a strong signal to loansharks that we will not tolerate the\n                        conduct of unlicensed moneylending activities, where exorbitant interest\n                        rates are charged and borrowers and even non-borrowers are harassed in their\n                        own homes.…In conclusion, Sir, these amendments are needed to send a strong signal\n                        thatthe Government has zero tolerance for unlicensed\n                            moneylending activities. The enhanced deterrent effect should\n                        also help stem the increase that we have seen in such activities.[emphasis added]41     Unfortunately, the 2005 amendments did not\n                    succeed in curbing harassment activities. Parliament’s intent to take an\n                    even harsher stand against such activities is evident from the Second Reading\n                    speech of the 2010 amendment bill. In that speech, Assoc Prof Ho noted that the\n                    number of loanshark and harassment cases continued to increase: except for a\n                    brief respite in 2007, when the numbers of such cases dropped slightly.\n                    Professor Ho observed that the number of reports has continued to rise with\n                    11,879 cases reported in 2008 and 18,645 cases reported in 2009.42     As pointed out above, the 2010 amendments\n                    which introducedboth mandatory imprisonment and\n                        caningmarked a paradigm shift in Parliament’s treatment of\n                    unlicensed moneylending and related offences. Henceforth, they are to be viewed\n                    as syndicate offences that are particularly pernicious and must be met with the\n                    full brunt of the law.43     In light of the recent legislative changes\n                    leading to the current Moneylenders Act, Parliament has clearly adopted an even\n                    more robust stance against such harassment offences.Sentencing benchmarks44     I note that there are no reported decisions at\n                    the appellate level on cases of harassment resulting in property damage (whether\n                    by fire or other means) under the previous or current Moneylenders\n                Act.45     The present case therefore presents an\n                    opportunity for this Court to take cognizance of the recent legislative changes\n                    so as to provide guidance by clarifying the benchmark sentences that should be\n                    imposed in respect of both non-fire and fire harassment cases under the previous\n                    and current Moneylenders Act.46     Under the previous Moneylenders Act (ie, after Act 31 of 2008), sentences of between 8 to 12\n                    months’ imprisonment and 1 to 2 strokes of the cane have generally been\n                    imposed for adult offenders who carry out non-fire acts of harassment (ie, use of paint, markers, even bicycle locks) on behalf\n                    of unlicensed moneylenders: seeJoseph Ong Dick Tat v Public\n                        ProsecutorMagistrate’s Appeal No 142 of 2008 andPublic Prosecutor v Fazlie bin HasnieDAC 14581/2010. It\n                    is pertinent to highlight that the sentences were imposed when imprisonment and\n                    caning were discretionary.47     Under the current Moneylenders Act, sentences\n                    of 12 months’ imprisonment and the mandatory minimum 3 strokes of the cane\n                    have generally been imposed for non-fire with property damage cases: seePublic Prosecutor v Wu Wei ChunDAC 31830/2010\n                    andPublic Prosecutor v Kau Wui KeongDAC 19918/2010. The increase in the tariff for non-fire with property\n                    damage cases is in line with and gives effect to Parliament’s intent to\n                    take an even stronger stance on such offences. I see no reason why the benchmark\n                    for non-fire with property damage cases should be revised.48     In my view, it is manifestly clear that a\n                    distinction needs to be drawn between non-fire with property damage cases,ie, by splashing paint or scribbling with\n                    indelible ink, and fire with property damage cases such as the instant case\n                    whereby doors were set on fire with kerosene. The use of kerosene to set fire\n                    causes more significant damage to the property and endangers the lives of the\n                    occupants. Moreover, the potential to cause harm to innocent neighbouring\n                    residents and their property cannot be overlooked.49     I am of the view that the benchmark sentence\n                    for fire with property damage cases should be set at 18 months’\n                    imprisonment and 3 strokes of the caneper charge.\n                    The reason for the enhanced sentence is the aggravating nature of such offences\n                    as explained in[13]–[38]above. I should add that this benchmark is\n                    also in line with the recent unreported case ofPublic\n                        Prosecutor v Ow Chia Chye(DAC 14403/2010 & ors). In that\n                    case, the accused had committed a range of harassment offences on behalf of an\n                    unlicensed moneylender, including splashing paint and scrawling graffiti. He had\n                    set fire to a unit on one occasion. For the setting of fire, he was sentenced\n                    under the current Moneylenders Act to 18 months’ imprisonment, 3 strokes\n                    of the cane and a fine of $5,000.50     In deciding on the 18-month benchmark, I took\n                    cognizance of the benchmark sentence for causing mischief by fire under\n                    s 435 of the Penal Code. Generally, an imprisonment sentence of 3 years has\n                    typically been imposed for offences under s 435 of the Penal Code: seePublic Prosecutor v Zuraimi Bin Abdul RahimDAC 42206/2009, DAC 43200/2009, DAC 4201/2009 andPublic\n                        Prosecutor v Thiam Chin LoongDAC 32851/2009. The ingredients for\n                    a conviction under s 435 of the Penal Code and s 28(2)(a) read with\n                    s 28(3)(b)(i) of the current Moneylenders Act are practically identical.\n                    However, it was fairly highlighted to my attention by the Prosecution that a\n                    direct comparison between the two offences may not be entirely accurate because\n                    there is no provision for caning in respect of convictions under s 435 of\n                    the Penal Code. Nonetheless despite the difference, the 3-year benchmark\n                    sentence for a conviction under s 435 of the Penal Code at least provides\n                    some measure of direction on the appropriate sentence for fire harassment\n                    convictions under the current Moneylenders Act. Parliament has clearly decided\n                    that mandatory caning together with mandatory imprisonment would be more\n                    effective to deal with such insidious offences.51     The 18-month benchmark for fire harassment\n                    cases should be increased in appropriate situations where for instance the fire\n                    caused extensive damage beyond the door of the unit into the premises or onto\n                    the neighbouring unit. Any increase beyond the 18-month benchmark should be\n                    calibrated according to the extent and severity of the damage. I should add that\n                    if injuries are caused to the residents arising from the fire, thismaynot necessarily constitute an aggravating factor\n                    since separate and more serious charges would be levied against the accused\n                    under s 321 or s 322 of the Penal Code for voluntarily causing hurt or\n                    grievous hurt depending on the nature of the injuries. However, I do not rule\n                    out the possibility that injuries to resident may in appropriate cases amount to\n                    an aggravating factor for sentencing purposes.Absence of mitigating factors52     In his mitigation plea, the respondent stated\n                    that he committed the offences out of desperation due to his difficult financial\n                    circumstances, and in order to avoid harassment to himself and his\n                    family.53     It is trite that financial difficulties cannot\n                    be relied upon in mitigation of an offence save in the most exceptional or\n                    extreme of circumstances: seeLai Oei Mui Jenny v Public\n                        Prosecutor[1993] 2 SLR(R) 406 at [10].54     In keeping with this principle, the courts\n                    have generally not accorded any mitigating weight to claims that the offences in\n                    question were committed to repay loansharks. For example, inPublic Prosecutor v Ong Ker Seng[2001] 3 SLR(R) 134 at\n                    [30], the High Court did not attach any mitigating weight to the accused\n                    person’s claim that he was driven to commit the offence of obtaining loans\n                    without disclosing his undischarged bankrupt status in his desperate bid to\n                    repay loansharks who were hounding him. InSim Yeow Seng v\n                        Public Prosecutor[1995] 2 SLR(R) 466 at [10], the High\n                    Court similarly rejected the argument that the accused had committed the offence\n                    of criminal breach of trust in order to pay off loansharks.55A fortiori, no\n                    distinction should be drawn between these cases and the harassment cases.\n                    Indeed, debtors-turned-runners who have first-hand experience of what it is like\n                    to be hounded by loansharks should know better than to revisit such hardship\n                    upon third parties in a bid to escape their own predicament.56     In line with Parliament’s aim of\n                    curtailing harassment offences, I find that no mitigating weight should be\n                    accorded to the argument that the offender only committed harassment to avoid\n                    harassment of himself and his family. Many harassment acts are carried out by\n                    such debtors-turned-runners. If the Court were to impose lenient sentences on\n                    the basis of sympathy for their conundrum, the inadvertent effect would be to\n                    further encourage the continued exploitation of easy prey.57     It is clear that the law does not view an\n                    accused person’s financial plight as a mitigating factor particularly\n                    where the offence was motivated by greed and the lure of easy money. InZhao Zhipeng v Public Prosecutor[2008]\n                    4 SLR(R) 879, it was stated at [37] that:Persons who act out of pure self-interest and greed will rarely be treated\n                        with much sympathy; conversely, those who are motivated by fear will usually\n                        be found to be less blameworthy.58     In the present case, the respondent had\n                    consciously chosen to carry out harassment by fire because this would allow him\n                    to earn $150 per unit, compared with harassment using spray paint which would\n                    only earn him $60 per unit.59     As for the respondent’s submission that\n                    he was not a member of an illegal unlicensed moneylending syndicate, this\n                    utterly misses the point because by agreeing to be a runner and carrying out the\n                    offences on the instructions of an unlicensed moneylender, he had become an\n                    integral part of the moneylending ecosystem that has been characterised by\n                    Parliament as a syndicate.60     Finally, he raised a most audacious point in\n                    mitigation. He claimed that the doors to the HDB flats were incombustible and\n                    hence the fires would not have hurt anyone. However, it cannot be ignored that\n                    it is quite common for residents to place items such as shoe racks, empty boxes\n                    and other items which are combustible outside the doors and along the corridors.\n                    The risk of such items catching fire is both real and possible. In fact in the\n                    present case, the fire did cause the electrical wiring and the ceiling lamp\n                    along the common corridor to melt. In one case, the fire spread to an area which\n                    was close to the gas supply pipes.61     For the above reasons, I find that the\n                    respondent’s mitigation plea disclosed no basis whatsoever for a lighter\n                    sentence in the present case.Undue weight placed on the totality principle62     I cannot agree with the District Judge’s\n                    decision to impose a lighter sentence for each of the individual harassment by\n                    fire charges on the basis of the totality principle. In this regard, I accept\n                    the Prosecution’s submission that the imposition of low sentences for such\n                    charges would invariably have a “downstream” effect on the\n                    sentences for non-fire with property damage cases. In other words, the low\n                    sentence for fire with property damage cases would push the sentences for\n                    non-fire cases downwards correspondingly. This would be inconsistent with\n                    Parliament’s intent of taking a stronger stance on harassment activities\n                    as exemplified in the 2010 amendments.63     For example, if the sentence for each of the\n                    harassment by fire charges were to remain at 12 months’ imprisonment with\n                    the mandatory minimum 3 strokes of the cane, the sentence for non-fire with\n                    property damage cases under the current Moneylenders Act should logically have\n                    to be less than 12 months’ imprisonment with the mandatory minimum 3\n                    strokes of the cane. In other words, the sentencing tariff for non-fire with\n                    property damage cases under the present Moneylenders Act would not have\n                    increased from the previous Moneylenders Act. Such a token increase in the\n                    sentencing tariff is unlikely to have the deterrent effect that was envisaged by\n                    Parliament in enacting the 2010 amendments.Mandatory caning should not affect custodial term64     It also appears that the District Judge had\n                    taken into account the mandatory caning of at least 3 strokes per charge for\n                    fire harassment cases in arriving at the 12-month imprisonment term that was\n                    imposed on the respondent.65     It might be argued that the custodial terms\n                    for harassment offences under the current Moneylenders Act should be calibrated\n                    to reflect the fact that there is a mandatory minimum of 3 strokes of the\n                    cane.66     However, this could not have been\n                    Parliament’s intent in enacting the current Moneylenders Act.\n                    Parliament’s intent was to take a harsher stance on unlicensed\n                    moneylending and related offences because it was evident that the previous\n                    penalties were not sufficiently effectual in reducing such crimes.67     If the courts were to “soften”\n                    the custodial sentences under the current Moneylenders Act to\n                    “offset” the caning imposed, the net deterrent effect would not be\n                    as significant as intended. This would undermine the purpose of enhancing the\n                    penalties as a deterrent against such offences.68     Accordingly, I find that the present sentence\n                    of 12 months’ imprisonment and 3 strokes of the cane per harassment charge\n                    would not adequately reflect the heightened seriousness with which Parliament\n                    views such offences.Conclusion69     Taking into account all the above\n                    considerations, in particular the actual damage caused by the fires and the\n                    potential risk to human life and safety, I am of the view that it is sufficient\n                    to enhance the sentence for each of the five harassment convictions before me to\n                    18 months. The imprisonment sentences for three of the harassment charges are to\n                    run consecutively, totalling 54 months’ imprisonment. These sentences\n                    reflect society’s particular opprobrium of such offences which have a deep\n                    negative impact on public safety and security. If the damage to the properties\n                    had been more serious, I would have no hesitation in imposing a stiffer term of\n                    imprisonment. The imprisonment sentences for the two remaining harassment\n                    charges and the charge for assisting in the moneylending business as ordered\n                    below are to run concurrently with the 54 months’ imprisonment sentence.\n                    There will be no change to the 15 strokes of cane ordered below.70     Accordingly, the total sentence for DAC 18860\n                    of 2010, DAC 19746 to 19749 of 2010, and DAC 19751 of 2010 is therefore 54\n                    months’ imprisonment and 15 strokes of the cane. As the offender has been\n                    in remand since 30 April 2010, the sentence of imprisonment is to take effect\n                    from that date.71     It leaves me to record my gratitude and\n                    appreciation to Mr Hay Hung Chun and Ms Peggy Pao for their comprehensive and\n                    well-researched submissions which provided considerable assistance to me in the\n                    drafting of this decision.",
        "The need for general deterrence": "12     InPublic Prosecutor v Law\n                        Aik Meng[2007] 2 SLR(R) 814 (“Law Aik Meng”), VK Rajah JA identified\n                    several types of offences which by their nature warrant general deterrence at\n                    [24]: (a)offences against or relating to public\n                            institutions, such as the courts, the police and the civil\n                            service;(b)offences against vulnerable\n                        victims;(c)offences involving professional or corporate\n                            integrity or abuse of authority;(d)offences affecting public safety, public health,\n                            public services, public or widely used facilities or public\n                            security;(e)offences affecting the delivery of financial\n                            services and/or the integrity of the economic infrastructure;\n                        and(f)offences involving community and/or race\n                            relations.Rajah JA also gave examples of particular circumstances of an\n                    offence which may attract general deterrence at [25]:(a)prevalence of the offence;(b)group/syndicate offences;(c)public disquiet;(d)difficulty of detection and/or apprehension;\n                            and(e)offences affecting several\n                        victims.13     The offence of harassment by fire on behalf of\n                    unlicensed moneylenders falls within several of the broadly defined areas of\n                    misfeasance that attract general deterrence as a sentencing consideration. The\n                    offence is worryingly prevalent, greatly affects public safety, usually takes\n                    place in the context of a syndicate, and has resulted in public disquiet. The\n                    presence of these factors supports the need for a strong deterrent sentence in\n                    the present case. I will deal with each of these factors in turn.The prevalence of unlicensed moneylending and related\n                offences14     The disturbing trend of prevalence of\n                    unlicensed moneylending and harassment offences can be seen from the statistics\n                    reproduced below:15     The statistics for unlicensed moneylending and\n                    related harassment cases for 2008 and 2009 were recently highlighted in\n                    Parliament (seeSingapore Parliamentary Debates, Official\n                        Report(12 January 2010) vol 86 at col 2051)\n                    (“Second Reading of the 2010 amendment bill”). In 2008, there was\n                    a total of 11,879 unlicensed moneylending and harassment cases reported and in\n                    2009, a total of 18,645 such cases was reported. It appears that such harassment\n                    offences have also been increasing exponentially. A table showing the number of\n                    harassment cases reported for the years 2005 to 2010 follows:Number of harassment cases reported20052006200720082009Jan – Sep 2010No of cases81749912936611,40017,88312,81016     Furthermore, a new alarming trend has surfaced\n                    in which harassers have escalated their tactics with the use of fire. The\n                    statistics for harassment cases involving the setting of fire to property and,\n                    even more seriously, to premises, are as follows:Number of reported harassment cases in which fire was\n                                        used20052006200720082009Jan – Sep 2010Set property on fire0043358Set premises on fire0030131617     It can be seen that although there has been a\n                    decrease in cases involving fire tomovable\n                        property, this change has been accompanied by a shift towards\n                    even more dangerous tactics whereby thepremisesthemselves are set on fire. In the present case, the respondent’s offences\n                    belonged in the more serious category of cases as he had set fire to the doors\n                    of several HDB units.18     I also note that runners have degenerated to\n                    this new mode of harassment using fire. On 8 January 2011, the Straits\n                    Times published an article titled “Jail, caning for car-burning loan\n                    shark runner; Judge says case of debtor-turned-harasser is one of the\n                    worst”, stating that a debtor-turned-harasser had torched cars in a\n                    multi-storey carpark near a debtor’s home in Choa Chu Kang and also set\n                    fire to some newspapers in front of the flat of another debtor in Hougang after\n                    scribbling repayment demands at a nearby lift landing.19     Based on the above statistics, harassment\n                    offences, in particular those which involve setting the premises on fire, appear\n                    to be on the rise. Such offences which are usually carried out at public housing\n                    estates can and do cause public disquiet. Moreover, in the present case, the\n                    respondent committed the five harassment offences between 1am and 5am, when the\n                    residents and neighbours were likely to be sound asleep. Thismodus operanditherefore has the grave potential to delay early\n                    detection and consequently inflict serious damage to both lives and property. I\n                    should add that the offence is equally grave even if it is committed in broad\n                    daylight. Accordingly, it is both important and necessary for the courts to\n                    impose a deterrent sentence to send out a clear and strong message that such\n                    offences cannot be tolerated at all.Impact on public: safety and security20     Harassment offences threaten the safety of a\n                    considerably wider scope of persons beyond the debtors and/or sureties. Innocent\n                    victims are often utilised as deliberate targets, not because of any prior\n                    association with the illegal moneylenders, but because the unlicensed\n                    moneylenders and their “runners” see them as nothing more than a\n                    pawn in order to pressure the actual debtors to pay up. At the Second Reading of\n                    the 2010 amendment bill which brought the Moneylenders Act to its current form,\n                    the Senior Minister of State for Home Affairs [Assoc Prof Ho Peng Kee] said at\n                    col 2051:Loansharks now increasingly target innocent neighbouring households by\n                        splashing paint on their doors, or to their cars in multi-storey carparks,\n                        hoping that peer pressure would force the borrowers to pay up. Indeed, in\n                        some instances, knowing that innocent parties are frustrated, loansharks\n                        demand that they pay up on behalf of the actual debtors! These acts, though\n                        generally, non-confrontational in nature and non-life threatening,\n                        nevertheless disrupt the community’s sense of well-being.21     As a result, these innocent victims suffer\n                    much distress, even to the point of placing newspaper advertisements in a\n                    desperate attempt to inform the loansharks that they are innocent third parties:\n                    see The New Paper article titled “2 men harassed by loan sharks\n                    though they say they never borrowed money” which was published on\n                    16 September 2010. More recently, an innocent victim also wrote to the\n                    Straits Times to express her anguish and frustration at being harassed by a\n                    loanshark ever since she bought her flat from a debtor of a loan-shark three\n                    years ago: see the Straits Time article titled “Innocent loan-shark\n                    victim’s 3-year tale of endless woe” which was published on\n                    19 January 2011. In one extreme case, this frustration compelled the\n                    victims of loanshark harassment to brutally assault an innocent man who was\n                    mistaken as a runner. For the assault, the victims were sentenced to between 1\n                    to 12 months’ imprisonment: see The Straits Times article titled\n                    “Three relatives jailed for assault” which was published on\n                    15 February 2011.22     Acts of harassment also invariably create an\n                    atmosphere of fear in the neighbourhood. This is a regrettable development which\n                    must be arrested. As the court rightly pointed out inPublic\n                        Prosecutor v Soh Yew Heng[2007] SGDC 49 at\n                    [15]:There are costs and harm imposed on society by these acts of harassment.\n                        The harassment at the very least creates a breach of the peace and good\n                        public order.It fosters an atmosphere of threat and\n                            danger because of the damage to property and warning messages scrawled\n                            on walls. Residents of our various housing estates are entitled to live\n                            in surroundings free from such disturbances… The response of the\n                            Courts should therefore be both punitive and\n                        deterrent.[emphasis added]23     Such offences also cause damage to property.\n                    On 15 January 2010, the Straits Times published an article titled\n                    “Loan sharks’ vandalism costs town councils”, stating that\n                    eight town councils incur annual expenses of between $15,000 to $70,000 to\n                    rectify damage to property caused by loansharks.24     In harassment by fire cases, the adverse\n                    impact on public safety and security, as well as the economic cost, is\n                    amplified. The scope of property damage and the potential risk to human life and\n                    safety increases significantly when fire is used. The serious extent of property\n                    damage that can be caused by fire is apparent from the photographs of the fires\n                    that were set by the respondent in the present case. The fires spread to the\n                    ceiling, melting the ceiling lamps and the insulation of the electrical wirings\n                    in the common corridor. In one instance it spread close to the gas supply pipes.\n                    The total cost of the damage to property (private and public) in the present\n                    case amounted to $5,222.30. In such cases, if the fire should get out of control\n                    and spread to the electrical wiring and the gas supply pipes, it would have\n                    endangered not only the occupants of the unit being harassed but also those in\n                    the adjoining flats. The results could be catastrophic, especially in the older,\n                    narrower and more cramped HDB flats.25     Parliament has correctly recognised that\n                    harassment by fire constitutes a special category of harassment that warrants\n                    the full brunt of the law. In Parliamentary proceedings on 18 August 2009,\n                    Assoc Prof Ho stated (Singapore Parliamentary\n                        Debates,Official Report(18 August 2009), vol 86 at col 963):[W]e have enhanced penalties over the years. So in 2005, we enhanced the\n                        penalties, and in 2008, last year, we enhanced them further and upcoming, we\n                        want to enhance the penalties even more.But, really, for\n                            those harassers who cause damage to property or injury to persons, we\n                            want to emphasise the caning and indeed for those who damage property or\n                            harm persons, the element of a mandatory minimum caning will be imposed\n                            because, after all, they are threatening the well-being of others. So I\n                            think there is no question about it, these are dangerous acts and we\n                            must nip them in the bud. When Police can charge harassers\n                        under other more serious sections, eg, mischief by fire – I think\n                        there were about 35 instances this year when items had been lit outside\n                        flats and indeed like Mdm Phua said under her ward, petrol bombs were thrown\n                        – when the facts are proven, Police will also impose a higher charge\n                        to send the right signal. So let that be clear.[emphasis added]Similarly, in the Second Reading of the 2010 amendment bill, Assoc\n                    Prof Ho stated at col 2051:[T]he Police is closely monitoring the dangerous tactics employed by some\n                        loansharks, if not all, of locking people up in their homes or setting on\n                        fire items found outside their homes. If caught,these\n                            harassers will be punished with the full brunt of the\n                        law.[emphasis added]26     It is clear from the above that Parliament has\n                    recognised acts of harassment by fire to be one of the most egregious forms of\n                    harassment. Thus, the sentences imposed should be calibrated to reflect\n                    society’s particular opprobrium of such offences which have a deep\n                    negative impact on public safety and security.Syndicate offence27     Syndicate offences have been recognised as a\n                    category of offence that attracts the principle of general deterrence:Law Aik Mengat [25].28     The Second Reading of the 2010 amendment bill\n                    marked a paradigm shift in the way Parliament views loansharking and related\n                    activities. Such offences are now characterised as “syndicate”\n                    offences, carried out usually by operations with multiple layers, typically\n                    involving a financier (or “towkay”),\n                    an “ah long” who operates the\n                    “stall” which issues loans, and runners who commit acts of\n                    harassment and conduct other ground operations.29     Assoc Prof Ho stated in the Second Reading of\n                    the 2010 amendment bill at col 2051:How loanshark syndicates have evolved in other jurisdictions, including\n                        the use of violence, the cross-participation with other organised criminal\n                        activities like drug-trafficking, has convinced us that we must take tough\n                        actions to deal with this scourge before it grows to become a greater threat\n                        to our citizens’ safety.[W]e needed to shift our paradigm as to how we view loanshark syndicates,\n                        that is, from unscrupulous moneylenders charging exorbitant interest rates\n                        to being a pernicious form of organised crime. Criminal acts perpetrated by\n                        organised criminal groups are a threat to society as they are tougher to\n                        eradicate and can create greater community impact.30     In the present case, the respondent became\n                    involved in a syndicated offence when he agreed to act as a\n                    “runner” for an unlicensed moneylender “Ah Boy”. The\n                    respondent never knew who “Ah Boy” was. He interacted entirely\n                    with “Ah Huat” who handed him the necessary materials for his\n                    harassment acts and acted as a lookout for him. This is typical of how\n                    syndicated unlicensed moneylenders operate and explains why syndicate offences\n                    are particularly difficult to subdue. As Assoc Prof Ho elucidated in the Second\n                    Reading of the 2010 amendment bill at col 2051:Now, loansharks have taken to outsourcing their \"business functions\" to\n                        debtors or youths, who appear easy targets for recruitment. These operatives\n                        carry out functions ranging from assisting the loansharks in the collection\n                        of money, to effecting transfers of money electronically, to carrying out\n                        acts of harassment. They add to the layers surrounding the loanshark\n                        syndicate, shielding the leaders from direct exposure. Members are also\n                        fearful to testify against the \"ah longs\" and\n                            \"towkays\" for fear of reprisal to\n                        themselves and their families. And business continuity is high as,\n                        characteristically, the syndicates’ structure enables them to elude\n                        Police enforcement, replace lower rung members, reorganise their resources\n                        and perpetuate their criminal activities.31     I accept the Prosecution’s argument that\n                    this is a relevant consideration which attracts the application of the general\n                    deterrence principle thereby warranting an enhancement of the present sentence.\n                    Unless we cut through the layers surrounding illegal moneylenders, there will no\n                    realistic prospect of dealing with the kingpins themselves and the scourge of\n                    moneylending and their attendant offences will continue to plague\n                    society.Public disquiet32     It is apparent from the widespread coverage of\n                    harassment cases in 2010 that such cases have created a sense of fear and\n                    trepidation in the community. The installation of ever increasing number of\n                    video surveillance equipment in various HDB common corridors as well as the\n                    formation of numerous citizens’ patrol and watch groups (see the Second\n                    Reading of the 2010 amendment bill at para 4) are further testament to the\n                    unease that has been engendered amongst the members of the community by the\n                    alarming prevalence of such offences.33     Needless to say, an offence affecting a larger\n                    number of people covering a wider geographical area is more serious than one\n                    that affects few people in a limited area. In the present case, the respondent\n                    had harassed not one, but six units at different locations. This was not a case\n                    where the respondent had committed a one-off offence in a moment of folly.\n                    Rather, he persisted in his conduct and harassed several HDB units over three\n                    separate days.34     Furthermore, his offences had a wide\n                    geographical reach, from Woodlands and Yishun in the North, Hougang and\n                    Anchorvale (Sengkang) in the North East, and Geylang Bahru in the Central area,\n                    to Geylang East in the East. He therefore encroached on the safety and serenity\n                    of more than one neighbourhood. That said, this should not typically be viewed\n                    as an independent aggravating factor as it would be taken care of in sentencing\n                    by virtue of the multiple charges for which two or three would be ordered to run\n                    consecutively. Indeed in the present case, the District Judge ordered three of\n                    the sentences to run consecutively. Therefore to treat it as an independent\n                    aggravating factor would amount to double counting.The need for specific deterrence35     The principle of specific deterrence merits\n                    consideration in the present case. The respondent is no stranger to the courts,\n                    having been convicted on several occasions for different offences. Although the\n                    respondent does not have loansharking or related antecedents, his chequered past\n                    is a relevant factor for sentencing as it clearly demonstrates his cavalier\n                    disregard for the law: seeTan Kay Beng v Public\n                        Prosecutor[2006] 4 SLR(R) 10 at\n                    [14]–[16].36     Given his long list of antecedents, it would\n                    not be an exaggeration to say that the respondent has re-offended almost\n                    immediately each time after he underwent punishment for a prior offence. He was\n                    given the opportunity of rehabilitation in 2003 when he was ordered to undergo\n                    probation for theft and road traffic offences but re-offended in 2004 for\n                    similar offences. Even then, he was given another opportunity and was sentenced\n                    to reformative training. However, he still did not realise the error of his ways\n                    and went on to commit the offence of affray for which he was fined in 2007. The\n                    respondent was finally sentenced to 6 months’ imprisonment in 2009 for\n                    theft (again), together with even more serious offences (against persons). Soon\n                    after his release from prison for those offences, in January 2010, he was\n                    convicted and sentenced to 5 months’ imprisonment for road traffic\n                    offences.37     His most recent infractions show that he has\n                    escalated his criminal conduct even further in committing more serious offences\n                    involving the use of fire for harassment purposes. A sufficiently severe\n                    sentence is therefore mandated to steer him away from the path of\n                crime.Legislative Changes to the Moneylenders Act38     The legislative history of the penalty\n                    provisions for harassment offences demonstrates Parliament’s clear intent\n                    in enacting harsher penalties in order to stem the ever-increasing tide of such\n                    offences. This intent is manifested in the following changes to the punishment\n                    provisions for harassment offences resulting in property damage:(a)     with effect from 16 August\n                        1983, the punishment was revised todiscretionary\n                            imprisonmentfor a term not exceeding 12 months and/or\n                        discretionary fine of not less than $2,000 and not more than\n                    $20,000;(b)     with\n                        effect from 1 January 2006, the punishment was revised todiscretionary imprisonmentfor a term not exceeding 3 years\n                        and/or discretionary fine of not less than $4,000 and not more than $40,000.\n                        In addition, there would also bediscretionary\n                            caningof not more than 4 strokes if it is proved to the\n                        satisfaction of the court that, in the course of committing the offence,\n                        damage was caused to any property; and(c)     with effect from 11 February 2010, the punishment\n                        was revised tomandatory imprisonmentfor a\n                        term not exceeding 5 years, discretionary fine of not less than $5,000 and\n                        not more than $50,000, andmandatory caningof\n                        not less than 3 and not more than 6 strokes if it is proved to the\n                        satisfaction of the court that, in the course of committing the offence,\n                        damage was caused to any property.39     From the above summary, the penalty provisions\n                    have undergone several revisions over the years, each time resulting in harsher\n                    penalties being imposed for such offences. This amply demonstrates that the task\n                    of curbing harassment activities has been an uphill one, necessitating the\n                    enactment of increasingly severe penalties from discretionary imprisonment and\n                    caning to mandatory imprisonment and caning.40     Parliament has repeatedly articulated the need\n                    for a strong stance or a “zero tolerance” approach in order to\n                    stem the rising numbers of such offences. In the Second Reading of the 2005\n                    amendment bill (which was passed as Act 44 of 2005) that increased the maximum\n                    imprisonment term from 12 months to 3 years and also doubled the minimum and\n                    maximum fines from $2,000 to $4,000 and $20,000 to $40,000 respectively,\n                    Assoc Prof Ho stated (seeSingapore Parliamentary\n                        Debates, Official Report(21 November 2005, vol 80 at\n                    col 1831):Sir, the number of unlicensed moneylending and related harassment cases,\n                        however, continues to rise from some 1,500 cases in 1995 to almost 6,000\n                        cases last year, ie, about a four-fold increase. In some instances, parties\n                        who did not borrow money were also harassed. For example, new occupants of\n                        dwellings that were formerly occupied by debtors, and people who had lost or\n                        misplaced their identity cards. In addition, the number of arrests made in\n                        unlicensed moneylending and related harassment cases increased by almost 20%\n                        in one year, from 330 arrests in 2003 to 393 arrests in 2004.Sir, we must tackle the rise in illegal moneylending cases resolutely,\n                        adopting a comprehensive approach…Sir, as for these amendments which are under consideration, Parliament\n                        should send a strong signal to loansharks that we will not tolerate the\n                        conduct of unlicensed moneylending activities, where exorbitant interest\n                        rates are charged and borrowers and even non-borrowers are harassed in their\n                        own homes.…In conclusion, Sir, these amendments are needed to send a strong signal\n                        thatthe Government has zero tolerance for unlicensed\n                            moneylending activities. The enhanced deterrent effect should\n                        also help stem the increase that we have seen in such activities.[emphasis added]41     Unfortunately, the 2005 amendments did not\n                    succeed in curbing harassment activities. Parliament’s intent to take an\n                    even harsher stand against such activities is evident from the Second Reading\n                    speech of the 2010 amendment bill. In that speech, Assoc Prof Ho noted that the\n                    number of loanshark and harassment cases continued to increase: except for a\n                    brief respite in 2007, when the numbers of such cases dropped slightly.\n                    Professor Ho observed that the number of reports has continued to rise with\n                    11,879 cases reported in 2008 and 18,645 cases reported in 2009.42     As pointed out above, the 2010 amendments\n                    which introducedboth mandatory imprisonment and\n                        caningmarked a paradigm shift in Parliament’s treatment of\n                    unlicensed moneylending and related offences. Henceforth, they are to be viewed\n                    as syndicate offences that are particularly pernicious and must be met with the\n                    full brunt of the law.43     In light of the recent legislative changes\n                    leading to the current Moneylenders Act, Parliament has clearly adopted an even\n                    more robust stance against such harassment offences.Sentencing benchmarks44     I note that there are no reported decisions at\n                    the appellate level on cases of harassment resulting in property damage (whether\n                    by fire or other means) under the previous or current Moneylenders\n                Act.45     The present case therefore presents an\n                    opportunity for this Court to take cognizance of the recent legislative changes\n                    so as to provide guidance by clarifying the benchmark sentences that should be\n                    imposed in respect of both non-fire and fire harassment cases under the previous\n                    and current Moneylenders Act.46     Under the previous Moneylenders Act (ie, after Act 31 of 2008), sentences of between 8 to 12\n                    months’ imprisonment and 1 to 2 strokes of the cane have generally been\n                    imposed for adult offenders who carry out non-fire acts of harassment (ie, use of paint, markers, even bicycle locks) on behalf\n                    of unlicensed moneylenders: seeJoseph Ong Dick Tat v Public\n                        ProsecutorMagistrate’s Appeal No 142 of 2008 andPublic Prosecutor v Fazlie bin HasnieDAC 14581/2010. It\n                    is pertinent to highlight that the sentences were imposed when imprisonment and\n                    caning were discretionary.47     Under the current Moneylenders Act, sentences\n                    of 12 months’ imprisonment and the mandatory minimum 3 strokes of the cane\n                    have generally been imposed for non-fire with property damage cases: seePublic Prosecutor v Wu Wei ChunDAC 31830/2010\n                    andPublic Prosecutor v Kau Wui KeongDAC 19918/2010. The increase in the tariff for non-fire with property\n                    damage cases is in line with and gives effect to Parliament’s intent to\n                    take an even stronger stance on such offences. I see no reason why the benchmark\n                    for non-fire with property damage cases should be revised.48     In my view, it is manifestly clear that a\n                    distinction needs to be drawn between non-fire with property damage cases,ie, by splashing paint or scribbling with\n                    indelible ink, and fire with property damage cases such as the instant case\n                    whereby doors were set on fire with kerosene. The use of kerosene to set fire\n                    causes more significant damage to the property and endangers the lives of the\n                    occupants. Moreover, the potential to cause harm to innocent neighbouring\n                    residents and their property cannot be overlooked.49     I am of the view that the benchmark sentence\n                    for fire with property damage cases should be set at 18 months’\n                    imprisonment and 3 strokes of the caneper charge.\n                    The reason for the enhanced sentence is the aggravating nature of such offences\n                    as explained in[13]–[38]above. I should add that this benchmark is\n                    also in line with the recent unreported case ofPublic\n                        Prosecutor v Ow Chia Chye(DAC 14403/2010 & ors). In that\n                    case, the accused had committed a range of harassment offences on behalf of an\n                    unlicensed moneylender, including splashing paint and scrawling graffiti. He had\n                    set fire to a unit on one occasion. For the setting of fire, he was sentenced\n                    under the current Moneylenders Act to 18 months’ imprisonment, 3 strokes\n                    of the cane and a fine of $5,000.50     In deciding on the 18-month benchmark, I took\n                    cognizance of the benchmark sentence for causing mischief by fire under\n                    s 435 of the Penal Code. Generally, an imprisonment sentence of 3 years has\n                    typically been imposed for offences under s 435 of the Penal Code: seePublic Prosecutor v Zuraimi Bin Abdul RahimDAC 42206/2009, DAC 43200/2009, DAC 4201/2009 andPublic\n                        Prosecutor v Thiam Chin LoongDAC 32851/2009. The ingredients for\n                    a conviction under s 435 of the Penal Code and s 28(2)(a) read with\n                    s 28(3)(b)(i) of the current Moneylenders Act are practically identical.\n                    However, it was fairly highlighted to my attention by the Prosecution that a\n                    direct comparison between the two offences may not be entirely accurate because\n                    there is no provision for caning in respect of convictions under s 435 of\n                    the Penal Code. Nonetheless despite the difference, the 3-year benchmark\n                    sentence for a conviction under s 435 of the Penal Code at least provides\n                    some measure of direction on the appropriate sentence for fire harassment\n                    convictions under the current Moneylenders Act. Parliament has clearly decided\n                    that mandatory caning together with mandatory imprisonment would be more\n                    effective to deal with such insidious offences.51     The 18-month benchmark for fire harassment\n                    cases should be increased in appropriate situations where for instance the fire\n                    caused extensive damage beyond the door of the unit into the premises or onto\n                    the neighbouring unit. Any increase beyond the 18-month benchmark should be\n                    calibrated according to the extent and severity of the damage. I should add that\n                    if injuries are caused to the residents arising from the fire, thismaynot necessarily constitute an aggravating factor\n                    since separate and more serious charges would be levied against the accused\n                    under s 321 or s 322 of the Penal Code for voluntarily causing hurt or\n                    grievous hurt depending on the nature of the injuries. However, I do not rule\n                    out the possibility that injuries to resident may in appropriate cases amount to\n                    an aggravating factor for sentencing purposes.Absence of mitigating factors52     In his mitigation plea, the respondent stated\n                    that he committed the offences out of desperation due to his difficult financial\n                    circumstances, and in order to avoid harassment to himself and his\n                    family.53     It is trite that financial difficulties cannot\n                    be relied upon in mitigation of an offence save in the most exceptional or\n                    extreme of circumstances: seeLai Oei Mui Jenny v Public\n                        Prosecutor[1993] 2 SLR(R) 406 at [10].54     In keeping with this principle, the courts\n                    have generally not accorded any mitigating weight to claims that the offences in\n                    question were committed to repay loansharks. For example, inPublic Prosecutor v Ong Ker Seng[2001] 3 SLR(R) 134 at\n                    [30], the High Court did not attach any mitigating weight to the accused\n                    person’s claim that he was driven to commit the offence of obtaining loans\n                    without disclosing his undischarged bankrupt status in his desperate bid to\n                    repay loansharks who were hounding him. InSim Yeow Seng v\n                        Public Prosecutor[1995] 2 SLR(R) 466 at [10], the High\n                    Court similarly rejected the argument that the accused had committed the offence\n                    of criminal breach of trust in order to pay off loansharks.55A fortiori, no\n                    distinction should be drawn between these cases and the harassment cases.\n                    Indeed, debtors-turned-runners who have first-hand experience of what it is like\n                    to be hounded by loansharks should know better than to revisit such hardship\n                    upon third parties in a bid to escape their own predicament.56     In line with Parliament’s aim of\n                    curtailing harassment offences, I find that no mitigating weight should be\n                    accorded to the argument that the offender only committed harassment to avoid\n                    harassment of himself and his family. Many harassment acts are carried out by\n                    such debtors-turned-runners. If the Court were to impose lenient sentences on\n                    the basis of sympathy for their conundrum, the inadvertent effect would be to\n                    further encourage the continued exploitation of easy prey.57     It is clear that the law does not view an\n                    accused person’s financial plight as a mitigating factor particularly\n                    where the offence was motivated by greed and the lure of easy money. InZhao Zhipeng v Public Prosecutor[2008]\n                    4 SLR(R) 879, it was stated at [37] that:Persons who act out of pure self-interest and greed will rarely be treated\n                        with much sympathy; conversely, those who are motivated by fear will usually\n                        be found to be less blameworthy.58     In the present case, the respondent had\n                    consciously chosen to carry out harassment by fire because this would allow him\n                    to earn $150 per unit, compared with harassment using spray paint which would\n                    only earn him $60 per unit.59     As for the respondent’s submission that\n                    he was not a member of an illegal unlicensed moneylending syndicate, this\n                    utterly misses the point because by agreeing to be a runner and carrying out the\n                    offences on the instructions of an unlicensed moneylender, he had become an\n                    integral part of the moneylending ecosystem that has been characterised by\n                    Parliament as a syndicate.60     Finally, he raised a most audacious point in\n                    mitigation. He claimed that the doors to the HDB flats were incombustible and\n                    hence the fires would not have hurt anyone. However, it cannot be ignored that\n                    it is quite common for residents to place items such as shoe racks, empty boxes\n                    and other items which are combustible outside the doors and along the corridors.\n                    The risk of such items catching fire is both real and possible. In fact in the\n                    present case, the fire did cause the electrical wiring and the ceiling lamp\n                    along the common corridor to melt. In one case, the fire spread to an area which\n                    was close to the gas supply pipes.61     For the above reasons, I find that the\n                    respondent’s mitigation plea disclosed no basis whatsoever for a lighter\n                    sentence in the present case.Undue weight placed on the totality principle62     I cannot agree with the District Judge’s\n                    decision to impose a lighter sentence for each of the individual harassment by\n                    fire charges on the basis of the totality principle. In this regard, I accept\n                    the Prosecution’s submission that the imposition of low sentences for such\n                    charges would invariably have a “downstream” effect on the\n                    sentences for non-fire with property damage cases. In other words, the low\n                    sentence for fire with property damage cases would push the sentences for\n                    non-fire cases downwards correspondingly. This would be inconsistent with\n                    Parliament’s intent of taking a stronger stance on harassment activities\n                    as exemplified in the 2010 amendments.63     For example, if the sentence for each of the\n                    harassment by fire charges were to remain at 12 months’ imprisonment with\n                    the mandatory minimum 3 strokes of the cane, the sentence for non-fire with\n                    property damage cases under the current Moneylenders Act should logically have\n                    to be less than 12 months’ imprisonment with the mandatory minimum 3\n                    strokes of the cane. In other words, the sentencing tariff for non-fire with\n                    property damage cases under the present Moneylenders Act would not have\n                    increased from the previous Moneylenders Act. Such a token increase in the\n                    sentencing tariff is unlikely to have the deterrent effect that was envisaged by\n                    Parliament in enacting the 2010 amendments.Mandatory caning should not affect custodial term64     It also appears that the District Judge had\n                    taken into account the mandatory caning of at least 3 strokes per charge for\n                    fire harassment cases in arriving at the 12-month imprisonment term that was\n                    imposed on the respondent.65     It might be argued that the custodial terms\n                    for harassment offences under the current Moneylenders Act should be calibrated\n                    to reflect the fact that there is a mandatory minimum of 3 strokes of the\n                    cane.66     However, this could not have been\n                    Parliament’s intent in enacting the current Moneylenders Act.\n                    Parliament’s intent was to take a harsher stance on unlicensed\n                    moneylending and related offences because it was evident that the previous\n                    penalties were not sufficiently effectual in reducing such crimes.67     If the courts were to “soften”\n                    the custodial sentences under the current Moneylenders Act to\n                    “offset” the caning imposed, the net deterrent effect would not be\n                    as significant as intended. This would undermine the purpose of enhancing the\n                    penalties as a deterrent against such offences.68     Accordingly, I find that the present sentence\n                    of 12 months’ imprisonment and 3 strokes of the cane per harassment charge\n                    would not adequately reflect the heightened seriousness with which Parliament\n                    views such offences.Conclusion69     Taking into account all the above\n                    considerations, in particular the actual damage caused by the fires and the\n                    potential risk to human life and safety, I am of the view that it is sufficient\n                    to enhance the sentence for each of the five harassment convictions before me to\n                    18 months. The imprisonment sentences for three of the harassment charges are to\n                    run consecutively, totalling 54 months’ imprisonment. These sentences\n                    reflect society’s particular opprobrium of such offences which have a deep\n                    negative impact on public safety and security. If the damage to the properties\n                    had been more serious, I would have no hesitation in imposing a stiffer term of\n                    imprisonment. The imprisonment sentences for the two remaining harassment\n                    charges and the charge for assisting in the moneylending business as ordered\n                    below are to run concurrently with the 54 months’ imprisonment sentence.\n                    There will be no change to the 15 strokes of cane ordered below.70     Accordingly, the total sentence for DAC 18860\n                    of 2010, DAC 19746 to 19749 of 2010, and DAC 19751 of 2010 is therefore 54\n                    months’ imprisonment and 15 strokes of the cane. As the offender has been\n                    in remand since 30 April 2010, the sentence of imprisonment is to take effect\n                    from that date.71     It leaves me to record my gratitude and\n                    appreciation to Mr Hay Hung Chun and Ms Peggy Pao for their comprehensive and\n                    well-researched submissions which provided considerable assistance to me in the\n                    drafting of this decision.",
        "The prevalence of unlicensed moneylending and related\n                offences": "14     The disturbing trend of prevalence of\n                    unlicensed moneylending and harassment offences can be seen from the statistics\n                    reproduced below:  15     The statistics for unlicensed moneylending and\n                    related harassment cases for 2008 and 2009 were recently highlighted in\n                    Parliament (seeSingapore Parliamentary Debates, Official\n                        Report(12 January 2010) vol 86 at col 2051)\n                    (“Second Reading of the 2010 amendment bill”). In 2008, there was\n                    a total of 11,879 unlicensed moneylending and harassment cases reported and in\n                    2009, a total of 18,645 such cases was reported. It appears that such harassment\n                    offences have also been increasing exponentially. A table showing the number of\n                    harassment cases reported for the years 2005 to 2010 follows: Number of harassment cases reported20052006200720082009Jan – Sep 2010No of cases81749912936611,40017,88312,810   16     Furthermore, a new alarming trend has surfaced\n                    in which harassers have escalated their tactics with the use of fire. The\n                    statistics for harassment cases involving the setting of fire to property and,\n                    even more seriously, to premises, are as follows: Number of reported harassment cases in which fire was\n                                        used20052006200720082009Jan – Sep 2010Set property on fire0043358Set premises on fire00301316   17     It can be seen that although there has been a\n                    decrease in cases involving fire tomovable\n                        property, this change has been accompanied by a shift towards\n                    even more dangerous tactics whereby thepremisesthemselves are set on fire. In the present case, the respondent’s offences\n                    belonged in the more serious category of cases as he had set fire to the doors\n                    of several HDB units. 18     I also note that runners have degenerated to\n                    this new mode of harassment using fire. On 8 January 2011, the Straits\n                    Times published an article titled “Jail, caning for car-burning loan\n                    shark runner; Judge says case of debtor-turned-harasser is one of the\n                    worst”, stating that a debtor-turned-harasser had torched cars in a\n                    multi-storey carpark near a debtor’s home in Choa Chu Kang and also set\n                    fire to some newspapers in front of the flat of another debtor in Hougang after\n                    scribbling repayment demands at a nearby lift landing. 19     Based on the above statistics, harassment\n                    offences, in particular those which involve setting the premises on fire, appear\n                    to be on the rise. Such offences which are usually carried out at public housing\n                    estates can and do cause public disquiet. Moreover, in the present case, the\n                    respondent committed the five harassment offences between 1am and 5am, when the\n                    residents and neighbours were likely to be sound asleep. Thismodus operanditherefore has the grave potential to delay early\n                    detection and consequently inflict serious damage to both lives and property. I\n                    should add that the offence is equally grave even if it is committed in broad\n                    daylight. Accordingly, it is both important and necessary for the courts to\n                    impose a deterrent sentence to send out a clear and strong message that such\n                    offences cannot be tolerated at all.",
        "Impact on public: safety and security": "20     Harassment offences threaten the safety of a\n                    considerably wider scope of persons beyond the debtors and/or sureties. Innocent\n                    victims are often utilised as deliberate targets, not because of any prior\n                    association with the illegal moneylenders, but because the unlicensed\n                    moneylenders and their “runners” see them as nothing more than a\n                    pawn in order to pressure the actual debtors to pay up. At the Second Reading of\n                    the 2010 amendment bill which brought the Moneylenders Act to its current form,\n                    the Senior Minister of State for Home Affairs [Assoc Prof Ho Peng Kee] said at\n                    col 2051: Loansharks now increasingly target innocent neighbouring households by\n                        splashing paint on their doors, or to their cars in multi-storey carparks,\n                        hoping that peer pressure would force the borrowers to pay up. Indeed, in\n                        some instances, knowing that innocent parties are frustrated, loansharks\n                        demand that they pay up on behalf of the actual debtors! These acts, though\n                        generally, non-confrontational in nature and non-life threatening,\n                        nevertheless disrupt the community’s sense of well-being. 21     As a result, these innocent victims suffer\n                    much distress, even to the point of placing newspaper advertisements in a\n                    desperate attempt to inform the loansharks that they are innocent third parties:\n                    see The New Paper article titled “2 men harassed by loan sharks\n                    though they say they never borrowed money” which was published on\n                    16 September 2010. More recently, an innocent victim also wrote to the\n                    Straits Times to express her anguish and frustration at being harassed by a\n                    loanshark ever since she bought her flat from a debtor of a loan-shark three\n                    years ago: see the Straits Time article titled “Innocent loan-shark\n                    victim’s 3-year tale of endless woe” which was published on\n                    19 January 2011. In one extreme case, this frustration compelled the\n                    victims of loanshark harassment to brutally assault an innocent man who was\n                    mistaken as a runner. For the assault, the victims were sentenced to between 1\n                    to 12 months’ imprisonment: see The Straits Times article titled\n                    “Three relatives jailed for assault” which was published on\n                    15 February 2011. 22     Acts of harassment also invariably create an\n                    atmosphere of fear in the neighbourhood. This is a regrettable development which\n                    must be arrested. As the court rightly pointed out inPublic\n                        Prosecutor v Soh Yew Heng[2007] SGDC 49 at\n                    [15]: There are costs and harm imposed on society by these acts of harassment.\n                        The harassment at the very least creates a breach of the peace and good\n                        public order.It fosters an atmosphere of threat and\n                            danger because of the damage to property and warning messages scrawled\n                            on walls. Residents of our various housing estates are entitled to live\n                            in surroundings free from such disturbances… The response of the\n                            Courts should therefore be both punitive and\n                        deterrent. [emphasis added] 23     Such offences also cause damage to property.\n                    On 15 January 2010, the Straits Times published an article titled\n                    “Loan sharks’ vandalism costs town councils”, stating that\n                    eight town councils incur annual expenses of between $15,000 to $70,000 to\n                    rectify damage to property caused by loansharks. 24     In harassment by fire cases, the adverse\n                    impact on public safety and security, as well as the economic cost, is\n                    amplified. The scope of property damage and the potential risk to human life and\n                    safety increases significantly when fire is used. The serious extent of property\n                    damage that can be caused by fire is apparent from the photographs of the fires\n                    that were set by the respondent in the present case. The fires spread to the\n                    ceiling, melting the ceiling lamps and the insulation of the electrical wirings\n                    in the common corridor. In one instance it spread close to the gas supply pipes.\n                    The total cost of the damage to property (private and public) in the present\n                    case amounted to $5,222.30. In such cases, if the fire should get out of control\n                    and spread to the electrical wiring and the gas supply pipes, it would have\n                    endangered not only the occupants of the unit being harassed but also those in\n                    the adjoining flats. The results could be catastrophic, especially in the older,\n                    narrower and more cramped HDB flats. 25     Parliament has correctly recognised that\n                    harassment by fire constitutes a special category of harassment that warrants\n                    the full brunt of the law. In Parliamentary proceedings on 18 August 2009,\n                    Assoc Prof Ho stated (Singapore Parliamentary\n                        Debates,Official Report(18 August 2009), vol 86 at col 963): [W]e have enhanced penalties over the years. So in 2005, we enhanced the\n                        penalties, and in 2008, last year, we enhanced them further and upcoming, we\n                        want to enhance the penalties even more.But, really, for\n                            those harassers who cause damage to property or injury to persons, we\n                            want to emphasise the caning and indeed for those who damage property or\n                            harm persons, the element of a mandatory minimum caning will be imposed\n                            because, after all, they are threatening the well-being of others. So I\n                            think there is no question about it, these are dangerous acts and we\n                            must nip them in the bud. When Police can charge harassers\n                        under other more serious sections, eg, mischief by fire – I think\n                        there were about 35 instances this year when items had been lit outside\n                        flats and indeed like Mdm Phua said under her ward, petrol bombs were thrown\n                        – when the facts are proven, Police will also impose a higher charge\n                        to send the right signal. So let that be clear. [emphasis added] Similarly, in the Second Reading of the 2010 amendment bill, Assoc\n                    Prof Ho stated at col 2051: [T]he Police is closely monitoring the dangerous tactics employed by some\n                        loansharks, if not all, of locking people up in their homes or setting on\n                        fire items found outside their homes. If caught,these\n                            harassers will be punished with the full brunt of the\n                        law. [emphasis added] 26     It is clear from the above that Parliament has\n                    recognised acts of harassment by fire to be one of the most egregious forms of\n                    harassment. Thus, the sentences imposed should be calibrated to reflect\n                    society’s particular opprobrium of such offences which have a deep\n                    negative impact on public safety and security.",
        "Syndicate offence": "27     Syndicate offences have been recognised as a\n                    category of offence that attracts the principle of general deterrence:Law Aik Mengat [25]. 28     The Second Reading of the 2010 amendment bill\n                    marked a paradigm shift in the way Parliament views loansharking and related\n                    activities. Such offences are now characterised as “syndicate”\n                    offences, carried out usually by operations with multiple layers, typically\n                    involving a financier (or “towkay”),\n                    an “ah long” who operates the\n                    “stall” which issues loans, and runners who commit acts of\n                    harassment and conduct other ground operations. 29     Assoc Prof Ho stated in the Second Reading of\n                    the 2010 amendment bill at col 2051: How loanshark syndicates have evolved in other jurisdictions, including\n                        the use of violence, the cross-participation with other organised criminal\n                        activities like drug-trafficking, has convinced us that we must take tough\n                        actions to deal with this scourge before it grows to become a greater threat\n                        to our citizens’ safety. [W]e needed to shift our paradigm as to how we view loanshark syndicates,\n                        that is, from unscrupulous moneylenders charging exorbitant interest rates\n                        to being a pernicious form of organised crime. Criminal acts perpetrated by\n                        organised criminal groups are a threat to society as they are tougher to\n                        eradicate and can create greater community impact. 30     In the present case, the respondent became\n                    involved in a syndicated offence when he agreed to act as a\n                    “runner” for an unlicensed moneylender “Ah Boy”. The\n                    respondent never knew who “Ah Boy” was. He interacted entirely\n                    with “Ah Huat” who handed him the necessary materials for his\n                    harassment acts and acted as a lookout for him. This is typical of how\n                    syndicated unlicensed moneylenders operate and explains why syndicate offences\n                    are particularly difficult to subdue. As Assoc Prof Ho elucidated in the Second\n                    Reading of the 2010 amendment bill at col 2051: Now, loansharks have taken to outsourcing their \"business functions\" to\n                        debtors or youths, who appear easy targets for recruitment. These operatives\n                        carry out functions ranging from assisting the loansharks in the collection\n                        of money, to effecting transfers of money electronically, to carrying out\n                        acts of harassment. They add to the layers surrounding the loanshark\n                        syndicate, shielding the leaders from direct exposure. Members are also\n                        fearful to testify against the \"ah longs\" and\n                            \"towkays\" for fear of reprisal to\n                        themselves and their families. And business continuity is high as,\n                        characteristically, the syndicates’ structure enables them to elude\n                        Police enforcement, replace lower rung members, reorganise their resources\n                        and perpetuate their criminal activities. 31     I accept the Prosecution’s argument that\n                    this is a relevant consideration which attracts the application of the general\n                    deterrence principle thereby warranting an enhancement of the present sentence.\n                    Unless we cut through the layers surrounding illegal moneylenders, there will no\n                    realistic prospect of dealing with the kingpins themselves and the scourge of\n                    moneylending and their attendant offences will continue to plague\n                    society.",
        "Public disquiet": "32     It is apparent from the widespread coverage of\n                    harassment cases in 2010 that such cases have created a sense of fear and\n                    trepidation in the community. The installation of ever increasing number of\n                    video surveillance equipment in various HDB common corridors as well as the\n                    formation of numerous citizens’ patrol and watch groups (see the Second\n                    Reading of the 2010 amendment bill at para 4) are further testament to the\n                    unease that has been engendered amongst the members of the community by the\n                    alarming prevalence of such offences. 33     Needless to say, an offence affecting a larger\n                    number of people covering a wider geographical area is more serious than one\n                    that affects few people in a limited area. In the present case, the respondent\n                    had harassed not one, but six units at different locations. This was not a case\n                    where the respondent had committed a one-off offence in a moment of folly.\n                    Rather, he persisted in his conduct and harassed several HDB units over three\n                    separate days. 34     Furthermore, his offences had a wide\n                    geographical reach, from Woodlands and Yishun in the North, Hougang and\n                    Anchorvale (Sengkang) in the North East, and Geylang Bahru in the Central area,\n                    to Geylang East in the East. He therefore encroached on the safety and serenity\n                    of more than one neighbourhood. That said, this should not typically be viewed\n                    as an independent aggravating factor as it would be taken care of in sentencing\n                    by virtue of the multiple charges for which two or three would be ordered to run\n                    consecutively. Indeed in the present case, the District Judge ordered three of\n                    the sentences to run consecutively. Therefore to treat it as an independent\n                    aggravating factor would amount to double counting.",
        "The need for specific deterrence": "35     The principle of specific deterrence merits\n                    consideration in the present case. The respondent is no stranger to the courts,\n                    having been convicted on several occasions for different offences. Although the\n                    respondent does not have loansharking or related antecedents, his chequered past\n                    is a relevant factor for sentencing as it clearly demonstrates his cavalier\n                    disregard for the law: seeTan Kay Beng v Public\n                        Prosecutor[2006] 4 SLR(R) 10 at\n                    [14]–[16]. 36     Given his long list of antecedents, it would\n                    not be an exaggeration to say that the respondent has re-offended almost\n                    immediately each time after he underwent punishment for a prior offence. He was\n                    given the opportunity of rehabilitation in 2003 when he was ordered to undergo\n                    probation for theft and road traffic offences but re-offended in 2004 for\n                    similar offences. Even then, he was given another opportunity and was sentenced\n                    to reformative training. However, he still did not realise the error of his ways\n                    and went on to commit the offence of affray for which he was fined in 2007. The\n                    respondent was finally sentenced to 6 months’ imprisonment in 2009 for\n                    theft (again), together with even more serious offences (against persons). Soon\n                    after his release from prison for those offences, in January 2010, he was\n                    convicted and sentenced to 5 months’ imprisonment for road traffic\n                    offences. 37     His most recent infractions show that he has\n                    escalated his criminal conduct even further in committing more serious offences\n                    involving the use of fire for harassment purposes. A sufficiently severe\n                    sentence is therefore mandated to steer him away from the path of\n                crime.",
        "Legislative Changes to the Moneylenders Act": "38     The legislative history of the penalty\n                    provisions for harassment offences demonstrates Parliament’s clear intent\n                    in enacting harsher penalties in order to stem the ever-increasing tide of such\n                    offences. This intent is manifested in the following changes to the punishment\n                    provisions for harassment offences resulting in property damage: (a)     with effect from 16 August\n                        1983, the punishment was revised todiscretionary\n                            imprisonmentfor a term not exceeding 12 months and/or\n                        discretionary fine of not less than $2,000 and not more than\n                    $20,000; (b)     with\n                        effect from 1 January 2006, the punishment was revised todiscretionary imprisonmentfor a term not exceeding 3 years\n                        and/or discretionary fine of not less than $4,000 and not more than $40,000.\n                        In addition, there would also bediscretionary\n                            caningof not more than 4 strokes if it is proved to the\n                        satisfaction of the court that, in the course of committing the offence,\n                        damage was caused to any property; and (c)     with effect from 11 February 2010, the punishment\n                        was revised tomandatory imprisonmentfor a\n                        term not exceeding 5 years, discretionary fine of not less than $5,000 and\n                        not more than $50,000, andmandatory caningof\n                        not less than 3 and not more than 6 strokes if it is proved to the\n                        satisfaction of the court that, in the course of committing the offence,\n                        damage was caused to any property. 39     From the above summary, the penalty provisions\n                    have undergone several revisions over the years, each time resulting in harsher\n                    penalties being imposed for such offences. This amply demonstrates that the task\n                    of curbing harassment activities has been an uphill one, necessitating the\n                    enactment of increasingly severe penalties from discretionary imprisonment and\n                    caning to mandatory imprisonment and caning. 40     Parliament has repeatedly articulated the need\n                    for a strong stance or a “zero tolerance” approach in order to\n                    stem the rising numbers of such offences. In the Second Reading of the 2005\n                    amendment bill (which was passed as Act 44 of 2005) that increased the maximum\n                    imprisonment term from 12 months to 3 years and also doubled the minimum and\n                    maximum fines from $2,000 to $4,000 and $20,000 to $40,000 respectively,\n                    Assoc Prof Ho stated (seeSingapore Parliamentary\n                        Debates, Official Report(21 November 2005, vol 80 at\n                    col 1831): Sir, the number of unlicensed moneylending and related harassment cases,\n                        however, continues to rise from some 1,500 cases in 1995 to almost 6,000\n                        cases last year, ie, about a four-fold increase. In some instances, parties\n                        who did not borrow money were also harassed. For example, new occupants of\n                        dwellings that were formerly occupied by debtors, and people who had lost or\n                        misplaced their identity cards. In addition, the number of arrests made in\n                        unlicensed moneylending and related harassment cases increased by almost 20%\n                        in one year, from 330 arrests in 2003 to 393 arrests in 2004. Sir, we must tackle the rise in illegal moneylending cases resolutely,\n                        adopting a comprehensive approach… Sir, as for these amendments which are under consideration, Parliament\n                        should send a strong signal to loansharks that we will not tolerate the\n                        conduct of unlicensed moneylending activities, where exorbitant interest\n                        rates are charged and borrowers and even non-borrowers are harassed in their\n                        own homes. … In conclusion, Sir, these amendments are needed to send a strong signal\n                        thatthe Government has zero tolerance for unlicensed\n                            moneylending activities. The enhanced deterrent effect should\n                        also help stem the increase that we have seen in such activities. [emphasis added] 41     Unfortunately, the 2005 amendments did not\n                    succeed in curbing harassment activities. Parliament’s intent to take an\n                    even harsher stand against such activities is evident from the Second Reading\n                    speech of the 2010 amendment bill. In that speech, Assoc Prof Ho noted that the\n                    number of loanshark and harassment cases continued to increase: except for a\n                    brief respite in 2007, when the numbers of such cases dropped slightly.\n                    Professor Ho observed that the number of reports has continued to rise with\n                    11,879 cases reported in 2008 and 18,645 cases reported in 2009. 42     As pointed out above, the 2010 amendments\n                    which introducedboth mandatory imprisonment and\n                        caningmarked a paradigm shift in Parliament’s treatment of\n                    unlicensed moneylending and related offences. Henceforth, they are to be viewed\n                    as syndicate offences that are particularly pernicious and must be met with the\n                    full brunt of the law. 43     In light of the recent legislative changes\n                    leading to the current Moneylenders Act, Parliament has clearly adopted an even\n                    more robust stance against such harassment offences.",
        "Sentencing benchmarks": "44     I note that there are no reported decisions at\n                    the appellate level on cases of harassment resulting in property damage (whether\n                    by fire or other means) under the previous or current Moneylenders\n                Act. 45     The present case therefore presents an\n                    opportunity for this Court to take cognizance of the recent legislative changes\n                    so as to provide guidance by clarifying the benchmark sentences that should be\n                    imposed in respect of both non-fire and fire harassment cases under the previous\n                    and current Moneylenders Act. 46     Under the previous Moneylenders Act (ie, after Act 31 of 2008), sentences of between 8 to 12\n                    months’ imprisonment and 1 to 2 strokes of the cane have generally been\n                    imposed for adult offenders who carry out non-fire acts of harassment (ie, use of paint, markers, even bicycle locks) on behalf\n                    of unlicensed moneylenders: seeJoseph Ong Dick Tat v Public\n                        ProsecutorMagistrate’s Appeal No 142 of 2008 andPublic Prosecutor v Fazlie bin HasnieDAC 14581/2010. It\n                    is pertinent to highlight that the sentences were imposed when imprisonment and\n                    caning were discretionary. 47     Under the current Moneylenders Act, sentences\n                    of 12 months’ imprisonment and the mandatory minimum 3 strokes of the cane\n                    have generally been imposed for non-fire with property damage cases: seePublic Prosecutor v Wu Wei ChunDAC 31830/2010\n                    andPublic Prosecutor v Kau Wui KeongDAC 19918/2010. The increase in the tariff for non-fire with property\n                    damage cases is in line with and gives effect to Parliament’s intent to\n                    take an even stronger stance on such offences. I see no reason why the benchmark\n                    for non-fire with property damage cases should be revised. 48     In my view, it is manifestly clear that a\n                    distinction needs to be drawn between non-fire with property damage cases,ie, by splashing paint or scribbling with\n                    indelible ink, and fire with property damage cases such as the instant case\n                    whereby doors were set on fire with kerosene. The use of kerosene to set fire\n                    causes more significant damage to the property and endangers the lives of the\n                    occupants. Moreover, the potential to cause harm to innocent neighbouring\n                    residents and their property cannot be overlooked. 49     I am of the view that the benchmark sentence\n                    for fire with property damage cases should be set at 18 months’\n                    imprisonment and 3 strokes of the caneper charge.\n                    The reason for the enhanced sentence is the aggravating nature of such offences\n                    as explained in[13]–[38]above. I should add that this benchmark is\n                    also in line with the recent unreported case ofPublic\n                        Prosecutor v Ow Chia Chye(DAC 14403/2010 & ors). In that\n                    case, the accused had committed a range of harassment offences on behalf of an\n                    unlicensed moneylender, including splashing paint and scrawling graffiti. He had\n                    set fire to a unit on one occasion. For the setting of fire, he was sentenced\n                    under the current Moneylenders Act to 18 months’ imprisonment, 3 strokes\n                    of the cane and a fine of $5,000. 50     In deciding on the 18-month benchmark, I took\n                    cognizance of the benchmark sentence for causing mischief by fire under\n                    s 435 of the Penal Code. Generally, an imprisonment sentence of 3 years has\n                    typically been imposed for offences under s 435 of the Penal Code: seePublic Prosecutor v Zuraimi Bin Abdul RahimDAC 42206/2009, DAC 43200/2009, DAC 4201/2009 andPublic\n                        Prosecutor v Thiam Chin LoongDAC 32851/2009. The ingredients for\n                    a conviction under s 435 of the Penal Code and s 28(2)(a) read with\n                    s 28(3)(b)(i) of the current Moneylenders Act are practically identical.\n                    However, it was fairly highlighted to my attention by the Prosecution that a\n                    direct comparison between the two offences may not be entirely accurate because\n                    there is no provision for caning in respect of convictions under s 435 of\n                    the Penal Code. Nonetheless despite the difference, the 3-year benchmark\n                    sentence for a conviction under s 435 of the Penal Code at least provides\n                    some measure of direction on the appropriate sentence for fire harassment\n                    convictions under the current Moneylenders Act. Parliament has clearly decided\n                    that mandatory caning together with mandatory imprisonment would be more\n                    effective to deal with such insidious offences. 51     The 18-month benchmark for fire harassment\n                    cases should be increased in appropriate situations where for instance the fire\n                    caused extensive damage beyond the door of the unit into the premises or onto\n                    the neighbouring unit. Any increase beyond the 18-month benchmark should be\n                    calibrated according to the extent and severity of the damage. I should add that\n                    if injuries are caused to the residents arising from the fire, thismaynot necessarily constitute an aggravating factor\n                    since separate and more serious charges would be levied against the accused\n                    under s 321 or s 322 of the Penal Code for voluntarily causing hurt or\n                    grievous hurt depending on the nature of the injuries. However, I do not rule\n                    out the possibility that injuries to resident may in appropriate cases amount to\n                    an aggravating factor for sentencing purposes.",
        "Absence of mitigating factors": "52     In his mitigation plea, the respondent stated\n                    that he committed the offences out of desperation due to his difficult financial\n                    circumstances, and in order to avoid harassment to himself and his\n                    family. 53     It is trite that financial difficulties cannot\n                    be relied upon in mitigation of an offence save in the most exceptional or\n                    extreme of circumstances: seeLai Oei Mui Jenny v Public\n                        Prosecutor[1993] 2 SLR(R) 406 at [10]. 54     In keeping with this principle, the courts\n                    have generally not accorded any mitigating weight to claims that the offences in\n                    question were committed to repay loansharks. For example, inPublic Prosecutor v Ong Ker Seng[2001] 3 SLR(R) 134 at\n                    [30], the High Court did not attach any mitigating weight to the accused\n                    person’s claim that he was driven to commit the offence of obtaining loans\n                    without disclosing his undischarged bankrupt status in his desperate bid to\n                    repay loansharks who were hounding him. InSim Yeow Seng v\n                        Public Prosecutor[1995] 2 SLR(R) 466 at [10], the High\n                    Court similarly rejected the argument that the accused had committed the offence\n                    of criminal breach of trust in order to pay off loansharks. 55A fortiori, no\n                    distinction should be drawn between these cases and the harassment cases.\n                    Indeed, debtors-turned-runners who have first-hand experience of what it is like\n                    to be hounded by loansharks should know better than to revisit such hardship\n                    upon third parties in a bid to escape their own predicament. 56     In line with Parliament’s aim of\n                    curtailing harassment offences, I find that no mitigating weight should be\n                    accorded to the argument that the offender only committed harassment to avoid\n                    harassment of himself and his family. Many harassment acts are carried out by\n                    such debtors-turned-runners. If the Court were to impose lenient sentences on\n                    the basis of sympathy for their conundrum, the inadvertent effect would be to\n                    further encourage the continued exploitation of easy prey. 57     It is clear that the law does not view an\n                    accused person’s financial plight as a mitigating factor particularly\n                    where the offence was motivated by greed and the lure of easy money. InZhao Zhipeng v Public Prosecutor[2008]\n                    4 SLR(R) 879, it was stated at [37] that: Persons who act out of pure self-interest and greed will rarely be treated\n                        with much sympathy; conversely, those who are motivated by fear will usually\n                        be found to be less blameworthy. 58     In the present case, the respondent had\n                    consciously chosen to carry out harassment by fire because this would allow him\n                    to earn $150 per unit, compared with harassment using spray paint which would\n                    only earn him $60 per unit. 59     As for the respondent’s submission that\n                    he was not a member of an illegal unlicensed moneylending syndicate, this\n                    utterly misses the point because by agreeing to be a runner and carrying out the\n                    offences on the instructions of an unlicensed moneylender, he had become an\n                    integral part of the moneylending ecosystem that has been characterised by\n                    Parliament as a syndicate. 60     Finally, he raised a most audacious point in\n                    mitigation. He claimed that the doors to the HDB flats were incombustible and\n                    hence the fires would not have hurt anyone. However, it cannot be ignored that\n                    it is quite common for residents to place items such as shoe racks, empty boxes\n                    and other items which are combustible outside the doors and along the corridors.\n                    The risk of such items catching fire is both real and possible. In fact in the\n                    present case, the fire did cause the electrical wiring and the ceiling lamp\n                    along the common corridor to melt. In one case, the fire spread to an area which\n                    was close to the gas supply pipes. 61     For the above reasons, I find that the\n                    respondent’s mitigation plea disclosed no basis whatsoever for a lighter\n                    sentence in the present case.",
        "Undue weight placed on the totality principle": "62     I cannot agree with the District Judge’s\n                    decision to impose a lighter sentence for each of the individual harassment by\n                    fire charges on the basis of the totality principle. In this regard, I accept\n                    the Prosecution’s submission that the imposition of low sentences for such\n                    charges would invariably have a “downstream” effect on the\n                    sentences for non-fire with property damage cases. In other words, the low\n                    sentence for fire with property damage cases would push the sentences for\n                    non-fire cases downwards correspondingly. This would be inconsistent with\n                    Parliament’s intent of taking a stronger stance on harassment activities\n                    as exemplified in the 2010 amendments. 63     For example, if the sentence for each of the\n                    harassment by fire charges were to remain at 12 months’ imprisonment with\n                    the mandatory minimum 3 strokes of the cane, the sentence for non-fire with\n                    property damage cases under the current Moneylenders Act should logically have\n                    to be less than 12 months’ imprisonment with the mandatory minimum 3\n                    strokes of the cane. In other words, the sentencing tariff for non-fire with\n                    property damage cases under the present Moneylenders Act would not have\n                    increased from the previous Moneylenders Act. Such a token increase in the\n                    sentencing tariff is unlikely to have the deterrent effect that was envisaged by\n                    Parliament in enacting the 2010 amendments.",
        "Mandatory caning should not affect custodial term": "64     It also appears that the District Judge had\n                    taken into account the mandatory caning of at least 3 strokes per charge for\n                    fire harassment cases in arriving at the 12-month imprisonment term that was\n                    imposed on the respondent. 65     It might be argued that the custodial terms\n                    for harassment offences under the current Moneylenders Act should be calibrated\n                    to reflect the fact that there is a mandatory minimum of 3 strokes of the\n                    cane. 66     However, this could not have been\n                    Parliament’s intent in enacting the current Moneylenders Act.\n                    Parliament’s intent was to take a harsher stance on unlicensed\n                    moneylending and related offences because it was evident that the previous\n                    penalties were not sufficiently effectual in reducing such crimes. 67     If the courts were to “soften”\n                    the custodial sentences under the current Moneylenders Act to\n                    “offset” the caning imposed, the net deterrent effect would not be\n                    as significant as intended. This would undermine the purpose of enhancing the\n                    penalties as a deterrent against such offences. 68     Accordingly, I find that the present sentence\n                    of 12 months’ imprisonment and 3 strokes of the cane per harassment charge\n                    would not adequately reflect the heightened seriousness with which Parliament\n                    views such offences.",
        "Conclusion": "69     Taking into account all the above\n                    considerations, in particular the actual damage caused by the fires and the\n                    potential risk to human life and safety, I am of the view that it is sufficient\n                    to enhance the sentence for each of the five harassment convictions before me to\n                    18 months. The imprisonment sentences for three of the harassment charges are to\n                    run consecutively, totalling 54 months’ imprisonment. These sentences\n                    reflect society’s particular opprobrium of such offences which have a deep\n                    negative impact on public safety and security. If the damage to the properties\n                    had been more serious, I would have no hesitation in imposing a stiffer term of\n                    imprisonment. The imprisonment sentences for the two remaining harassment\n                    charges and the charge for assisting in the moneylending business as ordered\n                    below are to run concurrently with the 54 months’ imprisonment sentence.\n                    There will be no change to the 15 strokes of cane ordered below. 70     Accordingly, the total sentence for DAC 18860\n                    of 2010, DAC 19746 to 19749 of 2010, and DAC 19751 of 2010 is therefore 54\n                    months’ imprisonment and 15 strokes of the cane. As the offender has been\n                    in remand since 30 April 2010, the sentence of imprisonment is to take effect\n                    from that date. 71     It leaves me to record my gratitude and\n                    appreciation to Mr Hay Hung Chun and Ms Peggy Pao for their comprehensive and\n                    well-researched submissions which provided considerable assistance to me in the\n                    drafting of this decision."
    }
}