{
    "case_title": "Singapore Telecommunications Ltd\n      v\n      APM Infotech Pte Ltd",
    "ncitation": "[2011] SGHC 147",
    "coram": "Eunice Chua AR",
    "sections": {
        "Introduction": "1       In today’s globalised world where claims\n                    often involve parties from different jurisdictions, enforcement is of key\n                    concern to a plaintiff. This case raises the interesting question of whether a\n                    court may exercise its inherent jurisdiction to enter judgment after considering\n                    the merits of the plaintiff’s case rather than in default of appearance\n                    pursuant to O 13 r 1 of the Rules of Court (Cap 332, R 5,\n                    2006 Rev Ed) (“the Rules”) – the former being a foreign\n                    judgment enforceable in the defendant’s jurisdiction and the latter one\n                    that is not.",
        "Factual background": "2       On 25 May 2010, the plaintiff filed a writ of\n                    summons with its statement of claim endorsed in the High Court. The plaintiff\n                    claimed against the defendant US$491,682.46 for the provision of international\n                    calling services that the defendant had not paid for, contractual interest of\n                    two percent per month and costs on an indemnity basis. The international calling\n                    services were provided pursuant to two agreements: (1) a “Service\n                    Request-Cum-Agreement for Corporate Voice Delivery (CVD) Service”\n                    (“the CVD agreement”); and (2) a “Service\n                    Request-Cum-Agreement for SingTel International Private Leased Circuit (IPLC)\n                    Service” (“the IPLC agreement”) (collectively “the\n                    Agreements”) entered into on 12 December 2005. The Agreements\n                    incorporated “Specific Terms and Conditions for CVD Service” and\n                    “Specific Terms and Conditions for IPLC Service”, respectively, as\n                    well as the plaintiff’s “General Terms and Conditions of\n                    Service”, two versions of which are applicable to the present dispute,\n                    namely one effective from 1 June 2004 and another effective from 1 August 2006.\n                    Both versions of the plaintiff’s General Terms and Conditions stipulated\n                    in cl 17.1 that the laws of Singapore would govern any disputes arising\n                    from the Agreements and that the defendant submitted to the non-exclusive\n                    jurisdiction of the Singapore courts. 3       On 15 June 2010, the plaintiff applied for leave\n                    to serve the writ of summons and statement of claim out of jurisdiction under O\n                    11 r 1(d)(iii), (iv) and O 11 r 1(r) of the Rules. An Assistant Registrar\n                    granted an order in terms on 17 June 2010 (“the 17 June 2010\n                    Order”). 4       After an initial unsuccessful attempt to serve\n                    the writ of summons and statement of claim on the defendant on 8 December 2010\n                    at its registered office in New Delhi (Green Park, F-65, New Delhi, Delhi\n                    110016, India) and its place of business in Noida (B-24, 25 Sector 1, Noida\n                    210301, India), the plaintiff’s Indian solicitors, Kochhar & Co,\n                    served original and translated copies of the writ of summons, statement of claim\n                    and the 17 June 2010 Order on the defendant by way of email on 29 March 2011, at\n                    the defendant’s email address maintained by the Ministry of Corporate\n                    Affairs, Government of India, New Delhi (vkgupta27@hotmail.com). Kochhar &\n                    Co confirmed that such a mode of service was in accordance with the laws of\n                    India as follows: ... Order V Rule 9 of the Code of Civil Procedure, 1908 as applicable in\n                        India permits service of summons on a Defendant/Respondent by means of\n                        transmission of documents by fax message or electronic mail service.\n                        Accordingly, service of summons by email is recognized and accepted form of\n                        service in India. 5       The plaintiff filed its memorandum of service on\n                    20 April 2011 instead of within the time period of 8 days from the date of\n                    service of the writ of summons and statement of claim due to inadvertence. The\n                    defendant failed to enter appearance after 21 days from the date of service and\n                    the plaintiff obtained a certificate of non-appearance dated 11 May 2011\n                    confirming the same. 6       On 11 May 2011, the plaintiff filed Ex Parte\n                    Summons No 2049 of 2011 praying for an extension of time for filing the\n                    memorandum of service as well as for judgment to be entered against the\n                    defendant. In an affidavit filed in support of the application, counsel for the\n                    plaintiff requested that the court consider the pleadings and the affidavits\n                    filed in order to enter judgment on the merits of the case. Counsel deposed\n                    that, as advised by Kochhar & Co, the enforceability of a foreign judgment\n                    may be challenged in India if it had been given on account of the\n                    defendant’s default of appearance without any consideration of the\n                    evidence or the pleadings,ie, Indian law would\n                    not enforce a foreign judgment that had not been given “on the merits of\n                    the case”. 7       Section 44A of the Indian Civil Procedure Code\n                    1908 (see Manohar & Chitaley,The A.I.R.\n                        Manualvol 4 (All India Reporter Pvt Ltd, 6th Ed, 1979) at\n                    p 958) relates to the enforcement of foreign judgments and provides as\n                    follows: (1) Where a certified copy of a decree of any of the superior courts of\n                        any reciprocating territory has been filed in a district court, the decree\n                        may be executed in India as if it had been passed by the district\n                        court. (3) ... the district court shallrefuse execution of\n                            any such decree, if it is shown to the satisfaction of the\n                        Court that the decree falls withinany of the exceptions\n                            specified in clauses (a) to (f) of section 13. [emphasis added] 8       Section 13 (which contains the exceptions to the\n                    rule that foreign judgments are conclusive) states in relevant part that (see\n                    Manohar & Chitaley,The A.I.R. Manualvol 4\n                    (All India Reporter Pvt Ltd, 6th Ed, 1979) at p 700): A foreign judgment shall be conclusive as to any matter thereby directly\n                        adjudicated upon between the same parties or between parties under whom they\n                        or any of them claim litigating under the same title except - ... (b)where it has not been given on the merits of the\n                            case. [emphasis added] According to the advice of Kochhar & Co, the mere fact that a\n                    judgment was obtainedex partedid notper sejustify a finding that a decision was not\n                    “on the merits of the case”. As laid down by the Kerala High Court\n                    inGovidan Asari Kesavan Asari v Sankaran Asari Balakrishanan\n                        AsariAIR 1958 Ker 203 and affirmed by the Supreme Court of India\n                    inInternational Woollen Mills v Standard Wool (UK)\n                        Ltd[2001] 2 LRI 765, even where the defendant chooses to keep\n                    out of a case, it is possible for the plaintiff to adduce evidence in respect of\n                    his claim, so that the foreign court may give a decision on the merits of the\n                    case after due consideration of the evidence instead of dispensing with such\n                    consideration and giving a judgment merely on account of the defendant’s\n                    default of appearance.",
        "Issues": "9       The two main issues arising in the\n                    plaintiff’s application were as follows: (a)     Whether the court had the\n                        jurisdiction to enter judgment after considering the merits of the case\n                        where a plaintiff was entitled to judgment in default under O 13\n                        r 1 of the Rules but had adduced evidence that such a judgment would\n                        not be enforceable in the jurisdiction where the defendant and its assets\n                        may be found; and (b)     If so, whether the plaintiff was entitled to judgment on the evidence\n                        adduced before the court. I answered both questions in\n                    the affirmative and now set out the detailed grounds of my\n                decision.",
        "Jurisdiction": "10     The plaintiff argued that the court had the\n                    inherent jurisdiction to enter judgment after considering the merits of the case\n                    although the plaintiff was entitled to judgment in default of appearance under\n                    O 13 r 1 of the Rules. The existence of O 13 r 1 did not\n                    limit the court’s inherent powers by virtue of O 92 r 4, which provided\n                    that: For the avoidance of doubt it is hereby declared that nothing in these\n                        Rules shall be deemed to limit or affect the inherent powers of the Court to\n                        make any order as may be necessary to prevent injustice or to prevent an\n                        abuse of the process of the Court. The plaintiff submitted that, in this case, injustice would be caused\n                    by the entry of default judgment because such a judgment would not be\n                    enforceable in India where the defendant and its assets may be found (see[6]–[8]above). The plaintiff would not be able to enforce its legal\n                    rights without being put to the considerable inconvenience and expenses of\n                    commencing proceedings in India. 11     The plaintiff also relied heavily onBerliner Bank AG v Karageorgis and another[1996] 1\n                    Lloyd’s Rep 426 (“Berliner\n                    Bank”) as an instance where the English Court, faced with a\n                    similar situation, had exercised its inherent jurisdiction to try a case on its\n                    merits although judgment in default of appearance could have been entered. In\n                    that case, the plaintiff bank claimed against the defendants pursuant to certain\n                    guarantees. The defendants were served with the writ but did not acknowledge\n                    service. Mr Justice Colman recognised that the plaintiff was entitled to default\n                    judgment under O 13 r 1 of the Rules of the Supreme Court (SI 1965 No\n                    1932) (UK) (“the English Rules”) (the equivalent of O 13\n                    r 1 of the Rules), but noted (at 427) that: ... default judgments such as one would obtain under O. 13 are in many\n                        cases effectively unenforceable outside the jurisdiction of the English\n                        Courts. This is because the defendant has taken no part in the proceedings\n                        and, no doubt, because the Court in giving judgment in this automatic way\n                        has not reviewed the merits of the claim, has not investigated the substance\n                        of the claim and has directed no judicial mind to whether in fact the\n                        plaintiff is entitled to recover. In those circumstances one can quite see\n                        that there is some reluctance in overseas jurisdictions to enforce default\n                        judgments 12     Colman J took the view that the facility\n                    of an automatic judgment was permissive and that the court had an inherent\n                    jurisdiction in relation to both O 13 (default of appearance) and O 19 (default\n                    of defence) of the English Rules to order a full trial of the claim. He held\n                    that that it would be “inappropriate” for the court to decline to\n                    exercise its inherent jurisdiction to do so where “there is material\n                    before it to suggest that a judgment obtained by the automatic method might well\n                    not be enforceable in foreign jurisdictions where the defendant is known to have\n                    assets or where there is a reasonable belief that he might have assets”\n                    (seeBerliner Bankat 428). Colman J then\n                    proceeded to consider the affidavits placed before the court and entered\n                    judgment for the plaintiff. 13     The approach inBerliner\n                        Bankhas been applied in the subsequent cases ofHabib Bank Ltd v Central Bank of Sudan (formerly known as Bank of\n                        Sudan)[2007] 1 WLR 470 andTrafigura Pte Ltd,\n                        Trafigura Beheer BV v Emirates General Petroleum Corporation[2010] EWHC 87 (Comm). 14     Before addressing the plaintiff’s\n                    submissions, it is important to take a step back to consider the nature of the\n                    court’s inherent powers and its relationship with the Rules.PerAndrew Phang J inWellmix\n                        Organics (International) Pte Ltd v Lau Yu Man[2006]\n                    2 SLR(R) 117 at [81], O 92 r 4 “was not intended to allow the\n                    courtscarte blancheto devise any procedural\n                    remedy they think fit”. As provided under s 80(1) of the Supreme Court of\n                    Judicature Act (Cap 322, 2007 Rev Ed), the Rules are made for the\n                    purposes of “regulating and prescribing the procedure ... and the\n                    practice to be followed in the High Court and the Court of Appeal respectively\n                    in all causes and matters whatsoever”. Nevertheless, as eloquently put by\n                    Professor Jeffrey Pinsler, SC (see Jeffrey Pinsler, SC,Supreme Court Practice 2009(Lexis Nexis, 2009) at p8): ... no body of rules, no matter how comprehensive, can cater to the\n                        unlimited variety of circumstances which may arise in the course of\n                        litigation. Although cases may have common elements, the particularity of\n                        the facts which arise may require special consideration.The rules may not contemplate the particular circumstances of the case\n                            and there may therefore be no available procedure. A strict application\n                            of procedural law may lead to injustice in a certain situation, an\n                            outcome which the court may regard as not having been foreseen by the\n                            statutory machinery. It is here that the doctrine of inherent\n                        jurisdiction has an important role to play by virtues of its flexibility and\n                        permeability. [emphasis added] 15     Recognising this, the Court of Appeal inWee Soon Kim Anthony v The Law Society of\n                        Singapore[2001] 2 SLR(R) 821 at [27], considered the nature of the\n                    court’s inherent jurisdiction and held that its exercise “should\n                    not be circumscribed by rigid criteria or tests” and that the court must\n                    in each instance “exercise it judiciously”, with the\n                    “essential touchstone” being that of “need”.\n                    Accordingly (seeRoberto Building Material Pte Ltd and others\n                        v Oversea-Chinese Banking Corp Ltd and another[2003]\n                    2 SLR(R) 353 at [17]): [the court’s] inherent jurisdiction should only be invoked in\n                        exceptional circumstances where there is a clear need for it and the justice\n                        of the case so demands. The circumstances must be special. 16     I take the view that this case was an instance\n                    where there was such an exceptional need. First, the Rules did not contemplate\n                    the particular circumstances of the case before me, leaving there no available\n                    procedure for the plaintiff to follow if it did not wish to obtain default\n                    judgment (which could not be enforced where the defendant and its assets may be\n                    found) but wished to obtain judgment on the merits instead. Order 13 r 1 of the\n                    Rules did notcompelthe plaintiff to take out an\n                    application for default judgment if the defendant failed to enter an appearance\n                    within the stipulated time, rather, it provides as follows: Where a writ is endorsed with a claim against a defendant for a liquidated\n                        demand only, then, if that defendant fails to enter an appearance, the\n                        plaintiffmay, after the time limited for\n                        appearing, enter final judgment against that defendant for a sum not\n                        exceeding that claimed by the writ in respect of the demand and for costs,\n                        and proceed with the action against the other defendants, if any. [emphasis\n                        added] The plain and ordinary meaning of the word “may”\n                    connotes permissiveness or an express possibility. 17     The legislative history of the provision does\n                    not suggest that the provision should be construed otherwise. Order 13 r 1(1) of\n                    the Rules may be traced to O 13 r 1(1) of the English Rules, which\n                    states: Where a writ is indorsed with a claim against a defendant for a liquidated\n                        demand only, then, if that defendant fails to give notice of intention to\n                        defend, the plaintiffmay, after the\n                        prescribed time enter final judgment against that defendant for a sum not\n                        exceeding that claimed by the writ in respect of the demand and for costs,\n                        and proceed with the action against the other defendants, if any. [emphasis\n                        added] This provision has been held to be permissive in nature (seeBerliner Bank). 18     Further, O 13 r 1 of the Rules may\n                    be considered alongside O 19 r 2 of the Rules (judgment in default of\n                    defence) as both relate to automatic judgments where a liquidated claim is\n                    involved. InPanwell Investments Pte Ltd v Lau Ee\n                        Theow[1996] 3 SLR(R) 73 at [24], Warren Khoo J considered O 19\n                    r 2 of the Rules and held that it was “clear from the\n                    authorities” that the rule allowing a plaintiff to apply for judgment in\n                    default of defence was “merely apermissiverule, andnot one to be applied as a matter of course in all\n                        cases” [emphasis added]. There can be no sensible basis to\n                    distinguish between a judgment in default of appearance and one in default of\n                    defence in this context, given their similar language (“the plaintiff may\n                    ... enter final judgment”) in O 13 r 1(1) and O 19\n                    r 2, their similar source (the English Rules) as well as their similar\n                    function and purpose in the scheme of the Rules (to enable a plaintiff to obtain\n                    judgment expeditiously in the event of default by the defendant). 19     The exercise of the court’s inherent\n                    jurisdiction to offer an alternative to automatic judgment therefore did not run\n                    contrary to the procedural system carefully laid out in the Rules. 20     Second, there would be serious injustice to\n                    the plaintiff if the court refrained from exercising its inherent jurisdiction\n                    in the circumstances presented. I accepted the evidence before me on the Indian\n                    Civil Procedure Code 1908, which excepts a foreign judgment which had not been\n                    given on the merits of the case from recognition in India (see[7]–[8]above). As reasoned by Colman J inBerliner\n                        Bankat 428 (see[11]–[12]above) it\n                    would be inappropriate for the court to decline to exercise its inherent\n                    jurisdiction to proceed to try a claim rather than enter automatic judgment\n                    where there was “material before it to suggest that a judgment obtained\n                    by the automatic method might well not be enforceable in foreign jurisdictions\n                    where the defendant is known to have assets or where there is a reasonable\n                    belief that he might have assets”. This was particularly so on the facts\n                    of this case where the foreign defendant had agreed to have Singapore law govern\n                    the Agreements and had also agreed to submit to the jurisdiction of the\n                    Singapore courts. It would make a mockery of the contractual rights of the\n                    plaintiff if the defendant could, by failing to enter an appearance in the\n                    Singapore courts despite having been properly served with the writ of summons\n                    and statement of claim, avoid the consequences of failing to perform its\n                    obligations by challenging the default judgment at the enforcement stage. The\n                    only recourse the plaintiff would then have would be to commence proceedings\n                    afresh in India, which would not only put it to considerable expense, but would\n                    also significantly delay its ability to enforce its rights. This would not be in\n                    the interests of justice. 21     Finally, I also considered whether prejudice\n                    would be suffered by the defendant if the court were to exercise its inherent\n                    jurisdiction. The result of the court exercising its inherent jurisdiction in\n                    this case would be the court assessing the plaintiff’s case on its merits\n                    as opposed to entering default judgment. No prejudice would be caused to the\n                    defendant in this event – in the former scenario, the court may decline to\n                    enter judgment for the plaintiff despite the requirements for entering default\n                    judgment being met whereas in the latter,ceteris\n                        paribus, there would be automatic entry of judgment. As the\n                    defendant had absented itself from the proceedings by failing to enter an\n                    appearance, it could not possibly object to judgment, whether on the merits or\n                    in default, being entered in its absence. Even assuming that the court entered\n                    judgment on the merits for the plaintiff, the defendant would still have some\n                    recourse if the judgment was improperly obtained. For example, if the plaintiff\n                    failed to make full and frank disclosure to the court during theex partehearing (seeThe\n                        “Vasiliy Golovnin”[2008] 4 SLR(R) 994 at\n                    [83]), the defendant could apply to the Singapore courts to have the judgment\n                    set aside. The court’s consideration of the plaintiff’s case on its\n                    merits rather than automatically entering judgment in default of appearance\n                    therefore did not deprive the defendant of any substantial rights or cause the\n                    defendant prejudice. 22     I therefore resolved the jurisdiction issue in\n                    favour of the plaintiff and proceeded to review the affidavit evidence and the\n                    pleadings placed before me.",
        "The merits of the case": "23     The plaintiff’s representative deposed\n                    on affidavit that the CVD agreement commenced on 10 February 2006 and the\n                    plaintiff rendered monthly invoices to the defendant for the services it\n                    provided. These invoices were exhibited and appeared to be regular. They were\n                    sent to the billing address provided by the defendant. However, the defendant\n                    failed to pay and on 20 November 2006, the plaintiff terminated the CVD\n                    agreement under cl 8.3(b)(ii) of the plaintiff’s General Terms and\n                    Conditions. A total of US$350,672.12 remained unpaid from the invoices issued by\n                    the plaintiff to the defendant under the CVD agreement. The invoices included\n                    charges for early termination of the CVD agreement from 21 November 2006 to 9\n                    February 2008, which I found the plaintiff entitled to under cl 3.2(b) of\n                    the Specific Terms and Conditions for CVD Service and/or cl 8.7 of the\n                    plaintiff’s General Terms and Conditions as termination occurred before\n                    the expiry date of the initial contract term (in this case 24 months). Under\n                    cl 3.5 read with cl 1.1 of the plaintiff’s General Terms and\n                    Conditions, the defendant was also liable to pay interest of two percent per\n                    month on the outstanding amount. 24     Similarly, the plaintiff’s\n                    representative deposed that the plaintiff commenced provision of services under\n                    the IPLC agreement on 10 February 2006 and the plaintiff rendered monthly\n                    invoices to the defendant. These invoices were also exhibited and appeared to be\n                    regular. They were likewise sent to the billing address provided by the\n                    defendant. However, the defendant failed to pay and the plaintiff terminated the\n                    IPLC agreement on 20 November 2006 under cl 8.3(b)(ii) of the\n                    plaintiff’s General Terms and Conditions. A total of US$141,010.34\n                    remained unpaid from the invoices issued by the plaintiff to the defendant under\n                    the IPLC agreement. These included fees and charges up to the expiry of the\n                    contract period, which I found the plaintiff entitled to pursuant to\n                    cl 3.4(b) of the Specific Terms and Conditions for IPLC Service and/or\n                    cl 8.7 of the plaintiff’s General Terms and Conditions. Additionally,\n                    cl 3.5 read with cl 1.1 of the plaintiff’s General Terms and\n                    Conditions applied to the IPLC agreement as well, rendering the defendant liable\n                    to pay interest of two percent per month on the outstanding\n                amount. 25     I therefore found the defendant liable to the\n                    plaintiff for: (a) under the CVD agreement, US$350,672.12 plus interest at the\n                    rate of 2% per month from 28 April 2007 (the due date of the last invoice\n                    issued pursuant to the CVD agreement) up to the date of full payment; and (b)\n                    under the IPLC agreement, US$141,010.34 plus interest at the rate of 2% per\n                    month from 28 December 2006 (the due date of the last invoice issued pursuant to\n                    the IPLC agreement) up to the date of full payment. 26     I also awarded indemnity costs to the\n                    plaintiff fixed at $6,351.70 after reviewing the plaintiff’s note of costs\n                    filed on 27 May 2011. The plaintiff was entitled to costs on an indemnity\n                    basis pursuant to cl 10.1(e) of the plaintiff’s General Terms and\n                    Conditions.",
        "Conclusion": "27     For the foregoing reasons, I granted the\n                    plaintiff’s application and entered judgment for the plaintiff after\n                    reviewing the evidence before me and hearing the submissions of counsel for the\n                    plaintiff. Additionally, I granted an extension of time for the plaintiff to\n                    file its memorandum of service after accepting that the plaintiff had filed it\n                    late due to inadvertence and that there would be no prejudice to the defendant\n                    as a result."
    }
}