{
    "case_title": "LTT Global Consultants\n      v\n      BMC Academy Pte Ltd",
    "ncitation": "[2011] SGHC 80",
    "coram": "Judith Prakash J",
    "sections": {
        "Introduction": "1       This is an action for breach of contract. The\n                    plaintiff is a sole proprietorship in Malaysia and has its registered address in\n                    Kuala Lumpur. At all material times in its dealings with the defendant, the\n                    plaintiff was represented by one Dr Siva Ananthan\n                    (“Dr Siva”) who is its chief executive officer. Dr Siva\n                    is also the brother of the proprietor of the plaintiff firm. 2       The defendant is a company incorporated in\n                    Singapore and carries on business under the name BMC Academy which is the name\n                    used in this action. The defendant provides educational services and runs seven\n                    centres in Singapore which offer various educational programmes including\n                    professional courses such as those leading to the degree of Bachelor of Laws\n                    (“LLB”). One of these centres is located in Dhoby Ghaut\n                    (“the Dhoby Ghaut centre”). 3       The defendant set up its LLB programme in 2005\n                    (“the LLB programme”) and operated the same from the Dhoby Ghaut\n                    centre. In August 2007, the defendant entered into a contract with the plaintiff\n                    which provided for the parties to collaborate in the delivery of the LLB\n                    programme to students enrolled with the defendant. This contract was prematurely\n                    terminated sometime in September 2007 and it is the plaintiff’s case that\n                    the defendant is liable to it for breach of contract. The defendant on the other\n                    hand contends that it was the plaintiff that was in breach and therefore cannot\n                    maintain this claim against it.",
        "The background": "4       Dr Siva holds an LLB degree from the\n                    University of London (1985) and a doctoral degree which he obtained in Human\n                    Behaviour (Leadership) in 1992 from La Jolla University, San Diego, USA. Since\n                    1986, Dr Siva has been a law teacher and at one time he ran his own private\n                    law school in Malaysia. After selling the school, he joined the plaintiff which\n                    provides services as a consultant on education and learning. 5       Dr Siva first learned of the\n                    defendant’s LLB programme in about 2006. He then contacted the defendant\n                    to enquire if it required any consultancy services to help it expand its LLB\n                    programme. A meeting with two of the defendant’s directors took place but\n                    the discussions did not lead to any agreement as the defendant did not require\n                    the plaintiff’s services at that time. 6       The parties contacted each other again in June\n                    2007. Dr Siva met Mr Shaik Mohamed Maricar s/o SM Mohamed Osman\n                    Maricar (“Mr Shaik Maricar”), the founder of the\n                    defendant and its chairman and chief executive officer, and his wife,\n                    Mrs Khatijah Phua Anne, who is also a director of the defendant and its\n                    general manager. The meeting took place at the Dhoby Ghaut centre. Dr Siva\n                    was shown around the premises and the parties had fruitful discussions.\n                    Mr Shaik Maricar was desirous of employing Dr Siva as a law lecturer\n                    for the defendant as most of its lecturers had left. Dr Siva, however, made\n                    it clear that he was not interested in being an employee and that the plaintiff\n                    was in the business of providing overall academic support and worked on a profit\n                    sharing model with its clients. 7       The written contract between the parties was\n                    signed on 17 August 2007. It was drafted by Dr Siva and amended before\n                    signature by Akbar Sharif Maricar (“Mr Akbar\n                    Maricar”), the defendant’s director of operations and the son of\n                    Mr Shaik Maricar. This document was entitled “Collaboration\n                    Agreement relating to LLB Degree Program, Other Undergraduate & Post\n                    Graduate Degree Programs” (“the agreement”). Its preamble\n                    noted that the plaintiff had the expertise to conduct and deliver the LLB\n                    programme of the University of London and other undergraduate and post graduate\n                    programmes and that the parties would work collaboratively in the delivery of\n                    such programmes to students in Singapore. 8       Among the material terms of the agreement were\n                    the following. First, it was provided (cl 9.1) that the agreement would come\n                    into force on the Commencement Date and would continue in force for a period of\n                    five years from that date and thereafter continue for further periods of five\n                    years. The term “Commencement Date” was defined (cl 1.1) as\n                    being: [T]he start date of the responsibilities which starts when the necessary\n                        approval from the Ministry of Education in the case of a teaching licence\n                        and the Ministry of Manpower in the case of an employment pass both\n                        applications for Dr Siva Anathan [sic] to\n                        effectively engage his services to begin this cooperation and need not be\n                        the signature date of the agreement; 9       Second, Part B of the agreement which was headed\n                    “The Nature of the Academic Collaboration, the Learning Experience and\n                    Responsibilities of the Parties”, set out the various responsibilities of\n                    the plaintiff (identified therein as LTT) and of the defendant (described\n                    therein as BMC) as follows: 2Responsibilities of\n                            BMC 2.1    BMC shall\n                            provide premises and have the necessary approvals for the programme to\n                            be conducted in Singapore and provide the following\n                        services: 2.1.1  handling student enquiries pertaining to the\n                                Programmes under this Agreement; 2.1.2  recruiting, selecting and admitting students\n                                into the Programmes such that student shall be eligible for\n                                admission as students on a Programme in accordance with eligibility\n                                criteria agreed with LTT from time to time; 2.1.3  the registration of students at\n                            BMC; 2.1.4  managing the marketing and publicity for\n                                Programmes under this Agreement; 2.1.5  providing all learning resources required\n                                for the delivery of the course in accordance with the criteria\n                                agreed with LTT; 2.1.6  collecting any fees charged to students on\n                                Programmes from time to time; 3Responsibilities of\n                            LTT 3.1    LTT shall\n                            provide the overall academic support for the programme and the following\n                            services: 3.1.1  managing the course delivery for the\n                                Programmes, including teaching, course development, student\n                                administration and quality assurance; 3.1.2  ensuring that Dr Siva Ananthan shall be\n                                personally involved as Head of the LLB department at BMC and shall\n                                be directly involved in the teaching and delivery of the\n                                lectures. 3.1.3  providing the students in the Programmes\n                                with appropriate access as may be agreed between the parties from\n                                time to time to materials specially developed by LTT and use of\n                                LTT’s intellectual property; 3.2    LTT shall be accountable for ensuring for\n                                [sic] the quality and standard of all\n                            Programmes and awards offered or made in its name which are provided for\n                            under this collaborative arrangement. 3.3    All expenses incurred with regard to obtaining a\n                            teaching permit and an employment pass for Dr Siva Ananthan shall\n                            be borne by LTT. 10     Part C of the agreement contained the\n                    arrangements for fees and payment. Clause 4.1 provided that the plaintiff should\n                    have the right to inspect the receipt books and accounting records of the\n                    defendant in relation to the collaborative programmes at any time. Clauses 4.2\n                    and 4.3 dealt with payment to the plaintiff for its services and stated that\n                    these were to be as set out in Schedule 1. Clause 8.1 obliged the defendant to\n                    keep supporting documents containing all data required for the provision of\n                    services under the agreement and to allow the plaintiff to inspect the same upon\n                    giving reasonable notice. 11     Turning to Schedule 1, the defendant agreed to\n                    pay the plaintiff, in respect of students studying at the defendant’s\n                    centre for programmes run and delivered by the plaintiff, as follows: (a)     the plaintiff was entitled to 30% of\n                        all fee revenues collected including registration fees as long as\n                        Dr Siva taught a minimum of four subjects at any time in respect of the\n                        LLB programme; (b)     the balance of the revenue was to be shared by the plaintiff and the\n                        defendant on a 50-50 profit-sharing basis; (c)     sub-clause 1(iii) listed the items of\n                        expenditure that could be deducted from revenue for the purpose of\n                        calculating profit; (d)     under cl 2, the defendant was obliged on “a bi-monthly\n                        basis” to forward to the plaintiff an account of fees collected from\n                        students and on that basis, the plaintiff would send an invoice to the\n                        defendant. The payment was to be made within two days of receipt of the\n                        invoice; and (e)     further, adjustments in terms of new student enrolments and withdrawals was\n                        to be “made on a weekly basis”\n                thereafter. 12     From August 2007 onwards, Dr Siva\n                    conducted several “free preview classes” to publicise the LLB\n                    programme. One of the disputes between the parties is as to duration of the\n                    “free preview classes”. During this period, Dr Siva informed\n                    the defendant that it required a better and larger law library in order to\n                    obtain recognition of the programme from the University of London. The defendant\n                    subsequently made two payments of $10,000 each to Dr Siva. Both parties\n                    agree that the first payment was made for the purchase of law books on behalf of\n                    the defendant. In regard to the second payment, the defendant says that this was\n                    also to buy law books but the plaintiff says that the second payment was part\n                    payment of moneys owing to the plaintiff from the fees collected. 13     On 3 September 2007, the Ministry of Education\n                    (“MOE”) gave permission to the defendant to employ Dr Siva as\n                    a teacher to teach specified legal subjects in the LLB programme, subject to\n                    Dr Siva having obtained a valid work pass from the Ministry of Manpower\n                    (“MOM”). On the same day, the MOM issued an “In-Principle\n                    Approval Letter for Employment Pass” by which it approved the issue of an\n                    employment pass for Dr Siva for a period of 24 months. The letter also\n                    provided,inter alia, that: (a)     the In-Principle Approval was valid\n                        for six months from the date of the letter and if the Employment Pass was\n                        not collected by Dr Siva within that period, the application would be\n                        regarded as withdrawn; (b)     the In-Principle Approval allowed Dr Siva to\n                        commence employment for a period of one month from the date of the letter;\n                        and (c)     in order to\n                        collect the Employment Pass, Dr Siva had to undergo a medical\n                        examination and produce a satisfactory medical report. 14     According to Dr Siva, on 5 September\n                    2007, he started formal lessons for the students who had enrolled in the LLB\n                    programme. Thereafter, the lessons were held every week on Wednesdays, Thursdays\n                    and Fridays. On Saturdays, he would give a preview of the course to prospective\n                    students. Dr Siva taught five subjects initially but after week 2 of the\n                    classes, he stopped teaching jurisprudence because there were no students taking\n                    that subject. According to the defendant, Dr Siva did not teach any classes\n                    from 5 September 2007 but only continued to conduct free preview\n                    classes. 15     On 20 September 2007, the plaintiff sent an\n                    e-mail to the defendant putting the defendant on notice that it had persistently\n                    and continuously breached several fundamental provisions of the agreement. The\n                    specific allegations were that the defendant: (a)     had failed to provide adequate and\n                        suitable premises for the conduct of the LLB programme because the\n                        classrooms on the third floor of the Dhoby Ghaut centre were not in fit and\n                        proper condition in that the air-conditioning was continuously breaking\n                        down; (b)     had\n                        failed to carry out its responsibility to market the LLB programme properly;\n                        and (c)     had not\n                        allowed the plaintiff full and free inspection of all financial records and\n                        had not given full disclosure of the fees collected for the LLB\n                        programme. The letter went on to state that the\n                    plaintiff was thereby suspending its services with immediate effect until an\n                    appropriate offer of compensation was made by the defendant. 16     There are two versions of what led up to this\n                    e-mail. Dr Siva said in his affidavit that as the contract had commenced on\n                    5 September 2007, the plaintiff was entitled to the accounts and receipt\n                    books on 19 September 2007. The defendant, however, did not give\n                    Dr Siva access to the accounts and had improperly withheld information.\n                    Sometime in the middle of September, Dr Siva asked Ms Felicia Wong\n                    (“Ms Wong”), the deputy centre manager, for the accounts and\n                    was told she had to check with the boss. On 20 September 2007, he asked\n                    Ms Wong for the accounts again and the total number of students. She told\n                    him that she could not give him the accounts. Dr Siva therefore approached\n                    Mr Ak bar Maricar for the accounts and was told that\n                    Mr Shaik Maricar had not authorised the release of this information.\n                    Dr Siva then contacted Mr Shaik Maricar and asked him about the\n                    receipt books and financial statements. He said he was taken aback when\n                    Mr Shaik Maricar’s response was to rudely rebuke him and say\n                    “Don’t try to be funny”. It was because of this persistent\n                    refusal to disclose the accounts that Dr Siva sent the e-mail of\n                    20 September 2007. 17     The defendant’s version which came\n                    across during cross-examination of Mr Akbar Maricar was that the\n                    unhappiness had arisen in relation to the supply of law books. Dr Siva had\n                    offered to supply law books for the defendant’s law library at the Dhoby\n                    Ghaut centre and for that he needed $20,000. The defendant had given him this\n                    money by way of two cheques. However, Dr Siva had not sent any books\n                    thereafter and instead asked for more funds. The defendant became worried and\n                    started to ask him when the books would arrive. Around 17 or 18 September,\n                    one of the defendant’s employees wrote to Dr Siva and advised him\n                    that the defendant had not received his book list and invoice. On\n                    20 September, Mr Akbar Maricar called Dr Siva and asked him about\n                    the book list. Dr Siva’s response was that if the defendant did not\n                    trust him, it should buy the books itself. Mr Akbar Maricar said that in\n                    that case, the funds should be returned. Dr Siva slammed down the phone.\n                    Shortly afterwards, he called back and was very hostile and rude to\n                    Mr Akbar Maricar before putting the phone down again. Dr Siva was\n                    supposed to conduct a class that evening but he left the centre without doing\n                    so. Shortly before leaving the centre, he sent the e-mail of 20 September\n                    2007. Mr Akbar Maricar stated that he had indicated the details of the\n                    telephone conversation with Dr Siva in his subsequent police\n                report. 18     The defendant did not reply to the e-mail of\n                    20 September. Instead, on 21 September 2007, it wrote to the MOM requesting\n                    that the Employment Pass issued to Dr Siva be cancelled on the basis that\n                    he was suspected of misappropriation of the defendant’s funds and as of\n                    that date was no longer working for the defendant. This letter was not copied to\n                    the plaintiff and the plaintiff remained unaware of it until it was produced in\n                    court in the course of the trial. On 23 September 2007, Mr Akbar\n                    Maricar made a police report on behalf of the defendant in which he stated that\n                    the defendant suspected Dr Siva of having misappropriated the $20,000 which\n                    had been given to him to purchase books for the defendant. The plaintiff was not\n                    informed of this police report until sometime later. 19     On 27 September 2007, the plaintiff who had\n                    not received any response to its previous e-mail, wrote again to the defendant.\n                    In this second e-mail, the plaintiff repeated its allegations in regard to the\n                    manner in which the defendant had breached the agreement and also elaborated on\n                    the same. The plaintiff stated that because of the defendant’s failure to\n                    honour the agreement, it had suffered losses and estimated the same to be\n                    $580,000. The plaintiff felt it had little choice but to suspend the provision\n                    of its services under the agreement with immediate effect. It then gave the\n                    defendant seven days to remedy all of the breaches or pay it compensation of\n                    $580,000 failing which the plaintiff threatened to commence legal action against\n                    the defendant. 20     The defendant did not respond to this e-mail\n                    either. Dr Siva came to Singapore in October 2007 and during that visit, he\n                    was arrested and detained overnight by the police. After investigations, the\n                    police informed Dr Siva that no action would be taken against him. The\n                    parties had no further contact with each other thereafter. This action was\n                    started by the plaintiff on 3 April 2008.",
        "The claim and the defence": "21     In its statement of claim, the plaintiff\n                    pleaded that the defendant had breached the provisions of the agreement in the\n                    following ways: (a)     in breach of cl 2.1,\n                        Dr Siva was only allowed to conduct classes on the third floor of the\n                        Dhoby Ghaut centre and this area was unfit for use by the plaintiff in\n                        that: (i)       the air-conditioning\n                            frequently broke down; (ii)       the defendant did not provide any LCD projector\n                            and screen on many occasions thereby preventing Dr Siva from\n                            conducting proper lessons; (iii)       the defendant failed to ensure that the toilet\n                            facilities were clean and properly maintained for\n                        use; (iv)       the\n                            defendant did not obtain the necessary approvals to allow Dr Siva\n                            to conduct the classes; and (v)       the said premises were not approved by the MOE\n                            for conducting classes; (b)     in breach of cl 2.1.4, the defendant despite\n                        repeated reminders from Dr Siva, arranged little or no publicity for\n                        the LLB programme to be conducted by Dr Siva for nearly a month after\n                        the execution of the agreement; (c)     in breach of cl 2.5.1, the defendant failed to\n                        ensure that the library facilities were sufficient or in existence for the\n                        conduct of the LLB programme; (d)     in breach of cl 4.1, the defendant repeatedly\n                        refused to allow Dr Siva to examine the receipt books and accounting\n                        records of the defendant; (e)     in breach of cl 4.2 and Schedule 1, the defendant\n                        had failed to pay the plaintiff all the fees due and owing to date;\n                        and (f)     in breach\n                        of cl 2 of Schedule 1, the defendant, despite repeated reminders,\n                        refused and/or failed to give any account of the fees collected from\n                        students enrolling for the LLB programme. 22     The statement of claim set out the remedies\n                    sought by the plaintiff as being the following: (a)     an account of all fees and/or\n                        revenue received by the defendant under the agreement pursuant to Schedule\n                        1, cl 1(1); (b)     payment of 30% of the fees or revenue received by the defendant under\n                        the agreement pursuant to Schedule 1, cl 1(1); (c)     reimbursement of all the expenses\n                        incurred by the plaintiff or its representative, Dr Siva, under the\n                        said agreement; (d)     payment of half of the balance of the revenue pursuant to Schedule 1,\n                        cl 1(2) of the agreement; and (e)     the plaintiff’s loss of future profits as a result\n                        of the defendant’s breaches. 23     In essence, the response of the defendant as\n                    set out in its defence is as follows: (a)     The classes for the LLB programme\n                        had not commenced on 5 September 2007 because Dr Siva had\n                        conducted free preview classes for the LLB programme in August and September\n                        2007. (b)     Dr Siva had not taught at least five subjects from 5 September\n                        2007 as he alleged. (c)     The defendant had not breached cl 2.1 of the agreement because\n                        the premises in the Dhoby Ghaut centre were fit for use and the classes for\n                        the LLB programme were provided with LCD projectors and screens. The Dhoby\n                        Ghaut centre was approved on 16 April 2004 and the MOE had given\n                        approval on 3 September 2007 for Dr Siva to teach the LLB\n                        programme. (d)     The\n                        defendant had arranged adequate publicity for the LLB programme and full\n                        details of the advertisements placed for the programme were set out in the\n                        defence. (e)     The\n                        library facilities were adequate. (f)     Dr Siva had sought $20,000 for the purchase of books\n                        for the library and the defendant had been induced to pay him this amount to\n                        procure the books. Despite the defendant’s reminders and requests, the\n                        plaintiff did not purchase any books nor account for the sum of $20,000 and\n                        Mr Akbar Maricar had therefore lodged a police report against\n                        Dr Siva. (g)     The plaintiff had not fulfilled its responsibilities set out in cl 1.1\n                        and cl 3 of the agreement. Although an employment pass for Dr Siva\n                        had been approved in principle, Dr Siva did not submit a medical report\n                        as required by the MOM and did not collect the employment pass and the same\n                        was withdrawn on 1 September 2007. (h)     The defendant denied the allegations that it had\n                        failed to pay the plaintiff fees and that it had failed to give the\n                        plaintiff an account of fees collected from the students. The defendant also\n                        alleged that it was the plaintiff that was in breach of the agreement and\n                        that there were no fees due and owing to the plaintiff;\n                    and (i)     The defendant\n                        considered that it did not have to reply to Dr Siva’s demand of\n                        27 September 2007 because it was the plaintiff who had breached the\n                        agreement. 24     Arising from the pleadings as summarised above\n                    and the points taken during the trial, in its closing submissions, the plaintiff\n                    summarised the issues as follows: (a)     whether the agreement had come into\n                        force; (b)     whether\n                        the defendant had breached the agreement in any of the ways alleged by the\n                        plaintiff; and (c)     whether the plaintiff was entitled to terminate the agreement by reason of\n                        the defendant’s breach. 25     The defendant’s closing submissions did\n                    not dispute that the issues formulated by the plaintiff arose for consideration.\n                    In relation to issue (a), its position was that the plaintiff had not conducted\n                    any classes. In relation to issue (b), it asserted that it had not been in\n                    breach of the agreement. In relation to issue (c), it alleged that\n                    Dr Siva’s failure to submit a medical report to the MOM to fulfil its\n                    requirement for the issue of an employment pass constituted a fundamental breach\n                    of contract on the plaintiff’s part. Therefore the plaintiff was not\n                    entitled to enforce the agreement or claim any payment from the defendant. Thus,\n                    a fourth issue arises from the defendant’s submissions which is whether\n                    the plaintiff had itself committed a breach of contract by failing to submit the\n                    medical report.",
        "The issues": "",
        "Had the agreement come into force by 20 September 2007?": "26     Clause 9.1 of the agreement provided that it\n                    would come into force on the Commencement Date and would continue in force for a\n                    period of five years thereafter. As noted above at[8], the Commencement Date referred to the date on which the\n                    parties’ responsibilities started and this was when the necessary\n                    approvals from the MOE and the MOM had been obtained for Dr Siva to provide\n                    his services to the defendant. 27     It was common ground that the MOE had given\n                    its approval on 3 September 2007. The dispute centred on whether\n                    Dr Siva had received MOM’s approval and, further, whether he had\n                    actually provided any services under the agreement. To an extent, the second\n                    question is a red herring because cl 9.1 of the agreement is very clear:\n                    the agreement would start when both the approvals were obtained. It does not say\n                    that Dr Siva has to commence proper paid-for classes in order for the\n                    agreement to be triggered. 28     As stated in[13]above, on 3 September 2007, MOM had granted\n                    Dr Siva an “in-principle” approval to commence employment. By\n                    its terms, he was allowed to work for a period of one month and was required to\n                    undergo a medical examination and collect his permanent employment pass within\n                    six months. In court, Mr Shaik Maricar took the view that the\n                    “in-principle” approval meant an approval for the applicant to\n                    comply with certain requirements as set out by the MOM like the medical\n                    examination and did not mean that the applicant was eligible to work. This view,\n                    however, was not supported by any evidence from the MOM itself. Indeed,\n                    Mr Akbar Maricar had earlier agreed that the “in-principle”\n                    approval allowed Dr Siva to commence employment for one month from\n                    3 September 2007. Subsequently, Mr Akbar Maricar tried to explain that\n                    the one month was the period within which the medical examinations and x-rays\n                    had to be conducted. 29     I do not find the defendant’s\n                    interpretation of the MOM letter persuasive. The letter itself states that it\n                    “allows the Employment Pass applicant to commence employment for a period\n                    of one month from the date of this letter”. This plainly means that\n                    Dr Siva was allowed to work for the defendant for one month. He was not\n                    restricted to simply going for medical examinations and reporting the results of\n                    the same to the MOM. As I read the letter, what it meant was that Dr Siva\n                    could work for one month initially but that if he did not obtain the permanent\n                    employment pass within that period, he would have to stop work at the end of the\n                    period and would not be able to resume work until he had fulfilled the\n                    requirements for the issue of the permanent employment pass. 30     Bearing in mind the definition of\n                    “Commencement Date” in the agreement and the fact that the\n                    MOM’s approval letter allowed Dr Siva to work for an initial period\n                    of one month from 3 September 2007, in my judgment, the agreement came into\n                    force on 3 September 2007 itself. However, for completeness, I shall also\n                    consider whether Dr Siva started work in fact in September\n                2007. 31     The plaintiff’s case is that\n                    Dr Siva started lecturing enrolled students on 5 September 2007. Prior\n                    to that, he had been conducting preview classes to attract students to the LLB\n                    programme. The defendant says that all classes conducted by Dr Siva in\n                    September 2007 were preview classes and no proper classes took place.\n                    Dr Siva’s reply was that he did conduct some preview classes on\n                    Saturdays during that month but that the other classes he conducted were part of\n                    the LLB programme. 32     The defendant’s contention that all\n                    classes conducted by Dr Siva were free preview classes was supported by the\n                    following points: (a)     First, the plaintiff had stated in\n                        further and better particulars filed by it that Dr Siva had travelled\n                        to Singapore to conduct “preview classes” from\n                        “16 August 2007 to 21 September 2007” and\n                        accordingly, the classes held between 5 September 2007 and\n                        21 September 2007 must have been preview classes. It should be noted\n                        that when this was pointed out to him in cross-examination, Dr Siva\n                        said that the date “21 September 2007” was obviously a\n                        typographical error. (b)     Second, although two former students and one co-lecturer had\n                        testified that Dr Siva had taught classes, the students’ evidence\n                        was flawed because the notes referred to by them in their affidavits of\n                        evidence in chief were in respect of totally different subjects. It was also\n                        pointed out that one of the students harboured grievances against the\n                        defendant and therefore the credibility of his evidence was in\n                    doubt. (c)     Third, the\n                        defendant had a system of requiring its lecturers to obtain the signatures\n                        of the students attending the lectures on attendance sheets provided by the\n                        defendant for this purpose. In the case of the classes conducted by\n                        Dr Siva, no attendance sheets had been signed or dated and nothing had\n                        been handed over to the defendant for verification. Dr Siva had not\n                        followed the protocol that was usually adopted to verify that an actual\n                        lecture had been conducted by him. (d)     Fourth, Dr Siva had previously stated that he was\n                        physically present in Singapore to conduct “free” classes on\n                        20 September 2007 and under cross-examination he repeated that he was\n                        “there on the 20thof September to teach\n                        [his] classes”. The defendant insisted that this was untrue because\n                        during cross-examination Dr Siva had admitted that no class was\n                        conducted on 20 September 2007. 33     The plaintiff, on the other hand, relied\n                    considerably on the evidence of the two former students, Mr Ashraf Bin\n                    Hassan (“Mr Ashraf”) and Mr Justin Santiago\n                    (“Mr Santiago”), and that of the co-lecturer,\n                    Mr Anand Jude Anthony (“Mr Anthony”), to\n                    support its assertion that Dr Siva had taught proper classes in September\n                    2007 and had not only conducted preview classes. I am satisfied from the\n                    evidence of the students that formal classes were conducted from\n                    5 September 2007 onwards. The students were not very careful in the way\n                    that they filed their affidavits thus resulting in the discrepancies seized on\n                    by the defendant. However, their actual evidence on the classes that were\n                    conducted and why they classified such classes as formal classes rather than\n                    previews was convincing. Whilst Mr Ashraf was not happy about the way he\n                    had been treated by the defendant (he was abruptly told that the defendant could\n                    not offer him the last year of the LLB programme and he would have to find\n                    another college), he freely admitted his unhappiness and I do not think that it\n                    affected his evidence on the classes conducted in September 2007. This\n                    particular portion of the evidence was, in essence, supported by both\n                    Mr Santiago and Mr Anthony. Mr Anthony testified that while he\n                    was conducting his own classes in September 2007, he could see and hear\n                    Dr Siva doing the same thing with a different group of students.\n                    Mr Anthony impressed me as a truthful witness who was detached and\n                    objective in the way that he testified. 34     There was also documentary evidence to support\n                    the assertion that the classes conducted on Wednesdays, Thursdays and Fridays in\n                    September 2007 were not preview classes. First of all, a free induction\n                    timetable was produced and that showed that free induction classes were only\n                    scheduled in August 2007. Mr Akbar Maricar agreed that no other free\n                    induction timetable had been produced. Secondly, advertisements placed by the\n                    defendant for the LLB programme stated “Intakes from Intermediate Part 1\n                    & 2 Finals starting, 5thSeptember 2007”.\n                    Thirdly, on the defendant’s application form, the date of commencement of\n                    the LLB programme was stated as “5thSeptember\n                    2007”. Fourthly, Mr Anthony did fill up attendance sheets for\n                    classes that he conducted. His first class for the law of trusts was held on 6\n                    September 2007. Mr Anthony considered this to be a proper class although\n                    Mr Akbar Maricar maintained that Mr Anthony had given a free class. As\n                    the plaintiff pointed out, this evidence was not believable given that the\n                    defendant had paid Mr Anthony for these classes on an hourly\n                basis. 35     Dr Siva also provided some attendance\n                    sheets for students who had attended lectures on the law of torts. In court,\n                    Mr Akbar Maricar agreed that these students were existing students of the\n                    defendant. If so, the likelihood was that they were attending paid classes as it\n                    would not make much sense for the defendant to provide preview classes for\n                    existing students. There was also some e-mail correspondence which appeared to\n                    indicate that proper classes had started. Ms Wong sent Dr Siva an\n                    e-mail on 17 September 2007 asking for the timetable for the intensive\n                    revision lectures for those students who had to re-sit their examinations. In\n                    this e-mail she gave Dr Siva details of those students who were preparing\n                    for the examinations to be held in October/November 2007. Significantly,\n                    Mr Shaik Maricar himself agreed in cross-examination that classes for\n                    intermediate students, including revision classes for them, had started in\n                    September 2007. 36     Dr Siva did explain that he had continued\n                    to give preview classes on Saturdays in September 2007. Mr Anthony\n                    testified that there were no preview classes in September 2007 but he qualified\n                    his statement by testifying that he was not present in school on Saturdays.\n                    Therefore, Mr Anthony could not have been aware of what happened on\n                    Saturdays. As far as Mr Anthony was concerned, in September he had started\n                    conducting proper classes in the courses taught by him and was no longer in the\n                    preview mode. Mr Anthony’s evidence does not weaken\n                    Dr Siva’s position as they were teaching different courses in the LLB\n                    programme and it was reasonable for Dr Siva to conduct a few more preview\n                    classes since the plaintiff had an interest in attracting as many students as\n                    possible to the courses. Mr Anthony was paid on an hourly basis and\n                    therefore would not have had as much incentive to carry out extra free preview\n                    classes. 37     I am satisfied on the evidence that in all\n                    probability, Dr Siva did commence proper classes on 5 September 2007\n                    as alleged by the plaintiff.",
        "Was the plaintiff in breach of contract?": "38     Before I go on to consider whether the\n                    defendant was in breach of the agreement, I think I should deal with the\n                    defendant’s allegation that the plaintiff is not entitled to maintain the\n                    claim because the plaintiff itself had committed a breach of contract. This\n                    allegation arises from the assertion contained in the defence that because\n                    Dr Siva did not submit a medical report within two weeks of\n                    7 September 2007 (ieby 21 September\n                    2007), the plaintiff was in breach of contract. 39     The agreement itself did not contain any\n                    clause requiring Dr Siva to undergo a medical examination. This requirement\n                    arose out of the MOM letter giving in-principle approval. The letter stated\n                    expressly that if the Employment Pass was not collected by Dr Siva within\n                    six months, the application would be regarded as withdrawn. The letter was\n                    accompanied by an annex in three parts. Part II was entitled “Procedures\n                    and requirements for the collection of the pass”. The third paragraph of\n                    this part under the heading “Medical Examination” reads: For the purpose of collecting the pass(es), the Work Pass Division\n                        requires the medical report, HIV blood test report and/or chest x-ray report\n                        in English. The medical examination must also have been done within three\n                        months before the date of the collection. The date 21 September 2007 does not appear\n                    anywhere in the approval letter. It would appear from the language of the letter\n                    that the medical examination could take place any time within the six-month\n                    period for collection of the Employment Pass as long as it took place no earlier\n                    than three months before the applicant wanted to collect the pass. Going by the\n                    date of the letter, Dr Siva would have had up to 2 March 2008 to\n                    collect the Employment Pass and could have gone for the medical examination any\n                    time between 3 September 2007 and about mid February 2008 as long as he\n                    collected the pass within three months of the examination date. How then could\n                    Dr Siva have been obliged to go for the medical examination by\n                    21 September 2007? 40     The defendant’s case is that on 7\n                    September 2007, Mr K Ko Ko Win (“Mr Win”), the principal\n                    of the defendant’s school at the material time, had told Dr Siva\n                    about the requirements set out in MOM’s approval letter and had instructed\n                    him to furnish a medical report within two weeks. This evidence was not given by\n                    Mr Win himself but was given by Mr Akbar Maricar during\n                    re-examination. It was thus hearsay and inadmissible. Even if it had not been\n                    hearsay, the defendant did not put forward any basis on which this two-week\n                    deadline could have been incorporated as a term of the agreement. The defendant\n                    did not plead, as perhaps it should have, that it was an implied term of the\n                    agreement that Dr Siva would take all necessary steps to ensure that his\n                    lectures for the defendant were not interrupted by reason of non-compliance with\n                    the work permit requirements. In any case, I do not consider that the defendant\n                    could have established an implied obligation on the part of the plaintiff to\n                    send Dr Siva for the medical examination before 21 September 2007\n                    because if Dr Siva had wanted to collect his Employment Pass on\n                    2 October 2007 (iejust before the expiry of\n                    the initial one month period so as to ensure that there was no interruption in\n                    his classes), he had time up to about 26 September 2007 to see the doctor.\n                    In my judgment, the defendant has failed to establish that the plaintiff was\n                    contractually obliged to ensure that Dr Siva went for the required medical\n                    examination on or before 21 September 2007. 41     It is also significant that the defendant did\n                    not at the material time use Dr Siva’s alleged failure to undergo his\n                    medical examination in time as the basis for its request for the withdrawal of\n                    the application for the Employment Pass. On 21 September 2007, Mr Win\n                    wrote a letter to the MOM requesting the cancellation of Dr Siva’s\n                    Employment Pass. The letter stated,inter\n                    alia,: Thank you for approval of the abovenamed person’s Employment Pass.\n                        However, he is suspected of misappropriation of school’s funds and as\n                        of today he is no longer working with us. Kindly make arrangements to cancel his Employment Pass (Q1) with immediate\n                        effect. It was because this letter was sent that the\n                    MOM withdrew its approval on 1 October 2007. 42     It appears to me that the allegation that the\n                    plaintiff was in breach of contract because of failure to comply with the\n                    medical examination requirements was an afterthought. The defendant did not\n                    disclose the 21 September 2007 letter during the course of discovery for the\n                    trial. This letter was only produced on the second day of the trial after I had\n                    enquired whether the defendant had requested the cancellation of\n                    Dr Siva’s Employment Pass. It seemed to me at that time that the\n                    defendant had not been fully compliant with its disclosure obligations and that\n                    this may have been because the document contradicted its pleaded case. In any\n                    event, the letter once produced showed that Dr Siva’s failure to be\n                    medically examined before 21 September 2007 had no impact on the\n                    cancellation of his Employment Pass or on the course of events\n                generally.",
        "Did the defendant breach the contract?": "Failure to give the plaintiff sight of receipt books and accounting\n                records 43     The plaintiff submitted that under cl 4.1\n                    of the agreement, it had the right to inspect the receipt books and accounting\n                    records of the students in the LLB programme at any time. It pointed out that\n                    Mr Akbar Maricar had agreed that this was the effect of cl 4.1 and\n                    also that Dr Siva had in his e-mails of 20 and 27 September 2007 asked the\n                    defendant for the receipt books and other accounting records. Mr Akbar\n                    Maricar had maintained that prior to these two e-mails, Dr Siva had not\n                    asked for these records. He had to agree, however, that the defendant had not\n                    shown Dr Siva records of its own accord. From the plaintiff’s point\n                    of view, it was significant that the defendant had not replied to either e-mail.\n                    Mr Akbar Maricar’s explanation was that the defendant did not know\n                    how to react and thought that Dr Siva was trying to abscond with the\n                    $20,000 that had been paid for the books. Mr Shaik Maricar’s evidence\n                    was that when he received the e-mail of 20 September 2007 he had told his\n                    son to put it aside and to wait for a follow-up. Then when he received the\n                    second e-mail, he was shocked again and wanted to wait for other\n                    developments. 44     The plaintiff submitted that the evidence of\n                    the defendant’s witnesses that they did not do anything in response to\n                    Dr Siva’s e-mails was consistent with the plaintiff’s claim\n                    that the defendant had failed to abide by the agreement in relation to\n                    disclosure of accounting records. If the defendant had not been in breach, the\n                    defendant could easily have replied to Dr Siva to rebut the allegations. In\n                    fact, it alleged, it was telling that the response of the defendant to the\n                    e-mail of 20 September 2007 was to write to MOM to cancel the Employment\n                    Pass. Further, instead of writing to Dr Siva to tell him about the\n                    cancellation of the pass, the defendant through Mr Akbar Maricar had made a\n                    police report accusing Dr Siva of misappropriating the\n                $20,000. 45     The defendant did not deny that the plaintiff\n                    had the right under cl 4.1 of the agreement to inspect the receipt books\n                    and accounting records of the students in the LLB programme at any time. The\n                    defendant’s position was that prior to 20 September 2007, the\n                    plaintiff had never made a request to have sight of the receipt books. The\n                    plaintiff was running the LLB programme and Dr Siva, the defendant said,\n                    had been given full authority in relation to that programme. He had free access\n                    to any information in regard to the LLB programme because the defendant had left\n                    the day to day running to him and had instructed the staff, including\n                    Ms Wong who was the manager of the Dhoby Ghaut centre, to take directions\n                    from Dr Siva. In fact, when Dr Siva had asked Ms Wong for a\n                    breakdown of the student enrolment, it had been readily made available to him.\n                    The breakdown not only showed the number of students but also the fees each\n                    student had paid to the defendant and therefore the plaintiff had no basis to\n                    complain that it had not had sight of the fees collected. Further, Dr Siva\n                    had the attendance list of the preview classes and could have asked Ms Wong\n                    to give him the accounts of those students as well but he did not do\n                so. 46     Mr Akbar Maricar’s evidence, which\n                    was not challenged, was that Dr Siva had been introduced as the head of the\n                    LLB department in August 2007. The defendant had created an office for\n                    Dr Siva on the ground floor and made it clear that he was a part of the\n                    defendant’s school. He also said that Dr Siva was stationed in the\n                    LLB department and had every opportunity while he was there to pull up any\n                    reports that he wanted to. He did not need to ask anyone for permission. He had\n                    access to all records because Ms Wong was helping him out and he could have\n                    asked her for anything he needed. As far as Mr Akbar Maricar was concerned,\n                    the defendant’s process was transparent and all records were available to\n                    Dr Siva. 47     The first point that arises in connection with\n                    this issue is whether the plaintiff had put in any request for the inspection of\n                    the records prior to 20 September 2007. In its further and better\n                    particulars, the plaintiff had alleged that oral requests were made between 5\n                    and 20 September 2007 and written e-mail requests were made on 20 and\n                    27 September 2007. The defendant, of course, maintained that it had not\n                    received any such request until the plaintiff’s e-mail of\n                    20 September 2007. In court, the only direct evidence of the oral requests\n                    was contained in Dr Siva’s affidavit of evidence-in-chief and his\n                    assertions under cross-examination. There was some indirect evidence of his\n                    alleged requests to Ms Wong in the form of an e-mail which she sent him on\n                    14 September 2007. The e-mail itself simply said “As\n                    attached” without a reference to any specific conversation but the\n                    attachment was a list of the students who had enrolled with details of the\n                    courses they were taking and the fees that they had paid. This did show that\n                    Dr Siva had been asking for some information and that some information had\n                    been supplied though it did not indicate exactly what had been\n                requested. 48     Mr Akbar Maricar’s evidence was\n                    that he was not aware of any such oral request prior to 20 September 2007.\n                    The person who would have been aware of the requests was Ms Wong. The\n                    defendant, however, did not call Ms Wong as a witness. When asked why it\n                    had not done so, the reply was simply that she was uncontactable without any\n                    explanation as to what efforts had been made to try to contact her. I find this\n                    significant. I am also conscious of the fact that the defendant did not, either\n                    in September 2007 or shortly thereafter, write to the plaintiff refuting\n                    Dr Siva’s allegations of his requests having been rejected. At that\n                    time Ms Wong was still in the employ of the defendant and it could have\n                    asked her to verify what Dr Siva had alleged. Additionally, both parties\n                    agree that there was a telephone conversation on 20 September 2007 between\n                    Dr Siva and Mr Akbar Maricar and it is as likely that Dr Siva\n                    raised this issue during the conversation as that Mr Akbar Maricar raised\n                    the issue of the books. Both parties being annoyed with each other, I think it\n                    quite likely that the conversation did end badly. 49     I therefore hold that, on the balance of\n                    probabilities, Dr Siva did make requests for the information both prior to\n                    20 September 2007 and was not given full inspection of the records. As\n                    these requests were not fully accommodated, the defendant breached\n                    cl 4.1. 50     The second issue is whether the\n                    defendant’s failure to furnish the receipt books and accounting records\n                    for inspection after 20 September 2007 is a breach of cl 4.1. The\n                    plaintiff contends that, at the least, the defendant should have allowed\n                    inspection of the records after receipt of the two e-mails and that failure to\n                    do so was a breach of the clause. 51     The defendant’s reasons for not\n                    furnishing the records after the e-mail requests were made were that its\n                    directors felt that Dr Siva was trying to abscond with the $20,000 and that\n                    they were in shock and did not know what to do. The defendant was very\n                    suspicious of Dr Siva by this time as the books had apparently not arrived\n                    and he had stormed out of the centre abandoning his class scheduled for\n                    20 September 2007. Whilst the defendant’s protestations of\n                    helplessness are not fully believable given that it quickly took steps to cancel\n                    the Employment Pass and lodge a police report, I think that the failure to give\n                    access to the records at this stage was not a further breach. 52     There was no indication in the first e-mail\n                    that the suspension that the plaintiff had unilaterally imposed could be\n                    resolved by remedying the breach in relation to access to the records. Instead\n                    it asked for an “appropriate offer of compensation”. This was a\n                    demand for payment and was both inappropriate (given that there was no\n                    indication of what financial damage the plaintiff had suffered, if any) and\n                    threatening as it implied that without such payment the\n                    “suspension” would continue indefinitely. The inference that the\n                    defendant obviously drew from that demand was that the plaintiff was no longer\n                    willing to provide its services except on payment of an undisclosed and, in the\n                    defendant’s view, unjustifiable amount. As noted, the defendant thought\n                    that it had already given Dr Siva $20,000 under a false pretext (it had no\n                    knowledge then that some books had been despatched and had had no response\n                    whatever to its request for a book-list and invoice). It therefore reacted by\n                    cancelling the Employment Pass and thereby, in effect, terminating the agreement\n                    as the same could not continue if Dr Siva was not permitted to teach in\n                    Singapore. In my judgment, in these circumstances, the defendant’s failure\n                    to allow inspection upon and after receipt of the 20 September e-mail was\n                    not a breach of contract. By the time of the e-mail of 27 September\n                    containing,inter alia, a demand that the\n                    defendant remedy its breaches, the contract had been terminated and there was no\n                    issue of any further breach arising. 53     I find that the defendant was in breach of\n                    cl 4.1 before 20 September 2007 but not thereafter. Further, the\n                    effect of the breach had been partly ameliorated by the information supplied on\n                    14 September 2007. Did the defendant fail to comply with cl 2 of Schedule\n                1? 54     Clause 2 of Schedule 1 provides that the\n                    defendant shall forward an account of fees collected from students enrolled for\n                    the LLB programme to the plaintiff on a “bi-monthly” basis. The\n                    plaintiff’s position is that this clause obliged the defendant to forward\n                    the account twice a monthiesemi-monthly whilst\n                    the defendant argued that the account need only be provided once every two\n                    months. The actual wording of the clause is as follows: [The Defendant] shall pay [the Plaintiff] according to the following\n                        timetable: On a bi-monthly basis [the Defendant] shall forward an account of fees\n                        collected from students on the programmes to [the Plaintiff]; Based on this account [the Plaintiff] will send an Invoice to [the\n                        Defendant]. Payment should be made to [the Plaintiff] within 2 days of\n                        receipt of invoice; Adjustments in terms of new student enrolments and withdrawals shall be\n                        made on a weekly basis thereafter. 55     The various dictionaries produced by the\n                    parties indicated that the term “bi-monthly” has two meanings: it\n                    can mean twice a month or it can mean once every two months. The defendant\n                    argued that as the agreement was drafted by the plaintiff, the term should be\n                    readcontra proferentemagainst the plaintiff and\n                    should be given the meaning ascribed to it by the defendant. 56     There are two stages in deciding whether to\n                    apply thecontra proferentemprinciple. The first\n                    stage involves determining whether there is an ambiguity in the contract which\n                    cannot be resolved by interpreting the term in the context of the overall\n                    contract. The principle cannot apply to create an ambiguity where one does not\n                    exist. (SeeMohammed Shahid Late Mahabubur Rahman v Lim\n                        Keenly Builders Pte Ltd[2010] 3 SLR 1021 at [68].) There is no difficulty with the first\n                    stage here because the dictionary definitions have demonstrated that\n                    “bi-monthly” is inherently ambiguous. 57     The second stage involves identifying the\n                    person (“theproferens”) against\n                    whose interest the ambiguous term should be read. Theproferenscould be either the person who seeks to rely on the\n                    term or the person who proposed the term for inclusion in the contract. Both\n                    parties here seek to rely on the termalbeitchoosing different interpretations thereof so the first way of identifying theproferensis not applicable. The defendant\n                    uses the second way and says that the principle should be applied so as to\n                    construe the term “bi-monthly” against the plaintiff because of\n                    the fact that Dr Siva was the main draftsman of the agreement. The\n                    defendant citedTam Wing Chuen v Bank of Credit and Commerce\n                        Hong Kong Ltd[1996] 2 BCLC 69 where Lord Mustill held\n                    that “the person who puts forward the wording of a proposed agreement may\n                    be assumed to have looked after his own interests”. 58     The English position is, however, that the\n                    principle cannot be applied where both parties were involved in the drafting of\n                    the agreement. The case ofLevison v Farin[1978]\n                    2 All ER 1149 held thatcontra\n                        proferentemis irrelevant where the clause “emerged as a\n                    result of joint efforts” (at p 1156) andKleinwort\n                        Benson v Malaysian Mining Corp Berhad[1988] 1 WLR 799\n                    agreed that this principle did not apply to a joint drafting effort. It is\n                    useful to consider the observation inGA Estates Ltd v\n                        Caviapen Trustees Ltd (No 1)(1993) SLT 1037 that\n                    “in ordinary contracts where parties are contracting on an equal footing\n                    it may fairly be assumed that the ultimate terms are arrived at by mutual\n                    adjustments and do not represent the language of one party more than the\n                    other”. The plaintiff also brought to my attention the case ofOxonica Energy Ltd v Neuftec Ltd(2008) EWHC 2127 where the court held that the maximcontra proferentemoperates most comfortably in standard\n                    term contracts, where one side puts forward the document on take it or leave it\n                    terms. The court further stated that it is harder to apply the maxim to the case\n                    of contracts that have been individually negotiated. 59     The present case involves a negotiated\n                    contract. Mr Akbar Maricar stated in court that he had negotiated with\n                    Dr Siva on the terms of the agreement and, specifically, that there were\n                    negotiations regarding the “financials” of the agreement.\n                    Mr Akbar Maricar also asserted that he had made sure that the\n                    defendant’s interests were protected in the negotiation. Whilst the\n                    defendant tried to play down the number of amendments that had been effected to\n                    the first draft by reason of the negotiations, it did admit that changes asked\n                    for by it had been incorporated. There is no doubt that during the negotiations,\n                    the defendant had every opportunity to raise its concerns and ensure that its\n                    terms were included in the agreement. This was not a case of a standard form\n                    contract which the defendant had no choice but to take or leave. In the\n                    circumstances, I agree with the plaintiff that thecontra\n                        proferentemprinciple should not be applied. 60     Given that the term “bi-monthly”\n                    is ambiguous, I still have to construe the agreement in order to determine its\n                    meaning in the context of the agreement. Going through this exercise, it appears\n                    to me that giving the term the meaning “twice a month” would be to\n                    give it its proper construction. The other terms within Schedule 1 substantiate\n                    the plaintiff’s contention that this would be the commercially sensible\n                    interpretation. As cited above, cl 2 of Schedule 1 contains a stipulation\n                    that “adjustments in terms of new student enrolments and withdrawals\n                    shall be made on a weekly basis thereafter”. The fact that adjustments\n                    are to be made weekly supports the construction that the schedule requires a\n                    payment report to be given to the plaintiff twice a month. If\n                    “bi-monthly” had meant “once every two months” it\n                    would have been more logical for the adjustments to be made monthly rather than\n                    weekly. 61     The defendant argued that the\n                    “weekly” adjustment was intended as a reference to enrolments and\n                    withdrawals rather than a weekly adjustment of fees. This argument does not pay\n                    sufficient attention to the language of the schedule as a whole. The rubric of\n                    Schedule 1 is “Fees and Payment” and this appears above cll 1, 2\n                    and 3 thereof. That rubric indicates that the purpose of the schedule is to deal\n                    specifically with payment rather than with enrolment or withdrawal. Further, in\n                    cl 2 itself, the word “adjustments” starts a new sentence\n                    which comes after the sentence “Payment should be made to [the defendant]\n                    within 2 days of receipt of the invoice”. This indicates that the\n                    adjustments to be made are adjustments of fees collected by the defendant having\n                    regard to new enrolments and new withdrawals. 62     It should also be remembered that the e-mail\n                    that Ms Wong sent the plaintiff on 14 September 2007 contained a\n                    report of the fees paid by the students. Although it was not presented as an\n                    account of fees, this payment report was made about nine days after the\n                    agreement had commenced (5 September 2007) and lends some credence to\n                    Dr Siva’s evidence that the parties did not consider\n                    “bi-monthly” to mean once in two months only. 63     I accept the plaintiff’s submission that\n                    on the proper construction of the agreement, the term “bi-monthly”\n                    meant twice a month and that this interpretation makes business common sense in\n                    the circumstances that prevailed between the parties. 64     This holding means that the defendant should\n                    have provided the plaintiff with an account of fees collected on\n                    19 September 2007. The defendant did not do so. The plaintiff did not\n                    accept the payment report of 14 September 2007 as being the account of fees\n                    because Dr Siva doubted the veracity of that report. He testified that he\n                    had noted that in all there were about 40 students attending classes taught by\n                    him. The payment report, however, named only 25 students. It was for that reason\n                    that Dr Siva had been anxious to examine the defendant’s financial\n                    records. 65     The defendant did not contend that it had\n                    complied with cl 2 if that clause meant that the account of fees had to be\n                    furnished twice a month. Its rejection of the allegation of breach was based on\n                    its assertion that this obligation had not arisen because two months had not\n                    passed since the inception of the agreement. Accordingly, I hold that on\n                    20 September 2007 the defendant was in breach of cl 2 of Schedule\n                    1. Did the defendant fail to comply with cl 2 of the\n                agreement? 66     The plaintiff made various averments in its\n                    statement of claim to support its allegation that the defendant had breached\n                    cl 2 of the agreement. The defendant denied these assertions. 67     The first contention was that the\n                    air-conditioning on the third floor broke down regularly and was poorly\n                    maintained and therefore the premises were unfit for use. The evidence for this\n                    averment was Dr Siva’s assertion to that effect in his affidavit of\n                    evidence-in-chief. The plaintiff also pointed out that during cross-examination\n                    Mr Akbar Maricar had agreed that the air-conditioning on the third floor\n                    was in a bad condition. However, even if the air-conditioning did not work\n                    properly all the time, this does not mean that the defendant was in breach of\n                    contract. Mechanical and engineering systems do break down from time to time and\n                    such breakdowns have to be dealt with in the usual course of events. Whilst\n                    Mr Ashraf agreed that there were problems with the air-conditioning,\n                    neither Mr Santiago nor Mr Anthony, who also spent a considerable\n                    amount of time in the premises, complained about it or alleged that the problems\n                    were so bad that they were not able to conduct or sit for their usual classes.\n                    It is also significant that Mr Akbar Maricar testified during\n                    cross-examination that whenever there was a problem with the air-conditioning,\n                    the defendant would arrange for a technician to attend to the problem. This\n                    evidence was not challenged. Overall, there is insufficient evidence for me to\n                    hold that the premises were unfit for use due to lack of\n                ventilation. 68     Dr Siva also gave evidence that at times\n                    he did not have the use of LCD projectors for his lessons. Whilst Mr Akbar\n                    Maricar had stated that all the classes were equipped with projectors, the\n                    documents disclosed by the defendant indicated it owned only two projectors.\n                    Mr Ashraf’s testimony had supported Dr Siva’s assertion in\n                    that he said that several classes commenced late because the LCD projector was\n                    not set up. 69     There is nothing in the agreement that\n                    specifically requires LCD projectors to be available for all lessons although\n                    perhaps this requirement can be inferred from cl 2.1.5 which obliged the\n                    defendant to provide all learning resources required for delivery of the LLB\n                    programme. In any case, it is not that the defendant had no projectors, just\n                    that it had only two projectors and these had sometimes to be moved from class\n                    to class. Mr Anthony did not make a complaint that his classes were\n                    disrupted by the lack of such projectors. Although some of Dr Siva’s\n                    classes may have started late because it took a while for the projector to be\n                    set up, that does not, to my mind, indicate that the agreement was breached\n                    because proper resources were not made available. It was a small matter which\n                    could have been easily resolved by administrative means. Indeed, in his e-mail\n                    of 27 August 2007, Dr Siva himself treated the fact that no projector had\n                    been set up for his class as being a failure of the administrative system. I\n                    find that the defendant was not in breach of the agreement in this\n                    regard. 70     Another complaint about the premises made by\n                    Dr Siva was that the toilets on the third floor were often smelly and that\n                    the students had complained about them. Mr Ashraf echoed this evidence and\n                    said that he had made several complaints about the condition of the toilets. The\n                    defendant denied that the toilets were dirty and produced evidence that it\n                    employed full time cleaners to clean them. The plaintiff countered this evidence\n                    by arguing that the employment documents could not show that the cleaners were\n                    employed to clean the toilets at night or that the cleaners were properly\n                    supervised in their job. In my view, this is another minor complaint which could\n                    have been sorted out by administrative means. There is no evidence that\n                    Dr Siva himself ever complained about the toilets before 20 September 2007\n                    and, in my view, the plaintiff was simply using this problem of dirty toilets to\n                    bolster its case in regard to the fitness of the premises. I must emphasise that\n                    there was no evidence that the toilets, unpleasant though their condition may\n                    have been, constituted a danger to health. 71     In the statement of claim, the plaintiff had\n                    alleged that the third floor of the Dhoby Ghaut centre was not licensed for use\n                    as teaching premises. The defendant produced evidence of such licensing from the\n                    MOE and the plaintiff did not pursue this point in its closing submissions. This\n                    was a frivolous point and reflected the plaintiff’s tendency to overstate\n                    its case. 72     Under cl 2.1.4, the defendant was\n                    responsible for managing the marketing and publicity for the LLB programmes to\n                    be conducted by the plaintiff. The plaintiff alleged that the defendant had\n                    failed to adequately market the LLB programme in accordance with the agreement.\n                    The plaintiff accepted that the defendant had placed advertisements for the LLB\n                    programme but argued that these were insufficient and that the programme had not\n                    been properly publicised because: (a)     the defendant had not employed a\n                        competent advertising firm to plan and market the LLB programme and had no\n                        intention of doing so; (b)     the advertisements placed by the defendant in the\n                        newspapers had no effect because those placed on 25, 26 and 28 August 2007\n                        were small and did not attract many students to the free preview classes in\n                        August 2007. Dr Siva also considered that the defendant had not\n                        allocated sufficient resources towards marketing the LLB programme;\n                        and (c)     although\n                        the defendant had also placed an advertisement of a suitable size in the\n                        newspapers on 31 August 2007, Dr Siva’s view was that that\n                        was too late and an advertisement of that size should have been placed on\n                        21 August 2007 when it would have alerted potential students to the\n                        special free induction lessons that he was conducting. 73     The facts are that within four days of signing\n                    the agreement, the defendant placed the first advertisement of the LLB programme\n                    in the Straits Times. This was the advertisement that appeared on 21 August\n                    2007. Subsequently, four more advertisements were placed in the Straits Times\n                    and Today in August 2007. As Dr Siva himself admitted, the advertisement of\n                    31 August 2007 was of a good size. Similarly sized advertisements appeared\n                    in the newspapers on 3, 6, 10 and 11 September 2007. Altogether the defendant\n                    paid $13,354 (excluding GST) in charges for these advertisements. All the\n                    advertisements were crafted by Dr Siva and he testified that he had no\n                    dispute about their format. Indeed, the defendant had also complied with\n                    Dr Siva’s instructions on placing bigger advertisements in the\n                    newspapers so as to obtain better exposure for the LLB programme. It is\n                    noteworthy that these instructions were given by Dr Siva after he expressed\n                    disappointment with the attendance at the August preview classes and that the\n                    defendant was quick to accommodate Dr Siva’s concerns. 74     Given that the defendant had publicised the\n                    LLB programme in consultation with Dr Siva, it is difficult to accept the\n                    plaintiff’s current complaint that the defendant was in breach of its\n                    publicity obligations under cl 2.1.4. Issues arising in relation to the library 75     In the statement of claim, the plaintiff\n                    pleaded that the defendant had failed to provide sufficient library facilities\n                    for the LLB programme. It was Dr Siva’s evidence that he had found\n                    the library inadequate and had asked the defendant for money to purchase books\n                    so as to make it a “functional law library”. This failure to\n                    provide library facilities was allegedly a breach of cl 2.1.5 of the\n                    agreement. 76     There was, however, no mention of this alleged\n                    breach in the plaintiff’s closing submissions. It is interesting to\n                    consider why it is that the plaintiff did not pursue this\n                allegation. 77     Dr Siva’s position was that when he\n                    pointed out the inadequacy of the law library, he had been given $10,000 by the\n                    defendant to purchase law books. He said that he had told the defendant that he\n                    would sell it books from his own library and that the defendant was amenable to\n                    this suggestion. Further, he had packed up the books and sent them to the\n                    defendant’s office but addressed the parcel to himself there. Dr Siva\n                    valued the books that he had sent out at $7,000 and said that the plaintiff\n                    would have to account for the remaining $3,000. The defendant, on the other\n                    hand, alleged that it had given him $20,000 for books and that there had been no\n                    agreement that the books should come from Dr Siva’s own library. In\n                    any case, the defendant said, it never received the books and that was why on 17\n                    September 2007, an e-mail had been sent to him asking for the book list and the\n                    invoice. Subsequently, sometime after the events of September 2007, a box\n                    addressed to Dr Siva which was found in the Dhoby Ghaut centre had been\n                    opened and the defendant had found 70 books in it, many of which apparently had\n                    nothing to do with law. Dr Siva defended his choice of books by saying that\n                    those that were not law books were useful for the jurisprudence\n                course. 78     On the evidence, it appears that the defendant\n                    had, contrary to Dr Siva’s assertion, paid him $20,000 for law books.\n                    The two payment vouchers (of $10,000 each) which the defendant produced\n                    indicated that each payment had been made for “library books”.\n                    More tellingly, an e-mail from Dr Siva sent on 27 August 2007 which\n                    was produced by the plaintiff only at the trial, showed that it was Dr Siva\n                    who had asked for $20,000 for him “to start getting the necessary books\n                    and law reports”. Thus, contrary to what he later maintained, all of the\n                    money was for purchases for the library. This contemporaneous e-mail was\n                    detrimental to Dr Siva’s credibility on this issue. It also helps\n                    explain the defendant’s anxiety when it did not receive the promised books\n                    and had no response to its e-mail for an invoice and list of books. It should be\n                    noted that the books sent included, apart from legal textbooks, philosophical\n                    writings by persons like Aristotle, John Stuart Mill and Plato. Dr Siva\n                    justified the non-law books as being necessary for jurisprudence. He also,\n                    however, included in the box several study guides which had been written by the\n                    University of London but which were supplied free by that institution. The\n                    difficulty for the defendant was in valuing these items. Dr Siva himself\n                    did not provide a breakdown of the second-hand values of the various textbooks\n                    but asserted that in total they were worth $7,000. 79     I am satisfied on the evidence that the\n                    plaintiff had no basis for its complaint in the statement of claim about\n                    inadequate library facilities. Dr Siva had been given money to remedy this\n                    deficiency and although in court he asserted that at least $100,000 would be\n                    required to adequately stock the library, he produced no evidence to back up\n                    that estimation. He was not even able to produce books that were worth the\n                    $20,000 given to him since on his own evidence his books were worth only $7,000.\n                    The defendant asserted that it thought that Dr Siva was going to buy books\n                    from a third party in Malaysia and that was why it asked for the invoice. There\n                    was no evidence that the books from Dr Siva’s library were worth even\n                    the $7,000 at which he valued them. 80     Whilst the plaintiff could not justify its\n                    complaint about the library, Dr Siva’s undertaking to procure books\n                    may explain why the parties fell out on 20 September 2007. On that day,\n                    Dr Siva and Mr Akbar Maricar had an unpleasant telephone conversation.\n                    Mr Akbar Maricar asked Dr Siva about the books and Dr Siva lost\n                    his temper. I believe this evidence given by Mr Akbar Maricar as there\n                    is some contemporaneous support for it in the police report filed a few days\n                    later. Perhaps Dr Siva felt threatened in some way by the enquiry regarding\n                    the books and that caused him to lose his temper and walk out of the Dhoby Ghaut\n                    centre without conducting the class scheduled for the same evening. To me it\n                    appears to have been an over-reaction but at least it explains his behaviour to\n                    some extent. Dr Siva’s own explanation for his behaviour in walking\n                    out and sending the e-mail of 20 September 2007 to suspend the\n                    plaintiff’s services, is that Mr Akbar Maricar and\n                    Mr Shaik Maricar refused to show him the accounts. This is less\n                    believable because he had not asked for the accounts in writing and also the\n                    accounts were only overdue by one day. The plaintiff was capable of expressing\n                    its complaints in long e-mails and whilst it may have been concerned at the\n                    discrepancy between the list of students given to it by Ms Wong and the\n                    actual number of students who had attended the classes, this concern was not\n                    elaborated in any correspondence between 14 September 2007 and\n                    20 September 2007 (iebefore the plaintiff\n                    suspended its services). It therefore does not appear to me that this concern\n                    was vitally important at the time. No doubt Dr Siva thought that it was a\n                    matter that could be sorted out once the plaintiff had seen the\n                records.",
        "Was the plaintiff entitled to terminate the agreement?": "81     I have found that the defendant was in breach\n                    of contract in two ways,vizfirstly by failing to\n                    forward the account of fees to the plaintiff on a bi-monthly basis, and\n                    secondly, by failing to give the plaintiff full inspection of its receipt books\n                    and accounting records prior to 20 September 2007. The question that arises\n                    is whether these breaches entitled the plaintiff to terminate the\n                    agreement. 82     The legal principles which determine when an\n                    innocent party is entitled to terminate a contract by reason of breach on the\n                    part of the other party to the contract are set out inSports\n                        Connection Pte Ltd v Deuter Sports GmbH[2009]\n                    3 SLR(R) 883 (“Sports\n                    Connection”) andRDC Concrete Pte Ltd v\n                        Seto Kogyo (S) Pte Ltd[2007] 4 SLR(R) 413\n                        (“RDC Concrete”). There are four\n                    situations. First, where the term of the contract which has been breached\n                    clearly states that as a result of the breach the innocent party is entitled to\n                    terminate, a right of termination accrues to the innocent party. Second, where\n                    the party in breach of the contract by its words or conduct renounces the\n                    contract, the innocent party can terminate. Third, where the term which has been\n                    breached is a condition, the innocent party is entitled to terminate. The fourth\n                    situation is that the innocent party is entitled to terminate if the breach of\n                    the term deprives the innocent party of substantially the whole benefit which it\n                    was intended to receive from the contract. 83     The plaintiff accepts that the first situation\n                    does not apply to the present case. It, however, argues that the plaintiff had\n                    the right to terminate because at least one of the other situations\n                    applied. 84     In relation to the second situation, the\n                    argument is that the defendant, by refusing to allow the plaintiff access to the\n                    receipt books and accounting records and by its failure to forward the account\n                    to the plaintiff in accordance with cl 2 of Schedule 1, had by conduct\n                    renounced the agreement. The plaintiff contends that the defendant’s\n                    breaches showed a blatant disregard for the agreement and clearly evinced an\n                    intention to the plaintiff that it would not perform its contractual obligations\n                    at all. I do not accept this argument. There may have been some traction for it\n                    if the whole litany of alleged breaches had been established. Since I have found\n                    in the plaintiff’s favour in respect of only two of its complaints,\n                    however, the contention is somewhat threadbare. The defendant’s conduct\n                    has to be considered in the round and when this is done, these two breaches do\n                    not, to my mind, demonstrate that the defendant was not intending to perform its\n                    obligations. On the contrary the evidence established the defendant’s\n                    commitment to the collaboration in that the defendant: (a)     had paid money to advertise the LLB\n                        programme; (b)     had\n                        set up Dr Siva as the head of the LLB programme and instructed the\n                        staff to take instructions from him; (c)     had given Dr Siva a substantial amount of money to\n                        supply books for the law library; and (d)     was actively engaging with Dr Siva in the promotion\n                        and presentation of the LLB programme. 85     In the alternative, the plaintiff argues that\n                    the facts fall within the third situation. In this respect, it contends that\n                    cl 4.1 was a condition of the agreement. It submits that the plaintiff and\n                    the defendant intended this term to be a condition and that it would not make\n                    commercial sense to argue otherwise as the matter of the fees collected by the\n                    defendant and payment to the plaintiff would go to the root of the\n                    contract. 86     It is clear that cl 4.1 is an important\n                    term because the right of inspection of the receipt books and accounting records\n                    that it provides would enable the plaintiff to check the fees received by the\n                    defendant and ensure that it was receiving its contractual share of the same.\n                    This, however, does not mean that the term was a condition. First, the parties\n                    did not nominate it as a condition and this could easily have been done had that\n                    been the intention since Dr Siva, who drew up the bulk of the contract on\n                    behalf of the plaintiff, would have been well aware of the significance of\n                    describing any particular term as a condition. Second, the parties contemplated\n                    a long term relationship of at least five years with the defendant being given\n                    the right to terminate the agreement only after two years had passed and then\n                    only if the programmes run by the plaintiff did not reach break-even point. It\n                    was foreseeable that during those five years there might be times when there\n                    would be practical difficulties in providing the plaintiff with a continuous\n                    right of inspection. For example, at some points of time the books of account\n                    and records of the defendant might have to be provided to auditors and for that\n                    purpose might be taken out of the office for a short period of time. At other\n                    times the person in charge of the books might be unavailable and the records,\n                    accordingly, inaccessible. It could not have been the parties’ intention\n                    that failure to allow inspection during such periods would be a breach of\n                    contract entitling the plaintiff to terminate. In my judgment, cl 4.1 is\n                    not a condition. 87     As a further alternative, the plaintiff argues\n                    that the defendant’s breaches fell within the fourth situation identified\n                    because the nature and consequences of the breaches deprived the plaintiff of\n                    substantially the whole benefit of the agreement. I do not accept this either.\n                    First, as far as the breach of cl 4.1 was concerned, whilst the plaintiff\n                    had not had access to the receipt books and accounting records, it had been\n                    given some accounting informationviathe e-mail\n                    of 14 September 2007 and the period during which access was not made\n                    available was a period when the collaboration was starting and therefore proper\n                    procedures had not been set down. The plaintiff may have recognised this since\n                    it did not make any written complaint before 20 September\n                2007. 88     Second, the inspection would have been\n                    necessary to countercheck the accuracy of the account of fees which the\n                    defendant was supposed to furnish every half month pursuant to cl 2 of\n                    Schedule 1. On 20 September 2007, the account was not yet in the\n                    plaintiff’s hands and therefore the plaintiff was not yet prejudiced in\n                    any way by being unable to check the records. As far as the breach of cl 2\n                    of Schedule 1 was concerned, the defendant was late by only one day and this was\n                    at a time when new students were still being recruited and the administration\n                    had not yet settled down. It is not clear to me on the evidence, despite\n                    Dr Siva’s assertions, that if the plaintiff had written formally to\n                    the defendant asking for the account specified in cl 2 that the same would\n                    not have been furnished within a reasonable time. There was nothing to indicate\n                    from the defendant’s behaviour that it did not intend to furnish the\n                    account at all. There was perhaps a misunderstanding on the part of the\n                    defendant as to when the account needed to be provided, but if Dr Siva had\n                    raised this issue clearly in writing, it could have been discussed and worked\n                    out. The defendant at that stage needed Dr Siva and the plaintiff’s\n                    services very badly as it had only one other law lecturer and he did not have\n                    the experience or track record of the plaintiff in running the LLB programme. It\n                    is clear to me from the terms of the collaborative agreement which were in\n                    favour of the plaintiff financially (it took 30% of the fees upfront leaving 70%\n                    out of which the expenses had to be met so that the defendant received only 50%\n                    of the net balance, if any) that the defendant was keen to make its\n                    collaboration with the plaintiff work. This was also shown by its willingness to\n                    spend money on publicity and books. 89     In the context of a five year relationship,\n                    the initial difficulties could be seen as teething troubles and were capable of\n                    being ironed out to the satisfaction of both parties. The breaches established\n                    were not, to my mind, of such a nature or consequence to call into question the\n                    whole benefit of the agreement to the plaintiff. If these breaches had continued\n                    for some time or there had been similar breaches of a persistent nature over the\n                    next few months that might have altered the situation, but this did not happen\n                    and that was principally because of the plaintiff’s actions on\n                    20 September 2007. 90     I have come to the conclusion, therefore, that\n                    although the defendant was in breach of the agreement in the ways identified\n                    above, such breaches did not give the plaintiff the right to terminate the\n                    agreement. Its remedy for the same would have been in damages. 91     Unfortunately, the e-mail that Dr Siva\n                    sent to the defendant after his telephone conversation with Mr Akbar\n                    Maricar was in uncompromising terms. He put the defendant on notice that it had\n                    “persistently and continuously breached several fundamental\n                    provisions” of the agreement and specified these as being the\n                    defendant’s failure to provide suitable premises; its failure to market\n                    the programme properly and to allow the plaintiff full and free inspection of\n                    all financial records. At the end of the e-mail, the defendant was put on notice\n                    that despite “many verbal reminders” it had not taken appropriate\n                    remedial action and that the plaintiff was “suspending [its] services\n                    until and [sic] appropriate offer of compensation\n                    is made by you”. This was a strong reaction to complaints that were\n                    mostly of a minor nature. It told the defendant that no more services would be\n                    provided until compensation was paid. There was no indication in the e-mail of\n                    any willingness on the part of the plaintiff to sit down with the defendant and\n                    discuss what needed to be done to deal with the complaints and improve the\n                    situation for the benefit of all parties. In my judgment, since the plaintiff\n                    was not entitled to terminate the agreement and had only a remedy in damages (if\n                    proved), it was not entitled to suspend its services at all much less assert a\n                    right to withhold them until payment of compensation. 92     Dr Siva’s failure to deliver the\n                    scheduled lesson on 20 September 2007 and the plaintiff’s decision to\n                    suspend its services thereafter were, in my judgment, breaches of contract on\n                    the part of the plaintiff. As stated earlier, the defendant thought that the\n                    plaintiff no longer wished to carry on with the contract and reacted by writing\n                    in to the MOM the next day to procure the cancellation of Dr Siva’s\n                    employment pass. Three days later, the police report was made. By then,\n                    effectively, the agreement was at an end.",
        "To what remedies is the plaintiff entitled?": "93     The defendant asserted in its defence that the\n                    plaintiff was itself in breach of contract. I have found the plaintiff to be in\n                    breach, although the breach found by me was not the breach asserted by the\n                    defendant. Since the defendant did not mount a counterclaim, however, I do not\n                    have to consider what possible remedies can be claimed by the defendant. I only\n                    need to consider what remedy the plaintiff can get for the breaches of contract\n                    that it has established. In this connection, I have to reject the\n                    defendant’s submission that because the plaintiff was in breach of\n                    contract, it cannot claim any damages. That is not the legal position even\n                    though I have found breaches on the part of the plaintiff as well. The plaintiff\n                    has established the defendant’s breaches and, if it can establish loss, is\n                    able to claim for those breaches notwithstanding its own fault which was\n                    independent of the defendant’s breaches. The fault of the plaintiff could\n                    have resulted in an award of damages to the defendant if there had been a\n                    counterclaim. In this case, however, the default of the plaintiff would not have\n                    the consequence of depriving it entirely of any remedy. 94     I have set out in[22]above the remedies sought by the plaintiff in its statement\n                    of claim. In the closing submissions, the plaintiff does not address the various\n                    remedies serially but instead asks for an order for damages to be assessed.\n                    Presumably the plaintiff thinks that such an order would encompass all the other\n                    remedies. I think I should make it clear, however, exactly what the plaintiff is\n                    entitled to in view of the fact that it has been able to establish only two\n                    breaches and was also in breach of contract itself, such breach leading to the\n                    termination of the agreement. 95     The first remedy asked for by the plaintiff is\n                    an account of all fees and/ or revenue received by the defendant under the\n                    agreement pursuant to cl 1(1) of Schedule 1. I hold that the plaintiff is\n                    entitled to such an account in respect of students who registered during the\n                    period from 17 August 2007 up to 20 September 2007 for courses to be\n                    taught by the plaintiff and to damages representing the fees that the plaintiff\n                    would have been paid for such students for such period on a pro rata basis in\n                    accordance with Schedule 1 of the agreement. The assessment of damages under\n                    this order would cover the second remedy asked for by the plaintiff, it being\n                    noted the plaintiff is not entitled to a flat 30% of all fees or revenue\n                    received from such students since Dr Siva did not teach four classes\n                    throughout the academic year. 96     The third remedy that the plaintiff asked for\n                    was reimbursement of all expenses incurred by it or Dr Siva under the\n                    agreement. Clause 4.4 of the agreement provides that each party shall meet its\n                    own costs for “all travel, accommodation, subsistence and associated\n                    costs for any meetings for the purposes of [the agreement]”. In view of\n                    that provision, I consider that the plaintiff is not entitled to reimbursement\n                    of any expenses. 97     The fourth remedy that the plaintiff wanted\n                    was payment of half of the balance of the revenue pursuant to Schedule 1,\n                    cl 1(2). Whether any amount is payable in this respect will have to be\n                    determined on the assessment after taking into account the damages payable to\n                    the plaintiff pursuant to[95]above and the\n                    fact that the plaintiff would only be entitled to a pro rata portion of the half\n                    of the balance of the revenue since the plaintiff did not conduct any classes\n                    from 20 September 2007 onwards. 98     The plaintiff is not entitled to damages for\n                    loss of future profits which is the fifth remedy claimed since it was the\n                    plaintiff’s breach that led to the termination of the agreement and since\n                    the plaintiff was not entitled itself to terminate the same. 99     It should also be noted that as against any\n                    damages awarded to the plaintiff, the defendant will be entitled to set-off the\n                    sum of $20,000 less the value of the books supplied by the plaintiff as assessed\n                    by the Registrar.",
        "Conclusion": "100    There will be judgment for the plaintiff for\n                    damages to be assessed in accordance with the guidelines in[95]and[97]above. Regarding costs, as the amount of damages payable may not exceed the\n                    District Court limit, I will leave it to the Registrar who conducts the\n                    assessment of damages to determine the appropriate costs order."
    }
}