{
    "case_title": "Ho See Jui (trading as Xuanhua Art Gallery)\n      v\n      Liquid Advertising Pte Ltd and another",
    "ncitation": "[2011] SGHC 108",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "Introduction": "1       This action arose out of the rupture of a water\n                    inlet hose which carried water to a water dispensing unit (“the\n                    WDU”) installed at the office of Liquid Advertising Pte Ltd (“the\n                    first defendant”). The WDU was installed and maintained by Goh Sin Huat\n                    Electrical Pte Ltd (“the second defendant”). The water which\n                    leaked from the ruptured water inlet hose seeped into an art gallery called\n                    Xuanhua Art Gallery (“the Art Gallery”) located below the first\n                    defendant’s office. The art gallery was owned and operated by Ho See Jui\n                    (“the plaintiff”). The water seepage resulted in damage to the\n                    plaintiff’s paintings which were painted on rice paper.",
        "Background": "",
        "The parties": "2       The plaintiff is in the business of exhibiting\n                    and selling contemporary Chinese ink paintings which are traditionally painted\n                    on rice paper. He is the tenant of the ground floor of a two-storey shophouse\n                    located at 70 Bussorah Street, Singapore 199483. He displayed his paintings at\n                    the Art Gallery and also stored some paintings in a cabinet located at the back\n                    of the Art Gallery. 3       The first defendant was at all material times\n                    the tenant of 70A Bussorah Street (“the Second Floor Unit”) which\n                    is located directly above the Art Gallery. 4       The second defendant is the sole local\n                    distributor of the “Frigeria” brand of WDUs. Additionally, the\n                    second defendant also repairs and maintains the same brand of water dispensing\n                    units. The second defendant sold the first defendant the\n                    “Frigeria” brand WDU that is the subject of this claim, on or\n                    about 2 April 2001.",
        "The installation of the WDU at the Second Floor Unit": "5       The second defendant had initially installed (in\n                    April 2001) the WDU at the first defendant’s previous office located at\n                    770A North Bridge Road, Singapore 198738. When the first defendant moved to\n                    the Second Floor Unit, it entered into an agreement with the second defendant\n                    for the latter to reinstall the WDU at the Second Floor Unit (“the\n                    Reinstallation Agreement”). A quotation issued for the installation\n                    (“the Quotation”) contained the following clause (“the\n                    Quotation Warning”): ** PLS [sic] NOTE: THE PLACE WHERE THE WATER\n                        DISPENSER IS INSTALLED SHOULD HAVE A FLOOR TRAP, SO THAT WHEN THERE IS A\n                        LEAK IT WILL NOT FLOOD THE AREA. WE WILL NOT BE HELD RESPONSIBLE FOR ANY\n                        DAMAGES [sic] RESULTING FROM THE LEAKING\n                            [sic] OR FLOODING FROM THE FILER\n                            [sic] OR WATER DISPENSER. 6       The second defendant reinstalled the WDU at the\n                    Second Floor Unit on 2 September 2004. (Hereinafter, the area where the WDU\n                    was installed will be referred to as the “WDU Area”). It was not\n                    disputed that the WDU Area had timber flooring which could allow water to pass\n                    through its cracks.",
        "The maintenance of the WDU": "7       The first defendant entered into service and\n                    maintenance contracts with the second defendant in August 2001 (“the\n                    First Maintenance Contract”), on 11 December 2003 (“the\n                    Second Maintenance Contract”) and on 22 June 2005 (“the Third\n                    Maintenance Contract”) (collectively, “the Maintenance\n                    Contracts”). The second defendant’s service director, however,\n                    asserted during cross-examination that the parties only had one maintenance\n                    contract which was renewed. 8       The Third Maintenance Contract (which duration\n                    was from 22 June 2005 to 21 June 2007) stated that the WDU was to be\n                    serviced a total of eight times. 9       The Second Maintenance Contract and the Third\n                    Maintenance Contract though not the First Maintenance Contract, contained the\n                    following clause (“the Disclaimer”): DEAR CUSTOMER, PLEASE BE INFORMED THAT THE INSTALLATION OF THE WATER COOLER AND/OR WATER\n                        DISPENSER SHOULD BE AT A WET PANTRY AREA. GOH SIN HUAT ELECTRICAL PTE LTD\n                        WILL NOT BE HELD RESPONSIBLE FOR ANY DAMAGES [sic] RESULTING FROM FLOODING OR LEAKING FROM THE WATER\n                        FILTER AND/OR WATER COOLER AND/OR WATER DISPENSER OR ANY DAMAGES [sic] FROM THE INSTALLATION OR REPAIR OR FAULT OF THE\n                        WATER COOLER AND/OR WATER DISPENSER. 10     The Disclaimer was also inserted in the second\n                    defendant’s service orders which were issued for services carried out\n                    under the Maintenance Contracts, and in the service order issued for the\n                    reinstallation of the WDU at the Second Floor Unit.",
        "The rupturing of the Water Inlet Hose": "11     It was common ground that the water inlet hose\n                    (“the Water Inlet Hose”) carrying water to the WDU ruptured\n                    sometime in the evening of 24 September 2008 and the early morning of\n                    25 September 2008. The water that leaked from the Water Inlet Hose seeped\n                    through the flooring of the Second Floor Unit into the Art Gallery. The\n                    plaintiff alleged that the water that seeped into the Art Gallery damaged his\n                    paintings and the cabinet storing his paintings – this damage formed the\n                    basis of his action against the defendants.",
        "The pleadings": "12     The plaintiff raised three causes of action\n                    against the first defendant in his claim for general and special damages. First,\n                    that the first defendant was negligent in: (a) installing the WDU at the\n                    WDU Area; (b) failing to relocate the WDU to a wet pantry area or a place\n                    with drainage; and (c) failing to ensure that the WDU and/or the Water\n                    Inlet Hose were properly maintained. Second, that the first defendant created a\n                    nuisance by installing the WDU in an inappropriate location. Third, that the\n                    installation of the WDU at the WDU Area was a non-natural or special use that\n                    increased the danger to the plaintiff and/or the Art Gallery; the\n                    plaintiff’s claim in this regard was based on the rule inJohn Rylands and Jehu Horrocks v Thomas Fletcher(1868) LR 3 HL 330 (“Rylands v\n                        Fletcher”). 13     As against the second defendant, the plaintiff\n                    pleaded two causes of action. First, that the second defendant was negligent for\n                    broadly the same reasons raised vis-à-vis the first defendant. In addition, the\n                    plaintiff alleged that the second defendant was negligent in:\n                    (a) installing the Water Inlet Hose which was inherently unsuitable for the\n                    carriage of potable water and/or for use with the WDU and (b) providing\n                    and/or installing the Water Inlet Hose without ascertaining whether the Water\n                    Inlet Hose was suitable for use with the WDU. Second, as with his claim against\n                    the first defendant, the plaintiff alleged that the second defendant created a\n                    nuisance by installing the WDU at an inappropriate location. 14     The first defendant’s defence was as\n                    follows: (a)     The first defendant did not know and\n                        could not have been expected to know that: (i) it was dangerous to the\n                        Art Gallery to install and ordinarily use the WDU; and (ii) the\n                        installation of the WDU at the WDU Area was inappropriate. The first\n                        defendant provided extensive particulars why it could not have known these\n                        two facts – it explained that it had appointed the second defendant, a\n                        competent independent contractor, to install and maintain the WDU and its\n                        piping and it also took reasonable steps to ensure that the WDU would be\n                        properly installed and maintained. (It appeared from the first\n                        defendant’s opening statement and closing submissions that its\n                        averments on its knowledge related to the plaintiff’s claim in\n                        nuisance). The first defendant asserted that an employer would only be\n                        responsible for the nuisance created by an independent contractor if it\n                        could reasonably foresee that the work it instructed the independent\n                        contractor to do was likely to result in a nuisance. (b)     The first defendant did not admit that\n                        it owed the plaintiff a duty of care. In the alternative, the first\n                        defendant claimed that it discharged its duty of care by appointing a\n                        competent independent contractor. (c)     As for the plaintiff’s claim based on the rule inRylands v Fletcher, the first defendant\n                        averred that the use, installation and maintenance of the WDU at the WDU\n                        Area were natural uses of the Second Floor Unit. The first defendant also\n                        averred that any non-natural use was due to an independent act of a third\n                        party. 15     The second defendant denied that it owed a\n                    duty of care to the plaintiff or that it breached that duty for the following\n                    reasons: (a)     The second defendant did not know\n                        that the carpeted flooring at the WDU Area was made of timber and that the\n                        WDU Area was located directly above the plaintiff’s cabinet containing\n                        some of the plaintiff’s paintings. (b)     The second defendant was not responsible for the\n                        location where the WDU was installed. (c)     The second defendant did not install the Water Inlet\n                        Hose. The second defendant also averred that the Water Inlet Hose appeared\n                        to be deliberately cut. 16     The second defendant denied the\n                    plaintiff’s nuisance claim for broadly the same reasons. 17     The first defendant served a notice of\n                    contribution or indemnity against the second defendant for the plaintiff‘s\n                    claim. The first defendant claimed that it was entitled to an indemnity or\n                    contribution because the second defendant had breached various implied terms of\n                    the Reinstallation Agreement and the Maintenance Contracts in two respects.\n                    First, it provided the Water Inlet Hose which was of an unsatisfactory quality\n                    and/or was not reasonably fit for its intended purpose. Second, the second\n                    defendant did not perform its obligations under the Reinstallation Agreement and\n                    the Maintenance Contracts with reasonable care and skill, or at\n                all. 18     The main points that the second defendant\n                    raised in response to the first defendant’s claim for an indemnity or\n                    contribution were as follows. First, the Maintenance Contracts expired before\n                    24 September 2008. Second, under the terms of the Third Maintenance\n                    Agreement, the second defendant did not take responsibility for the location of\n                    the WDU. Further, the second defendant’s duties only concerned the WDU\n                    itself and not the Water Inlet Hose. Third, the terms that the first defendant\n                    claimed were implied into the Reinstallation Agreement and the Third Maintenance\n                    Agreement were not so implied because the Water Inlet Hose was not installed by\n                    the second defendant. Fourth, in the alternative, the second defendant was\n                    entitled to rely on the Quotation Warning and the Disclaimer. 19     The trial before this court only concerned the\n                    issue of liability of the defendants because the court below had made an order\n                    for bifurcation of the trial.",
        "The issues": "20     The factual disputes for determination were as\n                    follows: (a)     What caused the Water Inlet Hose to\n                        rupture and was the Water Inlet Hose suitable for carrying\n                    water? (b)     Was the\n                        Water Inlet Hose suitable for use with the WDU? (c)     Were the features which caused the rupturing of\n                        the Water Inlet Hose discoverable on a reasonable\n                    inspection? (d)     Did the\n                        second defendant install the Water Inlet Hose? 21     The following were the legal issues to be\n                    considered: (a)     The plaintiff’s claim against\n                        the first defendant in the tort of negligenceviz, the duty of care and breach of duty. I therefore have\n                        to consider only the following two issues: (i)       Did the first defendant owe\n                            the plaintiff a duty of care to ensure that the Art Gallery would not be\n                            damaged from a leakage of water from the WDU? (ii)       If so, did the first\n                            defendant breach that duty? (b)     Did the first defendant create or maintain a nuisance by\n                        locating the WDU at the WDU Area? (c)     With regard to the plaintiff’s claim against the\n                        first defendant under the rule inRylands v\n                            Fletcher, was the first defendant’s location of the WDU\n                        at the WDU Area a non-natural use of its premises? (d)     In relation to the plaintiff’s\n                        claim against the second defendant in the tort of negligence, the parties\n                        had also only contested the elements of duty of care and breach of duty.\n                        Therefore, the same two issues should be considered: (i)       Did the second defendant\n                            owe the plaintiff a duty of care? (ii)       If so, did the second defendant breach that\n                            duty? (e)     Did the second defendant create or maintain a nuisance by locating\n                        the WDU at the WDU Area? (f)     Depending on this court’s findings, a further issue\n                        to be decided would be whether there is a need to apportion liability\n                        between the two defendants. (g)     Further, if the first defendant is liable to the\n                        plaintiff, it would be necessary to consider whether the first defendant is\n                        entitled to an indemnity from the second defendant. In this regard, the\n                        following subsidiary issues will have to be addressed: (i)       Did the second defendant\n                            breach the Reinstallation Agreement and/or the Maintenance\n                            Contracts? (ii)       If so, would the Quotation Warning and/or the Disclaimer\n                            exculpate the second defendant?",
        "The findings": "",
        "What caused the Water Inlet Hose to rupture and was the Water Inlet\n                Hose suitable to carry water?": "The evidence 22     The plaintiff and the defendants called expert\n                    witnesses to testify on first, the cause of the failure of the Water Inlet Hose\n                    and second, whether the Water Inlet Hose was suitable to carry water. For\n                    convenience, both issues will be dealt with together. 23     The plaintiff’s witness was one Liam Kok\n                    Chye (“Liam”). Liam is a senior consultant with Matcor Technology\n                    & Services Pte Ltd. Liam testified that he has had more than 20 years of\n                    consulting experience in materials and corrosion engineering in various\n                    industries. Importantly, his experience included failure and material analysis\n                    of polymers and plastics. 24     Liam’s evidence was as follows: (a)     The Water Inlet Hose had a\n                        pre-existing fabrication defect in the form of two helical seam lines\n                        (“the Helical Line Feature”). (b)     The Water Inlet Hose was unsuitable for use with\n                        a WDU because it was made of ester-based polyurethane. Liam concluded that\n                        the Water Inlet Hose was made of ester-based polyurethane after conducting a\n                        Fourier Transform Infrared (“FTIR”) analysis of a similar hose\n                        purchased from Pneumax, the manufacturers of the Water Inlet\n                    Hose. (c)     Ester-based\n                        polyurethane is susceptible to degradation when it is exposed to water. This\n                        process of degradation is known as\n                    “hydrolysis”. (d)     Ester-based polyurethane tubes are not suitable for use\n                        in potable water systems. Liam referred to the Singapore Standard Code of\n                        Practice No 48 titled “Code of Practice for Water Services”\n                        (“SSCP No 48”). According to Liam, SSCP No 48 sets out\n                        industry practices and standards in Singapore for the use of tubes and pipes\n                        for the carriage of water. Liam referred to the following paragraphs of SSCP\n                        No 48 in his report: 2.2    Choice of materials for piping 2.2.1 In choosing the material for the piping and\n                            fittings, account shall be taken of the character of the water to be\n                            conveyed and of the nature of any ground in which the piping is to be\n                            laid.The material shall be non-corrodible or\n                                resistant to corrosionbothinsideand outside, shall be suitably protected against\n                            corrosion and shall not impart any taste or toxicity on the water\n                            conveyed. All pipes and fittings shall comply with the requirements and\n                            standards stipulated by the Authority. … 2.2.6 Plastic pipes include unplasticized polyvinyl\n                            chloride, polybutylene, polypropylene or polyethylene. Suppliers are to\n                            be consulted on the suitability of their use with hot\n                        water. … [emphasis added] Since ester-based polyurethane is susceptible to degradation by\n                        hydrolysis, it was not suitable for the carriage of potable water on the\n                        basis of SSCP No 48. (e)     Liam’s view was that the Water\n                        Inlet Hose ruptured because of hydrolysis and the Helical Line\n                        Feature. 25     The first defendant’s witness was Graham\n                    Alan Cooper (“Cooper”). Cooper is an associate with the Singapore\n                    office of Dr J H Burgoyne & Partners (International) Ltd. Cooper has worked\n                    as a materials scientist specialising in failure analysis and failure\n                    investigation for more than 25 years. 26     Cooper’s evidence was as follows: (a)     The Helical Line Feature was\n                        probably the result of the usual process used to manufacture hoses such as\n                        the Water Inlet Hose. Consequently, the Helical Line Feature was not really\n                        a defect. It is better described as a feature of the Water Inlet\n                        Hose. (b)     The\n                        likely cause of the rupturing of the Water Inlet Hose was a chemical attack\n                        from the water flowing through it. The Water Inlet Hose was made of\n                        ester-based polyurethane which is susceptible to hydrolysis. Ester-based\n                        polyurethane has good resistance to oils but relatively poor resistance to\n                        water. (c)     The\n                        Water Inlet Hose was therefore not suitable for carrying\n                    water. 27     Cooper confirmed during cross-examination that\n                    he agreed with Liam’s findings, apart from a “very slight\n                    difference of emphasis”. This difference in emphasis was that in\n                    Cooper’s opinion the Helical Line Feature was an inherent feature of the\n                    Water Inlet Hose. The Water Inlet Hose was designed to transport compressed air.\n                    If the Water Inlet Hose had been used for its intended purpose, the Helical Line\n                    Feature would not have presented any problems. 28     The second defendant’s witness was Cheng\n                    Shao Hing (“Cheng”) who is an engineering consultant with Camden\n                    Engineering Associates. 29     Cheng’s evidence was that the rupture on\n                    the Water Inlet Hose appeared to be a clean cut. According to Cheng, the Water\n                    Inlet Hose could have ruptured due to a cut from a sharp instrument with both\n                    ends of the Water Inlet Hose firmly held down. During cross-examination, Cheng\n                    clarified that he was only drawing a “possible conclusion” as to\n                    the cause of the failure of the Water Inlet Hose. He agreed that the Water Inlet\n                    Hose could have failed because of other causes. Cheng did not draw any\n                    conclusions in his expert report as to whether the Water Inlet Hose was suitable\n                    to carry water. However, Cheng referred to a hydrostatic pressure test done by\n                    Setsco Services Pte Ltd (“Setsco”) on a hose of the same type as\n                    the Water Inlet Hose that the second defendant had commissioned. The hose was\n                    able to withstand a hydrostatic pressure of four bars per hour. Cheng clarified\n                    during cross-examination that the reason for his reference to Setsco’s\n                    test was that it showed that the Water Inlet Hose could be used for the carriage\n                    of water under pressure. 30     Both Cooper and Liam disagreed with\n                    Cheng’s evidence that the Water Inlet Hose could have been ruptured due to\n                    a cut. 31     Liam provided four reasons why the cause of\n                    failure could not have been a cut. First, the rupture on the Water Inlet Hose\n                    was straight. It would be difficult to make a straight cut on a plastic tube.\n                    Second, the rupture on the Water Inlet Hose wasdirectly\n                        alongthe Helical Line Feature which was inclined at\n                    approximately 12 degrees to the longitudinal axis of the Water Inlet Hose. In\n                    Liam’s view, it was practically impossible for a cut to coincidentally run\n                    along such a helical seam line. Third, a close-up view of the ruptured portion\n                    of the Water Inlet Hose showed that the rupture occurred along two distinct\n                    regions. One region had a greyish colour and the other region was slightly\n                    darker. Liam’s opinion was that if the Water Inlet Hose were cut, the\n                    rupture would have had a consistent appearance. Fourth, in Liam’s opinion,\n                    an examination of the rupture showed that it was made from the inside out.\n                    Needless to say, it would be nearly impossible to make a cut in the middle of a\n                    hose from the inside out. 32     Cooper provided three reasons for his\n                    disagreement with Cheng’s evidence. First, the Water Inlet Hose ruptured\n                    from the inside out. Second, Cooper agreed with Liam that it would be\n                    inconceivable for a cut to have been made precisely along the Helical Line\n                    Feature. Third, a close examination of the fracture surface of the Water Inlet\n                    Hose showed that the Water Inlet Hose was not cut. If the Water Inlet Hose was\n                    cut with a sharp knife, the fracture surface would appear as a clean cut with\n                    striations due to the fine serrations on the knife blade. The arguments 33     The plaintiff submitted that Cheng’s\n                    evidence should be disregarded entirely because Cheng conceded that failure\n                    analysis was not his area of speciality. The plaintiff also highlighted that\n                    Cheng admitted that his testimony was simply that a cut was a possible cause of\n                    the failure of the Water Inlet Hose. He did not provide a definitive opinion\n                    that the Water Inlet Hose was in fact cut. The plaintiff further submitted that\n                    the Water Inlet Hose was not suitable to carry water because it was made of a\n                    material that would tend to break down when exposed to water. The plaintiff\n                    referred to the expert testimony of Liam and Cooper and SSCP No 48 to support\n                    his submission. The first defendant’s submissions were broadly similar to\n                    the plaintiff’s submissions. 34     The second defendant did not refer to\n                    Cheng’s evidence in its closing submissions. The focus of the second\n                    defendant’s closing submissions was that the Water Inlet Hose was not\n                    installed by the second defendant. This argument is explored below (see[45]–[54]). The finding 35     I accept the opinion of Liam and Cooper that\n                    the Water Inlet Hose ruptured due to hydrolysis. I note that Liam’s\n                    opinion was that another cause of the rupturing of the Water Inlet Hose was the\n                    Helical Line Feature. I accept his opinion that the Helical Line Feature\n                    contributed to the rupturing of the Water Inlet Hose. However, I should add that\n                    I agree with Cooper’s opinion that the Helical Line Feature is not a\n                    defectper se. The Helical Line Feature was an\n                    inherent feature of the Water Inlet Hose. The Helical Line Feature would not\n                    have had any impact on the use of the Water Inlet Hose if it had been used for\n                    its intended purpose of carrying compressed air. Therefore, my finding is that\n                    the Water Inlet Hose ruptured due to a combination of two factors:\n                    (a) hydrolysis; and (b) the Helical Line Feature. 36     I prefer the opinions of Liam and Cooper on\n                    the cause of the failure of the Water Inlet Hose over Cheng’s opinion\n                    because the former’s opinions were well reasoned. Both witnesses referred\n                    to scientific literature to support their opinion that ester-based polyurethane\n                    was prone to degradation by hydrolysis. Indeed, Cheng conceded during\n                    cross-examination that ester-based polyurethane is prone to degradation by\n                    hydrolysis. Liam and Cooper also provided illustrations of the degradation of\n                    the Water Inlet Hose. They produced close-up photographs of the Water Inlet Hose\n                    under strong light. Those photographs showed cracks in the Water Inlet Hose.\n                    They were also able to rebut Cheng’s postulation that the rupture could\n                    have been due to a cut with convincing reasons (see[30]–[32]). In\n                    contrast, I find Cheng’s evidence to be unreliable for two reasons. First,\n                    Cheng was not an expert in the area of failure analysis. Both Liam and Cooper\n                    testified that a person with general engineering experience like Cheng would not\n                    have the expertise to investigate and opine on the reason why the Water Inlet\n                    Hose failed. In fact, Cheng conceded during cross-examination that failure\n                    analysis was not his area of expertise. Second, Cheng did not provide a\n                    conclusive opinion on the cause of the failure of the Water Inlet Hose. Cheng\n                    clarified during cross-examination that he was merely suggesting that a cut was\n                    a possible cause of the failure of the Water Inlet Hose. 37     Turning to the suitability of the Water Inlet\n                    Hose for the carriage of water, I also accept the opinions of Liam and Cooper\n                    that the Water Inlet Hose was not suitable. It was Liam’s undisputed\n                    evidence that the SSCP No 48 provides the industry standard for the types of\n                    hoses that should be used to carry potable water. It was also undisputed that\n                    ester-based polyurethane, the material from which the Water Inlet Hose was made,\n                    is prone to degradation when exposed to water. It follows therefore that the\n                    Water Inlet Hose was unsuitable for the carriage of water on the basis of the\n                    standard prescribed in SSCP No 48. 38     I prefer the opinions of Liam and Cooper on\n                    the suitability of the Water Inlet Hose because, again, their views were well\n                    reasoned. Liam’s testimony, in particular, was useful because of his\n                    reference to an industry standard. Cheng’s report, on the other hand, did\n                    not provide a conclusive opinion on the suitability of the Water Inlet Hose. It\n                    was only in cross-examination that Cheng clarified that the reason for his\n                    reference to Setsco’s test was to show that a hose of the same make as the\n                    Water Inlet Hose could withstand a certain hydrostatic pressure. Setsco’s\n                    test was however ultimately irrelevant because it did not contradict the fact\n                    that ester-based polyurethane is susceptible to hydrolytic\n                degradation.",
        "Were the features which caused the rupturing of the Water Inlet Hose\n                discoverable on a reasonable inspection?": "The evidence 39     In relation to the Helical Line Feature,\n                    Liam’s evidence in his report was that one could discern the defect upon a\n                    close examination under natural light. Liam explained during cross-examination\n                    that a “very, very close examination” was required to see the\n                    Helical Line Feature. The Helical Line Feature would however be clearly visible\n                    if an intense light was shonethroughthe Water\n                    Inlet Hose. 40     As for the hydrolytic degradation,\n                    Liam’s evidence was that those defects would only be visible if a\n                    “very strong light” was shonethroughthe Water Inlet Hose. The degradation would not be\n                    visible even if a light was shone directly on the surface of the Water Inlet\n                    Hose. Cooper’s evidence was also that the hydrolytic degradation would not\n                    be discernible from a visual inspection of the outside surface of the Water\n                    Inlet Hose. 41     Cheng did not specifically address whether the\n                    Helical Line Feature or the hydrolytic degradation was visible on a reasonable\n                    inspection. Cheng only pointed out that the Water Inlet Hose appeared to be\n                    new. 42     None of the witnesses testified on whether\n                    either cause was discoverable on a reasonable inspection. The arguments 43     Only the first defendant submitted on whether\n                    the cause or causes of the rupture were discoverable on a reasonable inspection.\n                    In the course of rebutting the plaintiff’s claims in nuisance and\n                    negligence, the first defendant submitted that it had no reason to believe that\n                    the Water Inlet Hose would rupture because the hydrolytic degradation to the\n                    Water Inlet Hose was not discernible from the outside. The first defendant also\n                    pointed out that the Helical Line Feature was only discernible on a very close\n                    examination. The finding 44     I am of the view that both the Helical Line\n                    Feature and the hydrolytic degradation would not have been discovered on a\n                    reasonable inspection. It was not disputed that the hydrolytic degradation was\n                    not visible from the outside. A high intensity light had to be shonethroughthe Water Inlet Hose in order to see the\n                    hydrolytic degradation. I do not think that it is reasonable to expect either\n                    defendant to have removed the Water Inlet Hose and shone a high intensity light\n                    through it. As for the Helical Line Feature, having seen the photographs of the\n                    Water Inlet Hose and a section of the Water Inlet Hose (in Exhibit D1), I accept\n                    Liam’s evidence that a very close examination would have been required to\n                    notice the Helical Line Feature. A reasonable person in the position of either\n                    of the defendants would not have conducted such a close\n                inspection.",
        "Did the second defendant install the Water Inlet Hose?": "The evidence 45     The second defendant’s Service Director\n                    Goh Chin Siew (“Goh”), testified that the second defendant\n                    reinstalled the WDU at the Second Floor Unit on 2 September 2004. Goh\n                    accepted that the second defendant installedawater inlet hose for the WDU on that day. However, he claimed that the second\n                    defendant did not installtheWater Inlet Hose.\n                    Goh based his claim on an expert report provided by Cooper (“the\n                    Burgoynes Preliminary Examination Report”). Cooper wrote in the Burgoynes\n                    Preliminary Examination Report that the Water Inlet Hose was in “pristine\n                    condition”, which was consistent with it having been installed\n                    “very recently”. I should add that Cooper later clarified that his\n                    opinion in the Burgoynes Preliminary Examination Report “was a\n                    preliminary report based on a visual inspection only” and “did not\n                    involve any detailed analysis”. Cooper subsequently revised his opinion.\n                    His revised opinion was to the effect that even though the Water Inlet Hose\n                    appeared to be in pristine condition, that did not necessarily mean that it was\n                    installed recently. Cooper clarified that it was in fact not possible to\n                    conclusively establish the age of the Water Inlet Hose because it did not have\n                    any markings to indicate its date of manufacture. 46     During cross-examination, Goh added that\n                    another basis for his claim that the Water Inlet Hose was not installed by the\n                    second defendant was that the second defendant always supplied its workers with\n                    the “John Guess” brand of hoses for installation as water inlet\n                    hoses. Goh testified that “John Guess” brand hoses were white in\n                    colour. Kuam Swee Lee (“Kuam”), the second defendant’s\n                    service man who attended to the first defendant after the Water Inlet Hose\n                    ruptured, testified that the ruptured Water Inlet Hose was black in colour.\n                    However, Goh admitted that his workers might have purchased a black hose from a\n                    hardware store to replace a water inlet hose. Unfortunately, the workers who\n                    installed the WDU at the Second Floor Unit were not called to testify. Goh also\n                    admitted that the second defendant was to supply the water inlet hoses for the\n                    WDUs that it installed. He also agreed that he had no reason to believe that\n                    anybody other than the second defendant had serviced the WDU after it was\n                    installed. 47     The first defendant’s managing director,\n                    Adrian Ng (“Ng”), deposed that he could not recall whether the\n                    Water Inlet Hose was installed at the time when the WDU was first installed at\n                    the Second Floor Unit or whether it was installed during the second\n                    defendant’s servicing of the WDU. Ng insisted however that the second\n                    defendant installed the Water Inlet Hose because neither he nor any of the first\n                    defendant’s employees installed the Water Inlet Hose or instructed anyone\n                    else to install the Water Inlet Hose. Ng’s evidence was that the first\n                    defendant entrusted the installation and servicing of the WDU and its piping\n                    works to the second defendant. Two of the first defendant’s employees,\n                    Christin Lim Hoon Eng and Zubaidah Saat, also deposed that they did not install\n                    the Water Inlet Hose, nor did they instruct anyone to install the Water Inlet\n                    Hose. The arguments 48     The plaintiff and the first defendant both\n                    submitted that the second defendant installed the Water Inlet Hose. They based\n                    their submissions on the evidence summarised above at[45]–[47]. 49     The second defendant submitted that the hose\n                    it installed on 2 September 2004 was not the Water Inlet Hose. The second\n                    defendant referred to Liam’s testimony during cross-examination. Liam had\n                    suggested during cross-examination that the hydrolytic degradation observed on\n                    the Water Inlet Hose might have occurred due to contact with water over a period\n                    of several months. The second defendant submitted that it could not possibly\n                    have installed the Water Inlet Hose if Liam’s evidence was accepted. If\n                    the Water Inlet Hose was the hose that the second defendant installed on\n                    2 September 2004, it would have ruptured within several months from its\n                    installation,viz, by September 2005 at the\n                    latest. The second defendant further argued that Cooper’s evidence was\n                    consistent with Liam’s evidence because Cooper did not have any\n                    fundamental disagreements with Liam’s evidence The second defendant also\n                    referred to Cooper’s opinion in the Burgoynes Preliminary Examination\n                    Report. The second defendant pointed out that Cooper’s revised opinion\n                    that the Water Inlet Hose need not have been installed recently was based on the\n                    assumption that the Water Inlet Hose was installed in a “relatively clean\n                    environment”. The second defendant asserted that Cooper was not in a\n                    position to give an opinion as to the state of the first defendant’s\n                    premises because he did not inspect those premises. 50     The plaintiff and the first defendant took\n                    issue with the second defendant’s reliance on Liam’s testimony\n                    during cross-examination. 51     The plaintiff argued that the second defendant\n                    should have adduced expert evidence on the age of the Water Inlet Hose if its\n                    case was that hydrolysis took only months. However, the second defendant did not\n                    put forth any expert evidence on this point. It did not also put its case to\n                    Liam that the Water Inlet Hose could not have been the one that it installed on\n                    2 September 2004. The plaintiff submitted that the second defendant’s\n                    belated reliance on this point should therefore be rejected. 52     The first defendant pointed out that Liam\n                    qualified his suggestion that the Water Inlet Hose had degraded over a matter of\n                    months by saying that he could not put a figure to the duration of its exposure\n                    to water because the speed with which a hose would degrade depends on various\n                    factors such as its material composition. The finding 53     In my view, the evidence that suggests that\n                    the Water Inlet Hose must have been the hose that the second defendant installed\n                    on 2 September 2004 outweighs the evidence that suggests the contrary. The\n                    second defendant admitted that it installed a water inlet hose on\n                    2 September 2004. It also admitted that it had no reason to believe that\n                    the WDU was maintained by anybody other than itself. In fact, it was theunchallengedevidence of both Ng and the first\n                    defendant’s other employees that they neither installed the Water Inlet\n                    Hose by themselves nor did they instruct anyone else to install it. The only\n                    evidence that suggests that the second defendant did not install the Water Inlet\n                    Hose is the Burgoynes Preliminary Examination Report and Liam’s suggestion\n                    that the Water Inlet Hose degraded over a period of several months. I do not\n                    give much weight to either for the following reasons: (a)     Cooper did not conclude in the\n                        Burgoynes Preliminary Examination Report that the Water Inlet Hose was in\n                        fact new. He was merely pointing out that the pristine condition of the\n                        Water Inlet Hose he visually examinedsuggestedit was new. This was apparent from the following\n                        extract of the Burgoynes Preliminary Examination Report: The [Water Inlet Hose] is in pristine condition with only minimal wear and\n                        abrasion present on the outer surfaces. The general condition of the [Water\n                        Inlet Hose]suggeststhat it is nearly new,\n                        which is consistent with it having been fitted to the [WDU] very recently.\n                        The condition is not consistent with the reported age of the water cooler,\n                        i.e. 4 years. [emphasis added] Cooper was simply making the obvious point that the pristine condition of\n                        the Water Inlet Hose suggested it was nearly new. He was not expressing his\n                        expert view as to the precise age of the Water Inlet Hose. Indeed,\n                        Cooper’s evidence was that he could not conclusively establish the age\n                        of the Water Inlet Hose because of the absence of any markings on the Water\n                        Inlet Hose. Accordingly, the “nearly new” physical appearance\n                        of the Water Inlet Hose is merely one piece of evidence that I have to take\n                        into account. The physical appearance of the Water Inlet Hose should not be\n                        given too much weight because its pristine appearance may be due to reasons\n                        other than its age. As Cooper suggested in his expert report, a hose may\n                        appear new notwithstanding its age if it is kept in a relatively clean\n                        environment and protected from wear and tear. (b)     The second defendant took\n                        Liam’s suggestion out of context. As the first defendant pointed out,\n                        Liam was not providing a firm view that the Water Inlet Hose degraded over a\n                        period of months. The following extract from the notes of evidence (N/E 243)\n                        shows that Liam had in fact emphasised that he could not provide the court\n                        with a definitive figure for the length of degradation: Q:When you say “prolonged\n                                            contact”, how long would this be? Would this be\n                                            one day, one week, roughly?A:It’s unlikely to be one day or one\n                                            week, it’s going to take more than that.But it’s not possible to put a\n                                                timeline actually on how long it would\n                                                take.COURT:A number of years, isn’t it, Mr\n                                            Liam?A:Yes, your Honour.COURT:When you said prolonged, you are talking\n                                            in terms of years?A:Not -- maybe in terms of, maybe months,\n                                            weeks or months.COURT:Months?A:Yes, but we -- becauseit is very dependent on the material, the\n                                                material composition, the material make and all\n                                                that.So we cannot\n                                                put a figure to\n                                    that.[emphasis added in bold\n                                        italics]   54     I therefore find on a balance of probabilities\n                    that the second defendant did install the Water Inlet Hose.",
        "The decision": "",
        "The plaintiff’s claims against the first and second\n                defendants": "55     I will consider the plaintiff’s claims\n                    against the first and second defendants together because the legal issues in\n                    both claims are similar. The nuisance claims (1)   The law 56     The relevant principles are not disputed and\n                    may be concisely stated. The essence of an actionable private nuisance is the\n                    “causing or permitting of a state of affairs” which interferes\n                    with the ownership or occupation of land (seeOTF Aquarium\n                        Farm (formerly known as Ong’s Tropical Fish Aquarium & Fresh\n                        Flowers) (a firm) v Lian Shing Construction Co Pte Ltd (Liberty Insurance\n                        Pte Ltd, Third Party)[2007] SGHC 122\n                        (“OTF Aquarium Farm”) at\n                        [23] andClerk\n                        and Lindsell on Torts(Sweet & Maxwell,\n                        20thEd, 2010) (“Clerk\n                        and Lindsell”) at para 20-01). The interference does\n                    not have to be persistent in order for it to be regarded as an actionable\n                    private nuisance. A single interference, such as the seepage of water in the\n                    present case, may be actionable provided that the “state of\n                    affairs” at the property from which the interference emanated was\n                    potentially hazardous (seeHygeian Medical Supplies Pte Ltd v\n                        Tri-Star Rotary Screen Engraving Works Pte Ltd (Seng Wing Engineering Works\n                        Pte Ltd, third party)[1993] 2 SLR(R) 411\n                        (“Hygeian Medical Supplies”) at\n                        [22]–[23];Clerk and\n                        Lindsellat para 20-16). 57     It is pertinent to note that the owner or\n                    occupier of the land from which the interference emanates is not the only person\n                    who may be liable for the nuisance. A third party, such as the second defendant\n                    in this case, may also be liable if it caused the interference (seeClerk and Lindsellat para 20-70). 58     The only other element that I should mention\n                    is the requirement that the type of damage caused by the nuisance must be\n                    reasonably foreseeable (seeOTF Aquarium Farmat\n                        [23]–[27]). This element is particularly relevant\n                    in this case because of the presence of an independent contractor (iethe second defendant). An owner or occupier of the\n                    land from which the nuisance emanated might argue that the nuisance was created\n                    by an independent contractor and it should therefore not be held liable for the\n                    nuisance. However, it is not sufficient for an owner or occupier to simply\n                    assert that an independent contractor caused the interference. An owner or\n                    occupier may nonetheless be liable for the nuisance in such circumstances if it\n                    could have reasonably foreseen that a nuisance might result from the work done\n                    by the independent contractor (seeClerk and\n                        Lindsellat para 20-72). (2)   The decision 59     I find that the seepage of water from the\n                    Second Floor Unit constituted an interference with the plaintiff’s use of\n                    the Art Gallery. As I mentioned earlier, a single interference may amount to a\n                    nuisance if the state of affairs at the land from which the interference\n                    emanated was potentially hazardous (see[56]). In my view, the placement of the WDU at the WDU Area and the\n                    use of the Water Inlet Hose was a potentially hazardous state of affairs. It was\n                    not disputed that water could permeate through the floor at the WDU Area.\n                    Therefore, the placement of the WDU at the WDU Area was potentially hazardous\n                    because any leakage from the WDU or the Water Inlet Hose could result in seepage\n                    of water. As for the use of the Water Inlet Hose, I have found that the Water\n                    Inlet Hose ruptured due to a combination of the hydrolytic degradation and the\n                    Helical Line Feature (see[35]). The\n                    hydrolytic degradation occurred because the Water Inlet Hose was made of a\n                    material that was unsuitable for the carriage of water (see [24(c)] and\n                    [26(b)]). Given those circumstances, the use of the Water Inlet Hose with the\n                    WDU was a potential hazard. Put simply, the rupturing of the Water Inlet Hose\n                    was an accident waiting to happen. 60     Both defendants are liable for the\n                    interference. As alluded to in the previous paragraph, the interference was\n                    caused by a combination of three causes. The first two causes were the\n                    hydrolytic degradation and the Helical Line Feature. I had found that the Water\n                    Inlet Hose ruptured due to hydrolytic degradation and the Helical Line Feature\n                    (see[35]). The third cause was the location\n                    of the WDU at the WDU Area because the flooring of the WDU Area was such that\n                    water could permeate through it. The first defendant is however responsible for\n                    only the third cause because it instructed the second defendant to locate the\n                    WDU at the WDU Area. It is not responsible for the first two causes because the\n                    Helical Line Feature and the hydrolytic degradation were not visible on a\n                    reasonable inspection (see[44]). 61     The second defendant is responsible for the\n                    first two causes because, as I have found, the second defendant installed the\n                    Water Inlet Hose (see[54]). The second\n                    defendant is also partially responsible for the third cause because it installed\n                    the WDU at the WDU Area. 62     It remains to be considered whether either\n                    defendant could have reasonably foreseen the nuisance. In my view, the nuisance\n                    was reasonably foreseeable to both defendants. The first defendant submitted\n                    that it could not have foreseen the nuisance because it engaged an independent\n                    contractor to install and maintain the WDU. However, I find that a reasonable\n                    person in the position of the first defendant would have foreseen the nuisance.\n                    A reasonable person would have known that locating a WDU at the WDU Area could\n                    result in seepage of water to the Art Gallery because of the nature of the\n                    flooring at the WDU Area. A reasonable person would have also taken heed of the\n                    Quotation Warning in the quotation for the reinstallation of the WDU at the\n                    Second Floor Unit (see[5]) and the\n                    Disclaimer in the Second Maintenance Contract and the Third Maintenance Contract\n                    (see[9]). Those warnings indicated that it\n                    was not safe to locate a WDU at the WDU Area. I note that the first\n                    defendant’s employees had testified that they did not notice the warnings.\n                    However, the analysis is objective. In my view, a reasonable person should have\n                    taken heed of the warnings and would have realised that directing an independent\n                    contractor to install a WDU at the WDU Area might result in the nuisance. A\n                    reasonable person in the position of the second defendant would have also\n                    foreseen the possibility of the nuisance for the same reason. The Quotation\n                    Warning and the Disclaimer were found on the second defendant’s own\n                    documents. A reasonable person would have taken heed of his own\n                warnings. 63     I therefore find both the first and second\n                    defendants liable to the plaintiff in the tort of private\n                nuisance. The negligence claims 64     It is not strictly necessary to go on to\n                    consider the plaintiff’s claims in negligence and the rule inRylands v Fletchergiven this court’s conclusion\n                    that both defendants are liable for nuisance. I will nevertheless briefly\n                    consider the claims in negligence for completeness. (1)   The relevant principles 65     As mentioned above (see [21(a)] and [21(d)]),\n                    the defendants had only contested the existence of a duty of care and the breach\n                    of that duty. 66     The Court of Appeal inSpandeck Engineering (S) Pte Ltd v Defence Science & Technology\n                        Agency[2007] 4 SLR(R) 100 (“Spandeck”) restated the test that Singapore\n                    courts should apply in determining whether a duty of care exists. A two stage\n                    test should be applied along with a threshold consideration of factual\n                    foreseeability (Spandeckat[73]). The first stage requires the court to\n                    determine if there is sufficient legal proximity between the parties (Spandeckat [77]). The Court of Appeal endorsed Deane J’s analysis of the\n                    concept of proximity inSutherland Shire Council v\n                        Heyman(1985) 60 ALR 1 (“Sutherland”) at 55–56 (seeSpandeckat [78]–[79] and\n                        [81]). Deane J’s analysis\n                    was as follows (Sutherlandat 55–56): The requirement of proximity is directedto the\n                            relationship between the partiesin so far as it is relevant\n                        to the allegedly negligent act or omission of the defendant and the loss or\n                        injury sustained by the plaintiff. It involvesthe notion\n                            of nearness or closeness and embraces physicalproximity (in\n                        the sense of space and time) between the person or property of the plaintiff\n                        and the person or property of the defendant,circumstantialproximity such as an overriding relationship\n                        of employer and employee or of a professional man and his client and what\n                        may (perhaps loosely) be referred to ascausalproximity in the sense of the closeness or directness of the causal\n                        connection or relationship between the particular act or course of conduct\n                        and the loss or injury sustained. It may reflect anassumption by one party of a responsibilityto take care to\n                        avoid or prevent injury, loss or damage to the person or property of another\n                        orrelianceby one party upon such care being\n                        taken by the other in circumstances where the other party knew or ought to\n                        have known of that reliance.Both the identity and the\n                            relative importance of the factors which are determinative of an issue\n                            of proximity are likely to vary in different categories of\n                            case. That does not mean that there is scope for decision by\n                        reference to idiosyncratic notions of justice or morality or that it is a\n                        proper approach to treat the requirement of proximity as aquestion of fact to be resolved merely by reference to the\n                            relationship between the plaintiff and the defendant in the particular\n                            circumstances. The requirement of a relationship of proximityserves as a touchstone and control of the categories\n                            of case in which the common law will adjudge that a duty of care is\n                            owed. Given the general circumstances of a case in a new or\n                        developing area of the law of negligence, the question what (if any)\n                        combination or combinations of factors will satisfy the requirement of\n                        proximity is aquestion of law to be resolved by the\n                            processes of legal reasoning, induction and deduction. On the other\n                            hand, the identification of the content of that requirement in such an\n                            area should not be either ostensibly or actually divorced from notions\n                            of what is 'fair and reasonable' ... or from the considerations of\n                            public policy which underlie and enlighten the existence and content of\n                            the requirement. [emphasis in original in italics] The second stage requires the court to determine if a duty should not\n                    be imposed because of policy considerations (Spandeckat [83]). Both\n                    stages of the test should be applied incrementally. This means that the courts\n                    should refer to previous cases with analogous facts and consider whether a duty\n                    of care should be extended (Spandeckat [73] and [115]). (2)   The decision 67     In my view, the first defendant owed the\n                    plaintiff a duty of care. The threshold requirement of factual foreseeability is\n                    satisfied. I held earlier that both defendants could have reasonably foreseen\n                    the nuisance (see[62]). The same analysis\n                    applies here. The first defendant could have reasonably foreseen that its\n                    instruction to the second defendant to locate the WDU at the WDU Area could\n                    cause damage to the plaintiff’s property. Turning to the requirement of\n                    proximity, my view is that there was sufficient proximity between the plaintiff\n                    and the first defendant. There is physical proximity between them because they\n                    were neighbours. It was also reasonable for the plaintiff to rely on the first\n                    defendant to take reasonable measures to avoid the seepage of water. The first\n                    defendant should have known that the plaintiff would rely on it to take such\n                    measures given the close physical proximity between the units and the fact that\n                    the flooring at the WDU Area was permeable to water. 68     There is in fact recent authority for finding\n                    a duty of care between neighbours in such circumstances. The recent case ofPC Connect Pte Ltd v HSBC Institutional Trust Services\n                        (Singapore) Ltd (trustee of CapitaMall Trust) and another (Bachmann Japanese\n                        Restaurant Pte Ltd, third party)[2010] SGHC 154\n                        (“PC Connect”), concerned a\n                    claim by an occupier of a unit in a shopping mall (“Unit A”)\n                    against the occupier of a unit above Unit A (“Unit B”) for damage\n                    due to water seepage. The High Court held that the occupier of Unit B owed a\n                    duty of care to the occupier of Unit A (PC Connectat [31]). A duty of care relationship\n                    was also found to exist between neighbours inHygeian Medical\n                        Supplies(at [18]). The\n                    facts ofHygeian Medical Supplieswere also\n                    analogous to the present case. Water from one unit flooded into another unit\n                    because of a dislodged water hose. As for the second stage of theSpandecktest, I do not find that there are any relevant\n                    public policy considerations that militate against the finding of a duty of\n                    care. 69     It is also my view that the first defendant\n                    breached its duty of care by instructing the second defendant to install the WDU\n                    at the WDU Area. I accept that the first defendant may well have thought it had\n                    no alternative but to install the WDU at the WDU Area. During cross-examination,\n                    Ng mentioned, for the first time, that he had three reasons for not locating the\n                    WDU in the wet pantry area. First, the wet pantry area was exposed to direct\n                    sunlight and accordingly, locating the WDU at the wet pantry area might shorten\n                    its lifespan. Second, the door leading to the wet pantry area opened into the\n                    wet pantry area. The door would have obstructed access to the WDU if the WDU was\n                    located in the wet pantry area. Third, Ng did not think it was safe for his\n                    employees’ health to locate the WDU at the wet pantry area because the\n                    first defendant used that area to spray adhesives onto presentation boards. I do\n                    not think that any of these concerns were very substantial because Ng admitted\n                    that the first defendant installed the WDU at the wet pantry area after the\n                    incident. He also conceded that if he had given the location of the WDU more\n                    thought, he would not have installed it at the WDU Area. In any case, in my\n                    view, a reasonable person would have taken precautions against the leakage of\n                    water. The WDU Area was permeable to water. The first defendant was warned that\n                    the WDU should be installed at a wet pantry area (see[5]and[9]). It does not\n                    matter that the first defendant did not read those warnings. A reasonable person\n                    would have read them. If the wet pantry area was really not an option, the first\n                    defendant should not have installed the WDU at all. 70     It should be noted that the plaintiff had\n                    called an expert witness Wan Fook Kong (“Wan”) to testify on\n                    whether it was appropriate to locate the WDU at the WDU Area. Wan’s\n                    evidence was that it was not in accordance with good housekeeping practices to\n                    locate the WDU at the WDU Area. His evidence was largely unchallenged and the\n                    defendants did not call their own experts to testify on whether the WDU Area was\n                    a suitable area for locating the WDU. However, Wan did not refer to any\n                    objective standards to justify his opinion. In any event, as I have explained,\n                    my view is that a reasonable person would not have installed the WDU at a wet\n                    pantry area. 71     It is not a valid defence for the first\n                    defendant to contend that it is not liable because of its engagement of an\n                    independent contractor. It is well established that engaging an independent\n                    contractor does not excuse an employer for hisownacts of negligence (seeClerk and Lindsellat\n                    para 6-56). Here, the first defendant went beyond simply engaging an\n                    independent contractor. It instructed the independent contractor to install the\n                    WDU at the WDU Area. In my view, that act, by itself, amounts to\n                    negligence. 72     Therefore, my view is that the first defendant\n                    is also liable to the plaintiff in the tort of negligence. 73     I am not entirely satisfied that the second\n                    defendant owed the plaintiff a duty of care. The plaintiff only referred toSpandeckin its closing submissions in support\n                    of its case against the second defendant in negligence. It did not refer to any\n                    cases where a duty of care was imposed in analogous fact situations. However, in\n                    its opening statement, the plaintiff referred toFisher v\n                        Harrods Ltd[1966] 1 QB 500 (“Fisher”) in support of its argument that the second\n                    defendant owed it a duty of care. That case concerned a claim in negligence\n                    against a department store for its sale of a bottle of jewellery cleaning fluid\n                    to the plaintiff. Various allegations were made in relation to the failure to\n                    warn the plaintiff about,inter alia, the chemical\n                    contents of the jewellery cleaning fluid and the manner in which the bottle\n                    should be opened (Fisherat 501–502). I do\n                    not see how that case is analogous to the present case. Although the novelty of\n                    a fact situation does not preclude the imposition of a duty of care (Spandeckat [73]\n                    and [115]), in my view, it is important to tread cautiously in such situations.\n                    In the absence of any detailed argument, I make no finding as to whether the\n                    second defendant owed the plaintiff a duty of care. The claim under the rule in Rylands v Fletcher (1)   The relevant principles 74     The rule inRylands v\n                        Fletcherallows a party to claim for damage caused by the escape\n                    of dangerous things brought onto the defendant’s land where the bringing\n                    of those dangerous things constituted a non-natural use of the defendant’s\n                    land (Clerk and Lindsellat para 20-44). The\n                    rule has been applied in Singapore (see, for example,Tesa\n                        Tape Asia Pacific Pte Ltd v Wing Seng Logistics Pte Ltd[2006]\n                    3 SLR(R) 116 (“Tesa\n                    Tape”)). (2)   The decision 75     The first defendant’s argument was that\n                    the bringing of the WDU into its premises was not a non-natural use of the\n                    Second Floor Unit. The first defendant relied onTransco plc\n                        v Stockport Metropolitan Borough Council[2004] 2 AC 1\n                        (“Transco”). InTransco, a water pipe supplying water to a block of\n                    flats ruptured. The resulting flood caused an embankment to give way and exposed\n                    a gas pipe belonging to the plaintiff. The plaintiff then brought a claim\n                    against the owner of the water pipe for its costs in restoring the support to\n                    the gas pipe. The House of Lords held that the piping of water to water storage\n                    tanks in a block of flats was a normal use of land (Transcoat [13],\n                        [49], [67], [90] and [111]).\n                    Relying on this statement, the first defendant argued that if a supply of water\n                    is considered a natural use of land, then the distribution of water within the\n                    premises woulda fortioriconstitute a natural\n                    use. 76     I disagree. In my view, it is necessary to\n                    consider the circumstances under which the dangerous thing was brought onto the\n                    defendant’s land. This is apparent fromBalfour v\n                        Barty-King and another[1956] 1 WLR 779\n                        (“Balfour”), a case cited by the\n                    plaintiff. InBalfour, the defendants hired\n                    contractors to thaw frozen pipes in their attic. The contractors used a\n                    blowtorch to thaw the pipes. The blowtorch ignited some straw and caused a fire\n                    which damaged the plaintiff’s premises. The following portion of the\n                    decision is useful (Balfourat 791): It appears that the user of a blowlamp for the purpose of thawing out a\n                        pipeis a recognized method of thawing out a pipe in an\n                            appropriate place and appropriate circumstances, but in other places it\n                            is not only not a recognized practice, but it is an extremely dangerous\n                            practice, and one which no prudent workman or contractor would have\n                            adopted.I have to have regard to all the\n                            circumstances of time and place and the practice of the trade, and,\n                            applying that test, I feel constrained to come to the conclusion that\n                            the user of the blowlamp in these particular circumstances in this loft,\n                            so close to all this combustible material, did constitute the blowlamp\n                            an object of the class to which the rule in Rylands v. Fletcher\n                            applies. I hold, therefore, in so far as it is a question of\n                        law for me, that the user of the blowlamp in this place by Brown under these\n                        circumstances was dangerous, and that it was likely to do mischief if the\n                        dangerous element in it, that is to say, the fire, escaped. I also hold, if\n                        it is a necessary requisite for the application of the rule inRylands v. Fletcherto this case, that to bring the\n                        blowlamp to this position in which it was ignited and used was to make a\n                        non-natural user of that place. It was a special user, bringing with it\n                        increased danger to others, and was not merely the ordinary user of the\n                        land. I hold, therefore, that the blowlamp was, in the circumstances, an\n                        object of the class to which the rule inRylands v.\n                            Fletcherapplies. [emphasis added] It is crucial to note that the court held that even though the use of\n                    a blowlamp was a recognised method of thawing pipes in appropriate\n                    circumstances, it was dangerous to use it in the particular circumstances of the\n                    case. I take a similar view. Although the use of a WDU, when viewed in the\n                    abstract, appears to be a natural use of land, it was not a natural use in the\n                    particular circumstances of this case. The placement of the WDU at the WDU Area,\n                    when combined with the Helical Line Feature and the gradual hydrolytic\n                    degradation of the Water Inlet Hose, made the use ofthisWDU a non-natural use of the Second Floor\n                Unit. 77     My view therefore is that the first defendant\n                    is liable to the plaintiff under the rule inRylands v\n                        Fletcher. Should there be one judgment against the defendants or should there\n                be apportionment of liability between the defendants? (1)   The relevant principles 78     The Court of Appeal inChuang Uming (Pte) Ltd v Setron Ltd and another appeal[1999]\n                    3 SLR(R) 771 (“Chuang\n                    Uming”) decided that a separate judgment should only be issued\n                    if the damage suffered by the plaintiff is capable of being isolated and\n                    attributed to the particular acts of each defendant (at [51]): In cases, such as this, where the damage or injury was occasioned by more\n                        than one party, the question whether there should be a joint judgment or\n                        separate judgments depends essentially on the facts and in particular on the\n                        damage caused.Where the damage caused can be so\n                            identified and isolated as to be attributable to the negligent act or\n                            the breach of contract of each party, then a separate judgment in\n                            respect of that damage can be entered against each of the parties.\n                            Where, however, the damage caused by the parties cannot be so identified\n                            and isolated, and in reality forms indivisible parts of the entire\n                            damage, we do not see how separate judgments can be entered against them\n                            separately. Reverting to the facts in this case, clearly both\n                        the defective workmanship and the defective design contributed to the\n                        debonding of the tiles. We are in agreement with the learned judge that the\n                        breaches of the contractors and the architects \"indisputably overlap and\n                        interweave\" and both contributed to the same damage. In such a case, a joint\n                        judgment is the natural result as there is no reason, in principle, to limit\n                        the owner to recovering only part of the loss from one party and the\n                        remaining part from the other. The apportionment of the liability between\n                        the contractors and the architects in percentage terms is not a logical\n                        corollary of the separate breaches of contract, but a device to ensure that\n                        justice is done as between the contractors and the architectsinter se. [emphasis added] 79     A related issue is the apportionment of\n                    liability between the tortfeasorsinter se. In\n                    this regard, the Court of Appeal inChuang Umingheld, in the context of apportioning liability between parties who breached\n                    their respective contracts, that the court should apportion liability in a\n                    manner that is just and equitable (Chuang Umingat\n                        [43]). The court should consider the\n                    relative blameworthiness of each defendant in determining a just and equitable\n                    apportionment of liability (Chuang Umingat\n                        [43]–[44]). (2)   The decision 80     I find that the plaintiff is entitled to a\n                    joint judgment against both the first defendant and the second defendant. I am\n                    unable to attribute the acts of either defendant to distinct portions of the\n                    damage suffered by the plaintiff. As I held earlier (see[35]), the plaintiff’s damage was caused by\n                    acombinationof three causes,viz, the Helical Line Feature, hydrolytic degradation and the\n                    location of the WDU at the WDU Area. It is not possible to say that each cause\n                    resulted in a specific kind of damage. 81     As for apportionment of liability between the\n                    defendantsinter se, I find that a just and\n                    equitable apportionment is 30% liability to the first defendant and 70%\n                    liability to the second defendant. As earlier held (see[60]), the first defendant is only responsible for one cause of\n                    the damage. It instructed the second defendant to install the WDU at the WDU\n                    Area. However, the first defendant was not entirely to blame for this cause. The\n                    second defendant was also responsible for the location of the WDU at the WDU\n                    Area. The second defendant did not take heed of its own warnings (ie, the Quotation Warning and the Disclaimer – see[5]and[9]respectively) which indicated that the WDU should be\n                    installed in the WDU Area. The second defendant is also solely responsible for\n                    the other two causes because it installed the Water Inlet Hose (see[61]). The second defendant used a hose that was\n                    not suitable for the carriage of water (see [24(c)] and [26(b)]). Given the\n                    relative contributions of the defendants to the causes of the damage, I find\n                    that a just and equitable apportionment is 30-70 in favour of the first and\n                    second defendants.",
        "The indemnity or contribution proceedings between the first defendant\n                and the second defendant": "82     I turn next to consider if the first defendant\n                    is entitled to a contribution or indemnity from the second defendant because of\n                    my finding that the first defendant is liable to the plaintiff for nuisance.\n                    This issue is relevant because I have apportioned 30% of the defendants’\n                    liability to the plaintiff to the first defendant. If the first defendant is\n                    entitled to an indemnity, then, as between the first and the second defendants,\n                    the first defendant will be entitled to an indemnity for any amount that the\n                    plaintiff recovers from the first defendant. 83     I have to consider two issues: (a)     Did the second defendant breach the\n                        Reinstallation Agreement and/or the Maintenance\n                    Contracts? (b)     If so,\n                        do the Quotation Warning and/or the Disclaimer exempt the second defendant\n                        from liability? Did the second defendant breach the Reinstallation Agreement and/or\n                the Maintenance Contracts? (1)   Did the second defendant breach the Reinstallation\n                Agreement? 84     The Reinstallation Agreement was formed after\n                    the first defendant accepted the Quotation. The Quotation did not contain any\n                    express terms warranting the quality and fitness of the Water Inlet Hose. The\n                    first defendant argued, however, that the Supply of Goods Act (Cap 394, 1999 Rev\n                    Ed) (“the SGA”) is applicable. The first defendant then argued\n                    that the second defendant breached the implied terms imposed under s 4 of the\n                    SGA specifically that the Water Inlet Hose would be of satisfactory quality and\n                    fit for its intended purpose of carrying water. 85     The second defendant did not respond to this\n                    argument. The second defendant merely maintained that it did not agree to\n                    install the Water Inlet Hose because it did not in fact install that hose. This\n                    argument is unsustainable given my finding that the second defendant installed\n                    the Water Inlet Hose (see[54]). It is\n                    nevertheless necessary for me to consider if the SGA applied to the\n                    Reinstallation Agreement and, if so, whether the terms implied by the SGA were\n                    breached. (A)   does the SGA apply to the reinstallation\n                agreement? 86     The implied terms in s 4 of the SGA apply to\n                    “contracts for the transfer of goods”. Section 1 of the SGA\n                    defines that term in the following manner: The contracts concerned 1. —(1) In this Act, “contract for the transfer of\n                        goods” means a contract under which one person transfers or agrees to\n                        transfer to another the property in goods, other than an excepted\n                        contract. (2) For the purposes of this section, an excepted contract\n                        means any of the following: (a) a contract of sale of goods; (b) a hire-purchase agreement; (c) a transfer or agreement to transfer which is made by deed and for\n                            which there is no consideration other than the presumed consideration\n                            imported by the deed; or (d) a contract intended to operate by way of mortgage, pledge, charge\n                            or other security. (3) For the purposes of this Act, a contract is a contract for the\n                        transfer of goodswhether or not services are also\n                            provided or to be provided under the contract, and, subject\n                        to subsection (2), whatever is the nature of the consideration for the\n                        transfer or agreement to transfer. [emphasis added] It is important to note that a contract will be regarded as a contract\n                    for the transfer of goods even if it contemplates that services will be provided\n                    under the contract (s 1(3) of the SGA). 87     I am of the view that the SGA applies to the\n                    Reinstallation Agreement. The essence of the Reinstallation Agreement was for\n                    the second defendant to relocate the WDU. This involved the provision of\n                    services. However, the Reinstallation Agreement also contemplated the supply of\n                    additional piping. This is evident from the following description of the work to\n                    be done by the second defendant in the Quotation: TO RELOCATE 1 x W/DSP (WITHIN 3M WITH PIPING & WIRING READY) ADDITION 3M PIPING& 4M WIRING @\n                        $20.00/M TO INSTALL 1 x STOP COCK TO INSTALL 1 x 15AMP PLUG + LABOUR [emphasis added] The emphasised words show that the Reinstallation Agreement\n                    contemplated the supply of piping. I have found that the second defendant in\n                    fact supplied the Water Inlet Hose when it reinstalled the WDU to the Second\n                    Floor Unit. The fact that the Reinstallation Agreement also involved the\n                    provision of services does not detract from it being a contract for the transfer\n                    of goods within the meaning of the SGA. As I have mentioned, s 1(3) of the SGA\n                    provides that a contract will be regarded as a contract for the transfer of\n                    goods even if it contemplates that services will be provided under the contract\n                    (see [86]). (B)   Did the second defendant breach the terms implied by the\n                SGA 88     Section 4 of the SGA implies two conditions\n                    into contracts for the transfer of goods. First, s 4(2) implies that the goods\n                    supplied under the contract are of “satisfactory quality”. Section\n                    4(2A) provides for an objective test for determining whether the goods are of\n                    satisfactory quality: (2A) For the purposes of this section and section 5, goods are of\n                        satisfactory quality if they meet the standard that a reasonable person\n                        would regard as satisfactory, taking account of any description of the\n                        goods, the price (if relevant) and all the other relevant\n                        circumstances. Section 4(3) of the SGA provides that the implied condition of\n                    satisfactory quality does not apply in some situations. None of those situations\n                    are relevant in the present case. The second implied condition is that the goods\n                    supplied under the contract are reasonably fit for any particular purpose that\n                    was made known to the transferee, whether expressly or by implication (ss 4(4)\n                    and 4(5) of the SGA). 89     I find that the second defendant breached both\n                    implied conditions. The Water Inlet Hose that it supplied was not of\n                    satisfactory quality because a reasonable person would consider that a hose\n                    meant to carry water should not be made of a material prone to hydrolytic\n                    degradation. The second implied condition was breached for the same reason. The\n                    implied purpose of the Water Inlet Hose must be that it was to carry water. The\n                    Water Inlet Hose was not reasonably fit for that purpose on any view given my\n                    finding that it was made of a material prone to hydrolytic\n                degradation. (2)   Did the second defendant breach the Maintenance\n                Agreements? 90     It is not necessary for me to consider if the\n                    second defendant breached the Maintenance Agreements in view of my finding that\n                    the second defendant breached the Reinstallation Agreement. Do the Quotation Warning and/or the Disclaimer exempt the second\n                defendant? 91     It is only necessary to consider if the\n                    Quotation Warning exempts the second defendant given my finding that the second\n                    defendant breached the Reinstallation Agreement. (1)   The relevant principles 92     The principles governing the interpretation of\n                    exemption clauses are well established. I only need to refer to two principles.\n                    First, the exemption clause must specifically cover the contingency or loss for\n                    which exemption is sought (seeChitty on Contracts(Sweet & Maxwell, 30thEd, 2008)\n                        (“Chitty on Contracts”) at\n                    para 14-006). Second, the exemption clause will be construedcontra proferentem(seeChitty on\n                        Contractsat para 14-009). 93     The Unfair Contract Terms Act (Cap 396, 1994\n                    Rev Ed) (“the UCTA”) is relevant. In particular, s 7(2) of the\n                    UCTA provides,inter alia, that liability in\n                    respect of the quality of goods or their fitness for any particular purpose\n                    cannot be excluded as against a person dealing as a consumer: Miscellaneous contracts under which goods pass. 7. —(1) Where the possession or ownership of goods passes under or\n                        in pursuance of a contract not governed by the law of sale of goods or\n                        hire-purchase, subsections (2) to (4) apply as regards the effect (if any)\n                        to be given to contract terms excluding or restricting liability for breach\n                        of obligation arising by implication of law from the nature of the\n                        contract. (2) As against a person dealing as consumer, liability in respect of the\n                        goods’ correspondence with description or sample, or their quality or\n                        fitness for any particular purpose, cannot be excluded or restricted by\n                        reference to any such term. … 94     Section 12 of the UCTA provides guidelines for\n                    determining whether a contracting party was dealing as a consumer: Dealing as consumer. 12. —(1) A party to a contract “deals as consumer” in\n                        relation to another party if — (a) he neither makes the contract in the course of a business nor holds\n                        himself out as doing so; (b) the other party does make the contract in the course of a business;\n                        and (c) in the case of a contract governed by the law of sale of goods or\n                        hire-purchase, or by section 7, the goods passing under or in pursuance of\n                        the contract are of a type ordinarily supplied for private use or\n                        consumption. (2) But on a sale by auction or by competitive tender the buyer is not in\n                        any circumstances to be regarded as dealing as consumer. (3) Subject to this, it is for those claiming that a party does not deal\n                        as consumer to show that he does not. (2)   The decision 95     I find that the Quotation Warning does not\n                    exempt the second defendant from its liability for installing the Water Inlet\n                    Hose. The Quotation Warning only excludes liability for “damages\n                        [sic] resulting from the [sic] leaking or flooding from the filer [sic] or water dispenser”. It does not specifically cover\n                    any liability for damage resulting from leakage from the Water Inlet Hose. It\n                    does not also specifically exempt the second defendant from what the first\n                    defendant is claiming against the second defendant. The first defendant is\n                    claiming for an indemnity in respect of its liability to a third party. The\n                    Quotation Warning only contemplates physical damage. 96     In any event, the Quotation Warning cannot\n                    exclude liability for the quality of the Water Inlet Hose and its fitness for\n                    the particular purpose for which it was supplied (see s 7(2) of the UCTA). As\n                    the first defendant has argued, it was dealing as a consumer in relation to the\n                    Reinstallation Agreement.",
        "Conclusion": "97     For the reasons given above, the plaintiff\n                    succeeds in his claim against the first and second defendant. The plaintiff will\n                    have interlocutory judgment against both defendants. The liability of the\n                    defendantsinter seis apportioned at 30%\n                    liability to the first defendant and 70% liability to the second defendant.\n                    However, the first defendant is entitled to an indemnity from the second\n                    defendant in respect of its 30% liability (when quantified) as well as its\n                    liability for costs because of the second defendant’s breach of the\n                    Reinstallation Agreement. Damages for the plaintiff’s claim will be\n                    assessed by the Registrar with the costs of such assessment reserved to the\n                    Registrar.",
        "Costs": "98     As the plaintiff has succeeded in his action\n                    against both defendants, he is entitled to costs for the proceedings. The\n                    liability of the defendantsinter sefor the\n                    plaintiff’s costs (when taxed or otherwise agreed) will mirror their\n                    liability to the plaintiff,ie, the first\n                    defendant will be liable for 30% of the plaintiff’s costs and the second\n                    defendant will be liable for 70% of the plaintiff’s costs. As stated in[97]above, the first defendant is\n                    entitled to recover from the second defendant the costs that it pays to the\n                    plaintiff. 99     As the first defendant has succeeded in its\n                    proceedings against the second defendant for an indemnity or a contribution, it\n                    follows that it is entitled to recover its costs from the second\n                    defendant."
    }
}