{
    "case_title": "Public Prosecutor \n      v\n      Ng Teck Lee (Centillion Environment & Recycling Ltd (formerly known as\n                Citiraya Industries Ltd) and another, other parties) (Ung Yoke Hooi, intervener) and\n                another matter",
    "ncitation": "[2011] SGHC 205",
    "coram": "Kan Ting Chiu J",
    "sections": {
        "Introduction": "1       In this judgment, the workings of the\n                    Corruption, Drug Trafficking and Other Serious Crimes (Confiscation of Benefits)\n                    Act (Cap 65A, 2000 Rev Ed) (“CDSA”) will be considered and\n                    applied. 2       In essence, this case concerned an application\n                    by the Public Prosecutor (“PP”) for the confiscation of the\n                    benefits derived by Ng Teck Lee (“NTL”) from his criminal conduct\n                    and the realisation of property to satisfy the confiscation order. There were\n                    also applications by three parties, namely, Centillion Environment &\n                    Recycling Ltd (“Centillion”), Thor Beng Huat (“TBH”)\n                    and Ung Yoke Hooi (“UYH”) who asserted their interests in some of\n                    the properties which the PP considers to be realisable under the\n                CDSA.",
        "NTL’s alleged offences": "3       NTL was the Chief Executive Officer cum\n                    President of Citiraya Industries Ltd (“Citiraya”) (as the company\n                    was named before changing its name to Centillion). Citiraya was engaged in the\n                    business of recycling and recovering precious metals from electronic scrap.\n                    Citiraya entered into agreements with a number of companies which produced\n                    computer chips (“the chip manufacturers”) whereby Citiraya was to\n                    crush substandard items made by the chip manufacturers and recover precious\n                    metals from that scrap. 4       NTL’s criminal conduct was uncovered by\n                    the Corrupt Practices Investigation Bureau (“CPIB”). Chief Special\n                    Investigator Fong Wai Kit (“Fong”) of the CPIB filed an affidavit\n                    in these proceedings on 10 June 2008 in which he stated that investigations\n                    against NTL were commenced following the receipt of a complaint in December\n                    2004. The investigations related to offences including criminal breach of trust\n                    as a servant under s 408 of the Penal Code (Cap 224, 2008 Rev Ed) and other\n                    offences, all of which came within the definition of a “serious\n                    offence” under the Second Schedule to the CDSA. The relevant paragraphs\n                    of Fong’s affidavit stated as follows: 8.    As the Chief Executive Officer cum President of\n                            [Citiraya], [NTL] was entrusted with electronic scrap sent to [Citiraya]\n                            by its clients for destruction. With the assistance of his brother, Ng\n                            Teck Boon, [NTL] had misappropriated a portion of the electronic scrap\n                            sent to [Citiraya] for destruction by [the chip manufacturers] in the\n                            years 2003 and 2004. Instead of crushing all the electronic scrap in\n                            accordance with the terms of the agreements [Citiraya] had with [the\n                            chip manufacturers], a portion was removed from the premises of\n                            [Citiraya] and subsequently repacked and sold to buyers in Hong Kong and\n                            Taiwan. 9.    Ng Teck Boon, the General Manager of [Citiraya],\n                            helped to arrange for the misappropriated electronic scrap (which\n                            included computer chips) to be delivered to Thor Beng Kiong at a\n                            warehouse at 67 Ubi Crescent #04-05 and later to a warehouse at 3A Joo\n                            Koon Circle. 10.    Thor Beng Kiong, [NTL’s] brother-in-law,\n                            would sort and repack the misappropriated computer chips pursuant to\n                            [NTL’s] instructions. Gan Chin Chin, [NTL’s] personal\n                            financial adviser and Chief Financial Officer of [Citiraya], would then\n                            arrange for the misappropriated computer chips to be delivered to buyers\n                            in Hong Kong and China based on [NTL’s]\n                        instructions. 11.    Gan Chin Chin confirmed that a total of 62\n                            shipments of misappropriated computer chips were made in 2003 and 2004.\n                            Most of the payments for the 62 shipments were made to two bank accounts\n                            in Hong Kong held by Pan Asset International Limited (“Pan\n                            Asset”): Credit Suisse Hong Kong Branch (“Credit\n                            Suisse”) account [xxx] and UBS AG Hong Kong Branch\n                            (“UBS”) account [xxx]. Pan Asset is a company incorporated\n                            in the British Virgin Islands in the name of Gan Chin Chin but owned and\n                            controlled by [NTL]. A total sum ofUS$51,196,938.52was received by [NTL] as payment for\n                            the 62 shipments. [emphasis in original] 5       Gan Chin Chin (“Gan”), former\n                    Chief Financial Officer of Citiraya and personal financial advisor to NTL,\n                    deposed an affidavit in which she confirmed her role in Citiraya and in\n                    NTL’s criminal activities. She went on to disclose that: 6.    Although companies\n                            such as Neat World Trading and Compunet Trading were named as the\n                            sellers of the computer chips, [NTL] instructed that payments for the\n                            computer chips were to be made to two particular bank accounts of a\n                            company known as Pan Asset International Limited (“Pan\n                            Asset”). Pan Asset is a company incorporated in the British\n                            Virgin Islands under my name pursuant to [NTL’s] instructions. The\n                            company belongs to [NTL]. 7.    The\n                            two bank accounts of Pan Asset that payments for the computer chips were\n                            made to are: (i)    Credit Suisse (Hong Kong) account no. [xxx];\n                                and (ii)   United Bank of Switzerland\n                                (“UBS”) (Hong Kong) account no. [xxx]. 8.    I was managing all the transactions in relation to\n                            these two bank accounts held by Pan Asset. All credits and debits made\n                            to these accounts were based on [NTL’s] instructions. Most of the\n                            proceeds of sale of the 62 shipments of computer chips ... were paid\n                            into these two bank accounts. 9.    A total sum ofUS$51,196,938.52was received as payment for the 62\n                            shipments of computer chips. Out the [sic]\n                            total payments received, US$ 24,897,394.43 was credited into Pan\n                            Asset’s Credit Suisse Hong Kong account (Account No: [xxx]) and\n                            USD 20,349,608.09 was credited into Pan Asset’s UBS Hong Kong\n                            account (Account No: [xxx]). The remaining US$ 5,949,936.00 was credited\n                            into [NTL]’s personal or Rich Nature’s account in Credit\n                            Suisse Hong Kong. [emphasis in original]",
        "NTL’s abscondment": "6       NTL was not charged or prosecuted for any\n                    offence because he had left Singapore on 19 January 2005 and had not\n                    returned since. 7       Following his departure, efforts were made to\n                    locate him, including: (a)     immigration stoplist issued on 24\n                        January 2005; (b)     Police Gazette issued on 15 February 2005; (c)     Singapore Warrant of arrest issued on 24 February\n                        2005; and (d)     International Warrant of Arrest issued through Interpol on 8 April\n                        2005; but despite these measures, his whereabouts (and\n                    the whereabouts of his wife Thor Chwee Hwa (“TCH”)) remain\n                        unknown.[note: 1] 8       In the circumstances, NTL is deemed under\n                    s 26(3) of the CDSA to have absconded, and he is therefore also deemed\n                    under s 26(1) to be convicted of a serious offence.",
        "The PP’s applications": "9       In these proceedings the PP applied for,inter alia, (a)     a confiscation order against NTL\n                        under s 5 of the CDSA for US$51,196,938.52 being the value of benefits\n                        known to be derived by him from criminal conduct; (b)     a certificate under s 10(2) of the\n                        CDSA that the amount to be recovered under the confiscation order be\n                        assessed at $28,832,725.14 and US$1,008.66; (c)     an order that NTL pay $28,832,725.14 and\n                        US$1,008.66 to the State; (d)     an order that properties identified as realisable\n                        properties be realised and applied on NTL’s behalf towards the\n                        satisfaction of the confiscation order; and (e)     an order that the PP be at liberty to apply for\n                        supplementary confiscation and realisation orders. Service of the application on NTL and TCH was dispensed with as their\n                    whereabouts were unknown.",
        "The confiscation order": "10     Confiscation orders are generally made under\n                    s 5 of the CDSA. Section 5(1) provides that: 5. —(1)    Subject to\n                            section 27, where a defendant is convicted of one or more serious\n                            offences, the court shall, on the application of the Public Prosecutor,\n                            make a confiscation order against the defendant in respect of benefits\n                            derived by him from criminal conduct if the court is satisfied that such\n                            benefits have been so derived. 11     In the present case, as the defendant NTL had\n                    absconded, s 27 of the CDSA applied. It provides that: 27.    Where a person is, by reason of section 26,\n                            to be taken to have been convicted of a drug trafficking offence or a\n                            serious offence, as the case may be, a court shall not make a\n                            confiscation order in reliance on the person’s conviction of the\n                            offence unless the court is satisfied — (a)    on the evidence\n                                adduced before it that, on the balance of probabilities, the person\n                                has absconded; and (b)    having regard to\n                                all the evidence before the court, that such evidence if unrebutted\n                                would warrant his conviction for the drug trafficking offence or\n                                serious offence, as the case may be. On the facts, the conditions in ss 27(a) and (b) were\n                    satisfied. 12     Under the CDSA, third parties may be heard\n                    when an application is made for a confiscation order or after a confiscation\n                    order is made. Section 13 of the CDSA, which governs such applications, provides\n                    that: 13. —(1) Where an application is made\n                        for a confiscation order under section 4 or 5, a person who asserts an\n                        interest in the property may apply to the court, before the confiscation\n                        order is made, for an order under subsection (2). (2)    If a person applies\n                            to the court for an order under this subsection in respect of his\n                            interest in property and the court is satisfied — (a)    that he was not in any way involved in\n                                the defendant’s drug trafficking or criminal conduct, as the\n                                case may be; and (b)    that he acquired the interest\n                                — (i)    for sufficient consideration;\n                                and (ii)   without knowing, and in circumstances\n                                    such as not to arouse a reasonable suspicion, that the property\n                                    was, at the time he acquired it, property that was involved in\n                                    or derived from drug trafficking or criminal conduct, as the\n                                    case may be, the court shall make an order declaring the nature, extent and value (as\n                        at the time the order is made) of his interest. (3)    Subject to\n                            subsection (4), where a confiscation order has already been made, a\n                            person who asserts an interest in the property may apply under this\n                            subsection to the court for an order under subsection\n                            (2). (4)    A person who\n                            — (a)    had knowledge of\n                                the application under section 4 or 5 for the confiscation order\n                                before the order was made; or (b)    appeared at the\n                                hearing of that application, shall not be permitted to make an application under subsection (3) except\n                        with the leave of the court. (5)    A person who makes an application under subsection\n                            (1) or (3) shall give not less than 7 days’ written notice of the\n                            making of the application to the Public Prosecutor who shall be a party\n                            to any proceedings on the application. 13     Centillion and TBH asserted their interests in\n                    particular properties that the PP sought to realise on 11 July 2008 and\n                    21 October 2008 respectively. When the PP’s application came on for\n                    hearing, I informed the parties that I proposed to deal with the PP’s\n                    application for a confiscation order first, on the understanding that the making\n                    of the order would not prejudice the right of any third party to assert their\n                    interest in any properties. There were no objections to the proposal, and the\n                    confiscation order was made on 4 May 2009. UYH subsequently asserted his\n                    interest on 22 May 2009. 14     It was necessary in these proceedings to have\n                    a clear understanding of the term “benefits derived … from\n                    criminal conduct” appearing in s 5(1) of the CDSA. Section 8(1)\n                    of the CDSA provides that: 8.\n                                —(1)    … [F]or the purposes of\n                            this Act — (a) the benefits derived by any person\n                            from criminal conduct, shall be any property or interest therein\n                            (including income accruing from such property or interest) held by the\n                            person at any time, whether before or after 13th September 1999, being\n                            property or interest therein disproportionate to his known sources of\n                            income, and the holding of which cannot be explained to the satisfaction\n                            of the court; (b) the value of the benefits derived by\n                            him from criminal conduct, shall be the aggregate of the values of the\n                            properties and interests therein referred to in paragraph (a). 15     On a reading of s 8(1)(a), the benefits derived by a person from criminal conduct are\n                    determined by a process where: (a)     the person’s property or\n                        interest in the property is established; (b)     the person’s known sources of income are\n                        established; and (c)     it is established that the property or interest in the property is\n                        disproportionate to the person’s known sources of income, and the\n                        disproportionality is not explained to the satisfaction of the\n                    court. In the application for a confiscation order in this\n                    case the PP did not refer to s 8(1)(a) or the\n                    requirements therein, but instead presented direct evidence that NTL had derived\n                    benefits amounting to US$51,196,938.5 from the sale of the computer chips\n                    misappropriated from Centillion (“the misappropriated\n                    chips”). 16     The proper construction of\n                        s 8(1)(a) was critical to the PP’s\n                    application. Section 8(1)(a) may be construed as\n                    theexhaustivedefinition of benefits derived from\n                    criminal conduct, or it may be construed asonedefinition of the benefits. This issue was not raised during the\n                hearing. 17     There is a good reason for the definition in\n                        s 8(1)(a) to be regarded as\n                    non-exhaustive. If a person is known: (a)     to have engaged in criminal conduct;\n                        and (b)     to have\n                        obtained $X from the criminal conduct, then the court\n                    should find that $X is the benefit derived from the criminal conduct without\n                    having to refer to s 8(1)(a). It is only in a\n                    situation where a person is known to have engaged in criminal conduct but the\n                    amount of benefit that he had derived from the criminal conduct is not known\n                    that s 8(1)(a) is needed. 18     The process in s 8(1)(a) predates the CDSA. It can be traced back to\n                        s 5(1)(a)(i) of the Corruption\n                    (Confiscation of Benefits) Act (No 16 of 1989) (“CCBA”), which\n                    stated: 5.\n                                —(1)    … [F]or the purposes of\n                            this Act — (a)    the benefits derived by any person from\n                                corruption shall be— (i)    any property or interest therein held by\n                                    the person at any time, whether before or after the commencement\n                                    of this Act, being property or interest disproportionate to his\n                                    known sources of income and the holding of which cannot be\n                                    explained to the satisfaction of the court\n                                … Section 5(1)(a)(i) followed after s 4(4) of the CCBA, which\n                    stated: (4)    … [F]or the purposes of this Act, a person\n                            who holds or has at any time (whether before or after the commencement\n                            of this Act) held any property or any interest therein disproportionate\n                            to his known sources of income, the holding of which cannot be explained\n                            to the satisfaction of the court, shall be deemed to have derived\n                            benefits from corruption. 19     In the parliamentary debates leading to the\n                    enactment of the CCBA, Professor S Jayakumar, then Second Minister for Law,\n                    explained the clause that would become s 4 of the CCBA (Singapore Parliamentary Debates, Official Report(30 March\n                    1988) vol 50 at cols 1718–1719): … [L]et us take the case of an offender who has been corrupt prior\n                        to that particular offence for which there was discovery and for which he\n                        was charged. He may have assets which are clearly disproportionate to his\n                        known sources of income and for which he can give no satisfactory\n                        explanation.Such assets, under existing law, cannot be\n                            confiscated unless it is proved that he has actually derived those\n                            assets by corruption. But these are matters which are\n                        specially within his own knowledge and it would be difficult, if not,\n                        impossible to obtain evidence concerning them. The Bill, therefore, provides new powers for tracing and freezing the\n                        benefits of corruption and for confiscating those benefits. … Under clause 4, Sir, where a person has been convicted of a corruption\n                        offence and the Public Prosecutor makes an application to the court, the\n                        court shall make a confiscation order against the defendant in respect of\n                        benefits derived by him from corruption. The safeguard is that the court\n                        must be satisfied that such benefits have been so derived. A person isdeemed to have derived benefitsfrom\n                        corruption if he holds or has held assets disproportionate to his known\n                        sources of income, the holding of which he cannot explain to the\n                        satisfaction of the court. The onus of explaining assets which are\n                        disproportionate to the defendant's known sources of income is placed on\n                        him. This is fair since it will only apply after he has been convicted of a\n                        corruption offence and that he is in the best position to explain how he\n                        derived those assets. [emphasis added] 20     In a further speech, Professor Jayakumar spoke\n                    on clause 4 and clause 5 of the Bill, which were to become s 4 and s 5\n                    of the CCBA respectively (Singapore Parliamentary Debates,\n                        Official Report(3 March 1989) vol 53 at\n                    cols 13–14): Clause 4, subsection (4)deemsa person to\n                        have benefited from corruption if he holds, or has held, any assets\n                        disproportionate to his known sources of income and which cannot be\n                        satisfactorily accounted for. Under clause 5, these disproportionate and\n                        unexplained assets constitute the benefits of corruption. But as there may\n                        be situations where the personal representatives or next-of-kin are unable\n                        to rebut thepresumptionsin clause[s] 4,\n                        [subsection] (4) and 5, the scope of a confiscation order is now restricted\n                        to only those disproportionate and unexplained assets acquired by a deceased\n                        defendant within six years before his death. [emphasis added] 21     It can be seen from this legislative material\n                    that s 4(4) and s 5(1)(a)(i) of the CCBA\n                    were enacted to facilitate the confiscation of the property of a person who has\n                    engaged in corrupt practices by creatingpresumptionswhich could be applied where there is no proof that\n                    the person had derived direct benefit from acts of corruption. The CCBA has been\n                    repealed and the confiscation of benefits derived from corruption is now dealt\n                    with under the CDSA. Section 5(1)(a)(i) of\n                    the CCBA is carried over in s 8(1)(a) of the\n                    CDSA, and s 4(4) of the CCBA is carried over in s 5(6) of the CDSA\n                    which provides that: (6)    … [F]or the purposes of this Act, a person\n                            who holds or has at any time (whether before or after 13th September\n                            1999) held any property or any interest therein (including income\n                            accruing from such property or interest) disproportionate to his known\n                            sources of income, the holding of which cannot be explained to the\n                            satisfaction of the court, shall, until the contrary is proved, be\n                            presumed to have derived benefits from criminal conduct. 22     When s 8(1)(a) of the CDSA is read against its legislative history and in\n                    conjunction with s 5(6) of the CDSA, it is clear that it is a presumptive\n                    provision and not an exhaustive definition of the benefits derived from criminal\n                    conduct.",
        "The applications relating to realisation of property": "23     After the making of the confiscation order\n                    mentioned at[13]above, I turned my\n                    attention to the applications relating to the realisation of property under\n                    s 19 of the CDSA. There were a multitude of applications from Centillion,\n                    UYH and TBH. The applications were,inter\n                    alia: (a)     Centillion’s application for a\n                        declaration that it has an interest in the properties the PP was seeking to\n                        realise; (b)     UYH’s application for a declaration that he is the beneficial owner\n                        of the money in his bank accounts which the PP was seeking to realise;\n                        and (c)     TBH’s\n                        application for a declaration that he is the beneficial owner of TCH’s\n                        60% interest in the property known as 95A Paya Lebar Crescent, which the PP\n                        was seeking to realise. 24     While the claimants’ applications were\n                    for different forms of relief, the purpose behind them was common: they opposed\n                    the PP’s application for a realisation order over some properties on the\n                    ground that they had interests in some of the properties. In view of that, I\n                    proposed (and the parties agreed) that the third party claimants’\n                    applications, despite being taken out under a variety of different procedures,\n                    were to be taken as applications under s 13 of the CDSA which deals with\n                    the protection of rights of third parties under that Act. 25     The effect of s 13 had to be considered.\n                    The relevant sections have been set out at[12]above. Section 13(1) requires a third party who\n                    asserts an interest in a property affected by a confiscation application to\n                    apply for an order under s 13(2) (ss 13(3) and (4) also allow third\n                    party applications to be made after a confiscation order has been made.)\n                    Section 13(2) sets out two conditions in sub-sections (a) and (b) that the applicant must\n                    satisfy before he can succeed. The condition in s 13(2)(a) relates to the applicant rather than the property. The\n                    condition in s 13(2)(b) relates to the\n                    acquisition of the property, and it is not clear whether it relates to any\n                    property acquired by the applicant or only to property acquired by the applicant\n                    from the defendant. Section 13(2)(b)(i)\n                    suggests the latter interpretation because the sufficiency or existence of\n                    consideration is not relevant unless the property was acquired from the\n                    defendant. Although this is not expressly stated in s 13, a declaration in\n                    an applicant’s favour under s 13(2) would mean that the property in\n                    question is not realisable property.",
        "Summary of the PP’s application": "26     The PP’s application extended over 28\n                    classes of property set out in para 5 of the PP’s amended Originating\n                    Summons No 785 of 2008 (“OS 785/2008”). I have listed these\n                    properties in the PP’s List of Realisable Properties (Appendix A).\n                    The PP regarded the listed properties as realisable property under the CDSA.\n                    Realisable property is defined in s 2 as: (a)    any property held by\n                            the defendant; and (b)    any property held by\n                            a person to whom the defendant has, directly or indirectly, made a gift\n                            caught by this Act; Definition (b) covers not only gifts\n                    caught by the Act, butanyproperty held by the\n                    recipient of such gifts. In this light it should be noted that s 21(3)\n                    provides that the amount to be realised in the case of such a recipient shall\n                    not exceed the value of the gift. 27     A “gift caught by the Act” is in\n                    turn defined in s 12(8): (8)    A gift (including a\n                            gift made before 13th September 1999) is caught by this Act if\n                            — (a)    it was made by\n                                the defendant at any time since the beginning of the period of 6\n                                years ending when the proceedings for a serious offence were\n                                instituted against him or, where no such proceedings have been\n                                instituted, when an application under section 5 for a confiscation\n                                order is made against him; or (b)    it was made by\n                                the defendant at any time and was a gift of property which is or is\n                                part of the benefits derived by the defendant from criminal\n                                conduct. Under this definition, s 12(8)(a) covers gifts made by NTL within the period of six\n                    years prior to 10 June 2008 (the date the application for the\n                    confiscation order was made) and s 12(8)(b)\n                    covers gifts made at any time out of the benefits derived from NTL’s\n                    criminal conduct. 28     Effectively, a “realisable\n                    property” can be any property held by NTL, whether or not it is derived\n                    from criminal conduct, and any property held by a person to whom NTL had made a\n                    “gift caught by the Act”, even if the specific property is not\n                    itself a “gift caught by the Act”.",
        "Summary of UYH’s application": "29     UYH claimed an interest in the money in five\n                    bank accounts in his name. The PP asserted that these were realisable properties\n                    at para 5.18 of OS 785/2008.",
        "Summary of Centillion’s application": "30     Intervention by a “white knight”\n                    enabled Centillion to survive NTL’s misappropriations. The company entered\n                    into a scheme of arrangement with its creditors. Centillion sued NTL and\n                    obtained a default judgment against him on 3 November 2008 for the sum of\n                    $51,196,938.52 (in Singapore dollars; contrast the currency stated in\n                    Fong’s and Gan’s affidavits at[4]and[5]above). 31     Through the administrator of the scheme of\n                    arrangement, Centillion put forward its application on two grounds. It asserted\n                    as judgment creditor an interest in a majority of the properties the PP asserted\n                    to be realisable, and, alternatively, it claimed an interest in a smaller\n                    category of traceable properties on the basis that NTL held these properties as\n                    constructive trustee for Centillion.",
        "Summary of TBH’s application": "32     TBH claimed a beneficial interest in\n                    TCH’s 60% share of the property known as 95A Paya Lebar Crescent. The PP\n                    asserted that this share was a realisable property at para 5.9 of\n                    OS 785/2008.",
        "Findings relating to the parties’ applications": "",
        "Findings on the PP’s application": "33     The PP had to show that the properties in his\n                    application were realisable property as defined in s 2iethat they were either property held by NTL or property held\n                    by a person to whom NTL had made a “gift caught by the Act” as\n                    defined in s 12(8) (see[28]above).\n                    Some of the properties at para 5 of OS 785/2008 (and listed in Appendix A)\n                    were not realisable property. 34     I have listed the true realisable assets in\n                    the List of Realisable Properties (Appendix B). These properties were realisable\n                    properties because they were: (a)     properties in the name of\n                        NTL; (b)     properties\n                        in the names of persons (namely, Gan Chin Chin, Kwok Seng Hua and Goh Lik\n                        In) who admitted that they held the properties on trust for NTL;\n                    or (c)     money in the\n                        client account of M/s Allen & Gledhill LLP in the name of NTL. The\n                        account number has been stated as [xxx] in para 10 of Fong’s affidavit\n                        filed on 11 February 2009 and [xxx] in para 5.28 of OS 785/2008.\n                        The correct account number should be verified. 35     The list in Appendix B is shorter than\n                    the list in Appendix A because of the exclusion from Appendix A of: (a)     the properties at paras 5.6, 5.7,\n                        5.8 and 5.9 of OS 785/2008 and TCH’s half share of the properties at\n                        paras 5.3, 5.4 and 5.5 of OS 785/2008 (TCH’s\n                    properties); (b)     the\n                        properties at paras 5.26 and 5.27 of OS 785/2008 which the PP had included\n                        on the basis of the hearsay evidence said to be from Wee Kok Keng\n                        (“Wee”); (c)     the properties at para 5.18 of OS 785/2008 (UYH’s\n                        properties); and (d)     the traceable properties in respect of Centillion’s\n                        application. 36     The properties at paras 5.6, 5.7, 5.8 and 5.9\n                    of OS 785/2008 were properties in the name of TCH. The properties at paras 5.3,\n                    5.4 and 5.5 of OS 785/2008 were properties in the joint names of NTL and\n                    TCH, of which TCH held a half share. The PP had sought to include TCH’s\n                    properties as realisable properties on the basis that TCH had no employment\n                    record and was a homemaker, and her properties must therefore have been derived\n                    from NTL. The flaw in this argument was that those properties had to be\n                    realisable properties as defined in s 2 of the CDSA (see[26]above). As they were not held by NTL they did\n                    not fall under definition (a). For any property\n                    held by TCH to be a realisable property under definition (b), it had to be established that NTL had made a gift caught by\n                    the Act to her. By the definition in s 12(8), that would include gifts made\n                    by NTL to TCH within six years prior to the date of application for the\n                    confiscation order (10 June 2008) and any gifts made by NTL to TCH out of\n                    the benefits of his criminal conduct. 37     The only evidence relating to a gift made from\n                    NTL to TCH was the following statement in Fong’s affidavit at para\n                    29: 29.    From the proceeds of sale of the misappropriated\n                            electronic scrap, [NTL]gaveno less thanUS$1,249[,]414.10 and $3,001,465.48to\n                            his wife, [TCH]. He had instructed [Gan] to transfer the following sums\n                            of money from Pan Asset’s Credit Suisse account [xxx] to\n                            [TCH]: … [emphasis in original in italics; emphasis added in bold italics] Fong then set out several bank transfers from Pan Asset International\n                    Limited (“Pan Asset”)’s Credit Suisse account [xxx] to\n                    TCH’s bank accounts. These transfers totalled US$1,249,414.10 and\n                    $3,001,465.48. Fong did not disclose the basis for him to assert (a) that the\n                    US$1,249,414.10 and $3,001,465.48 came from the proceeds of sale of the\n                    misappropriated chips and (b) that the money was a gift from NTL to\n                TCH. 38     Gan, who received NTL’s instructions and\n                    made the transfers mentioned above, only stated (at para 36 of her affidavit)\n                    that NTL had instructed her to transfer sums totalling US$1,249,414.10 and\n                    $3,001,465.48 from Pan Asset’s Credit Suisse account [xxx] to TCH. She did\n                    not state that the money was derived from the proceeds of sale of the\n                    misappropriated chips or that the transfers were gifts from NTL. 39     There was therefore no proper evidence that\n                    the money transferred to TCH from Pan Asset’s accounts came from the sale\n                    of the misappropriated chips or that it was gifted to TCH by NTL. 40     Even if it was assumed that TCH’s wealth\n                    was derived from NTL, there was no evidence that those properties were direct\n                    gifts from NTL or that TCH had acquired the properties in question with gifts\n                    that she had received from NTL within the six years prior to\n                    10 June 2008. TCH may have acquired those properties with money gifted\n                    to her by NTL before the six-year period. There was also no evidence that TCH\n                    used money that was gifted to her by NTL out of the benefits derived from his\n                    criminal conduct to acquire those properties. NTL was engaged in legitimate\n                    business and it could not be assumed that any gift he made to TCH was derived\n                    from his criminal activities. 41     The properties listed at paras 5.26 and 5.27\n                    of OS 785/2008 were shares and money held by a company, Ventures Trust Pte Ltd\n                    (“Ventures Trust”), which was alleged in Fong’s affidavit to\n                    have been set up by Wee. Fong also alleged that Wee confirmed that the shares\n                    and money belonged beneficially to NTL. However, the PP did not adduce any\n                    direct evidence from Wee. The reason put forward was that Wee lives and works\n                        overseas.[note: 2]Wee’s\n                    “evidence” regarding these properties was hearsay evidence which\n                    did not come within the exceptions to the hearsay rule in s 32(c) of the Evidence Act (Cap 97, 1997 Rev Ed), and\n                    was inadmissible. Consequently, the shares and money held by Ventures Trust\n                    could not be regarded as properties of NTL and were not realisable\n                    property.",
        "Findings on UYH’s application": "42     UYH asserted that the monies in his bank\n                    accounts were the balance of $2m received as part payment due under an oral\n                    agreement for NTL to buy from him, Ung Yoke Khim (“UYK”) and Soon\n                    Ah Lan (“SAL”) four million shares in a company, Citiraya\n                    Teknologi Sdn Bhd (“CTSB”), which major shareholder was\n                    Centillion. 43     The PP disputed the existence of the\n                    agreement. Questions were raised over the fact that the agreement was not\n                    evidenced in writing and that no shares were transferred to NTL (UYH’s\n                    evidence was that it was agreed that the shares were to be transferred only upon\n                    full payment). UYH had produced affidavits from UYK and SAL which confirmed that\n                    there was to be a sale of the shares. These affidavits exhibited letters from\n                    UYK and SAL appointing UYH to represent them in the negotiations. UYK gave oral\n                    evidence at the hearing and he was not questioned on the letter of authority he\n                    issued to UYH. SAL’s attendance in court was dispensed with when it was\n                    disclosed that she was hospitalised in Malaysia and was\n                uncontactable. 44     I found on a balance of probabilities that\n                    there was an agreement for the sale of the shares as described by UYH. There was\n                    no dispute that UYH, UYK and SAL owned four million shares in CTSB which they\n                    were prepared to sell to NTL. On the other hand, the PP did not put up any\n                    plausible reason for UYH to be holding the money on trust for NTL, or for NTL to\n                    have made gifts of the money to UYH. 45     I found that UYH had established his interest\n                    in the money in his bank accounts. There was no allegation that\n                        s 13(2)(a) or s 13(2)(b)(ii) of the CDSA applied to him. As for the issue of\n                    consideration under s 13(2)(b)(i), there was\n                    no allegation that the purchase price of $1 a share (as stated by UYH) was\n                    insufficient consideration. However, I did not declare that the money belonged\n                    to UYH beneficially because the money may be refundable as the sale of the\n                    shares was aborted because CTSB was wound up subsequently. That question should\n                    be determined in separate proceedings between NTL, UYH, UYK and SAL. I limited\n                    myself to declaring that the money in the accounts as stated at para 5.18\n                    of OS 785/2008 was not realisable property. 46     It should be stated that the PP had included\n                    the monies in two of the five bank accounts of UYH (corresponding to paras\n                    5.18(i)–(ii) of OS 785/2008) in an affidavit listing properties that\n                    were traceable to the proceeds of sale of the misappropriated chips (see[51]below), and this list was accepted\n                    by Centillion. However, UYH had not accepted the list, and he was not bound by\n                    any admissions contained in it. As the inclusion of the two accounts in the list\n                    was not supported by any evidence, there was no proof, as far as UYH was\n                    concerned, that the money in the two accounts was traceable to the proceeds of\n                    sale of the misappropriated chips.",
        "Findings on Centillion’s application": "47     Centillion based its application on two\n                    grounds, firstly as a judgment creditor, and secondly as a beneficiary under\n                    constructive trusts. 48     On the first ground, Centillion claimed that\n                    as judgment creditor, it had an interest in the property of NTL. It relied on\n                    the definition of an “interest” in relation to property in\n                    s 2 of the CDSA, which states that such an “interest”\n                    “includes any right”. It was argued that “any right”\n                    included a right to take out enforcement proceedings over property. As support\n                    for this contention, Centillion’s counsel relied on an Australian act, the\n                    Proceeds of Crime Act 1987 (Act 87 of 1987) (Cth) (“POCA”) which\n                    provides for the confiscation of benefits of corruption. The specific provision\n                    relied on was s 4 of the POCA, which states that: “interest”, in relation to property,\n                        means: (a)    a legal or equitable estate or interest in the\n                                property; or (b)    a right, power or privilege in connection with\n                                the property, whether present or future and whether rested or contingent … 49     Counsel contended that the right to take out\n                    enforcement proceedings would come within the definition in s 4 of the POCA\n                    and that:[note: 3] 51.    … It is appropriate for the Court to have\n                            regard to the meaning of “interest” under the [POCA]\n                            because ... section 13 of the CDSA was adapted from section 31\n                            of the [POCA]. Counsel for Centillion did not go so far as to state whether the\n                    POCA definition of “interest” is established to include the right\n                    to take out execution proceedings or why the POCA definition would apply to\n                    proceedings under the CDSA, which has its own definition. 50     When s 2 of the CDSA defines\n                    “interest” to include “any right”, it uses the words\n                    “‘interest’ … in relation to property”. The\n                    “right” referred to must be a right relating to the property in\n                    dispute. In a situation where an application for a realisation order is made in\n                    respect of specified properties, “any right” asserted by a third\n                    party under s 13 must relate to those specified properties. A general right\n                    to take out enforcement proceedings pursuant to a judgment is not a right in any\n                    specific property. It can be argued that when enforcement proceedings are\n                    commenced with regard to specified properties, the judgment creditor has a\n                    potential interest in the properties, and when the right of enforcement is\n                    obtained, the judgment creditor would have an actual interest in those\n                    properties. However, on these facts Centillion had not taken out any enforcement\n                    proceedings in relation to the properties in question, and no explanation was\n                    given for that. Could it be that Centillion was not able to take out enforcement\n                    proceedings against those properties? As the onus was on Centillion to show that\n                    it had an interest in the properties in question, Centillion had not discharged\n                    the onus simply by referring to the judgment in its favour against\n                NTL. 51     Centillion also made a claim on some of the\n                    properties as beneficiary of a constructive trust. There is some background to\n                    this claim that should be mentioned. Centillion had applied for discovery\n                    against the PP. Centillion explained that it needed to discover evidence on the\n                    proceeds of sale of the misappropriated chips, in particular, whether the\n                    proceeds had been used to purchase properties, and if so, what the properties\n                    purchased were. The PP was prepared to give discovery of the documents seized\n                    from Centillion, but was not prepared to give discovery of the documents of\n                    third parties without their consent. The impasse was resolved when the PP\n                    offered to file an affidavit to disclose the properties which could be traced to\n                    the proceeds of sale of the misappropriated chips. The PP filed an affidavit on\n                    12 July 2010 deposed by Principal Special Investigator Tok Thiam Soon\n                    Frederick (“Tok”) of the CPIB in which he stated that the\n                    properties described in paras 5.10(ii), 5.11, 5.13, 5.14, 5.15, 5.17,\n                    5.18(i), 5.18(ii), 5.19(i)(a), 5.20, 5.21, 5.22, 5.23, 5.24, 5.25, 5.26 and 5.27\n                    of OS 785/2008 were established in investigations to be “traceable\n                    to the proceeds of sale of the chips misappropriated by [NTL]”. On\n                    receipt of the affidavit, Centillion did not proceed with its application for\n                    discovery. 52     I should highlight the fact that while\n                    Tok’s statements could be regarded as containing admissions that bind the\n                    PP (and were accepted by Centillion), they did not bind the other parties. This\n                    is why Tok’s affidavit could not bind UYH in respect of the properties\n                    listed at paras 5.18(i)–(ii) of OS 785/2008 (see[46]above). Similarly, Tok’s affidavit could not bind\n                    Ventures Trust concerning the properties listed at paras 5.26 and 5.27 which\n                    were held by Ventures Trust as those were not proven to be realisable (see[41]above). 53     Counsel for Centillion then argued that as NTL\n                    had misappropriated the chips from Centillion, NTL held the proceeds of the sale\n                    of the chips and the property acquired with those proceeds as a constructive\n                    trustee for the benefit of Centillion. This was an argument based on tracing\n                    from property misappropriated from Centillion. Centillion also had an\n                    alternative constructive trust argument, namely that NTL had made illegal\n                    profits by misappropriating the chips. Centillion therefore asserted that\n                    NTL’s illegal profits (and the properties traceable from those profits)\n                    were subject to a constructive trust in favour of the company. 54     Two landmark decisions,Attorney-General of Hong Kong v Charles Warwick Reid and others[1994] 1 AC 324 (“AG v Reid”) andThahir Kartika Ratna v PT Pertambangan Minyak dan Gas\n                        Bumi Negara (Pertamina)[1994] 3 SLR(R) 312\n                        (“Pertamina”), were cited as\n                    authority for Centillion’s contention. Both cases dealt with the question\n                    of whether a principal was entitled to assert a beneficial interest in a bribe\n                    received by an agent or fiduciary, and in both cases, it was held that the\n                    principal was entitled to assert a constructive trust over the bribe (and\n                    property traceable from the bribe). 55     In particular, Centillion’s counsel set\n                    out in its submissions Lord Templeman’s finding inAG v\n                        Reidat pp 331B–332A as follows: When a bribe is offered and accepted in money or in kind, the money or\n                        property constituting the bribe belongs in law to the recipient. Money paid\n                        to the false fiduciary belongs to him. The legal estate in freehold property\n                        conveyed to the false fiduciary by way of bribe vests in him. Equity,\n                        however, which acts in personam, insists that it is unconscionable for a\n                        fiduciary to obtain and retain a benefit in breach of duty. The provider of\n                        a bribe cannot recover it because he committed a criminal offence when he\n                        paid the bribe. The false fiduciary who received the bribe in breach of duty\n                        must pay and account for the bribe to the person to whom that duty was owed.\n                        In the present case, as soon as the first respondent received a bribe in\n                        breach of the duties he owed to the Government of Hong Kong, he became a\n                        debtor in equity to the Crown for the amount of that bribe. So much is\n                        admitted. But if the bribe consists of property which increases in value or\n                        if a cash bribe is invested advantageously, the false fiduciary will receive\n                        a benefit from his breach of duty unless he is accountable not only for the\n                        original amount or value of the bribe but also for the increased value of\n                        the property representing the bribe. As soon as the bribe was received it\n                        should have been paid or transferred instanter to the person who suffered\n                        from the breach of duty. Equity considers as done that which ought to have\n                        been done. As soon as the bribe was received, whether in cash or in kind,\n                        the false fiduciary held the bribe on a constructive trust for the person\n                        injured. Two objections have been raised to this analysis. First it is said\n                        that if the fiduciary is in equity a debtor to the person injured, he cannot\n                        also be a trustee of the bribe. But there is no reason why equity should not\n                        provide two remedies, so long as they do not result in double recovery. If\n                        the property representing the bribe exceeds the original bribe in value, the\n                        fiduciary cannot retain the benefit of the increase in value which he\n                        obtained solely as a result of his breach of duty. Secondly, it is said that\n                        if the false fiduciary holds property representing the bribe in trust for\n                        the person injured, and if the false fiduciary is or becomes insolvent, the\n                        unsecured creditors of the false fiduciary will be deprived of their right\n                        to share in the proceeds of that property. But the unsecured creditors\n                        cannot be in a better position than their debtor. The authorities show that\n                        property acquired by a trustee innocently but in breach of trust and the\n                        property from time to time representing the same belong in equity to the\n                        cestui que trust and not to the trustee personally whether he is solvent or\n                        insolvent. Property acquired by a trustee as a result of a criminal breach\n                        of trust and the property from time to time representing the same must also\n                        belong in equity to his cestui que trust and not to the trustee whether he\n                        is solvent or insolvent. When a bribe is accepted by a fiduciary in breach of his duty then he\n                        holds that bribe in trust for the person to whom the duty was owed. If the\n                        property representing the bribe decreases in value the fiduciary must pay\n                        the difference between that value and the initial amount of the bribe\n                        because he should not have accepted the bribe or incurred the risk of loss.\n                        If the property increases in value, the fiduciary is not entitled to any\n                        surplus in excess of the initial value of the bribe because he is not\n                        allowed by any means to make a profit out of a breach of duty. This passage was applied inPertaminaat\n                        [56]. 56AG v ReidandPertaminarelated to a form of trust which\n                    does not exist until the bribes are received by a fiduciary in breach of his\n                    duties, as contrasted to cases where property is entrusted onto the wrongdoer\n                    from the outset, prior to the wrongdoing. The decision of the English Court of\n                    Appeal inJ J Harrison (Properties) Ltd v\n                        Harrison[2002] 1 BCLC 162 (“Harrison”) dealt with a trust of the second form. In that\n                    case, a director of a company disposed of the company’s property in breach\n                    of his fiduciary duties. Chadwick LJ held at [27]: [27]  It follows, also, from the principle that\n                            directors who dispose of the company’s property in breach of their\n                            fiduciary duties are treated as having committed a breach of trust that,\n                            a director who is, himself, the recipient of the property holds it upon\n                            a trust for the company. He, also, is described as a constructive\n                            trustee. But, as Millett LJ explained inParagon\n                                Finance plc v D B Thakerar & Co[1999] 1 All ER 400\n                            at 408–409, his trusteeship is different in character from that of\n                            the stranger. He falls into the category of persons who, in the words of\n                            Millett LJ ([1999] 1 All ER 400 at 408) ... ‘though not strictly\n                            trustees, were in an analogous position and who abused the trust and\n                            confidence reposed in them to obtain their principal’s property\n                            for themselves.’ This passage applies squarely to NTL. The trust of the type inHarrisonconforms to the conventional view on\n                    trust, while the bribe-related trusts inAG v ReidandPertaminareflect a more recent development in\n                    the law of trust. Both forms of trust are recognised in Singapore. Under both\n                    types of constructive trust, I found on the basis of Tok’s evidence (see[51]–[52]above) that NTL held the properties in the List of\n                    Constructive Trust Properties (Appendix C) on trust for\n                Centillion. 57     The PP raised multiple arguments against a\n                    constructive trust. The first argument was that: 51    ... [NTL] was [Centillion’s] CEO and its\n                            directing mind. His actions were the actions of the company, and the\n                            company acted through him. Thus when he sold used or defective computer\n                            chips slated for crushing for enormous profits, it can be said that the\n                            company did this. …[note: 4] This is a curious argument. Firstly, there was no evidence that\n                    NTL was the directing mind of Centillion. Secondly, it is ridiculous to say that\n                    when NTL misappropriated the chips from Centillion, sold them and kept the\n                    proceeds for himself, it can be said that the company did that. 58     The second argument was that Centillion was\n                    not entitled to claim a constructive trust over the proceeds of the sale of the\n                    misappropriated chips because Centillion could not have obtained those proceeds\n                    in the usual course of its business, and therefore Centillion was attempting to\n                    obtain “unjust, if not illegal, enrichment for\n                        itself.”[note: 5]The argument is misconceived. Under the analysis inAG v\n                        Reid, the constructive trust arises out of NTL’s breach of\n                    his fiduciary duties to the company, and the constructive trust applies to all\n                    benefits NTL derived from the breach of these duties. There is no basis to\n                    confine the constructive trust to the benefits that Centillion would have\n                    derived in the course of its business. The argument confuses Centillion’s\n                    entitlement to restitution in respect of its direct loss of the misappropriated\n                    chips with Centillion’s entitlement as the beneficiary of a constructive\n                    trust to the benefits NTL derived from his breach of fiduciary duties. In this\n                    case it is the latter that is under consideration, not the former. Under theHarrisontype of constructive trust it is even\n                    clearer that the properties traceable from the proceeds of sale of the\n                    misappropriated chips represent, on a totally orthodox tracing analysis, the\n                    value of Centillion’s misappropriated chips. There is no reason this value\n                    should not be claimed by Centillion as constructive trustee. 59     It is not unjust for there to be a\n                    constructive trust over the proceeds of the sale of the misappropriated chips\n                    and this was made clear by Lord Templeman inAG v\n                        Reidin the passage of his judgment that has been set out at[54]above as well as at 338A–C ofAG v Reid, where he stated: … Phipps v. Boardman[1967] 2 A.C. 46\n                        … demonstrates the strictness with which equity regards the conduct\n                        of a fiduciary and the extent to which equity is willing to impose a\n                        constructive trust on property obtained by a fiduciary by virtue of his\n                        office. In that case a solicitor acting for trustees rescued the interests\n                        of the trust in a private company by negotiating for a takeover bid in which\n                        he himself took an interest. He acted in good faith throughout andthe information which the solicitor obtained about the company\n                            in the takeover bid could never have been used by the\n                            trustees. Nevertheless the solicitor was held to be a\n                        constructive trustee by a majority in the House of Lords because the\n                        solicitor obtained the information which satisfied him that the purchase of\n                        the shares in the takeover company would be a good investment and the\n                        opportunity of acquiring the shares as a result of acting for certain\n                        purposes on behalf of the trustees; seeperLord Cohen, at p. 103. If a fiduciary acting honestly and in good faith andmaking a profit which his principal could not make\n                            for himselfbecomes a constructive trustee of that profit\n                        then it seems to their Lordships that a fiduciary acting dishonestly and\n                        criminally who accepts a bribe and thereby causes loss and damage to his\n                        principal must also be a constructive trustee and must not be allowed by any\n                        means to make any profit from his wrongdoing. [emphasis added] On the contrary, it would be wrong to allow NTL to retain ownership of\n                    the proceeds of the sale of the misappropriated chips in excess of the value of\n                    the crushed chips, even if there is the expectation that they may be confiscated\n                    from him on the application of the PP. NTL’s right of retention must be\n                    considered separately from the liability to confiscation. If nothing is retained\n                    by NTL, there will be nothing to confiscate from him. 60     Thirdly, it was submitted that Centillion\n                    “has not adduced any evidence as to the losses that it suffered”\n                    from NTL’s actions.[note: 6]Two responses can be made to the submission. Firstly, there can be no doubt that\n                    when NTL misappropriated the chips, Centillion suffered loss, at the minimum, of\n                    the value of the misappropriated chips. Secondly, and more importantly, loss is\n                    not a requirement for a constructive trust, as was made clear by Morritt LJ in\n                    the English Court of Appeal decision ofUnited Pan-Europe v\n                        Deutsche Bank[2000] 2 BCLC 461 at [47] as follows: 47.    … [T]he object of the … imposition\n                            of a constructive trust is to ensure that the defaulting fiduciary does\n                            not retain the profit; it is not to compensate the beneficiary for any\n                            loss. … Although Morritt LJ was referring to constructive trusts of\n                    theAG v Reidtype, the same principle (that no\n                    proof of loss is required) applies to constructive trusts\n                generally. 61     Fourthly, the PP took issue that\n                    “Centillion has failed to adduce any evidence as [sic] to prove which of the computer chips belonged to the\n                    company at the time of misappropriation”,[note: 7]implying that NTL’s\n                    liability for breach of trust and the formation of any constructive trust should\n                    be restricted to misappropriated chips which belonged to Centillion. That is a\n                    departure from the basis of these confiscation proceedings that the PP is\n                    pursuing. The PP, in his first set of written submissions, stated that he made\n                    the application on the following ground:[note: 8] 6.    ... [NTL] had committed criminal breach of trust as\n                            a servant ... by misappropriating computer chips sent to [Centillion]\n                            for crushing. He repacked and sold these chips to buyers overseas and\n                            received a total sum of over US$50 million as payment for the\n                            goods. In other words, the PP was stating that NTL had committed breach\n                    of trust as a servant of Centillion in respect of all the chips which were\n                    misappropriated and sold. The quoted statement correctly states that the offence\n                    is constituted by a misappropriation that followed after an entrustment of\n                    property. Neither the entrustment nor the misappropriation was conditional on\n                    Centillion being the owner of the chips. It was sufficient that Centillion had\n                    possession and control of the chips at that time and had entrusted them to NTL.\n                    The same reasoning holds true for a finding in relation to a constructive trust:\n                    it was not necessary for Centillion to have owned the chips for me to find that\n                    NTL held them on trust for Centillion. 62     In any event, the PP’s position was not\n                    that Centillion did not own the chips at the times of misappropriation. His\n                    position was that while he was satisfied that Centillion had paid the chip\n                    manufacturers for the chips and that title in the chips passed upon payment, he\n                    was unable to establish if the chips were misappropriated before or after\n                    Centillion had paid for them (and therefore obtained title over them). In such a\n                    situation s 112 of the Evidence Act (Cap 97, 1997 Rev Ed) applies.\n                    This section provides that: 112. When the question is whether any person\n                        is owner of anything of which he is shown to be in possession, the burden of\n                        proving that he is not the owner is on the person who affirms that he is not\n                        the owner. As the chips were misappropriated while they were in\n                    Centillion’s possession, Centillion was deemed to be the\n                owner. 63     The PP also put up an argument based on policy\n                    considerations, namely that:[note: 9] g.    There is the wider policy consideration that a\n                            finding of a constructive trust on the terms sought by Centillion will\n                            undermine the confiscation regime established by the CDSA as criminals\n                            can exploit this by structuring their activities such that the benefits\n                            they obtained from their claims can be recovered by their nominees\n                            through the legal fiction of a “constructive\n                            trust”. There was no explanation or elaboration of criminals’\n                    alleged ability to exploit or take advantage of constructive trusts. More\n                    pertinently, the PP was not saying that NTL could exploit the mechanism of a\n                    constructive trust on the facts because he clearly could not. Properties falling\n                    under a constructive trust would go to Centillion’s creditors under its\n                    scheme of arrangement: none of them would have gone to NTL. In my view the\n                    relevant policy considerations favour Centillion’s creditors, who have a\n                    right to claim against Centillion’s assets, rather than the State, which\n                    would receive any realised property as a windfall.",
        "Findings on TBH’s application": "64     TBH asserted an interest in the 60% share of a\n                    house at 95A Paya Lebar Crescent. That 60% share was registered in the name of\n                    his sister TCH, with TBH being the registered owner of the other 40% of the\n                    property, but the PP was only seeking to realise TCH’s 60% share of the\n                    property. The basis of TBH’s claim was straightforward. He claimed that\n                    there was an agreement between him and TCH that she held her 60% share on trust\n                    for him. 65     In an affidavit filed on 21 October 2008\n                    TBH explained the history of the acquisition of the property: 4.    … The said property was purchased in June\n                            2002 for $1.25 million. It was purchased in my name and that of my\n                            sister [TCH] as Tenants-in-Common. My sister held a 60% share in the\n                            property whilst I held a 40% share in the said property. It was agreed\n                            that out mother will have the absolute right to spend the remaining\n                            years of her life there and together with the other siblings and we\n                            would do all that was necessary to give her a good life. I was required\n                            to pay a deposit of 20% of the purchase price of $1.25 million i.e.\n                            approximately $250,000.00 with the balance to be raised from a bank in\n                            the form of a loan. Another $300,000.00 to $400,000.00 was needed on\n                            renovation works. Since the entire sum was quite substantial, I\n                            requested my sister [TCH] for financial help and she\n                        agreed. 5.    My sister [TCH] extended to me a loan of\n                            $150,000.00 and I forked out about S$100,000.00 to pay the initial\n                            deposit of approximately $250,000.00. I paid the stamp fees. In the\n                            course of finalizing the loan for the said property it became apparent\n                            also that I alone would not qualify for the loan quantum and had to have\n                            another sibling’s name inserted as co-owner and\n                        borrower. 6.    Under those circumstances, parameters and\n                            undertakings were agreed. [TCH] and I were named by the Thor family to\n                            be the legal owners of the said property as well as borrowers liable for\n                            the mortgage of the said property to the bank. Thus, [TCH] and I have a\n                            legal and moral obligation by virtue of our undertakings and agreements\n                            to our siblings to protect the interest of the property for the benefit\n                            of our mother and the Thor family. Since [TCH] was married into a family\n                            which was financially sound, she was the obvious choice with no fear of\n                            her turning around in future to assert her rights as a legal\n                            owner. 7.    Although she had a 60% share in the property, she\n                            did not contribute towards the monthly instalments. It was a family\n                            arrangement based on mutual trust. I have been paying all the monthly\n                            instalments and my sister [TCH] did not make any monetary contribution\n                            at all. The home was for my mother, my siblings and myself to stay and I\n                            can say my sister [TCH] has no beneficial interest in the property\n                            because I had already settled the debt of S$150,000.00 owed to my\n                            sister, referred to in paragraph 5, when my business in Hong Kong\n                            flourished. It was merely a family arrangement made to protect our\n                            mother’s position in a home meant for the Thor family. I did not\n                            anticipate that this family arrangement would place me and my family\n                            members in such a predicament. In this affidavit, TBH did not assert that he held a beneficial\n                    interest in the 60% share of the property registered under TCH’s name. He\n                    only went so far as to say (at para 12) that TCH “has no beneficial\n                    interest whatsoever in the said property”. 66     TBH’s mother See Siew Geok\n                    (“See”) also gave evidence to support his claim. She filed an\n                    affidavit in which she revealed the Thor family’s concern over TBH’s\n                    girlfriend/future wife: 9.    Although my daughter [TCH] had a 60% share in the\n                            property, she did not contribute towards the initial deposit and/or\n                            towards the monthly instalments. It was a family arrangement based on\n                            mutual trust. My son, [TBH] have been paying all the monthly instalments\n                            and my daughter [TCH] did not make any monetary contributions at all.\n                            The home was for me and my children to stay and I can say my daughter\n                            [TCH] has no beneficial interest in the property since [TBH] had already\n                            repaid the $150,000.00 loan taken from [TCH]. It was merely a family\n                            arrangement made to ensure that I would have a home till I die. We\n                            certainly did not anticipate that this family arrangement would place us\n                            in such a predicament. 10.    Last but not least, my son [TBH] who then had a\n                            steady girlfriend was contemplating to marry her. All sorts of things\n                            went through my mind and the minds of my other children including a\n                            lurking fear that should their marriage fail, his wife would put a claim\n                            to the property which belongs to the Thor family. Another compelling\n                            reason for including [TCH] as a 60% legal owner was, in the event\n                            [TBH’s] future wife asserts her influence over him, resulting in\n                            [TBH] failing to fulfil his undertakings and responsibilities towards my\n                            family. In the circumstances, our concern was [TBH’s] future wife.\n                            In the event she asserts her rights, there would be the possibility of\n                            her ousting me and the rest of my family from the said\n                        property. In her affidavit, See also did not say that TBH was the beneficial\n                    owner of TCH’s registered 60% share in the property. 67     When TBH gave oral evidence in court he\n                    claimed full beneficial ownership over the property. At that stage, he was\n                    referred to his mother’s affidavit and the concern over his\n                    girlfriend/future wife’s claim to the property, and the following\n                    clarification was obtained from him:[note: 10] Court:… Look, so you said your mother say\n                                            because of reservations about your girlfriend, so\n                                            she’ll put this into---put this share into the\n                                            name of your sister. Correct?Witness:Yes.Court:And what is the purpose of doing\n                                            that?Witness:And it was---I had---I did not have\n                                            sufficient fund at the time. And also my mother was\n                                            worried about my girlfriend’s---the rela---the\n                                            relationship between myself and my\n                                        girlfriend.Court:Now, I know we have been hearing that so\n                                            often. Now I have to put it to you, but I put it to you\n                                            in the mildest form possible. Is the purpose of that so\n                                            that if anything went wrong in your relationship with\n                                            your girlfriend, your girlfriend would not be able to\n                                            claim this share that is in the name of your\n                                            sister?Witness:Yes.Court:Let me repeat. So this is so to make sure\n                                            that your girlfriend would---cannot put her hands onto\n                                            your sister’s share, in---in---in common\n                                            terms---cannot lay her hands on your sister’s\n                                            share?Witness:Yes.Court:If that is the case, witness, then the\n                                            shares given to your sister was intended to be real,\n                                            real ownership, not trust....Witness:Yes.   Counsel for TBH did not seek any clarification or qualification from\n                    him in re-examination, and this evidence was not contradicted by See when she\n                    gave evidence. 68     In the face of TBH’s clear admission\n                    that his intention was for TCH to have full beneficial ownership of her 60%\n                    share of the property, he cannot have any beneficial interest in that 60%\n                    share.",
        "My orders": "",
        "On the PP’s application": "69     After having considered the evidence adduced\n                    and the issues raised by the parties, my orders were as follows: (a)     I certified that the properties in\n                        the List of Realisable Properties (Appendix B) were realisable\n                        properties; (b)     The\n                        PP was to have liberty to apply for further confiscation or realisation\n                        orders (i) if fresh evidence is available on other properties, or (ii) upon\n                        the production of admissible and sufficient evidence from Wee on the shares\n                        and money held in the name of Ventures Trust (if this is done, the\n                        consequence will be that the shares and money, which Tok has confirmed are\n                        traceable to the proceeds of sale of the misappropriated chips, will not be\n                        realisable as Centillion will have a constructive trust interest in them\n                        (see[52]above)); (c)     I ordered costs to the PP to be paid\n                        by NTL. I declined to issue a certificate under\n                    s 10(2) of the CDSA on the amount recoverable under the confiscation order\n                    because the amount would only be known after the realisation process is\n                    completed, at which point the amount recovered can be determined. 70     I did not make the other orders sought by the\n                    PP because a receiver should be appointed for the realisable property as\n                    provided in s 19(3) of the CDSA which empowers the court to appoint the\n                    Public Trustee or any person as receiver in respect of realisable property. When\n                    a receiver is appointed, further orders may be obtained under s 19(1) to\n                    empower the receiver to realise the properties and generally to complete the\n                    realisation process.",
        "On UYH’s application": "71     I declared that the money in UYH’s bank\n                    accounts corresponding to para 5.18 of OS 785/2008 was not realisable property,\n                    and I ordered costs to UYH to be paid by the PP.",
        "On TBH’s application": "72     I dismissed TBH’s application and I\n                    ordered costs to the PP to be paid by TBH.",
        "On Centillion’s application": "73     I declared that Centillion held a beneficial\n                    interest under a constructive trust in the properties listed in the List of\n                    Constructive Trust Properties (Appendix C), and ordered that Centillion was to\n                    have half the costs of its application (as it had failed in its claim based on a\n                    judgment debt but succeeded on its claim based on constructive trust), to be\n                    paid by the PP.",
        "Costs considerations": "74     Strenuous submissions were made on behalf of\n                    the PP that the PP should not be ordered to pay costs. The thrust of the\n                    submissions was, firstly, that the PP was discharging his legal duty when he\n                    filed the confiscation proceedings. Secondly, it was submitted that throughout\n                    the proceedings the PP had acted reasonably and in good faith. 75     Although this was not stated expressly, the PP\n                    was essentially relying on the principle enunciated inBaxendale-Walker v Law Society[2008] 1 WLR 426\n                        (“Baxendale-Walker”), a decision\n                    of the English Court of Appeal.Baxendale-Walkerwas discussed and applied by the Court of Appeal inLaw\n                        Society of Singapore v Top Ten Entertainment Pte Ltd[2011] 2 SLR\n                    1279 (“Top Ten”). 76     The facts ofBaxendale-Walkerwere as set out in the headnote of the report\n                    of the case: The Law Society [of England and Wales] instigated disciplinary proceedings\n                        against the solicitor in the Solicitors Disciplinary Tribunal. One of the\n                        two allegations of conduct unbefitting a solicitor was not proved but the\n                        second was admitted and the tribunal found the solicitor guilty of\n                        unbefitting conduct and suspended him from practice for three years.\n                        Pursuant to section 47(2) of the Solicitors Act 1974, the tribunal made an\n                        order that the Law Society pay 30% of the solicitor’s costs of the\n                        proceedings since the first allegation had not been proved and a greater\n                        proportion of the solicitor’s costs had been incurred in defending\n                        that allegation. The solicitor appealed to the Divisional Court of the\n                        Queen’s Bench Division against the sentence of suspension from\n                        practice. The Law Society cross-appealed against the order for costs. The\n                        Divisional Court dismissed the solicitor’s appeal but allowed the Law\n                        Society’s cross-appeal and ordered the solicitor to pay 60% of the Law\n                        Society’s cost, holding that the principles relating to costs in\n                        proceedings brought in the public interest in exercise of regulatory\n                        functions differed from those which applied to ordinary civil\n                        litigation. 77     Section 47(2) of the Solicitors’ Act\n                    1974 (c 47) (UK) provides that: (2)    … [O]n the\n                            hearing of any application or complaint made to the tribunal under this\n                            Act ... the tribunal shall have power to make such order as it may think\n                            fit, and any such order may in particular include provision for any of\n                            the following matters — ... (i) the payment by any party of costs or a contribution towards costs\n                            of such amount as the tribunal may consider reasonable. The discretion that the tribunal has to order costs is\n                    broad, with no requirement that costs should generally follow the\n                event. 78     InBaxendale-Walker, Sir Igor Judge P stated at [34] that: 34    … [T]he Law Society has an independent\n                            obligation of its own to ensure that the [Solicitors Disciplinary\n                            Tribunal] is enabled to fulfil its statutory responsibilities. The\n                            exercise of this regulatory function places the Law Society in a wholly\n                            different position to that of a party to ordinary civil litigation. The\n                            normal approach to costs decisions in such litigation—dealing with\n                            it very broadly, that properly incurred costs should follow the\n                            “event” and be paid by the unsuccessful party—would\n                            appear to have no direct application to disciplinary proceedings against\n                            a solicitor. He also stated at [39]\n                    that: 39    … Unless the complaint is improperly\n                            brought, or, for example, proceeds as it did inGorlov'scase [2001] ACD 393, as a “shambles from\n                            start to finish”, when the Law Society is discharging its\n                            responsibilities as a regulator of the profession, an order for costs\n                            should not ordinarily be made against it on the basis that costs follow\n                            the event. The “event” is simply one factor for\n                            consideration. It is not a starting point. There is no assumption that\n                            an order for costs in favour of a solicitor who has successfully\n                            defeated an allegation of professional misconduct will automatically\n                            follow. One crucial feature which should inform the tribunal’s\n                            costs decision is that the proceedings were brought by the Law Society\n                            in exercise of its regulatory responsibility, in the public interest and\n                            the maintenance of proper professional standards. For the Law Society to\n                            be exposed to the risk of an adverse costs order simply because properly\n                            brought proceedings were unsuccessful might have a chilling effect on\n                            the exercise of its regulatory obligations, to the public disadvantage.\n                            ... 79     InTop Ten, a\n                    client of a solicitor made a complaint to the Law Society of Singapore. An\n                    Inquiry Committee formed by the Law Society recommended that the Council of the\n                    Law Society dismiss the complaint and impose a $500 fine on the solicitor. The\n                    Council accepted the Inquiry Committee’s recommendations. The client\n                    applied for a review of the Council’s decision under s 96(1) of the\n                    Legal Profession Act (Cap 161, 2001 Rev Ed) (“LPA”). The\n                    judge hearing the review application directed the Law Society to apply to the\n                    Chief Justice to appoint a disciplinary tribunal to investigate the\n                    solicitor’s conduct and ordered the Law Society to pay half of the\n                    client’s costs of the review. 80     The judge made the costs order against the Law\n                    Society under s 96(4) of the LPA, which provided that: (4)    At the hearing of\n                            the application, the Judge may make an order — (a) affirming the determination of the\n                            Council; or (b) directing the Society to apply to\n                            the Chief Justice for the appointment of a Disciplinary Tribunal, and such order for the payment of costs as may be just. The Law Society appealed against the costs order. In the judgment of\n                    the Court of Appeal delivered by Chan Sek Keong CJ, he stated at [24] that the principle enunciated inBaxendale-Walker(as set out in the quotations\n                    above at[78]) would apply to the Law\n                    Society if it was acting as a regulating body because: 24    … When performing regulatory functions which\n                            they are charged to do, public bodies should be protected from having to\n                            pay costs unless they are proved to have acted in bad faith or are\n                            guilty of gross dereliction. In our view,Baxendale-Walkerenunciates a salutary\n                        principle. The Court of Appeal went on to hold that the Law Society was\n                    acting as a regulating body. 81     However, that did not dispose of the costs\n                    question. The Court also considered the effect of O 59 r 3(2) of the\n                    Rules of Court (Cap 322, R5, 2006 Rev Ed) (“Rules of\n                    Court”), which provides that: (2)    If the Court in the exercise of its discretion\n                            sees fit to make any order as to the costs of or incidental to any\n                            proceedings,the Court shall, subject to\n                            this Order,order the costs to follow the\n                                event, except when it appears to the Court that in the\n                            circumstances of the case some other order should be made as to the\n                            whole or any part of the costs. [emphasis added] and came to the following conclusion at [34]: 34    ... [W]e do not think Pt VII of the LPA affects the\n                            rationale of theBaxendale-Walkerprinciple or its application to the Law Society in any way,unless O 59 r 3(2) of the Rules of Court governs the issue\n                                of costs with respect to proceedings under Pt VII.\n                            In our view, disciplinary proceedings against advocates and solicitors\n                            under the LPA are specialised forms of inquisitorial proceedings with\n                            adversarial elements (before the IC and the DT) and judicial proceedings\n                            (before the judge and the court of 3 Judges of the Supreme Court)to which the Rules of Court are not\n                                applicablebecause they are not civil proceedings as\n                            defined in those Rules. Hence, O 59 r 3(2) does not apply to Pt VII of\n                            the LPA. In any case,it is not necessary to apply O\n                                59 r 3(2)because Pt VII of the LPA provides a\n                            comprehensive framework for disciplinary proceedings, and provides in ss\n                            93(2A), 95(3), 96(4), 97(4), 100(6) and 103(3) a comprehensive costs\n                            regime with respect to such proceedings. … [emphasis\n                            added] 82     The Court referred to another decision of the\n                    English Court of Appeal,R (Perinpanathan) v City of\n                        Westminster Magistrates’ Court and another[2010]\n                    1 WLR 1506 (“Perinpanathan”). This case also dealt with the question of\n                    costs, but on facts which were more akin to those in the present case. WhileTop TenandBaxendale-Walkerdealt with costs in disciplinary proceedings\n                    against solicitors,Perinpanathandealt with costs\n                    in proceedings for the forfeiture of property under the English Proceeds of\n                    Crime Act 2002 (c 29) (UK). 83     The facts ofPerinpanathanwere as set out in the headnote of the report of\n                    the case: The claimant’s daughter, aged 15, flew from London to Singapore with\n                        a bag containing over £150,000 in cash which had been packed by the\n                        claimant, who ran a foreign exchange business. On arrival in Singapore the\n                        daughter was refused entry. She returned to London where the police seized\n                        and detained the cash under the Proceeds of Crime Act 2002 on the basis that\n                        there were reasonable grounds to suspect that it was intended for use in\n                        unlawful conduct, namely terrorism. The Commissioner of Police for the\n                        Metropolis applied under section 298 of the 2002 Act for the forfeiture of\n                        the cash. The magistrates dismissed that application, accepting evidence\n                        produced by the claimant that the cash had been intended for lawful\n                        purposes, but refused to make an order for costs under section 64 of the\n                        Magistrates’ Courts Act 1980 on the basis that the police had had\n                        reasonable grounds for their suspicion that the cash had been intended for\n                        use in unlawful conduct, both when seizing the cash and when applying for\n                        its forfeiture. The claimant sought judicial review of the\n                        magistrates’ decision to make no order as to costs, but did not\n                        challenge the finding that the police had had reasonable grounds for their\n                        suspicion throughout. The Divisional Court dismissed the claimant’s\n                        claim for judicial review. 84     As explained at [11]–[12] ofPerinpanathan, the Magistrates’ Court\n                    had the power to award costs for such proceedings under s 64(1) of the\n                    Magistrates’ Court Act 1980 (c 43) (UK) (“MCA”), which\n                    states: (1)    On the hearing of a\n                            complaint, a magistrates’ court shall have power in its discretion\n                            to make such order as to costs– (a) on making the order for which the complaint is made, to be paid by\n                            the defendant to the complainant; (b) on dismissing the complaint, to be paid by the complainant to the\n                            defendant, as it thinks just and reasonable ... 85     The court inPerinpanathanapplied theBaxendale-Walkerprinciple and dismissed the claimant’s\n                    appeal. However, Stanley Burnton LJ set out the following caveat to the\n                    principle at [40]: 40    … A successful private party to proceedings\n                            to which the principle applies may none the less be awarded all or part\n                            of his costs if the conduct of the public authority in question\n                            justifies it. … Lord Neuberger of Abbotsbury MR elaborated on this caveat at\n                        [77]: 77    The effect of our decision is that a person in the\n                            position of the claimant, who has done nothing wrong, may normally not\n                            be able to recover the costs of vindicating her rights against the\n                            police in proceedings under section 298 of the 2002 Act, where the\n                            police have behaved reasonably. In my view, this means that magistrates\n                            should exercise particular care when considering whether the police have\n                            acted reasonably in a case where there is an application for costs\n                            against them under section 64. It would be wrong to invoke the wisdom of\n                            hindsight or to set too exacting a standard, but, particularly given the\n                            understandable resentment felt by a person in the position of the\n                            claimant if no order for costs is made, and the general standards of\n                            behaviour that can properly be expected from the police,it must be right to scrutinise their behaviour in relation\n                                to the seizure, the detention, and the confiscation proceedings,\n                                with some care when deciding whether they acted reasonably and\n                                properly. [emphasis added] 86     The position under s 64(1) of the MCA in\n                    relation to forfeiture proceedings is that while a Magistrates’ Court can\n                    make costs orders as it thinks just and reasonable, the police are protected\n                    against costs in unsuccessful forfeiture applications if they had behaved\n                    reasonably during the proceedings. If they had behaved unreasonably that\n                    protection would not apply. This qualification to theBaxendale-Walkerprinciple is appropriate to ensure that the\n                    forfeiture powers of a public authority are used reasonably and properly, and if\n                    they are not, costs may be ordered. If unreasonableness in the conduct of\n                    forfeiture proceedings can result in an order of costs in cases where theBaxendale-Walkerprinciple applies,\n                    unreasonable conduct would carry even more weight in proceedings where the\n                    governing rule states that costs should generally follow the\n                event. 87     The CDSA does not contain any specific costs\n                    provisions. In terms of procedure under the CDSA generally, s 62 provides\n                    that: 62.    Rules of Court may\n                            provide for the manner in which proceedings under this Act may be\n                            commenced or carried on. An order in the Rules of Court, O 89A, caters specifically\n                    for proceedings under the CDSA. All the applications in the present case were\n                    regulated by this order. Order 89A rule 2 deals with applications for\n                    confiscation orders, O 89A r 3 deals with applications for the protection\n                    of the rights of third parties, and O 89A r 9 deals with the realisation of\n                    property. It is quite clear that O 89A regulates applications for\n                    confiscation and realisation orders. As the Rules of Court govern applications\n                    under the CDSA, O 59 would regulate the award of costs in such\n                    proceedings. 88     There was no question that the PP was\n                    performing a public function in making an application under the CDSA against NTL\n                    and in relation to properties connected to him. However, for the reasons stated\n                    above, in the circumstances the starting point on costs in this case was that\n                    costs follow the event, as prescribed in O 59 r 3(2) of the Rules of Court.\n                    That, however, was only the starting point: it did not have to be adhered to if\n                    the circumstances justified a departure. The fact that the PP was carrying out\n                    his public duty to proceed under the CDSA against NTL was a relevant factor, but\n                    it was not a conclusive factor. The manner in which the PP dealt with the\n                    applications of UYH and Centillion also had to be considered. The PP’s\n                    conduct of the proceedings had to be reasonable for me to consider not awarding\n                    costs against him, but as I have noted above (egat[43]–[44]and[57]–[63]), some of\n                    the positions taken by the PP fell short of that. That led to the continuation\n                    of hearings which may have been unnecessary if a more careful approach had been\n                    taken. In the circumstances, it was appropriate that costs be ordered to follow\n                    the event.",
        "APPENDIX A": "",
        "PP’s List of Realisable Assets": "5.1    All monies in the following bank\n                    accounts: (i)First Commercial Bank account no. [xxx]\n                            maintained under the name of Ng Teck Lee;(ii)First Commercial Bank account no. [xxx]\n                            maintained under the name of Ng Teck Lee General Trading;(iii)First Commercial Bank account no. [xxx]\n                            maintained under the name of Ng Teck Lee General Trading;5.2    The following insurance policies owned by\n                    Ng Teck Lee:(i)issued by Prudential Assurance Co. Singapore\n                            (Pte) Ltd under(a)policy no. 25133226 (life assured: Ng\n                                    Teck Lee);(b)policy no. 25143031 (life assured: Ng\n                                    Teck Lee);(c)policy no. 28413364 (life assured: Ng\n                                    Jing Ling); and(ii)issued by American International Assurance\n                            Company, Limited under(a)policy no. L518369929 (life assured: Ng\n                                    Teck Lee);(b)policy no. L520798973 (life assured: Ng\n                                    Teck Lee);(c)policy no. L524635207 (life assured: Ng\n                                    Teck Lee);(d)policy no. L525304304 (life assued: Ng\n                                    Teck Lee);(e)policy no. Q515688182 (life assured: Ng\n                                    Teck Lee);5.3    All monies in the following bank accounts\n                    maintained under the names of Ng Teck Lee and/or Thor Chwee Hwa:(i)Post Office Savings Bank (“POSB”)\n                            account no. [xxx];(ii)Oversea-Chinese Banking Corporation Limited\n                            (“OCBC”) account no. [xxx];(iii)The Hongkong and Shanghai Banking Corporation\n                            Limited (“HSBC”) account no. [xxx];(iv)United Overseas Bank Limited\n                            (“UOB”) account no. [xxx];(v)UOB account no. [xxx];5.4    The sum of S$4,517,143.40 which was paid\n                    into court on 26 October 2006 related to receipt no. W951664 being the\n                    balance of the proceeds of sale of 49A Binjai Park, Singapore 589851, which was\n                    jointly owned by Ng Teck Lee and Thor Chwee Hwa;5.5    The sum of S$1,112,522.85 which was paid\n                    into court on 10 December 2007 related to receipt no. W951903 being the\n                    balance of the proceeds of sale of 97 Paya Lebar Crescent, Singapore 536181,\n                    which was jointly owned by Ng Teck Lee and Thor Chwee Hwa and the interest\n                    accrued on the balance of the proceeds of sale up to 10 December\n                    2007;5.6    All monies in the following bank accounts\n                    maintained under the name of Thor Chwee Hwa:(i)POSB account no. [xxx];(ii)DBS Bank Ltd (“DBS”) account no.\n                            [xxx];(iii)OCBC account no. [xxx];5.7    The following insurance policies owned by\n                    Thor Chwee Hwa:(i)issued by Prudential Assurance Co. Singapore\n                            (Pte) Ltd under(a)policy no. 24385788 (life assured: Thor\n                                    Chwee Hwa);(b)policy no. 24986885 (life assured: Thor\n                                    Chwee Hwa);(c)policy no. 25146273 (life assured: Thor\n                                    Chwee Hwa);(d)policy no. 25726397 (life assured: Thor\n                                    Chwee Hwa);(e)policy no. 27513609 (life assured: Thor\n                                    Chwee Hwa);(f)policy no. 28855486 (life assured: Thor\n                                    Chwee Hwa);(g)policy no. 29554546 (life assured: Thor\n                                    Chwee Hwa);(ii)issued by The Great Eastern Life Assurance\n                            Company Limited under policy no. PN 28297221 (life assured: Thor Chwee\n                            Hwa);(iii)issued by American International Assurance\n                            Compay, Limited under(a)policy no. L519846878 (life assured: Thor\n                                    Chwee Hwa);(b)policy no. L520798986 (life assured: Thor\n                                    Chwee Hwa);5.8    The sum of S$932,696.56 which was paid into\n                    court on 17 November 2005 related to receipt W951512 being the balance of\n                    the proceeds of sale of 84 Binjai Park, Singapore 589879, which was jointly\n                    owned by Thor Chwee Hwa and See Siew Geok;5.9    Thor Chwee Hwa’s 60% share in the\n                    property 95A Paya Lebar Crescent, Singapore 536180;5.10       All monies in the following bank\n                    accounts:(i)POSB account no. [xxx] maintained under the name\n                            of Gan Chin Chin (minus the sum of S$500 and all accrued interest on the\n                            sum of S$500 from 28 January 2005 to the date the balance monies are\n                            paid out from the account by POSB to the State);(ii)the sums of S$363,288.87 and $3,469.45 paid into\n                            the Accountant General’s Department from Merrill Lynch, Pierce,\n                            Fenner & Smith Incorporated account no. [xxx];5.11       2,300,000 Global Voice Group Ltd shares in\n                    Gan Chin Chin’s Central Depository (“CDP”) account no.\n                    [xxx];5.12       The Defendant’s right to recover from\n                    Gan Chin Chin the repayment of a loan of S$3,496,678.37;5.13       All monies in UOB account no. [xxx]\n                    maintained under the name of Holinone International Pte Ltd;5.14       2,000,000 Interra Resources Limited shares\n                    in Ever Equal Limited’s CDP account no. [xxx];5.15       The following shares in Kwok Seng\n                    Hwa’s CDP account no. [xxx]:(i)380,000 China Enersave Ltd shares;(ii)250,000 NTI International Limited\n                        shares;5.16       All monies in POSB account no. [xxx]\n                    maintained under the name of Kwok Seng Hwa;5.17       All monies in the UOB account no. [xxx]\n                    maintained under the name of Integrated Recycling Industries (S) Pte\n                Ltd;5.18       All monies in the following bank accounts\n                    maintained under the name of Ung Yoke Hooi:(i)Standard Chartered Bank account no.\n                        [xxx];(ii)Standard Chartered Bank account no.\n                            [xxx];(iii)DBS account no. [xxx];(iv)DBS account no. [xxx];(v)DBS account no. [xxx];5.19       The following shares held by Goh Lik\n                    In(i)in Goh Lik In’s CDP account no.\n                            [xxx]:(a)3,605,000 Global Voice Group Limited\n                                    shares;(b)279,000 Citiraya Industries Ltd (now\n                                    known as Centillion Environment & Recycling Ltd)\n                                    shares;(ii)in Goh Lik In’s margin account no. [xxx]\n                            with UOB Kay Hian Pte Ltd:(a)1,630,000 Global Voice Group Limited\n                                    shares;(iii)in Goh Lik In’s margin account no. [xxx]\n                            with OCBC Securities Pte Ltd:(a)350,000 Addvalue Technologies Ltd\n                                    shares;(b)500,000 China Enersave Ltd shares (and\n                                    151,125 China Enersave Ltd W110112);(c)86,000 ISG Asia Ltd (now known as\n                                    Indofood Agri Resources Ltd) shares;(d)300,000 KLW Holdings Ltd\n                                shares;(e)250,000 NTI International Limited\n                                    shares;(f)4,256,000 Santak Holdings Ltd\n                                    shares;5.20       The sum of S$592,652.30 plus all accrued\n                    interest thereon from 19 October 2004 to the date all monies are paid out\n                    from the account by OCBC to the State in OCBC account no. [xxx] maintained under\n                    the name of Goh Lik In;5.21       7,400,000 China Enersave Ltd shares (and\n                    2,236,650 China Enersave Ltd W110112) in HL Bank account no. [xxx] maintained\n                    under the name of Horrison Capital Ltd;5.22       All monies in DBS account no. [xxx]\n                    maintained under the name of China Far East International Enterprises Pte\n                    Ltd;5.23       All monies in OCBC account no. [xxx]\n                    maintained under the name of United Excess Pte Ltd;5.24       All monies in POSB account no. [xxx]\n                    maintained under the name of Ng Lai Heng;5.25       All monies in UOB account no. [xxx]\n                    maintained under the name of Maxta Computer Pte Ltd;5.26       (4,500,000 ÷ 6,633,360\n                        × 100) percent of 29,600,000 China Enersave Ltd shares\n                    (and 8,946,000 China Enersave Ltd W110112) in Ventures Trust Pte Ltd’s CDP\n                    account no. [xxx];5.27       The sum of S$149,000 in DBS account no.\n                    [xxx] maintained under the name of Ventures Trust Pte Ltd; and5.28       Deposit number 7727 in the OCBC client\n                    account no. [xxx] of M/s Allen & Gledhill LLP.APPENDIX BList of Realisable PropertiesReference in Appendix APropertyFinding5.1 (i)All monies in First Commercial Bank\n                                            account no. [xxx] maintained under the name of Ng Teck\n                                            LeeRealisable property under definition (a)\n                                            in s 2.5.1 (ii)All monies in First Commercial Bank\n                                            account no. [xxx] maintained under the name of Ng Teck\n                                            Lee General TradingRealisable property under definition (a)\n                                            in s 2.5.1 (iii)All monies in First Commercial Bank\n                                            account no. [xxx] maintained under the name of Ng Teck\n                                            Lee General TradingRealisable property under definition (a)\n                                            in s 2.5.2 (i) (a)Prudential Assurance Co. Singapore (Pte)\n                                            Ltd under policy no. 25133226 (life assured: Ng Teck\n                                            Lee)Realisable property under definition (a)\n                                            in s 2.5.2 (i) (b)Prudential Assurance Co. Singapore (Pte)\n                                            Ltd under policy no. 25143031 (life assured: Ng Teck\n                                            Lee)Realisable property under definition (a)\n                                            in s 2.5.2 (i) (c)Prudential Assurance Co. Singapore (Pte)\n                                            Ltd under policy no. 28413364 (life assured: Ng Jing\n                                            Ling)Realisable property under definition (a)\n                                            in s 2.5.2 (ii) (a)American International Assurance Company,\n                                            Limited under policy no. L518369929 (life assured: Ng\n                                            Teck Lee)Realisable property under definition (a)\n                                            in s 2.5.2 (ii) (b)American International Assurance Company,\n                                            Limited under policy no. L520798973 (life assured: Ng\n                                            Teck Lee)Realisable property under definition (a)\n                                            in s 2.5.2 (ii) (c)American International Assurance Company,\n                                            Limited under policy no. L524635207 (life assured: Ng\n                                            Teck Lee)Realisable property under definition (a)\n                                            in s 2.5.2 (ii) (d)American International Assurance Company,\n                                            Limited under policy no. L525304304 (life assured: Ng\n                                            Teck Lee)Realisable property under definition (a)\n                                            in s 2.5.2 (ii) (e)American International Assurance Company,\n                                            Limited under policy no. Q515688182 (life assured: Ng\n                                            Teck Lee)Realisable property under definition (a)\n                                            in s 2.5.3 (i)All monies in Post Office Savings Bank\n                                            (“POSB”) account no.\n                                    [xxx]Ng Teck Lee’s half share of these\n                                            properties is realisable property under definition (a)\n                                            in s 2.Thor Chwee Hwa’s half\n                                            share of these properties is not realisable property\n                                            under definition (b) in s 2 because she had not\n                                            received any gift caught by the Act from Ng Teck Lee as\n                                            defined in s 12(8).5.3 (ii)All monies in Overseas-Chinese Banking\n                                            Corporation Limited (“OCBC”) account no.\n                                            [xxx]5.3 (iii)All monies in The Hongkong and Shanghai\n                                            Banking Corporation Limited (“HSBC”)\n                                            account no. [xxx]5.3 (iv)All monies in United Overseas Bank Limited\n                                            (“UOB”) account no.\n                                    [xxx]5.3 (v)All monies in UOB account no.\n                                        [xxx]5.4Proceeds of sale of 49A Binjai Park,\n                                            Singapore 589851 (jointly owned by Ng Teck Lee and Thor\n                                            Chwee Hwa)5.5Proceeds of sale of 97 Paya Lebar\n                                            Crescent, Singapore 536181 (jointly owned by Ng Teck Lee\n                                            and Thor Chwee Hwa)5.10 (i)All monies in POSB account no. [xxx] in\n                                            the name of Gan Chin ChinRealisable property under definition (a)\n                                            in s 2.5.12The Defendant’s right to recover\n                                            from Gan Chin Chin the repayment of a loan of\n                                            S$3,496,678.37Realisable property under definition (a)\n                                            in s 2.5.16All monies in POSB account no. [xxx]\n                                            maintained under the name of Kwok Seng\n                                    HwaRealisable property under definition (a)\n                                            in s 2.5.19 (i) (b)279,000 Citiraya Industries Ltd (now known\n                                            as Centillion Environment & Recycling Ltd) shares in\n                                            Goh Lik In’s CDP account no.\n                                    [xxx]Realisable property under definition (a)\n                                            in s 2.5.19 (ii) (a)1,630,000 Global Voice Group Limited\n                                            shares in Goh Lik In’s margin account no. [xxx]\n                                            with UOB Kay Hian Pte LtdRealisable property under definition (a)\n                                            in s 2.5.19 (iii) (a)350,000 Addvalue Technologies Ltd shares\n                                            in Goh Lik In’s margin account no. [xxx] with OCBC\n                                            Securities Pte LtdRealisable property under definition (a)\n                                            in s 2.5.19 (iii) (b)500,000 China Enersave Ltd shares (and\n                                            151,125 China Enersave Ltd W110112) in Goh Lik\n                                            In’s margin account no. [xxx] with OCBC Securities\n                                            Pte LtdRealisable property under definition (a)\n                                            in s 2.5.19 (iii) (c)86,000 ISG Asia Ltd (now known as Indofood\n                                            Agri Resources Ltd) shares in Goh Lik In’s margin\n                                            account no. [xxx] with OCBC Securities Pte\n                                        LtdRealisable property under definition (a)\n                                            in s 2.5.19 (iii) (d)300,000 KLW Holdings Ltd shares in Goh Lik\n                                            In’s margin account no. [xxx] with OCBC Securities\n                                            Pte LtdRealisable property under definition (a)\n                                            in s 2.5.19 (iii) (e)250,000 NTI International Limited shares\n                                            in Goh Lik In’s margin account no. [xxx] with OCBC\n                                            Securities Pte LtdRealisable property under definition (a)\n                                            in s 2.5.19 (iii) (f)4,256,000 Santak Holdings Ltd shares in\n                                            Goh Lik In’s margin account no. [xxx] with OCBC\n                                            Securities Pte LtdRealisable property under definition (a)\n                                            in s 2.5.28Deposit number 7727 in the OCBC client\n                                            account of M/s Allen & Gledhill\n                                    LLPRealisable property under definition (a)\n                                            in s 2.APPENDIX CList of Constructive Trust PropertiesReference in Appendix AProperty5.10 (ii)All monies in Merrill Lynch International\n                                            Bank Ltd account no. [xxx]5.112,300,000 Global Voice Group Ltd shares in\n                                            Gan Chin Chin’s Central Depository\n                                            (“CDP”) account no.\n                                    [xxx]5.13All monies in UOB account no. [xxx]\n                                            maintained under the name of Holinone International Pte\n                                            Ltd5.142,000,000 Interra Resources Limited shares\n                                            in Ever Equal Limited’s CDP account no.\n                                            [xxx]5.15 (i)380,000 China Enersave Ltd shares in Kwok\n                                            Seng Hwa’s CDP account no.\n                                    [xxx]5.15 (ii)250,000 NTI International Limited shares\n                                            in Kwok Seng Hwa’s CDP account no.\n                                        [xxx]5.17All monies in UOB account no. [xxx]\n                                            maintained under the name of Integrated Recycling\n                                            Industries (S) Pte Ltd5.19 (i) (a)3,605,000 Global Voice Group Limited\n                                            shares in Goh Lik In’s CDP account no.\n                                            [xxx]5.20The sum of $592,652.30 plus all accrued\n                                            interest thereon from 19 October 2004 in OCBC\n                                            account no. [xxx] maintained under the name of Goh Lik\n                                            In5.217,400,000 China Enersave Ltd shares (and\n                                            2,236,650 China Enersave Ltd W110112 shares) in HL Bank\n                                            account no. [xxx] maintained under the name of Horrison\n                                            Capital Ltd5.22All monies in DBS account no. [xxx]\n                                            maintained under the name of China Far East\n                                            International Enterprises Pte Ltd5.23All monies in OCBC account no. [xxx]\n                                            maintained under the name of United Excess Pte\n                                            Ltd5.24All monies in POSB account no. [xxx]\n                                            maintained under the name of Ng Lai\n                                    Heng5.25All monies in UOB account no. [xxx]\n                                            maintained under the name of Maxta Computer Pte\n                                            Ltd[note: 1]Affidavit of Fong Wai Kit filed 10 June 2008, at paras\n                                13–15.[note: 2]Affidavit of Fong Wai Kit filed 10 June\n                                2008 at para 77.[note: 3]Centillion’s written submissions dated 16 May\n                                2011 at para 51.[note: 4]Attorney-General’s Reply Submissions dated 13 June\n                                        2011 at para 51.[note: 5]Attorney-General’s Reply\n                                Submissions dated 13 June 2011 at para 54.[note: 6]Attorney-General’s Reply\n                                Submissions dated 13 June 2011 at para 56.[note: 7]Attorney-General’s Reply Submissions dated 13 June 2011 at\n                                para 70.[note: 8]Attorney-General’s Written Submissions dated 6 May 2011 at\n                                para 6.[note: 9]Attorney-General’s Reply Submissions dated 13 June 2011 at\n                                para 71(g).[note: 10]Cross-examination of Thor Beng Huat on 26 January 2011, p 39 at\n                                line 32 to p 40 at line 23.",
        "APPENDIX B": "",
        "List of Realisable Properties": "Reference in Appendix APropertyFinding5.1 (i)All monies in First Commercial Bank\n                                            account no. [xxx] maintained under the name of Ng Teck\n                                            LeeRealisable property under definition (a)\n                                            in s 2.5.1 (ii)All monies in First Commercial Bank\n                                            account no. [xxx] maintained under the name of Ng Teck\n                                            Lee General TradingRealisable property under definition (a)\n                                            in s 2.5.1 (iii)All monies in First Commercial Bank\n                                            account no. [xxx] maintained under the name of Ng Teck\n                                            Lee General TradingRealisable property under definition (a)\n                                            in s 2.5.2 (i) (a)Prudential Assurance Co. Singapore (Pte)\n                                            Ltd under policy no. 25133226 (life assured: Ng Teck\n                                            Lee)Realisable property under definition (a)\n                                            in s 2.5.2 (i) (b)Prudential Assurance Co. Singapore (Pte)\n                                            Ltd under policy no. 25143031 (life assured: Ng Teck\n                                            Lee)Realisable property under definition (a)\n                                            in s 2.5.2 (i) (c)Prudential Assurance Co. Singapore (Pte)\n                                            Ltd under policy no. 28413364 (life assured: Ng Jing\n                                            Ling)Realisable property under definition (a)\n                                            in s 2.5.2 (ii) (a)American International Assurance Company,\n                                            Limited under policy no. L518369929 (life assured: Ng\n                                            Teck Lee)Realisable property under definition (a)\n                                            in s 2.5.2 (ii) (b)American International Assurance Company,\n                                            Limited under policy no. L520798973 (life assured: Ng\n                                            Teck Lee)Realisable property under definition (a)\n                                            in s 2.5.2 (ii) (c)American International Assurance Company,\n                                            Limited under policy no. L524635207 (life assured: Ng\n                                            Teck Lee)Realisable property under definition (a)\n                                            in s 2.5.2 (ii) (d)American International Assurance Company,\n                                            Limited under policy no. L525304304 (life assured: Ng\n                                            Teck Lee)Realisable property under definition (a)\n                                            in s 2.5.2 (ii) (e)American International Assurance Company,\n                                            Limited under policy no. Q515688182 (life assured: Ng\n                                            Teck Lee)Realisable property under definition (a)\n                                            in s 2.5.3 (i)All monies in Post Office Savings Bank\n                                            (“POSB”) account no.\n                                    [xxx]Ng Teck Lee’s half share of these\n                                            properties is realisable property under definition (a)\n                                            in s 2.Thor Chwee Hwa’s half\n                                            share of these properties is not realisable property\n                                            under definition (b) in s 2 because she had not\n                                            received any gift caught by the Act from Ng Teck Lee as\n                                            defined in s 12(8).5.3 (ii)All monies in Overseas-Chinese Banking\n                                            Corporation Limited (“OCBC”) account no.\n                                            [xxx]5.3 (iii)All monies in The Hongkong and Shanghai\n                                            Banking Corporation Limited (“HSBC”)\n                                            account no. [xxx]5.3 (iv)All monies in United Overseas Bank Limited\n                                            (“UOB”) account no.\n                                    [xxx]5.3 (v)All monies in UOB account no.\n                                        [xxx]5.4Proceeds of sale of 49A Binjai Park,\n                                            Singapore 589851 (jointly owned by Ng Teck Lee and Thor\n                                            Chwee Hwa)5.5Proceeds of sale of 97 Paya Lebar\n                                            Crescent, Singapore 536181 (jointly owned by Ng Teck Lee\n                                            and Thor Chwee Hwa)5.10 (i)All monies in POSB account no. [xxx] in\n                                            the name of Gan Chin ChinRealisable property under definition (a)\n                                            in s 2.5.12The Defendant’s right to recover\n                                            from Gan Chin Chin the repayment of a loan of\n                                            S$3,496,678.37Realisable property under definition (a)\n                                            in s 2.5.16All monies in POSB account no. [xxx]\n                                            maintained under the name of Kwok Seng\n                                    HwaRealisable property under definition (a)\n                                            in s 2.5.19 (i) (b)279,000 Citiraya Industries Ltd (now known\n                                            as Centillion Environment & Recycling Ltd) shares in\n                                            Goh Lik In’s CDP account no.\n                                    [xxx]Realisable property under definition (a)\n                                            in s 2.5.19 (ii) (a)1,630,000 Global Voice Group Limited\n                                            shares in Goh Lik In’s margin account no. [xxx]\n                                            with UOB Kay Hian Pte LtdRealisable property under definition (a)\n                                            in s 2.5.19 (iii) (a)350,000 Addvalue Technologies Ltd shares\n                                            in Goh Lik In’s margin account no. [xxx] with OCBC\n                                            Securities Pte LtdRealisable property under definition (a)\n                                            in s 2.5.19 (iii) (b)500,000 China Enersave Ltd shares (and\n                                            151,125 China Enersave Ltd W110112) in Goh Lik\n                                            In’s margin account no. [xxx] with OCBC Securities\n                                            Pte LtdRealisable property under definition (a)\n                                            in s 2.5.19 (iii) (c)86,000 ISG Asia Ltd (now known as Indofood\n                                            Agri Resources Ltd) shares in Goh Lik In’s margin\n                                            account no. [xxx] with OCBC Securities Pte\n                                        LtdRealisable property under definition (a)\n                                            in s 2.5.19 (iii) (d)300,000 KLW Holdings Ltd shares in Goh Lik\n                                            In’s margin account no. [xxx] with OCBC Securities\n                                            Pte LtdRealisable property under definition (a)\n                                            in s 2.5.19 (iii) (e)250,000 NTI International Limited shares\n                                            in Goh Lik In’s margin account no. [xxx] with OCBC\n                                            Securities Pte LtdRealisable property under definition (a)\n                                            in s 2.5.19 (iii) (f)4,256,000 Santak Holdings Ltd shares in\n                                            Goh Lik In’s margin account no. [xxx] with OCBC\n                                            Securities Pte LtdRealisable property under definition (a)\n                                            in s 2.5.28Deposit number 7727 in the OCBC client\n                                            account of M/s Allen & Gledhill\n                                    LLPRealisable property under definition (a)\n                                            in s 2.",
        "APPENDIX C": "",
        "List of Constructive Trust Properties": "Reference in Appendix AProperty5.10 (ii)All monies in Merrill Lynch International\n                                            Bank Ltd account no. [xxx]5.112,300,000 Global Voice Group Ltd shares in\n                                            Gan Chin Chin’s Central Depository\n                                            (“CDP”) account no.\n                                    [xxx]5.13All monies in UOB account no. [xxx]\n                                            maintained under the name of Holinone International Pte\n                                            Ltd5.142,000,000 Interra Resources Limited shares\n                                            in Ever Equal Limited’s CDP account no.\n                                            [xxx]5.15 (i)380,000 China Enersave Ltd shares in Kwok\n                                            Seng Hwa’s CDP account no.\n                                    [xxx]5.15 (ii)250,000 NTI International Limited shares\n                                            in Kwok Seng Hwa’s CDP account no.\n                                        [xxx]5.17All monies in UOB account no. [xxx]\n                                            maintained under the name of Integrated Recycling\n                                            Industries (S) Pte Ltd5.19 (i) (a)3,605,000 Global Voice Group Limited\n                                            shares in Goh Lik In’s CDP account no.\n                                            [xxx]5.20The sum of $592,652.30 plus all accrued\n                                            interest thereon from 19 October 2004 in OCBC\n                                            account no. [xxx] maintained under the name of Goh Lik\n                                            In5.217,400,000 China Enersave Ltd shares (and\n                                            2,236,650 China Enersave Ltd W110112 shares) in HL Bank\n                                            account no. [xxx] maintained under the name of Horrison\n                                            Capital Ltd5.22All monies in DBS account no. [xxx]\n                                            maintained under the name of China Far East\n                                            International Enterprises Pte Ltd5.23All monies in OCBC account no. [xxx]\n                                            maintained under the name of United Excess Pte\n                                            Ltd5.24All monies in POSB account no. [xxx]\n                                            maintained under the name of Ng Lai\n                                    Heng5.25All monies in UOB account no. [xxx]\n                                            maintained under the name of Maxta Computer Pte\n                                            Ltd    [note: 1]Affidavit of Fong Wai Kit filed 10 June 2008, at paras\n                                13–15. [note: 2]Affidavit of Fong Wai Kit filed 10 June\n                                2008 at para 77. [note: 3]Centillion’s written submissions dated 16 May\n                                2011 at para 51. [note: 4]Attorney-General’s Reply Submissions dated 13 June\n                                        2011 at para 51. [note: 5]Attorney-General’s Reply\n                                Submissions dated 13 June 2011 at para 54. [note: 6]Attorney-General’s Reply\n                                Submissions dated 13 June 2011 at para 56. [note: 7]Attorney-General’s Reply Submissions dated 13 June 2011 at\n                                para 70. [note: 8]Attorney-General’s Written Submissions dated 6 May 2011 at\n                                para 6. [note: 9]Attorney-General’s Reply Submissions dated 13 June 2011 at\n                                para 71(g). [note: 10]Cross-examination of Thor Beng Huat on 26 January 2011, p 39 at\n                                line 32 to p 40 at line 23."
    }
}