{
    "case_title": "Zac. T Engineering Pte Ltd\n      v\n      GTMS Construction Pte Ltd",
    "ncitation": "[2011] SGHC 62",
    "coram": "Quentin Loh J",
    "sections": {
        "Brief Factual Background": "2       The Plaintiff carries on the business of\n                    building and construction. It is alleged, and it is not denied, that it does not\n                    have an office as such and it is a ‘one-man’ company run by one Tam\n                    Kok Wah, (“Tam”). The Defendant also carries on the business of\n                    building and construction but is a somewhat larger company, established around\n                    1990 and it was represented by its director, Dennis Tan Chong Keat,\n                    (“Tan”), a civil engineer by training. 3       Tam and Tan are known to each other, having\n                    previously worked together in a joint venture company called GTM Cornett JV or\n                    at GTM International (it matters not which) in the 1980s, where Tan was a site\n                    engineer and Tam was a general foreman. 4       The Defendant appointed the Plaintiff as its\n                    subcontractor in two projects: (a)     ThePunggol\n                            Project– which comprised the external works of a\n                        4-storey Primary School at Edgedale Plain. The Plaintiff took over from the\n                        original subcontractor for the external works, Keywinds Engineering &\n                        Consruction Pte Ltd, (“Keywinds”). The Defendant issued a\n                        letter of appointment dated 17 August 2007 to the Plaintiff. These works\n                        were completed on or about 30 May 2008 without any sign-off on the final\n                        accounts. (b)     TheClementi Project– this involved\n                        upgrading works to Blocks 315 to 320 at Clementi Avenue 4. The subcontract\n                        was awarded by a letter of award dated 3 January 2008. These works were to\n                        be carried out from January to October 2008. A subcontract in writing was\n                        subsequently issued. The Defendant’s reliance on these subcontract\n                        terms and conditions was denied by the Plaintiff, who merely put the\n                        Defendant to strict proof but advanced no positive case whether these terms\n                        and conditions or any particular term or condition formed or did not form\n                        part of the contract between them. It is not disputed\n                    that these subcontracts were awarded to the Plaintiff because of Tam’s\n                    previous relationship with Tan. 5       Disputes unfortunately arose between the parties\n                    on both these projects. The Plaintiff claims a total of $799,776.23, comprising\n                    the following sums: (a)     $433,275.22 in respect of the Punggol\n                        Project; and (b)     $366,501.01 in respect of the Clementi Project. The\n                    Plaintiff complains that there was under-valuation of the work it had done, that\n                    the Defendant had failed to make proper and timely interim payments under both\n                    projects and that the Defendant repudiated the Clementi contract by persistently\n                    failing to make payments under both the Punggol and Clementi projects. The\n                    Plaintiff alleges that it was finally constrained to issue a letter dated 8\n                    December 2008 to the Defendant giving it notice that its refusal to make the\n                    necessary payments would prevent the Plaintiff from continuing with the Clementi\n                    Project works without the “minimum funds”, and that if payment was\n                    not made within the next 3 days, it would have no alternative but to stop work.\n                    When no payment was made, the Plaintiff stopped work at the Clementi Project\n                    taking the view that the Defendant had repudiated the contract. 6       These allegations are denied by the Defendant\n                    who contends that for the Punggol Project it was only completed with the\n                    substantial financial assistance from the Defendant; the Plaintiff was not able\n                    to provide or supply sufficient labour, material and/or machinery and/or funds\n                    to do so. The Defendant alleges that it had to supply,inter\n                        alia, substantial quantities of concrete, reinforcement bars and\n                    wire mesh to the Plaintiff to enable it to complete its work. The Plaintiff\n                    agreed to the Defendant supplying and backcharging the Plaintiff for the same\n                    and there were considerable sums due and owing from the Plaintiff to the\n                    Defendant as a result of the same. The Defendant points to the Clementi\n                    contract, a contract which was entered into at a later point in time, where it\n                    is specifically provided that the Defendant was to supply the Plaintiff with\n                    material set out in an Appendix (mainly concrete, reinforcement bars, wire mesh,\n                    building material and items like uniform, clothing, gloves, etc.) at fixed\n                    rates, and such sums were to be deducted from the Plaintiff’s payments or\n                    to be recovered as a debt together with an administration charge of 15% over\n                    actual cost and expenses incurred by the Defendant. 7       The Defendant alleges that the Plaintiff also\n                    had problems with his workers and their payment. The Plaintiff had a total\n                    change of skilled carpenters and benders 5 times since September 2008, their\n                    foreman was changed 4 times, it was always short on manpower and had poor\n                    control over its consumption of material supplied. The Plaintiff fell behind in\n                    the progress of their subcontract works and was in substantial delay by November\n                    and December 2008. It had caused knock-on delays to the Defendant’s\n                    downstream works which included architectural and landscaping\n                works. 8       The Defendant claims it never received the\n                    Plaintiff’s letter of 8 December 2008 and alleges it was a fabrication. It\n                    also alleges the Plaintiff walked off the site and stopped work without any\n                    justification. It failed to return to work after receiving due written notice\n                    dated 12 December 2008 issued under Clause 37.1 of the Subcontract Conditions\n                    for having wholly suspended carrying out of their subcontract works and failing\n                    to proceed regularly and diligently with the same. The Defendant issued a letter\n                    dated 6 January 2009 terminating the Clementi contract and entered the site to\n                    take over and complete the Plaintiff’s subcontract works. The Defendant\n                    counterclaims for loss, damage and expense as a result of the Plaintiff’s\n                    wrongful repudiation of the subcontract, backcharges, as well as claims for\n                    completion of the Clementi Project subcontract.",
        "Procedural History": "9       Before I go on to my grounds, I need to set out\n                    some procedural history and a limitation, by agreement of the parties, on appeal\n                    with respect to my findings on quantum of backcharges. 10     This is an unfortunate case which came up for\n                    hearing when it was not in a proper state of preparedness for trial. The\n                    pleadings left much to be desired,eg, the Punggol\n                    contract was pleaded as an oral contract without any reference to its terms. The\n                    Statement of Claim was all of 13 paragraphs and bereft of proper particulars or\n                    schedules showing the breakdowns. For example, the Plaintiff’s claim of\n                    $433,275.22 for the Punggol Project is pleaded, down to the cent, and repeated\n                    in Tam’s Affidavit of Evidence-in-Chief, (“AEIC”), as\n                    follows: Total value of works carried out under\n                                            contract:$1,112,980.36Total Amount of variation/additional\n                                            works:$40,714.00Add: GST – 7%\n                                    due:$80,758.61Minus:Amount paid GTMS as at\n                                                3rdNovember\n                                        2007:$801,177.75Grand Total owing:$433,275.22   The Defendant’s case is that the total value of works was\n                    $1,054,588.58, not $1,112,980.36. The variations amounted to $33,780.00 and not\n                    $40,714.00. There was no breakdown or Scott Schedule to show the component items\n                    or their costing, what was agreed and what was not, nor was there any attempt to\n                    show where the differences in quantum lay. The claims and counterclaims were\n                    similarly made up of numerous small sums, and no attempts had been made at\n                    setting them out in Scott Schedules.Building and\n                        construction cases of this nature, (which also includes shipbuilding or rig\n                        construction cases), should never come for trial in this state. It would\n                        result in unnecessary costs being borne by the parties and it behoves\n                        counsel to ensure that such time-consuming issues are streamlined for\n                        efficient resolution. 11     The one expert witness for the Plaintiff had\n                    recommended that for some disputed items in the Punggol Project, a joint\n                    measurement should be taken to agree upon quantities for work done.\n                    Inexplicably, that was not done or even attempted. The Plaintiff’s\n                    Affidavit and exhibits had numbering errors. There were also gross spelling and\n                    grammatical errors. Tam’s AEIC contained a bald assertion that the work\n                    was carried out on “... an agreed unit rate chargeable.” First,\n                    there could not have been onlyoneunit rate\n                    agreed upon. Secondly, nowhere does Tam assert in his AEIC what those unit rates\n                    are. Again, it is not pleaded that monthly progress claims were to be made or\n                    how it was to be carried out. Tam’s AEIC also refers to and exhibits\n                    summaries and tabulations of claims made but there were no supporting documents.\n                    There are allegations that joint measurements were taken, but none were put into\n                    the evidence. It is self evident that any trier of fact faces insurmountable\n                    obstacles in making findings of fact on this kind of evidence, or more\n                    correctly, the lack of it. Mr Thulasidas, counsel for the Defendant was not slow\n                    to emphasize this during the course of the trial and his\n                submissions. 12     I also asked counsel in chambers on the first\n                    day of the hearing why there were no Agreed Bundles of documents, at least\n                    agreed as to authenticity. Mr Magintharan, counsel for the Plaintiff informed me\n                    that he had found it impossible to do so in the short time available. I found\n                    that difficult to comprehend and told him so. Mr Magintharan then said that the\n                    Defendant’s documents, (ie, 5 Arch lever\n                    files of Defendant’s documents and 3 Arch level files for AEICs),\n                    “...were quite organised...” and he could use them. Mr Magintharan\n                    had his documents in separate bundles. This approach ends up in unnecessary\n                    duplication of documents. The trial proceeded with two sets of documents, agreed\n                    as to authenticity but not necessarily as to contents, except for the few that\n                    were disputed. 13     I ordered the parties in chambers on the first\n                    day of the hearing to: (a)     meet and sort out those items\n                        identified in the Plaintiff’s Expert’s report as items that\n                        could be measured and agreed upon, as well as 2 uncertified items – a\n                        600mm open drain with LD grating at $999 and a 900mm square sump HD cover at\n                        $1,050 – which could be easily confirmed by a site\n                    inspection; (b)     put\n                        together Scott Schedules for various aspects of their respective claims;\n                        and (c)     put up a\n                        proper list of issues. I also suggested, but did not\n                    insist, that they try and settle those small items below a certain value which\n                    would not make economic sense to litigate. There were innumerable small items,\n                    like 6 chin straps at $0.70 each totalling $4.20, 2 earplugs totalling $1.20, 1\n                    pair of safety boots at $36.80, 3 metal ‘planks’ totalling $72.00,\n                    etc. The Plaintiff’s expert also recommended the parties negotiate on\n                    certain rates and I asked parties to consider this too. I voiced my\n                    disappointment to both counsel that they had allowed this case to come up for\n                    hearing in such a sorry state. It would take up an unnecessary amount of court\n                    time and unjustifiably run up the costs for such a modest claim. However to be\n                    fair, I must record that Mr Thulasidas’ case was, except for those matters\n                    set out in this paragraph, in a fair enough shape for the hearing as compared to\n                    the Plaintiff’s. 14     During the course of the first tranche, I\n                    noted that the witnesses may not necessarily have personal knowledge of the\n                    documents, some of which were being disputed, and that there were numerous\n                    invoices, delivery orders, requests for materials, backcharge records and other\n                    documents that were generated or signed by persons who were not called as\n                    witnesses. There were also disputes on various signatures or initials on some\n                    documents but none of the makers were called as witnesses and there was no\n                    handwriting expert on hand to assist. The Plaintiff only had Tam and their\n                    Expert, one Yong Yew Chong, as witnesses and the Defendant only had Tan and\n                    their project manager for the Clementi Project, Koh Tat Weng,\n                    (“Koh”). Disputing such documents and arguing over the correctness\n                    of their contents during cross-examination would take up a disproportionate\n                    amount of trial time in relation to the quantum in dispute and end up being very\n                    costly for clients. I suggested, and I must emphasize without any coercion, that\n                    the parties could consider agreeing, as other parties had done in other\n                    construction cases before me, to my carrying out a binding adjudication on some\n                    of these disputed amounts, but it had to be on condition that I need not give\n                    reasons for my decision and that therefore the parties had to agree they would\n                    forego their right to appeal against such decisions on quantum. This is not an\n                    unusual procedure adopted in construction cases of this nature and especially in\n                    view of the foregoing. It is even adopted in non-construction arbitrations where\n                    quantum is a hotly contested or emotive issue and the parties see the advantage\n                    of cost savings in a binding adjudication or award, without reasons being given\n                    for the quantum or damages arrived at, so that there can be no further appeal or\n                    proceedings thereafter as the aim is to ensure finality. 15     I was pleasantly surprised that when the\n                    second tranche commenced some 10 days after the first tranche ended, counsel\n                    informed me that the parties had adopted my suggestion for a binding\n                    adjudication on the terms suggested by me and produced a signed agreement. By\n                    this time there was an Agreed List of Issues and broad agreement on several\n                    fronts that could cut down trial time. Mr Das had produced his side of the Scott\n                    Schedules with relevant information but unfortunately it did not contain the\n                    Plaintiff’s responses. 16     With such measures undertaken the parties were\n                    able to and did reach agreement on the claims and counterclaims for the Punggol\n                    Project. The Punggol\n                Project 17     For the Punggol Project, the parties had\n                    reached agreement as follows: (a)Total Contract Works,-\n                                            including Variations, agreed at:$1,113,368.58(b)Defendant’s backcharges agreed\n                                            (without GST) at:$ 185,000.00(c)Amount Paid to\n                                    Plaintiff:$ 801,177.74(d)Agreed outstanding sum due from Defendant\n                                            to Plaintiff: (inclusive of GST)$\n                                                192,176.64   This was of course subject to a set-off, if any, from any of the sums\n                    alleged to be due from the Plaintiff to the Defendant on the Clementi\n                    Project.",
        "The Clementi Project": "18     As for the Clementi Project, the parties had\n                    reached agreement on the following: (a)     The Parties had reduced their\n                        disputes into 10 Issues which required my decision. (b)     As for the\n                            10thissue, which was the quantum of the\n                        backcharges for the Clementi Contract, the parties had agreed to a binding\n                        adjudication where I would decide the quantum of the backcharges that the\n                        Defendant was entitled to claim against the Plaintiff. My decision thereon\n                        was to be: (i)       final, (ii)       may be without reasons,\n                            and (iii)       the parties agreed that there shall be no appeal against my\n                            decision on this issue. 19     Before I deal with the issues, I note that the\n                    evidence presented by both sides is woefully lacking. Witnesses with primary\n                    knowledge have not been called. Cross-examination was incomplete and a lot of\n                    the disputed areas were not properly covered. A lot of the documentation left\n                    much to be desired and I have been tasked to decide these issues on incomplete\n                    evidence and cross-examination. It is just as well that the quantum of\n                    backcharges was to be decided by binding adjudication on the terms set out at[18]. Most of the issues in this case\n                    fall to be decided on the burden of proof, and where relevant, the demeanour of\n                    witnesses and the relevant cross-examination that was carried out on the\n                    affidavits and documents.",
        "Issue 1:   Did the Plaintiff’s abandonment or suspension of\n                works on or about 12 December 2008 and thereafter amount to a repudiation of their\n                contract with the Defendant?": "20     As recounted above, the Defendant alleges the\n                    Plaintiff failed to proceed with due diligence, was unable to and/or failed to\n                    provide sufficient labour, had at times drastically reduced manpower on site\n                    without any reason or prior notification to the Defendant, had 5 changes of its\n                    skilled carpenters and bar benders and had changed foreman 4 times since\n                    September 2008, had failed to provide sufficient machinery, funds and/or\n                    material and were in substantial delay by December 2008. The Plaintiff merely\n                    denies all this and puts the Defendant to strict proof without putting forward\n                    any positive case other than stating that the Defendant’s constant\n                    under-certification and under payment, which they say was a repudiation by the\n                    Defendant, prevented the Plaintiff from carrying out or completing its works. On\n                    its pleadings, the Plaintiff says that they did carry out their work properly\n                    and averred that the “…alleged failure to carry out and complete\n                    the contractual works, additional and/or variation works by the Plaintiffs as\n                    alleged by the Defendants was caused wholly and/or substantially by the\n                    Defendants.” The Plaintiff futher averred that “…under the\n                    existing circumstances…” they carried out their works\n                    “...to the best of their abilities and despite severe restraints caused\n                    by the Defendants’ failure to make the necessary progress\n                    payments.” 21     The Plaintiff has not pleaded, as is often\n                    seen in construction disputes, that there were changes in the scope of works or\n                    abortive works caused by changes that caused a delay to their progress, or that\n                    they were delayed in sequencing of their works by the Defendant’s\n                    works. 22     Quite unusually there was no correspondence,\n                    site memos or other documents relating to the above allegations. I have come to\n                    the view, upon reviewing the evidence and hearing the witnesses that\n                    unfortunately this was the way these parties ran their subcontract. The only\n                    documentary evidence is as follows:- (a)     The Plaintiff’s letter dated 8\n                        December 2008. As noted above, the Defendant denies receiving any such\n                        letter. This letter states that it had not received payment for the Punggol\n                        and Clementi Projects and it had yet to receive the final certificate for\n                        the Punggol Project and payment of Payment Certificate No.10 for the\n                        Clementi Project. It had caused cash flow problems for the Plaintiff, and as\n                        such it was unable to operate without minimum funds and had to temporarily\n                        stop work at the Clementi site if it did not receive any payment within 3\n                        days from the date of the letter. (b)     The Plaintiff’s letter dated 12 December 2008\n                        referred to their letter of 8 December 2008 and stated that since the\n                        Defendant was ignoring their request for the release of payment for work\n                        done for Punggol Project which was completed in May 2008 and Payment\n                        Certificate No.10 for the Clementi Project, they had to temporarily deploy\n                        their workforce out from Clementi site to prevent further damage to their\n                        financial situation. (c)     The Defendant’s letter dated 12 December 2008, headed\n                        “Stoppage of Works on Site”, which recorded the\n                        Plaintiff’s failure to provide any workers and excavator on site in\n                        spite of the Plaintiff’s assurance to do so given that they were far\n                        behind schedule. It stated that the Plaintiff’s unilateral action to\n                        stop works would further jeopardize their already delayed works which they\n                        have been struggling over the last few months to cope with. It then listed\n                        the matters already recounted above,[6],[7]and[20]. It gave notice to the Plaintiff that their stoppage of\n                        works amounted to a repudiatory breach and required the Plaintiff to resume\n                        work on the side by 13 December 2008. Receipt of this letter is not denied\n                        by the Plaintiff. (d)     The Defendant’s letter dated 6 January 2009 notifying the\n                        Plaintiff that their subcontract was being terminated in accordance with\n                        Clause 37 of the Subcontract Conditions as they had abandoned the site since\n                        12 December 2008 and had refused to resume work despite the written notice\n                        of 12 December 2008 (referred to above). It also notified the Plaintiff that\n                        the Defendant would employ other subcontractors to complete their works, and\n                        any increase in cost, loss, expense and damages for delay in completion will\n                        be set off against any monies due or recovered from the Plaintiff as a debt.\n                        Receipt of this letter is not denied by the Plaintiff. 23     I set out my assessment on the reliability of\n                    the witness evidence later. At this juncture, I find and hold that on balance, I\n                    accept the evidence of the Defendant. (a)     First, the objective evidence shows\n                        the Plaintiff was in delay. The Plaintiff does not deny that its Contract\n                        Completion Date was 6 October 2008. As noted above, it is not part of the\n                        Plaintiff’s case that it was entitled to extensions to time and for\n                        loss and expense. By December 2008, the Plaintiff was well beyond contract\n                        completion and therefore in considerable delay. (b)     Secondly, the Plaintiff’s claim on its\n                        pleadings for the Punggol Project fails to acknowledge that material was\n                        supplied by the Defendant for the Plaintiff’s use to complete the\n                        project. The Plaintiff claims $1,112,980.36 for the total value of works\n                        carried out under the contract, variations of $40,714 and acknowledges\n                        $801,177.75 was paid to the Plaintiff by the Defendant as at 3 November\n                        2007. That was misleading. When settled, as noted above, the Plaintiff\n                        conceded and agreed to a not inconsiderable backcharge of $185,000. What the\n                        Plaintiff could not deny is that from Progress Payment Certificates\n                        Nos.1-15, it had agreed to backcharges set out in those certificates with a\n                        cumulative total of $242,352.52 (Certificate No.16 was the Final Certificate\n                        for the Punggol Project). The Plaintiff signified their agreement as to the\n                        contents by signing on each of these certificates. It is noteworthy that the\n                        Plaintiff’s Expert does not address this issue in his Expert’s\n                        Report. There can only be two reasons: (i) Tam did not tell his Expert of\n                        this fact, or (ii) the Expert was told but, for reasons best known to him,\n                        omitted this very important fact. Insofar as it is necessary, I find it is\n                        the former. Neither alternative does the Plaintiff’s case any good at\n                        all. The Plaintiff’s claim under the Punggol Project for $433,275.22\n                        was an over exaggeration by a significant enough margin, bearing in mind\n                        there was no claim for loss and expense, but ‘hard’ items\n                        against measurable quantities. In the Clementi Project, the Plaintiff\n                        similarly agreed to cumulative backcharges of $115,460.22 in Certificate of\n                        Payment No. 9, (October 2008), by signing on the same. Yet at trial they\n                        disputed every cent. On the 1stday of trial,\n                        they conceded – a figure of $25,610.78 and, I am told by Mr Das that a\n                        few days later, admitted $80,000 of backcharges. This was even though the\n                        written contract for the Clementi Project clearly set out that material\n                        would be supplied to the Plaintiff on terms. (c)     Thirdly, there certainly was proof that the\n                        Defendant had to supply or assist in the purchase not only of material like\n                        rebars, concrete and wire mesh, but a whole host of items like tools,\n                        clothing and hardware. This was the undeniable evidence. It is entirely out\n                        of character for a main contractor to supply its external works\n                        subcontractor with items like tools (including bow saws and blades, sanding\n                        and cutting discs), equipment, various pvc pipes, heavy duty polyfoam,\n                        polythene sheets, blue canvas, Hilti chemicals, timber (eg, 2-inch x 1-inch x 8 foot and 3-inch x 2-inch x 8 foot\n                        keruing wood), plywood, black ink for carpentry (these three items being for\n                        its formwork), clothing (like trousers and rain jackets), helmets, inner\n                        liners, cotton gloves, safety goggles, yellow safety boots, and even items\n                        like 2 inch, 2.5 inch, concrete and common nails and galvanised wire. For\n                        the Punggol Project, not only had the Plaintiff had conveniently failed to\n                        refer to the backcharges, it had also failed to explain how it is that the\n                        Defendant had to supply it concrete, rebars or wire mesh for the\n                        Plaintiff’s subcontract works. (d)     Fourthly, I accept the evidence of the Defendant,\n                        especially Koh, who was on site as the project manager and whose evidence\n                        went largely unchallenged - that the Plaintiff did not pay their workers\n                        regularly and there were times when their workers wanted to go on strike and\n                        stop work (see[41]below). (e)     Fifthly, I\n                        also accept the evidence of the Defendant, both documentary and oral, that\n                        it received letters from the Ministry of Manpower over a claim by an\n                        employeevizMr Chua Yam Seng who worked for\n                        the Plaintiff at the Punggol Project, that he had not been paid for June\n                        2008. Because the Plaintiff was not registered with the CIDB, it did not\n                        have the local-foreign staff ratio to hire foreign workers (the Plaintiff\n                        did not even have a secretary). Accordingly, and I accept the\n                        Defendant’s evidence on this score, I find that the Defendant\n                        notionally hired 5 workers under their entitlement but to all intents and\n                        purposes, these 5 workers were those of the Plaintiff. The agreement was\n                        that the Plaintiff would pay the levy and all costs incurred by the\n                        Defendant as well as their wages. I accept the Defendant’s evidence\n                        that the Plaintiff failed to reimburse the Defendant’s for the\n                        workers’ levy it paid for the 6 months from September 2008 to February\n                        2009. 24     This brings me to one of Tam’s lies on\n                    which he was caught out. There was evidence of letters from the Defendant to the\n                    Plaintiff demanding reimbursement of these unpaid worker’s levy for\n                    September 2008 to February 2009. However, Tam’s contention was that these\n                    were the Plaintiff’s workers seconded to the Defendant and that they were\n                    being returned to the Plaintiff after termination on 12 December 2008. When I\n                    asked Tam whether these workers were nonetheless under his full supervision and\n                    control prior to 12 December 2008, he conceded that they were. During\n                    Tan’s cross-examination, Tan produced (Exhibit “D-2” and\n                    “D-3”), documents and letters to show that the workers were\n                    actually from Keywinds Construction, a company in which Tam had worked before as\n                    a Project Manager, and it was Tam who requested for a transfer of employment\n                    from Keywinds to the Defendant under the arrangement referred to above. The\n                    evidence showed that after termination, these workers followed the Plaintiff and\n                    worked on another third party site where the Plaintiff had been engaged to carry\n                    out work. This showed up Tam’s lie in claiming that these workers were no\n                    longer with him. I made it a condition to letting in these new documents that\n                    Tam be given the opportunity to go back on to the stand. The Defendant also\n                    offered the Plaintiff the opportunity to put Tam back on the stand to answer\n                    these documents, but Tam did not avail himself of that offer to clear the air.\n                    This was not all there was. There was also evidence to show that the Defendant\n                    made payment to 9 of the Plaintiff’s Chinese workers for 10 and 11\n                    December 2008 through payment vouchers, (1.DBA.1795 to 1802). There was also\n                    evidence of other workers who had not been paid. 25     Because of the evidence, and also as a result\n                    of my assessment of the witnesses’ evidence, which I deal with below, I\n                    make the following findings of fact: (a)     the Plaintiff was in financial\n                        difficulty, which was not of the Defendant’s doing, and the Plaintiff\n                        had difficulty providing sufficient labour, machinery and materials to keep\n                        up with its work and was not proceeding with due diligence in the Clementi\n                        Project; (b)     the\n                        Plaintiff was not able to apply enough resources and consequently was in\n                        delay which were not of the Defendant’s doing; (c)     the Defendant had to supply or assist\n                        with purchases of, eg, concrete, rebars and wire mesh as well as other items\n                        like tools and equipment, gloves, wood and hardware; (d)     in the Clementi Project, the parties\n                        agreed that the Defendant would supply such items as concrete, reinforcement\n                        mesh and reinforcement bars at fixed rates and backcharge or deduct these\n                        sums as a debt from the Plaintiff (See Clause 9, Particular Specifications,\n                        “TKW-1”, p.105, Clause 33 at p.109 imposition of an\n                        administrative charge of 15% and Appendix 3 at p.155); (e)     in the Clementi Project, the Defendant\n                        supplied and paid for substantial quantities of concrete, reinforcement mesh\n                        and rebars, as well as, but not limited to, other material and items like\n                        tools, equipment, clothing, wood and hardware. These were supplied pursuant\n                        to the Plaintiff’s requests made over the course of the project, and\n                        the Defendant had to exercise restraint to its detriment in the account\n                        balance between the parties to help keep the Plaintiff afloat and complete\n                        the project. To this end, the Defendant had to withhold charging the full\n                        back charges to enable some money to be paid to the Plaintiff periodically\n                        to keep them going; (f)     through the Plaintiff’s poor site control and supervision,\n                        there was an over consumption of such material relative to the work done on\n                        site; and, (g)     the\n                        Plaintiff also used material supplied by the Defendant for the Punggol\n                        Project. 26     The Plaintiff’s excuse that they were\n                    not being paid on the Punggol Project, being starved of cash flow and\n                    under-certification of their works, is not a valid reason in law for suspending\n                    works on the Clementi Project, even if it were true. In any case, I have found\n                    the Plaintiff’s excuse to be unfounded on the evidence. There are clear\n                    authorities to the effect that unless there is an express provision in the\n                    contract to do so, there is no general right to suspend works for the failure of\n                    the employer/main contractor to make progress payments. One need look no further\n                    than Halsbury’s Laws of Singapore, Vol. 2, (Building & Construction),\n                    para.30.310 at pg.387; Hudson’s Building and Engineering Contracts\n                        (11thEd.) pp.623-625, paras. 4.223 and 4.224;Jia Min Building & Construction Pte Ltd v Ann Lee Pte\n                        Ltd[2004] 3 SLR(R) 288, citingLubenham\n                        Fidelities & Investments Co Ltd v South Pembroke Shire District\n                        Council(1986) 33 BLR 46; andHua Khian\n                        Ceramics Tiles Supplies Pte Ltd v Torie Construction Pte Ltd[1991] 2 SLR(R) 901 andHiap Tian Soon Construction Pte Ltd\n                        & Anor V Hola Development Pte Ltd & Anor[2003] 1 SLR(R)\n                    667.A fortiori, there is no general right to\n                    suspend works if the under or non-payment is for a different\n                project. 27     I do not think it necessary to make a finding\n                    whether the Plaintiff’s letters of 8 and 12 December 2008 were a\n                    fabrication or not. Even if they were not, this would not change the position at\n                    law. However, as this matter is on appeal, I would have found on balance that\n                    they were made up after the fact and were not sent to the Defendant at the\n                    relevant time. My grounds for doing so are my assessment of the evidence above,\n                    and more importantly my assessment of the evidence of the respective witnesses\n                    which I set out below. 28     Having heard the witnesses and considered the\n                    evidence, I find as a matter of fact and law that the Plaintiff wrongfully\n                    suspended and abandoned the works in repudiation of the Clementi Contract on 12\n                    December 2008. This repudiatory breach by the Plaintiff was accepted by the\n                    Defendant on 6 January 2009.",
        "Issue 2:   Was the Defendant’s termination of the Plaintiff\n                on 6 January 2008 by reason of their abandonment or suspension of works\n                lawful?": "",
        "(i)   If so, what are the damages payable by the Plaintiff to the\n                Defendant?": "",
        "(ii)   If not, what are the damages payable by the Defendant to\n                the Plaintiff?": "29     The Defendant’s termination of the\n                    Plaintiff’s subcontract after giving due notice under the contract was\n                    lawful, and was a result of the Plaintiff’s wrongful suspension and\n                    abandonment of the works at the Clementi site. 30     It follows as a matter of law that the\n                    Plaintiff is liable to the Defendant for all loss and damage arising from their\n                    repudiatory breach of the contract. These damages include: (a)     the cost, loss and expense incurred\n                        by the Defendant in completing the Clementi project; (b)     any other loss and damage that\n                        resulted from the Plaintiff’s repudiatory breach of contract;\n                        and (c)     the\n                        Defendant is also entitled to set-off any backcharges, cross claims, claims\n                        in abatement or other counterclaims against any sums due to the\n                        Plaintiff.",
        "Issue 3:   Are the Plaintiffs entitled to reject the\n                Defendants’ backcharges simply because the Plaintiffs did not put up a\n                Material Requisition (“MR”) Form before the Defendants supplied\n                materials, tools etc to them?": "31     The Plaintiff contended that they were\n                    entitled to reject the Defendant’s backcharges on the basis that there\n                    were no Material Requisition Forms therefor and which were duly signed by the\n                    Plaintiff. The Plaintiff could not refer to any contractual provision to this\n                    effect. Having heard and considered the evidence, I find and hold that there is\n                    no contractual requirement or consistent practice that the Plaintiff was\n                    required to raise or sign a Material Requisition Form before the Defendant could\n                    raise a backcharge or before the Defendant was to deliver any material, tools or\n                    consumables to the Plaintiff. Moreover, this was not pleaded. Although this is\n                    an ‘agreed issue’ it is not covered by the Plaintiff’s\n                    pleadings. As noted above, the Plaintiff’s Reply and Defence to\n                    Counterclaim merely denied those portions of the Defence and Counterclaim in\n                    relation to the backcharges and put the Defendant to strict proof. The Plaintiff\n                    did not raise any positive case other than in paragraph 15 of its Reply and\n                    Defence to Counterclaim, where it alleged the cumulative backcharges were\n                    wrongfully and/or unilaterally imposed by the Defendant and were in any even\n                    manifestly excessive. The Plaintiff also pleaded that these backcharges were\n                    penalties and therefore unenforceable in law. These pleaded points were not\n                    taken up either in the evidence,eg, adducing\n                    evidence to show the prices charged were so manifestly high, or in final\n                    submissions. Nor were any authorities submitted in support of such a surprising\n                    contention that backcharges could be penalties and unenforceable. The answer to\n                    this issue is therefore ‘No.’",
        "Issue 4:   Did the Plaintiff carry out any work on the Clementi\n                Contract after 11 December 2008?": "32     Having heard the witnesses, including Mr\n                    Tam’s unconvincing answers in cross-examination on this issue and in\n                    general, and having considered the evidence, I find and hold that the Plaintiff\n                    wholly suspended works and had all but abandoned the site on the 12 December\n                    2008. Although the transcript does not bear this out clearly due to concurrent\n                    talking, when Tam was asked if his workers, his excavator and all his tools were\n                    still on site on the 12 December 2008, Tam’s answer was that he was and\n                    his excavator was still at site. He did not say they were all working on the 12\n                    December 2008. His manner and tone of answering that question was hesitant and\n                    unsure. In fact, he said at first that his last day of work was on 11 December.\n                    He then paused, seemed to reflect on it momentarily and then changed his mind\n                    and said it was in fact on the 12 December. I find and hold that no work was\n                    carried out on 12 December 2008 itself and no work was carried out on site by\n                    the Plaintiff after 11 December 2008. The answer to this issue is therefore\n                    ‘No.’",
        "Issue 5:   What is the value of work completed by the Plaintiffs\n                at the date the Clementi Contract was terminated by the Defendants on 6 January\n                2009?": "33     The Plaintiff claims that it completed work of\n                    up to $471,639.40 in value up to 12 December 2008. The Defendant denies this,\n                    alleging that the Plaintiff only completed $289,739.20 in value of its\n                    subcontract works as of 12 December 2008, comprising about 52% of their\n                    subcontract works. The Plaintiff’s expert, Mr Yong Yew Yong\n                    (“Yong”), a quantity surveyor by profession, valued the work done\n                    by the Plaintiff up to 12 December 2008 at $422,176.20. 34     No joint survey was carried out to agree on\n                    the state of the work done up to 12 December 2008. Tam alleges he did site\n                    measurements at the relevant time but no documents or evidence were put forward\n                    by him. I have no hesitation in rejecting his evidence on this score – if\n                    he did do as he alleged, I am sure he would have produced the relevant\n                    documentary evidence to back up his claim. Moreover, he would have made them\n                    available to his expert witness, Yong. What was available at the trial were two\n                    sets of photographs, one by each side, claiming that it showed the subcontract\n                    works as at 12 December 2008. 35     It is noteworthy that the Plaintiff has failed\n                    to produce any documents in support of its claim – no invoices, no payroll\n                    records, no DOs, no POs, no accounts, no site records, etc to substantiate its\n                    claim. What the Plaintiff has produced is Progress Claims, as noted above,\n                    unsupported by any documents. He candidly admitted this in cross-examination.\n                    Although the transcript records “(No audible answer)”, my notes\n                    record Tam as saying: “Agree no documents to support this.” Tam\n                    said whenever he made a progress claim, he did not put in any supporting\n                    documents. 36     Tam admitted that he had adduced no documents\n                    to substantiate any of his payment claims and the only evidence he relied upon\n                    was Yong’s evidence and the Defendant’s payment certificates when it\n                    suited him (which were, for the early COPs without documentary or other\n                    substantiation). I should perhaps mention at this juncture that some of these\n                    Progress Claims have different dates and different amounts. At least one was\n                    wrongly numbered. For example, COP 10 (dated 31 October 2008) given on 29 July\n                    2009 had the figure $88,043.56, but COP 10 (dated 30 November 2008) given on 13\n                    November 2009 had a figure of $348,473.37 as well as another corresponding to\n                    the earlier COP 10, and COP 10 (dated 30 October 2008) mentioned in Tam’s\n                    AEIC had reverted back to $88,043.56. 37     I now deal with the evidence of Yong, a\n                    quantity surveyor by profession and the Plaintiff’s expert. Having heard\n                    and considered the expert evidence of Yong on the valuation of work done by the\n                    Plaintiff up to 12 December 2008, I find him to be a less than satisfactory\n                    witness. (a)     As an expert, he held on to views\n                        that were clearly untenable, even when shown that his basis or assumptions\n                        were wrong. He was not objective and impartial as an expert should be. He\n                        was also hesitant at times and there were not a few unduly and uncomfortably\n                        long pauses before he answered. My finding is that he was not at all\n                        familiar and uncomfortable with some of the evidence he\n                    presented. (b)     To be\n                        fair, he was only instructed sometime in March 2010 and by this time all the\n                        Plaintiff’s subcontract works had long been completed. He worked off\n                        photographs supplied by the Plaintiff and two site inspections which were\n                        “...solely to appreciate a superficial view of the constructed works\n                        as compared with the Progress Photos...” with the\n                    Plaintiff. (c)     Yong did\n                        not do any measurement himself, generally applied quantities and rates which\n                        the Defendant gave him and accepted that he would not know, except for what\n                        the Defendant told him, whether any particular piece of finished work was\n                        carried out by the Defendant or some other party. He had to admit that he\n                        was not in a position to know whether the quantities in his report were true\n                        quantities; his answer in this respect was “I agree, because I did\n                        not go down to site to see.” (Transcript, 4 May 2010, pages 35, line\n                        16). He also gave a very feeble excuse for not going or suggesting to Tam\n                        that he should go on site to do measurements,viz, the drains were very extensive and they were covered.\n                        He admitted that as a quantity surveyor, there were ways of getting around\n                        such obstacles. (d)     I found it surprising that Yong did not include any HDB or JTC unit rates\n                        as comparison in his report. He admitted during cross-examination that he\n                        did not have these unit rates. These are common and well known unit rates in\n                        the building industry. They would at least be an approximate reference point\n                        for some of the kind of work being carried out. (e)     Many of his propositions were successfully\n                        challenged by Mr Das during cross-examination and Yong retracted fairly\n                        major conclusions and assessments made by him;eg, on a visual inspection of a photograph Mr Das\n                        successfully challenged Yong’s view that the amphitheatre was 87%\n                        complete and had to agree that the Defendant’s assessment of 40% was\n                        more accurate and correct. On another occasion, he had to concede after an\n                        embarrassingly long pause that his assessment of 100%,ie, that that particular piece of work had been completed,\n                        was wrong. Under cross-examination, he agreed that some of his other\n                        estimates of work done, (eg, Linkway 1, Linkway 2, covered block entrance at\n                        Blocks 317 and 318), were incorrect. (f)     Yong also acknowledged having seen the contract\n                        conditions, and despite the Plaintiff not giving him any evidence claiming\n                        variations in accordance with the contract conditions, he went ahead to\n                        conclude that the variations were payable. He admitted he even did so\n                        without doing any measurements himself. He claimed to have workings on his\n                        quantities, but did not produce them. I therefore cannot\n                    accept his evidence as it is quite unreliable, and I reject his expert view that\n                    the value of work done by the Defendant up to 12 December 2008 was $422,176.20,\n                    (without GST). 38     Having heard his evidence and considered the\n                    documents, I find the evidence of Mr Tam also unsatisfactory. I highlight some\n                    of these instances: (a)     He was illogical in quite a few of\n                        his answers, agreeing with counsel on various premises which would\n                        inevitably lead to his having to agree with the final conclusion, but when\n                        that conclusion was put to him he just disagreed without any\n                    reasons. (b)     Having\n                        heard his own expert concede various claims, he said he disagreed with his\n                        own expert, giving no reasons and ignoring the fact that he had not put\n                        forward any documents to substantiate his claims. His expert agreed that the\n                        breakdowns of the 3 components of the contract price,ie, of the total contract sum of $547,900, concrete, rebars\n                        and formwork would comprise about $341,418, tools, equipment and others\n                        would comprise about $69,577 and labour would comprise $136,905. However,\n                        Tam disagreed with his own expert. (c)     He claims he gave his expert witness all the drawings\n                        including the revised drawings, but Yong does not refer to any revised\n                        drawings in his reports. (d)     As noted above, his evidence on the 5 workers was shown\n                        to be a total fabrication. I find that having failed to pay their levies, he\n                        concocted a story which was shown to be a total fabrication by Exhibit\n                        “D-2” and especially Exhibit “D-3”. Although he\n                        was offered a chance to explain himself, Mr Tam did not avail himself of the\n                        opportunity of going back into the witness box to refute these documents\n                        which were tendered during Mr Denis Tan’s cross-examination, which\n                        were in turn a refutation of the claim made by Mr Tam in his\n                        cross-examination. (e)     I also found some of his answers very unacceptable for someone who\n                        was supposed to have been in the building industry for 20 years. He\n                        acknowledges the contract provisions in relation to Variation Claims, he\n                        admits not complying with the procedure (which is in the nature of a\n                        condition precedent to entitlement) for making Variation Claims, yet he\n                        insists he is entitled to make those claims in court. Again he insisted that\n                        his Progress Claims could be made without supporting documents. As noted\n                        above, Mr Tam has not produced any invoices, POs, or DOs to prove his\n                        claims. (f)     He also\n                        insisted that his Progress Claims could be made without supporting\n                        documents. He totally ignored the fact that both under the contract and in\n                        fact he was being supplied material like concrete, rebars and wire mesh,\n                        items for which he would be backcharged. (g)     I also find it very telling that for a\n                        subcontractor doing the work that he had to do, that in addition to the\n                        major material like concrete, rebars and wire mesh, as noted above, Tam even\n                        had to get minor items like sanding and cutting discs, saws and saw blades,\n                        trousers, jackets, safety helmets, inner lining, gloves and even nails,\n                        screws and wire from the Defendant. (h)     I also find it telling that for this subcontract, with a\n                        completion date of October 2008, under COP 10, which was signed by Tam, the\n                        subcontract work done up to the end of October 2008 was $265,339. Tam agreed\n                        with this. Under its subcontract, the lumpsum price, which had been broken\n                        down into 24 items, was $547,900. At the contract completion date, the\n                        Plaintiff had only carried out about 48% of its work on these\n                        figures. 39     Having heard his evidence and considered the\n                    documents, I accept the Defendant’s Mr Denis Tan’s evidence. He gave\n                    his answers in a straightforward manner, he was forthright and gave his evidence\n                    without hesitation. I accept his evidence that he gave these subcontract jobs to\n                    Mr Tam because of their friendship and past working relationship in a previous\n                    company. I found Mr Denis Tan to be a truthful witness. I accept his evidence,\n                    especially on the many versions of COP 10 and how they came about, and the fact\n                    that he had to withhold backcharges to keep the Plaintiff going. The evidence is\n                    consistent with his helping, or more correctly, nursing the Plaintiff along so\n                    that it could carry out its subcontract works. 40     I also accept the Defendant’s\n                    photographs of work done as at 12 December 2008 as correct and I do not accept\n                    the Plaintiff’s photographs which I find and hold were taken at a\n                    different time. The Defendant’s photographs were contained in the computer\n                    of the Defendant’s then project QS, Mr Kang. Mr Kang took the photographs\n                    on 12 December 2008 at the instructions of Koh (see below). Mr Kang had later\n                    left the Defendant’s employ. During the preparation for the trial, Tan\n                    said they looked at another employee, Darren’s computer and Koh’s\n                    computer but did not think of looking into Mr Kang’s computer. It was\n                    later discovered in Mr Kang’s computer where he had “tied it to the\n                    progress payment.” Although there was a dispute over their admission into\n                    the evidence, it was eventually resolved and Mr Magin was given the right to\n                    inspect the computer to see the manner in which it was recorded, the date and\n                    time when it was downloaded and whether there was anything in that computer\n                    which would have suggested otherwise. Mr Magin did not subsequently dispute or\n                    otherwise object to these photographs after having viewed them in the\n                    Plaintiff’s computer which the Defendant contends shows, and I accept,\n                    that they were taken on 12 December 2008. I find and hold that the\n                    Defendant’s photographs were taken on and reflect the state of the works\n                    as at 12 December 2008. 41     Having heard his evidence and considered the\n                    documents, I accept the evidence of Koh, and find that he is a witness of truth.\n                    His evidence was given simply and without any embellishment. His evidence was\n                    unshaken in cross-examination. In fact his cross-examination was very brief, (it\n                    only took up 7 pages and 6 lines of the 8thpage of\n                    transcript), and much of his evidence went effectively unchallenged. My findings\n                    on his evidence are as follows: (a)     Koh was the project manager for the\n                        Clementi Project, of which the Plaintiff’s subcontract works formed\n                        only a part, right from the beginning. After about 1 year on the project, he\n                        left the Defendant for another company for about 9 months or so and returned\n                        to the Defendant’s employ around April 2008. He was back on the\n                        Clementi Project from July 2008, where he assisted the then project manager,\n                        Mr Kwen Wai Chin; and when Mr Kwen left, Koh took over again as project\n                        manager of the Clementi Project from September 2008. I therefore find that\n                        he had the requisite detailed knowledge of the project as well as the\n                        Plaintiff’s work. (b)     In his AEIC, Koh deposes that he has read Tan’s\n                        AEIC and he “confirms and adopts the contents thereof in so far as it\n                        relates to the Clementi Project.” This was ineffectively challenged\n                        with only two questions, one of which was whether Koh had any discussions\n                        with Tan as to why he was required to file an affidavit to support the\n                        Defendant’s case. Koh’s answer was straightforward and sincere:\n                        he did not ask why he had to, “[i]t came from within myself”,\n                        he had worked for the Defendant for many years and ‘grew up’\n                        with it, and when “things like this happened”, he was asked\n                        and he agreed to help because he was not asked to “talk about things\n                        that [were] not true.” (see Transcript 21 May 2010, pages 99 and\n                        100). The second question was to put to Koh - that his whole evidence in his\n                        affidavit was not true and a biased statement in support of the\n                        Defendant’s case. Koh denied this. I must say that there was no real\n                        foundation for this second question. No questions were asked of Koh which\n                        showed some of his evidence was perhaps not true or that some of his\n                        evidence was biased. In fact all the questions not only did not damage\n                        Koh’s credibility, it reinforced the truthfulness of his\n                        evidence. (c)     I\n                        also accept the evidence of Koh when in spontaneously answering a question,\n                        he spoke about how the Plaintiff had problems paying their employees and how\n                        he tried to mediate with the staff. Koh even asked Tan to help pay some of\n                        the worker’s salaries. He showed a familiarity with their names and\n                        referring to them unhesitatingly as “Ah Ting”, “Ah\n                        Chiang”, “Ah Lek”, “Kumar” and\n                        “Rajan”. These were some of the employees who had problems\n                        collecting their salaries from the Plaintiff. He knew them well and was\n                        confident if he was shown photographs he would readily identify\n                    them. (d)     Mr\n                        Magintharan objected paragraphs 4 and 5 of Koh’s affidavit where he\n                        identifies certain signatures as those belonging to workers employed by the\n                        Plaintiff and those by the Defendant. Mr Magintharan objected that\n                        Koh’s evidence amounted to opinion. Mr Das argued that it was not\n                        opinion evidence because in paragraph 4, Koh stated that he had witnessed\n                        these persons signing documents for material received for and on behalf of\n                        the Plaintiff. I overruled the objections and told Mr Magintharan that he\n                        was free to challenge Koh on how he was so familiar or sure of the makers of\n                        the signature. (e)     I accepted the evidence given by Koh under cross-examination,viz, that such requests for material and signatures\n                        therefor actually went through him when the supervisors were not around. I\n                        accept his evidence that he did this a few times and readily admitted it was\n                        not an everyday affair. But, as I found above, he knew all these people\n                        well: Ah Lek, Kumar, Ding (“Ting”), Rajan and Ah Chiang. I\n                        also accept Koh’s evidence that these 5 employees were authorised by\n                        Tam to receive and sign for material, tools, equipment, etc from the\n                        Defendant. (f)     I\n                        find that Koh’s confirmation and corroboration of Tan’s AEIC has\n                        not been discredited and I accept his evidence on this\n                score. 42     Whilst I accept the Defendant’s evidence\n                    generally, and note its detailed claim that the value of work done by the\n                    Plaintiff, as at 12 December 2008, was $289,739.20 (without GST) with a detailed\n                    breakdown set out in “DT-1”, page 1816, that document is not\n                    backed up by any working papers or notes or other documentation to show the\n                    quantities and how they were arrived at. I note there are contrary pieces of\n                    evidence by the Defendant’s QS, Mr Kang. There were 3 draft COP 10s, in\n                    which Mr Kang had put the value of contract works at $325,004.95, $317,879.95\n                    and $309,329.95, (all 3 of which consistently valued the Variations at\n                    $13,695.95 without GST ($14,654.67 with GST). It was alleged, and it was not\n                    denied, that Mr Kang was the Defendant’s project QS. Doing the best I can\n                    on the state of the evidence, I find and hold that the amount of work done by\n                    the Plaintiff, as at 12 Dec 2008 to be the average of these three draft\n                    valuations put up by Mr Kang: $317,404.95 without GST ($339,623.30 with\n                    GST).",
        "Issue 6:   What is the value of the variation works carried out by\n                the Plaintiffs under the Clementi Contract?": "",
        "Issue 7:   Are the alleged variation works claimed by the\n                Plaintiffs claimable as variations bearing in mind the requirements of Clause 20.3\n                of the Clementi Contract?": "43     Issues 6 and 7 can be conveniently dealt\n                    together. The Plaintiff claimed Variations, by way of additional work, of\n                    $48,100 under 22 items. This includes 8 “updated” variation claims\n                    put forward by the Plaintiff’s expert, Yong (VO.15-22). The Defendant\n                    accepts Variations, issued in writing through drawings, amounting $10,539.50\n                    (without GST), (COP 11, “DT-1”, pg.158). The Defendant contends,\n                    and it is not disputed, that variation claims 15 to 22 were only made when Yong\n                    filed his AEIC. The Plaintiff has failed to produce in court any VOs in writing\n                    or drawings showing any Variations for Items 7, 9-14 and the new\n                    ‘Variation Claims’ Items 15-22. The Plaintiff has also failed to\n                    prove that abortive works were done by it before they were\n                omitted. 44     Clause 20.3 stipulates by way of a condition\n                    precedent certain procedure to be followed before the Plaintiff is entitled to\n                    make a claim for a Variation. This was clearly not complied with. Yong also\n                    acknowledged this binding and clear provision in the contract. As noted above,\n                    on the pleadings, the Plaintiff denies the contract terms, puts the Defendant to\n                    strict proof thereof but pleads no positive case. In the Final Submissions, the\n                    Plaintiff submits that Clause 20.3 was waived by the parties by their course of\n                    conduct and relies on 3 points at paragraph 73 of their Final Submissions. None\n                    of these points have been made out. On the facts I find that there was no waiver\n                    of Clause 20.3. Further, more importantly, such an allegation was not\n                    pleaded. 45     However, I note that in COP 9, the Variation\n                    works accepted by the Defendant (“DT-1” pg.179), amounted to\n                    $13,695.95. As noted above, the 3 draft versions of COP 10 consistently stated\n                    the Variations at this same figure. Having heard the evidence of the witnesses\n                    and considering the evidence, I find and hold that the Plaintiff is entitled to\n                    Variations amounting to $13,695.95 without GST ($14,654.67 with\n                GST).",
        "Issue 8:   What is the value of the materials, equipment and tools\n                supplied by the Defendants to the Plaintiffs pursuant to Clause 9 of the Particular\n                Specifications (read with Appendix 3) of the Clementi Contract?": "46     Based on the way the evidence has been\n                    presented and on the Closing submissions of counsel, this issue is subsumed\n                    under Issue 10. Both counsel agreed with this.",
        "Issue 9:   What are the costs and expenses incurred by the\n                Defendants by reason of the Plaintiffs’ failure to complete the Clementi\n                Contract?": "47     Having heard the witnesses and considered the\n                    evidence, I find and hold that the costs and expenses incurred by the Defendant\n                    to complete the Clementi Project after the Plaintiff abandoned the works amounts\n                    to the sum of $275,245.98 without GST ($294,513.20 with GST). I note in passing\n                    that this issue should also be subsumed under Issue 10. This was also agreed to\n                    by counsel.",
        "Issue 10:   The parties have agreed that of the sum of $115,460.22\n                being the cumulative backcharges in COP 1 to 9 in the Clementi Contract are agreed\n                at $80,000.00 without GST ($85,600 with GST). This leaves the issue of the balance\n                sum of backcharges of $512,117.57 ($478,614.55 x 1.07) against the Plaintiffs being\n                the total backcharges claimed by the Defendants’ Backcharges Tax Invoice Nos.\n                255 & 264 in the Clementi Contract?": "48     Having heard the witnesses and considered the\n                    evidence, I find that there are significant overlaps and duplication in the\n                    backcharges. Doing the best I can on largely unexplained and incomplete\n                    evidence, I assess the remaining backcharges, (other than the $275,245.98 under\n                    Issue 9, the cost and expense of completing the Clementi Project), at $43,673.71\n                    without GST ($46,730.87 with GST).",
        "Judgment and Orders:": "49     Insofar as it is necessary, I find that the\n                    Plaintiff has failed to prove its claim for additional payment under its invoice\n                    No.07048-01 for $2,965 for the following reasons: (a)     Mr Das objected to cross-examination\n                        on this subject as it was for services rendered in the Punggol Project and\n                        that project was settled. (b)     At that point of time the Agreed List of Issues was not\n                        yet finalised. Mr Magintharan stopped cross-examination on that subject and\n                        said he would discuss the same with Mr Das and sort it out. When the final\n                        Agreed List of Issues was handed up to me, it did not have this item as an\n                        issue, (see Transcript, 19 May 2010, page 78, line 16 to page 79, line 9).\n                        Yet it appears to be a claim in Mr Magintharan’s Plaintiff’s\n                        Final Submissions. (c)     Under cross-examination, Tan never admitted this claim; on the\n                        contrary he said the Defendant did not admit the claim, the Defendant\n                        rejected the claim and could not understand this claim which was not\n                        submitted at that point of time. Those were his words, which I accept as\n                        true. (d)     Paragraph\n                        75 of the Plaintiff’s Final Submission is another prime example of the\n                        Plaintiff’s sloppy work: (i)       it makes a statement of\n                            what a witness allegedly said which is not true, (ii)       it puts in quotes words\n                            that were not said and do not appear on the\n                        transcript, (iii)       the page references are wrong, it should not be PBD 213 and 214\n                            but rather PBD 192 and 193, and (iv)       the figure claimed $2,423.55, said to include\n                            GST is wrong as PBD 192 shows a figure of $2965.00 without GST and\n                            $3,172.55 with GST and the pleadings claim $2,965. (see\n                            Transcript, 19 May 2010, page 76, line 19 to page 78, line 15; see\n                            Amended Statement of Claim, paragraph 8, sub-paragraph a under\n                            Particulars). The Plaintiff’s claim for\n                    its Invoice No.07048-01 for $2,965 is therefore dismissed. 50     I found some of the figures used in final\n                    submissions confusing because there were typographical errors on some figures\n                    and because some were with and others without GST. I therefore gave counsel a\n                    draft brief judgment and asked them to correct the figures only for such\n                    arithmetical errors and GST applications to ensure uniformity. Having had these\n                    corrections made, I therefore made the following orders and entered judgments,\n                    as follows:- (i)Punggol\n                            Project: By agreement, there will be judgment entered in\n                        favour of the Plaintiff for $192,176.63 (inclusive of\n                    GST); (ii)Clementi Project: There will be judgment entered in\n                        favour of the Defendant for the sum of $247,998.91 without GST ($265,358.83\n                        with GST), arrived at as follows: Amount due to\n                                                Plaintiff:without\n                                            GSTwith\n                                            GSTWork Completed up to\n                                        12.12.08:$317,404.95$339,623.30Variations:$\n                                                13,695.95+$\n                                                14,654.67+Sub total:$331,100.90$354,277.97Less Payment made to\n                                        Plaintiff:$180,180.12-$192,792.73-Total Due to\n                                    Plaintiff:$150,920.78$161,485.24Amount due to\n                                                Defendant:Amount incurred to complete\n                                            Project:$275,245.98$294,513.20Backcharges:$ 43,673.71$ 46,730.87Agreed Backcharges in COP\n                                        9:$\n                                                80,000.00+$\n                                                85,600.00+Sub total:$398,919.69$426,844.07After set off,Final Amount due to\n                                        Defendant:$247,998.91$265,358.83   (iii)     In the result, after\n                        setting off the respective judgment sums, the Plaintiff must pay the\n                        Defendant $68,394.58 without GST ($73,182.20 with GST). 51     Having heard counsel and their submissions on\n                    interest and costs, I gave judgment, for the Punggol Project: (i)     interest at 5.33% p.a. on\n                        $192,176.63 payable to the Plaintiff by the Defendant from the date of the\n                        Writ to the date of judgment; (ii)     there shall be no order as to costs as the sums claimed\n                        by the Plaintiff were exorbitant, the quantum could have been settled\n                        earlier if not for the Plaintiff’s stand and in the end it was settled\n                        by the parties mid-way through the trial; and for the\n                    Clementi Project: (iii)     interest at 5.33% p.a. on\n                        $426,844.07 payable by the Plaintiff to the Defendant from the date of\n                        filing of the counterclaim to the date of judgment; thereafter interest will\n                        run at 5.33% p.a. on $73,182.20 payable by the Plaintiff to the Defendant\n                        from the date of judgment to the date of payment; and (iv)     the Defendant is awarded\n                            ? of its costs for the counterclaim, such costs to be\n                        agreed or taxed."
    }
}