{
    "case_title": "Public Prosecutor\n      v\n      Tan Teck Soon",
    "ncitation": "[2011] SGHC 137",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "Introduction": "1       The accused, Tan Teck Soon (“the Accused”), pleaded guilty to a reduced charge of culpable homicide not amounting to murder punishable under s 304(a) of the Penal Code (Cap 224, 2008 Rev Ed) (“Penal Code”) for causing the death of one Chong Kar Yan (“the Deceased”) by pushing the Deceased over a parapet wall with the intention of causing such bodily injury as is likely to cause death. He was originally charged with murder punishable under s 302 of the Penal Code, but the prosecution subsequently reduced the charge to one of culpable homicide on 5 April 2011. The Accused admitted to the statement of facts (“SOF”) without qualification and I convicted him accordingly on 11 April 2011. After hearing his mitigation plea on 15 April 2011, I sentenced the Accused to 14 years’ imprisonment, to commence from the date he was arrestedviz7 March 2009. I now give my reasons for the sentence.",
        "Background facts": "2       The Accused is a 21 year old Malaysian citizen who was working as a welder in Singapore. He was 19 years old at the time of the offence. The Deceased was his girlfriend, a Malaysian citizen who was working as a waitress in Singapore, aged 20 at the time of death. According to the SOF, they had been introduced to each other sometime between August to September 2008 by a mutual friend, one Chua Ooi Loon (“Chua”), as the Accused had expressed interest in dating the Deceased. They began a relationship in October 2008. 3       On 6 March 2009, the Accused, the Deceased and Chua met up at a hawker centre in Bedok. The Accused wanted to return a sum of money that he had borrowed from Chua. The Deceased went to order a bowl of fishball noodles as she was hungry. After she returned to their table, she asked the Accused to get an additional pair of chopsticks. The Accused refused to do so, sparking an argument between them. The Deceased refused to talk to the Accused for some time but eventually relented when the Accused tried to pacify her by feeding her a fishball. However, the Accused became unhappy with the Deceased as she was busy making calls and sending text messages on her handphone throughout the meal. At one point, the Deceased walked away to a nearby bench while talking on her handphone. The Accused was unhappy with the Deceased’s conduct and kept looking at her direction. When the Accused got up and walked towards the Deceased, she stood up and walked away from the Accused while continuing to speak on her handphone. Angered, the Accused walked off to the carpark and sat on his motorcycle to smoke. Eventually, both parties returned to the table where Chua was waiting. About ten minutes later, all three of them decided to head home. 4       The Accused brought the Deceased on his motorcycle to a carpark near her block of flats in Ang Mo Kio. As soon as he stopped his motorcycle, she removed her helmet and threw it on the ground. They then started to quarrel over the previous incident at the hawker center. The Deceased suggested that they go up to a nearby block of flats to talk. Both of them entered the lift of Block 565 Ang Mo Kio Avenue 3 and the Accused pressed the button for the 11th floor. They got out there and walked up to the 12th floor where they continued to quarrel. The Accused felt upset when the Deceased told him that both of them would not change their temper and he felt that she was trying to end their relationship. He then decided to die together with the Deceased. At this point, the Deceased’s back was leaning against the parapet wall. The Accused used both his hands to push the Deceased on her chest until she fell over the parapet. The Accused then took a few steps back, ran towards the parapet and swung himself over it. His fall was broken by some metal scaffolding that had been erected on the ground floor as part of lift upgrading construction works and he survived it. Tragically, the Deceased did not.",
        "Mitigation": "5       Defence counsel submitted in mitigation that the Accused was a first offender who pleaded guilty at the first opportunity. The Accused was 19 years old at the time of the offence. He was the youngest of nine siblings, and had come to Singapore to work as a welder to supplement the family income. From the beginning, the relationship between the Deceased and the Accused was affected by quarrels over the Deceased’s late nights which the Accused disapproved of. Defence counsel stressed that the Accused’s act of killing the Deceased was impulsive rather than premeditated, and that the Accused immediately jumped off the parapet with the intention of killing himself as well.",
        "Sentencing considerations": "6       Section 304(a) of the Penal Code provides for a sentence of imprisonment for life, or imprisonment for a term which may extend to 20 years, and a fine or caning. Sentences for culpable homicide generally range from 5 to 18 years, but as both prosecution and defence counsel submitted before me, they cover a wide spectrum of facts and each case stands on its own. As elucidated by the Court of Appeal inPublic Prosecutor v Tan Kei Loon Allan[1998] 3 SLR(R) 679 (at [33]): We were of the view that it is not desirable, unlike simple rape, to set a benchmark for culpable homicide. The range of circumstances in which such offences are committed is extremely varied … They are not easily classified, and there is no such thing as a \"typical\" homicide … Sentencing for culpable homicide should remain a matter within the trial judge's discretion (subject to our power to review a decision made in error, or which is manifestly excessive or inadequate), and should be determined on the facts of each particular case. As such, the question before me was what was the appropriate sentence on the facts of this case. 7       This was a rather unusual case. Most cases of culpable homicide dealt with by the courts fall within one of the defences to murder in the Penal Code. In some cases, although the accused had caused the death of the victim, he was held to be deprived of the power of self-control due to grave and sudden provocation from the victim. In other cases, the killing was caused in the heat of a sudden fight. In a large number of cases, the accused suffered from some abnormality of mind that availed him of the defence of diminished responsibility. The present case had none of these features. The Accused had intended to cause the death of the deceased and had carried out his act of pushing her over the parapet wholly for the purpose of achieving this objective. Although immediately prior to the killing, they had a lover’s quarrel and the Accused thought that the Deceased wanted to break up with him, this does not qualify for the defence of grave and sudden provocation and defence counsel rightly did not attempt to submit that it did. There was no sudden fight; it was the Accused who made the first physical move in pushing the Deceased off the parapet. The psychiatrist opined that the Accused was not suffering from any mental illness at the time of the offence. Indeed, from the SOF, it was difficult to see how the Accused could have avoided a conviction on a charge of murder, under limb (a) of s 300 of the Penal Code,vizthe act by which death is caused is done with the intention of causing death. 8       The only redeeming factor that could be said to be in favour of the Accused was that he had killed the Deceased out of a rash, impulsive reaction to the lovers’ tiff between them with the intention to kill himself at the same time. In other words, he was prepared to die together with her. I must say at the outset that I find this scant consolation for the family of the Deceased, who must have rued the day the Deceased met him. I noted that the SOF did not state that the Deceased had suggested that they end their relationship – it was the Accused who had assumed the worst and felt that she was trying to end the relationship. His was an infantile, possessive mind quick to jump to conclusions that, combined with an impulsive streak, proved a fatal combination for the Deceased. 9       The facts of this case are far removed from the many cases of culpable homicide before these courts in which the accused had suffered from a psychiatric condition, usually depression or some more severe mental illness which caused his mental state to be impaired to the extent that his judgment was affected. In the present case, the Accused suffered no such impairment. Instead, it was an impulsive decision on his part that the Deceased should die along with him, presumably on the basis that if he could not have her, then nobody else could. It was an act of puerile selfishness that resulted in such tragic consequences for the Deceased and her family. For these reasons, I found that the circumstances of this case warranted a sentence on the higher end of the range of sentences imposed for culpable homicide. 10     InPublic Prosecutor v Aguilar Guen Garlejo[2006] 3 SLR(R) 247, the accused was a close friend of the deceased. During an argument which escalated into a fight, the accused smothered the deceased with a cushion and strangled her until she stopped breathing. As the accused was found to be suffering from masked depression, a single episode of moderate major depression, the court held that this substantially impaired her mental responsibility and sentenced her to 10 years’ imprisonment. In the unreported case ofPublic Prosecutor v Wu Yun Yun(Criminal Case No 16 of 2009), the accused stabbed her brother-in-law and sister-in-law. She was convicted of one count of culpable homicide for killing the former and one count of attempted culpable homicide for injuring the latter. The accused was sentenced to 12 years’ imprisonment for the first charge and 4 years’ imprisonment for the second charge. Her psychiatric report indicated that she was suffering from major depressive disorder at the time of the offences that would qualify her for the defence of diminished responsibility. InPublic Prosecutor v Chee Cheong Hin Constance[2006] 2 SLR(R) 24 and [2006] 2 SLR(R) 707, the accused threw her former lover’s daughter down the corridor to her death. She was sentenced to 10 years’ imprisonment for the s 304(a) of the Penal Code charge. Her psychiatric report indicated that she was suffering from schizophrenia at the time which would have subsequently impaired her mental responsibility for her act in causing death, and would have made her eligible for the defence of diminished responsibility. 11     In the present case, counsel for the Accused urged me to impose a sentence of less than ten years. I accepted his submission that the Accused’s action was not premeditated but carried out on impulse. I also accepted that this was done with the intention of killing himself after that. I took into consideration the fact that at that moment the Accused was emotionally overwhelmed due to the quarrel and his belief that the Deceased wanted to end their relationship. But these were the considerations that I took into account in not imposing a sentence of 20 years – they are not considerations that, in the context of all the facts of the case, justify a sentence of less than ten years. The Accused had every intention to kill the Deceased and carried out the act without any concern for her. He may have done it on impulse, but he expended considerable effort to carry it out. It was not a single push done in a split second. The parapet was about chest high for the Deceased, and it would have taken considerable effort on the part of the Accused to tip her over. As a result, a young life had been snuffed out in its prime. I was of the view that it is incumbent upon this court to impose a sentence of sufficient severity to reflect the outrage of society over the act of the Accused and its abhorrence of his behaviour. Indeed, had the prosecution proceeded with the charge of murder, the same facts would have justified a conviction. In the cases referred to in[10]above, sentences ranging from ten to 12 years were imposed. They clearly had more mitigating circumstances than the present case. I was of the view that a sentence of 14 years would be appropriate, considering the punishments that have been imposed by these courts and the circumstances of the present case."
    }
}