{
    "case_title": "Out of the Box Pte Ltd\n      v\n      Wanin Industries Pte Ltd",
    "ncitation": "[2011] SGHC 226",
    "coram": "Leo Zhen Wei Lionel AR",
    "sections": {
        "Introduction": "1       This is an assessment of the amount of\n                    “reliance loss” damages that a distributor is entitled to recover\n                    as a result of a producer’s supply of defective drinks. It raises several\n                    important and interesting issues that go to the very basis of an award of\n                    “reliance loss” damages in contract. First, it raises the issue of\n                    whether a distributor can recover, as wasted expenditure, the full money value\n                    of advertising services it paid for not in cash but by way of redemption of\n                    advertising credits and a prize, both of which were not assignable or\n                    transferable and had a fast approaching expiry date. Second, it raises the issue\n                    of whetherany quantumof advertising expenses\n                    should be considered to be in the reasonable contemplation of parties, such as\n                    to preclude an argument that the loss is too remote, simply on the basis that\n                    the parties must have known that thistypeof\n                    expense would, in all likelihood, be incurred.",
        "Background": "2       In early 2007, Out of the Box Pte Ltd\n                    (“the plaintiff”) designed and conceptualised a sports drink known\n                    as “18”. The plaintiff had high hopes for “18”,\n                    believing that it could one day go global. As such, the plaintiff was willing to\n                    spend more than $700,000 to advertise and promote “18”.\n                    Unfortunately, the manufacturer that the plaintiff engaged to produce\n                    “18”, Wanin Industries Pte Ltd (“the defendant”),\n                    supplied defective “18” that changed colour and contained foreign\n                    particles or insects. Following consumer complaints, the Agri-Food and\n                    Veterinary Authority of Singapore (“AVA”) put up an advisory\n                    warning against the consumption of “18” and directed that the\n                    plaintiff recall all stocks of “18” in the market. The\n                    “18” brand having been irretrievably damaged, the plaintiff\n                    decided to discontinue “18”. 3       The plaintiff sued for breach of contract and\n                    obtained summary judgment against the defendant. At the assessment stage, the\n                    plaintiff claimed for its “reliance loss”. In other words, the\n                    plaintiff claimed for the expenses that it had incurred in reliance of the\n                    manufacturing contract with the defendant (“the contract”) that\n                    had been wasted as a result of the defendant’s breach. The total amount of\n                    the plaintiff’s claim, after deducting the revenue earned from sales of\n                    “18”, is $779,812.31, and the breakdown is as follows: DetailsAmount PaidAdvertising and promotional\n                                            expenses$702,787.02Payments for drinks and bottle\n                                            moulds$39,648.90Rental of warehouse and\n                                        forklift$36,241.82Expenses incurred as a result of the\n                                            recall of “18”$7,549.29Fridge and vending machine\n                                        expenses$15,657.19Sales revenue from\n                                            “18”($22,071.91)Total$779,812.31   4       Unsurprisingly, the defendant argued that the\n                    plaintiff is not entitled to this amount. In particular, the defendant\n                    strenuously objected to the amount claimed as advertising and promotional\n                    expenses (“advertising expenses”).",
        "My decision": "5       Since the advertising expenses constitute the\n                    bulk of the plaintiff’s claim, I will deal with these expenses\n                    first.",
        "Advertising expenses": "6       The damages claimed by the plaintiff with regard\n                    to advertising expenses amount to $702,787.02, the breakdown of which is as\n                    follows: SupplierAmountClear Channel Singapore Pte Ltd\n                                            (“Clear Channel”)$74,900ActMedia Singapore Pte Ltd\n                                            (“ActMedia”)$342,658.01Groovy Pte Ltd\n                                            (“Groovy”)$50,000Procolor Separation & Print Pte Ltd\n                                            (“Procolor”)$1,637.10Big Bulb Creative Pte Ltd (“Big\n                                            Bulb”)$3,210Raffles Digital Labs Pte Ltd\n                                            (“Raffles Digital”)$26,373.09The Catalyst Agency Pte Ltd\n                                            (“Catalyst”)$199,369.87Miscellaneous advertising\n                                        expenses$4,638.95Total$702,787.02   7       The defendant’s arguments with regard to\n                    the advertising expenses are two-fold. First, there is a general objection to\n                    the overall amount claimed on the basis that such a large amount was not within\n                    the reasonable contemplation of the parties and should thus be irrecoverable for\n                    being too remote. Second, the defendant specifically objects, for a variety of\n                    reasons, to the full recovery of many of the individual items of expense\n                    claimed. I will first consider each of the defendant’s specific objections\n                    to determine the overall amount of advertising expensesvalidly incurred. I will then consider whether these validly\n                    incurred expenses are so large as to be outside the reasonable contemplation of\n                    the parties. 8       In the context of this case, I use the term\n                    validly incurred expenses to refer to expenses that have beenprovenand to which there are no well-founded objections apart\n                    from the general objection that the loss is too remote. It is trite law that to\n                    succeed in a claim for damages, a plaintiff must prove its loss. As held inRobertson Quay Investment Pte Ltd v Steen Consultants Pte\n                        Ltd[2008] 2 SLR(R) 623 (“Robertson Quay”) at [31]: 31    ... [A] plaintiff cannot simply make a claim for\n                            damages without placing before the court sufficient evidence of the loss\n                            it has suffered even if it is otherwise entitled in principle to recover\n                            damages. On the other hand, where the plaintiff has attempted its level\n                            best to prove its lossandthe evidence is\n                            cogent, the court should allow it to recover the damages claimed.\n                            [emphasis in original] In the present case, the plaintiff has adduced evidence of all the\n                    relevant invoices and has also furnished supporting documents. As held inThode Gerd Walter v Mintwell Industry Pte Ltd[2010] SGHC 33 (“Thode Gerd\n                        Walter”) at [39]–[40], there\n                    is no requirement in law that the makers of invoices must invariably be called\n                    to explain them as this would be “impractical”, although there may\n                    be cases where this would be warranted. The court went on to outline two such\n                    instances, the first being where there appears to be no factual link between the\n                    damage claimed and the breach, and the second being where the figures in the\n                    invoice appear to be inflated or where certain items appear to be unusual or\n                    special. 9       As was the case inThode Gerd\n                        Walter, the defendant does not dispute the admissibility or\n                    authenticity of the invoices and supporting documents adduced by the plaintiff.\n                    Furthermore, with regard to those expenses that the defendant contends are\n                    “unusually high” (ie, the expenses\n                    incurred in respect of Groovy and Catalyst), the plaintiff has called witnesses\n                    to explain the invoices and to give evidence on the work done. In these\n                    circumstances, I am satisfied that the plaintiff has adduced sufficientprima facieevidence of its loss, and all that\n                    remains to be determined is the validity of the defendant’s objections. It\n                    is to these objections that I now turn. Clear Channel 10     The plaintiff claimed $74,900 for expenses\n                    incurred in relation to Clear Channel. These expenses were incurred for bus-stop\n                    advertisements placed in the month of December 2008. $70,000 was paid through\n                    the redemption of a prize that the plaintiff had won in a competition\n                    (“the prize”) and the $4,900 incurred as GST was paid for in\n                    cash. 11     The defendant objects to these expenses on two\n                    grounds. First, the defendant takes issue with the fact that the advertisements\n                    had been paid for, not in cash, but by way of redemption of the prize. Second,\n                    the defendant contends that the plaintiff did not suffer pecuniary loss because\n                    it had enjoyed the benefit of marketing exposure for “18” from the\n                    bus-stop advertisements during the period of December 2008 since the plaintiff\n                    terminated the contract with the defendant only in February 2009. 12     I will deal with the defendant’s second\n                    objection first as it can be dealt with summarily. It suffices to say that any\n                    direct benefit (ie, revenue from sales of\n                    “18”) that the plaintiff had obtained has been accounted for in\n                    the reduction in the overall expenses claimed by $22,071.91, this sum being the\n                    sales revenue of “18”. As for any indirect benefit, perhaps in the\n                    form of goodwill, that the defendant may have obtained, this would have been\n                    wasted and rendered futile in light of the discontinuation of “18”\n                    that was precipitated by the defendant’s breach. 13     The defendant’s other objection is that\n                    the plaintiff did not suffer pecuniary loss because it had placed the\n                    advertisements by way of redemption of the prize. In this regard, the defendant\n                    emphasised that the prize could not be assigned or transferred, and would have\n                    expired if it was not used by 31 December 2008. In contrast, the plaintiff\n                    took the position that the prize was clearly an asset with an equivalent\n                    monetary value, and that it had been deprived of the use of the prize by the\n                    defendant’s breach. Further, the plaintiff argued that if it had not used\n                    the prize to advertise “18”, it would have had to pay for such\n                    advertising in cash. Since the defendant would clearly be liable to compensate\n                    the plaintiff in such a situation, it should not make any difference that the\n                    plaintiff had chosen to use the prize to pay for the expenses\n                instead. (1)   Plaintiff’s loss – advertising services or the\n                prize? 14     The crux of this issue lies in the\n                    characterisation of the plaintiff’s loss. There are two possibilities. The\n                    first possibility is that the plaintiff lost $70,000 ofadvertising services. If this were the case, then the plaintiff\n                    would be entitled to $70,000 in monetary damages as this would represent the\n                    value of the advertising services it lost. Put another way, if it had not\n                    redeemed the prize, the plaintiff would have had to pay $70,000 to obtain the\n                    advertising services from Clear Channel. 15     However, there is another possibility. The\n                    second possibility is that the plaintiff has lost the use ofthe prize. If that were the case, then the measure of damages\n                    should comport with theobjective valueof the\n                    prize that the plaintiff lost. That is not to say that the objective value of\n                    the prize is its market value. Although the prize in the present case had no\n                    market value as it was not transferable or assignable, it clearly had valueto the plaintiff. The question to be\n                    determined would thus be the objective value of the prize to the plaintiff\n                        (ie, the value that a reasonable person in the\n                    plaintiff’s shoes would have attributed to the prize). In such an inquiry,\n                    the fact that the prize was not assignable or transferable, and would expire if\n                    it was not used by 31 December 2008, could be relevant. 16     The thrust of the defendant’s argument\n                    is that an award of $70,000 in damages would over-compensate the plaintiff. It\n                    is axiomatic that a reasonable person would value $70,000 in damages more than\n                    the prize. This is because cash can be used for a variety of purposes whereas\n                    the prize could only have been used to redeem advertising servicesfrom Clear Channel. Furthermore, cash retains its\n                    intrinsic value whereas the prize would be worth nothing if it was not redeemed\n                    by 31 December 2008. The expiry date of the prize is a major factor since\n                    this meant that the plaintiff had a fixed period within which it must advertise\n                    whether or not it had a product ready for launch. To compound matters, the prize\n                    could not be converted to cash even if the plaintiff was willing to sell the\n                    prize at a discount since the prize could not be assigned or\n                transferred. 17     McGregor on Damages (Thomson Reuters (Legal)\n                    Limited, 18th Ed, 2009) (“McGregor”) defines “reliance\n                    loss”, at [2-020], as follows: Sometimes, however, the claimant may be compelled by circumstances to\n                        frame his suit on a different basis as to damages, not on the basis of the\n                        loss of his bargain but on the basis of his out-of-pocket loss. In other\n                        words, he is claiming not to be put into the position he would have been in\n                        had the contract been performed, butto be put into the\n                            position he would have been in had it never been made, which is a normal\n                            measure of damages akin to that in tort. [emphasis\n                        added] According to this statement by McGregor, the reference point is the\n                    position that the plaintiff would have been in had the contractnever been made. On the facts, the prize had not been\n                    redeemed at the time the contract was made. As such, if the contract had not\n                    been made, the plaintiff would have had an unredeemed prize, not $70,000 of\n                    advertising services. On this understanding of “reliance loss”, an\n                    award of $70,000 in damages would indeed result in the plaintiff being\n                    over-compensated. Whereas the plaintiff would only have had a prize worth less\n                    than $70,000 (see [16]) had the contract\n                    not been made, the award of damages would result in the plaintiff being\n                    compensated with $70,000 in cash. In the words of the defendant’s counsel,\n                    “the plaintiff would in fact have monetized [the prize], which [it] would\n                    not have been able to even if there was no breach.” 18     I do not agree that an award of $70,000 in\n                    damagesnecessarilyover-compensates the\n                    plaintiff. In this regard, I am of the view that McGregor’s statement that\n                    compensating for “reliance loss” aims to put the injured party in\n                    the position as if the contract had not been made is simply a shorthand used toquantify“reliance loss” damages\n                    and, with the greatest of respect, may need reconsideration. As stated in the\n                    seminal decision ofLivingstone v Rawyards Coal Co(1880) 5 App Cas 25 (“Livingstone”) at 39, the fundamental principle of\n                    compensation is that damages should “put the party who has been injured,\n                    or who has suffered, in the same position as he would have been if he had not\n                    sustained the wrong for which he is now getting his compensation.” In the\n                    case of breach of contract, putting the injured party in the position he would\n                    have been in had he not sustained the wrong refers to putting him in the\n                    position he would have been in had the contract not been broken. The focus is\n                    therefore on thepromised performance. Consistent\n                    with this,Chitty on Contractsvol 1 (Sweet &\n                    Maxwell, 30th Ed, 2008) (“Chitty”) defines “reliance\n                    loss”, at [26-006], as follows: [T]he reliance interest relates to the expense or which the claimant has\n                        himself incurredin reliance on the promised\n                            performanceand which is wasted by the defendant’s\n                        breach. [emphasis added] Although McGregor’s statement would result in the correct\n                    measure of damages in the vast majority of cases, it would result in the wrong\n                    measure in the present case. This is because it does not account for the fact\n                    that the plaintiff hadconvertedthe prize into\n                    advertising servicesafterthe contract had been\n                    entered into and this conversion had been donein\n                        relianceof the contract. Applying McGregor’s statement,\n                    the plaintiff would be awarded the value of the prize which it would still have\n                    had if the contract had not been made. However, the measure of “reliance\n                    loss” damages that stays true to the principle underlying the award of\n                    such damages would be an award of the objective value of the advertising\n                    services that the plaintiff would still have had if the contract hadnot been broken(ie,\n                    $70,000 in damages). (2)   Characterisation of the plaintiff’s loss in light of\n                the fact that the plaintiff no longer has any product to advertise 19     Unfortunately, a further complication arises\n                    from the fact that the plaintiff no longer has any product to advertise. If\n                    “18” was still a live product or if the plaintiff had some other\n                    product for which it could use advertising services, I would not hesitate to\n                    grant the plaintiff $70,000 in damages. Had the defendant not breached the\n                    contract, the plaintiff would still have $70,000 of advertising services (which\n                    it no longer has, conceptually speaking, as such advertising services have been\n                    wasted). Theoretically, the ideal method of compensation would be for the\n                    defendant to compensate the plaintiff with actual advertising services to the\n                    value of $70,000. However, since the remedy for breach of contract is generally\n                    damages, the court makes an award of $70,000 as amonetary\n                        substituteto enable the plaintiff to obtain the advertising\n                    services. Having made this award, the court would not concern itself with\n                    whether the plaintiff actually uses the money to obtain the advertising\n                    services. As stated inRuxley Electronics & Construction\n                        Ltd v Forsyth[1996] AC 344 (“Ruxley”) at 359, “in the normal case the court has\n                    no concern with the use to which a plaintiff puts an award of damages for a loss\n                    which has been established.” 20     However, advertising services cannot exist in\n                    a vacuum and must attach to or beused fora\n                    product. If there is no product that advertising services can be used for, then\n                    the plaintiff’s loss is, in reality, the loss of theability to obtain advertising services in the future. That\n                    would, in effect, be the loss of the prize since the prize had been the source\n                    of the plaintiff’s ability to obtain future advertising services. Put\n                    another way, because the plaintiff no longer has any product to advertise, it is\n                    conceptuallyimpossibleto compensate the\n                    plaintiff with actual advertising services for “18” or some other\n                    product. In such a situation, it would be illogical and artificial for the court\n                    to make an award of the monetary substitute for advertising services that cannot\n                    conceptually be ordered. Therefore, since the plaintiff no longer has any\n                    product for which advertising servicescanbe\n                    used, I am of the view that it does not make sense for the court to characterise\n                    the plaintiff’s loss as a loss of advertising services. In truth, the\n                    plaintiff’s real loss, in light of the circumstances now before the court,\n                    is the loss of the prize. 21     In coming to this conclusion, I am fortified\n                    by two cases decided by the House of Lords. The first case isGolden Strait Corpn v Nippon Yusen Kubishika Kaisha[2007] 2 AC\n                    353 (“The Golden Victory”).The Golden Victoryinvolved a charter party,\n                    clause 33 of which provided that both parties had the right to cancel the\n                    charter if war were to break out between certain countries. In December 2001,\n                    the charterers repudiated the charter party and this was accepted on 17 December\n                    2001. On 20 March 2003, war falling within clause 33 broke out. The question\n                    before the House of Lords was whether damages ought to be limited to the period\n                    from 17 December 2001 to 20 March 2003 (when war broke out) or for the full\n                    period from 17 December 2001 to 6 December 2005 (the earliest date for\n                    contractual redelivery of the vessel). A majority of the House of Lords held\n                    that damages were to be so limited. As McGregor elucidates at [8-100], two\n                    principles underlay and justified the majority’s decision. The first is\n                    theBwllfaprinciple, which Lord Bingham of\n                    Cornhill described in the following terms at 371: It is that where the court making an assessment of damages has knowledge\n                        of what actually happened it need not speculate about what might have\n                        happened but should base itself on the known facts. In non-judicial\n                        discourse the point has been made that you need not gaze into the crystal\n                        ball when you can read the book. The second principle is the overriding compensatory principle that\n                    damages awarded for breach of contract should represent no more than the value\n                    of the contractual benefits of which a plaintiff has been deprived. InThe Golden Victory, the fact that the charterers would\n                    have cancelled on the outbreak of war had to be taken into account because war\n                    had, in fact, broken out and if the cancellation were to be ignored, the\n                    owner’s position would not have been restored but substantially improved.\n                    Applying these principles to the present case, theBwllfaprinciple dictates that the court should not close its\n                    eyes to the fact that the plaintiff does not, at this point in time, have any\n                    product that advertising services can attach to or be used for. Furthermore,\n                    since the plaintiff’s real loss is the prize (see [20]), an award of $70,000 in damages would\n                    also go against the compensatory principle since the prize is most certainly\n                    worth less than $70,000 in cash (see [16]). 22     The second case isRuxley. InRuxley, the contract\n                    was for a pool with a diving area 7 feet 6 inches deep. The completed pool was\n                    suitable for diving but the diving area was only 6 feet deep. The cost of\n                    rebuilding the pool to the specified depth was £21,560. The House of Lords\n                    held that the plaintiff in that case was not entitled to £21,560 and\n                    reinstated the trial judge’s award of £2,500 for loss of amenity.\n                    Lord Jauncey of Tullichettle (“Lord Jauncey”) held, at 357,\n                    that: Damages are designed to compensate for an established loss and not to\n                        provide a gratuitous benefit to the aggrieved party from which it follows\n                        that thereasonableness of an award of damages is to be\n                            linked directly to the loss sustained. [emphasis\n                        added] Ruxleywas admittedly concerned with a\n                    different issue, namely whether the measure of damages should be the difference\n                    in value or the cost of cure. Nevertheless, Lord Jauncey’s statement that\n                    thereasonablenessof an award of damages should\n                    be considered in determining what is theloss\n                        sustainedwas a general observation and ought to be applicable\n                    outside the confines of the specific issue inRuxley. In the present case, I am of the view that it would beunreasonableto award the monetary equivalent\n                    of advertising services when there is no possibility of advertising services\n                    being procured at this point in time. On the logic of Lord Jauncey’s\n                    observation, this would weigh in favour of a finding that theloss sustainedis the loss of the prize. (3)   Objective value of the prize 23     The assessment of the objective value of the\n                    prize, to the plaintiff, is a difficult task in light of the fact that no expert\n                    evidence was called by either party on this issue. The plaintiff simply took the\n                    position that the prize had a value of $70,000 whereas the defendant appears to\n                    have taken the position that the prize was worth nothing. 24     As discussed at[15]–[16], I do not\n                    agree that the prize was worth nothing but I also do not agree that the prize\n                    had a value of $70,000. The prize was not worth nothing because it had value to\n                    the plaintiff since it could be redeemed for $70,000 of advertising services,\n                    and the plaintiff did have products for which such advertising services could be\n                    used. At the same time, the value of the prize to the plaintiff would be reduced\n                    by the fact that the prize had an expiry date. This is because whereas the\n                    plaintiff could use cash to obtain advertising services at any point in time,\n                    the prizehadto be redeemed within a specific\n                    time period and that time period may not have been the best time for the\n                    plaintiff to advertise its product using this particular medium. The objective\n                    value of the prize to the plaintiff would steadily reduce as the expiry date\n                    drew closer. Indeed, if the prize had been assignable or transferable, potential\n                    buyers would similarly have been willing to pay less and less for the prize as\n                    the expiry date drew closer. The fact that the prize was not assignable or\n                    transferable would further reduce its objective value to the plaintiff as the\n                    prize could not be converted to cash, even if the plaintiff was willing to sell\n                    at a discount, should the plaintiff had required cash for other purposes or if\n                    it had determined that advertising during the redemption period was not\n                    appropriate. 25     As mentioned above at[23], it is difficult to attribute an objective value to the\n                    prize without the assistance of expert evidence, although one might validly ask\n                    how much expert evidence could really help in a case such as this. In any case,\n                    the court cannot shy away from the task of quantifying damages just because\n                    assessment is difficult. As Chitty states at [26-007]: The fact that damages are difficult to assess does not disentitle the\n                        claimant to compensation for loss resulting from the defendant’s\n                        breach of contract. Where it is clear that the claimant has suffered\n                        substantial loss, but the evidence does not enable it to be precisely\n                        quantified, the court will assess damages as best it can on the available\n                        evidence. The redemption period for the prize was for slightly less than 7\n                    months. It commenced on 1 June 2008 and ended on 31 December 2008.\n                    According to the Statement of Claim, the breach of contract occurred from late\n                    October 2008 to early January 2009. Taking late October 2008 as the reference\n                    point, the prize had a “life” of approximately 2 more months (out\n                    of the original 7 months redemption period) at the time of breach. In my view,\n                    this fact would have substantially reduced the value of the prize to the\n                    plaintiff at the material time (ie, the time of\n                    breach). The value of the prize to the plaintiff would be furthered reduced by\n                    the fact that it was not assignable or transferable. Considering these facts, I\n                    am of the view that a discount factor of 30% should be applied, and I find that\n                    the plaintiff’s loss with regard to the Clear Channel expenses amounts to\n                    $49,000 (for the loss of the prize). I also find that the plaintiff should be\n                    entitled to the $4,900 incurred as GST since this sum was also wasted due to the\n                    defendant’s breach. ActMedia 26     ActMedia owns the rights to use advertising\n                    space at various golf courses and driving ranges across Singapore (“golf\n                    media rights”) and licenses these rights for a fee. These golf media\n                    rights had actually been purchased by ActMedia, through its parent company Omni\n                    Marketing Group Asia Pte Ltd (“Omni”), from the plaintiff in an\n                    agreement dated 15 December 2006 (“the 15 December 2006\n                    agreement”). Pursuant to this agreement, the plaintiff was entitled to\n                    set off any fees incurred in the course of licensing golf media rights from\n                    ActMedia up to an amount of $600,000. For convenience, I shall refer to this as\n                    $600,000 of advertising credits. Clause 3.4 of the 15 December 2006\n                    agreement goes on to state that: ... The payment in the form of the aforesaid media spaceshall be taken up by the end of the year 2008in\n                        such manner as shall be pre-agreed by the parties hereto before such\n                        utilization accordingly. [emphasis added] The expenses incurred in relation to ActMedia amounted to $342,658.01.\n                    The plaintiff incurred these expenses when they licensed golf media advertising\n                    space from ActMedia in 2008. The expenses were paid using the balance of the\n                    $600,000 of advertising credits obtained under the 15 December 2006\n                    agreement. 27     The Defendant’s primary objection in\n                    relation to the ActMedia expenses is the same one mounted in relation to the\n                    Clear Channel expenses. In essence, the Defendant contends that the plaintiff\n                    has not suffered pecuniary loss and should not be allowed to recover the sum of\n                    $342,658.01 because the expenses were paid for using advertising\n                credits. 28     In my view, the principles that I have set out\n                    in relation to the Clear Channel expenses apply with equal force to the ActMedia\n                    expenses and I need not reiterate them. (1)   Plaintiff’s loss –licence for golf media\n                advertising space or the advertising credits? 29     The plaintiff’s loss in relation to the\n                    ActMedia expenses can be characterised either as the loss of the licence for\n                    golf media advertising space or as the loss of the advertising credits. Adopting\n                    the same line of reasoning that I employed at[18]in relation to the Clear Channel expenses, I find that the\n                    plaintiff had converted the advertising credits into the licence for golf media\n                    advertising space after the contract had been entered into and such conversion\n                    had been done in reliance of the contract. Therefore, if “18” had\n                    not been discontinued or if the plaintiff had some other product that the\n                    licence for golf media advertising space could be used for, I would have awarded\n                    the plaintiff damages measured by the objective value of the licence for golf\n                    media advertising space (ie,\n                $342,658.01). (2)   Characterisation of the plaintiff’s loss in light of\n                the fact that the plaintiff no longer has any product to advertise 30     However, the fact that the plaintiff no longer\n                    has any product to advertise must again be taken into consideration. As with the\n                    Clear Channel expenses, I find it illogical and artificial to award the monetary\n                    substitute for the licence for golf media advertising space when the plaintiff\n                    clearly does not have any product for which this advertising space can be used\n                    for. Moreover, such an award would over-compensate the plaintiff. Therefore, for\n                    similar reasons to those that are set out at[19]–[22], I am of the\n                    view that the plaintiff’s loss should be characterised as the loss of the\n                    advertising credits. (3)   Objective value of the advertising credits 31     The $600,000 of advertising credits formed\n                    part of the purchase price paid by Omni. Therefore, the objective value of the\n                    advertising credits, at the time that the 15 December 2006 agreement was\n                    entered into, would correspond to the increased sum that Omni would have had to\n                    pay if it had not granted the plaintiff $600,000 of advertising credits. In my\n                    view, it is unlikely that a reasonable seller, dealing at arm’s length,\n                    would accept $600,000 of advertising credits in place of $600,000 cash. This is\n                    especially so given that the advertising credits could not be assigned or\n                    transferred, and had to be used by the end of December 2008. If $600,000 of the\n                    purchase price was to be paid in advertising credits, I would think that a\n                    reasonable seller would demand a higher overall price. This would in turn mean\n                    that the objective value of the $600,000 of advertising credits would be less\n                    than $600,000. 32     Furthermore, as with the prize, the objective\n                    value of the advertising credits to the plaintiff would steadily reduce as the\n                    “expiry date” drew closer. The advertising credits could be used\n                    between 15 December 2006 and the end of December 2008, a period of slightly\n                    more than 2 years. At the time of the breach of contract, the advertising\n                    credits had a “life” of approximately 2 months (out of the\n                    original 24 months utilization period). Nevertheless, this must be considered in\n                    the context of clause 3.4, which states that: ... In the event that the said media space is not fully utilized by the\n                        end of year 2008, the Purchaser may at the request of the Vendor, extend the\n                        utilization period beyond 2008 provided always that the Vendor is able to\n                        show special circumstances for the non-full utilization at the end of year\n                        2008. In my view, the possibility of an extension of the utilization period\n                    (albeit on the showing of special circumstances) would ameliorate, to a certain\n                    extent, the impact of the “expiry date” on the objective value of\n                    the advertising credits. I also note that the defendant did not cross-examine\n                    the plaintiff’s witnesses substantially on the objective value of the\n                    advertising credits to the plaintiff. The defendant also did not lead any\n                    evidence (expert or otherwise) on this matter, although this was due to the fact\n                    that it took the position that the plaintiff was not entitled to recover\n                    anything in respect of the ActMedia expenses. Taking into consideration all the\n                    facts and circumstances outlined above, I am of the view that a discount factor\n                    of 20% should be applied, and I find that the plaintiff’s loss with regard\n                    to the ActMedia expenses is $274,126.40 (for the loss of the advertising\n                    credits). Groovy, Procolor and Big Bulb 33     The defendant’s primary objection to the\n                    expenses claimed in relation to Groovy, Procolor and Big Bulb rests on an\n                    alleged “nexus” between these companies and the plaintiff. To\n                    substantiate its assertion on the alleged “nexus”, the defendant\n                    relies on two pieces of evidence. First, the defendant relies on a newspaper\n                    article published in the Business Times where the plaintiff’s Mr Tan\n                    Muey Hwa (“Mr Tan”) acknowledged Groovy and Procolor to be\n                    his businesses. Second, the defendant relies on a people profile search showing\n                    that Big Bulb is “substantially owned by [Mr Tan’s] wife Madam\n                    Chua Boon Tin”. 34     However, a perusal of the people profile\n                    search of Mr Tan shows that while he used to be a director of Groovy and\n                    Procolor, he had ceased to be a director of these companies since 2006.\n                    Mr Tan explained that the Business Times article was outdated and that he\n                    had clarified that he no longer owned Groovy and Procolor but this had not been\n                    reflected in the article. With regard to Big Bulb, the people profile search of\n                    Mr Tan shows that he has never held any shareholding or directorship in Big\n                    Bulb. Mr Tan also gave evidence that he was already divorced from Madam\n                    Chua Boon Tin. 35     Furthermore, as the plaintiff’s counsel\n                    pointed out, if there was indeed a “nexus” between Groovy,\n                    Procolor, Big Bulb and the plaintiff, it would be logical that these companies\n                    would give the plaintiff a discount rather than overcharge it. Therefore, the\n                    defendant’s argument must be premised on someconspiracy or fraudby Groovy, Procolor, Big Bulb and the\n                    plaintiff to overcharge the plaintiff so that the plaintiff could recover these\n                    inflated expenses from the defendant. In my view, the “unusual\n                    circumstances” raised by the defendant are not sufficient to sustain an\n                    allegation of conspiracy or fraud. For example, the defendant points out that\n                    Groovy, Procolor and Big Bulb had not been paid by the plaintiff, and that\n                    despite not being paid, had not prosecuted their claims against the plaintiff in\n                    court. It may well be that Groovy, Procolor and Big Bulb had decided not to\n                    prosecute their claims at this point in time because of a good business\n                    relationship with Mr Tan, but this does not necessarily lead to the\n                    conclusion that there was a conspiracy or fraud. In any case, the\n                    defendant’s counsel had indicated at the hearing that the defendant did\n                    not intend to make such allegations. DC:    Given their nexus and close relationship, inquiry\n                            as to damages. Dodgy thing is that Mr Quek has not been paid\n                            anything yet. It’s in his affidavit. This should have been\n                            exhibited. PC:    This goes back to the issues canvassed at the\n                            [summary judgment], which are not relevant here. At the summary judgment\n                            on the question of liability, Defendant raised defence that there was\n                            some grand conspiracy by Plaintiff to defraud Defendant by entering into\n                            inflated claims. That defence was found to be a sham. Now they are\n                            raising these issues again without having pleaded any of\n                        this. DC:You will notice that we have\n                                not raised any issue of scam or fraud. Inquiry as to\n                            damages. [emphasis added] In my view, it is not sufficient for the defendant to simply allege a\n                    “nexus” between Groovy, Procolor, Big Bulb and the plaintiff or to\n                    allege that the facts “give rise to suspicion”. It is incumbent on\n                    the defendant to prove that the expenses claimed had been inflated pursuant to\n                    some conspiracy or fraud. This had not been done. Therefore, I find no merit in\n                    the alleged “nexus” argument put forth by the\n                defendant. 36     I now turn to consider whether the expenses\n                    incurred in relation to Groovy, Procolor and Big Bulb are inflated, unusual or\n                    special such as to warrant further scrutiny pursuant to the decision inRobertson Quay. The claims in relation to\n                    Procolor and Big Bulb are for relatively small sums, $1,637.10 and $3,210\n                    respectively. The defendant has also not adduced any evidence that these\n                    expenses were inflated, unusual or special. Therefore, I award the plaintiff the\n                    full sums that it claimed in relation to Procolor and Big Bulb, namely the sums\n                    of $1,637.10 and $3,210 respectively. 37     The $50,000 claimed by the plaintiff with\n                    regard to the Groovy expenses was for photography services. Groovy charged the\n                    plaintiff $15,000 for photographs of the “18” bottles, and $35,000\n                    for photographs of models posing with “18”. The plaintiff has\n                    produced invoices from Groovy which state the amounts charged. According to\n                    Mr James Quek Boon Chuan (“Mr Quek”) of Groovy, these\n                    fees are typical of projects similar in nature to the one undertaken by the\n                    plaintiff. He added that the plaintiff had been given a slight discount on the\n                    fees charged. To substantiate its allegation that Groovy’s fees are\n                    unusually high, the defendant relies on a quotation by Photography By Eulee\n                    (“Eulee”) and on invoices by Aziodes Studio\n                    (“Aziodes”). According to the quotation by Eulee, Eulee would\n                    charge $500 for the photography services, product photography for a maximum of\n                    10 products, processing of a maximum 20 images and rights for unlimited usage.\n                    The invoices by Aziodes showed that it had charged $3,000 for photography\n                    services and unlimited usage of photographs of 12 infants, and had charged\n                    $2,500 for photography services and unlimited usage of photographs involving 5\n                    athletes. 38     At the outset, I note that the quote by Eulee\n                    and the invoices by Aziodes are hearsay as the maker of these documents had not\n                    been called to give evidence in court. The hearsay nature of these documents is\n                    especially critical in the present case because the quote and the invoices may\n                    have been for photography services that are not comparable to the photography\n                    services provided by Groovy. Since the makers of these documents had not been\n                    called to give evidence in court, the plaintiff could not cross-examine them on\n                    this point. In any case, I accept Mr Tan’s uncontradicted testimony\n                    that the fees charged by photography companies can vary substantially. This is\n                    because the fees charged for photography services would logically depend on a\n                    multitude of factors, such as the clientele targeted as well as the fame, skill\n                    and experience of the photographers. For example, as Mr Tan pointed out, if\n                    a famous photographer like John Clang had taken the photographs, his fees would\n                    likely have been far in excess of $50,000. Therefore, to prove that the fees\n                    charged by Groovy were inflated, unusual or special, the defendant would need to\n                    call expert evidence to this effect, preferably from a company that undertakes\n                    projects similar to those undertaken by Groovy. This was not done. In these\n                    circumstances, I find that the plaintiff’s loss with regard to the Groovy\n                    expenses is the $50,000 claimed. Raffles Digital 39     The defendant made no submissions as regards\n                    the Raffles Digital expenses. As such, I find that the plaintiff’s loss\n                    with regard to the Raffles Digital expenses is the $26,373.09\n                claimed. Catalyst 40     Catalyst is an advertising agency. The\n                    plaintiff had engaged Catalyst to run the advertising and promotional campaign\n                    for “18”. The expenses incurred in relation to Catalyst amounted\n                    to a sum of $199,369.87. The work done by Catalyst included overseeing the\n                    concept and strategy of the advertising and promotional campaign for\n                    “18”, coming up with the slogan (ie,\n                    “18 – Thirst for Life”), designing the logo for this slogan,\n                    designing the bottle labels, designing the carton boxes, designing the stickers\n                    for chiller fridges and vending machines, designing the posters and\n                    advertisements, designing the product brochures and organizing the launch event\n                    at Cineleisure. 41     The defendant argued that the plaintiff has\n                    not adduced sufficient proof of its loss because it did not adduce evidence of\n                    the breakdown of man hours spent on the work or of the exact amount of time and\n                    effort expended by Catalyst in carrying out the work done. The defendant’s\n                    argument is based on the notion that the purpose of the assessment hearing is to\n                    satisfy the court, amongst other issues, of “the true value of the work\n                    done by Catalyst”. However, as held inRobertson\n                        Quayat [31], a plaintiff\n                    would generally discharge its burden of proving loss as long as it adduces\n                    cogent evidence of the loss suffered. Since the reference is tothe loss suffered, I am of the view that the plaintiff\n                    would discharge its burden of proving loss if it adduces cogent evidence that\n                    Catalyst had indeed charged the plaintiff for the expenses claimed. There is no\n                    additional requirement that the plaintiff justify the amount charged by Catalyst\n                    unless the fees charged appear to be inflated, unusual or special. 42     The plaintiff has produced the relevant\n                    invoices, the underlying correspondence, and the work product. In my view, these\n                    documents show that work had actually been done, and that the plaintiff had been\n                    charged for the sums claimed. Ms Lynette Ng Siu Lien (“Ms\n                    Ng”) had also been called as a witness to confirm the expenses by the\n                    plaintiff and to explain the type of work done. For example, Ms Ng\n                    explained that the $40,000 charged for bottle label design was for 4 versions\n                        (ie, $10,000 for each version) and went\n                    towards “art direction, supervision, copy”. She also pointed out\n                    that each label had included trivial surrounding the number 18 (eg, the game of basketball was created with 18 players\n                    in 1891). Although the defendant did manage to point out several inconsistencies\n                    in Ms Ng’s evidence, I am of the view that these inconsistencies\n                    arose from a misunderstanding of the questions put to her, and were not, in any\n                    case, consequential. The point is that the plaintiff has producedprima facieevidence of the loss it had suffered.\n                    Therefore, the onus lay on the defendant to show that the fees charged were\n                    inflated, unusual or special. To prove this, the defendant would need to call\n                    expert evidence to this effect. This was not done. In these circumstances, I\n                    find that the plaintiff’s loss with regard to the Catalyst expenses is the\n                    $199,369.87 claimed. Miscellaneous advertising expenses 43     The plaintiff also made several smaller claims\n                    for advertising expenses that amounted to a sum of $4,638.95. The defendant made\n                    no submissions as regards these expenses. As such, I find that the\n                    plaintiff’s loss with regard to these miscellaneous expenses is the\n                    $4,638.95 claimed. The general objection (1)   The applicable law 44     The defendant’s general objection is\n                    that the amount of advertising expenses claimed is so large that it could not\n                    have been within the parties’ reasonable contemplation, and should thus be\n                    irrecoverable for being too remote. InMFM Restaurants Pte\n                        Ltd v Fish & Co Restaurants Pte Ltd[2011] 1 SLR 150\n                        (“MFM Restaurants”), the Court\n                    of Appeal held that the two limbs set out inHadley v\n                        Baxendale(1854) 9 Exch 341 (“Hadley”) remain the governing principles in relation to\n                    the doctrine of remoteness of damage in contract law. The modern statement of\n                    the rule inHadley, as stated in Chitty at\n                    [26-054], reads: The combined effect of these cases may be summarised as follows: A type or\n                        kind of loss is not too remote a consequence of a breach of contract if, at\n                        the time of contracting (and on the assumption that the parties actually\n                        foresaw the breach in question), it was within their reasonable\n                        contemplation as a not unlikely result of that breach. 45     As explained inVictoria\n                        Laundry v Newman[1949] 2 KB 528 (“Victoria Laundry”) at 539, what would be in the\n                    reasonable contemplation of parties depends on the knowledge then possessed by\n                    the parties. The court went to state that: ... For this purpose, knowledge \"possessed\" is of two kinds; one imputed,\n                        the other actual. Everyone, as a reasonable person, is taken to know the\n                        \"ordinary course of things\" and consequently what loss is liable to result\n                        from a breach of contract in that ordinary course. This is the subject\n                        matter of the \"first rule\" inHadley v.\n                            Baxendale. But to this knowledge, which a contract-breaker is\n                        assumed to possess whether he actually possesses it or not, there may have\n                        to be added in a particular case knowledge which he actually possesses, of\n                        special circumstances outside the \"ordinary course of things,\" of such a\n                        kind that a breach in those special circumstances would be liable to cause\n                        more loss. Such a case attracts the operation of the \"second rule\" so as to\n                        make additional loss also recoverable. 46     As Chitty states at [26-058], the reference to\n                    “the loss” in the formulations of the test for remoteness of\n                    damages is to be interpreted as the type or kind of loss in question. In other\n                    words, it is thetypeof loss that must be in the\n                    reasonable contemplation of the parties, not the precise detail orquantumof the damage. InZicom Pte\n                        Ltd v Antara Koh Pte Ltd[1997] SGHC 215 at [97],\n                    Judith Prakash J cited the case ofChristopher Hill Ltd\n                        v Ashington Piggeries Ltd[1969] 3 All ER 1496 which held, at\n                    1524, that: In order to establish liability for the damage caused by a breach of\n                        contract, the party who had suffered damage does not have to show that the\n                        contract-breaker ought to have contemplated, as not being unlikely, the\n                        precise detail of the damage or the precise manner of its happening.It is enough if he should have contemplated that\n                            damage of that kind is not unlikely. [emphasis added] The case ofWroth v Tyler[1974] 1 Ch 30\n                    is also instructive. In that case, the plaintiff buyers of a house claimed\n                    damages from the defendant seller for his failure to complete. The court held\n                    that the plaintiffs were entitled to claim as damages the market price of a\n                    similar house at the time of the judgment less the contract price, being the\n                    “reliance loss” suffered by the plaintiffs as a result of the\n                    breach, although the rise in property prices over the relevant period had been\n                    of an unprecedented magnitude. The court reasoned, at 60–61, as\n                    follows: Here, the parties contemplated a rise in house prices, but not a rise of\n                        an amount approaching that which in fact took place. A rise which nearly\n                        doubled the market price of the property was, as the evidence showed,\n                        outside the contemplation of the parties, and so it could not be recovered.\n                        Thus ran the argument. I do not think that this can be right.On principle, it\n                            seems to me to be quite wrong to limit damages flowing from a\n                            contemplated state of affairs to the amount that the parties can be\n                            shown to have had in contemplation, for to do this would\n                        require evidence of the calculation in advance of what is often incalculable\n                        until after the event. The function of the so-called \"second rule\" inHadley v. Baxendale, 9 Exch. 341, seems to\n                        me to be not so much to add to the damages recoverable as to exclude from\n                        them any liability for any type or kind of loss which could not have been\n                        foreseen when the contract was made.No authority was put\n                            before me which appeared to me to provide any support for the alleged\n                            requirement that the quantum should have been in\n                            contemplation. So far as it went, the language used in the\n                        authorities that were cited seems to me to have been directed to the heads\n                        of damage rather than to quantum. Similarly, inBrown v KMR Service[1995]\n                    4 All ER 598, the defendants argued unsuccessfully that the\n                    catastrophic losses suffered by the plaintiffs as a result of becoming members\n                    of high risk syndicates were too remote on the basis that the scale and\n                    magnitude of the financial disasters which struck were unprecedented and\n                    therefore unforeseeable. Since it must always have been foreseeable, and a not\n                    unlikely result, that the plaintiffs might suffer some financial loss from their\n                    excessive exposure, it was immaterial to their liability that the degree of that\n                    loss was unforeseeable. 47     Nevertheless, as Chitty points out at\n                    [26-058]: The application of the test for remoteness to a particular set of facts\n                        therefore depends largely on the judicial discretion to categorise losses\n                        into broad categories, without requiring any contemplation of the precise\n                        manner in which the loss was caused, or of the precise details of the\n                        loss. In other words, the concept of type of loss is a fluid one and the\n                    appropriate characterisation of the type of loss suffered will depend heavily on\n                    the particular set of facts before the court. For example, “loss of\n                    profit” can obviously be characterised as a type of loss. However, inVictoria Laundry, the court distinguished\n                    between profits from different activities, namely between loss of laundry\n                    profits and loss of profits from especially lucrative dyeing\n                contracts. (2)   The type of loss that was in the reasonable contemplation of\n                the parties 48     Having set out the applicable law, I now turn\n                    to consider the arguments advanced by the plaintiff and the defendant. The\n                    plaintiff argued that since advertising expenses as a type of loss must have\n                    been in the reasonable contemplation of the parties, such loss should be\n                    recoverable regardless of the quantum of the loss. 49     The defendant argued that it could not have\n                    reasonably contemplated that such a large amount of advertising expenses would\n                    be incurred because it viewed the contract as a simple supply contract for\n                    modest quantities of “18” (the minimum order being just 1 trailer\n                    load) for a minimum period of just 2 years. It was not aware that the plaintiff\n                    would be embarking on a massive advertising campaign that was disproportionate\n                    to the volume of sales or revenue, and in any case, had not assumed\n                    responsibility for the financial consequences of the plaintiff’s failed\n                    branding exercise because it had no obligation under the contract to help the\n                    plaintiff build the “18” brand. The corollary to the plaintiff\n                    being the sole bearer of the risk of the branding exercise was that the\n                    plaintiff alone would enjoy a potential upside of the brand becoming\n                    famous. 50     If Lord Hoffmann’s approach inTransfield Shipping Inc v Mercator Shipping Inc[2009]\n                    1 AC 61 (“The Achilleas”)\n                    is adopted, it might perhaps be said that the defendant had not assumed\n                    responsibility for the consequences of the plaintiff’s failed branding\n                    exercise, and that the loss suffered is thus too remote. However, inMFM Restaurants, the Court of Appeal expressly declined\n                    to follow Lord Hoffmann’s approach inThe\n                        Achilleas. The defendant’s argument on assumption of\n                    responsibility is therefore a non-starter. 51     The defendant’s argument that it could\n                    not have reasonably contemplated the amount of advertising expenses incurred\n                    similarly misses the point because it is thetypeof loss that needs to be in the parties’ reasonable contemplation, not the\n                    amount orquantumof the loss. However, as\n                    discussed at[47], the concept of type of\n                    loss is fluid. The type of loss can be defined broadly or narrowly. If the type\n                    of loss is defined broadly asadvertising\n                    expenses, it would follow that this type of loss would have been in\n                    the reasonable contemplation of the parties, and the advertising expenses\n                    claimed would not be too remote. In the case of a contract for the supply of\n                    drinks for sale to consumers, I think it must ordinarily be in the\n                    parties’ reasonable contemplation that advertising expenses would be\n                    incurred and that such expenses may be wasted should the supplier breach the\n                    contract by supplying defective drinks. As such, there is no need to prove\n                    actual knowledge since this knowledge would be imputed to the parties. In this\n                    regard, the case authorities show that the courts have allowed plaintiffs to\n                    recover advertising expenses which have been wasted as a result of the\n                    defendants’ breaches without requiring that the plaintiffs prove that the\n                    defendants had actual knowledge that advertising expenses would be incurred (seeWalhane v Wendy’s Supa Sundaes[2000]\n                    SADC 39 at [72];G W\n                        Sinclair & Company v Cocks[2001] VSCA 47 at [54]–[55]). 52     Having said that, I do not think that such a\n                    broad characterisation of the type of loss is appropriate. In my view, there is\n                    distinction insubstancebetween expenses incurred\n                    innationwide advertisingand expenses incurred inregional or worldwide advertising. The\n                    strategy and concept, the mediums used for advertising, the market research, the\n                    type of launch events, and even the models used in a regional or worldwide\n                    advertising campaign would all likely be different from that of a nationwide\n                    advertising campaign. The question may then validly be asked whether a\n                    distinction can similarly be drawn between normal advertising expenditure and\n                    high-end advertising expenditure. I do not think that it is useful to draw a\n                    distinction between normal advertising expenditure and high-end advertising\n                    expenditure because the only thing that truly distinguishes normal advertising\n                    expenditure from high-end advertising expenditure is thequantumof money spent and this translates to the quantum of the\n                    loss in a claim for “reliance loss”. Therefore, if the court were\n                    to distinguish between normal advertising expenditure and high-end advertising\n                    expenditure, it would in effect be requiring parties to have reasonably\n                    contemplated thequantumof the\n                loss. 53     Coming back to the case at hand, I am of the\n                    view that under the first limb ofHadley, the type\n                    of advertising in the reasonable contemplation of the parties was nationwide\n                    advertising because there had been no reference anywhere in the contract to\n                    delivery of “18” to locations overseas, and the prospect of\n                    regional or worldwide advertising never came up in the parties’\n                    discussions apart from a solitary mention of the possibility of Tiger Woods\n                    endorsing “18” which never materialised. Therefore, I am of the\n                    view that all advertising expenses incurred in nationwide advertising should be\n                    recoverable, but all advertising expenses incurred in relation to regional or\n                    worldwide advertising would be irrecoverable for being too remote unless the\n                    defendant had actual knowledge that these expenses would be\n                incurred. 54     Most of the advertising expenses in the\n                    present case were incurred as part of a nationwide advertising campaign, and\n                    would thus not be regarded as too remote. For example, the photographs were not\n                    used in any overseas advertising, the advertisements at bus-stops and on golf\n                    dividers were all placed in Singapore, and the press release was for a launch\n                    event in Singapore. The only exception pertains to certain expenses incurred in\n                    relation to Catalyst. In cross-examination, Ms Ng admitted that a premium\n                    was charged on certain expenses because “18” had the potential to\n                    compete on the global stage. The relevant portions of the cross-examination are\n                    as follows: Q:    Bearing in mind that there are 13 invoices, say\n                            strategy and concept you say $20,000, this is based on man\n                        hours? A:    Explain how we charge for strategy and concept.\n                            Typically it’s a rounded figure. Depending on the scope of work\n                            the client requires, our agency starts from $5,000 to $40,000 based on\n                            the scope of work. In part based on the number of hours we spend working\n                            on it and depend[s] on the product and brand itself then we levy a\n                            premium on it. “18” has the potential to compete on a\n                            global stage, so for a brand like that, the fee we charge is higher as\n                            compared to a product on a smaller basis, for example, the Singapore\n                            market. ... Q:    For strategy and concept, you say between $5,000\n                            and $40,000? A:    In this case we came up with the name and\n                            strapline. Q:    Mr [Tan] said to you that he had this brand\n                            that could be a huge global phenomenon, is that what he\n                        said? A:    He said he had this idea for a sports drink. But\n                            based on his earlier success with “Anything” and\n                            “Whatever”, we thought this had the potential to be a\n                            product that would compete on the global stage. Q:    From what he told you, surmised that it would [go]\n                            global? A:    It had the potential to. Q:    Did he tell you he expected it to go global or\n                            surmise yourself? A:    Primary discussion was to launch in Singapore\n                            first, then take it outside Singapore. Q:    Do the same considerations go into logo and\n                            strapline? Apply same sort of premium? A:    That’s right. Q:    If it’s just a local product for local\n                            consumption, what is the range you have here? A:    Within the advertising world, many different items\n                            we charge for. In this particular case, it’s the brand. It’s\n                            a critical thing for “18”. For plain advertisements\n                            competing on the local stage, we charge from $5,000\n                        onwards. Ct:    For strapline and logo or strategy [and]\n                            concept? A:    Starting at $5,000 each. 55     As discussed at[52], the type of advertising expenses that would have been in\n                    the parties’ reasonable contemplation is nationwide advertising.\n                    Therefore, insofar as a premium was charged because of the potential of\n                    “18” to go global, this would be irrecoverable for being too\n                    remote unless the defendant had actual knowledge of the real possibility of\n                    “18” going global. On the facts before me, there is no evidence\n                    that the defendant had such actual knowledge. According to Ms Ng, Catalyst\n                    would charge $5,000 onwards for “strategy and concept” and\n                    “logo and strapline” in the case of products competing on the\n                    local stage. In the circumstances, I reduce the damages with regard to these\n                    expenses from $20,000 and $25,000 to $5,000 each. (3)   Whether the plaintiff would have recouped its\n                expenditure 56     Where the claim is for “reliance\n                    loss”, there is one further limitation to the full recovery of loss that\n                    is both validly incurred and not too remote. As held inCCC\n                        Films (London) v Impact Quadrant Films[1985] QB 16\n                        (“CCC Films”) at 32, a plaintiff\n                    should only be entitled to recover its wasted expenditure to the extent that\n                    such expenses could have been recovered if the contract had been properly\n                    performed. In this regard, Hutchison J went on to state, at 40, that where a\n                    defendant’s breach prevents the plaintiff from exploiting the subject\n                    matter of the contract, it would be fair to place the burden of proving that the\n                    plaintiff would not recoup its expenditure on the defendant. 57     The present case is similar toCCC Films. By supplying the plaintiff with defective\n                    “18”, the defendant had caused the plaintiff to discontinue\n                    “18” after less than 4 months in the market, thereby making it\n                    impossible for the plaintiff to prove the amount of profits it would have\n                    earned. As such, the burden should be on the defendant to prove, on the balance\n                    of probabilities, that the plaintiff would not have recouped the advertising\n                    expenses even if the defendant had not breached the contract. 58     In support of its assertion that the plaintiff\n                    would not have recouped its advertising expenses, the defendant relies on the\n                    sales figures of “18” from October 2008 to January 2009, which the\n                    defendant argued indicate that the plaintiff would not have recovered\n                    advertising expenses in excess of $700,000 even if the defendant had not\n                    breached its obligations. I am of the view that this is not sufficient evidence\n                    to support a finding that the plaintiff would not have recouped its expenditure\n                    even if the contract had been properly performed. As the plaintiff’s\n                    counsel pointed out, the defendant’s analysis of the sales figures of\n                    “18” simply took the sales revenue from October 2008 to January\n                    2009 and multiplied it over a period of 2 years. This computation does not\n                    factor in potential growth in sales over time. Furthermore, the contract was\n                    stated to be for aminimumperiod of 2 years. As\n                    such, parties clearly contemplated that “18” would be sold for at\n                    least 2 years, and potentially for a longer period after that. As held inCommonwealth of Australia v Amann Aviation(1991) 66 ALJR 123, the prospect of securing a renewal of a contract can be\n                    properly taken into account in a determination of whether the plaintiff would\n                    have recouped its expenditure had the contract been properly performed. In these\n                    circumstances, I am of the view that the defendant has failed to discharge its\n                    burden of proving that the advertising expenses would not have been recouped if\n                    the contract had been properly performed.",
        "Drinks and bottle moulds": "59     A total of $39,648.90 was paid by the\n                    plaintiff to the defendant for the “18” and the bottle moulds. The\n                    plaintiff claimed this amount from the defendant on the basis that these\n                    expenses were incurred in reliance of the contract and had been wasted as a\n                    result of the defendant’s breach. Although the plaintiff enjoyed some\n                    sales revenue from “18”, this benefit has been accounted for in\n                    the reduction of the overall amount of expenses claimed by $22,071.91, this sum\n                    being the sales revenue of “18”. 60     I am satisfied that these expenses had\n                    genuinely been incurred, and had been wasted as a result of the\n                    defendant’s breach. I have considered the defendant’s various\n                    objections to the plaintiff recovering this sum, but I find no merit in any of\n                    these objections. Therefore, I award the plaintiff the full sum of $39,648.90\n                    claimed.",
        "Warehouse and forklift": "61     The defendant accepted that the parties knew\n                    or ought to have reasonably contemplated that the plaintiff would incur expenses\n                    in relation to the renting of the warehouse and the forklift. However, it\n                    objected to the full recovery of these expenses on two grounds. First, it argued\n                    that the rental of the warehouse and the forklift was not in reliance of the\n                    contract because the rental agreement for the warehouse (“the rental\n                    agreement”) was entered into before the contract had been entered into.\n                    Second, it argued that it would be unjust to foist these expenses on the\n                    defendant alone because the plaintiff had used the warehouse and the forklift\n                    for “Anything” and “Whatever”. I will deal with\n                    these arguments in turn. 62     In my view, the fact that the rental agreement\n                    was entered into before the contract had been entered into would not preclude\n                    the plaintiff from recovering such expenses. As held inAnglia TV v Reed[1972] QB 60 at 64: If the plaintiff claims the wasted expenditure, he is not limited to the\n                        expenditure incurredafterthe contract was\n                        concluded. He can claim also the expenditure incurredbeforethe contract, provided that it was such as would\n                        reasonably be in the contemplation of the parties as likely to be wasted if\n                        the contract was broken. [emphasis in original] The contract was for purchase of “18” in bulk from the\n                    defendant for the purpose of distribution to potential customers. Therefore, the\n                    defendant must have reasonably contemplated that a warehouse and forklift would\n                    be rented, and that such expenses would be wasted if the contract was broken.\n                    Further, the unchallenged evidence of the plaintiff’s Mr Tan and\n                    Ms Yong Kai Fern (“Ms Yong”) was that the plaintiff had come\n                    up with the idea for “18” in or around September 2007, before the\n                    rental agreement was entered into on 12 March 2008. Mr Tan also testified\n                    that he had rented the warehouse and the forkliftfor“18” and Ms Yong stated, in her\n                    affidavit, that the warehouse was used almost entirely for the storage of\n                    “18” from October 2008 onwards. In these circumstances, the\n                    expenses in relation to the rental of the warehouse and the forklift should be\n                    recoverable as they had been incurred in reliance of the contract, and had been\n                    wasted because of the defendant’s breach. 63     The defendant’s Mr Raymond Ker Bock\n                    Chuan (“Mr Ker”) testified that he had noticed, during his\n                    various visits to the plaintiff’s warehouse, that the warehouse was used\n                    to store “Anything” and “Whatever”. He also\n                    testified that he had seen the forklift being used to transport\n                    “Anything” and “Whatever” to clear up space for his\n                    goods. Mr Tan also did not deny that “Anything” and\n                    “Whatever” had been stored in the warehouse even after October\n                    2008, although he qualified this by saying that “very little” had\n                    still be stored. 64     In my view, even if the warehouse and the\n                    forklift had been used for “Anything” and\n                    “Whatever”, the plaintiff should still be entitled to recover the\n                    expenses incurred in renting the warehouse and the forklift. This is because it\n                    was within the reasonable contemplation of the parties that the plaintiff would\n                    have to rent the warehouse and forklift to store and transport\n                    “18”. It is also the unchallenged evidence of the\n                    plaintiff’s Mr Tan that the sole reason why the plaintiff rented the\n                    warehouse and the forklift was in order to store and transport\n                    “18”, not “Anything” and “Whatever”.\n                    This is because the plaintiff had engaged another company, P H Marketing, to\n                    distribute “Anything” and “Whatever” and P H\n                    Marketing had its own warehouse where the drinks could be stored. The fact that\n                    free space in the warehouse was used to store “Anything” and\n                    “Whatever” does not detract from the fact that the entire\n                    warehouse and the forklift had been leased for the purpose of storing and\n                    transporting “18”. In these circumstances, I award the plaintiff\n                    the full sum of $36,241.82 claimed as expenses incurred in renting the warehouse\n                    and the forklift.",
        "Expenses incurred as a result of the recall of\n                “18”": "65     As a result of the recall of\n                    “18” that was precipitated by the defendant’s breach, the\n                    plaintiff was forced to incur further expenses. First, the plaintiff had to\n                    engage a transport company to assist with the retrieval of vending machines and\n                    chillers fridges from its customers. Second, the plaintiff was under contractual\n                    obligations to many of its customers to supply them with drinks. As such, the\n                    plaintiff had to purchase sports drinks of another brand, Sportade, from a\n                    competing distributor to replace the remainder of the “18”\n                    recalled. Third, the plaintiff had to engage a disposal company to dispose of\n                    the “18” in the presence of an AVA officer. These expenses\n                    amounted to $7,549.29. 66     In my view, these expenses were clearly\n                    consequential pecuniary losses that should be recoverable. Therefore, I award\n                    the plaintiff the full sum of $7,549.29 claimed as expenses incurred as a result\n                    of the recall of “18”.",
        "Fridge and vending machine expenses": "67     The defendant accepted that the expenses\n                    incurred by the plaintiff in purchasing fridges and vending machines are losses\n                    which the plaintiff would be entitled to recover from the defendant, subject to\n                    mitigation. However, the defendant argued that the plaintiff should not be\n                    allowed to recover these expenses in full because it did not address the court\n                    satisfactorily as to why they decided to discontinue “18” instead\n                    of engaging an alternative manufacturer. In this regard, the defendant relied on\n                    3 quotes from O-Dean Food Industry (“O-Dean”), Foshan Sanshui\n                    (“Foshan”) and Universal NutriBeverage (“Universal”)\n                    to show that there were alternative manufacturers that the plaintiff could have\n                    engaged, and that these manufacturers would have charged less than the amount\n                    charged by the defendant. 68     At the outset, I note that the quotes by\n                    O-Dean and Foshan indicate that they use a “hot fill” process\n                    whereas the “18” bottle moulds could only be used for “cold\n                    fill”. The “18” bottles also used a sports cap but the\n                    quote from Universal applied to bottles which do not have a sports cap. In light\n                    of these differences, it might not have been feasible for the plaintiff to\n                    engage O-Dean, Foshan or Universal as an alternative manufacturer. 69     In any case, I am of the view that the\n                    plaintiff had acted reasonably when it decided to discontinue\n                    “18”. It had first afforded the defendant the opportunity to\n                    remedy the defects. It then attempted to source for an alternative manufacturer.\n                    In this regard, I accept Mr Tan’s evidence that he had contacted\n                    O-Dean personally to ask them for a quote, but that there had been no reply.\n                    Mr Tan also testified that he tried to find alternative suppliers on Ali\n                    Baba, but his efforts were hampered by the defendant’s failure to provide\n                    the plaintiff with a copy of the “18” formula or the\n                    specifications for its bottles. The plaintiff only decided to discontinue the\n                    “18” brand after the AVA directed the recall of all stocks of\n                    “18” and put up an advisory warning against the consumption of\n                    “18”. By this time, the “18” brand would have been\n                    irretrievably damaged, and it would thus not have made sense for the plaintiff\n                    to continue searching for an alternative manufacturer. 70     In these circumstances, I find that the\n                    plaintiff had acted reasonably to mitigate its losses. The plaintiff’s\n                    claim for losses incurred in purchasing the fridges and the vending machines for\n                    “18” already excludes the amounts recovered by the plaintiff from\n                    the sale of the fridges and the vending machines. Therefore, I award the\n                    plaintiff the full sum of $15,657.19 that it claimed as fridge and vending\n                    machine expenses.",
        "Conclusion": "71     For the foregoing reasons, I award the\n                    plaintiff the following sums as damages: (a)$53,900 for the Clear Channel\n                        expenses;(b)$274,126.40 for the ActMedia\n                        expenses;(c)$50,000 for the Groovy expenses;(d)$1,637.10 for the Procolor\n                        expenses;(e)$3,210 for the Big Bulb expenses;(f)$26,373.09 for the Raffles Digital\n                            expenses;(g)$164,369.87 for the Catalyst\n                        expenses;(h)$4,638.95 for the miscellaneous advertising\n                            expenses;(i)$39,648.90 for the payments for drinks and bottle\n                            moulds;(j)$36,241.82 for warehouse and forklift\n                            expenses;(k)$7,549.29 for the expenses incurred as a result\n                            of the recall;(l)$15,657.19 for the fridge and vending machine\n                            expenses.72     After deducting the $22,071.91 of sales\n                    revenue from “18”, the total quantum of damages awarded is\n                    $655,280.70. I will now hear the parties on costs."
    }
}