{
    "case_title": "Azman Bin Jamaludin\n      v\n      Public Prosecutor",
    "ncitation": "[2011] SGHC 250",
    "coram": "Chan Sek Keong CJ",
    "sections": {
        "Background": "2       The background of this Application is set out in\n                    the affidavit of Joseph Liow Wang Wu, counsel for the Applicant, filed on\n                    29 June 2011. The Applicant was initially charged in the District Court\n                    with two charges: (a) one under s 8(b)\n                    read with s 33A of the Misuse of Drugs Act (Cap 185, 2008 Rev Ed)\n                    (“the MDA”) for unlawful drug consumption; and (b) one under\n                    s 31(2) of the MDA for failing, without reasonable excuse, to provide a\n                    sample of his urine as required by a police officer on 13 June 2010. At the\n                    material time, the Applicant was being treated at Changi General Hospital\n                    (“CGH”) for head injuries. The Prosecution proceeded with the\n                    second charge after the District Court stood down the first charge of unlawful\n                    drug consumption. 3       At the trial, a prosecution witness\n                    (“PW5”), a police officer, testified that the Applicant had\n                    refused to give a urine sample when PW5 requested for it at CGH. The Prosecution\n                    sought to rely on entries in a station diary (“P5”) to corroborate\n                    PW5’s testimony. P5 contained entries that showed that between 10.00am and\n                    11.30am on 13 June 2010, the Applicant had been requested on nine occasions\n                    to provide his urine sample and had refused. An inculpatory statement that the\n                    Applicant had given to the police (“the Inculpatory Statement”),\n                    in which he admitted to refusing to give a specimen of his urine, was also\n                    tendered and admitted in evidence. 4       The Applicant’s testimony at the trial was\n                    that he had been requested to give his urine sample only once – at a time\n                    when he was unable to urinate due to a medical condition. However, the Applicant\n                    was unable to specify the time when this request was made. A defence witness\n                    (“DW2”), a medical doctor, gave evidence that at CGH, the\n                    Applicant had a Glasgow Coma Score (“GCS”) of 13–14 upon\n                    admission to CGH and subsequently in the early hours of 13 June 2010. DW2\n                    also testified that the Applicant’s GCS score was observed to be normal\n                    (at 15) at 11.00am on 13 June 2010. His opinion was that it was possible\n                    that the Applicant might not have been able to provide a urine sample when\n                    requested if his GCS score had been abnormal at that time. 5       The Defence and the Prosecution made their\n                    respective closing submissions on 18 May 2011. Defence counsel argued that\n                    the Prosecution had not proved beyond a reasonable doubt that: (a) the\n                    Applicant could have provided a urine sample before 11.00am on 13 June\n                    2010; or (b) any further request was made to the Applicant to provide a\n                    urine sample after that hour. Defence counsel pointed out that: (a) the\n                    entries in P5 were not reliable on the ground,inter\n                        alia, that PW5 had admitted that parts of it had been amended and\n                    had been written not by him, but by another police officer called\n                    Corporal Hakim (“Cpl Hakim”); (b) the Inculpatory\n                    Statement was not reliable on the ground,inter\n                        alia, that it contained uncorrected errors (eg, the word “today” was used to describe a\n                    passage written the day before), thus raising a reasonable doubt as to whether\n                    the statement had been read back to the Applicant; (c) the Applicant made\n                    the Inculpatory Statement within 20 minutes after making a prior exculpatory\n                    statement (“the First Statement”), purportedly to clarify his\n                    earlier position and to state that he had refused to give a urine sample; and\n                    (d) the Applicant had testified that he had signed the Inculpatory\n                    Statement and the First Statement when requested to do so, although they had not\n                    been read back to him, because he felt that he had no choice in the\n                    matter. 6       Defence counsel also argued that the Prosecution\n                    had failed to call Cpl Hakim to testify, and, therefore, the court should\n                    draw an adverse inference against the Prosecution with respect to the matters\n                    that Cpl Hakim could have testified to. 7       The Prosecution, in reply, informed the DJ that\n                    the probable reason why Cpl Hakim was not called was that the Prosecution\n                    already had the evidence of PW5 and also had P5 to corroborate PW5’s\n                    evidence. Nevertheless, the DJ remarked that Cpl Hakim could have testified\n                    on “the procedure or the process by which police officers administer ...\n                    instructions [to provide a urine sample] in the hospital\n                        ward”.[note: 1]The DJ also commented that\n                    Cpl Hakim’s testimony might corroborate the evidence of PW5 in\n                    respect of the entries made in P5. Ultimately, the DJ stated that as the case\n                    was not over, he wished to call Cpl Hakim as a witness, and asked defence\n                    counsel whether he wished to say anything. Defence counsel replied that he would\n                    reserve his position. The hearing was then adjourned. 8       When the trial resumed on 25 May 2011, the\n                    Prosecution informed the DJ that the reason why Cpl Hakim had not been\n                    called as a witness at the previous hearing was that he could not be traced, and\n                    not because the Prosecution did not want to call him. Defence counsel, in reply,\n                    objected to Cpl Hakim being called as a witness as: (a) both parties\n                    had closed their respective cases; (b) Cpl Hakim’s testimony was\n                    not rebuttal evidence; and (c) in any event, further evidence should not be\n                    called unless it aroseex improviso,ie, where no human ingenuity could have foreseen it.\n                    Defence counsel relied on the law as laid down inThe King v\n                        Dora Harris[1927] 2 KB 587 (“Dora Harris”) andPublic Prosecutor v\n                        Bridges Christopher[1997] 3 SLR(R) 467\n                        (“Christopher Bridges (CA)”) in\n                    support of his argument. Defence counsel also contended that althoughDora Harrisinvolved the court calling further evidencesuomotu(ie, on its own motion) andChristopher Bridges (CA)involved the court allowing the\n                    Prosecution to call rebuttal evidence, both decisions stood for the same\n                    principle – that the calling of a new witness after the close of the\n                    Defence’s case could only be done if the matter aroseex improviso. As the evidence of the Applicant did not give rise\n                    to any mattersex improviso, defence counsel\n                    submitted that the DJ would be wrong to call Cpl Hakim as a witness at that\n                    stage of the proceedings. 9       The DJ rejected defence counsel’s\n                    submission and directed that Cpl Hakim be called as a witness (for ease of\n                    reference, the DJ’s direction for Cpl Hakim to be called as a witness\n                    will hereinafter be referred to as “the DJ’s Order”). He\n                    distinguishedChristopher Bridges (CA)on the\n                    ground that there, it was the Prosecution who had called rebuttal evidence after\n                    the Defence had closed its case, whereas in the present case, the court was\n                    exercising its power to call Cpl Hakim on its own motion. The DJ, after\n                    observing that the court inDora Harrishad\n                    declined to hold that theex improvisorule was\n                    not an unqualified rule, held that it was proper to call Cpl Hakim to\n                    testify as defence counsel would be given the opportunity to cross-examine\n                    Cpl Hakim and also to recall the Applicant to testify with respect to\n                    Cpl Hakim’s testimony. The DJ also stated that the calling of\n                    Cpl Hakim as a witness was not meant to improve either the\n                    Prosecution’s case or the Defence’s case (since he did not know what\n                    Cpl Hakim’s testimony would be). The DJ then adjourned the hearing\n                    for Cpl Hakim to be summoned to testify. 10     As a result of the DJ’s Order, the\n                    Applicant made an application on 2 June 2011 under s 263(1) of the CPC\n                    for the DJ to refer the 3 Questions to the High Court for its determination. The\n                    DJ rejected the application without giving any reasons. As a consequence, the\n                    Applicant made this Application for a Mandatory Order requiring the DJ to state\n                    a special case in accordance with s 263(1) of the CPC. 11     Before I consider whether the DJ was justified\n                    in refusing to state a special case under s 263(1) of the CPC, it is\n                    necessary to first consider the provision under which the DJ’s Order was\n                    made,viz, s 399 of the CPC. Such a\n                    consideration will provide the relevant legal context to determine whether the\n                    DJ’s Order was correct in law.",
        "Section 399 of the CPC": "12     Section 399 of the CPC provides as\n                    follows: Power of court to summon and\n                            examine persons 399.    Any court may, at\n                            any stage of any inquiry, trial or other proceeding under this Code,\n                            summon any person as a witness or examine any person in attendance,\n                            though not summoned, as a witness or recall and re-examine any person\n                            already examined and the court shall summon and examine or recall and\n                            re-examine any such person, if his evidence appears to it essential\n                            to the just decision of the case. Section 399 of the CPC has since been repealed and re-enacted\n                    as s 283 of the Criminal Procedure Code 2010 (Act No 15 of 2010)\n                    (“the CPC 2010”). Section 399 of the CPC was itself a\n                    re-enactment of a similar provision in previously repealed criminal procedure\n                    codes,viz, the Criminal Procedure Code\n                    (Cap 21, 1936) (“the 1936 CPC”) of the Straits Settlements\n                    and the Criminal Procedure Code (Cap 132, 1955) of the Colony of Singapore.\n                    An identical provision was also enacted as s 425 of the Criminal Procedure\n                    Code (FMS Cap 6, 1927) (“the FM CPC”) of the Federation of\n                    Malaya, which is currently s 425 of the Criminal Procedure Code\n                    (Act 593) of Malaysia. A substantial body of case law has been decided\n                    under the pertinent provisions in each of these codes. It is necessary that I\n                    discuss these decisions in order to determine the scope of s 399 of the CPC\n                    as well as its relationship withDora HarrisandChristopher Bridges (CA). SinceDora Harrisis an English authority and sinceChristopher Bridges (CA), although a local authority, is\n                    not directly on point (Christopher Bridges (CA)was not a decision on s 399 of the CPC, and concerned the admission of\n                    rebuttal evidence called by the Prosecution after the close of the\n                    Defence’s case, as opposed to the calling of further evidence by the courtsuomotu), it is\n                    also necessary that this court determine their relevance to the scope of\n                    s 399 of the CPC.",
        "Case law on the scope of section 399 of the CPC": "13     Section 399 of the CPC is worded in very\n                    wide terms, and has two limbs. Under the first limb, the trial judge\n                    “may, at any stage of any inquiry, trial or other proceeding under [the\n                    CPC], summon any person as a witness or examine any person in attendance, though\n                    not summoned, as a witness or recall and re-examine any person already\n                    examined”. However, this is not an unfettered power, as the case law will\n                    show. The second limb provides that “the court shall summon and examine\n                    or recall and re-examine any such person, if his evidence appears to it\n                    essential to the just decision of the case”. The local decisions on\n                    s 399 of the CPC (as well as the Indian decisions on the corresponding\n                    Indian section,viz, s 540 of the Indian Code\n                    of Criminal Procedure (Act No V of 1898) (“the Indian CPC of\n                    1898”)) show that the first limb confers a discretionary power on the\n                    trial judge, whilst the second limb mandates his exercise of the power to summon\n                    or recall a witness if it is essential to the justice of the case. 14     A criminal trial has, basically, four distinct\n                    phases in the following order: (a) the case for the Prosecution;\n                    (b) the Defence’s submission of no case to answer after the close of\n                    the case for the Prosecution (if the Defence chooses to make such a submission);\n                    (c) the case for the Defence after it has been called; and (d) the\n                    closing speeches or submissions of the Defence and the Prosecution. Whichever\n                    phase the trial may have reached, so long as judgment has not been given, the\n                    court may or shall (if it is essential to the just decision of the case)\n                    exercise its power to call a witness under s 399 of the CPC. 15     The scope of the power conferred by s 399\n                    of the CPC is different from that of a trial judge’s powers under English\n                    law. As early as 1948, the High Court of the Federation of Malaya, sitting at\n                    Seremban, Negri Sembilan, so held with respect to s 425 of the FM CPC, the\n                    then equivalent of s 399 of the CPC. InJacob v Public\n                        Prosecutor[1948–1949] Supp MLJ 20\n                        (“Jacob”), Callow J held\n                    that the trial judge, who had called a witness at the end of the Defence’s\n                    case (the witness had been subpoenaed by the Defence, but the Defence did not\n                    call him), had exercised his discretion properly, “particularly in view\n                    of the possibility of the doubt in favour of the accused which appears to have\n                    remained in the mind of the learned District Judge up till the hearing of the\n                    witness” (at 22). In so holding, Callow J distinguished the law in\n                    England as established in Rv McMahon[1933]\n                    24 Cr App R 95 at 97 (viz, theex improvisorule) on the ground that s 425 of the\n                    FM CPC gave a wide discretion to the trial judge. Callow J said (at\n                    23): After consideration of the authorities I have cited, others I have\n                        studied, and from the general circumstances of the case, I distinguish the\n                        law in this country from that in England by holding that whereas in England\n                        the Courtshould notcall a witness after the\n                        close of the defence unless something has arisenex\n                            improviso, which no human ingenuity could foresee,on the part of the accused;in Malaya the power so vested in the Court by virtue of\n                        s 425 of the [FM CPC] may be exercised after the close of the defence\n                        if the further evidence appears essential to the just determination of the\n                        case. [emphasis in original] 16     However, Callow J also held that given\n                    that the trial judge inJacobhad exercised the\n                    power conferred by s 425 of the FM CPC, he must allow defence counsel to\n                    cross-examine the witness (who had given evidence adverse to the accused), and\n                    that the failure of the trial judge to permit such cross-examination had\n                    resulted in a miscarriage of justice. He, however, qualified this requirement as\n                    follows at 23: The whole matter is very much one within the discretion of the Court\n                        below, but the discretion must be exercised most guardedly, and never, I\n                        think, if it can be interpreted as unfavourable to the accused. 17     AfterJacob, a\n                    series of cases was decided by the courts of Malaya and Singapore (“the\n                    local courts”) under the corresponding provisions of the respective\n                    territories’ criminal procedure codes. These cases, which involved trial\n                    judges calling on their own motion witnesses during various phases of the trial\n                    process, include the following:Yap Fook Yew and another v\n                        Public Prosecutor[1949] Supp MLJ 3 (“Yap Fook Yew”) (perSpenser Wilkinson J),Kee Seng Nee v Rex[1949] MLJ 210 (perMurray-Aynsley CJ),Balfour v Public\n                        Prosecutor[1949] Supp MLJ 8 (“Balfour”) (perthe\n                    Court of Criminal Appeal),Rex v Bakar bin Sahat[1951] MLJ 202 (“Bakar”)\n                        (perSpenser Wilkinson J),Ramasamy v Regina[1955] MLJ 95\n                        (“Ramasamy”) (perSpenser Wilkinson J),LokePohSiang v\n                        Public Prosecutor[1957] MLJ 107 (perHill J),ReAdam Aman; Hoesin bin Ghaniv Public\n                        Prosecutor[1958] MLJ 229 (“Re Adam Aman”) (perRigby J) andPublic Prosecutor v Abdul Hamid[1969] 1 MLJ 53 (perSyed\n                    Othman J). 18     In the majority of these cases, despite\n                    Callow J’s statement inJacobat 23\n                    (see[15]above), the local courts were\n                    still influenced by English decisions, which continued to be applied to\n                    interpret the scope of s 425 of the FM CPC, especially in a group of\n                    decisions made by Spenser Wilkinson J. InYap Fook\n                        Yew(whereJacobwas not cited),\n                    Spenser Wilkinson J, citing an unreported decision and also cases such asRegina v Frost and Eleven Others(1839)\n                    9 C&P 129 (“R v Frost”) andR v Day (Harold Norman)(1940) 27 Cr\n                    App R 168 (“R v Day”), held\n                    that the discretion in s 425 of the FM CPC was wide, but it “must be\n                    exercised subject to such well-known legal principles as are applicable in each\n                    case” (at 6). InBakar(whereJacobwas cited), the same judge threw doubt on the\n                    correctness ofJacobon the ground thatR v Dayhad not been cited in that case. Spenser\n                    Wilkinson J also referred to the decision inBalfour, where the Court of Criminal Appeal (of which he was a\n                    member) approvedR v Dayand expressed the\n                    opinion that the calling by the trial judge in that case of a witness after the\n                    close of the Defence’s case, although notillegal, was a wrong exercise of discretion, and that the\n                    evidence of that witness ought to be excluded. InBalfour, the court said (at 9): It is correct that section 425 of the [FM CPC] authorises the Court\n                        to call an additional witness at any stage and that the Court may, in\n                        special circumstances, properly do so of its own motion but where a case is\n                        conducted by counsel and more especially where, as here, a preliminary\n                        enquiry has been held before a committing Magistrate, this power should be\n                        exercised only in rare cases as, for instance, where one side has raised at\n                        the trial a point which the other side could not have foreseen [citing\n                            Rv Day] … InRamasamy, Spenser Wilkinson J\n                    reiterated the position that he took in his previous decisions. 19     In contrast, a different approach was taken inReAdam Aman. In\n                    that case, the trial judge called a witness after the close of the\n                    Prosecution’s case and, at the conclusion of the trial, convicted the\n                    accused. The accused appealed on the ground that the trial judge had exercised\n                    his discretion improperly, resulting in a miscarriage of justice. Rigby J,\n                    after examining the case precedents, said at 235: The effect of these cases make it clear beyond doubt that both under\n                        Malayan and English Law a Court has complete discretion to call or recall a\n                        witness after the prosecution has closed its case and a submission has been\n                        made that there is no case to answer, and an appellate Court will not\n                        interfere with the exercise of that discretion unless it appears that\n                        thereby an injustice has resulted. … But what is the position where such evidence is called by the Court, in\n                        the exercise of its discretion, after the defence has been concluded and\n                        final addresses made? I have quoted thedictaof the Court of [Criminal] Appeal in the case of [Balfour] … I have been unable to find any authority\n                        decided in this country in which this precise point has been decided.\n                        … After referring to the English decisions and an Indian decision on the\n                    corresponding Indian provision (viz, s 540 of\n                    the Indian CPC of 1898), Rigby J concluded at 238: I would respectfully agree with the view expressed by Callow J in\n                            [Jacob] … that the powers conferred\n                        upon the Court under this section [ie,\n                        s 425 of the FM CPC] are wider – much wider, I think – than\n                        the corresponding powers in English law. The Court is expressly vested with\n                        the statutory power at any time before judgment to call or recall a witness\n                        if his evidence appears to it essential to the just decision of the case.\n                        The sole test as to whether [the judge] has properly exercised his\n                        discretion lies in the answer to those last few words, namely, was such\n                        evidence essential to the just decision of the case or … did the\n                        calling of such evidence occasion a miscarriage of justice? It seems to me\n                        that the answer to that question must logically be that every case must be\n                        considered on its own merits and in relation to its own facts. I would\n                        venture to express the opinion that it is not sufficient for the appellate\n                        Court to say that the Magistrate has wrongly exercised his discretion in\n                        calling further evidence merely because the appellate Court itself would not\n                        similarly have exercised the same discretion in the same way. 20     In terms of chronology, it is convenient at\n                    this juncture to refer to the views of the Indian courts on the corresponding\n                    Indian provision,ie, s 540 of the Indian CPC\n                    of 1898 (which is currently enacted as s 311 of the Indian Code of Criminal\n                    Procedure 1973 (Act No 2 of 1974)). InJamatrajKewaljiGovani v\n                        State of MaharashtraAIR 1968 SC 178 (“Jamatraj”), the Supreme Court of India (perHidayatullah J) said at 181–183: (10)  Section 540 is intended to be wide as the\n                            repeated use of the word ‘any’ throughout its length clearly\n                            indicates. The section is in two parts. The first part gives a\n                            discretionary power but the latter part is mandatory. The use of the\n                            word ‘may’ in the first part and of the word\n                            ‘shall’ in the second firmly establishes this difference.\n                            Under the first part, which is permissive, the court may act in one of\n                            three ways: (a) summon any person as a witness, (b) examine\n                            any person present in court although not summoned, and (c) recall\n                            or re-examine a witness already examined. The second part is obligatory\n                            and compels the Court to act in these three ways or any one of them, if\n                            the just decision of the case demands it. As the section stands there is\n                            no limitation on the power of the Court arising from the stage to which\n                            the trial may have reached, provided the Court is bona fide of the\n                            opinion that for the just decision of the case, the step must be taken.\n                            It is clear that the requirement of just decision of the case does not\n                            limit the action to something in the interest of the accused only. The\n                            action may equally benefit the prosecution. … (14)  It would appear that in our criminal\n                            jurisdiction, statutory law confers a power in absolute terms to be\n                            exercised at any stage of the trial to summon a witness or examine one\n                            present in court or to recall a witness already examined, and makes this\n                            the duty and obligation of the Court provided the just decision of the\n                            case demands it. In other words, where the court exercises the power\n                            under the second part, the inquiry cannot be whether the accused has\n                            brought [up] anything suddenly or unexpectedly but whether the court is\n                            right in thinking that the new evidence is needed by it for a just\n                            decision of the case. If the court has acted without the requirements of\n                            a just decision, the action is open to criticism but if the\n                            court’s action is supportable as being in aid of a just decision\n                            the action cannot be regarded as exceeding the\n                        jurisdiction. 21     The principles laid down inJamatrajwere applied by the Supreme Court of Malaysia inRamli bin Kechik v Public Prosecutor[1986]\n                    2 MLJ 33 (“Ramli bin\n                    Kechik”). There, the court said (at 34): … The section [ie, s 425 of the\n                        FM CPC] is intended to enable the court to get at the truth and to come to a\n                        proper conclusion in the matter under inquiry or trial.It is not limited to witnesses whom the court examines on its own\n                            behalf but also applies to witnesses for the prosecution as well as\n                            witnessesfor the defence.Hence, the defence as well as the prosecution may be\n                            allowed to adduce additional evidence under this section.The\n                        object of the section is just as much the prevention of escape of a guilty\n                        person through some carelessness of the prosecution or the Magistrate as the\n                        vindication of the innocence of the person wrongly accused owing to the\n                        carelessness and ignorance of one party. If there is the apprehension of\n                        justice failing by an erroneous acquittal or by an erroneous conviction the\n                        court would be justified in exercising its discretion in calling for\n                        additional evidence under this section. Where the court is of the opinion\n                        that the evidence of certain witnesses is essential to the just decision of\n                        the case, it is bound to summon them, and for this purpose the trial can be\n                        adjourned. A just decision under this section does not mean a decision in\n                        favour of the defence (seeRengaswamiNaicker’scase [1954] Cr\n                        LJ 123). Thus, it would not be an improper exercise of the power merely\n                        because the evidence taken supports the case of the prosecution and not that\n                        of the accused. In our view, by its very nature the discretion to be\n                        exercised under s 425 [of the FM CPC] depends on the facts of each case\n                        – the main consideration being the essentiality of the additional\n                        evidence to a just decision of the case. [emphasis added] 22     These principles have since been applied or\n                    approved by the local courtsvis-à-visthe\n                    exercise of the power under s 399 of the CPC (or s 425 of the FM CPC,\n                    as the case may be) at various phases of a criminal trial. The relevant cases\n                    (not all of which will be discussed as they turn on their own facts) are the\n                    following:Public Prosecutor v Phon Nam[1988]\n                    3 MLJ 415 (“Phon Nam”),Public Prosecutor v Abdul Rahim bin Abdul\n                        Satar[1990] 3 MLJ 188,Chee Wee\n                        Tiong and another v Public Prosecutor[1994]\n                    2 SLR(R) 1046 (“Chee Wee\n                    Tiong”),Mohammad Ali bin MohdNoor v Public Prosecutor[1996]\n                    2 SLR(R) 692 (“Mohammad\n                    Ali”),Jusri bin Mohamed Hussain v Public\n                        Prosecutor[1996] 2 SLR(R) 706 (“Jusri”) andSim Cheng Hui and\n                        another v Public Prosecutor[1998] 1 SLR(R) 670\n                        (“Sim Cheng Hui”). 23     InJusri(a drug\n                    trafficking case), after the Prosecution had closed its case without calling\n                    expert evidence, the Defence called an expert witness to support the\n                    accused’s defence of consumption by testifying on the accused’s\n                    chronic drug dependency. This led the Prosecution to seek to call an expert\n                    witness to rebut the evidence of the Defence’s expert. The trial judge\n                    allowed the application and ultimately accepted the evidence of the\n                    Prosecution’s expert. The accused appealed on the ground that the\n                    Prosecution was not entitled to call rebuttal evidence at that stage of the\n                    trial. Yong Pung How CJ, after stating at [27]–[28] that\n                    s 399 of the CPC was not applicable to a case where the court allowed the\n                    Prosecution to call rebuttal evidence (as opposed to a case where the court\n                    called such evidencesuomotu), said at [33]: It is far preferable to follow the current practice in most of these\n                        cases, which is to allow the Prosecution to call expert evidence in\n                        rebuttal, while at the same time permitting the recall of the defence expert\n                        to reply to what was said by the Prosecution's expert. I cannot see how\n                        adopting this course would prejudice an accused. Where the burden of proof\n                        is on the accused to prove that the drugs, or part of it, are for\n                        consumption, I see little advantage in taking a rigid position that the\n                        defence must have arisenex improvisoin order\n                        for the Prosecution to call expert evidence in rebuttal. I therefore\n                        concluded that the district judge was right in permitting Dr Leow\n                            [ie, the Prosecution’s expert] to be\n                        called. As will be seen,Jusriapplied, in\n                    essence, the ruling of the Court of Criminal Appeal inOsman\n                        bin Ali v Public Prosecutor[1971–1973] SLR(R) 503 (“Osman bin\n                        Ali”) although that case was not cited (see the discussion\n                    at[31]below in relation toChristopher Bridges (CA)). 24     InSim Cheng\n                    Hui, the first and second appellants were convicted of drug\n                    trafficking at first instance. The trial judge, on his own motion, had recalled\n                    two prosecution witnesses to ascertain the pager number of a person known as Teo\n                    (who had been seen retrieving a white bag containing drugs from a car after\n                    earlier passing a white bag containing cash to the first appellant) in order to\n                    show that the first appellant had paged Teo to ask him where to collect the\n                    drugs. On appeal to the Court of Appeal, the first appellant argued, relying onChristopher Bridges (CA), that the trial judge\n                    was wrong to have recalled the two witnesses after the Prosecution had closed\n                    its case. The Court of Appeal distinguishedChristopher\n                        Bridges (CA)on the ground that that case involved the calling of\n                    rebuttal evidence by the Prosecution at the close of the case for the Defence,\n                    whereas inSim Cheng Hui, not only had the Defence\n                    not been called when the trial judge recalled the two prosecution witnesses, but\n                    the recall of the prosecution witnesses had also been at the instance of the\n                    trial judge and not on the application of the Prosecution. The court referred toRamli bin Kechik,Phon\n                        Nam,Mohammad AliandChee Wee Tiong, and held at [31] that the trial judge had exercised his discretion properly\n                    on the ground that if the particular inadequacy in the Prosecution’s case\n                    had not been remedied, “there might [have] result[ed] … a failure\n                    of justice”.",
        "Summary of the case law on section 399 of the CPC": "25     The short survey above of the case law on\n                    s 399 of the CPC (and the corresponding provisions in the criminal\n                    procedure codes of the Straits Settlements, the Federated Malay States, the\n                    Colony of Singapore, the Federation of Malaya and Malaysia) shows that as early\n                    as 1948, the local courts held that the English position on the calling of\n                    witnesses by the trial judgesuomotuafter the Defence had closed its case did not apply\n                    because of s 399 of the CPC or its equivalent. The case law also\n                    established that the trial judge’s power to call witnesses was not\n                    unfettered and had to be exercised with caution so as not to prejudice or cause\n                    injustice to the accused. However, where the calling of a witness was essential\n                    to the just decision of the case, the trial judge had no discretion. Whether or\n                    not s 399 of the CPC (or its equivalent) justified the calling of a witness\n                    in those circumstances would depend on the facts of each case. Hence, it was not\n                    possible for the courts to lay down clear and rigid rules as to when the powercouldbe exercised and when itmustbe exercised. It should also be noted that the\n                    courts in Singapore continued to draw a distinction between cases where the\n                    court called a witnesssuomotu(see,eg,Sim Cheng Hui) and cases where it permitted the Prosecution to\n                    call rebuttal evidence after the Defence has closed its case (see,eg,Jusri). 26     With these principles in mind, I will now\n                    discuss the two decisions cited to the DJ in the court below (viz,Dora HarrisandChristopher Bridges (CA)) to determine their relevance\n                    to the correctness or otherwise of the DJ’s Order.",
        "The decision in Dora Harris": "27     InDora Harris,\n                    the trial judge had called a witness on his own motion after the Defence had\n                    closed its case. The English Court of Criminal Appeal (perAvory J) dealt with this issue as follows (at\n                    593–596): … Two questions arise for our determination in this case. The first\n                        is whether the course taken by the Recorder in calling the prisoner Benton\n                        as a witness when the case for the defence had closed was in accordance with\n                        the well recognized rule that governs proceedings at criminal trials.\n                        … As to the first point, it has been clearly laid down by the Court of\n                        Appeal inIn re Enoch and Zaretsky, Bock &\n                            Co.[[1910] 1 KB 327] that in a civil suit the\n                        judge has no right to call a witness not called by either party, unless he\n                        does so with the consent of both of the parties. It also appears to be\n                        clearly established that that rule does not apply to a criminal trial where\n                        the liberty of a subject is at stake and where the sole object of the\n                        proceedings is to make certain that justice should be done as between the\n                        subject and the State. The cases ofReg. v.\n                            Chapman[8 C & P 558] andReg. v. Holden[8 C & P 606]\n                        establish the proposition that the presiding judge at a criminal trial has\n                        the right to call a witness not called by either the prosecution or the\n                        defence, and without the consent of either the prosecution or the defence,\n                        if in his opinion this course is necessary in the interests of justice. It\n                        is true that in none of the cases has any rule been laid down limiting the\n                        point in the proceedings at which the judge may exercise that right. But it\n                        is obvious that injustice may be done to an accused person unless some\n                        limitation is put upon the exercise of that right, and for the purpose of\n                        this case we adopt the rule laid down by Tindal C.J. in [R v Frost], where the Chief Justice said:\n                        “There is no doubt that the general rule is that where the Crown\n                        begins its case like a plaintiff in a civil suit, they cannot afterwards\n                        support their case by calling fresh witnesses, because they are met by\n                        certain evidence that contradicts it. They stand or fall by the evidence\n                        they have given. They must close their case before the defence begins; but\n                        if any matter arises ex improviso, which no human ingenuity can foresee, on\n                        the part of a defendant in a civil suit, or a prisoner in a criminal case,\n                        there seems to me no reason why that matter which so arose ex improviso may\n                        not be answered by contrary evidence on the part of the Crown.” That\n                        rule applies only to a witness called by the Crown and on behalf of the\n                        Crown, but we think that the rule should also apply to a case where a\n                        witness is called in a criminal trial by the judge after the case for the\n                        defence is closed, and that the practice should be limited to a case where a\n                        matter arises ex improviso, which no human ingenuity can foresee, on the\n                        part of a prisoner, otherwise injustice would ensue. … … In the circumstances, without laying down that in no case can an\n                        additional witness be called by the judge at the close of the trial after\n                        the case for the defence has been closed, we are of opinion that in this\n                        particular case the course that was adopted was irregular, and was\n                        calculated to do injustice to the appellant Harris. 28     The last passage shows thatDora Harrisdid not lay down an absolute rule that in no case\n                    may the court call a witness at the close of the trial after the case for the\n                    Defence had been closed. 29     I earlier referred toJacob,Re Adam AmanandRamli bin Kechik, where the local courts held that\n                    English law, as exemplified by the decisions in Rv\n                        Frost,R v Day,etc, was not applicable to s 399 of the CPC (or its\n                    equivalent). As such, theex improvisorule\n                    established by Tindal CJ in Rv Frost(which was expressly adopted inDora Harris) does\n                    not limit the operation of s 399 of the CPC. Theex\n                        improvisorule in English law is currently stated inHalsbury’s Laws of Englandvol 27\n                    (Butterworths, 5th Ed, 2010) (“Halsbury’s”) at para 419 as follows: 419.Power of judge\n                            to call witnesses The trial judge has the power to call a witness not called by either the\n                        prosecution or the defence, without their consent, if he considers that\n                        course is necessary in the interest of justice; but he should not call such\n                        a witness after the evidence is closed, except in a matter arising\n                        unexpectedly, and only where no injustice or prejudice could be caused to\n                        the defendant. … 30     A strict reading of this passage might give\n                    the impression that whilst under English law, the trial judge may call a witnesssuomotuif it\n                    is necessary to the justice of the case, the requirement of necessity to the\n                    justice of the case will not be satisfied if the calling of a witness after the\n                    evidence is closed will result in injustice or prejudice to the accused. This,\n                    however, is not what s 399 of the CPC says, and the decisions of the local\n                    courts and the Indian courts sinceJamatrajhave\n                    held that s 399 of the CPC (or its equivalent) may be invoked at any stage\n                    of the proceedings if it is essential to the just decision of the case, and that\n                    the just decision of the case may result in the conviction of the accused. As\n                    Hidayatullah J said inJamatraj(at 181), the\n                    requirement of a just decision “does not limit the action to something\n                    [which is] in the interest of the accused only[;] [t]he action may equally\n                    benefit the prosecution”. The legislative objective of s 399 of the\n                    CPC is to enable the court to arrive at a just decision, which may entail either\n                    the acquittal or the conviction of the accused of the charge against him, as the\n                    case may be, depending on the facts of each case. The aforesaid local and Indian\n                    decisions also indicate that an appellate court will not ordinarily interfere\n                    with the trial judge’s exercise of the discretion under s 399 of the\n                    CPC (or its equivalent), and this will include the trial judge’s\n                    evaluation, based on the state of the evidence at that particular stage of the\n                    proceedings in question, that calling a certain witness would allow him to reach\n                    a just decision in the case.",
        "The decision in Christopher Bridges (CA)": "31     InBridges Christopher v\n                        Public Prosecutor[1997] 1 SLR(R) 156\n                        (“Christopher Bridges (HC)”) the\n                    High Court reversed the decision of the District Court, which had allowed the\n                    Prosecution to call rebuttal evidence after the close of the Defence’s\n                    case on the ground that the evidence was essential to the just and truthful\n                    determination of the case, and not for the purpose of filling any gap in the\n                    Prosecution’s case. Yong CJ did not address the District\n                    Court’s reason for allowing rebuttal evidence, but held himself bound byZainal bin Kuning and others v Chan Sin Mian Michael and\n                        another[1996] 2 SLR(R) 858 (“Zainal bin Kuning”), where, in a civil matter, the Court\n                    of Appeal decided that the plaintiff should only be allowed to call rebuttal\n                    evidence if he had been misled or taken by surprise. In so ruling, Yong CJ\n                    essentially applied theex improvisorule under\n                    English law. Yong CJ declined to follow the guideline on the same issue\n                    given by the Court of Criminal Appeal inOsman bin\n                        Alion the ground that that case was concerned with the defence\n                    of diminished responsibility (where the burden of establishing the defence was\n                    on the accused), even though the guideline was directly on point. InOsman bin Ali, the court (perWee Chong Jin CJ) said at [22]: It has been, so far as we are aware, the practice of the High Court to\n                        allow the Prosecution to call medical evidence in rebuttal where an accused\n                        person adduces evidence in support of a defence of diminished\n                        responsibility. A similar practice, so far as we are aware, prevails in\n                        England.In so far asnon-medical evidence is concernedthe\n                            principle that ought to be applied is whether or not rebuttal evidence,\n                            if admitted, would operate unfairly against the accused and where it has\n                            been admitted the test is … whether the accused has suffered an\n                            injustice. [emphasis added] 32     The decision inChristopher\n                        Bridges (HC)prompted the Public Prosecutor to refer to the Court\n                    of Appeal several questions of law of public interest for determination (seePublic Prosecutor v Bridges Christopher[1997]\n                    1 SLR(R) 681 andChristopher Bridges\n                        (CA)). Two of the questions were whether Yong CJ was correct\n                    in holding himself bound byZainal bin Kuning, and\n                    whether Yong CJ was correct in rejecting the guideline laid down inOsman bin Ali. The Court of Appeal inChristopher Bridges (CA)did not decide\n                    whether Yong CJ was wrong to have held that, as a judge sitting in a\n                    criminal proceeding in the High Court, he was bound by the decision of the Court\n                    of Appeal in a civil proceeding on a similar procedural issue. Instead, the\n                    court decided that the same procedural rule applied in both civil proceedings\n                    and criminal proceedings, and that that was a desirable state of the law. The\n                    Court of Appeal rejected the guideline inOsman bin\n                        Alion the ground that it wasobiter, but did not expressly say that it was wrong. The Court\n                    of Appeal’s reasoning is set out atChristopher Bridges\n                        (CA)at [53]–[59]: 53    …[T]he question for our consideration is whether there\n                                ought to be a uniform rule of practice and procedure on the\n                                admission of rebuttal evidence for both criminal proceedings as well\n                                as civil proceedings. To answer this question a review of\n                            the English position in criminal proceedings might be\n                        useful. 54    The classic statement on\n                            this rule of practice and procedure in criminal proceedings was made by\n                            Tindal CJ inRegina v Frost(1839)\n                            9 Car & P 129 at 159, where he said: There can be no doubt about the general rule, that where the Crown\n                            begins a case (as it is with an ordinary plaintiff), they bring forward\n                            their evidence, and cannot afterwards support their case by calling\n                            fresh witnesses, because there may be evidence in the defence to\n                            contradict it. But if any matter arises ex improviso, which the Crown\n                            could not foresee, supposing it to be entirely new matter, which they\n                            may be able to answer only by contradictory evidence, they may give\n                            evidence in reply. 55    Tindal CJ’s statement was followed in Rv Day(1940) 27 Cr App R 168. At 171\n                            the Court of Appeal held: The Court is of opinion that the law is now well settled. The rule was\n                            laid down by Chief Justice Tindal in Rv\n                                Frost... The rule thus stated was expressly adopted by\n                            this court in Rv Harris20 Cr\n                            App R 86 ... In Rv Levy and Tait(1966) 50 Cr App R 198, James J said at 202: It is quite clear and long established that the judge has a discretion\n                            with regard to the admission of evidence in rebuttal; the field in which\n                            that discretion can be exercised is limited by the principle that\n                            evidence which is clearly relevant – not marginally, minimally or\n                            doubtfully relevant, but clearly relevant – to the issues and\n                            within the possession of the Crown should be adduced by the Prosecution\n                            as part of the Prosecution’s case, and such evidence cannot\n                            properly be admitted after evidence for the defence. In Rv Cleghorn(1967)\n                        51 Cr App R 291, Lord Chief Justice Parker said at\n                        294: There clearly are, however, cases in which the Judge is justified in\n                            calling a witness ... However, when dealing with a case such as this in\n                            which the witness is only called at the end of the defendant's case, the\n                            Court has sought to ensure that that should be done only in cases where\n                            no injustice or prejudice could be caused to a defendant, and for that\n                            purpose laid down a rule of practice that in general it should only be\n                            done where some matter arisesex\n                            improviso. 56    There are numerous\n                            authorities extending to the present day in the same vein. We will,\n                            however, be content to cite just one more authority; Rv Scott(1984) 79 Cr App R 49 where\n                            Lawton LJ said at 51: It is confined to cases where the Prosecution could not reasonably\n                            have been expected to produce the evidence as part of their case. Unless\n                            there is some reason for the Prosecution not producing the evidence at\n                            the right time, in general the judge should reject the evidence. The\n                            expression ‘evidence which arisesex\n                                improviso’ has a long history. It dates back to a\n                            judgment of Tindal CJ in the 1830s. 57    Notwithstanding this long and impressive lineage\n                            some have questioned the strictness of the rule. A less strict and more\n                            liberal view was expressed in a few cases. Examples of these are\n                                Rv Sullivan(1922) 16 Cr\n                            App R 121 and Rv McKenna(1956)\n                            40 Cr App R 65 and probably were the basis for the statement\n                            inOsman bin Ali v PP. 58Be that so the greater weight of\n                                authority by far is for the rule as first stated by Chief\n                                Justice Tindal in Rv Frostin 1839… 59In our judgment there is\n                                everything to be said for a uniform rule regarding the admission of\n                                rebuttal evidence in both civil and criminal proceedings. From the\n                                cases we have cited in[55], [56]and[57]above it is evident that the\n                                generally accepted rule in England in criminal cases is the rule\n                                stated by the Court of Appeal inZainal bin Kuningand there is no reason why that rule should not\n                                also apply to summary criminal trials in our\n                            jurisdiction. [emphasis added] 33     Three observations may be made with respect to\n                    the reasoning set out in the above passages. First, the question that the Court\n                    of Appeal inChristopher Bridges (CA)was asked to\n                    determine was not whether the law applicable to the calling of rebuttal evidence\n                    by the Prosecution in criminal proceedings should be the same as the law\n                    applicable to the calling of rebuttal evidence by a plaintiff in civil\n                    proceedings. Instead, the question was whether the High Court in a criminal case\n                    was bound by the decision of the Court of Appeal on a similar procedural issue\n                    in a civil case, and whether the guideline inOsman bin\n                        Aliwas the correct principle to apply. Second, the Court of\n                    Appeal inChristopher Bridges (CA)was not quite\n                    correct in holding (at [59]) that\n                    “the generally accepted rule in England in criminal cases is the rule\n                    stated by the Court of Appeal inZainal bin\n                    Kuning” because the accepted rule in England, as set out inHalsbury’sat para 417, is in fact\n                    not the same. There, the English rule is stated as follows: 417.Fresh evidence\n                            for the prosecution after close of case. The general rule is that the prosecution may adduce no further evidence of\n                        the defendant’s guilt after the closure of its case, either in\n                        response to a submission of no case to answer or in response to evidence\n                        adduced by the defence;but this is not an absolute rule\n                            and the trial judge has a discretion to permit a reopening of the\n                            prosecution case where it is in the interests of justice to do\n                            so. There are, in particular, three well-recognised circumstances in which it\n                        may be appropriate to exercise this discretion in favour of the prosecution:\n                        (1) where what has been inadvertently omitted is a mere formality as\n                        distinct from a central issue in the case; (2) where the defence has\n                        raised evidence or issues that could not reasonably have been anticipated by\n                        the prosecution or included in the original prosecution case; (3) where\n                        new evidence of guilt has become available for the first time after the\n                        closure of the prosecution case. The discretion is nevertheless flexible and\n                        cannot be rigidly constrained within set categories, but the earlier the\n                        application to admit the further evidence is made, the more likely it is\n                        that the discretion will be exercised in favour of the prosecution; and no\n                        evidence for the prosecution may be called after the judge has begun his\n                        summing up. [emphasis added] Third, since (according to the Court of Appeal inChristopher Bridges (CA)) s 399 of the CPC does not apply\n                    to the calling of rebuttal evidence by the Prosecution, there is a lacuna in our\n                    criminal procedure code (although the decision by the Supreme Court of Malaysia\n                    inRamli bin Kechikwould appear to suggest that\n                    s 399 of the CPC should also apply to such a case). In such an event,\n                    s 5 of the CPC requires the court to apply the laws of England as regards\n                    matters of criminal procedure in so far as they do not conflict or are not\n                    inconsistent with the CPC and can be made auxiliary thereto (see the discussion\n                    onPublic Prosecutor v Wee Eh Tiang[1956] MLJ 120 (“Wee Eh\n                    Tiang”) at[47]–[49]below). InChristopher Bridges (HC), the District Court\n                    in effect applied the common law rule (as set out inHalsbury’sat para 417), and neither the High Court\n                    inChristopher Bridges (HC)nor the Court of\n                    Appeal inChristopher Bridges (CA)considered the\n                    applicability of s 5 of the CPC (presumably because the provision was not\n                    drawn to their attention). Nevertheless, if s 5 of the CPC had been\n                    applied, both courts would have been obliged to apply the principles as set out\n                    inHalsbury’sat para 417 (reproduced\n                    earlier in this paragraph), which are more in line with the guideline inOsman bin Alithan the civil procedure rule inZainal bin Kuning. This would have required\n                    the High Court and the Court of Appeal to consider whether the District\n                    Court’s decision to allow the Prosecution to call rebuttal evidence was\n                    correct as being in the interest of justice. In this connection, it may be noted\n                    that inChristopher Bridges (HC)at [91],\n                    Yong CJ expressed the view that if the Prosecution were allowed to call\n                    rebuttal evidence, “[t]here w[ould] be no end to proceedings”. In\n                    these circumstances, the ruling inChristopher Bridges\n                        (CA)should be reconsidered in a future case on the basis that it\n                    was decidedper incuriam. 34     Interestingly, it may also be useful to note\n                    from a comparison of English law and local law in relation to these two issues\n                        (ie: (a) the calling of a witness by the\n                    trial judgesuomotu; and (b) the permitting by a trial judge of the calling of\n                    rebuttal evidence by the Prosecution) that the respective legal positions are\n                    the converse of each other. In England, the power of the trial judge to call a\n                    witnesssuomotuappears to be narrower and stricter than the power provided in s 399 of the\n                    CPC, whereas the power under English law of the trial judge to permit the\n                    Prosecution to call rebuttal evidence appears to be broader than the rule laid\n                    down inChristopher Bridges (CA). 35     Having said this, I am of the view that there\n                    is no sensible reason why the rationale of s 399 of the CPC should not be\n                    applicable to cases where the Prosecution seeks to call rebuttal evidence (like\n                    inChristopher Bridges (CA)). The guiding\n                    principle in calling a new witness, whether by the courtsuomotuor by the Prosecution with the\n                    permission of the court, should be the same in both situations – namely,\n                    so that a just decision can be reached, or a miscarriage of justice avoided, in\n                    the case at hand. Since under s 399 of the CPC, the trial judge may call\n                    or, where appropriate, must call a witness on his own motion, he could also do\n                    so if requested by the Prosecution in the same circumstances. The modality of\n                    calling or admitting new or recalled evidence at any stage of a trial should not\n                    be more important than the objective of this exercise, which is to enable the\n                    court to reach a just decision in the case. The historical function of trial\n                    courts in acting as mere referees in criminal proceedings has outlived its\n                    usefulness. Trial courts should not simply act as if they are applying rules of\n                    sport. Their role is to seek the truth from the facts so that there is no\n                    miscarriage of justicevis-à-visboth the accused\n                    and the State. This principle is evident from the language of s 399 of the\n                    CPC. InZahiraHabibulla\n                        H Sheikh and another v State of Gujarat and others(2004)\n                    4 SCC 158, the Supreme Court of India (perArijit Payasat J) said at [40] and\n                        [43]: 40.    The fair trial for a criminal offence consists not\n                            only in technical observance of the frame, and forms of law, but also in\n                            recognition and just application of its principles in substance, to find\n                            out the truth and prevent miscarriage of justice. … 43.    The Courts have to take a participatory role in a\n                            trial. They are not expected to be tape recorders to record whatever is\n                            being stated by the witnesses. Section 311 of the Code\n                            [corresponding to s 399 of the CPC] and Section 165 of the\n                            Evidence Act confer vast and wide powers on [trial courts] to elicit all\n                            necessary materials by playing an active role in the evidence collecting\n                            process. They have to monitor proceedings in aid of justice in a manner\n                            that something, which is not relevant, is not unnecessarily brought into\n                            record. Even if the prosecutor is remiss in some ways, [trial courts]\n                            can control the proceedings effectively so that the ultimate objective\n                            i.e. truth is arrived at. … The observations in the above passages, it may be added, were made\n                    in a case where the accused persons had been acquitted of murder charges (in\n                    connection with the burning down of a bakery, resulting in the death of 14\n                    persons) as a result of lapses by the Prosecution and the investigation agency\n                    concerned.",
        "Section 263 of the CPC": "36     I will now deal with the arguments on\n                    s 263 of the CPC, which provides as follows: Reservation of points of law and\n                            statingof cases 263.—(1) Any Magistrate’s\n                        Court or District Court acting in summary jurisdiction in any criminal cause\n                        or matter may, on the written application of any party to the proceedings\n                        made to the court within 10 days from the time of thejudgment, sentence or orderpassed or made in it, or without\n                        any such application, if the court thinks fit, reserve for the consideration\n                        of the High Court any question or questions of law arising in the\n                        proceedings setting out shortly the facts on which the law is being applied\n                        and the questions of law to be determined on them. (2)    Every question of law so reserved shall be\n                            submitted to the High Court in the shape of a special case in the form\n                            in Schedule B. (3)If the court is of the opinion\n                                that any application made is frivolous but not otherwise, it may\n                                refuse to state a case and shall on the request of the applicant\n                                sign and deliverto him a certificate\n                                of the refusal: Provided that the court shall not refuse to state a case where the\n                        application is made by the Public Prosecutor. (4)    Where a court\n                            refuses to state a case under subsection (3) it shall be lawful for\n                            the applicant to apply to the High Court for a Mandatory Order and if\n                            the High Court makes the order the court shall state the case\n                            accordingly. (5)    Every such\n                            special case shall be drawn up by the Magistrate or District Judge of\n                            the court before which the proceedings are held and shall\n                        — (a)    set out shortly\n                                the facts which are considered by the Magistrate or District Judge\n                                to be proved; (b)    state the\n                                question or questions of law which is or have been reserved for the\n                                opinion of the High Court; and (c)    be sent by the\n                                Magistrate or the District Judge to the Registrar. (6)    The Registrar on receiving a special case shall\n                            send a copy of it to every party to the proceedings and to the Public\n                            Prosecutor if he is not a party and shall have the case set down for\n                            argument in such manner as to the High Court seems fit. [emphasis added] 37     Under s 263(1) of the CPC read with\n                    s 263(3), a number of requirements must be met before the\n                    Magistrate’s Court or District Court (a “trial court”) can\n                    state a special case upon an application by a party to the proceedings. In so\n                    far as the present case is concerned, the relevant requirements are: (a)     the application must be made within\n                        ten days from the time of the judgment, sentence or order\n                    passed; (b)     the\n                        questions to be referred to the High Court for determination must be\n                        questions of law; and (c)     the application must not be frivolous. 38     With respect to the first requirement, the\n                    Prosecution has argued that this Application was not made within ten days of the\n                    DJ’s decision to call Cpl Hakim (ie,\n                    the DJ’s Order as defined at[9]above), which, the Prosecution submits, was made on 18 May 2011. In my\n                    view, this argument has no merit, having regard to the facts recounted at[5]–[9]above, which show that defence counsel had on 18 May\n                    2011 reserved his position on the calling of Cpl Hakim and had made\n                    submissions to the DJ only after the trial resumed on 25 May 2011 as to why\n                    Cpl Hakim should not be called (which submissions were rejected by the DJ).\n                    Accordingly, I reject the Prosecution’s argument on the first requirement.\n                    As for the second requirement, it is not disputed that the 3 Questions are\n                    questions of law. 39     The third requirement is contested. Counsel\n                    for the Applicant argues that this Application is not frivolous because the law\n                    is still unsettled as to the circumstances in which a trial court can call a\n                    witness on its own volition and whether it is constrained by the same principles\n                    that constrain the Public Prosecutor and accused persons when they wish to call\n                    additional witnesses. 40     In reply, the Prosecution has contended that:\n                    (a) this Application must failin liminebecause s 263 of the CPC applies only to a final order, and not an\n                    interlocutory order such as the DJ’s Order; (b) this Application is\n                    frivolous because it merely assumes that Cpl Hakim’s testimony would\n                    be evidence corroborative of PW5’s evidence, which might not be the case;\n                    and (c) in any event, the test is whether Cpl Hakim’s evidence\n                    is essential to the just decision of the case. I will now consider these\n                    arguments.",
        "Does the word “order” in section 263 of the CPC\n                apply only to a final order?": "41     Section 263(1) of the CPC is expressed to\n                    apply only to a “judgment, sentence or order”. The Prosecution\n                    contends that s 263 of the CPC is applicable only to final orders,ie, orders that finally dispose of the rights\n                    of the parties to the proceedings, and not to interlocutory orders such as the\n                    DJ’s Order. The basis of this argument is the rule of statutory\n                    construction that similar words in the same statute should be given the same\n                    meaning (seePublic Prosecutor v Ng Guan Hup[2009] 4 SLR(R) 314 (“Ng Guan\n                    Hup”), Rv Kansal[2002]\n                    2 AC 69 at [102] andBennion on Statutory\n                        Interpretation(LexisNexis, 5th Ed, 2008) at pp 1160\n                    and 1217). 42     The same collocation of words (viz, “judgment, sentence or order”) is\n                    also found in s 241 of the CPC, and it is not disputed that it is\n                    established law that that section applies only to judgments, sentences and\n                    orders which have an element of finality in them. InKnight\n                        Glenn Jeyasingam v Public Prosecutor[1998]\n                    3 SLR(R) 196, Yong CJ said at [14] apropos s 247(1) of the CPC: There was no question that this appeal arose out of a\n                        criminal case or matter. The concern was with whether the district judge's\n                        order was appealable on the basis that it was not a final order.Although not expressly stipulated by statute, case law has\n                            yielded the overriding requirement of finality in the judgment, sentence\n                            or order appealed against to qualify for a right of appeal.\n                        The court inMaleb bin Su v Public Prosecutor[1984] 1 MLJ 311 applied theejusdemgenerisrule in interpreting\n                        s 307(i) CPC (in parimateriato our s 247(1) CPC) and held, at 312B of the\n                        judgment: The order must therefore be a final order in the\n                                sense that it is final in effect as in the case of a judgment or a\n                                sentence. The test for determining the finality of an\n                            order is to see whether the judgment or order finally disposes of the\n                            rights of the parties. [emphasis added] It may also be noted that inPublic Prosecutor v\n                        Hoo Chang Chwen[1962] MLJ 284 (“Hoo Chang Chwen”), Rose CJ gave the same\n                    interpretation to these words in the predecessor provision of s 241 of the\n                    CPC. At 284, Rose CJ said (with respect to a Magistrate’s order that\n                    the Prosecution supply to the Defence certain statements made by the\n                    complainants to the police): Such a ruling is … not an appealable order. … I would add that to arrive at any other conclusion would seem to me to\n                        open the door to a number of appeals in the course of criminal trials on\n                        points which are in essence procedural. The proper time, of course, to take\n                        such points would be upon appeal, after determination of the principal\n                        matter in the trial court. 43     However, as pointed out by Lee Seiu Kin J\n                    inNg Guan Hup, the true principle is that similar\n                    words used in the same statute are presumed to have the same meaning, but the\n                    presumption may be rebutted by the context in which the words are used. At\n                        [31] of his judgment, Lee J\n                    said: It is worth mentioning that while there is a rule of\n                        interpretation that the same word bears the same meaning throughout the same\n                        statute, this is merely a rule of presumption that can be rebutted. The\n                        following passage from Guru Prasanna Singh,Principles of\n                            Statutory Interpretation(Wadhwa and Company, 7th Ed,\n                        1999) at p 263 was cited to me by the Prosecution to support this\n                        proposition: When the Legislature uses the same word in different parts of the same\n                            section or statute, there is a presumption that the word is used in the\n                            same sense throughout.The presumption is, however, a\n                                weak one and is readily displaced by the context. It has\n                            been said thatthe more correct statement of the\n                                rule is that ‘where the draftsman uses the same word or phrase\n                                in similar contexts, he must be presumed to intend it in each place\n                                to bear the same meaning’. [emphasis in original] 44     Contextually, I am not able to find anything\n                    in s 263 or any other section of the CPC to rebut the aforesaid\n                    presumption. Although there is a conceptual difference between, on the one hand,\n                    appealing against a judgment, sentence or order and, on the other hand,\n                    referring a question of law arising from the same, the policy considerations\n                    against allowing appeals against interlocutory orders apply with equal force to\n                    references on points of law in connection with interlocutory orders. If the\n                    position were otherwise (ie, if s 263 of the\n                    CPC were applicable to interlocutory orders), it would invite innumerable\n                    references, resulting in disrupted and fractured criminal trials and\n                    unacceptable delays in their final disposal. This would not be in the public\n                    interest, as any miscarriage of justice caused by the wrongful admission of\n                    evidence can be corrected on appeal (see[51]below). 45     In connection with this\n                    “floodgates” argument, the Prosecution cites the observations of\n                    Choo Han Teck J inYap Keng Hov Public Prosecutor[2007] 1 SLR(R) 259. In\n                    that case, Choo J rejected an application by the accused for a declaration\n                    that his ongoing trial in the District Court was null and void on the ground,inter alia, that the investigating officer was\n                    present in the courtroom during the proceedings. In dismissing the application,\n                    Choo J said at [6]–[7]: 6    I will now refer to the dictates of justice and the\n                            rule of law in the context of the applicant’s case. The term\n                            “justice” sometimes connotes desert, and sometimes,\n                            fairness, and, sometimes, some vague intuitive notion of what was right\n                            in the circumstances. In the present case, the applicant’s\n                            complaint of injustice was really directed against the trial\n                            judge’s refusal to “abort” the trial. Trial judges\n                            do not “abort” the trials which they are trying. If there\n                            has been any wrong done which the judge has the power to correct, then\n                            he must do his duty accordingly. If any party to those proceedings is\n                            dissatisfied with the ruling or direction that the judge so made, then\n                            the proper recourse should be for that party to reserve his objections\n                            until an appeal is brought against the final decision of the judge. It\n                            would be inappropriate and, in many instances, wrong, for a party to\n                            seek recourse to a higher court before judgment has been handed down.\n                            This is because the judge might ultimately agree with counsel in his\n                            submission, and rule in that party’s favour. This is precisely the\n                            situation here. The Prosecution had not closed its case and the judge\n                            had not ruled as to whether there was a case for the Defence to answer.\n                            In these inchoate circumstances, there was no basis upon which I could\n                            determine what the nature and extent of the injustice was. Justice and\n                            its mirror image, injustice, are often determined by the consequences or\n                            imminent consequences of the act in question, and the interests of all\n                            parties must also be taken into account. Where a conflict of the\n                            respective interests arises such that one might have to accommodate or\n                            give way to another, the judge will have to decide which takes\n                            precedence. There was nothing imminently fatal to the applicant’s\n                            case at the point when this motion was filed. If the trial judge were to\n                            subsequently find that the facts were in the applicant’s favour or\n                            discharge and acquit him, the presence of the investigating officer in\n                            the courtroom would not have occasioned any injustice to the applicant.\n                            The applicant’s complaint about the presence of the investigating\n                            officer was one that a judge is routinely expected to deal with. Among\n                            other such matters would be decisions relating to the admissibility of\n                            evidence. 7    The rule of law operates within the framework of the\n                            legal system and that, in turn, is built not only around the\n                            institutions of law but also the laws. One of the merits of the rule of\n                            law is the uniformity and predictability of the law which is essential\n                            for people to know what it is that they can or cannot do in that\n                            society. The procedure for trial and the rules of evidence are among\n                            matters over which the trial judge has full control. He makes all the\n                            rulings and decisions that arise in the course of the trial such as he\n                            thinks will help him conduct the proceedings rightly and justly, and,\n                            ultimately, to help him arrive at the verdict. Where a party is\n                            dissatisfied with the verdict, he may resort, by way of the appeal\n                            process, to bringing his case before a superior court. The High\n                            Court’s revisionary jurisdiction over a subordinate court’s\n                            proceedings is one way through which matters that do not normally fall\n                            within the appeal process might nevertheless be brought before the High\n                            Court. Where the appeal process is available, as is the case here, the\n                            High Court’s revisionary jurisdiction should not liberally be\n                            invoked. The filing of a criminal motion certainly cannot be used to\n                            interrupt a trial each time a party is unhappy with any ruling that the\n                            trial judge makes in the course of a trial. A trial judge would have to\n                            make numerous rulings in the course of a trial; each ruling would be\n                            adverse to one if not the other party, and sometimes to both. The trial\n                            will be constantly interrupted if every ruling is challenged before the\n                            trial has ended. The flow and dignity of a trial interrupted in such\n                            fashion tarnishes the image of the rule of law. There may, of course, be\n                            exceptions to any law; otherwise, equity would have no role in shaping\n                            justice in areas where the law is inadequate. The question then is: did\n                            the applicant’s case fall within any exception? He made no\n                            reference to any exceptional circumstances. And I found nothing\n                            exceptional in his – apart from the applicant’s attempt to\n                            disrupt the trial at the incipient stage for the reason that the\n                            investigating officer was present in court when three witnesses were\n                            giving their evidence. 46     These wise words were particularly apt in the\n                    situation before Choo J. However, there is no reason why the policy\n                    considerations articulated by him, and also by Rose CJ inHoo Chang Chwenalmost 50 years ago, should not apply to\n                    my analysis of s 263 of the CPC as well. A broad interpretation of\n                    s 263 of the CPC would provide a backdoor for appealing against\n                    interlocutory orders by the alternative avenue of referring questions of law to\n                    the High Court for its determination. 47     I note that there is no local decision\n                    directly on point where an application has been brought under s 263(4) of\n                    the CPC in respect of an interlocutory order of a trial judge to summon a\n                    witness after the close of the Defence’s case. However, the decision inWee Eh Tiang, where an issue surfaced under\n                    the predecessor section of s 263 of the CPC, merits discussion. In that\n                    case, the accused was charged with intentionally giving a false statement in\n                    that he had made contradictory statements to the police and the court. He wished\n                    to plead guilty to the charge, but the Magistrate refused to accept his plea as\n                    he was of the view that the statements given by the accused to the police were\n                    inadmissible as they were hearsay, and that what was admissible could not by\n                    itself form the basis of a criminal charge against the accused for making a\n                    false statement. The Prosecution objected to the Magistrate’s refusal to\n                    accept the plea of guilt, as a result of which the hearing was adjourned. The\n                    Magistrate subsequently referred a point of law to the High Court for its\n                    determination. 48     The High Court (perRigby J) found that there was no provision in the FM\n                    CPC that empowered a subordinate court to refer a point of law for the decision\n                    of the High Court. He, however, held that such a jurisdiction existed in\n                    ss 317 and 318 of the 1936 CPC, and that those provisions were applicable\n                    by virtue of s 5 of the FM CPC, which provided that “the law\n                    relating to criminal procedure for the time being in force in the Colony of\n                    Singapore shall be applicable in cases where no special provision in relation to\n                    criminal procedure exists in the [FM CPC] itself”. Sections 317(1)\n                    and 318(1) of the 1936 CPC provided as follows: 317.—(1) Any Police Court or District Court acting in summary\n                        jurisdiction in any criminal cause or matter may, if it thinks fit,at the conclusion of the proceedings or at any time\n                            within seven days from the time of the judgment, acquittal, sentence or\n                            order passed or made therein, reserve for the consideration\n                        of the High Court any questions of law arising in such proceedings, setting\n                        out shortly the facts on which the law is to be applied and the questions of\n                        law to be determined thereon. … 318.—(1) The High Court shall hear and determine the question\n                        or questions of law arising on such special case and shall thereupon affirm,\n                        amend or reverse the determination in respect of which the special case has\n                        been stated or remit the matter to the Police Magistrate or District Judge\n                        with the opinion of the Court thereon or may make such order in relation to\n                        the matter as to the Court seems fit. … [emphasis added] 49     It can be seen that ss 317(1) and 318(1)\n                    of the 1936 CPC are substantially in the same terms as ss 263(1) and 264 of\n                    the CPC, except for the omission of the words “at the conclusion of the\n                    proceedings” (see s 317(1) of the 1936 CPC) from s 263(1) of\n                    the CPC. InWee Eh Tiang, Rigby J held (at\n                    121) that the High Court could “properly entertainat\n                        this stagethe point of law on which its opinion [was]\n                    sought” [emphasis added] as, on the facts of the case, the Magistrate had\n                    neither rejected the plea of guilty nor ordered the trial to proceed; he had\n                    effectively made no “order” within the terms of s 317(1) of\n                    the 1936 CPC. It would appear that Rigby J, in making his ruling, was\n                    concerned more with the meaning of the words “at the conclusion of the\n                    proceedings” than with whether the Magistrate had made a final or\n                    interlocutory order for the purposes of s 317(1) of the 1936 CPC before he\n                    adjourned the hearing. It is not clear fromWee Eh\n                        Tiangwhether the Magistrate had made any order at all when he\n                    adjourned the hearing. In other words, the issue of what constituted an\n                    “order” was not decided in that case. In the circumstances, no\n                    assistance can be derived from this decision as to the meaning of the word\n                    “order” in s 317(1) of the 1936 CPC. In any case, since the\n                    words “at the conclusion of the proceedings” were omitted from\n                    s 263(1) of the CPC,Wee Eh Tiangwould not\n                    be a relevant authority on the interpretation of this provision. 50     Reverting to s 263 of the CPC, it may be\n                    argued that if it is not applicable to interlocutory orders, then its scope\n                    would be very limited. That may be so, but it could still provide a useful\n                    avenue for clarifying the law in appropriate cases (see for example,Public Prosecutor v Knight Glenn Jeyasingam[1999]\n                    1 SLR(R) 1165 (“Knight Glenn Jeyasingam\n                        (1999)”)).In that case, the\n                    Public Prosecutor applied after the conclusion of the trial in the District\n                    Court to refer a question of law arising from the District Court’s refusal\n                    to admit in evidence a prior statement of the accused which he had made in a\n                    letter sent to the Public Prosecutor before he was charged. The statement gave a\n                    particular explanation as to why the accused (in his own view) had not committed\n                    the offence for which he was being investigated. After the accused was charged\n                    with that offence and his defence called, the accused gave a different\n                    explanation for theactusreus. The Prosecution sought to admit the earlier statement of\n                    the accused to discredit his testimony. The District Court held that the\n                    accused’s earlier statement to the Public Prosecutor was not admissible as\n                    it was confidential and had been made without prejudice for the purpose of plea\n                    bargaining. The High Court (perYong CJ)\n                    affirmed the District Court’s decision on the same ground. It should be\n                    noted that this principle (viz, that letters of\n                    representation written to the Public Prosecutor, even before the writer is\n                    charged for any offence, are privileged) was applied by Yong CJ inNg ChyeHuay and another v\n                        Public Prosecutor[2006] 1 SLR(R) 157 to similar\n                    letters to the police that fulfilled certain conditions. 51     There are two other considerations which have\n                    persuaded me that s 263 of the CPC should be interpreted narrowly. The\n                    first is that there is a structural symmetry between an application to refer to\n                    the High Court questions of law arising from an order of a trial court under\n                    s 263 of the CPC and an application under s 60 of the Supreme Court of\n                    Judicature Act (Cap 322, 2007 Rev Ed) (which was repealed with effect\n                    from 2 January 2011 and re-enacted in different words as s 397 of the\n                    CPC 2010) to refer to the Court of Appeal questions of law of public interest\n                    arising from a decision of the High Court. A reference to the Court of Appeal\n                    may only be made with respect to final judgments. The second consideration is\n                    that even if the DJ’s Order has prejudiced the Applicant, resulting in his\n                    conviction (a conclusion which still cannot be determined at this stage of the\n                    proceedings), the Applicant can appeal against his conviction on the ground that\n                    Cpl Hakim’s evidence was wrongly admitted. A conviction caused by the\n                    wrongful admission of evidence may be set aside on appeal under s 396 of\n                    the CPC (corresponding to s 423 of the CPC 2010) if it has occasioned a\n                    failure of justice. As such, the Applicant is not left without a remedy if the\n                    DJ’s Order is not reversed at this stage of the proceedings. 52     In the light of this conclusion, it will not\n                    be necessary for me to consider the Prosecution’s two other arguments in\n                    support of its submission that s 263 of the CPC applies only to a final\n                    order. The first is that the wording of the prescribed form for an application\n                    under s 263 of the CPC (viz, Form 43)\n                    strongly suggests that such an application may only be made with respect to a\n                    final order. The second is that s 395 of the CPC 2010, which has replaced\n                    s 263 of the CPC, further buttresses the Prosecution’s submission.\n                    However, I do wish to comment on another submission that the Prosecution made\n                    concerning the revisionary jurisdiction of the High Court.",
        "The revisionary power of the High Court": "53     In the course of its oral submissions, the\n                    Prosecution argued that since the Applicant could have invoked the revisionary\n                    jurisdiction of the High Court under s 266(1) of the CPC to review the\n                    DJ’s Order, s 263 of the CPC should not be interpreted widely as that\n                    would create an awkward duplicity of recourse to the High Court in such cases.\n                    Section 266(1) of the CPC provides as follows: Power to call for records of\n                            subordinate courts 266.—(1) The High Court may call\n                        for and examine the record of any criminal proceeding before any subordinate\n                        court for the purpose of satisfying itself as to the correctness, legality\n                        or propriety of any finding, sentence or order recorded or passed and as to\n                        the regularity of any proceedings of that subordinate court. The Prosecution cited no authority for its submission, but certain\n                    annotations to s 266(1) of the CPC inButterworths’ Annotated Statutes of Singaporevol 3\n                    (Butterworths Asia, 1997) at pp 350 and 353 seem to support this\n                    position. 54     I have read these annotations, which are not\n                    supported by any authority. It seems to me odd if the revisionary jurisdiction\n                    of the High Court were to apply to a subordinate court’s interlocutory\n                    order in the nature of the DJ’s Order since the words “finding,\n                    sentence or order” in s 266(1) of the CPC would also suggest the\n                    same element of finality that the rather similar words in ss 241 and 263 of\n                    the CPC (viz, “judgment, sentence or\n                    order”) do. In the circumstances, since the Applicant has not invoked the\n                    revisionary jurisdiction of the High Court in this Application, I shall neither\n                    accept nor reject the Prosecution’s submission on this issue and leave it\n                    to be decided in a future case.",
        "Is this Application frivolous under section 263(3) of the\n                CPC?": "55     Under s 263(3) of the CPC, the trial\n                    court may not refuse an application by an accused to refer a question of law to\n                    the High Court for its determination except where the application is frivolous\n                    (see the third requirement at[37]above).\n                    However, the word “frivolous” is neither defined in that\n                    provision, nor explained in any reported decision or judicial statement on\n                    s 263(3) of the CPC. The present case appears to be the first time that an\n                    application has been made under this provision in connection with an order made\n                    by a trial court under s 399 of the CPC. 56     The ordinary meaning of the word\n                    “frivolous” is “trivial”, “trifling”,\n                    or “unimportant”. Obviously, what is frivolous must depend on the\n                    context in which the particular idea or act in question is evaluated. In the\n                    context of court proceedings, a frivolous court application would be one that,\n                    if granted, is irrelevant to the issue in dispute or its outcome. A dispute on\n                    whether fact X or fact Y is the truth would be frivolous if neither\n                    fact is material to the resolution of the dispute. An application to the court\n                    to declare what the law is on a particular issue would also be frivolous if the\n                    law is already well established or settled on that issue. Indeed, such an\n                    application may even amount to an abuse of process or vexation to the other\n                    party as it would be a waste of time and resources to restate and litigate about\n                    settled law. In other words, the High Court’s determination of any\n                    question of law under s 263 of the CPC must serve a purpose that is\n                    material either to the proceedings at hand or to future proceedings in trial\n                    courts, in the latter case, serving as a guide on the applicable law should the\n                    same legal issue arise in a similar factual context. The latter purpose is\n                    implicit from the terms of s 264 of the CPC, which requires the High Court,\n                    in a special case stated under s 263 of the CPC, to affirm, amend or\n                    reverse the determination of the trial judge and to make, if it deems fit,\n                    consequential orders. Hence, if the question of law which is sought to be\n                    reserved for the High Court’s consideration under s 263 of the CPC\n                    does not enable the High Court to make any of the aforesaid orders, it is a\n                    factor to be taken into account in determining whether the application to\n                    reserve that question is a frivolous application. 57     Apropos this Application, it is reasonable to\n                    assume that it was made for the purpose of either: (a) setting aside the\n                    DJ’s Order, so that Cpl Hakim would not be called to testify; or\n                    (b) obtaining the High Court’s opinion on the 3 Questions, which\n                    opinion might enable the Applicant to successfully appeal against his conviction\n                    should Cpl Hakim give evidence favourable to the Prosecution. The Applicant\n                    would have no interest whatsoever in the High Court affirming the DJ’s\n                    Order or amending it in a way that is unfavourable to his defence. Let me now\n                    analyse the 3 Questions to see whether or not this Application is\n                    frivolous. 58     The 3 Questions (as amended), which will\n                    hereafter be referred to as “Question 1”,\n                    “Question 2” and “Question 3”\n                    respectively, are as follows:[note: 2] Question 1– Whether a trial\n                        judge, in a summary trial, has anunfettereddiscretion under s.399 of the Criminal Procedure Code (Cap.68 Rev. Ed. 1985)\n                        to require prosecution to call an additional witness after defence closes\n                        its case and after final submissions have been made by both defence and\n                        prosecution? Question 2– In the event that\n                        the answer to the first question is in the negative, would the further\n                        evidence first need to beex improvisoand\n                        which no human ingenuity could foresee, before an additional witness is\n                        called? Question 3– Where the evidence\n                        sought to be admitted as further evidence was notex\n                            improviso,and which no human ingenuity\n                            could foresee, are there any other circumstances which would\n                        justify further evidence to be called by a trial judge after close of\n                        defence’s case and after parties have made submissions? [underlining and emphasis in italics in original] Question 1 59     It is clear that Question 1 is intended\n                    to seek a negative ruling from the High Court on the basis of the decisions inDora Harrisand/orChristopher Bridges(CA)(which\n                    the Applicant relied upon to object to the making of the DJ’s\n                        Order).However, Question 1 does not\n                    arise in the proceedings at all simply because the DJ did not decide that his\n                    discretion under s 399 of the CPC was unfettered. Indeed, his reasons for\n                    distinguishingDora HarrisandChristopher Bridges (CA)(see[9]above) implicitly acknowledged that his discretion to call\n                    Cpl Hakim to testify was not unfettered. Furthermore, all the local\n                    decisions which I mentioned earlier have also made clear that the trial\n                    judge’s discretion under s 399 of the CPC is not unfettered.\n                    Therefore, the principle of law which Question 1 seeks the High\n                    Court’s decision on is settled law. For these two reasons, Question 1\n                    is irrelevant to the correctness of the DJ’s Order, and therefore this\n                    Application is, in that respect, frivolous for the purposes of s 263(3) of\n                    the CPC. Question 2 60     Question 2 is intended to seek an\n                    affirmative answer from the High Court, again on the basis of the decisions inDora Harrisand/orChristopher Bridges(CA).However,\n                    as I have shown earlier, neither decision is applicable to the present case in\n                    the light of s 399 of the CPC, which, the local cases have established,\n                    confers on a trial judge a power of much wider scope than the corresponding\n                    power under English law (see[15]–[25]above). The\n                    decisions of the local courts on s 399 of the CPC (or its equivalent) have\n                    established that the critical test as to whether the power therein may (or\n                    shall, as the case may be) be exercised is not theex\n                        improvisorule, but whether the calling of a witness by the courtsuomotuat any\n                    stage of the proceedings is essential to the justice of the case. Whether such a\n                    test is satisfied would depend on the facts of every case. Since a negative\n                    answer to Question 2 would not result in the reversal of the DJ’s\n                    Order (and therefore prevent Cpl Hakim from testifying), it is, like\n                    Question 1, a frivolous question. Question 3 61     Question 3 seems to be the mirror image\n                    of Question 2. However, it is even more objectionable than Question 1\n                    and Question 2 because it seeks general advice from the court and not a\n                    specific answer to a precisely framed question of law. No court can spell out\n                    exhaustively the circumstances which would justify the calling of further\n                    evidence by a trial judge after the close of the Defence’s case and after\n                    the parties have made their respective submissions. The critical test is, in the\n                    words under s 399 of the CPC, whether the calling of a witness by the court\n                    is “essential to the just decision of the case”. As the local case\n                    law has established, this depends on the facts of the case. As such,\n                    Question 3 suffers from the same flaw as the other two\n                questions. 62     What this discussion on the 3 Questions has\n                    shown is that under the statutory scheme established by ss 263 and 264 of\n                    the CPC, any application to a trial court to refer a question of law to the High\n                    Court for the latter’s determination must relate to a specific question\n                    within a framework of agreed facts so that the High Court can give a specific\n                    answer that will allow it to affirm, amend or reverse the determination of the\n                    trial court in the case at hand, or state a principle of law for the guidance of\n                    trial courts in future cases involving the same legal issue in a similar factual\n                    context. The 3 Questions, as framed, are incapable of eliciting any answers, on\n                    the basis of established law, that can achieve any of these purposes. It is not\n                    the role of the High Court to give rulings on the law which are purely academic\n                    in nature, and a trial court is not obliged to state a case on a question of law\n                    which can only elicit an academic ruling from the High Court. An example of a\n                    question of law contemplated by s 263 of the CPC may be found inKnight Glenn Jeyasingam (1999). In that case, the Public\n                    Prosecutor applied under s 263 of the CPC for a specific question of law in\n                    relation to a specific set of facts to be referred to the High Court for its\n                    determination (see[50]above).",
        "Summary of rulings": "63     In summary, I hold that: (a) the word\n                    “order” in s 263(1) of the CPC refers to a final order and\n                    not an interlocutory order; and (b) this Application is frivolous under\n                    s 263(3) of the CPC for the reason that the 3 Questions cannot elicit any\n                    specific answer of the kind mentioned at[62]above. 64     Before I conclude, I wish to mention one issue\n                    which I drew to the Prosecution’s attention in the light of its argument\n                    that s 263(1) of the CPC is applicable only to a final order. On the basis\n                    of the Prosecution’s submission, if a trial court were to rule as\n                    admissible evidence which the Prosecution claims to be protected by public\n                    interest immunity, the Prosecution will not be able to invoke s 263(1) of\n                    the CPC to obtain a ruling from the High Court to reverse the trial\n                    court’s order. Since the Prosecution made no submission on this particular\n                    situation, I assume that it is prepared to live with this situation and to deal\n                    with any consequential awkwardness in some other way.",
        "Conclusion": "65     For the above reasons, this Application is\n                    dismissed.  [note: 1]See the Notes of Evidence for Wednesday\n                                18 May 2011 (Day 7 of the trial) at\n                            p 23. [note: 2]See the\n                                Applicant’s Submissions at\n                    p 4."
    }
}