{
    "case_title": "CDL Properties Ltd\n      v\n      Chief Assessor and another",
    "ncitation": "[2011] SGHC 31",
    "coram": "Kan Ting Chiu J",
    "sections": {
        "Appeal Nos. 54–168": "2       These appeals relate to 115 units in RP. Between\n                    6 June and 8 June 2007 the Chief Assessor issued notices under\n                    s 20(1) of the Property Tax Act (Cap 254, 2005 Rev Ed)\n                    (“the Act”), proposing to increase the annual value for the units\n                    from about $4.20 psf/mth to $11 psf/mth with effect from 1 January\n                    2007.",
        "Appeal Nos. 172–173": "3       These appeals relate to two units in RP which\n                    were subdivided from one of the 115 units in Appeal Nos. 54–168 on\n                    16 June 2007. Following the subdivision, the Chief Assessor issued notices\n                    under s 20(1) of the Act and proposed to increase the annual value for\n                    these units to $11 psf/mth.",
        "Appeals to the Board": "4       CDL appealed to the Board against both\n                    proposals. In the appeals, CDL argued that the annual value should be $7 psf/mth\n                    with effect from 1 January 2007 for the 115 units and $9.80 psf/mth for the\n                    two units from 16 June 2007.",
        "The Board’s decision": "5       The appeals were heard by the Board on\n                    14 April 2009. The Board allowed Appeal Nos. 54–168 in part, and\n                    ordered the annual value for the 115 units be set at $7 psf/mth as at\n                    1 January 2007, and be raised to $11 psf/mth with effect from the dates on\n                    which the Chief Assessor’s notices were issued (the “Notice\n                    Dates”). The Board decided not to award costs for this set of appeals as\n                    CDL had failed in its argument that the annual value for the whole of the year\n                    2007 should be fixed from 1 January 2007 at $7 psf/mth and had succeeded\n                    into having the increased annual values deferred to the Notice Dates. The Board\n                    explained that it did not award interest on the refund of the excess tax paid on\n                    the 115 units because: ... the Appellants could have asked the Board to exercise its discretion\n                        to award interest. As they did not do so, the Board was not able to hear\n                        arguments from both sides on the issue and therefore, there was no order\n                        made as to the award of interest.[note: 1] The other set of appeals, Appeal Nos. 172–173 was dismissed\n                    with no order as to costs.",
        "The present appeal": "6       CDL appealed against the Board’s decisions\n                    in the two sets of appeals on the grounds that the Board had erred in: (i)     ordering that the annual values for\n                        the 115 units be amended to $11 psf/mth with effect from the Notice\n                        Dates; (ii)     dismissing CDL’s appeal that the annual value for the two units be\n                        set at $9.80 psf/mth with effect from 16 June 2007; (iii)     not ordering interest to be paid on\n                        the refund of the property tax paid for the 115 units;\n                    and (iv)     not ordering\n                        costs in favour of CDL in Appeal Nos. 54–168. and in the appeal before me, CDL put forward a host of arguments which I have\n                    taken the liberty to re-organise.",
        "(i)   The Board has no power to amend the annual values of the 115\n                with effect from the Notice Dates": "7       This submission was made in the context of the\n                    Appellant’s presentation of the “General Scheme of the Act”.\n                    It argued that: 45.    ... [T]he Act generally envisages that property\n                            tax is paid annually in advance based on the Valuation List prepared by\n                            the Chief Assessor for the year. However, in some circumstances where\n                            there is a specified change in respect of a property in the year, the\n                            Comptroller of Property Tax may collect any property tax that is\n                            underpaid. 46.    In other words, it is implicit that the Valuation\n                            Lit for each year is valid for the entire year and any general change in\n                            market rents (i.e. not a specified change in respect of a specific\n                            property) over the course of the year should be reflected in the\n                            Valuation List for the next year. 8       The Appellant relied on s 6(1) and (2)(a)\n                    of the Act[note: 2]that: 6(1) As from 1st January 1961, a property tax shall, subject to the\n                        provisions of this Act, be payable at the rate or rates specified in this\n                        Act for each year upon the annual value of all houses, buildings, lands and\n                        tenements whatsoever included in the Valuation List and amended from time to\n                        time in accordance with the provisions of this Act. (2) The tax shall be payable by the owner of such property\n                        — (a) in the case of tax payable under subsection (1), yearly in advance\n                            without demand, in the month of January; but s 6(2)(a) should be read with\n                    s 6(2)(b): (b) without prejudice to paragraph (a),\n                        where the Comptroller has served a notice for payment of the tax under this\n                        Act, within one month of the service of that notice. 9       Giving the provision a proper construction, the\n                    Valuation List must refer to a Valuation List in operation. When a Valuation\n                    List is amended, the Valuation List is the amended Valuation List. 10     Reverting to the facts of the appeal, the\n                    Chief Assessor had amended the Valuation List so that the annual value was to be\n                    fixed at $11 psf/mth with effect from 1 January 2007. When the appeal\n                    against the amendments went before the Board, the Board ruled that the annual\n                    value should be fixed at $7 psf/mth up to the Notice Dates, and that the annual\n                    value was to be increased to $11 psf/mth with effect from the Notice\n                    Dates. 11     The Board derived its power to amend a\n                    Valuation List from s 33(1)(a) and (b) of the Act which state that: 33. – (1) The Board, after hearing an appeal, may\n                        – (a) in the case of an appeal made under section 20A, dismiss the\n                            appeal or direct that such amendmentsas it thinks\n                                propershall be made to the Valuation List for the year\n                            in respect of which the appeal was made and for the ensuing years;\n                            and (b) in the case of an appeal made under section 22, confirm, vary or\n                            rescind the proposal of the Comptroller. [emphasis added] 12     There are no restrictions laid down on the\n                    amendments that the Board could make to the Valuation List. The Board can amend\n                    the Valuation List “as it thinks proper”, and if the Board decides\n                    on the facts before it that it thinks proper that a proposed increment of the\n                    annual value should take effect from the date of the Chief Assessor’s\n                    notice rather than the beginning of the year, the Board has the power to amend\n                    the Valuation List accordingly. 13     Section 6(1) and (2) do not limit the\n                    breadth of s 33(1). Under s 6(2)(a) the property tax for any year is\n                    payable in advance in January. CDL had paid property tax for the 115 units in\n                    advance, based on the rate in the Valuation List prevailing at the time of\n                    payment. While CDL had fulfilled its property tax obligations when it made\n                    payment, that does not mean that the payment will not be adjusted if the\n                    Valuation List is amended. 14     After the property tax on a property has been\n                    paid, the Chief Assessor or the Board may decide that the annual value of the\n                    property has changed upwards or downwards with effect from a specific date, and\n                    amend the Valuation List to reflect the change. In the case of the 115 units the\n                    Board had a reason for setting the commencement date for the $11 psf/mth annual\n                    value to the Notice Dates. In its Grounds of Decisions, it explained: 22    Restricting the\n                            survey to rental evidence around the period 1 January 2007 to June\n                            2007, the Board was of the view that there was sufficient evidence to\n                            indicate that rentals had risen to $11 psf/mth by the end of the second\n                            quarter of 2007 (i.e. around the date of the Notices): 22.1   Leases in Republic Plaza contracted between\n                                May and July 2007 ranged between $10.50 psf/mth and $12.80 psf/mth.\n                                The lease at $12.80 psf/mth was a 2-year lease while the lease at\n                                $10.50 psf/mth was a 3-year lease. The rental evidence for 2007\n                                shows that rents for 2-year leases were on average higher than rents\n                                for 3-year leases. 22.2   The table of Average Grade A Office (Gross)\n                                rentals for 2007 compiled by the Respondents indicates that average\n                                rents for 2Q07 ranged between $11.00-$14.50 psf/mth and for 4Q06 (a\n                                proxy for 1 January 2007) ranged between $8.74 to $9.10\n                                psf/mth. ... 24    On the other hand, the same materials that the\n                            Chief Assessor relied on to show that rentals had risen to $11 psf/mth\n                            by 2Q07 also show that on 1 January 2007, net rentals were\n                            significantly lower than $11 psf/mth. 25.    The Board was therefore of the view that for VRB\n                            54 to 168 of 2008, the Annual Value should be set at $7 psf/mth with\n                            effect from 1 January 2007 and $11 psf/mth with effect from the\n                            date of the Notice which would be in most cases 8 June 2007. Therefore,\n                            the Board directed that the Valuation List be amended\n                            accordingly. 15     Changes in the annual value are factual\n                    matters, which do not necessarily take effect at the beginning of the year. If\n                    the annual value is found to have increased, say with effect from the first day\n                    of July, there is no reason why additional tax should not be paid for the second\n                    half of the year just because the tax for the whole year computed on the\n                    original annual value has been paid at the beginning of the year. For the same\n                    reason, if the annual value is reduced with effect from 1 July, the excess\n                    tax paid at the beginning of the year should be refunded to the taxpayer.\n                    Section 6(1) and (2) should not be construed to mean that when property tax\n                    has become payable, the tax cannot be adjusted even when the Valuation List is\n                    amended. Such a construction would defeat the purpose of the amendment for the\n                    first year when there is no reason for not giving immediate effect to the\n                    amendment.",
        "(ii)   The valuation adopted by the Board was wrong, and the Board\n                should have preferred the rental evidence from longer-term leases": "16     The Board referred to the evidence on the\n                    rents and leases which were presented before it, and had stated in its Grounds\n                    of Decision that: 22.1  Leases in Republic Plaza contracted between May\n                            and July 2007 ranged between $10.50 psf/mth and $12.80 psf/mth. The\n                            lease at $12.80 psf/mth was a 2-year lease while the lease at $10.50\n                            psf/mth was a 3-year lease. The rental evidence for 2007 shows that\n                            rents for 2-year leases were on average higher than rents for 3-year\n                            leases. 22.2  The table of Average Grade A Office (Gross)\n                            rentals for 2007 compiled by the Respondents indicates that average\n                            rents for 2Q07 ranged between $11.00-$14.50 psf/mth and for 4Q06 (a\n                            proxy for 1 January 2007) ranged between $8.74 to $9.10\n                            psf/mth. 17     The Appellant made an issue over this part of\n                    the Grounds of Decision and argued that: The VRB erred in law in not preferring the rental evidence from\n                        longer-term leases of units in Republic Plaza.[note: 3] 18     The Appellant supported the argument by\n                    pointing out that the definition of “annual value” in s 2 of\n                    the Act is the gross amount which “can reasonably be expected from year\n                    to year”, and submitted that the phrase “from year to year”\n                    implied “a continuous period of rental for an indefinite time and that is\n                    more consistent with a longer-term lease”.[note: 4]The\n                    Appellant cited Lord Esther MR inR v South Straffordshire\n                        Waterworks Co(1885) 16 QBD 359 where he said at\n                    370: A tenant from year to year is not a tenant for one, two, three or four\n                        years, but he is to be considered as a tenant capable of enjoying the\n                        property for an indefinite time, having a tenancy which it is expected will\n                        continue for more than a year, but which is liable to be put to an end to by\n                        notice. In the same vein, Lord Denning MR had stated that in determining rent\n                    from year to year, the lease period to be used should be: [T]he period not too short nor yet too long, simply from year to\n                        year. – R v Paddington Valuation Officer ex parte\n                        Peachy Property Corporation Limited[1966] 1 QB 380, at\n                    412. 19     In its Grounds of Decision, the Board had\n                    observed that rents under three-year leases are generally lower than rents under\n                    shorter leases, and the Appellant did not dispute the validity of the\n                    observation. But the Board did not hold that short-term rents are to be given\n                    more weight than long-term rents. It did not disregard the $10.50 rent for the\n                    three-year lease, and it also took into consideration the $12.80 rent for a\n                    two-year lease as well as the rents set out in the Table of Average Grade A\n                    Office Rentals for 2007 before it arrived at the rent of $11. 20     The Appellant had not shown that the Board had\n                    restricted itself to shorter-term lease rents and had ignored longer-term lease\n                    rents, or had preferred the former to the latter. It was not suggested that\n                    evidence on rents set “simply from year to year” or “for an\n                    indefinite time” or for terms beyond three-years had been placed before\n                    the Board. My understanding of prevailing rental practice in Singapore is that\n                    it is unlikely that any of the 115 units or any comparable property are rented\n                    out “from year to year” or “for an indefinite time”.\n                    The Appellant had read too much into the observation that rents for two-year\n                    leases are generally higher rents for three-year leases.",
        "(iii)   The Board had relied on inadmissible and unreliable\n                evidence in setting the annual value at $11 psf/m": "21     The Appellant objected to the Board’s\n                    reference to the Table of Average Grade A Office Rental for 2007 (“the\n                    Table”). The Appellant submitted that: [T]he table of Average Grade A Office (Gross) rentals was compiled by the\n                        Chief Assessor using extracts from various market reports of major property\n                        consultancy firms. There is no further information on how these figures were\n                        obtained and the properties from which these figures were complied. The\n                        evidence is completely unreliable. 22     The Chief Assessor had referred to the Table\n                    in its submissions to the Board and had noted that: The average monthly gross rental for Grade A office in Raffles Place range\n                        from $8.61 to $9.10 psf pm in the 1stquarter of\n                        2007. This rose to $16.56 to $17.15 psf pm by the\n                            4thquarter of 2007. The annual increase\n                        ranges from 82% to 96.5%. See Appendix III for details extracted from the\n                        various market reports of major property consultancy firms. They show a\n                        common consensus that office rental has increased significantly in\n                            2007.[note: 5] 23     The Appendix referred to was the Table, which\n                        reads[note: 6]: Average Grade A Office (Gross) Rental for 2007 Consultancy Firm4Q06 $psf\n                                                pm1Q07 $psf\n                                                pm2Q07 $psf\n                                                pm3Q07 $psf\n                                                pm4Q07 $psf\n                                                pm4Q06 to\n                                                4Q07CB Richard Ellis\n                                        (1)$8.73$10.60$12.40$14.90$17.1596.5%Colliers International\n                                            (2)$8.61$10.63$12.69$15.00$16.6493.3%Knight Frank\n                                        (3)$9.10$10.90$14.50$15.60$16.5682%Savills (Office)\n                                        (4)Nil$9.40$11.00$13.30$14.10NA   Sources of publications: 1    CB Richard Ellis Market View Singapore 2    Colliers International (Singapore) – The\n                            Knowledge Report 3    Knight Frank Real Estate Highlights\n                            (Singapore) 4    Savills Research Singapore The sources of the data in the Table were disclosed. A diligent\n                    valuer can refer to the disclosed sources and verify the accuracy of the\n                    Table. 24     The Table was brought into the proceedings\n                    before the Board for the first time in the Respondents’ Written\n                    Submissions dated 21 November 2008 after both sides had presented its\n                    evidence and witnesses before the Board. It was not part of the evidence of Yeo\n                    Peng Khoon, a valuer of the Property Tax Division who gave evidence on behalf of\n                    the respondents before the Board. The Appellant could have objected the\n                    introduction of the Table in the closing submissions. It had the opportunity to\n                    do that when it filed its further submissions on 5 December\n                        2008[note: 7], but it did not object to\n                    the Table or seek clarification on it. It raised no questions over the\n                    admissibility or reliability of the Table in its submissions, and even during\n                    the appeal before me, it did nothing to substantiate the assertion that the\n                    Table was unreliable.",
        "(iv)   The Board did not award interest to the Appellant": "25     In its submissions the Appellant accused the\n                    Board of havingrefusedto exercise its discretion\n                    to award interest.[note: 8]This was an unjustified criticism against\n                    the Board which had explained its decision for not exercising its discretion to\n                    award interests (see para 5 hereof). In the light of the explanation,\n                    nothing more needs to be said, except that the complaint reflected unfavourably\n                    on the Appellant and its solicitors.",
        "(v)   The Board did not award costs to the Appellant in Appeal\n                Nos. 54 to 168": "26     Costs, as the Appellant acknowledged, may be\n                    awarded at the discretion of the Board. The Board had exercised its discretion,\n                    and in my view, exercised it reasonably. While the Appellant would prefer a more\n                    favourable decision on the issue, it had no basis for alleging that the Board\n                    had erred in the exercise of its discretion.",
        "Conclusion": "27     The appeal is dismissed with costs to be taxed\n                    if not agreed.  [note: 1]Grounds of\n                                    Decision of the Board, para 27 [note: 2]Appellant’s Case para\n                        40 [note: 3]Appellant’s Case para 89 [note: 4]Appellant’s Case para 90 [note: 5]Affidavit of Lee Lai Ging dated 12\n                                    October 2009 para 8 [note: 6]Affidavit of Lee Lai Ging dated 12 October 2009 page\n                                221 [note: 7]Affidavit of Lee Lai Ging dated 12 October 2009 pages\n                                222 – 230 [note: 8]Appellant’s Case para\n                            36(d)"
    }
}