{
    "case_title": "Teo Ai Hua (alias Teo Jimmy) and another\n      v\n      Teo Mui Mui",
    "ncitation": "[2011] SGHC 81",
    "coram": "Steven Chong J",
    "sections": {
        "Introduction": "1       This case involves a dispute between siblings\n                    over the ownership of a property at People’s Park Complex (“the\n                    Property”). The Property was registered solely in the name of the\n                    defendant, the sister. There is, however, no dispute that the bulk of the\n                    purchase price for the Property, some 85%, was funded by her two brothers, the\n                    plaintiffs. The parties were at loggerheads whether the funding by the\n                    plaintiffs was by way of “friendly loans” or as a co-investment in\n                    the Property. However, if they were loans as alleged by the defendant, based on\n                    the monthly repayment to the 2ndplaintiff from the\n                    distribution of the rental income earned from the Property, it would take the\n                    defendant almost thirty years to repay the “friendly loan” to the\n                        2ndplaintiff. 2       After the purchase of the Property, the\n                    defendant wrote to the 1stplaintiff to suggest that\n                    they buy “onemorePPK complex\n                    unit”. In her effort to persuade the 1stplaintiff to purchase another unit at People’s Park Complex\n                    (“PPK”) with her, the defendant assured the\n                        1stplaintiff that she would not cheat him or\n                        “makan the hse [sic] for\n                    herself”. Ironically the plaintiffs’ worst fears were\n                    confirmed when the defendant refused to recognise their respective shares in the\n                    Property and sought to claim the Property for herself thereby necessitating the\n                    commencement of the present proceedings. 3       When it became clear that the defendant’s\n                    “loan” case theory was tenuous, she resorted to rely on the\n                    defence of illegality to preclude the plaintiffs from claiming their\n                    proportionate shares in the Property. Not only was this defence not pleaded,\n                    which is not necessarily a bar in itself, a review of the relevant cases exposed\n                    the defence to be devoid of any merit.",
        "Background": "4       The plaintiffs’ claim is for a declaration\n                    that the Property is held by the defendant in resulting trust for the benefit of\n                    the plaintiffs and the defendant in proportion to each party’s direct\n                    capital contributions and that the Property be sold and proceeds divided\n                    according to the parties’ respective shares. 5       The purchase price of the Property was\n                    $320,000.00. There is no dispute that the plaintiffs contributed an aggregate\n                    sum of $285,436.04 towards the purchase price of the Property (“the\n                    Sums”). Specifically, the 2ndplaintiff paid\n                    $3,200.00 as the initial option fee of 1%. The balance deposit of 9%\n                    ($28,800.00) was paid by the 1stplaintiff. At\n                    completion, the 1stplaintiff and the\n                        2ndplaintiff paid further amounts of $126,200.00\n                    and $127,236.04 respectively. In contrast, the defendant contributed only a\n                    total sum of $50,000.00 towards the purchase price of the Property. However\n                    notwithstanding the plaintiffs’ respective contributions, the\n                        1stand 2ndplaintiffs agreed between themselves (settling their own accountsvis-a-viseach other) that their respective shares in\n                    the Property were 64.1% and 20.3% instead. The defendant’s contribution\n                    was 15.6% ($50,000 of $320,000). 6       However, the parties offered very different\n                    versions as regards the purpose for the payments of the Sums. The\n                    plaintiffs’ case is that the purchase of the Property was a co-investment\n                    by all parties and that the Sums constituted their contributions to that\n                    investment. In contrast, the defendant argued that the Sums were simply loans,\n                    “repayable on demand”, which were advanced to her by the\n                    plaintiffs, as her brothers, to enable her to purchase the\n                Property. 7       Neither the co-investment nor the loan was\n                    documented in any formal agreement. After the purchase of the Property was\n                    completed, two documents were prepared in connection with the Property. First, a\n                    Power of Attorney dated 27 November 2005 (“POA”) was executed by\n                    the defendant in favour of the 1stand\n                        2ndplaintiffs. Under the POA, the plaintiffs\n                    were empowered by the defendant to carry out various acts on behalf of the\n                    defendant in relation to the Property including,inter\n                        alia, collection of rent, granting of leases and tenancies,\n                    payment of taxes, rates, charges and other outgoings and instituting legal\n                    proceedings to recover possession of the Property. In executing the POA on\n                    29 November 2005, the defendant added the words “for purpose of\n                    collecting rent & tenancy” in her own handwriting next to her\n                    signature. Second, a Memorandum of Understanding (“MOU”) was\n                    prepared by the plaintiffs which was allegedly to be executed by all parties to\n                    reflect the proper percentages and other terms of the co-investment to avoid any\n                    future dispute. According to the plaintiffs, the MOU was allegedly forwarded to\n                    the defendant in December 2005, a claim which the defendant denied. She alleged\n                    that the first time she received the MOU was on 14 November 2008 at the\n                    office of the plaintiffs’ solicitor but she refused to sign the MOU\n                    because she did not agree with its terms.",
        "Issues before this Court": "8       There are two main issues before this\n                    Court: (a)whether the Sums were disbursed as the\n                            plaintiffs’ contributions as co-investment in the Property or as\n                            loans to the defendant; and(b)if the Sums were disbursed as the\n                            plaintiffs’ contributions to the co-investment, whether the\n                            doctrine of illegality operates to rebut the resulting trust in favour\n                            of the plaintiffs.I will deal with each issue in turn.The purpose for which the Sums were disbursed9       Before I begin my evaluation of the evidence as\n                    to whether the Sums were disbursed as the plaintiffs’ contributions to the\n                    co-investment in the Property or as loans to the defendant, it is important to\n                    highlight that there is no halfway house between the two competing case\n                    theories. If I find that the Sums were not loans, then it must follow that they\n                    were instead the plaintiffs’ contributions as co-investment in the\n                    Property.10     The defendant sought to rely on the following\n                    to either prove the loans or to disprove the alleged co-investment with the\n                    plaintiffs:(a)     The plaintiffs did not inform the\n                        solicitor who was engaged to handle the purchase of the Property of any\n                        trust arrangements in relation to the Property.(b)     The unchallenged evidence of the\n                        defendant’s daughter that the defendant had told the plaintiffs at a\n                        meeting in the plaintiffs’ solicitor’s office on\n                        14 November 2008 that the draft MOU to reflect the proper percentages\n                        of the parties and other terms of the co-investment was not previously\n                        provided to the defendant as alleged by the plaintiffs.(c)     The POA dated 27 November 2005\n                        supports the defendant’s case that she had executed the POA in favour\n                        of the plaintiffs merely to allow either of them to collect the monthly\n                        rents from the tenant(s) directly, deduct the respective sums of $1,147.00\n                        and $358.00 in accordance with the monthly instalment plan (being repayments\n                        of the respective loans to the plaintiffs) and for reimbursement of\n                        outgoings, before paying the balance amounts over to the\n                    defendant.11     While it is true that none of the above proved\n                    that the Property was a co-investment by the parties, it is equally true that\n                    they do not inexorably establish that the monies were advanced as loans for the\n                    purchase of the Property. Therefore, even if the defendant’s arguments are\n                    taken at its highest, it is clear that they are, at best, neutral with respect\n                    to either of the case theories put forward by the plaintiffs and the\n                    defendant.Sums entirely consistent with\n                        co-investment12     Having reviewed the evidence before me, I find\n                    that the Sums were disbursed by the plaintiffs as their contributions to the\n                    co-investment in the Property and not as loans to the defendant. There is a\n                    multitude of reasons to support this finding, to which I elaborate below:(a)     First, I accept the evidence of the\n                        plaintiffs that the agent for the Property, Ms Koo Suit Har\n                        (“Ms Koo”), was appointed by the\n                            1stplaintiff. This was corroborated by\n                        the evidence of Ms Koo who testified that all instructions in respect\n                        of the purchase of the Property came from the 1st plaintiff. Although\n                        the defendant alleged in her affidavit of evidence-in-chief that she had\n                        specifically instructed Ms Koo to approach the owners of the Property\n                        to find out whether they were willing to sell the Property, Ms Koo\n                        testified under cross-examination that there was no such instruction from\n                        the defendant. In fact, Ms Koo further testified that the\n                        defendant’s name was inserted in the option to purchase the Property\n                        on instructions from the 2nd plaintiff and interestingly, she verified those\n                        instructions not from the defendant, but from the 1st plaintiff instead. If\n                        the monies were extended as loans to the defendant, there would be no\n                        conceivable reason for the 1st plaintiff to appoint an agent to source for a\n                        unit at PPK. Such an act, in addition to the fact that the 1st plaintiff had\n                        issued all instructions in respect of the purchase of the Property down to\n                        naming the defendant as the purchaser, was more consistent with the\n                        plaintiffs having an investment interest in the Property.(b)     Second, the defendant’s claim\n                        that she was “a bit tight with money at that point of time”\n                        and hence had requested the plaintiffs to advance her $3,200.00 and\n                        $28,800.00 for the 1% option fee and the 9% balance deposit respectively is\n                        not supported by the objective evidence. The defendant admitted during\n                        cross-examination that at the material time, she owned four properties,\n                        including two condominiums in Singapore, a “5-star”\n                        condominium in Malaysia and a Housing Development Board\n                        (“HDB”) flat at Tanglin Halt Road (“the Other\n                        Properties”). Moreover, she also had about $150,000.00 in her various\n                        fixed deposit accounts which were “liquid”,ie, they could be withdrawn anytime. Therefore, by her own\n                        evidence, there was strictly no necessity for the defendant to borrow any\n                        money from the plaintiffs to purchase the Property in the first place. If\n                        the Property was intended as a purchase for the benefit of the defendant\n                        alone, she could have easily utilised her own financial resources to\n                        purchase the Property as she did for her purchase of the Other\n                        Properties.(c)     Third, it is undisputed that the 2ndplaintiff\n                        and the defendant sought to secure loans from banks to finance the purchase\n                        of the Property as co-borrowers. Two banks,ieRHB Bank Berhad and Hong Leong Finance Limited, were approached by the\n                            2ndplaintiff and/or the defendant to finance\n                        the purchase of the Property. Although the loan application was subsequently\n                        aborted, such conduct in seeking a loan as co-borrowers was more consistent\n                        with the purchase of the Property as a co-investment rather than a loan. If\n                        the loan application had gone ahead, it would be ludicrous for the defendant\n                        to contend that the 2ndplaintiff became a\n                        co-borrower from the bank in order to lend the money to the defendant to\n                        finance the purchase. After the loan application was aborted, the monies for\n                        the purchase substantially came from the plaintiffs. There is no reason to\n                        view the purchase of the Property as anything other than a co-investment\n                        because the plaintiffs had made direct financial contributions instead of\n                        securing finance from the bank.Further, the defendant was able\n                        to obtain financing for her purchase of the Other Properties. No reason was\n                        provided by the defendant as to why she could not have raised her own\n                        financing for the purchase of the Property without any involvement of the\n                        plaintiffs if the Property was indeed not intended to be a\n                        co-investment.(d)     Fourth, the defendant alleged at the trial that she had made three requests\n                        for loans from the plaintiffs. These requests added up to the Sums disbursed\n                        by the plaintiffs. However, not only were details on these loan requests not\n                        pleaded by the defendant, she was also unable to provide details of the\n                        terms of the alleged loans under cross-examination, except for a bare\n                        allegation that the loans were repayable on demand:[note: 1]QOkay. Let’s stay on your loan on\n                                            demand. So you are saying that you had---the other day\n                                            you said you had three agreements with the plaintiffs\n                                            – one for the 1%, one for the 9% and the balance\n                                            of the monies for the purchase of the property, right,\n                                            the balance 80%; you come out with 10%,\n                                        correct?AYes.QYou---you asked them---you said you asked\n                                            them three times, right?AYes.QYou can’t\n                                                remember the dates you asked\n                                        them?ACannot.QYou can’t even\n                                                remember the terms, what conditions and all that\n                                                that you---AOf course, I\n                                                know.QWhat are the\n                                                conditions?AThe---it’s\n                                                the---er, I used my rental to pay the instalment and\n                                                then anytime they can---they want to call back the\n                                                money, they can.[emphasis added](e)     Fifth, the defendant’s\n                        pleaded case is that the alleged repayment to the 2nd plaintiff was $358.00\n                        per month. It is not disputed that the\n                        2ndplaintiff contributed a total of\n                        $127,236.04 to the purchase of the Property. It is difficult to believe that\n                        the 2nd plaintiff, who does not own any private property and is nowhere as\n                        financially secure as compared to the defendant, would advance such a huge\n                        loan to the defendant, without interest, which would take about thirty years\n                        to repay based on a monthly repayment of $358.00. I find that the monthly\n                        payments of $1,147.00 and $358.00 were instead the 1st and 2nd\n                        plaintiffs’ respective shares of the rental income. The initial rental\n                        income for the Property was $2,200.00 per month. The net rental after\n                        deductions amounted to $1,792.00. The monthly payments of $1,147.00 and\n                        $358.00 to the 1st and 2nd plaintiffs respectively represented 64% and 20%\n                        of the net rental income which matched the 1st and 2nd plaintiffs’\n                        shares in the Property. This was no coincidence.(f)     Sixth, the defendant’s claims\n                        that the Sums were loans which were repayable on demand and that she has not\n                        repaid the outstanding amount to the plaintiffs in spite of the commencement\n                        of the present proceedings because they have not demanded repayment are\n                        likewise inconsistent with the evidence. The defendant claimed during the\n                        trial that she had repaid the 1stplaintiff a sum\n                        of $15,000.00 on 27 January 2006 without any request by the\n                            1stplaintiff. The defendant did so even\n                        though the 2ndplaintiff was only paid $358.00\n                        per month. The defendant’s repayment is more consistent with the\n                        plaintiffs’ claim that the\n                        1stplaintiff had advanced $15,000.00 on the\n                        defendant’s behalf at Completion (as part of the defendant’s\n                        $50,000.00 contribution towards the purchase of the Property) and that the\n                        defendant was simply repaying the $15,000.00 advance which was paid on her\n                        behalf by the 1stplaintiff at\n                    Completion.(g)     Seventh, the plaintiffs attended the Completion of the Property at the\n                        solicitor’s office and were the parties who ensured that the Sums were\n                        duly paid to the relevant parties with respect to the purchase of the\n                        Property. The 2ndplaintiff was also heavily\n                        involved with respect to the Property, having paid all monthly maintenance\n                        and other outgoings, and also undertook all renovation works jointly with\n                        the defendant. The 2ndplaintiff also\n                        frequently sourced for tenants and pursued some of the tenants for payment\n                        of rent during the 1stand\n                            2ndtenancy periods. Such acts are entirely\n                        consistent with co-ownership of the Property rather than a loan. The\n                        defendant also admitted that the 2ndplaintiff\n                        sourced and collected the rent because he wasmanagingthe Property:[note: 2]QOkay. So Danny paid for this renovation\n                                            with you for this property because he was a co-investor\n                                            with you?ANo.QDanny paid for this renovation and he\n                                            also got tenants to come and use that unit to collect\n                                            rental. Do you deny that? Do you deny that Danny also\n                                            got ren---tenants to come to occupy the rooms that you\n                                            all subdivided the property into?AHe’s just\n                                                fulfilling his task of managing the\n                                                property.[emphasis added]Again there was no logical reason for the\n                            2ndplaintiff to manage the Property if he\n                        had merely extended loans to the defendant.(h)     Eighth, the tenant of the Property, one Ng Sze\n                        Mee Therese, filed an affidavit dated 10 December 2010 which stated that the\n                        defendant had informed her that she needed to consult the\n                            1stplaintiff before confirming the tenancy.\n                        Her affidavit was accepted without cross-examination. This undisputed fact\n                        is again more consistent with the 1stplaintiff\n                        having a share in the Property rather than being a creditor of the\n                        defendant.(i)     Ninth, the plaintiffs were able to produce a copy of the notebook entries\n                        recorded by the defendant. The defendant claimed that she was no longer in\n                        possession of the original notebook. On one of the pages (PB 124) the\n                        figures of “64%”, “20%” and “16%”\n                        were written on it. It was also written on the same page that the amounts of\n                        money which each party had contributed towards the purchase of the Property\n                        were “Brother share $205k”, “Mui $50k” and\n                        “Tiong $65k”.The defendant initially alleged by\n                        way of her supplemental affidavit of evidence-in-chief that some of the\n                        entries were not written by her without identifying them. In response to a\n                        question from the Bench, the defendant admitted that she wrote\n                        “Brother share $205k” but denied writing “Mui\n                        $50k” and “Tiong $65k”. As regards the percentages, the\n                        defendant testified that she was not sure whether they were written by\n                            her:[note: 3]Court:I asked you specifically and I---I put\n                                            here in my own notes that you informed this Court that\n                                            you were not sure whether the---the handwritten\n                                            percentages of 64, 16 and 20 were your handwriting. That\n                                            was what you told me earlier, okay.Are you now telling me that the\n                                                two---“205K”, is that your\n                                                handwriting?Witness:The\n                                                “205”,\n                                    yes.Court:Yes.Witness:But the 50 and the 65K\n                                                is not. 50K, 65K, is\n                                    not.Court:So whose handwriting is\n                                        this?Witness:I don’t know,\n                                                your Honour. It’s true, I don’t\n                                                know....QOkay, at page 27, do---red spine. This\n                                            was prepared by Danny Teo and even there, if you look at\n                                            the mid---the lower part, it says “Brother Share,\n                                            205K”, “Sister share, 50K, 16%”,\n                                            “Danny, 65, 20%”. So it’s the same\n                                            thing that you wrote in your rental collection notebook.\n                                            It’s the same thing. You all were talking about\n                                            the same thing. Your share is only\n                                        $50,000.ANo, disagree. This is not typed by\n                                            me.QThe calculations there\n                                        correct?AI don’t deny the 1147, two---286,\n                                            358. I don’t deny.But the\n                                                percentage and the 50,000, 65,000 is not my\n                                                writing.[emphasis added]It was not suggested nor put to the\n                            1stor 2ndplaintiffs that the allegedly disputed entries were written by them instead.\n                        In the circumstances, I find that all the entries at PB 124 were written by\n                        the defendant. It is no coincidence that the percentages and payments stated\n                        on PB 124 matched the 1stplaintiff’s, the\n                            2ndplaintiff’s and the\n                        defendant’s respective shares of the Property.(j)     Tenth, in her email dated 3 May 2007\n                        to the 1stplaintiff, the defendant asked the\n                            1stplaintiff to buy “onemorePPK complex unit” using the monies left\n                        behind by their mother. In that same email, the defendant assured the\n                            1stplaintiff that she would not cheat him or\n                            “makan the hse [sic] for\n                        herself”. In my view, it is clear from this email that the\n                        defendant recognised that the Property was purchased as a co-investment and\n                        that she was inviting the 1stplaintiff to\n                        undertake another co-investment in another PPK unit similar to the\n                        Property.(k)     Finally and perhaps most crucially, the Certificate of Title to the\n                        Property was kept by the 1stplaintiff. In\n                        addition, although the 1stand\n                            2ndplaintiffs lodged a caveat against\n                        the Property claiming an interest on 18 May 2009, the defendant did not\n                        take any step to challenge the validity of the caveat until after the\n                        commencement of the present action by the plaintiffs. The safe keeping of\n                        the title deeds by the 1stplaintiff together\n                        with the absence of any protest by the defendant as regards the lodging of\n                        the caveat are entirely consistent with co-investment of the Property by the\n                        plaintiffs.13     In light of the above reasons, I find that the\n                    Sums were disbursed by the plaintiffs as their contributions to the\n                    co-investment in the Property, and not as loans to the defendant.Illegality14     The defendant’s main defence eventually\n                    rested on the doctrine of illegality to rebut the resulting trust. The bulk of\n                    the defendant’s closing submissions was directed to address this\n                    issue.15     Counsel for the defendant accepted that if the\n                    court finds that the payments by the 1stand\n                        2ndplaintiffs were capital contributions and not\n                    loans to the defendant, a resulting trust in the proportions of their respective\n                    capital contributions would follow.16     However, the defendant submitted that even if\n                    this was so, the fact that the 2ndplaintiff had\n                    already made a booking to purchase a HDB Build-to-Order flat (“BTO\n                    flat”) meant that he could not then retain any beneficial interest in the\n                    Property because this would contravene s 47(1) of the Housing and Development\n                    Act (Cap 129, 2004 Rev Ed) (“HDA”), which provides that:(1) No person shall be entitled to purchase any flat, house or other\n                        living accommodation sold subject to the provisions of this Part if such\n                        person, his spouse or any authorised occupier —(a) is the owner of any other flat, house, building or land or has an\n                        estate or interest therein; or(b) has, at any time within 30 months immediately prior to the date of\n                        making an application to the Board to purchase the same, or between the date\n                        of such application and the date of completion of the purchase of the flat,\n                        house or other living accommodation, sold any flat, house, building or land\n                        of which he was the owner, or divested himself of any interest\n                        therein.The defendant further argued that since the plaintiffs’ case is\n                    built upon the premise of a valid, legal and enforceable trust, and that such a\n                    trust would entail a breach of s 47(1) of the HDA, it is therefore wholly\n                    void.17     In the circumstances, the defendant argued\n                    that the illegality affects the 1stplaintiff in\n                    the same way that it affects the 2ndplaintiff as the\n                        1stplaintiff was equally aware of the reasons\n                    for the 2ndplaintiff’s inability to own the\n                    Property in his own name given that both plaintiffs filed a joint affidavit of\n                    evidence-in-chief (“Joint AEIC”).18     It is important to note that the defendant did\n                    not plead illegality in her Defence and O 18 r 8(1) of the Rules of Court (Cap\n                    322, R 5, 2004 Rev Ed) (“Rules of Court”) clearly requires a party\n                    to specifically plead any matter showing illegality. Moreover, at the conclusion\n                    of the trial, no leave to amend the pleadings was applied for. Be that as it\n                    may, where a transaction is manifestly illegal on its face, the court can\n                    intervene on its own motion and refuse to enforce it, even if the illegality was\n                    not specifically pleaded or alleged (seeEcon Corp Ltd v So\n                        Say Cheong Pte Ltd[2004] SGHC 234 at [11]). In this case, there is no issue of\n                    prejudice to the plaintiffs as regards this unpleaded point since it was clearly\n                    stated in their Joint AEIC that the 2ndplaintiff\n                    could not own the Property because he had already made a booking for a BTO flat\n                    at the material time. Paragraphs 27 and 28 of the Joint AEIC provide as\n                    follows:... Later the 2nd Plaintiff discovered from a conversation with his Church\n                        friend that as the 2ndPlaintiff had booked to\n                        buy a Build-to-Order Flat (HDB) the 2ndPlaintiff\n                        under HDB rules cannot purchase any private property. The\n                            2ndPlaintiff was not aware of this ruling as\n                        it was the first time he was buying a direct purchase flat from HDB....In the premises it was then mutually decided by all three (3) of us that\n                        the Option would be granted in the sole name of the Defendant who will hold\n                        the Property in trust for all three...19     Likewise this was admitted as such by the\n                        2ndplaintiff in cross-examination:[note: 4]Q... Mr Teo, do you agree with me from\n                                            these words that I’ve just read and basically it\n                                            means that if you buy a Build-to-Order flat directly\n                                            from the HDB, you must not own or dispose or have an\n                                            estate or interest in any other flat and that includes\n                                            beneficial interest in the property - #11-752\n                                            People’s Park Complex?AMm, I can’t get you. Sorry, can you\n                                            repeat that?Q... I’ve just read,\n                                        yes---AYes.Q---right, basically means that if you buy\n                                            a Build-to-Order flat directly from the HDB, you must\n                                            not own or dispose or have an estate or interest in any\n                                            other flats and that includes the property at\n                                            People’s Park Complex?AYes.20     The defendant’s written submissions made\n                    references to several well-established cases on the doctrine of illegality.\n                    Having examined those cases, I find them to be of no assistance to the\n                    defendant’s case whatsoever. It is clear from those cases that when a\n                    court considers the defence of illegality, the focus is whether the claimant is\n                    required to rely on the deception and/or illegal purpose in order to ground the\n                    claim. This principle is clearly borne out by cases such asPalaniappa Chettiar v Arunasalam Chettiar[1962] MLJ 143\n                        (“Palaniappa”),Suntoso Jacob v Kong Miao Ming[1985–1986] SLR(R)\n                    524 (“Suntoso Jacob”), andAmerican Home Assurance Co v Hong Lam Marine Pte Ltd[1999] 2 SLR(R) 992 (“Hong Lam\n                    Marine”).21     InPalaniappa, a\n                    father transferred to his son without consideration 40 acres of a rubber\n                    plantation with a view to avoiding the Rubber Regulations then in force in\n                    Malaysia and thereafter sought to recover from his son the land he had\n                    transferred. The Privy Council held that for the father to succeed in his claim,\n                    he had to prove not only that the property was transferred to his son without\n                    any consideration, but had to also rebut the presumption of advancement in\n                    favour of his son in respect of the property, and he could only succeed in\n                    discharging these burdens by disclosing that he had practised a deception on the\n                    public administration. Hence, the Privy Council decided that it would not lend\n                    its aid to him to recover the property. As Lord Denning held at p 145:In these circumstances it was essential for the father to put forward a\n                        convincing explanation why the transfer took the form it did, and the\n                        explanation that he gave disclosed that he made the transfer for a\n                        fraudulent purpose, namely, to deceive the public administration into\n                        thinking that he only held 99 acres of land and his son 40 acres, whereas in\n                        truth he himself meant to hold the whole 139 acres. Once this disclosure was\n                        made by the father, the courts were bound to take notice of it, even though\n                        the son had not pleaded it: seeScott v Brown, Doering,\n                            McNab & Co[1892] 2 QB 724.22     InSuntoso\n                    Jacob, the appellant transferred shares to the respondent to\n                    circumvent the administrative guidelines promulgated by the Registrar of Ships.\n                    The appellant subsequently decided to transfer the said shares to another party\n                    and requested the respondent to hand over the share certificate so as to effect\n                    the registration of the transfer. When the respondent refused to do so, the\n                    appellant initiated an action seeking a declaration that the respondent was not\n                    entitled to the said shares and that he only held them as trustee for the\n                    appellant. The Court of Appeal affirmed the trial judge’s decision and\n                    dismissed the appellant’s appeal. Specifically, the Court of Appeal held\n                    at [13] that:The appellant's claim is not based on any independent right of ownership\n                        of the said shares; like the father in theChettiarcase ([7]supra) he had transferred the property to the\n                        transferee on the understanding that the latter was to hold it on trust for\n                        him.To recover the property he has to rely on the trust\n                            created in his favour and in so doing the illegal purpose of the\n                            transfer that gave rise to the trust emerged. Even if the\n                        appellant is relying on the resulting trust of the said shares by virtue of\n                        the transfer thereof to the respondent without any payment, the unlawful\n                        purpose of the transfer cannot be ignored. It is too artificial to sever the\n                        purpose from the transaction,iethe transfer\n                        of the said shares to the respondent without any payment, and look at only\n                        the transaction in isolation and say that it was not tainted by the unlawful\n                        purpose. The intention of the parties and the purpose of the transaction are\n                        clearly relevant. Where a transaction which on the face of it is lawful is\n                        entered into for an unlawful purpose or to achieve an unlawful end, the\n                        transaction is tainted with illegality and is unenforceable.[emphasis added]23     On the other hand,Hong Lam\n                        Marinecan be distinguished from bothPalaniappaandSuntoso Jacob. InHong Lam Marine, a shipbuilding agreement was\n                    backdated to enable a vessel to be registered as a Singapore ship. The\n                    appellants argued that the bonds (issued by the appellants and procured in\n                    favour of the respondent by the shipyard) should have been held by the\n                    arbitrators to be unenforceable because the respondents had used the\n                    shipbuilding agreement to deceive the Registrar of Ships. Dismissing the\n                    appellant’s appeal, the Court of Appeal held at [67] that:[T]he purpose of the shipbuilding agreement was not to deceive the\n                        Registrar. In fact, the purpose of the agreement was perfectly legitimate\n                        and proper. The building of the vessel involved no illegality. Even the\n                        backdating itself was not illegal and it was the purpose of the backdating\n                        which was tainted with illegality; in other words, the backdating only\n                        became illegal when it was used for an illegal purpose - to obtain\n                        registration of the vessel in Singapore, which it was not entitled to...\n                            [T]he respondents did not need to rely on the\n                            backdating in order to succeed in their counterclaim against the\n                            shipyard. It was not necessary for them to found their claim against the\n                            shipyard as the owners of a Singapore-registered ship, as their cause of\n                            action was based on the delay in the delivery of the vessel in breach of\n                            a specific term of the shipbuilding agreement.[emphasis added]24     In short,PalaniappaandSuntoso Jacobillustrate the point that illegality would only be a bar to enforcement of a\n                    claim if the claimant had to rely on or to disclose the illegal purpose in order\n                    to enforce that claim. However,Hong Lam Marinemakes it clear that illegalityper seis not a bar\n                    for enforcement if the claim itself is not grounded on that\n                illegality.25     In the present case, the defendant’s\n                    counsel readily conceded that the plaintiffs need not rely on either the alleged\n                    deception or the illegal purpose to enforce the resulting trust against the\n                    defendant. This must be right, given that there is no deception with respect to\n                    the Property. The resulting trust arises from the plaintiffs’ capital\n                    contributions towards the purchase of the Property. It follows that the alleged\n                    illegality does not preclude the declaration of the resulting trust in favour of\n                    the plaintiffs based on their capital contributions.26     It also bears mention that the plaintiffs are\n                    seeking to enforce their claims in respect of the Property and not some HDB\n                    flat. The 2ndplaintiff’s purpose in\n                    registering the defendant as sole owner of the Property is distinct from his\n                    decision to contribute to the purchase price of the Property. Consequently, the\n                    presumed resulting trust arising from the 2ndplaintiff’s contribution to the purchase price and which grounds his cause\n                    of action remains untainted by the illegality.27     I also note that s 47(1) of the HDA does not\n                    expressly provide that it is illegal for an HDB flat owner to own a share in a\n                    private property. Therefore, s 47(1) of the HDA, on its face, does not\n                    prohibit the 2ndplaintiff from owning a share in the\n                    Property. Instead, it only prohibits the 2ndplaintiff from owning a HDB flat if he is already the owner of another\n                    property.28     However, the defendant’s counsel\n                    submitted that it is “impliedly”illegal under s 47(1) of the HDA for the 2ndplaintiff to have a share in the Property as he was already an owner of a BTO\n                    flat. In support of his contention, the defendant relied on the decision of the\n                    Court of Appeal inCheong Yoke Kuen and others v Cheong Kwok\n                        Kiong[1999] 1 SLR(R) 1126 (“Cheong\n                        Yoke Kuen”).29     InCheong Yoke\n                        Kuen, the property (unlike the present case) which was the\n                    subject matter of the litigation was an HDB flat. It was initially registered in\n                    the names of the respondent and his mother. Subsequently, the respondent decided\n                    to purchase another HDB flat. However, the respondent could not do so since he\n                    was already a registered owner of another HDB flat with his mother. The\n                    respondent then transferred his share to his mother and thereafter bought\n                    another HDB flat. Later, when the respondent’s mother passed away, the\n                    respondent commenced a suit for a declaration that the property was held in\n                    resulting trust for him and did not form part of the mother’s estate. The\n                    Court of Appeal declined to grant the declaration because the resulting trust\n                    was expressly stated to be void under s 51(4) of the HDA.30     I findCheong Yoke\n                        Kuento be of no assistance to the defendant. First, just like inSuntoso JacobandPalaniappa Chettiar, the respondent inCheong\n                        Yoke Kuenfailed in his action because he had to rely on the\n                    illegal purpose of the transfer to enforce his resulting trust claim. Here, the\n                    plaintiffs need not rely on either the alleged deception or the illegal purpose\n                    to enforce the resulting trust against the defendant. Accordingly, the alleged\n                    illegality does not preclude the declaration of the resulting\n                trust.31     Second, the defendant’s counsel sought\n                    to rely on [23] ofCheong Yoke Kuento support his argument that the\n                        2ndPlaintiff is prohibited from holding a\n                    beneficial interest in the Property:By virtue of this provision, the respondent was\n                            prohibited from purchasing the new flat at Serangoon North Avenue so\n                            long as he retained a beneficial interest in the old flat.\n                        The words \"estate or interest\" in s 47(1)(a)\n                        are broad enough to encompass the respondent's beneficial interest in the\n                        flat. It is apparent to us that in order to comply with s 47 the respondent\n                        transferred his entire interest in the flat to his mother.But having acquired the new flat he is not eligible to hold any\n                            interest in the old flat, and therefore the resulting trust arising in\n                            his favour would be against the policy consideration contended by\n                            counsel.[emphasis added]32     In particular, the first sentence of [23] appears to suggest that the respondent in\n                    that case was prohibited from purchasing the new flat so long as he retained a\n                    beneficial interest in the old flat. However, to truly understand what the Court\n                    of Appeal had meant in [23], it is\n                    important to read [23] as a whole.\n                    Notably, the last sentence of [23]\n                    states:But having acquired the new flat he is not eligible to\n                            hold any interest in the old flat, and therefore the\n                        resulting trust arising in his favour would be against the policy\n                        consideration contended by counsel[emphasis added]33     It is clear from the italicised words that\n                    once the respondent inCheong Yoke Kuenacquired\n                    the new flat, he was no longer eligible to hold any interest in theoldflat and any resulting trust in his favour with\n                    respect to theoldflat would be contrary to the\n                    policy considerations under the HDA. Similarly, once the\n                        2ndplaintiff acquired a beneficial interest\n                    in the Property, he is not eligible to hold any interest in hisBTO flat. However, that is not the issue before me in\n                    this case. The resulting trust in this case is with respect to the Property, and\n                    not the 2ndplaintiff’s BTO flat. Hence,\n                    it follows that the resulting trust arising in favour of the\n                        2ndplaintiff is neither illegal nor contrary to\n                    the policy considerations of the HDA.34     Finally, even if the\n                        2ndplaintiff’s claim is tainted by his\n                    illegality (which I have found not to be the case here), I fail to see how the\n                        1stplaintiff is precluded from enforcing his\n                    claim just because he was aware of the 2ndplaintiff’s inability to own the Property given his ownership of the BTO\n                    flat. First, no authority was cited by the defendant to support this\n                    proposition. Second, and more importantly, there is no legal impediment or\n                    prohibition whatsoever for the 1stplaintiff to have\n                    a rightful share of the Property in proportion to his capital contributions. His\n                    capital contributions were separate and distinct from the\n                        2ndplaintiff’s. Finally, the\n                    defendant’s counsel also admitted that the defendant was similarly aware\n                    of the 2ndplaintiff’s inability to own the\n                    Property given his ownership of the BTO flat, and would not be able to enforce\n                    her claim to the Property just like the\n                    1stplaintiff. Taking the defendant’s\n                    argument to its logical conclusion would therefore result in an absurd situation\n                    whereby the Property would belong to no one because all parties would have been\n                    precluded from enforcing their respective claims to the Property simply because\n                    each of them was aware that the 2ndplaintiff, as one\n                    of the co-investors, was prohibited from having a separate and distinct share in\n                    the Property.35     In the circumstances, I determine that there\n                    is no merit whatsoever in the defendant’s illegality\n                defence.Credibility of the defendant’s evidence36     I pause here to comment on the credibility of\n                    the defendant’s evidence during the trial. Under cross-examination, the\n                    defendant was often combative and evasive, resorting to her main theme –\n                    that the Sums were loans from the plaintiffs – without really answering\n                    the questions directed at her from the plaintiffs’ counsel and also from\n                    the Bench. Even on straightforward questions she would feign misunderstanding\n                    and provide irrelevant answers or revert to her main theme. Throughout the\n                    trial, there were many examples of the defendant’s lack of candour and\n                    evasiveness. I found that the defendant was not forthright in her answers. She\n                    even fabricated excuses to distance herself from her own emails, particularly\n                    her email dated 3 May 2007 in which she invited the\n                        1stplaintiff to invest in another PPK unit.\n                    Although the said email read “Let buy one more PPK\n                        complex unituse mum money don’t distribute to me and\n                    tiong”, the defendant insisted that “Let buy one more PPK complex\n                    unit” referred to a lease of a unit in Chin Swee:[note: 5]QLook at 43 of the same bundle. No, same\n                                            bundle. Page 43, is that the email you’re talking\n                                            about? Is that the one, Brendon?Court:“Let’s buy one more PPK\n                                            complex unit”....Court:So your evidence is,\n                                                “buy one more PPK complex unit”, 1\n                                                that---the other one is the lease of the Chin Swee\n                                                unit?Witness:That’s\n                                                right.Court:All right, that’s your\n                                            evidence.[emphasis added]37     Moreover, in her email to the\n                        1stplaintiff dated 6 June 2008, the defendant\n                    stated the following:Do you remember PPK 300K no bank want to take 99year\n                            lease 30yr use already but today we can sell 800k. The reason\n                        only location. Same geylang. All red light move to geylang soon demand is\n                        higher than supply.[emphasis added]Although it is clear from the italicised portion of the above email\n                    that the defendant was asking the 1stplaintiff about\n                    something in the past, specifically the “PPK 300K”, the defendant\n                    maintained that the reference to PPK 300k had nothing to do with the\n                        Property:[note: 6]QCan you look at page 71? Same bundle,\n                                            turn to page 71. Page 71, paragraph 4, your email to\n                                            Jimmy Teo. You use the name Yuki at that\n                                        time.Court:Page 71 of which?Pereira:Plaintiff’s bundle of documents,\n                                            same as the RHB document.QIt says there, paragraph 4 of y 1 our\n                                            email. Is this your email to Jimmy Teo, Mdm\n                                        Teo?AI think I’m saying the shop,\n                                            ah.QNo. Do you remember People's Park Complex\n                                            300K? Where do you have a shop in PPK for 300K?\n                                            You---you said: [Reads] “Do u remember PPK 300K\n                                            no bank want to take 99year lease 30yr use already but\n                                            today we can sell 800K.” That was in 6th of June\n                                            1008.AI think it’s a shop, this is a\n                                            shop. I’m saying---QWhat shop do you\n                                    have---A---about shop.Q---do you have in People’s\n                                            Park?APeople’s Park---People’s Park\n                                            have a shop downstair. People’s Park got the house\n                                            and shop.QDid you buy a\n                                                property? You said, “Do you remember”,\n                                                that means you are talking about the\n                                            past.AIf we buy, today we can sell, right. If\n                                            we buy at that time, today we can\n                                    sell.QSo you deny that you’re talking\n                                            about your unit 11-752?AI don’t think\n                                    so.QYou don’t think\n                                    so?AI don’t think\n                                    so.QOkay.Court:So you say paragraph 4\n                                                of this email has nothing to do with the property in\n                                                question, 11th floor of People’s Park Complex.\n                                                Is that your evidence? It’s up to you,\n                                                Ms---Ms Teo, you already said it’s\n                                                nothing to do, I’m just asking to confirm that\n                                                is your evidence.Witness:I think I’m talking about the\n                                            shop.Court:So it is your evidence\n                                                that the reference to PPK 300,000, has nothing to do\n                                                with the property which is a subject matter of this\n                                                litigation,\n                                    correct?Witness:Yah.[emphasis added]Use of joint affidavits38     O 41 r 2 of the Rules of Court permits an\n                    affidavit to be made by two or more deponents:(1) Where an affidavit is made by 2 or more deponents, the names of the\n                        persons making the affidavit must be inserted in the attestation except\n                        that, if the affidavit is sworn by both or all the deponents at one time\n                        before the same person, it shall be sufficient to state that it was sworn by\n                        both (or all) of the abovenamed deponents.(2) When the oath is administered to deponents in different languages,\n                        there shall be a separate attestation for those sworn in each\n                        language.A joint affidavit may be useful and appropriate in certain limited\n                    matters, for example, a joint expert report made by two experts who possess\n                    similar expertise to arrive at a joint opinion, or a joint correction made by\n                    two deponents where the facts deposed to are very limited and\n                    uncontroversial.39     In the present case, the plaintiffs had\n                    affirmed a Joint AEIC for the trial. However, I find that it isgenerallynot good practice for two or more parties to\n                    affirm a jointfactualaffidavit for the following\n                    reasons:(a)     During a trial, witnesses are\n                        examined in turn and are never jointly examined.(b)     It is unlikely that a witness will\n                        possess the same degree of knowledge of the material facts as another\n                        witness, especially when it concerns multiple events spanning over a few\n                        years. This is especially so when there are events which only one of the\n                        witness can testify to.40     Here, it was also clear that there were\n                    certain events in which both plaintiffs were not present at the same time. For\n                    example, only the 2ndplaintiff and the defendant\n                    visited the solicitor’s office at Completion to discuss about the payment\n                    of completion monies and completion matters. Post Completion, the\n                        1stplaintiff also left much of the\n                    management of the Property to the 2ndplaintiff and\n                    the defendant. The 2ndplaintiff paid all monthly\n                    maintenance and other outgoings, undertook all renovation works jointly with the\n                    defendant and also frequently sourced for tenants and chased some of the tenants\n                    for payment of rent during the 1stand\n                        2ndtenancy periods. Accordingly, the level,\n                    extent and nature of the 2ndplaintiff’s\n                    knowledge of the relevant events were quite different from that of the\n                        1stplaintiff.41     Accordingly, the filing of the Joint AEIC was\n                    wholly inappropriate. It was an undesirable drafting shortcut which should not\n                    have been adopted in this case. In fact, the defendant relied on the Joint AEIC\n                    to establish that the 1stplaintiff was aware of the\n                        2ndplaintiff’s inability to own the\n                    Property. Therefore if joint affidavits are improperly used, it could actually\n                    create unnecessary difficulties for the deponents when they seek to distance\n                    themselves from certain statements in such joint affidavits on the basis that\n                    they do not have personal knowledge of some of the matters stated\n                    therein.Conclusion42     In light of the above findings, I make the\n                    following orders:(a)     I declare that the Property is held\n                        on trust by the defendant for the plaintiffs according to the trust\n                        shareholding of 64.1% in favour of the\n                        1stplaintiff, 20.3% in favour of the\n                            2ndplaintiff and 15.6% in favour of the\n                        defendant.(b)     An\n                        injunction to restrain the defendant whether by herself, her servants or\n                        agents from transferring the Property or in any way dealing with the tenancy\n                        of the Property.(c)     The Property be sold and the net proceeds distributed according to\n                        the trust shareholding of 64.1% in favour of the\n                            1stplaintiff, 20.3% in favour of the\n                            2ndplaintiff and 15.6% in favour of the\n                        defendant within six months from the date hereof.(d)     The defendant to account to the\n                        plaintiffs for all rental collected in respect of the Property from August\n                        2007 till to-date and to pay such rental to the\n                            1stand 2ndplaintiffs in accordance with the trust shareholding of 64.1% in favour of\n                        the 1stplaintiff, 20.3% in favour of the\n                            2ndplaintiff and 15.6% in favour of the\n                        defendant.(e)     The\n                        costs of this action be paid by the defendant to the plaintiffs on a\n                        standard basis to be taxed if not agreed.[note: 1]Notes of Evidence (“NE”), Day 3 at p 7 at\n                                    lines 13 to 26.[note: 2]NE, Day 3\n                                    at p 50 at lines 1 to\n                    8.[note: 3]NE, Day 3, p 44 at lines 14 to 26, p 45 at lines\n                                    25 to 32, p 46 at line\n                    1.[note: 4]NE, Day 2, p 38 at lines 7 to\n                    25.[note: 5]NE, Day 3, p 24 at line 32 and p 25 at lines 1 to\n                            3.[note: 6]NE, Day 2, p 108 at lines 29 to 32, p\n                                109 at lines 1 to 32.",
        "The purpose for which the Sums were disbursed": "9       Before I begin my evaluation of the evidence as\n                    to whether the Sums were disbursed as the plaintiffs’ contributions to the\n                    co-investment in the Property or as loans to the defendant, it is important to\n                    highlight that there is no halfway house between the two competing case\n                    theories. If I find that the Sums were not loans, then it must follow that they\n                    were instead the plaintiffs’ contributions as co-investment in the\n                    Property. 10     The defendant sought to rely on the following\n                    to either prove the loans or to disprove the alleged co-investment with the\n                    plaintiffs: (a)     The plaintiffs did not inform the\n                        solicitor who was engaged to handle the purchase of the Property of any\n                        trust arrangements in relation to the Property. (b)     The unchallenged evidence of the\n                        defendant’s daughter that the defendant had told the plaintiffs at a\n                        meeting in the plaintiffs’ solicitor’s office on\n                        14 November 2008 that the draft MOU to reflect the proper percentages\n                        of the parties and other terms of the co-investment was not previously\n                        provided to the defendant as alleged by the plaintiffs. (c)     The POA dated 27 November 2005\n                        supports the defendant’s case that she had executed the POA in favour\n                        of the plaintiffs merely to allow either of them to collect the monthly\n                        rents from the tenant(s) directly, deduct the respective sums of $1,147.00\n                        and $358.00 in accordance with the monthly instalment plan (being repayments\n                        of the respective loans to the plaintiffs) and for reimbursement of\n                        outgoings, before paying the balance amounts over to the\n                    defendant. 11     While it is true that none of the above proved\n                    that the Property was a co-investment by the parties, it is equally true that\n                    they do not inexorably establish that the monies were advanced as loans for the\n                    purchase of the Property. Therefore, even if the defendant’s arguments are\n                    taken at its highest, it is clear that they are, at best, neutral with respect\n                    to either of the case theories put forward by the plaintiffs and the\n                    defendant. Sums entirely consistent with\n                        co-investment 12     Having reviewed the evidence before me, I find\n                    that the Sums were disbursed by the plaintiffs as their contributions to the\n                    co-investment in the Property and not as loans to the defendant. There is a\n                    multitude of reasons to support this finding, to which I elaborate below: (a)     First, I accept the evidence of the\n                        plaintiffs that the agent for the Property, Ms Koo Suit Har\n                        (“Ms Koo”), was appointed by the\n                            1stplaintiff. This was corroborated by\n                        the evidence of Ms Koo who testified that all instructions in respect\n                        of the purchase of the Property came from the 1st plaintiff. Although\n                        the defendant alleged in her affidavit of evidence-in-chief that she had\n                        specifically instructed Ms Koo to approach the owners of the Property\n                        to find out whether they were willing to sell the Property, Ms Koo\n                        testified under cross-examination that there was no such instruction from\n                        the defendant. In fact, Ms Koo further testified that the\n                        defendant’s name was inserted in the option to purchase the Property\n                        on instructions from the 2nd plaintiff and interestingly, she verified those\n                        instructions not from the defendant, but from the 1st plaintiff instead. If\n                        the monies were extended as loans to the defendant, there would be no\n                        conceivable reason for the 1st plaintiff to appoint an agent to source for a\n                        unit at PPK. Such an act, in addition to the fact that the 1st plaintiff had\n                        issued all instructions in respect of the purchase of the Property down to\n                        naming the defendant as the purchaser, was more consistent with the\n                        plaintiffs having an investment interest in the Property. (b)     Second, the defendant’s claim\n                        that she was “a bit tight with money at that point of time”\n                        and hence had requested the plaintiffs to advance her $3,200.00 and\n                        $28,800.00 for the 1% option fee and the 9% balance deposit respectively is\n                        not supported by the objective evidence. The defendant admitted during\n                        cross-examination that at the material time, she owned four properties,\n                        including two condominiums in Singapore, a “5-star”\n                        condominium in Malaysia and a Housing Development Board\n                        (“HDB”) flat at Tanglin Halt Road (“the Other\n                        Properties”). Moreover, she also had about $150,000.00 in her various\n                        fixed deposit accounts which were “liquid”,ie, they could be withdrawn anytime. Therefore, by her own\n                        evidence, there was strictly no necessity for the defendant to borrow any\n                        money from the plaintiffs to purchase the Property in the first place. If\n                        the Property was intended as a purchase for the benefit of the defendant\n                        alone, she could have easily utilised her own financial resources to\n                        purchase the Property as she did for her purchase of the Other\n                        Properties. (c)     Third, it is undisputed that the 2ndplaintiff\n                        and the defendant sought to secure loans from banks to finance the purchase\n                        of the Property as co-borrowers. Two banks,ieRHB Bank Berhad and Hong Leong Finance Limited, were approached by the\n                            2ndplaintiff and/or the defendant to finance\n                        the purchase of the Property. Although the loan application was subsequently\n                        aborted, such conduct in seeking a loan as co-borrowers was more consistent\n                        with the purchase of the Property as a co-investment rather than a loan. If\n                        the loan application had gone ahead, it would be ludicrous for the defendant\n                        to contend that the 2ndplaintiff became a\n                        co-borrower from the bank in order to lend the money to the defendant to\n                        finance the purchase. After the loan application was aborted, the monies for\n                        the purchase substantially came from the plaintiffs. There is no reason to\n                        view the purchase of the Property as anything other than a co-investment\n                        because the plaintiffs had made direct financial contributions instead of\n                        securing finance from the bank. Further, the defendant was able\n                        to obtain financing for her purchase of the Other Properties. No reason was\n                        provided by the defendant as to why she could not have raised her own\n                        financing for the purchase of the Property without any involvement of the\n                        plaintiffs if the Property was indeed not intended to be a\n                        co-investment. (d)     Fourth, the defendant alleged at the trial that she had made three requests\n                        for loans from the plaintiffs. These requests added up to the Sums disbursed\n                        by the plaintiffs. However, not only were details on these loan requests not\n                        pleaded by the defendant, she was also unable to provide details of the\n                        terms of the alleged loans under cross-examination, except for a bare\n                        allegation that the loans were repayable on demand:[note: 1] QOkay. Let’s stay on your loan on\n                                            demand. So you are saying that you had---the other day\n                                            you said you had three agreements with the plaintiffs\n                                            – one for the 1%, one for the 9% and the balance\n                                            of the monies for the purchase of the property, right,\n                                            the balance 80%; you come out with 10%,\n                                        correct?AYes.QYou---you asked them---you said you asked\n                                            them three times, right?AYes.QYou can’t\n                                                remember the dates you asked\n                                        them?ACannot.QYou can’t even\n                                                remember the terms, what conditions and all that\n                                                that you---AOf course, I\n                                                know.QWhat are the\n                                                conditions?AThe---it’s\n                                                the---er, I used my rental to pay the instalment and\n                                                then anytime they can---they want to call back the\n                                                money, they can.[emphasis added]   (e)     Fifth, the defendant’s\n                        pleaded case is that the alleged repayment to the 2nd plaintiff was $358.00\n                        per month. It is not disputed that the\n                        2ndplaintiff contributed a total of\n                        $127,236.04 to the purchase of the Property. It is difficult to believe that\n                        the 2nd plaintiff, who does not own any private property and is nowhere as\n                        financially secure as compared to the defendant, would advance such a huge\n                        loan to the defendant, without interest, which would take about thirty years\n                        to repay based on a monthly repayment of $358.00. I find that the monthly\n                        payments of $1,147.00 and $358.00 were instead the 1st and 2nd\n                        plaintiffs’ respective shares of the rental income. The initial rental\n                        income for the Property was $2,200.00 per month. The net rental after\n                        deductions amounted to $1,792.00. The monthly payments of $1,147.00 and\n                        $358.00 to the 1st and 2nd plaintiffs respectively represented 64% and 20%\n                        of the net rental income which matched the 1st and 2nd plaintiffs’\n                        shares in the Property. This was no coincidence. (f)     Sixth, the defendant’s claims\n                        that the Sums were loans which were repayable on demand and that she has not\n                        repaid the outstanding amount to the plaintiffs in spite of the commencement\n                        of the present proceedings because they have not demanded repayment are\n                        likewise inconsistent with the evidence. The defendant claimed during the\n                        trial that she had repaid the 1stplaintiff a sum\n                        of $15,000.00 on 27 January 2006 without any request by the\n                            1stplaintiff. The defendant did so even\n                        though the 2ndplaintiff was only paid $358.00\n                        per month. The defendant’s repayment is more consistent with the\n                        plaintiffs’ claim that the\n                        1stplaintiff had advanced $15,000.00 on the\n                        defendant’s behalf at Completion (as part of the defendant’s\n                        $50,000.00 contribution towards the purchase of the Property) and that the\n                        defendant was simply repaying the $15,000.00 advance which was paid on her\n                        behalf by the 1stplaintiff at\n                    Completion. (g)     Seventh, the plaintiffs attended the Completion of the Property at the\n                        solicitor’s office and were the parties who ensured that the Sums were\n                        duly paid to the relevant parties with respect to the purchase of the\n                        Property. The 2ndplaintiff was also heavily\n                        involved with respect to the Property, having paid all monthly maintenance\n                        and other outgoings, and also undertook all renovation works jointly with\n                        the defendant. The 2ndplaintiff also\n                        frequently sourced for tenants and pursued some of the tenants for payment\n                        of rent during the 1stand\n                            2ndtenancy periods. Such acts are entirely\n                        consistent with co-ownership of the Property rather than a loan. The\n                        defendant also admitted that the 2ndplaintiff\n                        sourced and collected the rent because he wasmanagingthe Property:[note: 2] QOkay. So Danny paid for this renovation\n                                            with you for this property because he was a co-investor\n                                            with you?ANo.QDanny paid for this renovation and he\n                                            also got tenants to come and use that unit to collect\n                                            rental. Do you deny that? Do you deny that Danny also\n                                            got ren---tenants to come to occupy the rooms that you\n                                            all subdivided the property into?AHe’s just\n                                                fulfilling his task of managing the\n                                                property.[emphasis added]   Again there was no logical reason for the\n                            2ndplaintiff to manage the Property if he\n                        had merely extended loans to the defendant. (h)     Eighth, the tenant of the Property, one Ng Sze\n                        Mee Therese, filed an affidavit dated 10 December 2010 which stated that the\n                        defendant had informed her that she needed to consult the\n                            1stplaintiff before confirming the tenancy.\n                        Her affidavit was accepted without cross-examination. This undisputed fact\n                        is again more consistent with the 1stplaintiff\n                        having a share in the Property rather than being a creditor of the\n                        defendant. (i)     Ninth, the plaintiffs were able to produce a copy of the notebook entries\n                        recorded by the defendant. The defendant claimed that she was no longer in\n                        possession of the original notebook. On one of the pages (PB 124) the\n                        figures of “64%”, “20%” and “16%”\n                        were written on it. It was also written on the same page that the amounts of\n                        money which each party had contributed towards the purchase of the Property\n                        were “Brother share $205k”, “Mui $50k” and\n                        “Tiong $65k”. The defendant initially alleged by\n                        way of her supplemental affidavit of evidence-in-chief that some of the\n                        entries were not written by her without identifying them. In response to a\n                        question from the Bench, the defendant admitted that she wrote\n                        “Brother share $205k” but denied writing “Mui\n                        $50k” and “Tiong $65k”. As regards the percentages, the\n                        defendant testified that she was not sure whether they were written by\n                            her:[note: 3] Court:I asked you specifically and I---I put\n                                            here in my own notes that you informed this Court that\n                                            you were not sure whether the---the handwritten\n                                            percentages of 64, 16 and 20 were your handwriting. That\n                                            was what you told me earlier, okay.Are you now telling me that the\n                                                two---“205K”, is that your\n                                                handwriting?Witness:The\n                                                “205”,\n                                    yes.Court:Yes.Witness:But the 50 and the 65K\n                                                is not. 50K, 65K, is\n                                    not.Court:So whose handwriting is\n                                        this?Witness:I don’t know,\n                                                your Honour. It’s true, I don’t\n                                                know....QOkay, at page 27, do---red spine. This\n                                            was prepared by Danny Teo and even there, if you look at\n                                            the mid---the lower part, it says “Brother Share,\n                                            205K”, “Sister share, 50K, 16%”,\n                                            “Danny, 65, 20%”. So it’s the same\n                                            thing that you wrote in your rental collection notebook.\n                                            It’s the same thing. You all were talking about\n                                            the same thing. Your share is only\n                                        $50,000.ANo, disagree. This is not typed by\n                                            me.QThe calculations there\n                                        correct?AI don’t deny the 1147, two---286,\n                                            358. I don’t deny.But the\n                                                percentage and the 50,000, 65,000 is not my\n                                                writing.[emphasis added]   It was not suggested nor put to the\n                            1stor 2ndplaintiffs that the allegedly disputed entries were written by them instead.\n                        In the circumstances, I find that all the entries at PB 124 were written by\n                        the defendant. It is no coincidence that the percentages and payments stated\n                        on PB 124 matched the 1stplaintiff’s, the\n                            2ndplaintiff’s and the\n                        defendant’s respective shares of the Property. (j)     Tenth, in her email dated 3 May 2007\n                        to the 1stplaintiff, the defendant asked the\n                            1stplaintiff to buy “onemorePPK complex unit” using the monies left\n                        behind by their mother. In that same email, the defendant assured the\n                            1stplaintiff that she would not cheat him or\n                            “makan the hse [sic] for\n                        herself”. In my view, it is clear from this email that the\n                        defendant recognised that the Property was purchased as a co-investment and\n                        that she was inviting the 1stplaintiff to\n                        undertake another co-investment in another PPK unit similar to the\n                        Property. (k)     Finally and perhaps most crucially, the Certificate of Title to the\n                        Property was kept by the 1stplaintiff. In\n                        addition, although the 1stand\n                            2ndplaintiffs lodged a caveat against\n                        the Property claiming an interest on 18 May 2009, the defendant did not\n                        take any step to challenge the validity of the caveat until after the\n                        commencement of the present action by the plaintiffs. The safe keeping of\n                        the title deeds by the 1stplaintiff together\n                        with the absence of any protest by the defendant as regards the lodging of\n                        the caveat are entirely consistent with co-investment of the Property by the\n                        plaintiffs. 13     In light of the above reasons, I find that the\n                    Sums were disbursed by the plaintiffs as their contributions to the\n                    co-investment in the Property, and not as loans to the defendant.",
        "Illegality": "14     The defendant’s main defence eventually\n                    rested on the doctrine of illegality to rebut the resulting trust. The bulk of\n                    the defendant’s closing submissions was directed to address this\n                    issue. 15     Counsel for the defendant accepted that if the\n                    court finds that the payments by the 1stand\n                        2ndplaintiffs were capital contributions and not\n                    loans to the defendant, a resulting trust in the proportions of their respective\n                    capital contributions would follow. 16     However, the defendant submitted that even if\n                    this was so, the fact that the 2ndplaintiff had\n                    already made a booking to purchase a HDB Build-to-Order flat (“BTO\n                    flat”) meant that he could not then retain any beneficial interest in the\n                    Property because this would contravene s 47(1) of the Housing and Development\n                    Act (Cap 129, 2004 Rev Ed) (“HDA”), which provides that: (1) No person shall be entitled to purchase any flat, house or other\n                        living accommodation sold subject to the provisions of this Part if such\n                        person, his spouse or any authorised occupier — (a) is the owner of any other flat, house, building or land or has an\n                        estate or interest therein; or (b) has, at any time within 30 months immediately prior to the date of\n                        making an application to the Board to purchase the same, or between the date\n                        of such application and the date of completion of the purchase of the flat,\n                        house or other living accommodation, sold any flat, house, building or land\n                        of which he was the owner, or divested himself of any interest\n                        therein. The defendant further argued that since the plaintiffs’ case is\n                    built upon the premise of a valid, legal and enforceable trust, and that such a\n                    trust would entail a breach of s 47(1) of the HDA, it is therefore wholly\n                    void. 17     In the circumstances, the defendant argued\n                    that the illegality affects the 1stplaintiff in\n                    the same way that it affects the 2ndplaintiff as the\n                        1stplaintiff was equally aware of the reasons\n                    for the 2ndplaintiff’s inability to own the\n                    Property in his own name given that both plaintiffs filed a joint affidavit of\n                    evidence-in-chief (“Joint AEIC”). 18     It is important to note that the defendant did\n                    not plead illegality in her Defence and O 18 r 8(1) of the Rules of Court (Cap\n                    322, R 5, 2004 Rev Ed) (“Rules of Court”) clearly requires a party\n                    to specifically plead any matter showing illegality. Moreover, at the conclusion\n                    of the trial, no leave to amend the pleadings was applied for. Be that as it\n                    may, where a transaction is manifestly illegal on its face, the court can\n                    intervene on its own motion and refuse to enforce it, even if the illegality was\n                    not specifically pleaded or alleged (seeEcon Corp Ltd v So\n                        Say Cheong Pte Ltd[2004] SGHC 234 at [11]). In this case, there is no issue of\n                    prejudice to the plaintiffs as regards this unpleaded point since it was clearly\n                    stated in their Joint AEIC that the 2ndplaintiff\n                    could not own the Property because he had already made a booking for a BTO flat\n                    at the material time. Paragraphs 27 and 28 of the Joint AEIC provide as\n                    follows: ... Later the 2nd Plaintiff discovered from a conversation with his Church\n                        friend that as the 2ndPlaintiff had booked to\n                        buy a Build-to-Order Flat (HDB) the 2ndPlaintiff\n                        under HDB rules cannot purchase any private property. The\n                            2ndPlaintiff was not aware of this ruling as\n                        it was the first time he was buying a direct purchase flat from HDB. ... In the premises it was then mutually decided by all three (3) of us that\n                        the Option would be granted in the sole name of the Defendant who will hold\n                        the Property in trust for all three... 19     Likewise this was admitted as such by the\n                        2ndplaintiff in cross-examination:[note: 4] Q... Mr Teo, do you agree with me from\n                                            these words that I’ve just read and basically it\n                                            means that if you buy a Build-to-Order flat directly\n                                            from the HDB, you must not own or dispose or have an\n                                            estate or interest in any other flat and that includes\n                                            beneficial interest in the property - #11-752\n                                            People’s Park Complex?AMm, I can’t get you. Sorry, can you\n                                            repeat that?Q... I’ve just read,\n                                        yes---AYes.Q---right, basically means that if you buy\n                                            a Build-to-Order flat directly from the HDB, you must\n                                            not own or dispose or have an estate or interest in any\n                                            other flats and that includes the property at\n                                            People’s Park Complex?AYes.   20     The defendant’s written submissions made\n                    references to several well-established cases on the doctrine of illegality.\n                    Having examined those cases, I find them to be of no assistance to the\n                    defendant’s case whatsoever. It is clear from those cases that when a\n                    court considers the defence of illegality, the focus is whether the claimant is\n                    required to rely on the deception and/or illegal purpose in order to ground the\n                    claim. This principle is clearly borne out by cases such asPalaniappa Chettiar v Arunasalam Chettiar[1962] MLJ 143\n                        (“Palaniappa”),Suntoso Jacob v Kong Miao Ming[1985–1986] SLR(R)\n                    524 (“Suntoso Jacob”), andAmerican Home Assurance Co v Hong Lam Marine Pte Ltd[1999] 2 SLR(R) 992 (“Hong Lam\n                    Marine”). 21     InPalaniappa, a\n                    father transferred to his son without consideration 40 acres of a rubber\n                    plantation with a view to avoiding the Rubber Regulations then in force in\n                    Malaysia and thereafter sought to recover from his son the land he had\n                    transferred. The Privy Council held that for the father to succeed in his claim,\n                    he had to prove not only that the property was transferred to his son without\n                    any consideration, but had to also rebut the presumption of advancement in\n                    favour of his son in respect of the property, and he could only succeed in\n                    discharging these burdens by disclosing that he had practised a deception on the\n                    public administration. Hence, the Privy Council decided that it would not lend\n                    its aid to him to recover the property. As Lord Denning held at p 145: In these circumstances it was essential for the father to put forward a\n                        convincing explanation why the transfer took the form it did, and the\n                        explanation that he gave disclosed that he made the transfer for a\n                        fraudulent purpose, namely, to deceive the public administration into\n                        thinking that he only held 99 acres of land and his son 40 acres, whereas in\n                        truth he himself meant to hold the whole 139 acres. Once this disclosure was\n                        made by the father, the courts were bound to take notice of it, even though\n                        the son had not pleaded it: seeScott v Brown, Doering,\n                            McNab & Co[1892] 2 QB 724. 22     InSuntoso\n                    Jacob, the appellant transferred shares to the respondent to\n                    circumvent the administrative guidelines promulgated by the Registrar of Ships.\n                    The appellant subsequently decided to transfer the said shares to another party\n                    and requested the respondent to hand over the share certificate so as to effect\n                    the registration of the transfer. When the respondent refused to do so, the\n                    appellant initiated an action seeking a declaration that the respondent was not\n                    entitled to the said shares and that he only held them as trustee for the\n                    appellant. The Court of Appeal affirmed the trial judge’s decision and\n                    dismissed the appellant’s appeal. Specifically, the Court of Appeal held\n                    at [13] that: The appellant's claim is not based on any independent right of ownership\n                        of the said shares; like the father in theChettiarcase ([7]supra) he had transferred the property to the\n                        transferee on the understanding that the latter was to hold it on trust for\n                        him.To recover the property he has to rely on the trust\n                            created in his favour and in so doing the illegal purpose of the\n                            transfer that gave rise to the trust emerged. Even if the\n                        appellant is relying on the resulting trust of the said shares by virtue of\n                        the transfer thereof to the respondent without any payment, the unlawful\n                        purpose of the transfer cannot be ignored. It is too artificial to sever the\n                        purpose from the transaction,iethe transfer\n                        of the said shares to the respondent without any payment, and look at only\n                        the transaction in isolation and say that it was not tainted by the unlawful\n                        purpose. The intention of the parties and the purpose of the transaction are\n                        clearly relevant. Where a transaction which on the face of it is lawful is\n                        entered into for an unlawful purpose or to achieve an unlawful end, the\n                        transaction is tainted with illegality and is unenforceable. [emphasis added] 23     On the other hand,Hong Lam\n                        Marinecan be distinguished from bothPalaniappaandSuntoso Jacob. InHong Lam Marine, a shipbuilding agreement was\n                    backdated to enable a vessel to be registered as a Singapore ship. The\n                    appellants argued that the bonds (issued by the appellants and procured in\n                    favour of the respondent by the shipyard) should have been held by the\n                    arbitrators to be unenforceable because the respondents had used the\n                    shipbuilding agreement to deceive the Registrar of Ships. Dismissing the\n                    appellant’s appeal, the Court of Appeal held at [67] that: [T]he purpose of the shipbuilding agreement was not to deceive the\n                        Registrar. In fact, the purpose of the agreement was perfectly legitimate\n                        and proper. The building of the vessel involved no illegality. Even the\n                        backdating itself was not illegal and it was the purpose of the backdating\n                        which was tainted with illegality; in other words, the backdating only\n                        became illegal when it was used for an illegal purpose - to obtain\n                        registration of the vessel in Singapore, which it was not entitled to...\n                            [T]he respondents did not need to rely on the\n                            backdating in order to succeed in their counterclaim against the\n                            shipyard. It was not necessary for them to found their claim against the\n                            shipyard as the owners of a Singapore-registered ship, as their cause of\n                            action was based on the delay in the delivery of the vessel in breach of\n                            a specific term of the shipbuilding agreement. [emphasis added] 24     In short,PalaniappaandSuntoso Jacobillustrate the point that illegality would only be a bar to enforcement of a\n                    claim if the claimant had to rely on or to disclose the illegal purpose in order\n                    to enforce that claim. However,Hong Lam Marinemakes it clear that illegalityper seis not a bar\n                    for enforcement if the claim itself is not grounded on that\n                illegality. 25     In the present case, the defendant’s\n                    counsel readily conceded that the plaintiffs need not rely on either the alleged\n                    deception or the illegal purpose to enforce the resulting trust against the\n                    defendant. This must be right, given that there is no deception with respect to\n                    the Property. The resulting trust arises from the plaintiffs’ capital\n                    contributions towards the purchase of the Property. It follows that the alleged\n                    illegality does not preclude the declaration of the resulting trust in favour of\n                    the plaintiffs based on their capital contributions. 26     It also bears mention that the plaintiffs are\n                    seeking to enforce their claims in respect of the Property and not some HDB\n                    flat. The 2ndplaintiff’s purpose in\n                    registering the defendant as sole owner of the Property is distinct from his\n                    decision to contribute to the purchase price of the Property. Consequently, the\n                    presumed resulting trust arising from the 2ndplaintiff’s contribution to the purchase price and which grounds his cause\n                    of action remains untainted by the illegality. 27     I also note that s 47(1) of the HDA does not\n                    expressly provide that it is illegal for an HDB flat owner to own a share in a\n                    private property. Therefore, s 47(1) of the HDA, on its face, does not\n                    prohibit the 2ndplaintiff from owning a share in the\n                    Property. Instead, it only prohibits the 2ndplaintiff from owning a HDB flat if he is already the owner of another\n                    property. 28     However, the defendant’s counsel\n                    submitted that it is “impliedly”illegal under s 47(1) of the HDA for the 2ndplaintiff to have a share in the Property as he was already an owner of a BTO\n                    flat. In support of his contention, the defendant relied on the decision of the\n                    Court of Appeal inCheong Yoke Kuen and others v Cheong Kwok\n                        Kiong[1999] 1 SLR(R) 1126 (“Cheong\n                        Yoke Kuen”). 29     InCheong Yoke\n                        Kuen, the property (unlike the present case) which was the\n                    subject matter of the litigation was an HDB flat. It was initially registered in\n                    the names of the respondent and his mother. Subsequently, the respondent decided\n                    to purchase another HDB flat. However, the respondent could not do so since he\n                    was already a registered owner of another HDB flat with his mother. The\n                    respondent then transferred his share to his mother and thereafter bought\n                    another HDB flat. Later, when the respondent’s mother passed away, the\n                    respondent commenced a suit for a declaration that the property was held in\n                    resulting trust for him and did not form part of the mother’s estate. The\n                    Court of Appeal declined to grant the declaration because the resulting trust\n                    was expressly stated to be void under s 51(4) of the HDA. 30     I findCheong Yoke\n                        Kuento be of no assistance to the defendant. First, just like inSuntoso JacobandPalaniappa Chettiar, the respondent inCheong\n                        Yoke Kuenfailed in his action because he had to rely on the\n                    illegal purpose of the transfer to enforce his resulting trust claim. Here, the\n                    plaintiffs need not rely on either the alleged deception or the illegal purpose\n                    to enforce the resulting trust against the defendant. Accordingly, the alleged\n                    illegality does not preclude the declaration of the resulting\n                trust. 31     Second, the defendant’s counsel sought\n                    to rely on [23] ofCheong Yoke Kuento support his argument that the\n                        2ndPlaintiff is prohibited from holding a\n                    beneficial interest in the Property: By virtue of this provision, the respondent was\n                            prohibited from purchasing the new flat at Serangoon North Avenue so\n                            long as he retained a beneficial interest in the old flat.\n                        The words \"estate or interest\" in s 47(1)(a)\n                        are broad enough to encompass the respondent's beneficial interest in the\n                        flat. It is apparent to us that in order to comply with s 47 the respondent\n                        transferred his entire interest in the flat to his mother.But having acquired the new flat he is not eligible to hold any\n                            interest in the old flat, and therefore the resulting trust arising in\n                            his favour would be against the policy consideration contended by\n                            counsel. [emphasis added] 32     In particular, the first sentence of [23] appears to suggest that the respondent in\n                    that case was prohibited from purchasing the new flat so long as he retained a\n                    beneficial interest in the old flat. However, to truly understand what the Court\n                    of Appeal had meant in [23], it is\n                    important to read [23] as a whole.\n                    Notably, the last sentence of [23]\n                    states: But having acquired the new flat he is not eligible to\n                            hold any interest in the old flat, and therefore the\n                        resulting trust arising in his favour would be against the policy\n                        consideration contended by counsel [emphasis added] 33     It is clear from the italicised words that\n                    once the respondent inCheong Yoke Kuenacquired\n                    the new flat, he was no longer eligible to hold any interest in theoldflat and any resulting trust in his favour with\n                    respect to theoldflat would be contrary to the\n                    policy considerations under the HDA. Similarly, once the\n                        2ndplaintiff acquired a beneficial interest\n                    in the Property, he is not eligible to hold any interest in hisBTO flat. However, that is not the issue before me in\n                    this case. The resulting trust in this case is with respect to the Property, and\n                    not the 2ndplaintiff’s BTO flat. Hence,\n                    it follows that the resulting trust arising in favour of the\n                        2ndplaintiff is neither illegal nor contrary to\n                    the policy considerations of the HDA. 34     Finally, even if the\n                        2ndplaintiff’s claim is tainted by his\n                    illegality (which I have found not to be the case here), I fail to see how the\n                        1stplaintiff is precluded from enforcing his\n                    claim just because he was aware of the 2ndplaintiff’s inability to own the Property given his ownership of the BTO\n                    flat. First, no authority was cited by the defendant to support this\n                    proposition. Second, and more importantly, there is no legal impediment or\n                    prohibition whatsoever for the 1stplaintiff to have\n                    a rightful share of the Property in proportion to his capital contributions. His\n                    capital contributions were separate and distinct from the\n                        2ndplaintiff’s. Finally, the\n                    defendant’s counsel also admitted that the defendant was similarly aware\n                    of the 2ndplaintiff’s inability to own the\n                    Property given his ownership of the BTO flat, and would not be able to enforce\n                    her claim to the Property just like the\n                    1stplaintiff. Taking the defendant’s\n                    argument to its logical conclusion would therefore result in an absurd situation\n                    whereby the Property would belong to no one because all parties would have been\n                    precluded from enforcing their respective claims to the Property simply because\n                    each of them was aware that the 2ndplaintiff, as one\n                    of the co-investors, was prohibited from having a separate and distinct share in\n                    the Property. 35     In the circumstances, I determine that there\n                    is no merit whatsoever in the defendant’s illegality\n                defence.",
        "Credibility of the defendant’s evidence": "36     I pause here to comment on the credibility of\n                    the defendant’s evidence during the trial. Under cross-examination, the\n                    defendant was often combative and evasive, resorting to her main theme –\n                    that the Sums were loans from the plaintiffs – without really answering\n                    the questions directed at her from the plaintiffs’ counsel and also from\n                    the Bench. Even on straightforward questions she would feign misunderstanding\n                    and provide irrelevant answers or revert to her main theme. Throughout the\n                    trial, there were many examples of the defendant’s lack of candour and\n                    evasiveness. I found that the defendant was not forthright in her answers. She\n                    even fabricated excuses to distance herself from her own emails, particularly\n                    her email dated 3 May 2007 in which she invited the\n                        1stplaintiff to invest in another PPK unit.\n                    Although the said email read “Let buy one more PPK\n                        complex unituse mum money don’t distribute to me and\n                    tiong”, the defendant insisted that “Let buy one more PPK complex\n                    unit” referred to a lease of a unit in Chin Swee:[note: 5] QLook at 43 of the same bundle. No, same\n                                            bundle. Page 43, is that the email you’re talking\n                                            about? Is that the one, Brendon?Court:“Let’s buy one more PPK\n                                            complex unit”....Court:So your evidence is,\n                                                “buy one more PPK complex unit”, 1\n                                                that---the other one is the lease of the Chin Swee\n                                                unit?Witness:That’s\n                                                right.Court:All right, that’s your\n                                            evidence.[emphasis added]   37     Moreover, in her email to the\n                        1stplaintiff dated 6 June 2008, the defendant\n                    stated the following: Do you remember PPK 300K no bank want to take 99year\n                            lease 30yr use already but today we can sell 800k. The reason\n                        only location. Same geylang. All red light move to geylang soon demand is\n                        higher than supply. [emphasis added] Although it is clear from the italicised portion of the above email\n                    that the defendant was asking the 1stplaintiff about\n                    something in the past, specifically the “PPK 300K”, the defendant\n                    maintained that the reference to PPK 300k had nothing to do with the\n                        Property:[note: 6] QCan you look at page 71? Same bundle,\n                                            turn to page 71. Page 71, paragraph 4, your email to\n                                            Jimmy Teo. You use the name Yuki at that\n                                        time.Court:Page 71 of which?Pereira:Plaintiff’s bundle of documents,\n                                            same as the RHB document.QIt says there, paragraph 4 of y 1 our\n                                            email. Is this your email to Jimmy Teo, Mdm\n                                        Teo?AI think I’m saying the shop,\n                                            ah.QNo. Do you remember People's Park Complex\n                                            300K? Where do you have a shop in PPK for 300K?\n                                            You---you said: [Reads] “Do u remember PPK 300K\n                                            no bank want to take 99year lease 30yr use already but\n                                            today we can sell 800K.” That was in 6th of June\n                                            1008.AI think it’s a shop, this is a\n                                            shop. I’m saying---QWhat shop do you\n                                    have---A---about shop.Q---do you have in People’s\n                                            Park?APeople’s Park---People’s Park\n                                            have a shop downstair. People’s Park got the house\n                                            and shop.QDid you buy a\n                                                property? You said, “Do you remember”,\n                                                that means you are talking about the\n                                            past.AIf we buy, today we can sell, right. If\n                                            we buy at that time, today we can\n                                    sell.QSo you deny that you’re talking\n                                            about your unit 11-752?AI don’t think\n                                    so.QYou don’t think\n                                    so?AI don’t think\n                                    so.QOkay.Court:So you say paragraph 4\n                                                of this email has nothing to do with the property in\n                                                question, 11th floor of People’s Park Complex.\n                                                Is that your evidence? It’s up to you,\n                                                Ms---Ms Teo, you already said it’s\n                                                nothing to do, I’m just asking to confirm that\n                                                is your evidence.Witness:I think I’m talking about the\n                                            shop.Court:So it is your evidence\n                                                that the reference to PPK 300,000, has nothing to do\n                                                with the property which is a subject matter of this\n                                                litigation,\n                                    correct?Witness:Yah.[emphasis added]",
        "Use of joint affidavits": "38     O 41 r 2 of the Rules of Court permits an\n                    affidavit to be made by two or more deponents: (1) Where an affidavit is made by 2 or more deponents, the names of the\n                        persons making the affidavit must be inserted in the attestation except\n                        that, if the affidavit is sworn by both or all the deponents at one time\n                        before the same person, it shall be sufficient to state that it was sworn by\n                        both (or all) of the abovenamed deponents. (2) When the oath is administered to deponents in different languages,\n                        there shall be a separate attestation for those sworn in each\n                        language. A joint affidavit may be useful and appropriate in certain limited\n                    matters, for example, a joint expert report made by two experts who possess\n                    similar expertise to arrive at a joint opinion, or a joint correction made by\n                    two deponents where the facts deposed to are very limited and\n                    uncontroversial. 39     In the present case, the plaintiffs had\n                    affirmed a Joint AEIC for the trial. However, I find that it isgenerallynot good practice for two or more parties to\n                    affirm a jointfactualaffidavit for the following\n                    reasons: (a)     During a trial, witnesses are\n                        examined in turn and are never jointly examined. (b)     It is unlikely that a witness will\n                        possess the same degree of knowledge of the material facts as another\n                        witness, especially when it concerns multiple events spanning over a few\n                        years. This is especially so when there are events which only one of the\n                        witness can testify to. 40     Here, it was also clear that there were\n                    certain events in which both plaintiffs were not present at the same time. For\n                    example, only the 2ndplaintiff and the defendant\n                    visited the solicitor’s office at Completion to discuss about the payment\n                    of completion monies and completion matters. Post Completion, the\n                        1stplaintiff also left much of the\n                    management of the Property to the 2ndplaintiff and\n                    the defendant. The 2ndplaintiff paid all monthly\n                    maintenance and other outgoings, undertook all renovation works jointly with the\n                    defendant and also frequently sourced for tenants and chased some of the tenants\n                    for payment of rent during the 1stand\n                        2ndtenancy periods. Accordingly, the level,\n                    extent and nature of the 2ndplaintiff’s\n                    knowledge of the relevant events were quite different from that of the\n                        1stplaintiff. 41     Accordingly, the filing of the Joint AEIC was\n                    wholly inappropriate. It was an undesirable drafting shortcut which should not\n                    have been adopted in this case. In fact, the defendant relied on the Joint AEIC\n                    to establish that the 1stplaintiff was aware of the\n                        2ndplaintiff’s inability to own the\n                    Property. Therefore if joint affidavits are improperly used, it could actually\n                    create unnecessary difficulties for the deponents when they seek to distance\n                    themselves from certain statements in such joint affidavits on the basis that\n                    they do not have personal knowledge of some of the matters stated\n                    therein.",
        "Conclusion": "42     In light of the above findings, I make the\n                    following orders: (a)     I declare that the Property is held\n                        on trust by the defendant for the plaintiffs according to the trust\n                        shareholding of 64.1% in favour of the\n                        1stplaintiff, 20.3% in favour of the\n                            2ndplaintiff and 15.6% in favour of the\n                        defendant. (b)     An\n                        injunction to restrain the defendant whether by herself, her servants or\n                        agents from transferring the Property or in any way dealing with the tenancy\n                        of the Property. (c)     The Property be sold and the net proceeds distributed according to\n                        the trust shareholding of 64.1% in favour of the\n                            1stplaintiff, 20.3% in favour of the\n                            2ndplaintiff and 15.6% in favour of the\n                        defendant within six months from the date hereof. (d)     The defendant to account to the\n                        plaintiffs for all rental collected in respect of the Property from August\n                        2007 till to-date and to pay such rental to the\n                            1stand 2ndplaintiffs in accordance with the trust shareholding of 64.1% in favour of\n                        the 1stplaintiff, 20.3% in favour of the\n                            2ndplaintiff and 15.6% in favour of the\n                        defendant. (e)     The\n                        costs of this action be paid by the defendant to the plaintiffs on a\n                        standard basis to be taxed if not agreed.  [note: 1]Notes of Evidence (“NE”), Day 3 at p 7 at\n                                    lines 13 to 26. [note: 2]NE, Day 3\n                                    at p 50 at lines 1 to\n                    8. [note: 3]NE, Day 3, p 44 at lines 14 to 26, p 45 at lines\n                                    25 to 32, p 46 at line\n                    1. [note: 4]NE, Day 2, p 38 at lines 7 to\n                    25. [note: 5]NE, Day 3, p 24 at line 32 and p 25 at lines 1 to\n                            3. [note: 6]NE, Day 2, p 108 at lines 29 to 32, p\n                                109 at lines 1 to 32."
    }
}