{
    "case_title": "Shafeeg bin Salim Talib and another\n      v\n      Helmi bin Ali bin Salim bin Talib and others",
    "ncitation": "[2011] SGHC 165",
    "coram": "Philip Pillai J",
    "sections": {
        "Introduction": "1       This is an appeal by the defendants against the\n                    decision of the Assistant Registrar (“AR”) to dismiss their\n                    application to strike out the plaintiffs’ statement of claim under\n                    O 18 r 19 of the Rules of Court (Cap 322, R 5, 2006 Rev\n                    Ed) (“ROC”) and/or under the inherent powers of the Court. The\n                    defendants have also appealed against the AR’s dismissal of their\n                    application for a stay of proceedings on the ground offorum\n                        non conveniens. 2       This action concerns assets forming part of the\n                    estate of Obeidillah bin Salim bin Talib (“the Deceased”), a\n                    Muslim, who died intestate on 5 May 2005. At the time of his death, the\n                    Deceased had various assets in Singapore and Malaysia. He also had one asset in\n                    Egypt, namely, a 16.972% share in an Egyptian “civil property\n                    company”, Al Taleb Al Akaria (“Al Taleb”). It was\n                    not established whether this was a company or a partnership under Egyptian law.\n                    Al Taleb was established in Cairo by the Deceased together with some\n                    members of his family. Its only asset is a building in Cairo, and its only\n                    income is the rental income from the same building. 3       The plaintiffs are the Singapore administrators\n                    of the Deceased’s estate under a grant of letters of administration by the\n                    Singapore court (the Singapore Grant”).The defendants, being sons of one\n                    of the brothers of the Deceased, are all among the beneficiaries under Islamic\n                    law of the Deceased’s estate named in the Inheritance Certificate issued\n                    by the Singapore Syariah Court on 12 May 2005. The defendants are also the\n                    former directors/managers of Al Taleb. They were appointed in 1986 and were\n                    removed as directors/managers on 31 October 2007 pursuant to an order of\n                    the South Cairo Court of First Instance (“the Cairo Court Order”).\n                    The first plaintiff is a derivative beneficiary of the Deceased’s estate,\n                    and the second plaintiff is not a beneficiary but an attorney for a\n                    beneficiary. 4       The Cairo Court Order was based on a finding\n                    that an amendment to Al Taleb’s governing contract which permitted\n                    four directors/managers to be appointed instead of two was invalid. As a result\n                    of the Cairo Court Order, Al Taleb has been placed under a temporary\n                    receivership and the Cairo court has appointed a receiver (“the\n                    Receiver”). At present, the Receiver continues to perform his duties as\n                    receiver of Al Taleb. 5       The plaintiffs’ case in their statement of\n                    claim is that they, as Singapore administrators of the Deceased’s estate,\n                    are entitled under Singapore law and Egyptian law to represent the estate to\n                    recover from the defendants, who are former directors/managers of Al Taleb,\n                    now replaced by the Receivers. 6       The reliefs sought by the plaintiffs are as\n                    follows: (a)an order that the defendants account for all\n                            monies due from Al Taleb to the Deceased and to pay over all such monies\n                            including the sum of Egyptian Pounds 133,891.190 (being the monies due\n                            to the Deceased as at 31 December 2005) to the plaintiffs\n                            forthwith;(b)that the defendants do pay interest on the monies\n                            paid to the Deceased’s estate at such rate as the Court thinks\n                            fit;(c)that the defendants do within seven days of the\n                            judgment made herein, produce to the plaintiffs:(i)the audited accounts of Al Taleb for\n                                    the years ending 31 December 2006 and 31 December\n                                    2007;(ii)documentary evidence of (i) income,\n                                    receipts and payments made by and to Al Taleb; and (ii) all\n                                    payments by Al Taleb to the Deceased for his 16.972% share in\n                                    Al Taleb, during the Deceased’s lifetime from the\n                                    date of the appointment of the defendants as managers/directors\n                                    of Al Taleb in end-1986 to May 2005;(d)that the defendants do pay the costs of this\n                            action and the costs of and incidental to the plaintiffs’\n                            applications in Originating Summons No 1406 of 2008/P;\n                        and(e)that the plaintiffs shall be entitled to withhold\n                            making payments to the defendants of their respective shares in the\n                            Deceased’s estate until the defendants have complied with the\n                            terms of the order to be made herein.7       The defendants then applied to strike out and\n                    stay the action in the following applications:(a)The first summons, Summons No 2386 of\n                            2010/Y, is the defendants’ application to strike out the\n                            plaintiffs’ claim under O 18 r 19(1) of the ROC and/or\n                            by the inherent powers of the court.(b)The second summons, Summons No 2400 of\n                            2010/Y, is the defendants’ alternative application to stay Suit\n                            No 261 of 2010/G (converted from Originating Summons\n                            No 1406/2008/P) on the ground offorum non\n                                conveniens.8       Both summonses were heard by the AR who\n                    dismissed the striking out application on 4 March 2011, which was based on\n                    the defendants’ argument that the plaintiffs were coming to court to seek\n                    remedies which they knew that under Egyptian law only the receiver is entitled\n                    to and that for them to do so would compel the defendants to commit a breach of\n                    Egyptian law. Further the AR declined to strike out the statement of claim as\n                    she thought it would amount to conducting a preliminary trial based on\n                    affidavits without allowing the plaintiffs’ position to be explained at\n                    trial. The AR also dismissed the stay application. Although she considered the\n                    “current political state in Egypt and the enforceability of any decision\n                    in Cairo as a neutral factor”, she concluded that due to the\n                    “change in circumstances in Cairo (political and otherwise), justice\n                    requires the action to be nonetheless heard in Singapore”.The Striking Out Application9       It is settled that the failure to establish\n                    title to commence legal action provides sufficient grounds for striking out (seeAlliance Entertainment Singapore Pte Ltd v Sim Kay Teck\n                        and Another[2007] 2 SLR(R) 869).Lex fori governs locus standii10     Whether the plaintiffs, as administrators of\n                    the Deceased’s Al Taleb shares, are entitled to commence legal action in\n                    Singapore is a matter that is to be determined under Singapore law, which is thelex fori, as is explained byDicey, Morris and Collins on the Conflict of Laws(Sweet & Maxwell, 14th Ed, 2006) (“Dicey, Morris and Collins”) at\n                    paras 7-011–7-012:(2) Parties. In determining who are the proper parties to proceedings, the\n                        first question is whether the claimant or defendant is the sort of person or\n                        body that can be made a party to litigation. This is a question for thelex fori....Assuming that a claimant is capable of suing in the above sense, the next\n                        question is whether he is the proper claimant in the particular action\n                        before the court. Clearly, he is not if by thelex\n                            causaethe right which he is seeking to enforce did not vest\n                        in him but in someone else. ...The Singapore Grant does not extend to non-Singapore assets11     The question then is whether, as a matter of\n                    Singapore law, the plaintiffs as administrators under the Singapore Grant have\n                    the right, title and interest in the Deceased’s Al Taleb shares to\n                    commence such legal action with respect of these shares. As a general rule,\n                    title to foreign assets does not vest in a Singapore personal representative by\n                    necessary implication from the Singapore grant of letters of representation.\n                    According toDicey, Morris and Collinsat\n                    para 26-022:All property of the deceased, whether it consists of movables or\n                        immovables (apart from the special case of settled land) which at the time\n                        of his death is locally situate in England, vests in the English personal\n                        representative. It is not necessary that he should have reduced the property\n                        into possession. On the other hand,assets outside\n                            England do not vest in an English personal representative by virtue of\n                            his grant. Whether or not he is entitled to recover them is a matter for\n                            the law of the country in which they are situate...[emphasis added]12     I next proceed to examine the express text of\n                    the Singapore Grant. The Singapore Grant obtained by the plaintiffs reads as\n                    follows:BE IT KNOWN that at the date hereunder-written Letters of Administration\n                        ofall and singular the movable and immovable property\n                            estate and effects of OBEIDILLAH BIN SALIM BIN TALIBlate\n                        … were committed and granted to SHAFEEG BIN SALIM TALIB … and\n                        ABDUL JALIL BIN AHMAD BIN TALIB … as Administrators to apply for\n                        Grant of Letters of Administration of the Estate pursuant to the Order of\n                        Court dated 6th October 2006 …, they having been first sworn well and\n                        faithfullyto administer the same by paying the just\n                            debts of the deceased and distributing the residue of his property\n                            according to law and to render a just and true account of their\n                            administration whenever lawfully required.[emphasis added]13     The schedule annexed to the Singapore Grant\n                    (“the Schedule”) sets out the property to which the Singapore\n                    Grant refers. In the Schedule, the Deceased’s Al Taleb shares are\n                    listed in the section which reads “Property in respect of which the Grant\n                    is not to be made”. The relevant section of the Schedule is set out\n                    below:Property\n                                                in respect of which the Grant is not to be\n                                                madeACCOUNT\n                                                ‘B’5Malayan Banking Bhd Premier Savings\n                                            Account No. …RM 1,856.73 x\n                                    S$0.4378812.886Share in Al Taleb Al\n                                                Akaria Societe\n                                    Civile(i) Deceased’s 14.333%\n                                        shareEGP\n                                    176,749.25(ii) 2/16 share in Helmia’s\n                                            estate26,616.47(iii) 2/11 share in Awad’s\n                                            estate45,080.84(iv) 2/9 share in Abdullah’s\n                                            estate2,766.62_______________EGP\n                                    251,213.18X\n                                    S$0.281701$\n                                    70,767.00[Emphasis added in\n                                    bold]14     The Schedule is an integral part of the\n                    Singapore Grant. That it goes beyond the purposes of determining and securing\n                    the payment of estate duty is clear from its terms. It further sets out the\n                    value of the assets and estate duty payable in respect to these assets which are\n                    specifically described. Section 41 of the Estate Duty Act (Cap 96,\n                    2005 Rev Ed) is clear in that it requires the certificate to set out all\n                    property of the deceased, whether estate duty is leviable on such property or\n                    not. It further provides that property discovered after the grant of letters of\n                    representation may be included by way of a supplemental schedule. It is clear\n                    from this that the function of the schedule is not confined to property on which\n                    estate duty is payable. That being the case, the inscription of “Property\n                    in respect of which the Grant is not made” has a purpose beyond the\n                    collection of estate duty. By its terms, it establishes that title to such\n                    property, as is described, does not pass by virtue of the Singapore\n                    Grant.15     It is noteworthy that although estate duty has\n                    been abolished in Singapore, applications for grant of probate or letters of\n                    administration still require a schedule of assets to be prepared (see\n                        para 129(2)(c) of theSupreme Court Practice Directions). This is consistent with the\n                    position that the grant confers title on the executor or administrator with\n                    respect to the assets to the extent set out in the grant. Thus where the\n                    schedule describes assets with the qualification that “Property in\n                    respect of which the Grant is not made”, title to such assets cannot be\n                    said to arise from such a grant.16     It is thus clear that as a matter of thelex forithe plaintiffs, as administrators of\n                    the Deceased’s estate, do not have any right, title or interest in respect\n                    of the Deceased’s Al Taleb shares either by implication or by the\n                    express text of the Singapore Grant.17     In the light of the above I would strike out\n                    the plaintiffs’ statement of claim as they do not havelocus standiunder Singapore law, without prejudice to anyone\n                    having title to the Deceased’s Al Taleb shares to commence fresh\n                    proceedings in the Singapore courts.The Application to Stay the Proceedings on the ground of Forum Non\n                Conveniens18     I proceed to consider the defendants’\n                    alternative application that the proceedings be stayed on the basis offorum non conveniens.The Law on forum non conveniens19     The law onforum non\n                        conveniensas set out inSpiliada Maritime\n                        Corporation v Cansulex Ltd[1987] AC 460 (“Spiliada”) has been concisely restated in the\n                    following manner by the Court of Appeal in CIMB Bank Bhd v\n                        Dresdner Kleinwort Ltd[2008] 4 SLR(R) 543 at\n                    [26]:The gist of these principles is that, under the doctrine offorum non conveniens,a stay will\n                            only be granted where the court is satisfied that there is some other\n                            available and more appropriate forum for the trial of the\n                            action. The burden of establishing this rests on the\n                        defendant and it is not enough just to show that Singapore is not the\n                        natural or appropriate forum. The defendant must also establish that there\n                        is another available forum which is clearly or distinctly more appropriate\n                        than Singapore.The natural forum is one with which the\n                            action has the most real and substantial connection. In this\n                        regard, the factors which the court will take into consideration include not\n                        only factors affecting convenience or expense (such as the availability of\n                        witnesses) but also other factors such as the law governing the transaction\n                        and the places where the parties respectively reside or carry on business.\n                        If the court concludes, at this stage of the inquiry (\"stage one of theSpiliadatest\"), that there is no other\n                        available forum which is clearly more appropriate for the trial of the\n                        action, it will ordinarily refuse a stay.If, at this\n                            stage, it concludes that there is some other available forum which prima\n                            facie is clearly more appropriate for the trial of the action, it will\n                            ordinarily grant a stay, unless there are circumstances by reason of\n                            which justice requires that a stay should nevertheless be\n                            refused. In this connection, the court will consider all the\n                        circumstances of the case. For this second stage inquiry (\"stage two of theSpiliadatest\"), the legal burden is on\n                        the plaintiff to establish the existence of those special\n                        circumstances.[emphasis added]Stage One: The Connecting Factors Point to Egypt as the More\n                Appropriate Forum20     The courts of Egypt are clearly the more\n                    appropriate forum for hearing the dispute for,inter\n                        alia, the following reasons:(a)     First, this action concerns shares\n                        in an Egyptian entity whose legal status and the incidents therefrom are\n                        determined by Egyptian law. The plaintiffs concede that thelex causaeis Egyptian law, and it is well\n                        established that the applicable law to the dispute is a relevant and\n                        significant connecting factor (seeRickshaw Investments\n                            Ltd v Nicolai Baron von Uexkull[2007]\n                        1 SLR(R) 377). It is also clear that “the governing law\n                        factor becomes a more weighty one if it would involve courts having to apply\n                        unfamiliar systems of law” (seeHalsbury’s\n                            Laws of Singapore – Conflict of Laws vol 6(2)\n                        (LexisNexis, 2009) (“Halsbury’s Laws of\n                            Singapore”) at para 75.093). Egypt is a civil law\n                        jurisdiction and its laws and procedures are significantly different from\n                        those in Singapore. The applicable law is “obviously a more weighty\n                        factor in a dispute which turns on questions of interpretation of the law\n                        than one which merely involves the application of the law” (seeHalsbury’s Laws of Singaporeat\n                        para 75.093).(b)     Secondly, the Egyptian court has appointed a Receiver over\n                        Al Taleb. The incidents of the power of the Receiver with respect to\n                        the assets, books and records of Al Taleb and claims related thereto\n                        are matters of Egyptian law. The fourth defendant, who is averred to be in\n                        possession of the relevant documents, resides in Egypt. The building from\n                        which Al Taleb derives its main income in the form of rent and its\n                        books, records and receipts and compliance with applicable law is determined\n                        by Egyptian law.(c)     Thirdly, there are three pending cases before the Egyptian courts\n                        involving the plaintiffs, the defendants and the Receiver relating to the\n                        affairs of Al Taleb. The shareholders of Al Taleb, present\n                        plaintiffs and defendants included, have a history of seeking relief from\n                        the Egyptian courts, from the time of the entity’s registration. The\n                        continuation of this action in Singapore accordingly carries the risk of\n                        outcomes in contradiction of Egyptian law and the rights and duties of the\n                        Egyptian court appointed Receiver.21     The Egyptian courts are, in the light of the\n                    above, the more appropriate forum for the resolution of this dispute between the\n                    parties. This is not overridden by reason only that three of the defendants\n                    reside in Singapore.Stage Two: There is No Personal or Juridical Disadvantage to the\n                Plaintiffs in Granting a Stay22     The first stage of theSpiliadatest being clearly satisfied, I move on to consider the\n                    second stage of theSpiliadatest, which was\n                    succinctly restated by the Court of Appeal inPT Hutan Domas\n                        Raya v Yue Xiu Enterprises (Holdings) Ltd and another [2001]\n                    1 SLR(R) 104 at [16]:… If the court concludes that there is such a more appropriate\n                        forum, it will ordinarily grant a stay unless, in the words of Lord Goff,\n                        \"there are circumstances by reason of which justice requires that a stay\n                        should nevertheless not be granted. In this inquiry the court will consider\n                        all the circumstances of the case, including circumstances which go beyond\n                        those taken into account when considering connecting factors with other\n                        jurisdictions” … One such factor which would warrant a refusal\n                        of stay would be if it can be established byobjective\n                            cogent evidencethat the plaintiff will not obtain justice in\n                        the foreign jurisdiction. …[emphasis added]The Court of Appeal also noted that the plaintiff bears the burden of\n                    establishing that he will be denied substantial justice if the case is not heard\n                    in the forum.23     The plaintiffs argue that commencing the\n                    action in Egypt would cause a delay which would allow the defendants to delay\n                    the release of monies and documents. InOriental Insurance Co\n                        Ltd v Bhavani Stores Pte Ltd[1997] 3 SLR(R) 363, the\n                    Court of Appeal ruled that a bare assertion of likely delay would not suffice,\n                    and even if the argument was accepted, a delay would not ordinarily merit a stay\n                    of proceedings if all that could be shown was inconvenience and not substantial\n                    injustice (at [44]–[45]):The respondents also said they might have to put up security for costs,\n                        and that a speedier resolution could be had in Singapore. However, no\n                        evidence was raised to suggest the likely delay (if any). In the absence of\n                        such evidence, we were unable to give credence to the respondents'\n                        assertion. Furthermore, even if we were to accept that there would be\n                        substantial delay if proceedings were stayed, this consideration, though\n                        valid, was not so weighty as to merit a stay of proceedings.Ultimately, any delay which might be occasioned by a stay, in our view,\n                        would not represent a substantial injustice to the respondents. The overall\n                        effect would be to cause them inconvenience. However, this was not a case,\n                        to borrow a phrase from the judgment of Lord Brandon of Oakbrook\n                            inThe Abidin Daver[1984] 1 All\n                        ER 470, in which there was an overwhelming balance of convenience in favour\n                        of the respondents.It should be noted that the plaintiffs remain at liberty to file their\n                    requests with the Receiver for accounts and payments relating to the\n                    Deceased’s Al Taleb shares.24     The plaintiffs next claim that Singapore is\n                    the only forum that can issue effective orders to compel the defendants to\n                    deliver the documents and assets. This submission ignores the reality that the\n                    defendants being concurrently beneficiaries of the Deceased’s estate\n                    including the Al Taleb shares, would have sufficient personal interest to comply\n                    with lawful orders of the Receiver. In any event this would be one factor to\n                    consider but no means is it conclusive.25     In dismissing the defendants’\n                    application on 4 March 2011 to stay the proceedings on the basis offorum non conveniens, the AR took into account\n                    the “current political state” of Egypt and opined that justice\n                    requires the action be heard in Singapore.26     Here, the relevant issue is whether the\n                    political situation in Egypt is such that the plaintiffs would be denied\n                    substantial justice if they were to commence proceedings there or refer their\n                    claims to the Cairo court-appointed Receiver.27     The political uncertainty in the spring of\n                    2011 in Egypt does not appear to have resulted in the cessation of functioning\n                    of the Egyptian judicial institutions. The defendants’ counsel advised the\n                    court and the plaintiffs’ counsel did not deny that the Cairo court\n                    decided on 9 March 2011 to uphold the decision of the lower court to annul\n                    the defendants’ appointment as directors/managers of Al Taleb. In any\n                    case, for purposes of taking judicial notice, where is any doubt as to the\n                    proper functioning of Egyptian judicial institutions, that doubt should be\n                    resolved against the plaintiffs who so assert (seeZheng Yu\n                        Shan v Lian Beng Construction (1988) Pte Ltd[2009]\n                    2 SLR(R) 587 at [33]).28     In the light of the above relevant to theSpiliadastage two test, I do not find that it\n                    has been established that the plaintiffs would be denied substantial justice to\n                    pursue their action before the Egyptian courts.29     I would, quite apart from granting the\n                    striking out application, in any event, have granted a stay on the ground offorum non conveniens.Conclusion30     For all these reasons, the appeal is allowed.\n                    The defendants will have costs here and below.",
        "The Striking Out Application": "9       It is settled that the failure to establish\n                    title to commence legal action provides sufficient grounds for striking out (seeAlliance Entertainment Singapore Pte Ltd v Sim Kay Teck\n                        and Another[2007] 2 SLR(R) 869).",
        "Lex fori governs locus standii": "10     Whether the plaintiffs, as administrators of\n                    the Deceased’s Al Taleb shares, are entitled to commence legal action in\n                    Singapore is a matter that is to be determined under Singapore law, which is thelex fori, as is explained byDicey, Morris and Collins on the Conflict of Laws(Sweet & Maxwell, 14th Ed, 2006) (“Dicey, Morris and Collins”) at\n                    paras 7-011–7-012: (2) Parties. In determining who are the proper parties to proceedings, the\n                        first question is whether the claimant or defendant is the sort of person or\n                        body that can be made a party to litigation. This is a question for thelex fori. ... Assuming that a claimant is capable of suing in the above sense, the next\n                        question is whether he is the proper claimant in the particular action\n                        before the court. Clearly, he is not if by thelex\n                            causaethe right which he is seeking to enforce did not vest\n                        in him but in someone else. ...",
        "The Singapore Grant does not extend to non-Singapore assets": "11     The question then is whether, as a matter of\n                    Singapore law, the plaintiffs as administrators under the Singapore Grant have\n                    the right, title and interest in the Deceased’s Al Taleb shares to\n                    commence such legal action with respect of these shares. As a general rule,\n                    title to foreign assets does not vest in a Singapore personal representative by\n                    necessary implication from the Singapore grant of letters of representation.\n                    According toDicey, Morris and Collinsat\n                    para 26-022: All property of the deceased, whether it consists of movables or\n                        immovables (apart from the special case of settled land) which at the time\n                        of his death is locally situate in England, vests in the English personal\n                        representative. It is not necessary that he should have reduced the property\n                        into possession. On the other hand,assets outside\n                            England do not vest in an English personal representative by virtue of\n                            his grant. Whether or not he is entitled to recover them is a matter for\n                            the law of the country in which they are situate... [emphasis added] 12     I next proceed to examine the express text of\n                    the Singapore Grant. The Singapore Grant obtained by the plaintiffs reads as\n                    follows: BE IT KNOWN that at the date hereunder-written Letters of Administration\n                        ofall and singular the movable and immovable property\n                            estate and effects of OBEIDILLAH BIN SALIM BIN TALIBlate\n                        … were committed and granted to SHAFEEG BIN SALIM TALIB … and\n                        ABDUL JALIL BIN AHMAD BIN TALIB … as Administrators to apply for\n                        Grant of Letters of Administration of the Estate pursuant to the Order of\n                        Court dated 6th October 2006 …, they having been first sworn well and\n                        faithfullyto administer the same by paying the just\n                            debts of the deceased and distributing the residue of his property\n                            according to law and to render a just and true account of their\n                            administration whenever lawfully required. [emphasis added] 13     The schedule annexed to the Singapore Grant\n                    (“the Schedule”) sets out the property to which the Singapore\n                    Grant refers. In the Schedule, the Deceased’s Al Taleb shares are\n                    listed in the section which reads “Property in respect of which the Grant\n                    is not to be made”. The relevant section of the Schedule is set out\n                    below: Property\n                                                in respect of which the Grant is not to be\n                                                madeACCOUNT\n                                                ‘B’5Malayan Banking Bhd Premier Savings\n                                            Account No. …RM 1,856.73 x\n                                    S$0.4378812.886Share in Al Taleb Al\n                                                Akaria Societe\n                                    Civile(i) Deceased’s 14.333%\n                                        shareEGP\n                                    176,749.25(ii) 2/16 share in Helmia’s\n                                            estate26,616.47(iii) 2/11 share in Awad’s\n                                            estate45,080.84(iv) 2/9 share in Abdullah’s\n                                            estate2,766.62_______________EGP\n                                    251,213.18X\n                                    S$0.281701$\n                                    70,767.00[Emphasis added in\n                                    bold]   14     The Schedule is an integral part of the\n                    Singapore Grant. That it goes beyond the purposes of determining and securing\n                    the payment of estate duty is clear from its terms. It further sets out the\n                    value of the assets and estate duty payable in respect to these assets which are\n                    specifically described. Section 41 of the Estate Duty Act (Cap 96,\n                    2005 Rev Ed) is clear in that it requires the certificate to set out all\n                    property of the deceased, whether estate duty is leviable on such property or\n                    not. It further provides that property discovered after the grant of letters of\n                    representation may be included by way of a supplemental schedule. It is clear\n                    from this that the function of the schedule is not confined to property on which\n                    estate duty is payable. That being the case, the inscription of “Property\n                    in respect of which the Grant is not made” has a purpose beyond the\n                    collection of estate duty. By its terms, it establishes that title to such\n                    property, as is described, does not pass by virtue of the Singapore\n                    Grant. 15     It is noteworthy that although estate duty has\n                    been abolished in Singapore, applications for grant of probate or letters of\n                    administration still require a schedule of assets to be prepared (see\n                        para 129(2)(c) of theSupreme Court Practice Directions). This is consistent with the\n                    position that the grant confers title on the executor or administrator with\n                    respect to the assets to the extent set out in the grant. Thus where the\n                    schedule describes assets with the qualification that “Property in\n                    respect of which the Grant is not made”, title to such assets cannot be\n                    said to arise from such a grant. 16     It is thus clear that as a matter of thelex forithe plaintiffs, as administrators of\n                    the Deceased’s estate, do not have any right, title or interest in respect\n                    of the Deceased’s Al Taleb shares either by implication or by the\n                    express text of the Singapore Grant. 17     In the light of the above I would strike out\n                    the plaintiffs’ statement of claim as they do not havelocus standiunder Singapore law, without prejudice to anyone\n                    having title to the Deceased’s Al Taleb shares to commence fresh\n                    proceedings in the Singapore courts.",
        "The Application to Stay the Proceedings on the ground of Forum Non\n                Conveniens": "18     I proceed to consider the defendants’\n                    alternative application that the proceedings be stayed on the basis offorum non conveniens.",
        "The Law on forum non conveniens": "19     The law onforum non\n                        conveniensas set out inSpiliada Maritime\n                        Corporation v Cansulex Ltd[1987] AC 460 (“Spiliada”) has been concisely restated in the\n                    following manner by the Court of Appeal in CIMB Bank Bhd v\n                        Dresdner Kleinwort Ltd[2008] 4 SLR(R) 543 at\n                    [26]: The gist of these principles is that, under the doctrine offorum non conveniens,a stay will\n                            only be granted where the court is satisfied that there is some other\n                            available and more appropriate forum for the trial of the\n                            action. The burden of establishing this rests on the\n                        defendant and it is not enough just to show that Singapore is not the\n                        natural or appropriate forum. The defendant must also establish that there\n                        is another available forum which is clearly or distinctly more appropriate\n                        than Singapore.The natural forum is one with which the\n                            action has the most real and substantial connection. In this\n                        regard, the factors which the court will take into consideration include not\n                        only factors affecting convenience or expense (such as the availability of\n                        witnesses) but also other factors such as the law governing the transaction\n                        and the places where the parties respectively reside or carry on business.\n                        If the court concludes, at this stage of the inquiry (\"stage one of theSpiliadatest\"), that there is no other\n                        available forum which is clearly more appropriate for the trial of the\n                        action, it will ordinarily refuse a stay.If, at this\n                            stage, it concludes that there is some other available forum which prima\n                            facie is clearly more appropriate for the trial of the action, it will\n                            ordinarily grant a stay, unless there are circumstances by reason of\n                            which justice requires that a stay should nevertheless be\n                            refused. In this connection, the court will consider all the\n                        circumstances of the case. For this second stage inquiry (\"stage two of theSpiliadatest\"), the legal burden is on\n                        the plaintiff to establish the existence of those special\n                        circumstances. [emphasis added]",
        "Stage One: The Connecting Factors Point to Egypt as the More\n                Appropriate Forum": "20     The courts of Egypt are clearly the more\n                    appropriate forum for hearing the dispute for,inter\n                        alia, the following reasons: (a)     First, this action concerns shares\n                        in an Egyptian entity whose legal status and the incidents therefrom are\n                        determined by Egyptian law. The plaintiffs concede that thelex causaeis Egyptian law, and it is well\n                        established that the applicable law to the dispute is a relevant and\n                        significant connecting factor (seeRickshaw Investments\n                            Ltd v Nicolai Baron von Uexkull[2007]\n                        1 SLR(R) 377). It is also clear that “the governing law\n                        factor becomes a more weighty one if it would involve courts having to apply\n                        unfamiliar systems of law” (seeHalsbury’s\n                            Laws of Singapore – Conflict of Laws vol 6(2)\n                        (LexisNexis, 2009) (“Halsbury’s Laws of\n                            Singapore”) at para 75.093). Egypt is a civil law\n                        jurisdiction and its laws and procedures are significantly different from\n                        those in Singapore. The applicable law is “obviously a more weighty\n                        factor in a dispute which turns on questions of interpretation of the law\n                        than one which merely involves the application of the law” (seeHalsbury’s Laws of Singaporeat\n                        para 75.093). (b)     Secondly, the Egyptian court has appointed a Receiver over\n                        Al Taleb. The incidents of the power of the Receiver with respect to\n                        the assets, books and records of Al Taleb and claims related thereto\n                        are matters of Egyptian law. The fourth defendant, who is averred to be in\n                        possession of the relevant documents, resides in Egypt. The building from\n                        which Al Taleb derives its main income in the form of rent and its\n                        books, records and receipts and compliance with applicable law is determined\n                        by Egyptian law. (c)     Thirdly, there are three pending cases before the Egyptian courts\n                        involving the plaintiffs, the defendants and the Receiver relating to the\n                        affairs of Al Taleb. The shareholders of Al Taleb, present\n                        plaintiffs and defendants included, have a history of seeking relief from\n                        the Egyptian courts, from the time of the entity’s registration. The\n                        continuation of this action in Singapore accordingly carries the risk of\n                        outcomes in contradiction of Egyptian law and the rights and duties of the\n                        Egyptian court appointed Receiver. 21     The Egyptian courts are, in the light of the\n                    above, the more appropriate forum for the resolution of this dispute between the\n                    parties. This is not overridden by reason only that three of the defendants\n                    reside in Singapore.",
        "Stage Two: There is No Personal or Juridical Disadvantage to the\n                Plaintiffs in Granting a Stay": "22     The first stage of theSpiliadatest being clearly satisfied, I move on to consider the\n                    second stage of theSpiliadatest, which was\n                    succinctly restated by the Court of Appeal inPT Hutan Domas\n                        Raya v Yue Xiu Enterprises (Holdings) Ltd and another [2001]\n                    1 SLR(R) 104 at [16]: … If the court concludes that there is such a more appropriate\n                        forum, it will ordinarily grant a stay unless, in the words of Lord Goff,\n                        \"there are circumstances by reason of which justice requires that a stay\n                        should nevertheless not be granted. In this inquiry the court will consider\n                        all the circumstances of the case, including circumstances which go beyond\n                        those taken into account when considering connecting factors with other\n                        jurisdictions” … One such factor which would warrant a refusal\n                        of stay would be if it can be established byobjective\n                            cogent evidencethat the plaintiff will not obtain justice in\n                        the foreign jurisdiction. … [emphasis added] The Court of Appeal also noted that the plaintiff bears the burden of\n                    establishing that he will be denied substantial justice if the case is not heard\n                    in the forum. 23     The plaintiffs argue that commencing the\n                    action in Egypt would cause a delay which would allow the defendants to delay\n                    the release of monies and documents. InOriental Insurance Co\n                        Ltd v Bhavani Stores Pte Ltd[1997] 3 SLR(R) 363, the\n                    Court of Appeal ruled that a bare assertion of likely delay would not suffice,\n                    and even if the argument was accepted, a delay would not ordinarily merit a stay\n                    of proceedings if all that could be shown was inconvenience and not substantial\n                    injustice (at [44]–[45]): The respondents also said they might have to put up security for costs,\n                        and that a speedier resolution could be had in Singapore. However, no\n                        evidence was raised to suggest the likely delay (if any). In the absence of\n                        such evidence, we were unable to give credence to the respondents'\n                        assertion. Furthermore, even if we were to accept that there would be\n                        substantial delay if proceedings were stayed, this consideration, though\n                        valid, was not so weighty as to merit a stay of proceedings. Ultimately, any delay which might be occasioned by a stay, in our view,\n                        would not represent a substantial injustice to the respondents. The overall\n                        effect would be to cause them inconvenience. However, this was not a case,\n                        to borrow a phrase from the judgment of Lord Brandon of Oakbrook\n                            inThe Abidin Daver[1984] 1 All\n                        ER 470, in which there was an overwhelming balance of convenience in favour\n                        of the respondents. It should be noted that the plaintiffs remain at liberty to file their\n                    requests with the Receiver for accounts and payments relating to the\n                    Deceased’s Al Taleb shares. 24     The plaintiffs next claim that Singapore is\n                    the only forum that can issue effective orders to compel the defendants to\n                    deliver the documents and assets. This submission ignores the reality that the\n                    defendants being concurrently beneficiaries of the Deceased’s estate\n                    including the Al Taleb shares, would have sufficient personal interest to comply\n                    with lawful orders of the Receiver. In any event this would be one factor to\n                    consider but no means is it conclusive. 25     In dismissing the defendants’\n                    application on 4 March 2011 to stay the proceedings on the basis offorum non conveniens, the AR took into account\n                    the “current political state” of Egypt and opined that justice\n                    requires the action be heard in Singapore. 26     Here, the relevant issue is whether the\n                    political situation in Egypt is such that the plaintiffs would be denied\n                    substantial justice if they were to commence proceedings there or refer their\n                    claims to the Cairo court-appointed Receiver. 27     The political uncertainty in the spring of\n                    2011 in Egypt does not appear to have resulted in the cessation of functioning\n                    of the Egyptian judicial institutions. The defendants’ counsel advised the\n                    court and the plaintiffs’ counsel did not deny that the Cairo court\n                    decided on 9 March 2011 to uphold the decision of the lower court to annul\n                    the defendants’ appointment as directors/managers of Al Taleb. In any\n                    case, for purposes of taking judicial notice, where is any doubt as to the\n                    proper functioning of Egyptian judicial institutions, that doubt should be\n                    resolved against the plaintiffs who so assert (seeZheng Yu\n                        Shan v Lian Beng Construction (1988) Pte Ltd[2009]\n                    2 SLR(R) 587 at [33]). 28     In the light of the above relevant to theSpiliadastage two test, I do not find that it\n                    has been established that the plaintiffs would be denied substantial justice to\n                    pursue their action before the Egyptian courts. 29     I would, quite apart from granting the\n                    striking out application, in any event, have granted a stay on the ground offorum non conveniens.",
        "Conclusion": "30     For all these reasons, the appeal is allowed.\n                    The defendants will have costs here and below."
    }
}