{
    "case_title": "Smartbus Pte Ltd\n      v\n      Yeap Transport Pte Ltd",
    "ncitation": "[2011] SGHC 129",
    "coram": "Judith Prakash J",
    "sections": {
        "Introduction": "1       The plaintiff carries on business in Singapore\n                    as an investment holding company. Currently, its directors are Mr Chay Yee\n                    Meng (“Mr Chay”) and Ms Lilian Ng Mui Hoon\n                    (“Ms Ng”). Mr Chay and Ms Ng are also officers of\n                    InfoWave Pte Ltd (“InfoWave”), a company in the business of\n                    manufacturing communications equipment including the manufacture of real-time\n                    bus tracking and management systems. InfoWave is the parent company of the\n                    plaintiff. 2       At all material times, Mr Adrian Yeap Tong\n                    Cher (“Mr Yeap”) and his wife, Ms Carol Tan\n                    (“Ms Tan”), have been the directors and shareholders of the\n                    defendant company which is in the business of providing school bus and transport\n                    services. They are also shareholders and directors of a company called Yellow\n                    Bus Services Pte Ltd (“Yellow Bus”) while Ms Tan and her\n                    brother own and run a company called C&A Transit Pte Ltd\n                    (“C&A”). Between 21 June 2007 and 23 September 2009,\n                    Mr Yeap was a director of the plaintiff. 3       The question at issue in this suit is whether\n                    the plaintiff and the defendant concluded a contract by which the defendant\n                    agreed to buy 40 compressed natural gas (“CNG”) buses from the\n                    plaintiff.",
        "Background": "4       At all material times, the defendant had a\n                    contract to supply school bus services to the Singapore American School\n                    (“SAS”). It also provided school bus services to other schools.\n                    Before April 2009, the defendant did not own any buses and therefore it would\n                    provide the buses needed by the schools through contracts with other bus owners\n                    and operators. These other companies were referred to by the defendant as its\n                    bus sub-contractors. Yellow Bus and C&A are two of the defendant’s bus\n                    sub-contractors. 5       The plaintiff was incorporated in June 2007 and\n                    became a subsidiary of InfoWave in January 2008. These events took place\n                    pursuant to certain negotiations between Mr Chay and Mr Yeap.\n                    Mr Yeap became the Chief Executive Officer of the plaintiff whilst\n                    Mr Chay became its chairman. Ms Ng was appointed the plaintiff’s\n                    Chief Financial Officer and, in September 2008, she became a director of the\n                    plaintiff. 6       In 2007, the defendant was managing and\n                    operating a fleet of over 100 diesel buses for the purpose of servicing SAS and\n                    other schools. In that year, SAS decided to support the use of CNG buses as\n                    replacements for the diesel buses. The defendant and its sub-contractors were,\n                    therefore, interested in replacing some of their diesel buses with CNG\n                    buses. 7       Between late 2007 and July 2008, Mr Chay\n                    and Mr Yeap had discussions on the possibility of purchasing CNG buses from\n                    a Chinese manufacturer, Shanghai Shenlong Bus Co Ltd (“Shenlong”),\n                    for the purpose of using these buses as part of the SAS fleet. Pursuant to the\n                    discussions, Mr Yeap, acting as the plaintiff’s representative,\n                    negotiated with Shenlong for the purchase of 40 CNG buses from it. These\n                    negotiations resulted in a contract in July 2008 by which the plaintiff agreed\n                    to buy 40 CNG buses from Shenlong at a price of $142,000 per bus. To date, the\n                    plaintiff has taken delivery of a total of 12 buses from Shenlong. 8       In May 2009, the defendant took delivery of one\n                    bus from the plaintiff and in July 2009, it took delivery of a second bus. It\n                    has paid the plaintiff certain sums for the buses but there is a dispute as to\n                    whether what the defendant has paid is the full price payable for both. The\n                    other ten buses remain with the plaintiff.",
        "Pleadings": "9       The material portions of para 3 of the statement\n                    of claim aver that in or around January 2008, the plaintiff and the defendant\n                    reached an agreement for the purchase of 40 CNG buses (“the\n                    Agreement”) on the following terms: (a)     the plaintiff would enter into a\n                        sales contract with Shenlong to buy 40 buses at the price of $142,000 per\n                        bus; and (b)     the\n                        defendant would take immediate delivery of 40 buses upon payment to the\n                        plaintiff of the sum of $172,000 per bus plus all charges, costs, expenses\n                        and fees relating to the freight, transport, taxes, inspection, LTA\n                        registration, port clearance, declaration and permit, letter of credit,\n                        financing, administration, operation and/or maintenance of the\n                    buses. 10     By paras 6 to 8 of the statement of claim, the\n                    plaintiff pleaded that from May to July 2009, pursuant to the Agreement, the\n                    defendant had taken delivery of two buses and had paid in total $338,350.80 for\n                    them, leaving an outstanding balance. In breach of the Agreement, the defendant\n                    had refused or failed to take delivery of any further buses from the plaintiff\n                    including the ten currently in the plaintiff’s possession. 11     The defence denied para 3 of the statement of\n                    claim. In particular the defendant denied that it had entered into the Agreement\n                    with the plaintiff, in or around January 2008 or at any time at all, for the\n                    purchase of 40 buses. The defendant asserted, instead, that the plaintiff had\n                    purchased the buses from Shenlong for the purpose of re-selling them in\n                    Singapore generally and not only to the defendant. 12     As regards the two buses which it had\n                    purchased from the plaintiff, the defendant averred that there was a written\n                    agreement dated 20 April 2009 for the purchase of the first bus at the price of\n                    $187,426.50 and that there was a similar written agreement dated 27 May 2009 for\n                    the purchase of the second bus at the price of $187,338.50. The defendant had\n                    made partial payment of these prices and, prior to April 2010, the sum which\n                    remained due under the written agreements was $32,365. This sum was paid in\n                    April 2010 and no sums remained due to the plaintiff thereafter. 13     The issues that arise from the pleadings\n                    are: (a)     whether the Agreement was concluded\n                        as asserted by the plaintiff; and (b)     what were the prices payable for the two buses bought in\n                        April and May 2009.",
        "The plaintiff’s version": "14     This account of what happened is based on the\n                    affidavits of evidence-in-chief (“AEIC”) filed on behalf of the\n                    plaintiff. 15     Mr Chay stated that in late 2007,\n                    Mr Yeap told him that the defendant and its sub-contractors had to replace\n                    part of their existing fleet of over 100 diesel buses due to the age of some\n                    buses. Mr Yeap wanted to replace the fleet with CNG buses and mentioned\n                    that SAS supported this project. He also told Mr Chay that instead of the\n                    defendant and its sub-contractors separately purchasing their own CNG buses, he\n                    could standardise the fleet by buying buses in volume. This would also allow him\n                    to obtain a better price for the buses. Mr Yeap said that he had discussed\n                    the matter with the sub-contractors and had convinced them to purchase CNG buses\n                    from the defendant. He and his wife owned some of the sub-contractors and their\n                    companies would definitely buy buses from the defendant. 16     The defendant did not have the financial means\n                    to purchase the buses directly from Shenlong. Mr Yeap therefore approached\n                    Mr Chay as chairman and CEO of InfoWave to seek financial assistance for\n                    the purchase of the buses. It was agreed that the plaintiff would provide\n                    financial support for the defendant’s purchase of the buses. In return for\n                    the plaintiff’s assistance, the plaintiff would receive a $30,000 mark-up\n                    for each bus. This had been admitted in the defence when the defendant pleaded\n                    at para 4(a) that it had been agreed that the plaintiff would sell the 40 buses\n                    at a profit of $30,000 per bus. 17     Mr Chay affirmed that, as the defendant\n                    had pleaded, a portion of the profit earned by the plaintiff from the\n                    transaction would eventually be received by Mr Yeap as it would be\n                    converted into Mr Yeap’s shares in InfoWave upon the listing of\n                    InfoWave. The Agreement between the plaintiff and the defendant for the purchase\n                    of 40 buses was not, however, contingent upon the signing of a swap option\n                    agreement in respect of InfoWave and/or any plans to list\n                InfoWave. 18     After considering the options, Mr Yeap\n                    decided to purchase the buses from Shenlong. He told Mr Chay that he was\n                    certain that the defendant would be able to take delivery and/or procure its\n                    sub-contractors to take delivery of least 40 buses from ShenLong since over 100\n                    diesel buses needed to be replaced by CNG buses. In the course of the\n                    discussions, Mr Chay informed Mr Yeap that the plaintiff would only be\n                    able to finance the purchase of the buses by import letters of credit and that\n                    the defendant would have to take immediate delivery of the buses upon their\n                    arrival in Singapore. Mr Yeap agreed to this. Pursuant to the discussions,\n                    sometime in January 2008, the plaintiff and the defendant had reached the\n                    Agreement with the terms set out in the statement of claim. 19     Thereafter, Mr Yeap started liaising with\n                    an engine manufacture on the use of their use for the CNG buses. He also met up\n                    with the relevant authorities, in particular, the Land Transport Authority\n                    (“LTA”) and the National Environment Agency (“NEA”)\n                    to obtain approval for the use of the buses in Singapore. During these meetings,\n                    Mr Yeap informed the LTA and NEA that the defendant was replacing its\n                    existing fleet of diesel buses with CNG buses from Shenlong and that the\n                    defendant was going to be the ultimate owner of the CNG buses. Mr Chay\n                    considered that this conduct was a clear admission by Mr Yeap and the\n                    defendant that the Agreement existed. 20     Mr Chay asserted that another admission\n                    of the existence of the Agreement was contained in the e-mail dated 4 April\n                    2008 which Mr Yeap sent to Mr Chay and Mr Ng enclosing a letter\n                    dated 4 April 2008 (“the April 2008 letter”) signed by\n                    Mr Yeap as CEO of the defendant stating that the defendant was to purchase\n                    40 buses from the plaintiff. The contents of the April 2008 letter are important\n                    and I therefore quote them in full below: 4thApril 2008 To Whom It May Concern, Re: Purchase of New CNG Buses Yeap Transport Pte Ltd (Yeap) is contracted by the Singapore American\n                        School as the sole school bus contractor to provide transportation services\n                        for the school till the year 2012. Currently, there are also three thousand\n                        (3,000) students using the school bus services daily. A fleet of one hundred\n                        and eight (108) buses are [sic] used daily to\n                        satisfy all the transportation needs of the school. The Singapore American School is supportive of the project initiated by\n                        Yeap to become the first CNG school bus fleet in Singapore. Yeap and their\n                        sub-contractors shall purchase 40 units of CNG buses from Smartbus Pte\n                        Ltd. If you have any questions, you can contact us at 9734-5255. With best regards, Adrian Yeap CEO 21     Ms Ng also testified on the Agreement.\n                    She had no direct knowledge of its formation but gave evidence on events that\n                    had occurred after its alleged formation. According to Ms Ng, the plaintiff\n                    had approached InfoWave’s principal banker, DBS Bank\n                    (“DBS”), to provide the import letters of credit for the purchase\n                    of the buses. DBS requested that the plaintiff provide documentary proof of the\n                    defendant’s commitment to purchase the 40 buses. As the cost of the buses\n                    was still being finalised, Ms Ng was unable to obtain a purchase order from\n                    the defendant. She therefore asked Mr Yeap for a letter to record its\n                    commitment to purchase the buses and Mr Yeap responded by giving her the\n                    April 2008 letter. 22     From January to July 2008, Mr Yeap,\n                    acting on behalf of the plaintiff, negotiated with Shenlong on the purchase of\n                    the buses. In July, he concluded the sales contracts with Shenlong for the\n                    purchase of 40 buses at the price of $142,000 per bus. Mr Chay said that,\n                    but for the Agreement, the plaintiff would not have entered into the sales\n                    contracts with Shenlong since the plaintiff was not incorporated as a bus\n                    distribution company. 23     Ms Ng gave evidence on the\n                    defendant’s attempts to obtain financing for the purchase of the buses.\n                    She said Mr Chay introduced Goldbell Corporation Pte Ltd\n                    (“Goldbell”) to the defendant and they discussed a proposed\n                    hire-purchase agreement between Goldbell and the defendant. On 21 July 2008,\n                    Goldbell sent Ms Ng an e-mail with a payment flowchart attached. Ms Ng\n                    thought this showed that the intention had always been for the defendant to\n                    purchase the buses. 24     In the meantime, the defendant asked for an\n                    urgent loan of $400,000 from the plaintiff to enable it to purchase second-hand\n                    buses to keep the routes at the SAS and Australian International School. In his\n                    e-mail request for the loan dated 26 August 2008, Mr Yeap asked: Can you provide [the defendant] with a loan of 400K which we can repay\n                        back to you as soon as the CNG buses have been successfully sold to my bus\n                        operators? Yeap can sell off the fleet of 6 old buses when the new CNB buses\n                        are ready to take over the routes and we can repay you the loan. This way,\n                        we already have 180K (30K X 6 units) profit for bus distribution\n                        confirmed! In the plaintiff’s opinion, this e-mail was an admission by\n                    Mr Yeap and the defendant of the existence of the Agreement. 25     The plaintiff took delivery of 12 buses\n                    between April 2008 and April 2009. Subsequently, the defendant took delivery of\n                    one bus from the plaintiff in May 2009 and of a second in July 2009. Thereafter,\n                    the defendant refused to take delivery of any more buses. 26     In August or September 2009, there was a\n                    meeting between Mr Chay, Ms Ng, Mr Yeap and Ms Tan. During\n                    the meeting, Ms Tan said that as the market prices of the buses had\n                    dropped, the defendant and its sub-contractors no longer wished to purchase\n                    buses from the plaintiff. Mr Chay responded that this would be a breach of\n                    the Agreement. Mr Yeap then asked for a substantial discount on the prices\n                    of the buses. Mr Chay refused this request. He insisted that the defendant\n                    perform the Agreement and take delivery of the buses on the agreed\n                terms. 27     Mr Chay also gave evidence on the\n                    defendant’s assertion that there had been two written agreements which\n                    varied the sale price of the buses. He said that the alleged Written Agreement\n                    No. SB/SLK6116/09/01 dated 20 April 2009 and Written Agreement No.\n                    SB/SLK6116/09/02 dated 27 May 2009, disclosed by the defendant pursuant to the\n                    plaintiff’s notice to produce, which referred to an overtrade discount\n                    were not approved by the plaintiff. The Written Agreements were signed by\n                    Mr Cheong Khin Choo (“Mr Cheong”) as the purported sales\n                    manager of the plaintiff and Mr Yeap on behalf of the\n                defendant. 28     In fact, Mr Chay maintained,\n                    Mr Cheong was not the plaintiff’s sales manager. The plaintiff did\n                    not have a sales manager. Mr Cheong was engaged by the plaintiff’s\n                    subsidiary, Yeap Technology Pte Ltd (“Yeap Tech”), as a project\n                    manager to oversee the registration of the CNG buses in Singapore. He was only\n                    authorised to sign, on the plaintiff’s behalf, those documents that had to\n                    be submitted to the relevant authorities for approval of the import of these\n                    buses. Mr Cheong had no authority to enter and/or sign the Written\n                    Agreements on behalf of the plaintiff.",
        "The defendant’s version": "29     In Mr Yeap’s AEIC, he gave\n                    particulars of two companies, Yeap Technology (Shanghai) Co Ltd\n                    (“YTS”) and Yeap Tech which were incorporated by him. He noted\n                    that buses owned and operated by both YTS and Yeap Tech were using\n                    InfoWave’s real-time bus tracking and management systems and this was how\n                    he had come to know Mr Chay. In mid 2007, Mr Chay expressed an\n                    interest in acquiring YTS and Yeap Tech so as to enhance InfoWave’s assets\n                    ahead of a proposed listing. As part of these plans, the plaintiff was\n                    incorporated in June 2007 with Mr Yeap and one Mr Gan as the original\n                    shareholders. 30     In August 2007, InfoWave, Yeap Tech and\n                    Mr Yeap, executed a memorandum of understanding. It was agreed that the\n                    plaintiff would be acquired by InfoWave and that the plaintiff in turn would\n                    acquire Yeap Tech and YTS. This duly happened and, in January 2008, the\n                    plaintiff became a wholly owned subsidiary of InfoWave. At the same time,\n                    Mr Yeap became the plaintiff’s CEO and Mr Chay the\n                    chairman. 31     Mr Yeap stated that in January 2008, the\n                    plaintiff’s board of directors decided to import China-made CNG buses from\n                    Shenlong into Singapore. At this time, the cost of CNG was very low and the\n                    price of diesel was constantly rising. It therefore made sense to import CNG\n                    buses instead of diesel buses. 32     On behalf of the defendant, Mr Yeap had\n                    pitched the idea of using environmentally friendly CNG buses to provide bus\n                    services for SAS. SAS was supportive of this idea. The board of directors of the\n                    plaintiff then tasked Mr Yeap to negotiate with Shenlong for the purchase\n                    and importation of 40 CNG buses and to enter into contracts with Shenlong. He\n                    was also asked to seek financing for the purchase of the buses and to assist the\n                    plaintiff in selling them to the defendant’s bus contractors. It was\n                    agreed that the profit made on the sale of the CNG buses would be converted, via\n                    a formula, to shares to be given to Mr Yeap in InfoWave after its\n                    listing. 33     From January to July 2008, Mr Yeap\n                    negotiated with Shenlong. He kept Mr Chay and Ms Ng informed of all\n                    developments in the negotiations and sought their consent and approval before\n                    making any decisions on the plaintiff’s behalf. They informed him that\n                    they had been seeking financing from DBS for the buses and that DBS wanted\n                    comfort that the plaintiff would not default on the loan repayment. Therefore,\n                    Mr Yeap, on behalf of the defendant, provided the April 2008 letter for the\n                    plaintiff’s transmission to DBS. 34     He stated that he drafted the letter as a\n                    letter of comfort purely to assure DBS that there was going to be a need for\n                    such CNG buses because consumers like SAS supported the use of CNG buses as\n                    their school buses. He explained that he had referred to the bus owners and\n                    operators as his bus “sub-contractors” not because he resold buses\n                    to them, but because he sub-contracted bus transportation service contracts to\n                    them for the actual operation of the school transport system. At the time the\n                    defendant did not own or operate buses of its own. It was, therefore, not going\n                    to purchase the CNG buses from the plaintiff for resale to the defendant’s\n                    bus sub-contractors. Reselling to the defendant’s bus sub-contractors\n                    would also mean that the defendant would be selling the CNG buses as second-hand\n                    vehicles which was not logical or cost effective. The usual practice was for bus\n                    owners to buy directly from the distributor or importer. 35     Mr Yeap asserted that his family had been\n                    in the business of chartered bus services and bus management services for about\n                    30 years. Thus, he was familiar with bus owners and operators and was well\n                    placed to market and sell the CNG buses to them. This was why he stated that his\n                    bus sub-contractors would also be purchasing the 40 CNG buses. It was never\n                    intended that the defendant would be the only party buying buses from the\n                    plaintiff. The plaintiff itself was not then a bus owner but only managed bus\n                    services. The arrangement was that the plaintiff would buy the buses and bring\n                    them into Singapore and the defendant would assist the plaintiff in marketing\n                    and selling the buses to its own sub-contractors and to the general market in\n                    Singapore. This was why it was the plaintiff rather than the defendant who was\n                    the party seeking financing for the buses. 36     The price of each bus was initially agreed at\n                    $135,000. In July 2008, the price was raised to $142,000 because the plaintiff\n                    wanted air-suspensions installed on each bus. In the event, one bus was\n                    purchased at this price on 2 July 2008 and subsequently, on 16 December 2008,\n                    five more units were purchased at $135,000. The next six buses, bought on 26\n                    March 2009, were also priced at $135,000 each. 37     Mr Yeap gave an account of how the\n                    defendant had come to purchase two buses from the plaintiff. He stated that at\n                    the material time there were no other CNG buses from sale or use in Singapore\n                    and bus companies, being unfamiliar with such buses, were hesitant about buying\n                    them without being able to test-drive or view the buses. Therefore, the\n                    plaintiff agreed to sell the two buses at a discount to one of the\n                    defendant’s sub-contractors as “showroom buses”.\n                    Mr Yeap wanted to use Yellow Bus as the purchaser of the showroom buses but\n                    that company was too heavily leveraged. In the end Mr Yeap and his wife\n                    decided to use the defendant as the purchaser of the showroom buses. By an\n                    e-mail dated 27 March 2009, Mr Yeap informed Mr Chay and Ms Ng\n                    that: ... Uncle Cheong is ready to register the first 2 units for Yeap’s\n                        own use as soon as Uob, Sing or UMF gives the go ahead. We have already lined up the 3 owners for the next 4 buses to follow thru\n                        immediately after we take possession of the first 2 units! ... Mr Yeap commented that his e-mail showed that the defendant was only\n                    supposed to purchase two buses and that the others would be sold to other bus\n                    sub-contractors. He also pointed to other correspondence which he considered\n                    indicated this as well. I will deal with such correspondence later in this\n                    judgment if necessary. 38     Mr Yeap said he attempted to sell the CNG\n                    buses to the defendant’s sub-contractors and other bus operators and\n                    obtained a few offers in respect of the remaining ten buses. The offers,\n                    however, were lower than the plaintiff had expected because of competitive\n                    selling prices of other buses in the market. The plaintiff insisted on making a\n                    $30,000 profit margin on each bus and therefore none of the bus owners and\n                    operators were able to afford the CNG buses. In addition, by the time approval\n                    was granted by LTA and NEA for the registration of the CNG buses, the cost of\n                    natural gas had risen to a level that made it more expensive to run the buses on\n                    gas instead of on diesel. 39     As regards the Written Agreements,\n                    Mr Yeap explained that these were entered into by both parties on the basis\n                    that the defendant was to buy the two buses from the plaintiff on an\n                    “in-house overtrade” scheme. Under this scheme, the plaintiff\n                    would give an after-sales discount to the defendant for each of the buses to\n                    assist the defendant in purchasing the buses as the finance company would only\n                    provide financing for a percentage of the sale price of the buses. If the\n                    plaintiff had given a discount from the sale price, the finance company would\n                    finance the purchase on a percentage of the discounted sale price and the\n                    defendant would have to pay the balance in cash. When the discount was an\n                    after-sales discount, however, the defendant would be able to apply for\n                    financing on the undiscounted sale-price and receive more financing.\n                    Mr Yeap’s evidence was supported by his wife. 40     Mr Cheong also testified. In his AEIC, he\n                    said that he was employed by Yeap Tech in March 2008 as its chief operating\n                    officer. At about the same time, he was seconded by Mr Yeap to work for the\n                    plaintiff as a project and sales manager. In this latter position, he reported\n                    to Mr Yeap and to Ms Ng. He was authorised by the plaintiff to sign\n                    for and on its behalf all documents required to be submitted for the approval of\n                    the importation of the CNG buses. 41     The plaintiff appointed TM Motor Works Pte Ltd\n                    (“TM Motors”) as its sales and marketing representative to sell\n                    the CNG buses for the plaintiff and as the exclusive repair and service centre\n                    for all such buses. The contract effecting this arrangement was signed by\n                    Mr Cheong on behalf of the plaintiff. He also signed the two Written\n                    Agreements on behalf of the plaintiff as its sales manager. At all material\n                    times, Mr Cheong said, he was acting in his capacity as plaintiff’s\n                    project and sales manager and was authorised to execute such agreements on the\n                    plaintiff’s behalf. Mr Cheong resigned from Yeap Tech on 1 July\n                    2009.",
        "The law": "42     To find a contract, there must be an\n                    identifiable agreement that is complete and certain, consideration as well as an\n                    intention to create legal relations. This basic principle of contract law was\n                    reemphasised inGay Choon Ing v Loh Sze Ti Terence Peter and\n                        another appeal[2009] 2 SLR(R) 332 (“Gay Choon Ing”). Where the contract is not in writing,\n                    the court would have to examine the oral evidence as well as the contemporaneous\n                    correspondence and conduct of the parties at the material time to ascertain\n                    whether the parties did reach an agreement. InProjection Pte\n                        Ltd v The Tai Ping Insurance Co Ltd[2001] 1 SLR(R) 798, the\n                    Court of Appeal cited with approval at [16] the following observation of Lord Denning MR inPort Sudan Cotton Co v Govindaswamy Chettiar & Sons[1972] 2 Lloyd’s Rep 5 at 10: ... I do not much like the analysis in the text-books of inquiring whether\n                        there was an offer and acceptance, or a counter-offer, and so forth. I\n                        prefer to examine the whole of the documents in the case and decide from\n                        them whether the parties did reach an agreement upon all material terms in\n                        such circumstances that the proper inference is that they agreed to be bound\n                        by those terms from that time onwards. 43     The importance of reaching full and final\n                    agreement on the terms of the contract cannot be overstressed. In the words of\n                    Maugham LJ inFoley v Classique Coaches Ltd[1934]\n                    2 KB 1 at 13, it is “indisputable that unless all the material terms of\n                    the contract are agreed there is no binding obligation”. 44     InMidlink Development Pte\n                        Ltd v Stansfield Group Pte Ltd[2004] 4 SLR(R) 258, V K Rajah JC\n                    opined at [52] that “the\n                    touchstone is whether, in the established matrix of circumstances, the conduct\n                    of the parties, objectively ascertained, supports the existence of a\n                    contract”.",
        "Submissions and analysis": "",
        "Was the Agreement concluded?": "45     While it was clear from the evidence of both\n                    Mr Chay and Mr Yeap that they had reached some understanding with\n                    regard to the importing of the CNG buses into Singapore, the question is whether\n                    a contract was concluded that those buses were to be purchased by the defendant\n                    from the plaintiff. The defendant’s case is that the plaintiff was to\n                    import the buses and Mr Yeap was to procure the sale of the buses to the\n                    defendant’s sub-contractors and other users in Singapore. It was not\n                    itself intended to be the purchaser of all 40 buses. 46     The plaintiff’s position was that the\n                    defendant entered into the Agreement as the latter and its sub-contractors had\n                    to replace part of their existing fleet of buses as the same were over the\n                    maximum age limit specified by the defendant’s contract with SAS. It\n                    pointed out that it is an investment company and had no reason to buy the 40 CNG\n                    buses from Shenlong unless the defendant had already agreed to purchase the\n                    buses from it. The plaintiff submitted that the bulk purchase of the buses\n                    benefited both parties. The plaintiff would earn a $30,000 profit on each bus\n                    while the defendant and its sub-contractors stood to gain because, even with the\n                    $30,000 mark-up, the Shenlong buses were cheaper than others. As the defendant\n                    did not have the financial means to purchase the CNG buses itself, it sought\n                    assistance from the plaintiff. Mr Chay was confident that the defendant\n                    would take delivery, and/or procure that its sub-contractors would take\n                    delivery, of at least 40 buses within two weeks from the time they were imported\n                    into Singapore. 47     The plaintiff emphasised that, in\n                    Mr Yeap’s evidence, he had said that around January 2008, on behalf\n                    of the defendant, he had pitched the idea of using environmentally-friendly CNG\n                    buses to SAS and that the school was very supportive of this idea. The plaintiff\n                    argued that if the Agreement had not existed, Mr Yeap would not have\n                    pitched this idea to SAS. During cross-examination, Mr Yeap had also\n                    admitted that as of January 2008, the defendant preferred to contract with\n                    sub-contractors who used CNG buses as SAS preferred these buses and that the\n                    defendant was confident that the sub-contractors would buy these buses since\n                    they were preferred by both SAS and the defendant. 48     The plaintiff also relied on the\n                    defendant’s subsequent conduct. It emphasised that Mr Yeap took an\n                    active part in sourcing engines from Cummins Westport Inc\n                    (“Cummins”) for the installation of that company’s engines\n                    in Shenlong’s CNG buses. In an e-mail to Cummins on 24 March 2008,\n                    Mr Yeap expressed the defendant’s “keen interest” in\n                    using Cummins’ CNG engines and represented that the defendant\n                    “plan[ned] on an initial order of 40 [CNG buses] with\n                    [Shenlong]”. 49     Furthermore, the plaintiff pointed out that\n                    the defendant had applied for financing from DBS and Goldbell on the basis that\n                    it was purchasing a number of the CNG buses. However, Mr Yeap claimed that\n                    the defendant was negotiating with DBS and Goldbell because the plaintiff was\n                    exploring different methods to finance the purchase of the buses by the\n                    sub-contractors. The plaintiff submitted that the defendant’s version of\n                    events was without foundation. After all, the defendant had provided its own\n                    audited reports and a copy of the SAS contract to DBS. More importantly, there\n                    was a letter of offer from DBS dated 12 December 2008 addressed to the defendant\n                    to finance the purchase of ten buses. 50     Apart from the aforesaid, the defendant had\n                    represented to other third parties that it was buying CNG buses. For instance,\n                    it informed the National Environment Agency that it was going to replace the\n                    diesel buses with CNG buses and had sought approval from the import and use of\n                    CNG buses in Singapore. Mr Chay testified that he had heard Mr Yeap\n                    tell these agencies that the defendant would be owning the CNG\n                buses. 51     In particular, Mr Yeap had confirmed the\n                    existence of the Agreement in the April 2008 letter. The April 2008 letter\n                    confirmed that “[the defendant] and their sub-contractors shall purchase\n                    40 units of CNG buses from [the plaintiff]”. The plaintiff submitted that\n                    this was an admission of the existence of the Agreement and that Mr Yeap\n                    had repeatedly confirmed that that was so in the course of\n                    cross-examination. 52     In August 2008, Mr Yeap had asked for an\n                    urgent loan of $400,000 from the plaintiff to enable the defendant to purchase\n                    second-hand buses to keep the bus routes at SAS. In his request for the loan,\n                    Mr Yeap had said that “[the defendant] can sell off the fleet of 6\n                    buses when the new CNG buses are ready to take over the routes and [the\n                    defendant] can repay you the loan”. 53     The plaintiff also read the evidence as\n                    indicating that the defendant had constantly assured it that the defendant would\n                    take delivery of the CNG buses. It submitted that between January 2008 and about\n                    September 2009, Mr Yeap on behalf of the defendant constantly assured the\n                    plaintiff that the defendant would perform its obligations under the Agreement.\n                    In an e-mail dated 2 December 2008, he stressed that the plaintiff\n                    “would need to ensure some buses are available by January as the bus\n                    owners cannot wait indefinitely since their COE is going to expire soon”.\n                    In March 2009, he sent Ms Ng an e-mail saying that 12 was the exact number\n                    of buses that SAS had to replace as soon as possible. Subsequently, he assured\n                    Ms Ng that he had lined up three owners for the next four buses to follow\n                    through immediately after the defendant company had taken possession of the two\n                    buses. He further assured her that all six buses would be paid for within two\n                    weeks. 54     The plaintiff further submitted that\n                    Mr Chay and Ms Ng were reliable witnesses whereas Mr Yeap’s\n                    credibility and that of Mr Cheong were in doubt. Mr Chay’s\n                    version of the events leading up to the Agreement was consistent and not shaken\n                    during cross-examination. 55     The plaintiff made the best case that it\n                    could. Despite this, however, I have to bear in mind that in order to find that\n                    the Agreement existed, I must be certain as to the terms that were agreed upon.\n                    First of all, there is the issue of whether the defendant had put itself forward\n                    as the purchasing party for all 40 buses. While the plaintiff claimed that it\n                    entered into a contract with the defendant as purchaser, there were many\n                    indications in the evidence that the intended purchasers of the buses were the\n                    defendantandits sub-contractors and not just the\n                    defendant alone. While the plaintiff contended that the defendant would not have\n                    sent the April 2008 letter to DBS if there was no agreement, the wording of the\n                    letter plainly states that the defendant “and its sub-contractors”\n                    would be purchasing the buses. When Mr Yeap was in the witness box, counsel\n                    for the plaintiff cross-examined him on the basis that the April 2008 letter\n                    showed the purchasers were the defendantandits\n                    sub-contractors. The relevant portion of the transcript reads: QLooking at [the April 2008 letter], would you agree\n                            with me that [the statement that the Defendant and its sub-contractors\n                            shall purchase 40 units of CNG buses from the Plaintiff], is a firm\n                            commitment that Yeap Transport and their subcontractors shall purchase\n                            40 CNG buses? AI agree, Your Honour, Yeap and its subcontractor,\n                            yes. 56     If the contract contemplated that the parties\n                    who were buying the CNG buses would be the defendant and its sub-contractors,\n                    then it was incomplete because there was no indication of how many buses would\n                    be bought by the defendant and how many would be purchased by the\n                    sub-contractors. Nor did the contract contain a mechanism to determine these\n                    numbers. In any case, if there was a contract that provided that the defendant\n                    would purchase a certain number of buses from the plaintiff and would procure\n                    that its sub-contractors purchase the other buses, that contract would not be\n                    the Agreement. The Agreement was only between the plaintiff and the defendant.\n                    Whilst the plaintiff maintained that the conduct of the parties and the\n                    subsequent correspondence supported its stand, there was as much evidence to\n                    support the defendant’s position that it had never agreed to buy all the\n                    buses and that Mr Yeap was going to sell the buses to sub-contractors and\n                    to others in the market as well. 57     The plaintiff cannot gloss over the evidence\n                    that the intention was to sell the buses to the defendant and its\n                    sub-contractors by saying that the defendant’s procurement of its\n                    sub-contractors to take delivery was merely a performance of the\n                    defendant’s obligations under the Agreement. After all, the defendant\n                    would be solely responsible for taking delivery of all 40 buses only if it had\n                    acted as the agent for its sub-contractors or as a guarantor of the sub-sales.\n                    In this regard, it is worth noting that the plaintiff did not plead that either\n                    of these situations existed. 58     I have already referred to\n                    Mr Yeap’s e-mail of 27 March 2009 to the plaintiff stating “We\n                    have already lined up the 3 owners for the next 4 buses to follow [through]\n                    immediately after we take possession of the first two units”. As noted,\n                    the plaintiff argued that this was an assurance from the defendant that the\n                    defendant would take delivery of the CNG buses. This proposition is, however,\n                    not apparent on the face of the e-mail as, in the same, the defendant merely\n                    states that it has lined up bus owners to take delivery of the next four buses.\n                    The sentence is a clear indication that the defendant was not the intended buyer\n                    of these four buses and it supports the defendant’s case that it had\n                    merely agreed to assist the plaintiff in selling the buses to its\n                    sub-contractors. It is also important to note that when cross-examined,\n                    Mr Chay stated: So when we talk about selling we are saying that in this context our\n                        business is to sell – sell these buses to the sub-contractor. 59     When asked to explain why he continually\n                    referred to the sub-contractors as the buyers instead of to the defendant alone,\n                    Mr Chay gave the irrelevant answer that the fact “[that] I did not\n                    put it in does not mean that it didn’t exist”. This is clearly\n                    unsatisfactory. In this context, I should state that I did not always find\n                    Mr Chay to be a very satisfactory witness. He was evasive from time to time\n                    and was prone to stigmatise the questions put to him as being\n                    “illogical”. This sort of behaviour appeared when he was not very\n                    comfortable with the question being posed to him. 60     As would be noted from a perusal of the\n                    earlier paragraphs of this judgment, the plaintiff laid stress on various things\n                    that the defendant told third parties as proof that the defendant was the\n                    purchaser of the buses. The plaintiff, however, itself told third parties on\n                    several occasions that the buses were intended to be bought by various\n                    sub-contractors. A sampling from various letters both to and from the plaintiff\n                    indicates this: (a)     in an e-mail dated 5 April 2008 from\n                        Goldbell to Mr Chay, Goldbell stated: Following our recent discussion, I am pleased to confirm that Goldbell\n                            Leasing Pte Ltd (“GBL”) is prepared to sign a Master HP\n                            Agreement with InfoWave Pte Ltd for HP facilities to be provided to bus\n                            operators sub-contracting for InfoWave. These facilities are subject to\n                            credit approval of the individual bus operators ... (b)     in an e-mail\n                        dated 15 April 2008 to Goldbell, Ms Ng stated: ... The Master HP Agmt will be signed between Goldbell Leasing and the\n                            designated bus sub-contractors of Smartbus. ... Assignment of proceeds shall be from the bus operation contract\n                            between the bus sub-contractors and Smartbus (or Yeap Technology Pte\n                            Ltd). (c)     in an e-mail\n                        dated 18 June 2008 to Goldbell, Ms Ng stated: Smartbus’s primary biz is to sell the buses to the\n                            subcontractors and for Goldbell to provide the normal leasing\n                            arrangement to the subcontractors. However, we agree to support Goldbell\n                            by assigning proceeds from the contract to Goldbell in the event that\n                            the subcontractor defaults in its monthly instalments. (d)     in a letter dated\n                        12 May 2009 to Sing Investment and signed on behalf of the plaintiff by\n                        Mr Chay, the plaintiff said,inter\n                        alia: ... Yeap Transport has been working with Smartbus to bring in CNG\n                            buses to Singapore at SAS’s request and to meet other demands from\n                            Smartbus’s local and regional customers. Smartbus is marketing to all its customers at a package price of ...\n                            At this point, Yeap Transport has accepted the offer to purchase 1 unit\n                            of the CNG bus at that price. We regret that we are unable to provide proof of other sales for the\n                            time being as the other potential customers are still waiting for news\n                            of their Hire Purchase application through their regular finance\n                            companies. 61     Looking at the correspondence above, it is\n                    clear that the plaintiff was hampered in its effort to get financing by the fact\n                    that it could not produce sales contracts for all the buses or even the 12 that\n                    had already been delivered. Yet at that stage it did not ask the defendant to\n                    sign a contract for the 12 buses let alone all 40. 62     If there had been a concluded agreement, it\n                    would have been logical for the plaintiff to demand that the defendant take\n                    delivery of the buses as and when batches of the same arrived in Singapore. This\n                    was not done for a long time, however, as Ms Ng admitted. The first time a\n                    demand was made that the defendant take delivery was on 18 March 2010 and this\n                    was in a letter sent out by the plaintiff’s solicitors long after the\n                    defendant had allegedly indicated that it was not going to buy the buses. The\n                    plaintiff was unable to explain why it did not insist until so late in the day\n                    on the defendant taking delivery. Initially, the plaintiff tried to rely on an\n                    e-mail of 29 June 2009 sent by Ms Ng to prove that it had demanded that the\n                    defendant take delivery of the buses on that date. That e-mail, however, read as\n                    follows: Pl see attached for the costing for the 12 buses. I’ve made some\n                        estimates on some of the costing as we have not received the invoices\n                        (bills) for them. Pls let finance know if there are any other costs that\n                        were not taken in at this point in time. 63     When cross-examined on this e-mail,\n                    Ms Ng, who had earlier claimed that by the same she had asked the defendant\n                    to take delivery, had to concede that this was not in fact the case. The\n                    relevant part of the transcript reads: QThis is not a letter of demand or any form of demand\n                            from you that they take delivery of the 12 buses. AYes. This email is basically a confirmation of the\n                            costing of the last 12 buses so that we can firm up what’s the\n                            price for these last 12 buses. 64     The e-mails that Mr Chay and Ms Ng\n                    sent in relation to the problem that the plaintiff faced when no one took\n                    delivery of the buses that had already arrived were also inconsistent with there\n                    being a concluded contract with the defendant for the sale and purchase of the\n                    40 buses. Mr Chay’s e-mail of 27 March 2009 to Mr Yeap suggested\n                    that the terms of the sale had not been finalised as he stated: Best way is to quickly finish off the current stock. The delay is also\n                        [affecting] us in Singapore. DBS could withdraw the line if we don’t\n                        move. If the Agreement had already been made between the plaintiff and the\n                    defendant, the “best way” to resolve the plaintiff’s problem\n                    of having so many CNG buses on its hands would have been to ask the defendant to\n                    take delivery. 65     On the same day and for the same reason,\n                    Ms Ng wrote to Mr Yeap as well. She mentioned the need to\n                    “finalise” the sale of the buses. Instead of asking the defendant\n                    to take delivery of the current stock, she stated: Adrian, We need to quickly sell off the 6 units that [are] currently sitting in\n                        the bus workshop/terminal. The parking fees are expensive. I believe we need\n                        to finalise the sale of the 1st6 units before\n                        bringing in another 6 units of buses. We do not want to be stuck with 12\n                        buses in the depot ... If the Agreement had already been made, there would have been no need to ask\n                    for the sale of the buses to be finalised. 66     In May 2009, there were further indications\n                    that the buses were not to be sold to the defendant alone. In an e-mail dated 3\n                    May 2009, Mr Chay told Ms Ng and Mr Yeap to “work out a\n                    plan to quicklysell offthe buses”.\n                    Similarly, in an e-mail dated 4 May 2009, Ms Ng asked Mr Yeap\n                    “[a]fter having sold the first bus, we have 11 buses on [sic] our hand. Could we meet to discuss the sale of\n                    these buses?” It would seem that the parties were attempting to work out\n                    how and possibly to whom the buses were to be sold to as each batch arrived in\n                    Singapore. This does not suggest that the Agreement had been\n                concluded. 67     The plaintiff had no credible explanation for\n                    the language used in the e-mails referred to above. Instead, it argued that the\n                    defendant did not put its case that the sale of the buses was not finalised to\n                    Ms Ng, in accordance with the rule inBrown v\n                        Dunn(1894) 6 R 69. Clearly, it was clutching at straws as\n                    counsel for the defendant had questioned Ms Ng extensively on why she did\n                    not demand that the defendant take delivery. 68     The plaintiff also relied on the fact that\n                    during “without prejudice” settlement discussions from November\n                    2009 to February 2010, Mr Yeap had offered to purchase ten buses from it.\n                    According to the plaintiff, this was an admission that there was a concluded\n                    contract. This contention is untenable. The defendant’s offer to settle\n                    was part of negotiations to resolve the dispute with the plaintiff and did not\n                    in any way, constitute an admission of the existence of the\n                Agreement. 69     For completeness, reference may be made to the\n                    defendant’s argument that the agreement under which the plaintiff\n                    appointed TM Motor as its sales and marketing representative to sell the buses\n                    for the plaintiff, showed that the 40 buses could not have already been sold to\n                    the defendant. This argument is not sustainable. There was ample evidence that\n                    the TM Motor agreement was not approved by Mr Chay and Ms Ng.\n                    Furthermore, the evidence of Mr Yeap on this issue was inconsistent with\n                    that of Mr Cheong. The discrepancies suggest that the TM Motor agreement\n                    was fabricated. However, this does not detract from the fact that the terms of\n                    the Agreement were uncertain. 70     It is convenient at this stage to deal with\n                    the plaintiff’s criticisms of Mr Yeap’s evidence. Although, as\n                    I indicate below, there were difficulties in his evidence in regard to the price\n                    of the two buses that the defendant ended up buying from the plaintiff, I do not\n                    think that those problems affect the veracity of his evidence in relation to the\n                    Agreement. It must be remembered that at the material timeiebetween late 2007 and the end of January 2008, Mr Yeap\n                    had a dual role in that he was simultaneously a director of the plaintiff and of\n                    the defendant. His discussions with Mr Chay on the desirability of\n                    importing and selling CNG buses have to be considered in that context and it\n                    also has to be remembered that the defendant itself was not at that time an\n                    owner or operator of buses, nor did it want to take on this role. Mr Yeap\n                    emphasised that he did not have the skills to run a bus operator. Instead its\n                    business was to manage a fleet owned by its sub-contractors. Whilst through\n                    Yellow Bus and C&A, Mr Yeap did have an interest in buses (in the sense\n                    that those two companies owned buses) those companies were sub-contractors and\n                    their operations were run by Ms Tan and her brothers. The connection\n                    between the defendant and these companies in having common shareholders and\n                    directors did not make the defendant a bus owner. Mr Yeap was steadfast and\n                    consistent in his evidence throughout cross-examination that he wanted the\n                    plaintiff to import the buses because he thought that there was a good\n                    opportunity to sell them to the sub-contractors (and in this he did not exclude\n                    Yellow Bus or C&A) to replace aging diesel buses for the operation of the\n                    bus services to SAS since SAS was keen on using CNG buses. This would be of\n                    benefit to the defendant which had convinced SAS of the desirability of using\n                    CNG buses and it was also clear in 2007 (when he had first conceived this idea)\n                    that these buses would be a cheaper alternative to replace the diesel buses that\n                    the sub-contractors were then utilising for the SAS contract. 71     The plaintiff has the onus of proof in regard\n                    to the existence and terms of the Agreement. Having considered all the evidence,\n                    I find that the plaintiff has not been able to discharge this onus. I am not\n                    satisfied that the defendant agreed to buy CNG 40 buses from the plaintiff. I\n                    think that Mr Yeap may have represented to Mr Chay that if the buses\n                    were bought by the plaintiff he would be able to easily procure their resale to\n                    the sub-contractors and other bus operators in the Singapore market. It was not,\n                    however, the plaintiff’s case that either Mr Yeap or the defendant\n                    had undertaken to conclude sub-sales of all these buses such that it was\n                    responsible for the buses. The plaintiff’s case was a simple one –\n                    that the defendant had agreed to itself buy all 40 buses. The plaintiff has not\n                    proved that contract.",
        "What does the defendant have to pay for the two buses it\n                purchased?": "72     The plaintiff’s case is that the price\n                    of the two buses that the defendant purchased was as stated in the official\n                    invoices dated 5 May 2009 and 9 July 2009. The defendant has not paid the total\n                    sum due in respect of either of the invoices and, if they reflect the agreed\n                    position, the defendant still owes the plaintiff an amount of\n                $79,820. 73     The defendant did not dispute the authenticity\n                    of the invoices. Its case was that the two Written Agreements dated 20 April\n                    2009 and 27 May 2009 respectively had reduced the amounts payable to the\n                    plaintiff in respect of the buses as they provided for a “showroom\n                    discount” and an “overtrade discount” for the two buses.\n                    These Written Agreements were allegedly signed by Mr Cheong on the\n                    plaintiff’s behalf and by Ms Ng on the defendant’s behalf.\n                    According to the defendant, the “overtrade discount” was given on\n                    the condition that the two buses were to be used as “showroom”\n                    buses for potential buyers to test drive them since the plaintiff did not have\n                    any “showroom” buses for potential buyers to test drive. The\n                    defendant had paid the plaintiff the full prices of both buses as reduced by the\n                    two discounts. 74     The plaintiff contended that the Written\n                    Agreements were fabricated and were, in any event, unenforceable because the\n                    arrangements were illegal. It also argued that the evidence given on behalf of\n                    the defendant in relation to the Written Agreements was inconsistent and\n                    unreliable. 75     There is much force in the plaintiff’s\n                    submissions on this point. First, when Mr Cheong sent an e-mail to\n                    Ms Ng on 29 May 2009 after both the Written Agreements had allegedly been\n                    concluded, he calculated the GST payable for the first CNG bus on the basis of\n                    the price reflected in the official invoice and not on the basis of the price\n                    stated in the relevant Written Agreement. When asked to explain why he did so,\n                    Mr Cheong stated that he deliberately calculated the GST on the basis of an\n                    undiscounted price as the parties wanted to get a higher loan but he\n                    acknowledged that he would not, as a buyer, pay GST on an undiscounted price.\n                    His explanation was not convincing. 76     Mr Cheong damaged the defendant’s\n                    case further when he changed his evidence on the stand. Although he testified\n                    that the Written Agreements were signed around 20 April and 27 May 2009, he\n                    subsequently admitted that he saw the Written Agreements for the first time on\n                    29 May 2009 and that they had been backdated. However, this was inconsistent\n                    with Ms Tan’s evidence that the Written Agreements were signed during\n                    two separate meetings in April and May 2009. 77     To add confusion to the defendant’s\n                    case, Mr Yeap had an altogether different version of events. He testified\n                    that the Written Agreements first surfaced in an e-mail chain between himself\n                    and Mr Cheong. He admitted that the Written Agreements were not forwarded\n                    to Ms Ng and Mr Chay. During the trial, he conceded that the official\n                    invoice for the first CNG bus reflected the position as at 5 May 2009, in which\n                    case, the official invoice would have superseded the alleged Written Agreement\n                    for that bus. 78     The defendant has not been able to convince me\n                    that the Written Agreements were authorised and agreed to by either Mr Chay\n                    or Ms Ng. I accept their evidence that Mr Cheong was not the\n                    plaintiff’s sales manager and had no authority to negotiate on price. As a\n                    director of the plaintiff at the material time, Mr Yeap must have been\n                    aware of this. 79     Accordingly, the prices of the two buses would\n                    be as stated in the plaintiff’s original invoices and the defendant still\n                    owes the plaintiff a total of $79,820 for the same.",
        "Conclusion": "80     For the reasons given above, the\n                    plaintiff’s claim that the defendant agreed to buy 40 CNG buses from it\n                    must fail. The plaintiff will, however, have judgment against the defendant for\n                    the sum of $79,820 in respect of the outstanding balance due for the two buses.\n                    The defendant shall also pay the plaintiff interest at the court rate on the\n                    outstanding sum from the date of filing of the writ herein. As the plaintiff has\n                    only been partially successful in its action against the defendant, I will hear\n                    the parties on costs."
    }
}