{
    "case_title": "Law Society of Singapore\n      v\n      Gopalan Nair (alias Pallichadath Gopalan Nair)",
    "ncitation": "[2011] SGHC 191",
    "coram": "Tan Lee Meng J; \n      Tay Yong Kwang J; \n      Lee Seiu Kin J",
    "sections": {
        "Introduction": "1       The Law Society of Singapore (“the Law\n                    Society”) applied under s 82A(10) of the Legal Profession Act\n                    (Cap 161, 1990 Rev Ed) (“the LPA”) for an order that the\n                    defendant, Mr Gopalan Nair alias Pallichadath Gopalan Nair\n                    (“GN”), be “struck off the roll, prohibited from applying\n                    for a practising certificate, censured and/or otherwise punished” for\n                    misconduct unbefitting of an advocate and solicitor as an officer of the Supreme\n                    Court or as a member of an honourable profession. We ordered that GN be struck\n                    off the roll and now give the reasons for our decision. 2       GN, who was admitted onto the roll on\n                    10 August 1980, is a non-practising advocate and solicitor of the Supreme\n                    Court of Singapore. He is presently an American citizen residing in California,\n                    USA. 3       Although GN is a non-practising advocate and\n                    solicitor, he is still subject to the control of the Supreme Court as\n                    s 82(A)(2) of the LPA provides: All Legal Service Officers and\n                    non-practising solicitors shall be subject to the control of the Supreme Court\n                    and shall be liable on due cause shown to be punished in accordance with this\n                    section. 4       Pursuant to ss 82A(4) and (5) of the LPA,\n                    the Law Society applied inex parteOriginating\n                    Summons No 947 of 2009 for leave from the Chief Justice for an\n                    investigation to be made into a number of complaints about GN’s\n                    misconduct. On 4 September 2009, the Chief Justice appointed a Disciplinary\n                    Tribunal (“the Tribunal”) comprising Mr Toh Kian Sing SC and\n                    Mr Tan Jee Ming, under s 90 of the LPA. 5       The following 5 charges of misconduct were\n                    preferred by the Law Society against GN: 1stcharge That you on the 4thday of July\n                        2008, at or about 10.35 pm, near the junction of Bukit Timah Road and Race\n                        Course Road, Singapore, which is a public place, did use abusive words\n                        towards certain public servants, namely, police officers of the Singapore\n                        Police Force, in particular Senior Staff Sergeant Kang Wei Chain and\n                        Sergeant Noor Azhar, by shouting: (a)“Fuck off you policeman, don’t\n                                waste my fucking time. You go and do your job properly and go catch\n                                thieves and I did nothing wrong. I am waiting for the fucking\n                                taxi”; (b)“Fuck off, forget about my name, you\n                                fucking bastard. (c)“You fucking Malay\n                                bastard”. at the said police officers in the execution of their duties as such\n                        public servants, and you had thereby committed an offence punishable under\n                        section 13D(1)(a) of the Miscellaneous Offences (Public Order and\n                        Nuisance) Act, Chapter 184, for which on 5 September 2008, you\n                        were convicted and sentenced to a fine of $2,000 in default two week\n                        imprisonment, and you are hereby guilty of conduct unbefitting an advocate\n                        and solicitor as an officer of the Supreme Court or as a member of an\n                        honourable profession which warrants disciplinary proceedings against you\n                        within the meaning of section 82A(3)(a) of the Legal Profession Act\n                        (Chapter 161). 2ndcharge That you on the 4thday of July 2008, at or\n                        about 10.35 pm, near the junction of Bukit Timah Road and Race Course Road,\n                        Singapore, which is a public place, did behave in a disorderly fashion to\n                        wit, by gesticulating with your hands and shouting loudly, and you had\n                        thereby committed an offence punishable under section 20 of the\n                        Miscellaneous Offences (Public Order and Nuisance) Act, Chapter 184,\n                        for which on 5 September 2008, you were convicted and sentenced to a\n                        fine of $1,000 in default one week imprisonment, and you are hereby guilty\n                        of conduct unbefitting an advocate and solicitor as an officer of the\n                        Supreme Court or as a member of an honourable profession which warrants\n                        disciplinary proceedings against you within the meaning of\n                        section 82A(3)(a) of the Legal Profession Act (Chapter 161). 3rd charge That you in your blog post at\n                        http://singaporedissident.blogspot.com dated 29 May 2008 entitled\n                        “Singapore, Judge Belinda Ang’s Kangaroo Court”, did\n                        make the following offending statement insulting the judiciary of Singapore,\n                        namely, the Honourable Justice Belinda Ang: “The judge Belinda Ang was throughout prostituting herself\n                            during the entire proceedings by being nothing more than an employee of\n                            Mr Lee Kuan Yew and his son and carrying out their\n                            orders.” and you had thereby committed an offence punishable under section 228\n                        of the Penal Code, Chapter 224, for which on 17 September 2008,\n                        you were convicted and sentenced to 3 months imprisonment, and you are\n                        hereby guilty of conduct unbefitting an advocate and solicitor as an officer\n                        of the Supreme Court or as a member of an honourable profession which\n                        warrants disciplinary proceedings against you within the meaning of\n                        section 82A(3)(a) of the Legal Profession Act (Chapter 161). 4thcharge That you in your blog post at\n                        http://singaporedissident.blogspot.com dated 28 November 2008 entitled\n                        “Hello from Freemont, near San Francisco, California”, did\n                        make the following offending statement amounting to contempt of\n                        court: “…. I am defying the undertaking that I gave in court on\n                            September 12, 2008 when I admitted being in contempt of court. .. I had\n                            also given an undertaking to remove the 2 blog posts, of Sept 1 2008 and\n                            Sept 6, 2008 which referred to my trial and conviction before Judge\n                            James Leong in the Subordinate Courts for disorderly behaviour and\n                            insulting a policeman, charges entirely made up by the police to\n                            discredit me. I will be re-posting those 2 blog posts and stand by every\n                            word that I had written in them …” (Sic). and you are hereby guilty of conduct unbefitting an advocate and solicitor\n                        as an officer of the Supreme Court or as a member of an honourable\n                        profession which warrants disciplinary proceedings against you within the\n                        meaning of section 82A(3)(a) of the Legal Profession Act (Chapter\n                        161). 5thcharge That you in your blog post at\n                        http://singaporedissident.blogspot.com dated 30 November 2008 entitled\n                        “Justice Judith Prakash, Another Kangaroo Judge”, did make the\n                        following offending statement insulting the judiciary of Singapore, namely,\n                        the Honourable Justice Judith Prakash: “Judge Judith Prakash of the Singapore High Court has\n                            prostituted herself in the hearing of the Kangaroo T shirt case on\n                            November 24, 2008 by being nothing more than an employee of Lee\n                            Kuan Yew and his son, whom he appointed Prime Minister. By her actions\n                            in sending these young men to prison and making them pay crippling court\n                            costs of $5,000 each, she has shamelessly disgraced herself, her office\n                            as a judge, disgraced the Singapore Constitution and disgraced\n                            Singapore.” and you are hereby guilty of conduct unbefitting an advocate and solicitor\n                        as an officer of the Supreme Court or as a member of an honourable\n                        profession which warrants disciplinary proceedings against you within the\n                        meaning of section 82A(3)(a) of the Legal Profession Act\n                        (Chapter 161). 6       GN sent, by way of emails to the Disciplinary\n                    Tribunal Secretariat, his Defence and his Amended Defence on 1 December\n                    2009. However, although he knew that his case was being heard by the Tribunal on\n                    20 and 21 September 2010, he did not appear for the hearing. 7       The Tribunal found GN guilty of all 5 charges\n                    brought against him and determined that there was cause of sufficient gravity\n                    for disciplinary action to be taken against him. The Chief Justice then\n                    appointed Mr Peter Low, the plaintiff’s counsel, under s 82A(10)\n                    of the LPA to make the present application in Summons No 1404 of\n                2011.",
        "Decision of the Court": "8       GN did not attend and was not represented by\n                    counsel at the hearing before this Court on 25 July 2011.The Court was\n                    satisfied that he had been duly served the requisite papers and that he was\n                    fully aware of the hearing scheduled for 25 July 2011. 9       The issues before this Court were whether due\n                    cause for disciplinary action against GN under s 82A(3)(a) of the LPA had\n                    been shown and if so, the appropriate penalty to be imposed on\n                him.",
        "Due cause": "10     As for what constitutes “due\n                    cause”, the relevant part of s 82A(3) provides: Such due cause may be shown by proof that a Legal Service Officer or a\n                        non-practising solicitor, as the case may be — (a)has been guilty in Singapore or elsewhere of such\n                            misconduct unbefitting a Legal Service Officer or an advocate and\n                            solicitor as an officer of the Supreme Court or as a member of an\n                            honourable profession ... 11     The Law Society rightly submitted that for the\n                    purpose of considering whether there has been“misconduct unbefitting an advocate and solicitor as an\n                    officer of the Supreme Court or as a member of an honourable profession”\n                    under s 82(3)(a) LPA, the meaning accorded to the identical phrase in\n                    s 83(2)(h) LPA should be adopted. As such, both misconduct in the\n                    solicitor’s professional capacity as well as misconduct in the\n                    solicitor’s personal capacity are relevant to this inquiry (seeLaw Society of Singapore v Heng Guan Hong Geoffrey[1999] 3 SLR(R) 966 at [24]). The\n                    same standard applies to non-practising lawyers. 12     The Law Society relied on the findings of the\n                    Tribunal to support its assertion that “due cause”, as defined in\n                    s 82A(3)(a) of the LPA, had been shown. 13     The 1stand\n                        2ndcharges against GN concerned his conviction\n                    with respect to two offences under s 13D(1)(a) and s 20 of the\n                    Miscellaneous Offences (Public Order and Nuisance) Act (Cap 184,\n                    1997 Rev Ed) for uttering vulgarities when speaking to officers of the\n                    Singapore Police Force and for behaving in a disorderly manner towards the\n                    police officers who had enquired why he had knocked a number of times on a\n                    police vehicle bearing the registration number QX501H. The gravity of his use of\n                    abusive and obscene language was stressed by the Tribunal in its report at\n                    [28]-[29]: 28    It is clear beyond reasonable doubt … that\n                            the Respondent uttered vulgarities towards the two policemen after he\n                            was stopped by them.All this happened in a public place in the full\n                            glare of members of the public. [T]he Respondent behaved in a petulant\n                            manner and apparently took grave offence when he was stopped by the\n                            police. His reaction was entirely unprovoked. Even if the Respondent was\n                            unhappy about being questioned by the police, he should have acted with\n                            self-restraint and moderation. In the entire episode, he displayed\n                            neither virtue. If he had responded to the questions in a co-operative\n                            manner, his subsequent arrest could possibly have been avoided. In our\n                            view, these vulgarities which the Respondent spewed were not only\n                            profoundly offensive, but also had the effect of lowering the dignity\n                            and professionalism of law enforcement officers. 29    We further find theracist\n                                outburstdirected at Sergeant Daud to be wholly\n                            reprehensible and deserving of condemnation in a multi-racial society\n                            like Singapore. It demonstrates a callous, unpardonable disregard for\n                            the sensitivities of the different races that make up our society. It is\n                            not behaviour that one would expect of a member of the legal\n                            profession. [emphasis added] 14     In regard to his disorderly behaviour in the\n                    presence of the police, the Tribunal noted at para [39] of its report: 39    Creating a ruckus in a public place, gesticulating\n                            wildly (even if a non-threatening manner), spewing vulgarities towards\n                            public officers shows a very low level of restraint and self-control as\n                            well as a complete lack of respect for law enforcement officers. Simply\n                            put, the Respondent had made a complete nuisance of himself in public.\n                            The fine of $1000 (or one week imprisonment in default thereof) may be\n                            marginally less serious as compared with the Respondent’s\n                            offence in MAC 3211.Nevertheless, such unruly, petulant and disorderly\n                            conduct (in full view of the public) is unfitting of an advocate or\n                            solicitor as an officer of the Court and as a member of a honourable\n                            profession. After all, a solicitor is expected to exercise a high level\n                            of self restraint and a bad tempered solicitor can only bring disrepute\n                            to the legal profession. 15     As for the breach of the undertaking referred\n                    to in the 4thcharge, the background for the\n                    undertaking given by GN is as follows. When the case regarding GN’s abuse\n                    of the policemen, as outlined in the 1stand\n                        2ndcharges pressed by the Law Society against\n                    him, was heard before District Judge James Leong (“DJ Leong”), GN\n                    made several offending statements in open court. For instance, on 25 August\n                    2008, he said: ... I franklydo not have any faith or belief that I\n                            will get a fair trial in this Court. Any attempt on my part\n                        to recall these witnesses would only be a waste of my time since I believe\n                        the result will be the same in any event. 16     Subsequently, GN authored two blog posts dated\n                    1 September 2008 and 6 September 2008 on http://singaporedissident.blogspot.com.\n                    These were entitled, “Another classic case of trying\n                        to use the courts to silence dissent” and\n                        “Convicted” respectively and\n                    were replete with statements which attacked DJ Leong. For instance, he\n                    stated: As for Mr. James Leong, I have this to say. I have begun to know him\n                        pretty well since it took 18 days of trial. He is a good man at heart; there\n                        is no doubt about it. If he had his way, there is no doubt he would have\n                        acquitted me immediately. But alas he is weak. He cuts a pathetic figure. A\n                        man, because of his circumstances, having to do things that he does not\n                        really want to do. He knows that his employment as a judge in the Singapore\n                        courts depends on the patronage of Lee Kuan Yew and his friends. He also\n                        knows that Lee Kuan Yew demands his judges to punish political opponents of\n                        the government. And therefore to keep his job as a judge, he has no choice\n                        but to find me guilty.... 17     GN’s statements prompted the\n                    Attorney-General to make an application under Originating Summons No 385 of 2008\n                    for an order of committal for contempt. When the hearing commenced on\n                    12 November 2008 before District Judge Leslie Chew (“DJ\n                    Chew”), GN admitted that he had made the offending statements, apologised\n                    for his behaviour and gave an undertaking to the Court not to make similar\n                    offending statements and to remove the blog posts dated 1 September 2008\n                    and 6 September 2008. As such, DJ Chew only reprimanded him and ordered him\n                    to pay the costs of the proceedings. As soon as GN left Singapore and returned\n                    to California, he breached his undertaking to the Court. 18     What was truly unacceptable was that GN\n                    subsequently declared that he never had any intention of abiding by his\n                    undertaking and that he deliberately breached the undertaking at the first\n                    opportunity. The Tribunal stated as follows at [62]: By flagrantly flouting his undertaking to the court in such a defiant\n                        manner, the Respondent displayed absolutely no remorse or contrition for\n                        what he had done prior to leaving Singapore for the United States. He was\n                        simply trying to make a mockery out of the entire affair. The apology he\n                        made and the undertaking he gave were both quickly withdrawn once he was\n                        safely out of Singapore. Clearly the apology and undertaking was an\n                        expedient way to a lighter sentence – the Respondent by his own\n                        admission, never intended or believed in either. 19     As for the offensive blog post regarding\n                    Belinda Ang J on 29 May 2008, which was the subject matter of the\n                        3rdcharge, that blog post was in the context of\n                    a defamation suit brought by Prime Minister Lee Hsien Loong against the\n                    Singapore Democratic Party. For this charge of contempt of court, GN was\n                    sentenced to three months’ imprisonment by Kan Ting Chiu J. The\n                    sentence meted out gave a clear indication of the seriousness of the\n                    contempt. Yet, in his blog post in relation to Judith Prakash J on\n                    30 November 2008, who had, at the material time, found a number of persons\n                    in contempt of court for wearing T-shirts depicting a kangaroo in judges’\n                    robes, GN continued to abuse the judiciary. 20     After taking all the circumstances into\n                    account, we found that the Law Society had shown that there was due cause for\n                    disciplinary action to be taken against GN. As such, we proceeded to consider\n                    the penalty that ought to be imposed.",
        "The appropriate penalty": "21     Disciplinary action is intended to punish the\n                    errant solicitor for his or her misconduct, deter others from misbehaving in the\n                    same manner, and protect public confidence in the administration of justice: seeLaw Society of Singapore v Tham Yu Xian Rick[1999] 3 SLR(R) 68 (at [18]) andLaw Society of Singapore v Rasif David[2008]\n                    2 SLR(R) 955 (at [28]). 22     Although GN had been convicted of a number of\n                    offences, which were referred to in the charges preferred against him by the Law\n                    Society, it should be borne in mind that inLaw Society of\n                        Singapore v Wee Wei Fen[1999] 3 SLR(R) 559, the Court\n                    observed (at [25]) that it cannot be\n                    that every violation of the criminal law implies a defect of character which\n                    renders the offender unfit to be a member of the legal profession and that the\n                    nature of the offence is clearly material. Similarly inLaw\n                        Society of Singapore v Wong Sin Yee[2003]\n                    3 SLR(R) 209, the Court stated (at [12]): We would, at the outset, make it quite clear that conviction of criminal\n                        offence does notper seimply a defect of\n                        character rendering an advocate and solicitor unfit for his profession.It is the nature of the offence, and the\n                            circumstances under which it was committed, and in turn the punishment\n                            imposed, which are likely to be determinative….The offence must be of such a nature that it is\n                            expedient for the protection of the public and the preservation of the\n                            good name of the profession to remove the solicitor from the roll or\n                            from practice. [emphasis added] 23     The offences in respect of which GN had been\n                    convicted and the circumstances under which they were committed lead to the\n                    conclusion that a serious penalty must be imposed. Apart from abusing the police\n                    with foul language in public and behaving in a disorderly manner in the presence\n                    of the police, GN was imprisoned for contempt of court in relation to his blog\n                    post regarding Belinda Ang J on 29 May 2008.Furthermore, he openly\n                    defied the undertaking he had given to the District Court shortly after he was\n                    convicted by Kan J for contempt of court. He then posted offensive\n                    statements in his blog about Prakash J on 30 November\n                2008. 24     When considering whether or not to strike an\n                    advocate and solicitor off the rolls, it is worth noting that inLaw Society of Singapore v Amdad Hussein Lawrence[2000]\n                    3 SLR(R) 23, the Court held at [11]: The earlier decisions inLaw Society of\n                            Singapore v Ravindra Samuel[1999] 1 SLR(R) 266 at\n                            [15];Law\n                            Society of Singapore v Tham Yu Xian Rick(at [18];Law Society of\n                            Singapore v Suresh Kumar Suppiah[1999]\n                        2 SLR(R) 1203 at [18]; andLaw Society of Singapore v Heng Guan Hong\n                            Geoffrey[1999] 3 SLR(R) 966 at [28]-[29] have consistently affirmed and applied the following\n                        principles on disciplinary sentencing: (a)    where a solicitor has acted dishonestly, the\n                                court will almost invariably order that he be struck off the roll of\n                                solicitors; (b)    if he has not acted dishonestly, but is shown\n                                to have fallen below the required standards of integrity, probity\n                                and trustworthiness,he will nonetheless be\n                                    struck off the roll, as opposed to being suspended, if his lapse\n                                    is such as to indicate that he lacks the qualities of character\n                                    and trustworthiness which are the necessary attributes of a\n                                    person entrusted with the responsibilities of a legal\n                                    practitioner. [emphasis added] 25     In the present case, the relevant question is\n                    whether or not GN should be struck off the roll on the basis that he lacked the\n                    necessary attributes of a person entrusted with the responsibilities of a legal\n                    practitioner. After taking all the charges into account, we were of the view\n                    that he lacked the said attributes. In particular, the facts in the\n                        3rd, 4thand\n                        5thcharges disclosed a contemptuous disrespect\n                    on the part of GN towards the judges concerned. Such egregious misconduct is\n                    totally unacceptable. As there were no mitigating circumstances to persuade us\n                    that he merited a less severe penalty than striking off the roll, we\n                    ordered that he be struck off the roll of advocates and solicitors of the\n                    Supreme Court of Singapore and awarded costs to the Law Society."
    }
}