{
    "case_title": "Shaik Abu Bakar Bin Abdul Sukol \n      v\n      Saag Oilfield Engineering (S) Pte Ltd and another",
    "ncitation": "[2012] SGHC 251",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "My decision": "9       The Worksite was a “workplace” under the Act, a term defined in s 5(1) as “any premises where a person is at work or is to work ... and includes a factory”. It is also a factory, defined in s 5(2)(a)(iii) as “any premises within which persons are employed in ... the repair, construction or manufacturing of any vessel or vehicle”. The Act imposes certain duties on the occupier of a workplace. This is spelt out in s 11 which provides as follows: 11.  It shall be the duty of every occupier of any workplace to take, so far as is reasonably practicable, such measures to ensure that — (a)    the workplace; (b)    all means of access to or egress from the workplace; and (c)    any machinery, equipment, plant, article or substance kept on the workplace, are safe and without risks to health to every person within those premises, whether or not the person is at work or is an employee of the occupier. 10     The facts showed that the second defendant is clearly in breach of his statutory duty under s 11 of the Act. However this provision was not pleaded in the statement of claim. The plaintiff’s counsel applied to amend the statement of claim on 8 May 2012 when counsel appeared before me to make oral submissions after the trial. This was opposed by counsel for the second defendant on the ground that the 3-year limitation period for personal injury had passed. I therefore disallowed the application to amend. As the breach of statutory duty must be specifically pleaded, this ground could not aid the plaintiff’s case against the second defendant. The plaintiff’s pleaded ground against the second defendant was in respect of s 12(1) of the Act. However s 12(1) pertains to an employer-employee relationship and as the second defendant was not the plaintiff’s employer, this pleaded ground was not relevantvis-à-visthe second defendant. 11     Nonetheless, the facts of this case clearly supported a finding of negligence against the second defendant in my view. The second defendant was the occupier of the Worksite, in which many subcontractors operate to build a complex multi-million dollar oil rig within a tight timeframe. There were many possible dangerous situations in such circumstances; indeed the second defendant had dedicated a team of safety officers to ensure that the place was safe for all to work. In the circumstances, the second defendant owed a duty of care to all persons who worked at the Worksite. The evidence of Tang showed that the second defendant had anticipated the inherent dangers from certain types of works such as hot work and lifting works. The second defendant had in fact required such works to be inspected beforehand and certified safe to be proceeded with. The dangers were not only foreseeable but actually foreseen. There was no doubt that, on the day in question, there was scaffolding installed at the lifting site which was not just a potential, but an actual obstruction to the lifting works. Tang said that the site was inspected a few days earlier by his safety officer and certified safe for lifting works. If the scaffolding had been present when the inspection was carried out, the certification ought not to have been made. If the scaffolding had been installed after the inspection, the scaffolding clearly ought not to have been permitted to be installed in that manner, or it should have been installed only after the lifting works had been completed. The second defendant had therefore breached its duty of care to the plaintiff by permitting the lifting works to proceed. As the plaintiff was injured due to the lifting work, I held that the second defendant was liable to the plaintiff for damages resulting from the injury. 12     However I was also of the view that the plaintiff had failed to exercise due care in carrying out his work, in particular, in failing to wear gloves which he knew he was required to wear. Had he done so, the extent of his injury may not have turned out to be as serious. In view of this, I held that the plaintiff was contributorily negligent to the extent of 50%. I therefore gave judgment for the plaintiff against the second defendant for 50% of the damages to be assessed by the Registrar, with costs reserved to him."
    }
}