{
    "case_title": "Ong Chee Eng\n      v\n      Public Prosecutor",
    "ncitation": "[2012] SGHC 115",
    "coram": "Chao Hick Tin JA",
    "sections": {
        "Facts": "6       The appellant is a 44 year\n                    old man. He has two daughters. The elder is studying in a\n                    Polytechnic and the younger has been diagnosed with\n                    Attention Deficit Hyperactivity Disorder. The\n                    appellant’s wife recently underwent an operation for\n                    cervical cancer. He is the sole breadwinner for his family.\n                    His parents are old and ill – his father has high\n                    blood pressure and diabetes and his mother has recurrent\n                    psychiatric issues. The appellant was unemployed at the time\n                    of his arrest and had previously worked in sales for the\n                    high-end fashion stable Club21. He has an otherwise\n                    crime-free record. 7       According to the appellant,\n                    his troubles began when he agreed to guarantee a\n                    friend’s loan from a loan shark. His friend fled\n                    Singapore without paying. It appears that the appellant was\n                    initially able to service the loan, but in October 2010 he\n                    was retrenched from his sales job. He sought help from the\n                    Chinese Development Assistance Council and from his Member\n                    of Parliament (“MP”), but could not find a\n                    job. To repay the outstanding loan, he began borrowing from\n                    other loan sharks. To pay these new debts, he took on even\n                    more loans. In half a year’s time, the amount of money\n                    he owed to the loan sharks escalated from $5,000 to $13,000.\n                    To repay them he decided to sell his Housing and Development\n                    Board (“HDB”) flat. But it took some time for\n                    the sale of the flat to be completed, and by the time of\n                    completion his loans had ballooned to $40,000, owed to some\n                    30 different loan sharks. At this time, he was advised by\n                    his friends to run and leave the new homebuyer to face the\n                    loan sharks’ wrath. The appellant did not take his\n                    friends’ advice even though he could not pay the loans\n                    in full. Only $30,000 was available from the sale proceeds\n                    to repay the loans (presumably he downgraded to a smaller\n                    flat). He was still unemployed and still short of\n                    $10,000. 8       Options running out, he\n                    started working for the loan sharks in May 2011. The victim\n                    had now turned terror. But according to him he was a\n                    harasser with a heart, acting with reluctance and regret. He\n                    never harassed a house if he saw a sign stating that the\n                    debtors had already moved out. He diluted the paint with\n                    turpentine in the ratio of 1:1 so it could be easily wiped\n                    away. He splattered only half a plastic cup’s worth of\n                    paint to minimise the occupants’ trouble of cleaning\n                    up. He wrote on the walls with a non-permanent white board\n                    marker so the intimidating scrawls could be removed with a\n                    wet cloth. As for the fires he started, he refrained from\n                    using highly flammable fuel like kerosene. Instead, he used\n                    Zippo lighter fluid that burned out quickly. He would splash\n                    a small amount of lighter fluid and ignite it with lighted\n                    tissue paper. The fire would die out in about five seconds,\n                    and he always stayed behind to ensure that it did not burn\n                    for long. It was true that three of the five fire incidents\n                    were done in the dead of night, but the appellant said that\n                    he was there to ensure that the fire would not get out of\n                    hand. Once, he had even moved a shoe rack for fear that he\n                    might accidentally set it alight. The Prosecution did not\n                    say that the damage caused by the fires lit by the appellant\n                    had resulted in anything more serious than minor burn marks\n                    on the door. None of the five police reports made by the\n                    victims of his harassments by fire mentioned major damage\n                    caused by the fires. One occupant did not even say that a\n                    fire had been lit. Another mistook the ashes from the fire\n                    as the result of someone burning incense paper outside his\n                    home. The money was good – about $70 for a paint job,\n                    and $300 for a fire job. With more than 70 instances in\n                    slightly over a month, he seemed to be in a hurry. His\n                    target premises ranged from Pasir Ris to Jurong West. No job\n                    seemed too far for him. 9       His luck ran out on\n                    13 June 2011 when the police caught up with him in Toa\n                    Payoh. Earlier in the day, he had just been out splashing\n                    paint on a flat in Tampines. Arrested with the paraphernalia\n                    of a loan shark hitman, he could not deny his guilt. In any\n                    event, he said he was filled with relief at finally being\n                    stopped. Eager to make amends, he started confessing to\n                    instances of harassment that the police would otherwise\n                    never have been able to pin on him. Just as his loan debt\n                    had escalated, the charges against him swelled – from\n                    fewer than five to 72. As the number of charges ballooned\n                    due to his confessions, his difficulties with the law\n                    deepened. What began as a favour for a friend had now\n                    snowballed into multiple grave breaches of the law on his\n                    part. Lacking money to engage a lawyer, he appeals in\n                    person. He recognised that he had done grave wrongs and\n                    ought to be appropriately punished, but he urged the court\n                    to look at the entire circumstances of the case and to show\n                    mercy.",
        "Parliament’s intended approach towards loan\n                shark offences": "10     The High Court has, inPublic Prosecutor v Nelson Jeyarajs/o Chandran[2011] 2 SLR 1130 (“PP v\n                        Nelson Jeyaraj”) at [38]–[40], referred to\n                    Parliament’s rationale in enhancing the penalties for\n                    loan shark related offences. This was to more effectively\n                    stem the rise of loan shark activities that were causing\n                    public disquiet. What is notable is that Parliament has\n                    prescribed mandatory imprisonment and caning even for\n                    first-time offenders. In the light of the severity of the\n                    mandatory sentences, I have no doubt that Parliament’s\n                    intention is to strongly deter the commission of loan shark\n                    offences. But this is not to say Parliament has declared\n                    indiscriminate war on loan shark harassers. Indeed, the\n                    Parliamentary debates show that deterrence is just one\n                    aspect of a sophisticated and holistic solution, sensitively\n                    tailored to the complex causes of loan shark offences, with\n                    discerning sympathy for those involved – victim or\n                    harasser.",
        "Loan shark offences – a complex species of\n                crime": "11     Loan shark offences occur\n                    almost exclusively within the margins or fringes of society,\n                    involving the poor and vulnerable who desperately need loans\n                    but cannot get them from legitimate sources. Parliament has\n                    recognised that the root cause of loan shark offences is the\n                    fact that the poor and non-creditworthy are unable to get\n                    loans from legal sources. When loans go unpaid, harassment\n                    begins. Nominated MP Assoc Prof Paulin Tay\n                    Straughan highlighted this aspect of loan shark offences\n                    during the second reading of the Moneylenders (Amendment)\n                    Bill 2010 (“the Bill”) (Singapore Parliamentary Debates,Official Report(12 January\n                    2010) vol 86 at col 2101) and here I quote\n                    her: ... I have been sitting there and trying to understand\n                        what would drive a person to turn to a loanshark for\n                        money? It must be out of sheer desperation ... Many in\n                        this category, I suspect, will not have a strong\n                        informal social support. So to say that they should turn\n                        to family and friends is pretty much telling them to go\n                        down a blind alley. So, as a society, I hope that we\n                        will continue to put effort into creating legitimate\n                        formal sources of help for the vulnerable group in our\n                        community. 12     Addressing the root cause\n                    of loan shark offences ultimately requires socio-economic\n                    and political decisions that lie outside the courts’\n                    remit. For example, it is only Parliament that can decide\n                    how much welfare the poor should receive, or how widespread\n                    and available licensed moneylending should be. The problem\n                    of loan shark offences also has to be seen from many angles.\n                    Some borrow from loan sharks to repay gambling debts. Youths\n                    are lured by easy money into harassing loan shark debtors.\n                    Others borrow from such illegal sources to meet a need due\n                    to retrenchment or some other personal misfortune. MP Seah\n                    Kian Peng during the Parliamentary debates (Singapore Parliamentary Debates,Official Report(12 January 2010) vol 86 at col 2112) very perceptively\n                    observed that fighting loan shark offences may be like\n                    squeezing a balloon: the air/problems simply go somewhere\n                    else.",
        "Parliament’s solution is holistic": "13     Parliament has chosen to\n                    squeeze the balloon with a multi-pronged approach. For\n                    example, the Ministry of Home Affairs has set up a\n                    specialised department within the Police Force to fight the\n                    loan shark syndicates; measures have been taken to freeze\n                    the suspected assets of loan sharks; restrictions on\n                    licensed moneylending have been eased to widen the\n                    availability of funds to the poor; youth community outreach\n                    programs have been initiated; and community financial\n                    assistance has been increased. Deterrence in the form of\n                    severe mandatory sentences is just one facet of this\n                    multi-faceted solution. The legislature is alive to the fact\n                    that when the majority of loan shark offences are committed\n                    by the vulnerable, there is a limit as to how much sheer\n                    punishment can achieve.",
        "A group that is especially vulnerable": "14     There is a class of people\n                    whom Parliament has recognised as especially vulnerable.\n                    These are the people who turn to loan sharks not to pay off\n                    their gambling debts, but because of genuinely desperate\n                    needs (egsomeone in a family\n                    that is barely making ends meet is unexpectedly\n                    hospitalised). MP Hri Kumar observed (Singapore Parliamentary Debates,Official Report(12 January\n                    2010) vol 86 at col 2066): Most people do not go to illegal moneylenders and pay\n                        those blood-sucking rates because they want to. They are\n                        desperate. Borrowing from banks ... is reserved for\n                        those who are creditworthy. The typical customer of an\n                        illegal moneylender is not. His need for money may,\n                        however, be no less real or compelling than the next\n                        person. Not everyone has family or friends he can turn\n                        to for help. MP Irene Ng empathised with the plight of such\n                    people when she said (Singapore\n                        Parliamentary Debates,Official Report(12 January 2010)\n                    vol 86 at col 2089): If they could not turn to loansharks, in their depths\n                        of anguish and desperation, they may be driven to other\n                        actions for money, such as crime – which could be\n                        mugging or robbery; for women, it could be prostitution;\n                        and for others, perhaps, even suicide. 15     Then Senior Minister of\n                    State for Home Affairs, Assoc Prof Ho Peng Kee, agreed and\n                    acknowledged that (Singapore\n                        Parliamentary Debates,Official Report(12 January 2010)\n                    vol 86 at cols 2119–2120): [n]ow, as many MPs have highlighted ... there are\n                        borrowers out there who would have a genuine financial\n                        need and some of them turn to loansharks. This group of people is not very large. But\n                    neither is their pool of options. Very often they have no\n                    choice but to borrow from their local loan sharks. In so\n                    doing, they indirectly contribute to the increase in loan\n                    shark offences. But the Minister explicitly declined for the\n                    time being to criminalise such borrowing on the basis that\n                    it might disproportionately affect the most vulnerable and\n                    desperate (Singapore Parliamentary\n                        Debates,Official\n                        Report(12 January 2010) vol 86\n                    at col 2062). 16     When the vulnerable are\n                    forced to borrow, sometimes they are unable to repay.\n                    Trapped, they are forced to turn to crime – loan shark\n                    harassment is an option. Such moral dilemmas are on stage\n                    often splashed in black and white. But reality is usually in\n                    shades of grey. The plight of the vulnerable was recognised\n                    by Parliament, and received sympathetic attention. As MP Sin\n                    Boon Ann noted (Singapore Parliamentary\n                        Debates,Official\n                        Report(12 January 2010) vol 86\n                    at col 2080): ... I think more efforts can be put in by the\n                        Government through its public education and counselling\n                        programmes. At the moment, illegal moneylending operates\n                        very much on the fringe of society. People who are\n                        involved in money lending, whether as borrowers or\n                        runners, almost to a person, I am confident to say, have\n                        personal problems that require help. At the end of the debate, Assoc Prof Ho said\n                        (Singapore Parliamentary\n                        Debates,Official\n                        Report(12 January 2010) vol 86\n                    at cols 2127–2128): Let me make this point about borrowers who have become\n                        harassers. I think there have [sic] been some sympathy raised in this\n                        House for this group and for the need to distinguish\n                        this group of borrowers who become harassers for loan\n                        sharks. First of all, what we have done in this Bill is\n                        to ensure that both groups are punished and I think\n                        rightly so both groups should be punished. And from what\n                        we have heard in this House … there is, in fact,\n                        organised crime; there is layering. Everybody plays a\n                        part. They may play different parts but because they are\n                        working in concert the pain and problem is\n                        perpetuated. The example we have used here is Hydra and the\n                        tentacles … But really, the nub of this Bill is\n                        that we want to do more to attack the source, which is\n                        the kingpins … And yet, at the same time, we have\n                        to address the ongoing problem on the ground so we have\n                        to cut off the tentacles. We have to ensure that the\n                        harassers do not perpetuate the ill intentions of the\n                        loansharks. 17     Assoc Prof Ho’s\n                    message is clear: although Parliament sympathises with\n                    debtors who turn harassers, they are still to be punished.\n                    The expression of legislative compassion nevertheless\n                    suggests that: (a) while the vulnerable are still to be\n                    punished for their role in perpetuating the loan shark\n                    scourge, theseverityof their\n                    punishment might depend on their individual circumstances;\n                    and (b) that the court will be entitled, within the range of\n                    discretion accorded under the law, to impose such punishment\n                    as is consonant with the offender’s culpability.\n                    Underlying Parliament’s empathy may be the recognition\n                    that more, perhaps, could be done by society for the group\n                    of people who have to seek help from loan sharks. As\n                    Nominated MP Audrey Wong observed (Singapore Parliamentary Debates,Official Report(12 January\n                    2010) vol 86 at cols 2099–2100): While the Government has assured Singaporeans that the\n                        poor and needy in our midst will be looked after\n                        … perhaps our current efforts to educate and\n                        reach out to the truly needy and desperate are still\n                        insufficient to help this minority of people who resort\n                        to borrowing from illegal means. As living costs\n                        continue to rise and the wages of the lowest-earning in\n                        our population may not keep pace with the inflation\n                        rate, I am concerned that we may see more financially\n                        desperate Singaporeans who may still go to loansharks or\n                        work for them despite the risks. ... As for debtors who end up working for loansharks\n                        as runners and repeat offenders – I know there are\n                        many repeat offenders who go to jail for loanshark\n                        activities and repeat their behaviour when they are out\n                        of jail – the new stricter laws may act as a\n                        deterrent but I believe the truly desperate would still\n                        continue to run the risk of the harsher punishment\n                        ... 18     Naturally the\n                    circumstances of those who help loan sharks, either as\n                    runners or harassers, are diverse. For present purposes, it\n                    suffices for me to make the point that it is important to\n                    distinguish between those who, out of genuinely desperate\n                    financial need brought about by events not within their\n                    control (egsudden sickness\n                    and prolonged retrenchment), borrow from loan sharks whom\n                    they are then forced to work for, and others who are perhaps\n                    less deserving of sympathy. For the latter category, two\n                    groups come to mind. The first are youth harassers, whom the\n                    loan sharks seem to be recruiting in increasing numbers.\n                    They are apparently lured by the easy money and the thrill.\n                    Parliament’s response to this development is, among\n                    others, to enact s 28B of the Act, which makes it an\n                    offence for anyone above 21 to procure a minor to harass\n                    debtors. Youth outreach programs have also been initiated to\n                    educate and counsel. The second group are gamblers who\n                    harass for the easy money they can obtain to repay their\n                    gambling debts.",
        "The application of deterrence in this\n                context": "19     It will be apparent from\n                    the foregoing that people who are involved in illegal\n                    moneylending activities are not a homogenous group. Neither\n                    are the offences under the Act. The kingpins are the real\n                    and prime targets of the law. But this is not to say that\n                    runners and harassers will be treated leniently. This is\n                    apparent from the severe mandatory sentences enacted by\n                    Parliament targeting loan shark harassers. These prescribed\n                    criminal penalties have been carefully and finely calibrated\n                    and appear to be based on three main pillars: (a)     mandatory\n                        imprisonment; (b)     mandatory caning where property is\n                        damaged; and (c)     a reasonably broad range of\n                        flexibility vested in the court to ensure that the\n                        punishment is proportionate. 20     The importance of\n                    flexibility is clear from Assoc Prof Ho’s exchange\n                    with MPs Arthur Fong and Calvin Cheng during the\n                    Parliamentary debates on the Bill. MP Arthur Fong advocated\n                    a zero-tolerance approach and suggested that Assoc Prof Ho\n                        (Singapore Parliamentary\n                        Debates,Official\n                        Report(12 January 2010) vol 86\n                    at cols 2083): … consider a stiffer penalty than those\n                        proposed … On section 28(1) and (2), harassing borrower …\n                        the revised penalty [is] mandatory imprisonment not\n                        exceeding five years for first offenders, I would like\n                        to urge the Minister to consider invoking a minimum\n                        imprisonment of three years not exceeding five years,\n                        and a minimum caning of two strokes, whether there is\n                        property damage or a person is hurt. For repeat\n                        offenders, to invoke a minimum imprisonment term of four\n                        years not exceeding nine years. Assoc Prof Ho rejected the suggestion, saying\n                        (Singapore Parliamentary\n                        Debates,Official\n                        Report(12 January 2010) vol 86\n                    at col 2129): ... I think the scope of punishment is sufficient for\n                        now. And this I also say in reply to ... [those] who\n                        have argued that there should be enhanced punishment for\n                        various offences. We have, like I said, drafted the\n                        provisions very carefully, calibrated, poised, quite\n                        balanced. Whether we need to do more, we will take a\n                        relook later as the provisions work out on the\n                        ground. 21     MP Calvin Cheng had also\n                    commented and asked (Singapore\n                        Parliamentary Debates,Official Report(12 January 2010)\n                    vol 86 at cols 2086–2087): My second point concerns the mandatory jail terms that\n                        individuals face. Although a mandatory jail term serves\n                        as a much higher deterrent to possible offenders, it\n                        also ties the hands of judges during sentencing,\n                        especially when considering mitigating factors.Some of these mitigating factors\n                            may be strong; for example, it is not unheard of for\n                            people in debt to these loansharks to be forced into\n                            working for them. This is especially so, given the\n                            ruthlessness of these loansharks, if these people\n                            break the law in fear for their lives or the lives\n                            of their loved ones. Judges should be allowed to\n                            consider these factors when sentencing offenders and\n                            a mandatory jail sentence may be too\n                            harshespecially in cases where the\n                        perpetrators offend under threat or fear for their\n                        lives. Will the Minister consider raising the jail terms\n                        whilst not making it mandatory? In this way, the\n                        deterrent is still increased, without restricting judges\n                        when considering mitigating factors. [emphasis\n                        added] While Assoc Prof Ho did not agree with MP Calvin\n                    Cheng’s proposal, Assoc Prof Ho shared MP Calvin\n                    Cheng’s concern about inflexibility (Singapore Parliamentary Debates,Official Report(12 January 2010) vol 86\n                    at cols 2133–2134): On mandatory punishment – I think this is the\n                        point that Mr Calvin Cheng has made – whether\n                        mandatory punishment will put a fetter on the\n                        Court’s discretion in sentencing. Actually,\n                        mandatory punishment, for example, mandatory\n                        imprisonment, it means that the Court has to jail a\n                        person. But within that power, there is a range where\n                        the Court can jail a person either for “x”\n                        years or “x plus y” years. In that sense,\n                        the Court will still have some discretion, taking into\n                        account the mitigating circumstances of the case ...\n                        Whether it removes the Court’s ability to take\n                        into account mitigating circumstances, the answer will\n                        be no, because still the Court can consider that. Many\n                        MPs, in fact, have highlighted the fact that we have\n                        imposed minimum mandatory punishment. I think as this\n                        House knows, we do not do that lightly as a government.\n                        We do it when the situation warrants it. And that is why\n                        at this point in time when we have to send a strong\n                        message, we have included some mandatory minimum\n                        punishment in the Bill, I am sure the message will sink\n                        in. 22     In applying these\n                    “tough laws”, the courts must be careful to\n                    uphold the deterrence objectives that Parliament had in mind\n                    when enacting the severe mandatory minimum punishments. But\n                    the courts must also apply the law sensitively, keeping in\n                    mind the intricate context in which deterrence works and the\n                    deliberate decision Parliament made to grant the courts some\n                    leeway in sentencing. A nuanced approach is called for, and\n                    unintended distortions in the ecosystem of measures\n                    Parliament has structured should be avoided.",
        "The present appeal": "23     A key feature in the\n                    administration of criminal justice is that, within the range\n                    or confines of the criminal sanctions prescribed by law for\n                    an offence, the punishment imposed should fit the crime and\n                    the criminal. Hence even in a case like the present, where\n                    the legislature has unequivocally declared war on loan shark\n                    offences, unrelenting deterrence doesnotmean indiscriminate deterrence. As the\n                    court very aptly remarked inTan Kay Beng\n                        v Public Prosecutor[2006]\n                    4 SLR(R) 10 (at [31]): Deterrence must always be tempered\n                            by proportionality in relation to the severity of\n                            the offence committed as well as by the moral and\n                            legal culpability of the offender. It is axiomatic\n                            that a court must abstain from gratuitous loading in\n                            sentences. Deterrence, as a concept, has\n                        a multi-faceted dimension and it is inappropriate to\n                        invoke it without a proper appreciation of how and when\n                        it should be applied. It is premised upon the upholding\n                        of certain statutory or public policy concerns or\n                        alternatively, upon judicial concern or disquiet about\n                        the prevalence of particular offences and the attendant\n                        need to prevent such offences from becoming contagious.\n                        [emphasis added] Similar sentiments were recently expressed by the\n                    Court of Appeal inPublic Prosecutor v\n                        Kwong Kok Hing[2008] 2 SLR(R) 684\n                        (“PP v Kwong Kok\n                        Hing”) (at [42]): Where in relation to a particular offence the court is\n                        given a wide discretion in terms of the punishment it\n                        may impose, it is critical that it exercises that\n                        discretion, as far as possible, in a manner that remains\n                        faithful to two essential principles: (a) that the\n                        punishment fits the crime, having regard to the\n                        circumstances attending the case before the court; and\n                        (b) that like cases be treated alike ... 24     The principle of tailoring\n                    the punishment to the crime and the criminal also extends to\n                    the use of benchmark sentences. Benchmarks usually arise\n                    from the steady accretion of the decisions of the courts.\n                    They are the result of the practical application of\n                    statutory penal laws, but should not be mistaken for those\n                    laws themselves. Benchmarks play a crucial role in achieving\n                    some measure of consistency of punishment. But the principle\n                    of treating like cases alike also means that unlike cases\n                    shouldnotbe treated alike.\n                    The court must resist an unhesitating application of\n                    benchmark sentences without first thoroughly considering if\n                    the particular factual circumstances of a case fall within\n                    the reasonable parameters of the benchmark case. Ultimately,\n                    where Parliament has enacted a range of possible sentences,\n                    it is the duty of the court to ensure that the full spectrum\n                    is carefully explored in determining the appropriate\n                    sentence. Where benchmarks harden into rigid formulae which\n                    suggest that only a segment of the possible sentencing range\n                    should be applied by the court, there is a risk that the\n                    court might inadvertently usurp the legislative\n                    function. 25     At this juncture, I will\n                    pause to remind myself of the trite principle that an\n                    appellate court should interfere with a sentence meted out\n                    by the trial judge only if it is satisfied that (seePP v Kwong Kok Hingat\n                        [13]–[14] andPublic\n                        Prosecutor v UI[2008] 4 SLR(R) 500\n                        (“PP v UI”)\n                    at [12]): (a)     the trial judge\n                        had made the wrong decision as to the proper matrix for\n                        sentence; (b)     the trial judge had erred in\n                        appreciating the material before him; (c)     the sentence was\n                        wrong in principle; or (d)     the sentence imposed was\n                        manifestly excessive or manifestly\n                    inadequate.",
        "The District Court’s approach": "26     It is clear from the\n                    Grounds of Decision (“the GD”) that the\n                    District Judge treated the principle of deterrence as the\n                    main, if not the sole consideration. There was at best only\n                    a cursory evaluation of the appellant’s mitigating\n                    factors. At the urging of the Prosecution, the District\n                    Judge also placed primary emphasis on the number of charges\n                    that the accused faced. In reaching his sentence, the\n                    District Judge referred to two cases in particular (see\n                        [23]–[24] of the GD). The first was that ofPP v Nelson Jeyaraj(cited\n                    at[10]above), which\n                    was a Magistrate’s Appeal to the High Court. In that\n                    case the High Court laid down benchmark imprisonment\n                    sentences for fire and non-fire harassment offences: 18\n                    months and 12 months respectively. InPP\n                        v Nelson Jeyaraj, the accused had borrowed\n                    from loan sharks to start a business. He could not repay the\n                    loan and so began to work for the loan sharks for money. He\n                    started work as a runner who verified that others had\n                    carried out their acts of harassment. After awhile, he\n                    “upgraded” himself and voluntarily took on\n                    harassment jobs because they paid better. There was no\n                    indication that he was driven to harassment after having\n                    taken reasonable steps to service his loan. Neither had he\n                    sought to minimise the damage that his harassment caused.\n                    Unlike the appellant in the present case, he used highly\n                    flammable kerosene as fuel to light the fires, which caused\n                    extensive damage. They spread to the ceiling, melting the\n                    ceiling lamps and the insulation of electrical wirings in\n                    the common corridor. In one instance, the fire had even\n                    spread close to the gas tanks. He had a long list of\n                    antecedents. He pleaded guilty to six charges, of which five\n                    were for fire harassment. He was sentenced to 18\n                    months’ imprisonment and three strokes of the cane for\n                    each fire harassment charge, with three of them ordered to\n                    run consecutively. The total sentence was 54 months’\n                    imprisonment, 15 strokes of the cane, and a $30,000\n                    fine. 27     The second case that the\n                    District Judge referred to was that ofPublic Prosecutor v Soh HannKwang(DAC 20162/11 and others,\n                    unreported) (“PP v Soh HannKwang”).\n                    The accused pleaded guilty to 11 harassment charges (of\n                    which seven were by fire) with 20 more taken into\n                    consideration. In a departure from the benchmark laid down\n                    byPP v Nelson Jeyaraj, the\n                    accused was sentenced to 24 months’ imprisonment and\n                    three strokes of the cane for each charge of fire\n                    harassment. He received 12 months’ imprisonment and\n                    three strokes of the cane for each charge of paint\n                    harassment. Three fire harassment charges and one paint\n                    harassment charge were ordered to run consecutively. The\n                    total sentence was 84 months’ imprisonment and 24\n                    strokes of the cane. The decision is unreported and so\n                    nothing is known as to the facts of the case, or why the\n                    District Judge there departed from the 18 months benchmark\n                    set inPP v Nelson\n                    Jeyaraj. 28     The Prosecution in the\n                    present case also referred toPublic\n                        Prosecutor v Goh Kim Leong Jeffrey(DAC\n                    17821/11 and others, unreported) (“PP v Goh Kim Leong Jeffrey”). The\n                    accused was a debtor turned harasser. He wrote\n                    “O$P$” on walls, set main doors on fire,\n                    splashed paint at homes, and splashed paint remover on cars.\n                    He was a first time offender, but faced a total of 50\n                    charges of harassment. The Prosecution proceeded on 15, with\n                    the remainder being taken into consideration. He was\n                    sentenced to 21 months’ imprisonment and three strokes\n                    of the cane for each fire harassment charge, and 12\n                    months’ imprisonment and three strokes of the cane for\n                    each paint harassment charge. The sentences for three fire\n                    harassment charges and one paint harassment charge were\n                    ordered to run consecutively, for a total of 75\n                    months’ imprisonment and 24 strokes of the cane. LikePP v Soh HannKwang, the case was unreported so\n                    even the age of the offender is unknown. 29     In my view, the District\n                    Judge’s single-minded focus on deterrence led to an\n                    insufficient appreciation of Parliament’s nuanced\n                    approach towards loan shark offences. It also led him to\n                    place too much weight on the number of offencesper sethat the appellant faced,\n                    without regard to the other circumstances which are\n                    addressed at[30]to[35]below.",
        "The number of charges tells only a part of the\n                story": "30     The number of charges does\n                    not explain how or why the offender committed those crimes.\n                    But as explained above, those are issues that also mattered\n                    to Parliament. In the present appeal, the number of charges\n                    alone did not reveal that the appellant fell into the\n                    category of vulnerable people for whom sympathy had been\n                    expressed in Parliament. The appellant had been a law\n                    abiding citizen. He got into trouble because he foolishly\n                    guaranteed a friend’s loan and later got retrenched.\n                    Even after half a year, his efforts to find a new job were\n                    unsuccessful. He began to borrow from new loan sharks to\n                    service his existing debts. He tried his best to repay the\n                    loan, even going to the extent of selling his HDB flat, but\n                    it was not enough. It was in these circumstances that he was\n                    pushed towards crime. The matrix of facts within which the\n                    appellant committed the harassment is patently different\n                    from that inPP v Nelson\n                        Jeyaraj. 31     The number of chargesper seis also an\n                    imprecise indicator of moral culpability. As described above\n                    (at[8]), the appellant\n                    took some steps to minimise the damage done by him, whether\n                    it was harassment by fire or by paint. This is in stark\n                    contrast to the damage wrought by the accused inPP v Nelson Jeyaraj, which evidenced\n                    a total lack of concern about the consequences of his crimes\n                    or the safety of the debtors. At the appeal, the Prosecution\n                    did not question that the appellant had used Zippo lighter\n                    fluid instead of kerosene to light the fires. But it\n                    challenged the appellant’s claim that he had diluted\n                    the paint and splashed only a small amount so as to reduce\n                    the damage. This scepticism was based on its view that\n                    “acts of harassment are counter-checked by other\n                    runners to ensure that the job is done”. This was a\n                    new objection which had not been made by the Prosecution at\n                    the District Court. In any event, it was not disputed that\n                    in respect of the instances involving harassment by fire,\n                    little damage was caused to the target. As I see it, this is\n                    proof that the appellant had been concerned about reducing\n                    the damage caused by his acts of harassment. 32     The number of charges\n                    tells only a part of the story of a complex crime. They may\n                    be a sign of hardened criminality, or equally a sign of\n                    desperation – of someone who for fear of his own\n                    safety or for that of his family members, felt unable to\n                    resist doing the biddings of the loan sharks. Such\n                    statistics, while relevant, cannot be viewed in isolation.\n                    Take the case ofPP v Soh HannKwang, which\n                    the Prosecution placed heavy reliance upon in this appeal.\n                    All the court knows aboutPP v Soh HannKwangis that\n                    the accused in that case faced 31 charges of harassment, of\n                    which at least seven were for fire. He was sentenced to 24\n                    months’ imprisonment and three strokes of the cane for\n                    each fire harassment offence, and received a total of 84\n                    months’ imprisonment and 24 strokes of the cane. But\n                    this court knows nothing about the circumstances in which\n                    those offences were committed or the extent of the fire\n                    damage. Curiously enough, the appellant revealed to this\n                    court during the hearing of the appeal that, in an\n                    interesting quirk of chance, he happened to be in the same\n                    holding cell as Soh Hann Kwang while he was in remand.\n                    According to the appellant, Soh Hann Kwang boasted that he\n                    had splashed an entire one litre can of pure paint on each\n                    of the victims’ doors. More alarmingly, he had\n                    allegedly mixed a litre of kerosene with a litre of thinner\n                    as fuel for the fires he lit. The fires predictably raged,\n                    in some cases causing the gate to melt off its hinges. Nowifthose were indeed the\n                    facts ofPP v Soh HannKwang, then one\n                    begins to see the justification for the sentences imposed on\n                    him. But since the appellant’s evidence in this regard\n                    is clearly hearsay, this court has nothing on which to\n                    evaluate the precedent value ofPP v Soh\n                        HannKwangorPP v Goh Kim Leong\n                    Jeffrey. 33     The courts have previously\n                    remarked upon the limited precedent value of unreported\n                    cases, a warning which seemed to have been overlooked by the\n                    District Judge and the Prosecution in the present case. As\n                    the Chief Justice said inLuongThiTrang Hoang Kathleen v Public\n                        Prosecutor[2010] 1 SLR 707 (at [21]): The Prosecution’s … case authorities were\n                        all unreported cases in which no written grounds of\n                        decision were given to explain the sentences imposed\n                        … I would first caution against relying onunreporteddecisions\n                        indiscriminately in determining the appropriate sentence\n                        for the particular case before the court. The dangers of\n                        doing so are clear. InTay Kim Kuan v\n                            PP[2001] 2 SLR(R) 876, this\n                        court cautioned at [6] that unreported cases were only\n                        guidelines since “the detailed facts and\n                        circumstances of these cases [were] hardly disclosed or\n                        documented with sufficient clarity to enable any\n                        intelligent comparison to be made”. Comparisons\n                        based on unreported decisions are difficult and are\n                            “likely to be\n                            misleadingbecause a proper appraisal of\n                        the particular facts and circumstances is simply\n                        lacking” … [emphasis in original]",
        "Remorse": "34     In addition to placing\n                    undue weight on the number of charges against the accused,\n                    the District Judge appeared not to have adequately\n                    considered the appellant’s remorse. It is not disputed\n                    that at the time of the appellant’s arrest, the Police\n                    were able to connect the appellant to fewer than five\n                    charges. It was the appellant who voluntarily confessed to\n                    the other charges, in effect building the\n                    Prosecution’s case against himself. The\n                    appellant’s reason for confessing was that he was very\n                    much in a dilemma even while committing those offences. He\n                    was motivated by a wish to help his victims achieve some\n                    form of closure in knowing that the person who harassed\n                    their homes had been caught. In my view, the\n                    appellant’s confession to not just one or two more\n                    instances of harassments, but almost 70 instances is a\n                    definite and concrete manifestation of his remorse. There is\n                    a public interest in encouraging a guilty person to come\n                    forward to disclose the facts of the offence that he has\n                    committed, and to confess his guilt:Public Prosecutor v Siew Boon Loong[2005]\n                    1 SLR(R) 611 at [21]. It is all the more in the public\n                    interest to have accused persons disclose other offences\n                    which they had committed, but which the Police are unaware\n                    of. No weight was given to this by the District Judge. I\n                    would emphasise that one should not merely focus on numbers\n                    alone. 35     It is a settled principle\n                    of sentencing that true remorse is a mitigating factor. As\n                    this court held in the Magistrate’s Appeal ofAngliss Singapore Pte Ltd v Public\n                        Prosecutor[2006] 4 SLR(R) 653 (at\n                    [77]): … A plea of guilt can be taken into\n                        consideration in mitigation when it is motivated by\n                        genuine remorse, contriteness or regret and/or a desire\n                        to facilitate the administration of justice. The\n                        mitigating effect should also be compatible with the\n                        sentencing purpose(s) and principles the sentencing\n                        judge is seeking to achieve and observe through the\n                        sentence. The fact that the appellant came clean and bared\n                    his misdeeds demonstrated his genuine remorse. That was a\n                    mitigating factor that the District Judge should have more\n                    carefully appraised.",
        "The appropriate sentence": "36     Parliament has singled out\n                    people in the same vulnerable category as the appellant as\n                    deserving of compassion. The provisions of the law under\n                    which the appellant has been charged also give the courts a\n                    reasonably wide discretion to take into account mitigating\n                    factors in deserving cases. It seems to me that in many ways\n                    the appellant was a victim of circumstances spiralling\n                    beyond his control. Not being in his shoes, non-parties are\n                    unlikely to know the pressures that pushed him towards\n                    crime. I have noted that while it is Parliament’s\n                    intent that he should still be punished severely, the real\n                    question is whether the extent of punishment ought in the\n                    present case to be leavened with some compassion. Deterrence\n                    should not be indiscriminate. 37     The recent case ofPublic Prosecutor v Tan ChiahKhing[2012]\n                    SGDC 35 may be an example of a more sensitive and nuanced\n                    application of deterrence. The accused there was charged\n                    with one charge of paint harassment, and one charge of\n                    assisting with unlicensed moneylending. He was a 51 year old\n                    man in poor health. His highest level of education was\n                    primary six. He lived with his aged and sick father. He had\n                    been retrenched repeatedly from his menial jobs and had been\n                    looking for employment when he was introduced to a loan\n                    shark who offered him $1,600 a month just to insert notes\n                    into debtors’ letter boxes. Having reeled the accused\n                    in, the loan shark proceeded to manipulate him by gradually\n                    increasing the severity of the tasks demanded. One month\n                    after he began work, the accused was asked to splash paint\n                    on debtors’ homes. He was caught after his first act\n                    of harassment. The district judge considered all the factors\n                    and noted that the benchmark laid down inPP v Nelson Jeyarajwas not intended to be a\n                    hard and fast rule. He noted the accused’s plight at\n                    that time and decided that six months’ imprisonment\n                    and three strokes of the cane was an appropriate punishment\n                    on the facts of the case. The Prosecution’s appeal\n                    against sentence was dismissed. There is no doubt that the\n                    accused in that case came from the more vulnerable stratum\n                    of society. The case shows that the courts will go below the\n                    benchmarks where they find it appropriate and just to do\n                    so. 38     Returning to the present\n                    appeal, I see no justification to impose 24 months’\n                    imprisonment for each of the fire harassment offences. The\n                    damage caused was much less extensive, and was in fact\n                    minimal when compared to that caused inPP v Nelson Jeyaraj. This was because the\n                    appellant deliberately used a less flammable fuel and took\n                    steps to minimise the spread of the fire. I am unimpressed\n                    by the Prosecution’s contention before me that the 48\n                    other charges to be taken into consideration were in\n                    themselves a sufficient ground to increase the severity of\n                    punishment for the individual charges of fire harassment. As\n                    the Court of Appeal inPP v UI(at [37]–[38]) held, the relevance of outstanding\n                    charges that are taken into consideration hinges on the\n                    context. Given that none of the outstanding charges related\n                    to fire harassment, I felt they were more relevant as an\n                    aggravating factor in relation to the paint harassment\n                    charges. Not only is there no reason to impose a higher\n                    penalty than the benchmark set inPP v\n                        Nelson Jeyarajfor each of the fire\n                    harassment offences, I also find that the sentences should\n                    be reduced. I accordingly reduce the sentence for each of\n                    the fire harassment charges to 16 months’\n                    imprisonment. 39     Similarly, I am of the\n                    view that a discount ought to have been given by the\n                    District Judge for the charges that dealt only with the\n                    splashing of paint and the writing on the walls. This is to\n                    reflect the steps that the appellant took to minimize the\n                    damage caused to the property. However, sentencing is not a\n                    precise science. A small discount of one to two months,\n                    after taking into consideration the outstanding charges,\n                    will in any event not greatly affect the global sentence to\n                    be imposed. 40     In determining the\n                    aggregate sentence, I kept in mind the totality principle\n                    approved inKanagasuntharam v Public\n                        Prosecutor[1991] 2 SLR(R) 874 at\n                        [13]. The total\n                    sentence should not be much higher than the normal level of\n                    sentence for the most serious of the individual offences.\n                    Neither should the total sentence be crushing. I was also\n                    mindful, having already taken into consideration the\n                    outstanding charges when determining the individual\n                    sentences, not to double-load the punishment by taking\n                    additional account of them in determining the global\n                    sentence. Like the District Judge I order that three\n                    sentences for fire harassment and one sentence for paint\n                    harassment are to run consecutively. The total sentence is\n                    hence 60 months’ imprisonment and 24 strokes of the\n                    cane. This is still longer than the sentence imposed inPP v Nelson Jeyaraj. While\n                    it is true that that case involved fewer charges, there are\n                    stronger mitigating factors here. I have discussed those\n                    factors in full above, and will merely summarise here some\n                    of the more salient ones: (a)     The appellant\n                        was a law abiding citizen who became involved with loan\n                        sharks only because he wanted to help a friend by\n                        guaranteeing the latter’s loan: see[7]above. (b)     The appellant took reasonable steps\n                        to pay the loan sharks, even going to the extent of\n                        selling his HDB flat. But his retrenchment and inability\n                        to find a new job meant that his debts kept mounting:\n                        see[7]above. (c)     The appellant took steps to minimise\n                        the damage caused by his acts of harassment: see[8]above. (d)     The appellant confessed to the great\n                        bulk of charges that were brought against him, and which\n                        the police would otherwise have been unable to pin on\n                        him. He did so because he wanted the victims to attain\n                        some form of closure. This was a concrete manifestation\n                        of remorse: see[9]and[34]above. 41     It seems to me that the\n                    appellant was a family man who never wanted to fall foul of\n                    the law. Through an act of kindness to a friend, who turned\n                    out to be wholly unworthy, coupled with the misfortune of\n                    losing his job, he found himself more deeply entangled with\n                    the law with each day that he did the biddings of the loan\n                    sharks. In the interests of the public and as a general\n                    deterrence, he should of course be punished severely but he\n                    should not be crushed. By no stretch of the imagination can\n                    it be said that a punishment of 60 months’\n                    imprisonment and 24 strokes of the cane (the maximum\n                    permitted by law) for the appellant’s wrongdoings is\n                    an insufficient deterrent, either to him or to\n                    others.",
        "Conclusion": "42     The appeal is therefore\n                    allowed. The appellant’s sentence is reduced to 60\n                    months’ imprisonment. The 24 strokes of the cane and\n                    fine of $30,000 shall remain."
    }
}