{
    "case_title": "Public Prosecutor\n      v\n      Yue Mun Yew Gary",
    "ncitation": "[2012] SGHC 188",
    "coram": "Quentin Loh J",
    "sections": {
        "The background facts": "3       The relevant facts are not in dispute. On National Day, 9 August 2010, at 2.57pm, the Respondent posted a comment on the “Wall” of Temasek Review’s Facebook page. This post contained a link to a YouTube video entitled “Sadat Assassination”. The video depicted the assassination of Egypt’s former President, Muhamad Anwar al-Sadat, on 6 October 1981 during Egypt’s annual Victory Day parade. The Respondent’s accompanying comment read: “We should re-enact a live version of this on our own grand-stand during our national’s parade!!!!!!”[note: 1] 4       Following the Respondent’s post, a series of comments were exchanged between the Respondent and one “Ng Jimmy”:[note: 2] ‘Ng Jimmy’:@Gary, are you a PAP agent? ... =) trying to incite rebellion and revolution on this site so that the govt will have an excuse to take down this site? Or scare online readers with TR extremism? ...Gary Yue:If their political downfall is not within grasp, we should know what and how next to escalate it.Regardless, if self-censoring is the spirit of self-preservation is the sum of the game here, then even the cause of this site will come to nou ...Ng Jimmy:@Gary. Our Singapore citizens will vote with Strong hears and Clear minds this coming Election. We will not go down the slippery and treacherous path walked by the govt in their unrelenting pursuit of wealth and unlimited powers ...Gary Yue:Like-wise.But in essence, deep down in our hearts, if not for conscience or any other moral belief’s sake, I am sure we all want the physical removal of any influence of the incumbents from the face of the earth. Just that we stop short of ...   5       On 1 September 2010, an informant lodged a Police Report which stated that: On 9 August 2010 at about 10.50pm, whilst surfing the internet, I came across postings that advocated the use of violence on public officials on a Facebook page. The author’s picture also depicted an act of violence and I felt particularly concerned after reading the recent news relating to postings on the internet. As such, I am lodging this Police report. That’s all. 6       The Respondent was arrested on 9 September 2010, and charged on 18 January 2012. As noted above, following a 2 day hearing he was convicted and sentenced on 12 March 2012.",
        "The decision below": "7       The learned District Judge identified two key issues in determining the Respondent’s sentence:[note: 3] (a)     Whether the Respondent had intended the post to contain an incitement to violence; and (b)     Whether the Respondent had intended to incite violence. 8       Although the learned District Judge found that the Respondent had intended his post to contain an incitement to violence, he accepted the Respondent’s explanation that the post was made “out of angst” and also the defence psychiatrist’s appraisal of the Respondent as “attention-seeking” to “enhance his self-esteem”.[note: 4]As such, the learned District Judge concluded that the Respondent did not intend to incite violence.[note: 5]",
        "Section 267C of the Penal Code": "9       As this is the first prosecution brought under s 267C of the Penal Code, an examination of the genealogy of the section would be apposite. The core of s 267C became part of our law in 1955, when s 151A was added to the Penal Code. Section 151A read: Posting placards, etc. 151A.Whoever makes, prints, possesses, posts, distributes or has under his control any document containing any incitement to violence or counselling disobedience to the law or to any lawful order of a public servant or likely to lead to any breach of the peace shall be punished with imprisonment for a term which may extend to 3 years, or with a fine, or with both. While moving the Bill which introduced s 151A (seeSingapore Parliamentary Debates, Official Report(22 September 1955) vol 1 at cols 769-771), the Attorney-General C H Butterfield stated that the making and circulation of documents of this kind clearly constituted a threat to law and order. Although he noted that such activities found much favour with the Malayan Communist Party, he did not accept that s 151A was needed only temporarily.[note: 6]He also added that the proposed provision covered activities which were not dealt with adequately by the Sedition Ordinance (Ordinance No 18 of 1938) (“Sedition Ordinance”) or the Undesirable Publications Ordinance (Ordinance No 19 of 1938) (“Undesirable Publications Ordinance”).These two Ordinances were passed in 1938 to replace s 124A of the Penal Code (Ordinance No 4 of 1871), which created the offence of Sedition, and the Seditious Publications Ordinance (Ordinance No 11 of 1915) (“Seditious Publications Ordinance”). In moving the Sedition Bill before the Legislative Council of the Straits Settlements (see Shorthand Report of the Proceedings of the Legislative Council of the Straits Settlements, Monday 13 June 1938), Attorney-General C G Howell provided the following reason: The present law of the Colony with regard to sedition is briefly dealt with in section 124A of the Penal Code, but it is desirable that this subject should be dealt with in rather more detail than it is possible to do in that way, and the present Billreproduces substantially the provisions of the common law of England with regard to sedition. ... [emphasis added] 10     The Undesirable Publications Bill was read immediately after, and the Attorney-General introduced it as such: This Bill is, to some extent,complementary to the Bill which has just been read a first time, and gives wider powers for prohibiting the importation of undesirable publications. Our present powers are derived from the Seditious Publications Ordinance which will be repealed as its powers are limited to the prohibition of seditious publications, butit is quite clear that other kinds of undesirable publications as well as seditious publications may be sought to be imported, and the relevant clause of this Bill gives the necessary powers to the Governor-in-Council where it appears necessary in the public interest. [emphasis added] 11     It is noteworthy that the Seditious Publications Ordinance did contain a proscription against incitements to violence. The following extract is taken from the Ordinance as it stood in 1955 (Ordinance 63 of 1935): 3.-(1)    Any person who prints, publishes, imports either by land, sea or air, sells, offers for sale, distributes, or has in his possession any newspaper, book or document, or any extract from any newspaper or book, or who writes, prepares or produces any book or document containing any words, signs, or visible representations which are likely or may have a tendency, directly or indirectly, whether by inference, suggestion, allusion, metaphor, implication or otherwise, (a)    to incite to murder or to any act of violence; ... (e)    to encourage or incite any person to interfere with the administration of the law or with the maintenance of law and order; or shall be guilty of an offence against this Ordinance, and such newspaper, book or document or such extract shall be forfeited and may be destroyed or otherwise disposed of as the Governor directs. 12     In 2007, there was a comprehensive review of the Penal Code and many amendments were made to it. During the second reading of the amendment Bill, Senior Minister of State for Home Affairs, Associate Professor Ho Peng Kee, stated the following (Singapore Parliamentary Debates, Official Report(22 October 2007) vol 83 at cols 2242-2242):[note: 7] Many of our messages are transmitted through the electronic medium, such as through emails, SMS messages and, for some, blogging. It is therefore the right thing to do to enhance the coverage of relevant Penal Code provisions to cover the various electronic means and media which can be used to perpetrate crime. 13     Accordingly, s 151A was repealed and s 267C, which covers not only documents but also electronic records, was introduced. It was under this updated provision that the Respondent was charged and convicted for making his Facebook posting.",
        "Themens reaelement": "14     The learned District Judge below made the substantivelegalfinding that, based on the “clear language” of the statute, s 267C created a strict liability offence. However, s 267C is conspicuously silent on the issue of the offender’s intention, and it is settled law that the mere omission of amens rearequirement does not automatically entail strict liability. Indeed, the consistent position of our courts has been precisely to the contrary, as stated by Yong Pung How CJ inTan Cheng Kwee v Public Prosecutor[2002] 2 SLR(R) 122, at [13]: There is a presumption of law thatmens reais a necessary ingredient of any statutory provision that creates an offence: ... This presumption, however, can be rebutted by the clear language of the statute, or by necessary implication, although it is not sufficient if the provision merely lacks terms that are commonly associated withmens rea. Where an examination of the language of the statute does not assist, the court will have to look at all the relevant circumstances to determine the true intention of Parliament Such considerations include the nature of the crime, the punishment prescribed, the absence of social obloquy, the particular mischief and the field of activity in which the crime occurred. [internal citations omitted] 15     At the same time, the learned District Judge also observed that the presumption ofmens reais “often displaced in situations where the statutory offence in question pertains to issues of social concern”, citing Lord Evershed’s dicta inLim Chin Aik v R[1963] AC 160, at [52]. The same approach was also adopted by the Singapore High Court inPP v Teo Kwang Kiang[1992] 2 SLR(R) 560, where the decision of the trial judge was reversed on the grounds that the presumption ofmens reahad been rebutted by the wider interest in protecting the public from food unfit for consumption (see alsoTan Cheng Kwee v PP[2002] 2 SLR(R) 122). This brings into sharp focus a basic issue of statutory interpretation – whether the weight of the public interest protected by s 267C is sufficient to displace the presumption ofmens rea. 16     I note that s 267C falls under the Chapter XIV of the Penal Code which deals with offences affecting the public tranquility, public health, safety, convenience, decency and morals. I have accordingly looked at the position of comparable provisions which proscribe free expression for similar public policy reasons. Both s 504 (intentional insult with intent to provoke a breach of the peace) and s 505 (statements conducing to public mischief) of the Penal Code contain expressmens reaconditions to the commission of the offence. For example, s 505(b) allies intention with an alternative check of likely harm: 505.Whoever makes, publishes or circulates any statement, rumour or report in written, electronic or other media — ... (b)    withintent to cause, orwhich is likely to cause, fear or alarm to the public, or to any section of the public, whereby any person may be induced to commit an offence against the State or against the public tranquillity; [emphasis added] 17     A comparable offence is also set out in s 298 of the Penal Code, under Chapter XV which deals with offences relating to religion or race: Uttering words, etc., with deliberate intent to wound the religious or racial feelings of any person 298.Whoever, withdeliberate intentionof wounding the religious or racial feelings of any person, utters any word or makes any sound in the hearing of that person, or makes any gesture in the sight of that person, or places any object in the sight of that person, or causes any matter however represented to be seen or heard by that person, shall be punished with imprisonment for a term which may extend to 3 years, or with fine, or with both. [emphasis added] 18     Beyond the Penal Code, s 13(f) of the Miscellaneous Offences (Public Order and Nuisance) Act (Cap 184, 1997 Rev Ed) (“the Miscellaneous Offences Act”) provided that it was an offence to use abusive language if there was an intention to provoke a breach of the peace, such as by causing violence in public, or where a breach of the peace was likely to be caused.[note: 8]Following the passage of the Miscellaneous Offences (Public Order and Nuisance) (Amendment) Bill, s 13(f) of the old Miscellaneous Offences Act was replaced with 4 new sections,iesections 13A to 13D, all of which retain somemens reaelement except for s 13D: Threatening, abusing or insulting public servant 13D.—(1)  Any person who in a public place or in a private place — (a)    uses any indecent, threatening, abusive or insulting words or behaviour towards a public servant in the execution of his duty as such public servant; or (b)    distributes or displays to a public servant in the execution of his duty as such public servant any writing, sign or other visible representation which is indecent, threatening, abusive or insulting, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000 or to imprisonment for a term not exceeding one year. 19     Turning next to the Sedition Act (Cap 290, 1985 Rev Ed), s 3(3) of the Sedition Act expressly provides that: (3)    For the purpose of proving the commission of any offence under this Act, the intention of the person charged at the time he did or attempted to do or made any preparation to do or conspired with any person to do any act or uttered any seditious words or printed, published, sold, offered for sale, distributed, reproduced or imported any publication or did any other thing shall be deemed to be irrelevant if in fact such act had, or would, if done, have had, or such words, publication or thing had a seditious tendency. 20     However, even under the Sedition Act, there remains the check of the offending article of expression having a “tendency” to cause the outcomes enumerated in s 3(1) of the Sedition Act: Seditious tendency 3.—(1)  A seditious tendency is a tendency — (a)    to bring into hatred or contempt or to excite disaffection against the Government; (b)    to excite the citizens of Singapore or the residents in Singapore to attempt to procure in Singapore, the alteration, otherwise than by lawful means, of any matter as by law established; (c)    to bring into hatred or contempt or to excite disaffection against the administration of justice in Singapore; (d)    to raise discontent or disaffection amongst the citizens of Singapore or the residents in Singapore; (e)    to promote feelings of ill-will and hostility between different races or classes of the population of Singapore. 21     This was treated as an offence of strict liability by Grenville Neighbour DJ inPublic Prosecutor v Ong Kian Cheong and Another[2009] SGDC 163 (“Ong Kian Cheong”), at [47]: ... I agree with the prosecution’s argument that the provisions of the [Sedition Act] should be given a plain and literal interpretation. There is no requirement in the section that proof of sedition requires intent to endanger the maintenance of the government. It would be clearly wrong to input such intent into the section. All that is needed to be proved is that the publication is [sic] question had a tendency to promote feelings of ill will and hostility between different races or classes of the population in Singapore. 22     In arguing their case that s 267C should be construed as creating a strict liability offence, the Prosecution relied heavily on two Malaysian authorities:Public Prosecutor v Ooi KeeSaik & ors[1971] 2 MLJ 108 andPublic Prosecutor v Param Cumaraswamy (No 2)[1986] 1 MLJ 512. Both cases concerned the application of the Sedition Act in Malaysia. These cases are not germane because the statutory provision employs an objective check by the concept of “seditious tendency” to restrict the operation of the offence. With such an objective check in place there is less of an obstacle to characterising the offence as one of strict liability. 23     In considering the above provisions, it appears to me that statutory derogations from the right to free expression are typically circumscribed either by amens reaelement or by a more objective requirement that there is likely harm to society. Section 267C is peculiar in that it contains no limiting mechanism to regulate the ambit of the offence, so that on the face of s 267C even satirical materials or off-hand comments can fall within its ambit. Indeed, anyone who had created a link to the Temasek Review Facebook page on 9 August 2010 may well have committed an offence under s 267C by ‘communicating’ an electronic record containing an incitement of violence. 24     Further, “incitement” is a loaded but ambiguous term. It is far more than just to persuade or suggest or, at a level up, to stir up or to arouse. At its core, it means to instigate, to move to action, to rouse, to spur or to stimulate vigorously into action by, as a prime example, making an inflammatory speech. Nonetheless, without some further check, s 267C is potentially very far reaching. At one end of the spectrum it can include situations where, for example, an advertisement for self-defence lessons with the caption “Fight Back!” could be read as taking the law into one’s own hands and therefore an incitement to violence. In my judgment, it cannot have been Parliament’s intention to criminalise such a wide swath of content when the possible potential for harm would probably only arise in certain cases. 25     In addition, I am of the view that the history of s 267C, as tortuous as it is, also supports the presumption ofmens rea. The Seditious Publications Ordinance contained an objective test similar to that used in the Sedition Act today – the publication had to be “likely or may have a tendency, directly or indirectly, whether by inference, suggestion, allusion, metaphor, implication or otherwise” to incite violence. This test then seems to have been discarded in the 1938 migration to the Sedition Ordinance and Undesirable Publications Ordinance. Instead, the Sedition Ordinance incorporated the common law concept of “seditious intention” in s 3, and specified the elements of this concept in ss 3(1)(i)-(v). s 3(2) also addressed themensrea requirement of the offence: In determining whether the intention with which any act was done, any words were spoken, or any document was published, was or was not seditious, every person shall be deemed to intend the consequences which would naturally follow from his conduct at the time and under the circumstances in which he so conducted himself. 26     In contrast, the Undesirable Publications Ordinance appears to have created a strict liability offence under s 4(1) – although to my knowledge this has not been tested in our Courts – in relation to “[a]ny person who imports, publishes, sells, offers for sale, distributes or reproduces” a prohibited publication, but employs a caveat of “lawful excuse” under s 4(2) for the offence of possessing such a publication. The offence created by s 4(1) has survived largely intact in the current law, s 6(1) of the Undesirable Publications Act (Cap 338, 1998 Rev Ed) (“Undesirable Publications Act”) stipulating that: 6.—(1)  Any person who imports, publishes, sells, offers for sale, supplies, offers to supply, exhibits, distributes or reproduces any prohibited publication or any extract therefrom shall be guilty of an offence and shall be liable on conviction for a first offence to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 3 years or to both, and for a subsequent offence to imprisonment for a term not exceeding 4 years. 27     However, there has yet to be a definitive judicial pronouncement as to whether s 6(1) creates a strict liability offence, although I note that inPP v Lin KokJoo[2006] SGDC 253, Valerie Thean DJ appears to have treated it as such. It might well be argued that, insofar as s 151A and s 267C shares the same parentage as s 4(1) of the Undesirable Publications Ordinance and s 6(1) of the Undesirable Publications Act, Parliament must have intended to create an offence of strict liability under all these provisions, in contradistinction to the qualified provisions under s 4(2) and s 6(2) of the latter two statutes respectively. This proceeds from the assumption that the offence of incitement to violence bears a closer kinship to the Undesirable Publications Ordinance than the Sedition Ordinance. In my opinion, however, such an approach is intuitive but flawed. It is crucial to understand that “seditious intention”, as understood under the common law at the time, was a concept allied to an incitement to violence. 28     Within the common law, the term “incitement to violence” is inextricably linked to the historic origins of the offence of sedition, which was defined by Sir James Fitzjames Stephen in hisDigest of the Criminal Lawand subsequently accepted in a string of English authorities. This is helpfully summarised in the Law Commission’s Working Paper onTreason, Sedition and Allied Offences(No 72), at [70]: It is clear that there is a qualification to the rules as stated by Stephen. It is not sufficient merely to show that the words were used with the intention of achieving one of the objects set out in Article 114; it must also be proved that there was an intention to cause violence. Indeed, Stephen himself in his History of the Criminal Law of England accepts that nothing short of a direct incitement to disorder and violence is a seditious libel. He states that the modern view of the law is plainly and fully set out by Littledale J in [R v Collins(1839) 9 C & P 456, 461]. 29     InWallace-Johnson v The King[1940] 1 AC 231, the Privy Council considered the meaning of “seditious intention” within the application of s 326(8) of the Criminal Code of the Gold Coast (Cap 9, 1936 Rev Ed), which wasin pari materiawith s3 of the Sedition Ordinance. From the arguments of counsel (at p233) it appears that there was extensive English authority establishing that a seditious intention was yoked to the incitement to violence: The judgment throughout in H.M. Advocate v. John Grant and Others indicates that what has to be shown in order that the words may be seditious - or of seditious intent - is that the words themselves are calculated to urge the people to actual violence. \"Calculated\" there has no element of mental calculation, but means \"such as to.\" The necessity for the likelihood of violence before a seditious intention can be proved is dealt with in the following English authorities: Reg. v. Sullivan; Rex v. Burdett, where it was stated that: To be a seditious libel it must be \"calculated to incite them to acts of violence and outrage\" - the words in question in the present case did not incite anybody to violence: Reg. v. Collins; Rex v. Aldred, where Coleridge J., in summing-up, said - \"The word 'sedition' in its ordinary natural signification denotes a tumult, an insurrection, a popular commotion, or an uproar; it implies violence or lawlessness in some form; ....\"; and Reg. v. O'Brien. On the necessity of proving intention there are three English cases in the appellant's favour: Reg. v. Lovett); Rex v. Cobbett; and Rex v. Cobbett. It must be admitted that the foot-note at p. 93 of Russell on Crime, 9th ed., vol. i., is correct in its reference to the second Cobbett case. 30     The Privy Council, however, came to the conclusion that the clear and unambiguous wording of the Criminal Code did not admit such a requirement of incitement to violence (at pp 240 – 241): Their Lordships find these words clear and unambiguous. Questions will necessarily arise in every case, as in this case, as to the facts to which it is sought to apply these definitions. Fine distinctions may have to be drawn between facts which justify the conclusion that the intention of the person charged was to \"bring into hatred or contempt .... the Government of the Gold Coast,\" and facts which are consistent only with the view that the intention was no more than, in the words of a later part of sub-s. 8, \"to point out errors or defects in the Government .... of the Gold Coast.\" It is quite another thing to add words which are not in the Code and are not necessary to give a plain meaning to the section. Nowhere in the section is there anything to support the view that incitement to violence is a necessary ingredient of the crime of sedition. Violence may well be, and no doubt often is, the result of wild and ill-considered words, but the Code does not require proof from the words themselves of any intention to produce such a result, and their Lordships are unable to import words into s. 330 which would be necessary to support the appellant's argument. 31     This case casts vital illumination on how s 3(1)(a) of the Seditious Publications Ordinance was left out of the transition to the Sedition Ordinance in 1938, leaving a gap which was then filled in 1955 with the passage of s 151A. Although the Sedition Ordinance was meant to import the English position on sedition into the laws of Singapore, the failure to expressly include a provision for incitement to violence created a vacuum which the Attorney General was moved to address over two decades later.  The lineage of the present-day s 267C must therefore be traced through the Sedition Ordinance rather than the Undesirable Publications Ordinance, and back into the Seditious Publications Ordinance. The unequivocal position of Parliament with regard to sedition has always been to place an objective check on the scope of the offence in the form of a seditious tendency or seditious intention requirement. It is clear that Parliament has never intended to create an unfettered offence under any of these Ordinances, and indeed the position remains the same in the present day Sedition Act. With this in mind, I am disinclined to regard s 267C as having fallen so far from the tree that it must constitute a strict liability offence. Accordingly, the general requirement ofmens reamust be satisfied in order to make out the offence of incitement to violence. 32     The learned District Judge’s reasoning proceeded from the premise that as s 505 of the Penal Code expressly imported amens reacriteria, Parliament must have intended through the bare wording of s 267C to create an offence of strict liability. With great respect, while I see the force of this approach, it may be anon sequitursince one might just as validly contend that if Parliament had intended to create a strict liability offence it would have expressly said so, just as in s 3(3) of the Sedition Act. The learned District Judge’s reasoning must also yield to the force of s 267C’s legislative history, which to be fair, was not fully explored before him. 33     On my analysis of comparable statutes, the history of the offence of incitement to violence and the public policy interests at stake, I do not think it is correct to regard s 267C as a strict liability offence. There are compelling reasons to refrain from displacing the presumption ofmens reaeven though s 267C does perform an important function. Nevertheless, I agree with the learned District Judge that the Respondent’s intentions would remain relevant as a matter of sentencing.",
        "The nature of incitement to violence": "34     The Prosecution submitted that a close parallel can be drawn to the offence of criminal intimidation where the threat is to cause death, for which the benchmark sentence is six to twelve months’ imprisonment. With respect, I am unable to accept this. The act of telling another something like “I am going to kill you” or “I will kill you” belongs to a different and more serious class of criminal wrongdoing. The threat is personal and more immediate. The conduct proscribed by s 267C may well contain an element of intimidation or malice, but it is the element of encouraging or instigating physical harm to a person or class of persons which is specifically targeted by the provision. There is a distinct difference between a statement which constitutes hurt or harm in itself, and a statement whichincitesthe hurting or harming of another – although both aremala in se. It is also clear that the elements of public welfare and social order are more attenuated in the context of criminal intimidation. I am therefore of the view that the sentencing precedents for criminal intimidation cannot serve as meaningful guides for the present appeal, although I agree that a comparative analysis of the substantive offences does provide a useful backdrop against which to isolate the distinguishing elements of s 267C. 35     Before proceeding any further I pause to note that at a lower category of seriousness, s 267C can be compared to ss 13A and 13C of the Miscellaneous Offences Act, which both stipulate a non-custodial sentence: Intentional harassment, alarm or distress 13A.—(1)  Any person who in a public place or in a private place, with intent to cause harassment, alarm or distress to another person — (a)    uses threatening, abusive or insulting words or behaviour; or (b)    displays any writing, sign or other visible representation which is threatening, abusive or insulting, thereby causing that person or any other person harassment, alarm or distress, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000. … Fear or provocation of violence 13C.Any person who in a public place or in a private place — (a)    uses towards another person threatening, abusive or insulting words or behaviour; or (b)    distributes or displays to another person any writing, sign or other visible representation which is threatening, abusive or insulting, with intent to cause that person to believe that immediate unlawful violence will be used against him or another person by any person, or to provoke the immediate use of unlawful violence by that person or another person, or whereby that person is likely to believe that such violence will be used or it is likely that such violence will be provoked shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000.",
        "Incitement": "36     The offence carved out by s 267C does not appear at first blush to occupy any ready pedestal within the canon of our law. It was introduced (see [9]supra) ostensibly to plug the gap between the Sedition Ordinance and Undesirable Publications Ordinance, and has survived Parliament’s review of the Penal Code in 2007. The offence also seems to fall at some intermediate and indeterminate point between specific provisions which proscribe the incitement of, for example, religious and racial hatred (see s 268 of the Penal Code), and the general principle of inchoate liability enshrined in s 107 of the Penal Code. This is crucial from a sentencing perspective since, in very general terms, the severity of the punishment in the former class of offences is also affected by the additional dimension of the gravity of thesubject matterinvolved. 37     On a plain reading of s 267C, the provision creates a general offence of inflammatory instigation of physical harm through acts of violence. It also covers similar levels of instigation of disobedience to the law or any lawful order of a public servant or of something that is likely to lead to a breach of the peace. Although the genesis of the provision indicates that it was introduced specifically to combatpoliticalincitements to violence, the remit of s 267C is clearly not in any way confined to the political sphere and clearly applies to other provocations which threaten public safety and order and disobedience to the law or lawful orders of a public servant. It is not difficult, even in today’s context, to envisage how extremist interest groups can exhort their acolytes to take up arms in service of a political cause or, as the English riots in August 2011 show, to instigate disobedience to the law. It is equally evident that the public interest lies in meeting such political or special interest groups’ stratagems with the full weight of the criminal law. Section 267C therefore represents a general but an important bulwark against threats to society and civil order. Its importance comes to the fore where the veneer of society has grown thin and not as strong as it should be or where there are insidious attempts to erode that vital veneer from beneath.",
        "Freedom of expression": "38     Given the political context of the present case, I have been particularly mindful of the need to give sufficient weight to the value of free expression. A free and open discourse is indispensable to the proper functioning of any democracy, and provisions like s 267C may potentially have an adverse chilling effect on this vital civic conversation. That is not what s 267C was meant to achieve. Hence in my judgment s 267C cannot be a strict liability offence. The Prosecution must prove themens reabeyond a reasonable doubt. Having said that however, free expression cannot be so unfettered as to allow individuals at the fringes of society to cause harm under the guise of expression. While the personal and public benefits of free expression would sufficiently recompense for inevitable encounters with the rude, the obstinate, the obtuse and even the offensive, it is no part of the constitutional bargain that citizens must bear violence or disobedience to law and order – or the threat thereof – as the price of free expression. Those who incite violence and disorder do not contribute to the national conversation – indeed, the effect of such provocation is to subvert the free exchange of ideas and to replace reason with violence. That has no place in a democratic society based on the rule of law. As such, the balance between the individual’s right to free expression and the public’s right to be free from harm must tilt towards the latter. It is also imperative that the courts who have discretion over sentencing exercise their power for the protection of the public and society as a whole.",
        "The Respondent’s conviction and sentence": "39     There can be no question that the Respondent was correctly convicted. Whilst I entirely agree with the learned District Judge below that the Respondent intended the posting to contain an incitement to violence, with great respect, I cannot agree with his finding that this is significantly different from a finding that the accused had intended to incite violence with his posting or that there was no direct evidence that the accused had intended to incite violence with his posting (see Grounds of Decision at [41], [42] and [44]). I cannot discern any difference between these two intentions. 40     There is in my judgment abundant evidence that the Respondent intended to incite violence with the posting. The video, entitled “Sadat’s Assassination” begins with an assassin loading his rifle, scenes of the parade, gunmen or a gunman leaping off a military lorry, shooting into the grandstand and ends with the late President Assad being shot. It also appears from the video that he was hit by 37 bullets. Taken with the Respondent’s comment that we should re-enact this on our grandstand during our National Day Parade, it is difficult to see this other than as a clear incitement to violence and it is difficult to accept the Respondent’s claim that he did not intend the natural consequence of his actions. If indeed there can be any doubt on that conclusion on the Respondent’s intention in his posting, the replies by the Respondent to one Jimmy Ng set out above will put any doubts, if indeed there can be any, to rest: If their political downfall is not within grasp, we should know what and how next to escalate it. ... ...I am sure we all want the physical removal of any influence of the incumbents from the face of the earth. 41     Themensreahas been satisfied beyond reasonable doubt. I am therefore of the view that the Respondent’s offence is a very serious one which, in the absence of compelling mitigating factors, warrants a custodial sentence for a not insubstantial term.",
        "Sentencing principles": "42     The seriousness of the offence is such that the court is entitled to apply the precautionary principle in sentencing – it cannot be that only those whosucceedin causing violence will receive a custodial sentence. Instead, a stiff sentence can be warranted on the grounds of deterring behaviour which has the potential to be injurious to public order and safety. InAngliss Singapore Pte Ltd v PP[2006] 4 SLR(R) 653 at [28], VK Rajah JA offered the following guidance: The principle of general deterrence, on the other hand, is premised upon the upholding of certain statutory or public policy concerns or alternatively, upon judicial concern over the prevalence of particular offences and the attendant need to prevent such offences from becoming rampant: seeTan Kay Bengat [31]. The fact that this is the one and only prosecution under the AMLA since 1998 demonstrates that the need for a heavy sentence simply on the grounds of general deterrence is entirely unfounded. 43     The cited passage is of particular importance in the present appeal, since s 267C has hitherto remained dormant. However, it is clear that the public policy concerns involved in the present case do warrant some measure of general deterrence to be taken into account, particularly given the technological milieu in which the incitement took place (an aspect which I will return to in more detail below, at [52] – [53]). 44     In assessing the facts of each case, the court must take into consideration factors such as the context, nature, and subject-matter of the incitement. In particular, I am cognisant that the meaning and provocation of an expression may be almost completely dependent on the context within which it is made. A statement could be entirely innocuous in one time and place, and to one audience; but the very same statement could be incendiary in other situations. By the same token, an invidious statement could amount to a serious incitement to violence even though violence never materialises, just as an otherwise innocent statement could be the proverbial straw that breaks the camel’s back. Insofar as s 267C creates a standalone offence, the severity of the punishment meted out must first and foremost be yoked to the seriousness of the incitement within the particular context of its creation, as apart from the actual outcome produced. 45     It must be emphasised that this provision does not represent an indictment of the Respondent’s views on government policy or his political views.  Section 267C is not targeted at anyspecificform of hate speech, nor does it amount to a provisionspecificallyaimed at sedition. The purpose of s 267C is to prosecute and thereby deter those who, for whatever motive or purpose, seek to threaten public order by instigating and causing others to act with violence. 46     Given that this case is the first case brought under s 267C, I have derived considerable guidance from recent cases in which our courts have had to balance free expression with a countervailing public interest. One of these cases,PP v Koh Song Huat Benjamin[2005] SGDC 272, involved the first conviction under s 4(1)(a) of the Sedition Act. The two accused persons posted anti-Malay and anti-Muslim remarks on the internet. In the determination of sentence, Richard Magnus SDJ explained at [6] that: The doing of an act which has a seditious tendency to promote feelings of ill-will and hostility between different races or classes of the population in Singapore, which is the section 4(1)(a) offence, is serious. Racial and religious hostility feeds on itself. This sentencing approach of general deterrence is because of three main reasons: the section 4(1)(a) offence ismala per se; the especial sensitivity of racial and religious issues in our multi-cultural society, particularly given our history of  the Maria Hertogh incident in the 1950s and the July and September 1964 race riots; and the current domestic and international security climate. The Court will therefore be generally inclined towards a custodial sentence for such an offence. With respect, I entirely agree. In that case, the first accused was sentenced to one month’s imprisonment per charge, and the other accused received the maximum fine of $5000 with a nominal one day’s imprisonment. I pause to note that in my view, the first accused’s sentence was too light. Be that as it may, this benchmark established byPP v Koh Song Huat Benjamin[2005] SGDC 272 was followed inPP v Ong Kian Cheong and Another[2009] SGDC 163, with a sentence of 4 weeks’ imprisonment per charge imposed on the accused in that case. 47     A similar tension between free expression and public interest also features in the application of s 505 of the Penal Code. InLeong Mun Kwai v PP[1971-1973] SLR(R) 707 (“Leong Mun Kwai”), the appellant had made general statements at a political rally during general elections which were adjudged to be “likely to incite people to violence and not only against just one individual, the Prime Minister, but ministers, members of Parliament, community leaders who are mentioned specifically in his speech.” (seeLeongMun Kwaiat [4]) Wee Chong Jin CJ thought that the initial sentence of one month’s imprisonment and a fine of $3,000 was manifestly inadequate, and increased the term of imprisonment to 4 months. 48     I have also examined the approach of the English courts in relation to the riots that took place in August 2011. I accept that there is a difference in those cases as the breakdown of law and order had already broken through the veneer of their civilised society; widespread rioting had broken out when some individuals used the internet and mobile telephones to incite rioting, violence and destruction of property. The sentencing appeals for several of the cases arising from those events were heard jointly before the Court of Appeal inR v Blackshaw[2012] 1 WLR 1126. Two of the defendants, Blackshaw and Sutcliffe, had used social media to incite the spread of unrest which was already taking place in other parts of England. Blackshaw created an event on the Facebook site in order to organise a “Smash down in Northwick Town”. Sutcliffe also used Facebook to put up a webpage called “The Warrington Riots”. In neither case did the advertised meetings materialise before the Police intervened. Both were sentenced to 4 years’ imprisonment. Lord Judge CJ, in delivering the judgment of the Court of Appeal, held at [74] – [75] that: … What both these defendants intended was to cause very serious crime, in the case of Blackshaw, rioting burglary or criminal damage, each in the context of serious public disorder, and in relation to Sutcliffe, rioting, in the context of serious public disorder. All this was incited at a time of sustained countrywide mayhem. The judge was fully justified in concluding that deterrent sentences were appropriate. These offenders were caught red-handed. For the citizens of Northwich and Warrington that was just as well, because as we have explained, and the guilty pleas acknowledged, neither offender was joking when the Facebook entry was set up. These appeals are dismissed. 49R v Blackshawclearly demonstrates why provisions such as s 267C have an important role in preserving public order and safety. It is far better to preserve and prevent a breakdown in public order and safety than to deal with the aftermath when untold physical, economic, emotional and psychological damage has been done. The August 2011 riots shocked the English nation and caused a good deal of soul searching within their society. For a good 8 decades or so of the 20thCentury, England was looked upon as a civilised society with its members taking great pride in their civilised behaviour and strong rule of law. Many wondered how it could come to pass that law and order was just thrown aside and the breakdown in law and order could spread so quickly within their society during that fateful August of 2011. It was not just the poor and disadvantaged who participated in those riots but some economically well-off individuals also took part in the riots and looting. Lord Judge CJ began his judgment with the following: 1    There can be very few decent members of our community who are unaware of and were not horrified by the rioting that took place all over the country between 6 August and 11 August 2011. For them, these were deeply disturbing times. The level of lawlessness was utterly shocking and wholly inexcusable. ... 3    Before we summarise something of the ghastliness inflicted on a variety of different neighbourhoods subjected to public disorder, and dealing with the individual appeals, we shall identify the applicable sentencing principles. 4    There is an overwhelming obligation on sentencing courts to do what they can to ensure the protection of the public, whether in their homes or in their businesses or in the street and to protect the homes and businesses and the streets in which they live and work. This is an imperative. ... 50     It should be noted, however, that both defendants inR v Blackshawhad sought to exploit an already combustible situation; riots had already broken out and the context in which the incitements took place greatly magnified the defendants’ culpability. Lord Judge CJ also acknowledged at [73] that the severity of the incitement was exacerbated by the use of technology: We are unimpressed with the suggestion that in each case the defendant did no more than make the appropriate entry in his Facebook. Neither went from door to door looking for friends or like-minded people to join up with him in the riot. All that is true. But modern technology has done away with the need for such direct personal communication. In other words, the abuse of modern technology for criminal purposes extends to and includes incitement of very many people by a single step. Indeed it is a sinister feature of these cases that modern technology almost certainly assisted rioters in other places to organise the rapid movement and congregation of disorderly groups in new and unpoliced areas.",
        "The nature of the internet": "51     As mentioned above (at [102]), s 267C was specifically modified to take into account the advent of electronic media. The impact of the internet was also explored by Sundaresh Menon JC (as he then was) inLee Hsien Loong v Review Publishing Co Ltd[2007] 2 SLR(R) 453 at [1]: In what Thomas Friedman terms a “flattening world”, accessibility to instruments of mass media and communication – in particular, the Internet – is dramatically shortening the globe’s communicative synapses and greatly increasing the potential reach and impact of any individual idea or expression. Such accessibility gives rise to power which holds promise, but it also portends abuse. ... 52     I would add that the internet has added completely new paradigms in which we conduct our daily lives and interact with other members of society. The benefits are tremendous. But there is also a downside to this advancement in technology. A person who may not be so ready to say something in front of others is now able to do so in the privacy of his room and with no one present to immediately disagree or take him to task for what he says. With such safety, seclusion and lack of an audience in person, many will be emboldened to make more extreme statements and take more extreme views. More importantly, what a person says on the internet has a far wider reach than hitherto thought possible. We no longer make a statement to a group of people we know. That statement goes out to a far larger number of people than we realise. Friends may realise the maker of the statement as someone who is not serious or temporarily upset, or that it is out of character, but that is no guarantee that other recipients know that and will not react to that statement in all seriousness. 53     A case in point isR v Liam Stacey(Appeal No: A20120033 of the Swansea Crown Court) where the appellant, admittedly drunk, sent out some very offensive messages on twitter using threatening, abusive or insulting words with intent to cause harassment, alarm or distress aggravated with racial slurs to other users of twitter when the Bolton Wanderers player, Fabrice Muamba, collapsed whilst playing against Tottenham Hotspur in March 2012. They were so offensive and vulgar that they do not deserve repeating. The appellant’s tweets provoked complaints and he was quickly traced. When arrested, he admitted to the posts, said he was drunk at that time and he was really sorry and had apologised online for what he had done. In mitigation, friends said his postings were out of character. He was aged 21 and an undergraduate studying biology at Swansea University. Wyn Williams J, sitting with two magistrates on appeal, held (at [14]) that immediate imprisonment was justified and upheld the sentence of 56 days imprisonment as being “not too long”. 54     Shortened communication synapses often lead to hasty conclusions, and the internet can curtail tolerance and shorten tempers as well. It is inevitable that public order offences will increasingly take place in the realm of cyberspace. The present case exemplifies just such an abuse of the internet, with the Respondent using openly available tools of mass media for both his medium (Facebook) and his message (Youtube). The Respondent was also able to receive an immediate response to his missive, whether through comments posted by other users or by “likes” voted for on the Facebook page. The potential impact of his post is also greatly magnified due to the accessibility of the webpage and the ease of its replication. One might think that this is merely an isolated instance of an angry man venting steam in an ill-advised fashion, but the nature of the internet is such that his words become instantly available to the wider public. It is therefore important to send a strong signal that the internet is not an entirely unregulated space wherein calls to violence or messages laced with racial slurs are treated as an acceptable mode of communication. To condone such online behaviour would also represent a collective failure to fulfil the potential of the internet as an empowering forum for the good of mankind and for the creation of a more robust civic consciousness and civilised society.",
        "The appropriate sentence": "55     In the proceedings below, the Respondent submitted a psychiatric report prepared by Dr Tan Chue Tin, whose opinion included the following analysis of the Respondent: Gary has an introverted, poorly socialised personality with a previous psychiatric treatment as a child; it is therefore not surprising that he finds the internet a fertile ground for his imaginative play and creative re-enactments of his “angst” against his perceived ills in society; such internet forays like the netizens forum afforded him great relief and provided an outlet for the discharge of his “angst” and “tensions”. If his postings attract may [sic] “hits and “likes”, it will enhance his self-esteem and social standing among netizens, something he will not be able to achieve in real life. 56     It would appear from this analysis that the Respondent’s intentions in making the post were simply to express his frustrations and attract attention. However these are no more than personality or character traits of the Respondent and not some psychiatric condition or illness that may diminish his responsibility for his actions. He therefore has to take responsibility for his actions. 57     The Respondent also explained, in his first statement on 9 September 2009 that his post was: … merely out of frustration and anger against [the] current government. As [he] felt that the current ruling government is betraying the citizen [sic] of the country as they have set up the 2 IRs despite tremendous outcries against the introduction of the IRs into the community using the excuses of bring [sic] more jobs through the IR but it [is] also causing social problems. 58     The Respondent wanted the ‘video’ of the ‘Sadat Assassination’ to “act as a strong visual statement to signify the growing public unhappiness against the incumbent government.” The Respondent curiously does not say that he himself is against the IRs or disagrees with their introduction into Singapore, but his frustration and anger is the perceived betrayal of the people by the introduction of the IRs in spite of what he perceives as “tremendous outcries”. 59     In his statement recorded under s 23(1) of the Criminal Procedure Code 2010 (Act 15 of 2010), the Respondent states that his posting and comments were done: “out of a moment of angst against the established status quo in the local context at that time with regard to political freedoms of expression. And it was within the online environment afforded by platforms like Temasek Review where I had observed a significant presence of netizens eager to share in the expression of their aspirations, fears and deep-seated resentments about the status quo in local society.” It appears that no one else advocated violence as the Respondent did. As set out above, one Jimmy Ng who was obviously against such policies, expressly disagreed with the Respondent. 60     It must be emphasized that unhappiness with or disagreement over the ‘Integrated Resorts’, pro-foreigner policies or ‘bread and butter issues’ of the day at that point of time, or any such similar issues are legitimate subjects of debate within our society. A citizen in entitled to have genuine concerns about government policies and to disagree with them and, if necessary, the courts will protect such rights. There are many channels through which the Respondent could have expressed these views, if indeed they were so held by him, and he remains free to do so. Indeed these very issues were canvassed during the last general elections and citizens expressed their concerns through the ballot box and therefore through their elected representatives in Parliament as well as through various other channels, including the internet. No one has even hinted that these concerns or even grievances were illegitimate. Indeed the debate on some of those issues continues openly today. 61     I therefore find the Respondent’s incitement of violence unacceptable. What he did was to express no real view apart from a resort to violence. The dominant, indeed the only discernible,purposeof the post was to depict and suggest an act of violence against officials at a public parade. 62     One cannot simply write off the Respondent’s conduct as merely frivolous. This was not just a ‘bad joke’ or an off-hand comment. It was a targeted outburst which was timed to coincide with National Day celebrations, and would appear to any reader to have been made in all seriousness. The Respondent’s austerity of tone, which belies his purported excuse, is particularly evident from his responses to “Ng Jimmy” as set out above. He now has to take responsibility for his actions. 63     Although the post coincided with the 2010 National Day celebrations, I note that there was no existing unrest or social tension which the Respondent could be said to be attempting to exploit or explode. Whilst remaining watchful as many other countries were,eg., against terrorist threats, we were otherwise at peace. The court must therefore determine the seriousness of an incitement to violence which was graphic, extreme, and nihilistic, but no more. It is noteworthy that only 1 complaint was received in relation to the post, and that the Informant, one Mr Tan Wu Meng, only lodged the police report on 1 September 2010, having come across it almost a month earlier on 9 August 2010. Indeed, the Informant’s concern appears to have crystallised only retrospectively, “after reading the recent news relating to postings on the internet.” “Ng Jimmy’s” response also indicates that the post wasreceivednot so much as an active incitement of violence but a graphic depiction of extremism. It appears to have only drawn his one response. 64     Taking into account the above factors, especially in times of social stability, but bearing in mind that the social veneer cannot be allowed to be eroded by allowing such statements or postings, I am of the view that a custodial sentence of 3 months’ imprisonment should be the starting point for such offence on these facts. But as the English cases on the August 2011 riots show, in different times and circumstances, the term of imprisonment could be far longer.",
        "Mitigating factors": "65     The Respondent is 36 years of age and obtained a degree in engineering in 2000 from the University of Glasgow, Scotland. He was employed by Singapore Technologies Kinetics and had worked in that company for 10 years. His last appointment was that of an Assistant Principal Engineer. In his promotion letters, he appears to have done well in the company. He is unmarried and lives with and takes care of his 72 year old father who was recently diagnosed with mylodisplastic syndrome, a blood disorder. His mother passed away in 1999. He remains the sole breadwinner of his family. He has an older brother who is married and lives separately in his own household. 66     In addition, the Respondent’s employment was terminated. The Prosecution very properly accepted that the Respondent’s termination of employment was caused by this incident. This is not surprising as the Respondent was working in the defence industry. The Respondent is currently unemployed, and his counsel informed the learned District Judge below that the Respondent is currently attending counselling sessions with Dr Tan Chue Tin. 67     However, I note that the fact that the Respondent’s career or job prospects might be ruined by his conviction is but a natural consequence of his own acts and ought to be given little or no weight in mitigation. In Kow Keng Siong,Sentencing Principles in Singapore(Academy Publishing, 2009), the learned author described the above principle to be of “universal application to almost all convicted offenders”: see p 737. The fact that hardship will be caused to the Respondent’s family by his imprisonment would also be of little or no weight save in exceptional circumstances, even where the offender is the sole or main breadwinner of the family. InPublic Prosecutor v Tan Fook Sum[1999] 1 SLR(R) 1022, Yong Pung How CJ held at [31] that: 31    … The short answer to this is that the hardship was within presage and the respondent had brought it upon himself. The position is that hardship caused to the family by way of financial loss occasioned by imprisonment is of little weight today; and of no weight if the term is short: Lim Choon Kang v PP [1993] 3 SLR(R) 254 at [5]. Hardship because of other family circumstances is also disregarded. Such hardship is the price which the convicted person must bear and cannot affect what would otherwise be the right sentence: R v Ingham (1980) 2 Cr App R (S) 184 as cited in Lai Oei Mui Jenny v PP [1993] 2 SLR(R) 406 at [11]. Although ensuing hardship may exceptionally mitigate the rigour of punishment, the circumstances must be exceptional before the court will decide against a custodial sentence on this ground. Clearly, the circumstances of this case fell far short of those required to qualify hardship as a mitigating factor sufficient to persuade the court not to impose a custodial sentence. [emphasis added] 68     Save in exceptional circumstances, little or no weight would be given during mitigation to the fact that the accused had sickly or aged parents to support, especially if the imprisonment term is short. InYoganathan R v Public Prosecutor and another appeal[1999] 3 SLR(R) 346, the accused was charged with taking care of his aged mother suffering from diabetes. After carefully considering the aggravating and mitigating circumstances of the case, Yong CJ enhanced the sentence of the accused, explaining at [41] that: 41    … As for the mitigating factors raised by counsel, the district judge was right to give them little regard. The potential hardship which would be caused to the appellant’s mother and his fiancée as a result of his imprisonment term did not appear to be so exceptional as to warrant the imposition of a lighter sentence on the appellant (Lai Oei Mui Jenny v PP[1993] 2 SLR(R) 406), whilst the remaining mitigating factors brought up by counsel were outweighed by the aggravating circumstances present in this case (Sim Gek Yong v PP[1995] 1 SLR(R) 185 at [9]). 69     I am therefore constrained to attach little weight to the effect of the conviction on the Respondent’s personal livelihood and the hardship caused to his father, as the imprisonment term is relatively short and I do not see any exceptional circumstances in this case. 70     However, like the learned District Judge below, I take into account the following factors in mitigation: (a)     the Respondent is a first time offender and does not have any criminal antecedents of a similar nature; (b)     the Respondent has cooperated fully with the police during investigations; (c)     the Respondent has expressed genuine remorse for his conduct and has sought psychiatric help; and (d)     the extent to which public peace was affected was low. 71     The above factors were corroborated by the Investigating Officer who also testified that he was not aware of any problems affecting public peace or harmony that arose from or connected with the Respondent’s posting and there was only one report made to the police. However, I would not attach too much weight to the last factor given that the chief consideration when imposing a custodial sentence in the present case is to deter other like-minded members of society from engaging in such irresponsible behaviour. If the Respondent’s conduct had actually caused public peace to be breached, that would, depending on the extent of violence incited, probably constitute a severe aggravating factor for sentencing.",
        "Conclusion": "72     After having considered and weighed all the circumstances of this case, I would allow the Prosecution’s appeal against sentence on the ground of manifest inadequacy. After taking into account the mitigating factors above, I set aside the fine of $6,000 below and enhance the sentence to a custodial sentence of 2 months’ imprisonment.  [note: 1]Agreed Statement of Facts, ROP pp 133-134 [note: 2]ROP p135 [note: 3]GD at [37] [note: 4]GD at [46], [49] [note: 5]GD at [46] [note: 6]Record of Proceedings (“ROP”) at pages 405-406. [note: 7]ROP at page 175. [note: 8]Miscellaneous Offences (Public Order and Nuisance) (Amendment) Bill, column 697"
    }
}