{
    "case_title": "Kay Lim Construction & Trading Pte Ltd\n      v\n      Soon Douglas (Pte) Ltd and another",
    "ncitation": "[2012] SGHC 186",
    "coram": "Quentin Loh J",
    "sections": {
        "Facts": "1       The Plaintiff, Kay Lim Construction & Trading Pte Ltd (“Kay Lim”) carries on the business of building and construction and secured a contract from the Housing & Development Board (“HDB”) to construct seven blocks of public residential buildings and associated works for an HDB project known as the Punggol East Contract 18 (“the C-18 project”). The 1stDefendant, Soon Douglas (Pte) Ltd (“Soon Douglas”), carries on the business of renting and leasing outinter alia, tower cranes. Soon Douglas is accredited by the Ministry of Manpower (“MOM”) as an Approved Crane Contractor (“Approved Crane Contractor”) under the Workplace Safety and Health (Operation of Cranes) Regulations.[note: 1] 2       Kay Lim entered into a Rental Agreement No. SDPL-0462 dated 26 June 2008 (the “Rental Agreement”) with Soon Douglas for the lease of seven Jaso J240 tower cranes (the “Tower Cranes”) for use at the C-18 Project worksite. Under the Rental Agreement, Soon Douglas was responsible for the delivery, erection, as well as the dismantling and removal of the Tower Cranes from the site. After erection, each tower crane had to be tested and approved by an Authorised Examiner, a professional engineer, who would then have to issue a Certificate of Test/Thorough Visual Examination of Lifting Equipment[note: 2]before it could be used. Thereafter, Kay Lim’s workmen would operate the Tower Cranes during the course of construction. 3       The relevant tower crane, Tower Crane JASO J240DR S/N 0036 (“Tower Crane 4”) was delivered and erected at the worksite close to Block 610B on 24 February 2009. 4       What follows is not really in dispute. Insofar as they are or are outside the agreed facts, they constitute my findings of fact. 5       Unknown to Kay Lim, Soon Douglas had entered into an agreement, dated 12 February 2010, with the 2ndDefendant, Chit Guan Engineering Resources Pte Ltd (the “Subcontract” and “Chit Guan” respectively) to provide labour to Soon Douglas for the erection and dismantling of the Jaso Tower Cranes.[note: 3]It was common ground that Soon Douglas subcontracted the delivery, erection, dismantling and removal of the Tower Cranes to Chit Guan. Chit Guan was also an MOM Approved Crane Contractor.[note: 4]One Bohari bin Juahir (“Bohari”) and one Tachajaroen Chaiwat (“Chaiwat”) were under the employ of Chit Guan. Chit Guan is apparently no longer active in the market and its insurers have repudiated liability.[note: 5]",
        "The crane collapse": "6       Sometime in December 2009 or January 2010, when the C-18 project was near completion, Kay Lim requested Soon Douglas to remove the Tower Cranes. Three Tower Cranes were dismantled and removed without mishap. 7       On 17 March 2010, Chit Guan sent a team of workers, including Chaiwat and Bohari, to dismantle and remove Tower Crane 4 from the worksite using the jacking down method. Bohari was responsible for supervising the workers and overseeing the dismantling works. At about 5.15 pm, Tower Crane 4 suddenly collapsed whilst it was being jacked down (the “Accident”). One worker was killed and three others were injured. 8       There is also no real dispute over the cause of the collapse. The Accident was due to the failure of Chit Guan’s team of workers to adhere to the safe method of dismantling and jacking down of the tower crane. Jacking cage brackets were used in the jacking down method to secure the top section of the crane to the top mast section, and the safe method of jacking down was to secure the four jacking cage brackets to the slewing table by using eight jacking cage pins before removing the four mast pins, which secured the top section of the tower crane to the top mast section. For some unknown reason, Bohari instructed the workers to remove the four mast pins before securing the slewing table to the jacking cage brackets. As a result, the top section of the crane was free and unsecured and merely resting on the top mast section. It was in this state when Chaiwat, an unregistered crane operator, climbed into the crane cabin and, as part of the jacking down process, operated the crane by swinging the jib and moving the trolley attached to the jib.[note: 6]The top section of the crane tipped backwards and toppled to the ground. The Accident was caused by these fatal series of errors by Chit Guan’s team of workers in dismantling Tower Crane 4.[note: 7]",
        "Events Subsequent to the Accident": "9       Following investigations into the Accident by the MOM, Bohari and Chit Guan were charged under s 15(3) and s 12(1) of the Workplace Safety and Health Act (Cap 354) respectively. Both pleaded guilty. The director of Chit Guan, one Koh Hwa Khoon, also pleaded guilty to a charge under s 48(1)(b) read with s 12(1) of the same Act.[note: 8] 10     Kay Lim subsequently commenced the present action against Soon Douglas. After Soon Douglas’s defence was filed, Kay Lim amended the Writ of Summons by adding Chit Guan as a second defendant to the proceedings. Kay Lim alleged that the negligence of Chit Guan’s servants or agents had caused Tower Crane 4 to collapse, thereby causing them loss and damage. Chit Guan failed to enter a defence and Kay Lim entered interlocutory judgment against Chit Guan under O 19 of the Rules of Court (Cap 332, R5, 2006 Rev Ed) (“ROC”) on 9 September 2011. 11     Soon Douglas also served a third party notice pursuant to O 16 r 1 of the ROC on Chit Guan to indemnify Soon Douglas against any liability in respect of Kay Lim’s claim. Judgment in default of appearance was entered under O 13 of the ROC against Chit Guan on 6 September 2011. 12     The only issue before me in the present action is the liability of Soon Douglas to Kay Lim for breach of contract. The quantum of damages is to be assessed at a separate hearing. I gave oral judgment on 8 August 2012. I give these reasons to aid the assessment of damages and in the event any party wishes to take this further.",
        "Kay Lim’s Claim": "13     Kay Lim’s claim against Soon Douglas is founded in contract,viz, there was a breach of implied terms of the Rental Agreement that Soon Douglas would provide properly skilled and qualified labour and trained personnel to dismantle the Tower Cranes and that Soon Douglas would ensure that the dismantling and removal of the Tower Cranes would be done in a skilful and proper manner in accordance with any operating instructions issued for them, thereby causing Kay Lim,inter alia, the following heads of loss: (a)     damage at the work site; (b)     damage to: (i)       equipment and building materials on the C-18 project work site; (ii)       the gondola(s) hanging at the external wall of Block 601C; (iii)       the external wall of Block 601C; (iv)       the parapet wall and roof fascia at Block 601C; (v)       the roof slab on the top floor of Block 601C; (vi)       canopies at Block 601C; (vii)       architectural works at Block 601C; (viii)       the ceiling and wall of the unit #16-632 at Block 601C; and (ix)       the roof fascia and the canopy of a unit at Block 601B; (c)     the delay of the C-18 project caused by a Stop Work Order issued by the Building and Construction Authority as a result of the accident and subsequent rectification works to rectify the damages; and (d)     losses resulting from the restriction placed on Kay Lim from tendering for HDB projects for three months with effect from 1 April 2010.",
        "Soon Douglas’s Defence": "14     Soon Douglas claimed that the accident was not caused by them but by Chit Guan, who were independent contractors. Soon Douglas was not responsible or vicariously liable for the latter’s negligence. Upon Kay Lim’s confirmation that its claim was solely based on contract, the independent contractor issue fell away. 15     Soon Douglas denied the existence of the alleged implied terms in the Rental Agreement; and even if there were such implied terms, it was denied that they had breached the implied terms or that the Accident was caused by the breach of those terms. 16     Soon Douglas contended in the alternative that it was entitled to rely on the following express terms of the Rental Agreement: (a)     Kay Lim’s claim against Soon Douglas was excluded by the operation of Cl 3.7.2; (b)     Soon Douglas was entitled to claim an indemnity from Kay Lim under Cl 3.7.1; (c)     Kay Lim was in breach of Cl 3.4.2 by failing to procure insurance for Soon Douglas; and (d)     Soon Douglas was entitled to set off-in diminution or extinction of Kay Lim’s claim the indemnity Soon Douglas was entitled to under Cl 3.7.1 and/or damages for breach of Cl 3.4.2 by Kay Lim.",
        "The issues": "17     The agreed issues were formulated as follows: (a)     whether there were implied terms in the Rental Agreement that: (i)       Soon Douglas would provide properly skilled and qualified labour and trained personnel to dismantle and remove the Tower Cranes from the site; and (ii)       Soon Douglas would ensure that the dismantling and removal of the Tower Cranes would be done in a skilful and proper manner in accordance with any operating instructions issued for it; (b)     if there were such implied terms, whether Soon Douglas had breached the same; and (c)     whether the express terms in the Rental Agreement were such that: (i)       Kay Lim’s claim against Soon Douglas was excluded; (ii)       Soon Douglas was entitled to an indemnity from Kay Lim against Kay Lim’s claim; and (iii)       Kay Lim was obliged to insure Soon Douglas as a joint assured against all liability arising from the use, possession or operation of the Tower Cranes.",
        "The Implied Terms": "18     The Rental Agreement was on the standard terms and conditions of Soon Douglas. There can be no doubt that Kay Lim and Soon Douglas knew they carried on their respective businesses within the statutory and regulatory regimes in Singapore in relation to work sites, safety, construction practices and codes and the licensing of various trades and kinds of workmen. Moreover the Rental Agreement stipulated the site to be: “HDB Ponggol East C18”. It is well known that the HDB, along with other statutory undertakers in Singapore, has a system of demerit points for breaches of safety and other regulatory codes; a contractor may be debarred from participating in HDB contracts if it accumulates more than the stipulated limit of demerit points. It is thus not surprising to find the following clauses in the Rental Agreement: (a)     Cl 3.3.1 imposes an obligation on Kay Lim: To use the [Tower Cranes] in a skilful and proper manner in accordance with any operating instructions issued for it and to ensure it is operated and used by properly skilled and trained personnel. (b)     Cl 3.8.2 provides as follows: [Soon Douglas] will provide labourand crane of up to a maximum of 100 ton onlyto dismantle and remove the [Tower Cranes] from site. Where it is necessary to use a crane exceeding 100 ton to dismantle and remove the [Tower Cranes] at site, the costs of using such a crane shall be borne by [Kay Lim]. [emphasis added] However, the Rental Agreement is silent on whether the labour provided by Soon Douglas has to be skilled and qualified and whether the dismantling and removal of the Tower Cranes have to be done in a proper, skilful and workmanlike manner in accordance with the operating instructions issued for the Tower Cranes. 19     Yet it is clear from the express terms of the Rental Agreement that Soon Douglas would be responsible for obtaining the requisite approval for the Tower Cranes to be erected and operated at the worksite: APPROVAL FROM RELEVANT AUTHORITIES After the signing of this Agreement, [Soon Douglas] will submit necessary application to the Ministry of Manpower (MOM), CAAS and MINDEF to seek approval for the erection operation and commissioning of the Equipment at the site. Soon Douglas would deliver and erect the Tower Cranes, and upon notice or expiration of the rental period, Soon Douglas would provide the labour and equipment to dismantle and remove the Tower Cranes. Under the Rental Agreement, Soon Douglas would be in effectivecontrolof the Tower Cranes for the purposes of erection and dismantling, and Kay Lim had an attendant express obligation to provide clear and good access to the area surrounding the Tower Cranes to enable Soon Douglas to undertake these works. 20     These express terms obliging Soon Douglas to obtain approval for the erection and operation of the Tower Cranes and for Kay Lim to use only skilled and trained personnel to operate the Tower Cranes in a skilled and proper manner indicate that the parties had contracted on the implicit assumption that compliance with the regulatory regimes on the use and operation of lifting machinery was an underlying basis of their contract. The requirements for compliance would certainly extend not only to the procuring of initial approval for the use of the Tower Cranes and their operation thereafter, but also the erection and dismantling of the Tower Cranes, which would necessitate an even greater degree of caution and the employment of persons not only with specialised skills but also the requisite certification. Only companies that are certified by the MOM as Approved Crane Contractors may carry out installation, alteration and dismantling works on tower cranes. Individual personnel of the companies may also be certified as Approved Crane Erectors, although no evidence was led to explain whether this meant that all erection and dismantling work had to be subject to the onsite supervision of such personnel. It was common ground that Soon Douglas was an Approved Crane Contractor and Mr Lim Chor Hong (“Mr Lim”), the Senior Operations Manager of Soon Douglas, gave evidence that crane suppliers would have their own team for erection and dismantling.[note: 9]It is also not disputed that Kay Lim was not an Approved Crane Contractor. 21     It is settled law that terms implied in fact are based on thepresumed intentionsof the parties to the contract and are not dependent on proof of theactual intentionsof the parties. It is also settled law that the two traditional tests for implying a term in fact are the ‘business efficacy’ and ‘officious bystander’ tests, set out in the Court of Appeal’s decision inNg Giap Hon v Westcomb Securities Pte Ltd and other[2009] 3 SLR(R) 518 (“Ng Giap Hon”) at [36], citing the decision of Andrew Phang J, as he then was, inForefront Medical Technology (Pte) Ltd v Modern-Pak Pte Ltd[2006] 1 SLR 927 (“Forefront”) at [29]-[31]. The relationship between the two tests is complementary and not alternative; the ‘officious bystander’ test is thepractical modeby which the ‘business efficacy’ test is implemented (perAndrew Phang J inForefrontat [36]). 22     Kay Lim submitted that terms that Soon Douglas would provide properly skilled and qualified labour and trained personnel to dismantle and remove the Tower Cranes and that Soon Douglas would ensure that the dismantling and removal of the Tower Cranes would be done in a skillful and proper manner in accordance with any operating instructions issued for the Tower Cranes should be implied into the Rental Agreement (hereafter the “Implied Terms”). The Implied Terms were necessary to give business efficacy to the Rental Agreement as the erection and dismantling of the Tower Cranes was a specialised task and Kay Lim’s very purpose of entering into the Rental Agreement was to rely on Soon Douglas’s expertise as Kay Lim was not an Approved Crane Contractor. It was also submitted that the officious bystander test would be satisfied as it was Soon Douglas’s own witness’ evidence that from the operational point of view, Soon Douglas had to provide properly qualified workers and ensure that these workers performed the dismantling process in a proper, careful and workman-like manner.[note: 10] 23     I agree. I would have thought that these points were self evident when viewed against the nature of this contract and the facts of this case. Mr Michael Eu (“Mr Eu”), counsel for Soon Douglas (or more correctly Soon Douglas’s insurer) sought to persuade me otherwise. He valiantly submitted that the Implied Terms would amount to an unduly onerous obligation on Soon Douglas toguaranteethat only properly skilled and qualified workers would dismantle the Tower Cranes and aguaranteethat the workers would perform the dismantling process in a proper manner in accordance with any operating instructions. Soon Douglas further argued that the Implied Terms were inconsistent with the express terms of the Rental Agreement, namely, the indemnity and exclusion clauses found in Cl 3.7. Even if a term were to be implied, the implied term could only be that Soon Douglas would usereasonable skill and careto provide properly skilled and qualified labour and trained personnel and would usereasonable skill and careto ensure that these personnel would dismantle the Tower Cranes in a skillful and proper manner in accordance with any operating instructions. 24     During oral submissions, after a short debate, Mr Eu, rightly in my view, conceded that Soon Douglas’s obligations included ensuring that only duly licensed and skilled workmen would undertake the dismantling of Tower Crane 4 and ensuring that those workmen would do so in a proper and workmanlike manner. Based on the relevant factual context and the express contractual obligations undertaken by each party respectively, I am of the view that the Implied Terms are necessary to give business efficacy to the contract. They would easily satisfy the officious bystander test as well. 25     It would have been obvious to both parties at the time of contracting that the hired Tower Cranes could not be used safely at the worksite unless Soon Douglas erected and dismantled the Tower Cranes using properly trained, licensed and qualified workers and with proper skill and care in accordance with safe operating procedures, and that a failure to do so would defeat the commercial purpose of entering into the Rental Agreement. Kay Lim did not have the relevant expertise in this particular area, and would necessarily be relying on Soon Douglas, who is an Approved Crane Contractor, to perform this task. 26     An important part of Soon Douglas’s case was that Kay Lim knew that the erection and dismantling of the Tower Cranes would be done by Chit Guan, a subcontractor, and Soon Douglas had no direct control over the performance of the task by their subcontractors and cannot be taken to have guaranteed their performance. Kay Lim disputed this. Having heard the witnesses under the brief cross-examination on this point, I find as a fact that Kay Lim did not know at all material times that Soon Douglas had engaged Chit Guan to carry out the erection and dismantling works. The external evidence was also consistent with this finding. The documents submitted prior to dismantling named the contractor and workers carrying out the dismantling as being from Soon Douglas.[note: 11]As against all these documents, Soon Douglas attempted to rely on one set of documents submitted by the professional engineer employed by them to certify that the tower crane had been properly erected, checked, tested and certified fit to be operated and used by Kay Lim. First, these documents were submitted after erection of the cranes, not before. Secondly, they did not refer to or deal with the dismantling of the cranes. Thirdly, the first two pages were certificates issued by the professional engineer which made no reference to Chit Guan and it was only the accompanying Appendix F which stated in one line that the approved crane erector was Chit Guan. Kay Lim’s Project Manager, Mr Lam Chee Wei, was cross-examined on this point and I accept his evidence that it would have been handed to his supervisor. Mr Lam Chee Wei never admitted that he saw those documents and gave evidence that his staff may have thought that Chit Guan were representatives of Soon Douglas and that they only dealt with Soon Douglas. 27     The Rental Agreement, which was very comprehensive in protecting Soon Douglas, was completely silent on the latter’s right to subcontract out its erection and dismantling work and (as Soon Douglas attempted to submit) their responsibilities therefor. Further, Soon Douglas had prepared a set of documentation setting out risk assessments and the safe work procedures to be followed which was forwarded to Kay Limfor approval, and the document, entitled Safe Work Procedures for Dismantling of JASO Tower Crane, stated as follows: 1.General a.    Soon Douglas’s supervisors and workers involved in jacking work aretrained and competentcarried [sic] out such work. … 2.Preparation … b.    Supervisor to brief workers on the site constrains and addition precaution [sic].Sequence of the erecting process and the method being used should be strictly adhered to. …[note: 12] [emphasis added] Soon Douglas thusin factproceeded on the basis thatit hada duty to Kay Lim under the Rental Agreement to provide trained and competent workers to perform the dismantling in a skilled, workmanlike and proper manner following the requisite safety protocol and jacking down procedure. During cross-examination, Mr Lim, also readily agreed to the same.[note: 13]I find it hard to think it could be otherwise, given the repeated emphases over the years on safety at worksites by the regulatory authorities and stakeholders in the construction industry; it would go without saying that safety is a paramount consideration at all times at construction sites. In my view, neither party could venture to suggest otherwise. Moreover, Soon Douglas cannot evade its contractual obligations by subcontracting out its work. A breach of Soon Douglas’s contractual obligation to Kay Lim by Soon Douglas’s subcontractor would be a breach by Soon Douglas of its obligation to Kay Lim. 28     I am not persuaded by Soon Douglas’s contention that the Implied Terms would not have been necessary or obvious to them because it was anonerous obligation to guarantee the performance of their subcontractors. In my view, the express obligation under the contract to provide labour to dismantle the crane should be construed as an obligation of performance undertaken by Soon Douglas as the immediate contracting party, and not merely an obligation to use reasonable care and skill to choose a subcontractor to undertake those obligations. The cranes were owned by Soon Douglas and Soon Douglas was itself an Approved Crane Contractor who outsourced the dismantling because it was short on manpower, not because it did not have the capability to do so itself.[note: 14] 29     Finally, I reject Soon Douglas’s submission that the Implied Terms are inconsistent with Cl 3.7.1 and Cl 3.7.2 of the Rental Agreement. Cl 3.7.1 and Cl 3.7.2 will be considered in greater detail below, but it suffices for present purposes to note that Cl 3.7.1 requires Kay Lim to indemnify Soon Douglas for certain losses, claims and liabilities and Cl 3.7.2 exempts Soon Douglas from liability to Kay Lim for particular forms of loss. The former imposes anindependent primary obligationon Kay Lim and the lattermodifies the secondary obligationowed by Soon Douglas to Kay Lim to pay damages for breaches of primary obligations. Counsel for Soon Douglas did not explain why the Implied Terms contradicted the express terms of the Rental Agreement, and I am unable to see how either of these clauses impact upon an entirely separate and unconnectedprimary obligationon Soon Douglas to provide trained and skilled workers and to ensure that the dismantling of the Tower Cranes is done in a proper and skilled manner.",
        "Was there a breach of the Implied Terms?": "30     The parties did not dispute the cause of the Accident. Both parties accepted that Bohari, an MOM-approved crane erector and also a licensed crane operator who was assigned to oversee and supervise a team of seven workers deployed to dismantle Tower Crane 4, had recklessly instructed and/or allowed the team of workers to follow an unsafe and improper jacking down procedure,viz, the removal of all four mast pins before securing the top section of the crane through the four jacking cage brackets, thereby leaving the top section of the crane free and unsecured when the top section of the crane should not have been left unsecured at any time. As part of the dismantling process, Bohari had also assigned Chaiwat – an unlicensed crane operator – to operate the crane by moving the jib and the trolley. Chaiwat had some experience in crane operation outside of Singapore, but only in simple and straightforward hoisting works, and had been deployed to operate Tower Crane 4 because a licensed crane operator in the team was not available.[note: 15]It is not clear at all why Bohari did not operate the crane himself. In the Statement of Facts submitted in MOM Summons No.96 of 2011, Chit Guan admitted to failing to ensure that the safe method of jacking and dismantling was adhered to by its supervisors and workers, not having a system in place to ensure the same, and leaving the responsibility entirely to its supervisor, Bohari. Chit Guan also admitted to not ensuring that only registered tower crane operators were tasked to operate Tower Crane 4.[note: 16] 31     I accordingly find that Soon Douglas was in breach of its duty under the Implied Terms to provide skilled, competent and trained workers to carry out the particular specialised tasks involved in the dismantling works. Soon Douglas was also in breach of its obligations to ensure that the dismantling of Tower Crane 4 was done in a skilful, proper and workmanlike manner as it failed to ensure a system and/or supervision so that workers involved in such dismantling works would adhere to safe and proper methods of work.",
        "Do the express terms of the Rental Agreement preclude Kay Lim’s claim against Soon Douglas?": "32     A large part of the dispute centred on the following contractual clauses which Soon Douglas contended negatived their liability to Kay Lim: 3. HIRER’S COVENANTS The Hirer...agrees: ... 3.4INSURANCE 3.4.1 To insure the Equipment and keep the Equipment insured throughout the Rental Term for their full value against all risks on a comprehensive policy. Insured value: S$350,000.00 per unit. 3.4.2 To insure the Owner and the Hirer as joint assureds against all liability including public liability to third persons for death personal injury and damage to or loss of property arising directly or indirectly out of the use possession or operation of the Equipment. ... 3.7INDEMNITY 3.7.1 To indemnify the Owner against all loss actions claims demands proceedings (whether criminal or civil) costs legal expenses (on a full indemnity basis) insurance premiums and calls liabilities judgments damages or other sanctions arising directly or indirectly from the Hirer’s failure or alleged failure to carry out its duties under this Agreement or by reason of any loss injury or damage suffered by any person from the presence of the Equipment or the delivery possession use operation removal dismantling or return of them from any defects in the Equipment. 3.7.2 The Owner shall not be liable or responsible for any direct or consequential loss suffered by the Hirer in consequence of any downtime, stoppage of work, compliance with any order or directive from any judicial or governmental authority or by reason of any loss injury or damage suffered by any person from the presence of the Equipment or the delivery possession use operation removal dismantling or return of them or from any defects in the Equipment.",
        "Is Cl 3.7.1 (Indemnity) void for illegality?": "33     Soon Douglas sought to rely on Cl 3.7.1 to avoid liability. Kay Lim contended that Cl 3.7.1 is void for illegality as it purports to impose an obligation on Kay Lim to indemnify Soon Douglas against “all loss actions claims demands proceedings (whethercriminalor civil)” [emphasis added]. It is against public policy for a party to indemnify another against loss, actions, claims, demands or proceedings arising out of or from the consequences of a crime. Mr Richard Tan, counsel for Kay Lim relied on the following passage inHalsbury’s Laws of Singapore 2009 reissue Vol 7: Contractat para 80.363: ...there are degrees of illegality, andit is reasonable to suppose that the more extreme or virulent forms of illegality will preclude the doctrine of severance from operating at all...the vast majority of cases where severance has not only been considered but has also been permitted are those dealing with contracts in restraint of trade. As we have already seen, such contracts are not considered contracts that are at the higher or upper levels, as it were, on the scale of illegality.Albeit by no means conclusive, particularly (as alluded to above) from a strictly rationalistic viewpoint, it is suggested nevertheless that the doctrine of severance is confined, in the main (if not solely), to contracts in restraint of trade... [emphasis added in italics] Mr Tan submitted that Cl 3.7.1 was phrased in such broad terms that it could potentially cover any form of criminal act. It was therefore not appropriate to apply the doctrine of severance; the entire clause should be excised from the Rental Agreement. Soon Douglas conceded that Cl 3.7.1 – read in its entirety – was contrary to public policy insofar as it purported to provide an indemnity against criminal liability, but argued that the “blue pencil” test could be invoked to sever the illegal portion of the indemnity clause. 34     With respect, I do not think Mr Tan’s restrictive reading ofHalsbury’s Laws of Singaporeis correct. In R.A Buckley onIllegality and Public Policy(Sweet & Maxwell, 2009) at para 19.23, the author states: … The English authorities sinceBennett v Bennettremain scanty but, such as they are, they establish that the mere fact that a stipulation provides for the commission of a criminal offence, even one technically punishable by imprisonment, will not ipso facto contaminate the rest of the contract and render it unenforceable. The court will evidently exercise a measure of discretion,and will probably confine the rejection of severance, and total denial of enforceability, to provisions which contemplate the more serious varieties of criminality. [emphasis added] The learned author ofTreitel on the Law of Contracts(Sweet & Maxwell, 2011) considers when an illegal promise may be severed at para 11-160: It has been said that there can be no severance of a criminal or immoral promise.But although this may be generally true, it seems that a criminal promise could be severed if it was made without guilty intent.It has also been said that there can be no severance of a promise to trade with the enemy or of a promise to defraud the Revenue.Promises are most frequently severed in contracts in restraint of trade; and it has been assumed that promises excluding the jurisdiction of the courts can be severed.The question whether other illegal promises can be severed at all is still an open one. [emphasis added] The overarching question with respect to severability is not whether the illegal contract falls within a particular category (eg, restraint of trade), but whether thenature and degreeof the illegality is such that it taints the entire clause or contract and renders it contrary to public policy to enforce even the unobjectionable portion. This approach necessarily requires the consideration of public policy based on the specific fact situation in each case and the exercise of discretion by the courts and there cannot be any hard and fast rules on the exact scope and limits of the doctrine of severance. 35     The Court of Appeal briefly considered the application of the “blue pencil” test inMan Financial (S) Pte Ltd (Formerly known as E D & F Man International (S) Pte Ltd) v Wong Bark Chuan David[2008] 1 SLR 663 at [127]: ... Put simply, in order to apply the doctrine of severance so as to save an otherwise (prima facie) offending clause, the court concerned must be able to run, as it were, a “blue pencil” through the offending words in that clausewithout altering the meaning of the provision and, of course, without rendering it senseless (whether in a grammatical sense or otherwise). In other words, the court will not rewrite the contract for the parties. 36     The condition that the severance could not alter the meaning of the clause was elaborated upon by the Court of Appeal inCLAAS Medical Centre Pte Ltd v Ng Boon Ching[2010] 2 SLR 386 at [70]: ... As we see it, by \"not altering the meaning\" does not mean that the original version of the clause and the modified clause (after running the blue pencil through) must mean the same. It is illogical to expect the two versions to be the same if the court needs to run the blue pencil through the original clause to excise something objectionable therein. The phrase \"not altering the meaning\" just means not altering the sense of what remains of the clause after running the blue pencil through. All it means is that the obnoxious portion must be capable of being removed without the necessity of adding to or modifying the wording of what remains: seeAttwood v Lamont[1920] 3 KB 571 at 593 per Younger LJ;T Lucas and Co Ltd v Mitchell[1974] Ch 129 andSadler v Imperial Life Assurance Co of Canada Ltd[1988] IRLR 388. ... 37     The illegality in Cl 3.7.1 stems from the words “whethercriminalor civil” in the parentheses following the word “proceedings”; Cl 3.7.1 thus imposes an obligation on Kay Lim to indemnify Soon Douglas foranyform of criminal liability. However, the words have to be construed in the context of a contract for the hire of specialised equipment in the construction industry. The illegality envisaged by this clause is not such an “extreme or virulent form of illegality” so as to preclude the operation of the doctrine of severance. This indemnity relates to criminal proceedings arising directly or indirectly fromKay Lim’s failure or alleged failureto carry out duties under the Rental Agreement or by reason of any loss, injury or damage suffered by any person from thepresence of the Tower Cranes or the delivery, possession, use, operation, removal, dismantling or return of them or from any defects in the Tower Crane. Cl 3.7.1 therefore seems to be mainly directed at criminal liability arising from strict liability and regulatory offences in the construction industry and those attributable to Kay Lim’s, and not Soon Douglas’s, own conduct or omissions. This potential illegality is not of such nature or degree that permeates the entire clause such that I should decline to enforce the unobjectionable portions of the clause on public policy grounds even if severance is possible. Civil indemnity clauses are a common means by which parties allocate risks contractually, and generally speaking, I do not see any strong public policy reasons why the courts should decline to enforce such a term if commercial parties have seen fit to include it as part of their bargain. 38     It is apparent that the “blue pencil” test may be readily applied to strike out the offending phrase “whether criminal or civil” from Cl 3.7.1 without altering the meaning of the remaining indemnity clause or rendering it grammatically senseless. Cl 3.7.1, without that phrase, is therefore not void for illegality, and I uphold the indemnity clause under Cl 3.7.1 to the extent that it does not apply to liability in criminal proceedings.",
        "What is the proper scope of Cl 3.7.1, Cl 3.4.2 and 3.7.2?": "39     I now turn to Soon Douglas’s reliance on these express clauses within the Rental Agreement to deny liability for Kay Lim’s claims. Soon Douglas is seeking to rely on Cl 3.7.1 and Cl 3.7.2 to exclude liability for breach of contract and/or to seek an indemnity for any liability it may be subject to in the present proceedings. General principles of interpretation 40     It is a matter of construction of the contract in every case to determine whether the scope of an exemption clause extends to cover the particular liability that has arisen. As Andrew Phang J, as he then was, observed inEmjay Enterprises Pte Ltd v Skylift Consolidator (Pte) Ltd (Direct Services (HK) Ltd, third party)[2006] 2 SLR(R) 268 at [14]: … Whether or not the exception clause in question does in fact cover such liability is not an automatic rule of law as such but, rather, a matter ofconstruction of the contract. In other words, the court's task is toconstruethe exception clause concerned in the context of the contract as a whole in order to ascertain whether the contracting partiesintendedthat the exception clause cover the events that have actually happened. … The Court of Appeal reiterated inSingapore Telecommunications Ltd v Starhub Cable Vision Ltd[2006] 2 SLR(R) 195 at [52], that it is trite law that exemption clauses are to be construed strictly and if a party seeks to exclude or limit his liability, he must do so in clear words. A court cannot, however, reject an exemption clause if the words are clear and unambiguous and susceptible of one meaning only: see Lord Diplock inPhoto Production Ltd v Securicor Transport Ltd[1980] 1 AC 827 at 851. The relatedcontra proferentumrule that “contractual provisions should prima facie be construed against the party who was responsible for the preparation of the contract and/or who is to benefit from the provision” (perHobhouse J inE E Caledonia Ltd v Orbit Valve Co Europe[1994] 1 WLR 221 at 227) also applies to exemption clauses. 41     These principles of construction are equally relevant to the construction of indemnity clauses. InSmith v. South Wales Switchgear Co. Ltd.[1978] 1 W.L.R. 165 (“South Wales Switchgear”) at 168, Viscount Dilhorne observed: While an indemnity clause may be regarded as the obverse of an exempting clause, when considering the meaning of such a clause one must, I think,regard it as even more inherently improbablethat one party should agree to discharge the liability of the other for acts for which he is responsible. [emphasis added] The courts will therefore start, and I emphasise the word ‘start’, with a similar presumption that parties are unlikely to have agreed to bear the liability for the acts of another unless set out in clear and unequivocal terms. Construction of Cl 3.7.1: Indemnity 42     Cl 3.7.1 contains two limbs. The first limb contains an indemnity given by Kay Lim to Soon Douglas from a failure to perform any of Kay Lim’s obligations under the Rental Agreement. Nothing turns on this limb. Soon Douglas relied on the second limb. The second limb contains an obligation by Kay Lim to indemnify Soon Douglas against all loss, actions, claims, demands, proceedings, costs, legal expenses (on a full indemnity basis), insurance premiums and calls, liabilities, judgments, damages or other sanctions by reason of: … any loss injury or damage suffered byany personfrom the presence of the [Tower Cranes] or the delivery possession use operation removal dismantling or return of them from any defects in the [Tower Cranes]. 43     The parties contended for a different interpretation of Cl 3.7.1. Soon Douglas contended that the ambit of Cl 3.7.1 clearly covered the present claims made by Kay Lim against it and that there was no ambiguity in the phrase “any person”; it included Kay Lim making a claim. Kay Lim submitted that the scope of Cl 3.7.1 could not extend to contractual liability incurred by Soon Douglas as a result ofloss suffered by Kay Lim due to Soon Douglas’s own breachof the Rental Agreement; applying thecontra proferentumrule, the phrase “any person” should be construed to refer to a third party or third parties, and not the contracting parties themselves. 44     In my view, on a true and proper construction, the second limb of Cl 3.7.1 only imposed an obligation on Kay Lim to indemnify Soon Douglas for any claims brought by third parties against Soon Douglas for losses suffered by the former or for any liabilities owed by Soon Douglas to third parties; it did not cover claims arising out of losses suffered byKay Limas a result ofSoon Douglas’s breach of contract. 45     First, while the phrase “any person” is, taken by itself, literally broad enough to include Kay Lim, in the context of the rest of Cl 3.7.1, it presupposes that the loss is one suffered by athird party. Within Cl 3.7.1 itself, the specific words “Hirer” and “Owner” are used to refer to the contracting parties. One would have expected this word to also be used,eg, “any personincluding the Hirer”, if the second limb was intended to also include losses incurred by the Hirer as a result of the Owner’s breach of contract. Secondly, the first limb provides that Kay Lim is liable to indemnify Soon Douglas for losses suffered by Soon Douglas as a result of Kay Lim’s breaches of its duties under the Rental Agreement, while the second limb encompasses general tortious or statutory liability that is not referable to the parties’ contractual obligations under the Rental Agreement. In the absence of clear and unequivocal language in the indemnity clause, I find it inherently improbable, and indeed bordering on commercial absurdity, that Kay Lim would have agreed to the circular obligation of indemnifying Soon Douglas for any claims brought by Kay Lim for loss and damage suffered as a result of Soon Douglas’s breach of contract. Construing the second limb as an obligation on Kay Lim to indemnify Soon Douglas for any liability incurred by Soon Douglas to third parties is the eminently more commercially sensible construction. Thirdly, if there are two possible ways to construe the words “any person” in the second limb of Cl 3.7.1, then the construction least favourable to Soon Douglas will be adopted. 46     Soon Douglas’s reliance on Cl 3.7.1 as a defence to Kay Lim’s claims accordingly fails. Construction of Cl 3.4.2: Insurance 47     Soon Douglas relies on Cl 3.4.2 to deny liability to Kay Lim as the latter was to insure both of them as joint assureds against all liability including liability to third persons for death, personal injury and damage to or loss of property arising directly or indirectly out of the use, possession or operation of the Tower Cranes. Soon Douglas argues that if proper insurance was in place, Kay Lim’s claims would have been met by the insurer and there would have been no rights of subrogation against it. This calls for an examination on three aspects. First, whether a clause requiring one party to a contract to take out insurance in the joint names of the parties against all liability means that that party cannot make a claim against the other party but must be content with what he can recover from the insurer; secondly, the nature and scope of the insurance policy that Cl 3.4.2 required Kay Lim to take out; and thirdly, whether such a policy was obtained, and if not, whether this was a breach of contract causing Soon Douglas to sustain loss and damage. 48     I now deal with the first aspect: does Cl 3.4.2 expressly or impliedly preclude Kay Lim from bringing this claim against Soon Douglas? This line of argument was alluded to by the parties in submissions but not fully developed. This issue is covered by binding authority. InWisma Development Pte Ltd v Sing - The Disc Shop Pte Ltd[1994] 1 SLR(R) 749, the Court of Appeal considered the relevant authorities from England, New Zealand and Canada and concluded at [31]: It is clear to us that in each of these cases, the court held that, on thetrue construction of the insurance clauseand otherrelevant provisions of the lease, the insurance was taken out for the joint benefit of the tenant and the landlord and that it was the intention of both parties that the landlord, in the event of a destruction of the building by fire, whether or not caused by the negligence of the tenant, was to recoup its loss from the insurance moneys. ... It is therefore a matter of construction in each case whether the presence of an insurance clause, seen within the context of the entire agreement between the parties, would evince an intention to relieve the other party from liability as the loss was to be covered solely by the insurance. 49     This same approach has been affirmed by the House of Lords inCo-Operative Retail Services Limited and others v. Taylor Young Partnership and others[2002] 1 WLR 1419 (“CRS”). The key question before the House of Lords was whether a party to a contract was not under an obligation to pay compensation to another contracting party for loss or damage as the entire cost of making it good was to be recovered from the insurers under a joint names policy, or whether the first party was under an obligation to pay compensation for the damage in the event that the insurance cover failed or proved to be inadequate (at [39]). It was held that this was a question of construing the relevant contractual scheme that the parties had entered into. 50     The context within which Kay Lim’s obligations arise under Cl 3.4.2 is a relevant starting point. Soon Douglas knew that their Rental Agreement was entered into for a building and construction contract where Kay Lim, as main contractor, required tower cranes to carry out their construction and building work. A main contractor would, in this context, invariably have to secure insurance cover for various classes of risk, the relevant two classes of risks for this case being first, all risks cover for their construction works and material and plant, machinery and equipment, otherwise known as Contractors’ All Risks (“CAR”) or Erection All Risks (“EAR”, which is sometimes used interchangeably with CAR policies but more correctly, covers erection of equipment and plant and associated buildings) cover and secondly, Public Liability or liability to third parties (“PL”) insurance cover. The former is colloquially known as Section I cover and the latter, Section II cover. All standard form construction contracts in use in Singapore and/or Letters of Award for construction works will require,inter alia, the main contractor to take out CAR/PL cover and have that in place before any works can start. This was exactly the case here.[note: 17]The main contractor invariably has to provide a copy of the insurance policy as well as proof of payment to ensure the policy is in force before it can start work. Usually there is a combined CAR/PL policy; at other times, there are separate CAR and PL policies issued. CAR/PL policy wording, terms and conditions, endorsements, extensions and exclusions are fairly standard in Singapore as they are invariably based on the ‘Munich Re’ form and endorsements (the form and wording of which is dictated by the reinsurer). Although Kay Lim did not produce the printed portion of the CAR/PL policy (often called the ‘jacket’ as it is a printed sheet folded into two and into which the schedule and endorsements would be inserted), the Section I insuring clause of CAR policies would invariably cover physical loss or destruction of or damage to the property insured from any cause, unless specifically excluded. Other older forms will afford Section I cover for any unforeseen and sudden physical loss or damage from any cause, other than those specifically excluded. 51     Cl 3.4.2 required Kay Lim to insure itself and Soon Douglas as joint assureds against all liability, including public liability to third persons for death personal injury and damage to or loss of property arising directly or indirectly out of the use possession or operation of the equipment. As a matter of construction, I cannot see how this can be read to mean that Kay Lim cannot bring any claims whatsoever against Soon Douglas for a breach of the Rental Agreement by Soon Douglas. This clause, together with Cl 3.4.1, requires Kay Lim to take out the usual Contractor’s All Risk and Public Liability policy that is available for construction contracts of this nature. It had to include a cross-liability clause, which Kay Lim’s policy did, so that for any of the risks usually insured under such policies, each party would obtain an indemnity from the insurer as if it were a separate insured and there would be a waiver of subrogation against a co-insured. As a matter of construction therefore, Cl 3.4.1 and 3.4.2 do not require Kay Lim to obtain insurance to cover Soon Douglas’s liability for any breaches of contract whatsoever to Kay Lim for which insurance cover cannot be obtained. For example one cannot obtain insurance cover for deliberate acts nor can one obtain cover for reckless acts which the party knows or foresees will result in loss or damage but wilfully ignores the danger by taking measures which he knows are inadequate because there is insurance to cover such loss or damage: seeFraser v B.N. Furnam[1967] 1 WLR 898. Also there is invariably no cover for loss or damage due to professional negligence or for product liability within the standard CAR/PL policy. 52     It is also important to note that Cl 3.4.2 describes the risk Kay Lim had to insure against as “all liability... arising directly or indirectly out of the use possession or operation” of the Tower Cranes. Unlike other clauses within the Rental Agreement, Cl 3.4.2 did not include the risks described by the words “delivery”, “removal”, “dismantling”, “return” or “defects” which were, for example, used in Cl 3.7.1 and 3.7.2. Both Cl 3.7.1 and Cl 3.7.2 contained similar phraseology: “...from the presence of the [Tower Cranes] ordeliverypossession use operationremoval dismantling or returnof them or from any defects in the [Tower Cranes]” [emphasis added]. This must mean, as a matter of construction of the contractual obligation to insure under Cl 3.4.2, that Kay Lim’s CAR/PL policy did not need to cover Soon Douglas’s risks during dismantling or return of the Tower Cranes. It would be consistent with the obligations undertaken by Soon Douglas under Cl 3.8 to dismantle and remove the Tower Cranes from the site. Furthermore, it bears mentioning that this was Soon Douglas’s own standard form contract. 53     On the second aspect, Soon Douglas contends that Mr Tng Kay Lim (“Mr Tng”), the Managing Director of Kay Lim, conceded in his AEIC that Kay Lim had not insured Soon Douglas. That submission is incorrect. Mr Tng only said that they each had a public liability policy and that he never agreed to obtain insurance to insure Soon Douglas against all claims which would be made by Kay Lim against Soon Douglas. Mr Tng’s evidence in this respect was not dented at all. In fact, although he had forgotten some details, the CAR/PL policy he had to and did obtain, and set out in Kay Lim’s Bundle of Documents at pages 13 to 25, complied with Kay Lim’s obligations under Cl 3.4.1 and 3.4.2. Its terms were the standard terms in use and Mr Tng was not effectively cross-examined on any particular term or cover that was alleged to be non compliant with Cl 3.4.2. On the contrary, some of Mr Tng’s answers showed that he did know that he had to get CAR cover and included “the one that covers all the contractors.”[note: 18] 54     Kay Lim’s CAR/PL Policy was obtained through a broker. The insured were named as: “KAY LIM CONSTRUCTION & TRADING PTE LTD & ALL HIS SUBCONTRACTORS & ALL THE CONTRACTORS OF EVERY TIER AND THE HOUSING & DEVELOPMENT BOARD AS JOINT INSURED FOR THEIR RESPECTIVE RIGHTS AND INTERESTS”. It is clear on construction and on authority that Soon Douglas falls within the words “ALL HIS SUBCONTRACTORS & ALL THE CONTRACTORS OF EVERY TIER” as the supplier of Tower Cranes with responsibility for delivery, erection, testing and certification and dismantling and removal of the Tower Cranes for this C-18 project. Mr Eu did not attack any specific term of this CAR/PL Policy as being non compliant with Cl 3.4.2. His few relevant questions related to whether Mr Tng covered each tower crane for $350,000. Mr Tng’s reply was that he could not remember but he did remember that Soon Douglas’s representative, one Patrick, had reminded him of this requirement. Again when asked whether he had taken out insurance cover for damage to equipment and plant, his answer was “Yes” and “This is the contractor all risk.”[note: 19]The CAR Policy was otherwise not touched on. 55     The CAR/PL Policy Section I, Material Damage All Risks Cover set out in the Schedule was for a contract value of $91,890,000. This is the same figure in the HDB Letter of Award.Prima faciethat would have included Kay Lim’s cost of constructing the residential blocks and associated works as well as its profit margin. That cost of construction would have included the cost of the Tower Cranes as its rental was not an insignificant sum. The burden of proof is on Soon Douglas to show that the CAR/PL Policy obtained by Kay Lim was not compliant with Cl 3.4.1 and 3.4.2. In the absence of any other evidence, on balance, I am prepared to hold that the broker would have checked, as is the usual practice, for the full contract value for Section I cover, which in the usual case would have included the cost and value of equipment and machinery to be used in the project and the Tower Cranes would have been included in this contract sum for the Section I cover. This would be especially so as during construction, the Tower Cranes were in Kay Lim’s possession and it would be Kay Lim’s employees who would be operating them. There was Section II cover for third party liability for up to $2,000,000 for any one claim and an unlimited amount for any one period. There was also a cross-liability clause which treated each party as a separate insured without rights of subrogation for Section II risks.Prima facietherefore, Kay Lim has procured the policy called for under Cl 3.4.1 and 3.4.2 and Soon Douglas has failed to show how it did not comply with those requirements. 56     A further point needs to be noted. Kay Lim’s CAR/PL policy contained the standard Plant and Machinery Clause in the Section II cover. Neither party referred to this clause. The first paragraph of this clause covered Kay Lim and Soon Douglas’s legal liability for claims in respect of bodily injury or damage to property arising directly or indirectly out of or caused by or in connection with any plant and machinery in the physical or “legal contract” of the “insured” or used in work undertaken by or on behalf of the insured. This was consistent with the insuring obligation under Cl 3.4.2. If the tower crane was being used by Kay Lim during construction, then both Kay Lim and Soon Douglas were covered against claims in terms of the liability just described. 57     However, the second paragraph of the Plant and Machinery Clause states: However, should such plant and machinery be specifically insured under any other Policy for Third Party Liability insurance the [insurer] will not indemnify the [insured] nor be called upon to contribute under this Policy for any liability attributed to the use of such plant. This exclusion of cover could potentially be a non-compliant cover. However, it must first apply, that is to say, a loss must have occurred during the construction phase and use of the Tower Cranes, which involved liability on the part of Soon Douglas, and if so, it might then be a breach of the insuring Cl 3.4.2 depending on Soon Douglas having its own policy, that policy’s terms and conditions and whether that policy covered such a loss. In the event, neither party explored this point although Soon Douglas’s Public Liability Policy was produced. I also pause to note that neither party explored whether Soon Douglas had its own All Risks cover for its tower cranes. These are points that have to be specifically pleaded and raised because CAR/PL policies are not meant to cover every class of risk and liability that would be attendant in a construction contract. For example, all workmen’s compensation and injury is separately insured and hence excluded from the CAR/PL policies. Similarly vehicles, even though owned by the main contractor or its subcontractors, are also excluded because in all likelihood, they have to carry their own third party liability cover by legislation. Invariably liability of professionals are not covered as they are expected to have their own professional liability cover (having said that, Kay Lim’s CAR/PL policy included a standard Section II RIBA 19(2)(A) endorsement with limited cover for some errors or omissions in design of the construction works). 58     In the final analysis, the Rental Agreement does not require Kay Lim to insure itself and Soon Douglas during the dismantling and removal of the Tower Cranes, and there was therefore no breach of the insuring clauses in Cl 3.4.1 or 3.4.2. Interpretation of Cl 3.7.2 59     Cl 3.7.2 is not the most precisely drafted of clauses. It can arguably be read in a number of ways. (a)     First, Soon Douglas shall not be liable or responsible: (i)       for any direct or consequential loss suffered by Kay Lim in consequence of any downtime, stoppage of work, compliance with an order or directive from any judicial or government authority; or (ii)       by reason of any loss injury or damage suffered by any person from the presence of the tower cranes, or the delivery possession use operation removal dismantling or return of them, or from any defects in the tower cranes. (b)     Secondly, Soon Douglas shall not be liable or responsible: (i)       for any direct or consequential loss suffered by Kay Lim in consequence of any downtime, stoppage of work, compliance with an order or directive from any judicial or government authority from the presence of the tower cranes, or the delivery possession use operation removal dismantling or return of them, or from any defects in the tower cranes; or (ii)       by reason of any loss injury or damage suffered by any person from the presence of the tower cranes, or the delivery possession use operation removal dismantling or return of them, or from any defects in the tower cranes. (c)     Thirdly, Soon Douglas shall not be liable or responsible for any direct or consequential loss suffered by Kay Lim: (i)       in consequence of any downtime, stoppage of work, compliance with an order or directive from any judicial or government authority from the presence of the tower cranes, or the delivery possession use operation removal dismantling or return of them, or from any defects in the tower cranes; or (ii)       by reason of any loss injury or damage suffered by any person from the presence of the tower cranes, or the delivery possession use operation removal dismantling or return of them, or from any defects in the tower cranes. 60     The first interpretation will not state the cause for the downtime, stoppage of work or compliance with an order or directive from any judicial or government authority. If the cause is not connected to or caused by Soon Douglas, then Soon Douglas would hardly need to exclude or limit a liability to Kay Lim that is non-existent. In the second interpretation, the liability or responsibility for “any direct or consequential loss suffered by Kay Lim” would only appear in the first limb but not the second. This also indicates that this interpretation is not quite suitable. The third interpretation is in my view the correct construction because it gives effect to the words used as they appear in Cl 3.7.2. 61     There is no difference whether the second or third interpretation is adopted as the relevant limb would be the first limb and not the second. This is because Soon Douglas’s defence based on the second limb of Cl 3.7.2 suffers from the same difficulty of construction as its defence based on Cl 3.7.1. The phrase “any person” in the second limb cannot be construed to include Kay Lim for the same reasons: see [44] and [45] above. It bears repeating that within the same sub-clause, the words “Owner” and “Hirer” are used. The second limb of Cl 3.7.2 therefore does not afford Soon Douglas a defence to a claim against it for any loss injury or damage suffered by Kay Lim itself. 62     Having said that, it is possible to construe the second limb in Cl 3.7.2 to extend to a situation where a claim is made by a third party against Kay Lim for loss, injury or damage and Kay Lim attempts to bring in Soon Douglas in third party proceedings for a contribution or an indemnity. However, no such claim is being made in this action and the pleaded claims are for Kay Lim’s own loss and damage. 63     Cl 3.7.2 provides that Soon Douglas shall not be liable or responsible for any “direct or consequential loss” suffered by Kay Lim for the reasons set out in the first limb (which will be examined below). What is covered by the phrase “consequential loss” is not without difficulty. 64     The standard textbooks likeMcGregoron Damages(Sweet & Maxwell, 18thEd, 2009) orChittyon Contractsvol 1 (Sweet & Maxwell, 30th Ed, 2008) or Andrew Phang Boon Leong (gen ed),The Law of Contract in Singapore(Academy Publishing, 2012) (“The Law of Contract in Singapore”), all refer to the various nomenclature used over the years, some of which cause more confusion than elucidation. Hence we have pecuniary and non-pecuniary loss, general and special damage, normal and consequential losses, direct and indirect loss and damage, and reliance or expectation loss and restitutionary damages. Whilst many more elements can be factored in for this already complex area of the law on damages, I need only mention two. 65     First, in the context of building and construction contracts, what may seem in nature to be consequential loss in other contracts, may actually be direct loss or loss falling within the first rule inHadley v Baxendale(1854) 9 Ex 341 (“Hadley v Baxendale”) at 355: ... the damages which the other party ought to receive in respect of such breach of contract should be such as may fairly and reasonably be considered either arising naturally,ie, according to the usual course of things, from such breach of contract itself ... Thus a main contractor’s claim against a subcontractor, whose work is on the critical path, for damages paid to the owner or other subcontractors for delays caused by that subcontractor, is within the first rule ofHadley v Baxendaleas it is a loss that may fairly and reasonably be considered as arising naturally and in the usual course of things from the subcontractor’s breach of his subcontract: seeeg,Croudace Construction Ltd v Cawoods Concrete Products Ltd[1978] 2 Lloyd’s Rep 55, (1978) 8 BLR 20 (“Croudace Construction”), where claims arising out of late delivery and defective masonary blocks for costs of loss of productivity, idle labour, additional costs of construction due to the delay and claims by other subcontractors for delays were held to be within the first rule ofHadley v Baxendaleand were not “consequential loss”. Similarly, where a defendant breached its obligation to design, supply, deliver, test and commission electrical equipment by providing poorly designed and badly installed equipment instead, which led to breakdowns in the power supply, the plaintiff’s claims for increased production costs and loss of profits were considered loss and damage arising under the first rule ofHadley v Baxendale: seeBritish Sugar plc v NEI Power Projects(1998) 87 BLR 42 (“British Sugar”). 66     Secondly, in the context of exclusion or limitation of liability clauses, the phrase “consequential loss” (as contrasted with “normal loss”), has been construed as confined to the second rule inHadley v Baxendale(at 355),viz: ... such as may reasonably be supposed to have been in the contemplation of both parties, at the time they made the contract, as the probable result of the breach. (See generallySingapore Telecommunications Ltd v Starhub Cable Vision Ltd[2006] 2 SLR(R) 195 which cited with approvalSaint Line Limited v Richardsons, Westgarth & Co, Limited[1940] 2 KB 99 (“Saint Line”),Croudace Construction,Hotel Services Limited v Hilton International Hotels (UK) Limited[2000] BLR 235,Deepak Fertilisers and Petrochemicals Corp v ICI Chemicals & Polymers[1999] 1 Lloyd’s Rep 387 andPegler Ltd v Wang (UK) Ltd[2000] BLR 218. The other cases within this line of authorities includeMillar’s Machinery Co Ltd v David Way & Son40 Com. Cas. 204 andBritish SugarandAddax Ltd v Arcadia Petroleum Ltd[2000] 1 Lloyd’s Rep 493.) 67     In my judgment, what these and other authorities show is that we should not be too pedantic with labels and nomenclature. What is direct in one context may be indirect in another and vice versa. Hence the more traditional classifications of damages as pecuniary and non-pecuniary, general and special damages, direct or normal and indirect or consequential loss and damages are helpful in some but not all situations. The current approach in looking to reliance or expectation loss or restitutionary damages looks more to the factual contexts of each type of case, the particular breach that has arisen and the purpose and award of remedies for that breach of contract. As stated inThe Law of Contract in Singaporeat para 20.008: Accepting that the law exists as a means to an end, to understand the law relating to the award of judicial remedies for breach of contract, it may be apposite to try and understand whatpurposesthese rules are meant to serve. So before proceeding any further, one might ask: “what interests of the contracting parties are the courts seeking to protect when it decides to ‘enforce’ the parties’ contractual rights? 68     We therefore more often than not have to bear in mind the context and type of contract. Also if the contractual provision in issue is an exclusion or limitation clause, then generally, it is still the rule that the exclusion or limitation must be expressed in clear words and any ambiguity or lack of clarity must be resolved against the party who drafted it, and the principle that exemption clauses must be constructed strictly means that the application must be restricted to the particular circumstances the parties had in mind at the time they entered into the contract: seeSingapore Telecommunications Ltd v Starhub Cable Vision Ltd[2006] 2 SLR(R) 195 at [52], citingHomburg Houtimport BV v Agrosin Private Ltd[2004] 1 AC 75 at [144] andHong Realty Pte Ltd v Chua Keng Mong[1994] 2 SLR(R) 90 at [19]. 69     Bearing these principles in mind, the words “direct loss” in the company limb of Cl 3.7.2 are fairly clear. As Waller LJ said inBritish Sugar, quoting Atkinson J inSaint Line, “direct loss” refers to loss and damage which flows naturally from the breach without any intervening causes and independently of special circumstances; and I would add, bearing in mind the context and the type of contract. This is the classic first rule ofHadley v Baxendale. The learned authors inThe Law of Contract in Singaporestate at para 20.058 that these are “ordinary” losses arising from a breach of contract given that the promisor-in-breach haddeemedknowledge of the “usual course of things” which would inflict such “ordinary” loss on the claimant. 70     The words “consequential loss” in Cl 3.7.2 are wider in import and can give rise to differences. Waller LJ said inBritish Sugarthat the word “consequential” when used in describing loss and damage arising from a breach of contract can be used in different and varying senses; it may be difficult to be sure in some contexts precisely what it means. For present purposes, it is sufficient again to adopt what is set out inThe Law of Contract in Singaporewith regard to the damages recoverable under the 2ndrule ofHadley v Baxendaleat para 20.061: it is those “damages for “extraordinary” losses in so far as the promisor-in-breach is proven to have hadactualknowledge of the special circumstancesbeyondthe “usual course of things” which led to the infliction of such “extraordinary” loss on the claimant.” As Cl 3.7.2 is an exclusion or limitation of liability clause, from the authorities cited above, the words “consequential loss” should be construed as only that loss which falls within the second rule inHadley v Baxendale. 71     The first limb of Cl 3.7.2 therefore provides that Soon Douglas shall not be liable or responsible to Kay Lim for any direct or consequential loss, in the sense discussed in the foregoing paragraphs, which are the consequence of,ie, the result of, any downtime, stoppage of work or compliance with an order or directive from any judicial or government authority from,ie, due to, the presence, removal, dismantling or return of the Tower Cranes. 72     Kay Lim’s claim encompasses losses based on liquidated damages payable for “delay” and costs and expenses incurred as a result of “delays”, and it is appropriate, at this juncture, to make some brief observation on the scope of the events enumerated in the first limb of Cl 3.7.2 and the applicability of the clause. There appears to be no technical or legal definition of the words “downtime”, “stoppage of work” or “delay”. The meaning of “compliance with any order or directive from any judicial or governmental authority” is self-evident. In relation to “delay”, inEcon Piling Pte Ltd and another (both formerly trading as Econ-NCC Joint Venture) v Shanghai Tunnel Engineering Co Ltd[2011] 1 SLR 246 Judith Prakash J considered the legal distinction between “delay” and interruption”, and said at [35]: In Chow Kok Fong,Construction Contracts Dictionary(Sweet & Maxwell Asia, 2006), “delay” is defined as (at p 103): delayn.In relation to the progress of construction works, refers to: (a) the period of time by which the works has fallen behind a specified time target;or(b) the difference in the time taken for the works to be actually completed against the period allowed for completion. There is no definition of interruption and ENJV did not put forward any other legal definition or any authority which supported its contention that the two terms had different meanings and consequences in law. The textbooks and the cases do not discuss that difference because, as the Arbitrator recognised, it is merely a matter of semantics, not substance. So long as there has been either a period of time by which the works have fallen behind a specified time target or a difference between the time taken for the works to be actually completed and the duration allowed for completion under the contract, there can be said to have been “delay” caused. The critical question is really which party had caused the delay. I respectfully agree. The word “delay” thus connotes a consequence or resulting position relating totime or duration; it may, depending on its context, itself have a secondary effect that subsequently results in other forms of losses, liabilities or consequences, such as the payment of liquidated damages for failure to complete by the period allowed for completion. 73     In contrast, the phrases “downtime” and “stoppage of work” are used in terms of their dictionary definitions to describe some form of“disruption” to theprogress or productivityof the construction works – although it must also be stressed that disruption does not have a defined technical meaning either – in the sense of a complete cessation or suspension of progress of the works. The word “disruption” is aptly described inKeating on Construction Contracts(Sweet & Maxwell, 9thedn, 2012) in the following terms at para 8-057: Definition.Disruption occurs where there is disturbance of the contractor’s regular and economic progress and/or delay to a non-critical activity even though, on occasion, there is no or only a small ultimate delay to completion. ... The term is also explained in Keith Pickavance,Delay and Disruption in Construction Contracts(Sweet & Maxwell, 4thedn, 2010) at para 1-036: ... In construction and engineering contracts, for a given work content, disruption is the difference between an intention and reality as to productivity, or achievement where the reality is derogation from the intent.Disruption is not delay.Although disruption may cause delay, and it may be caused by delay, delay is not a precondition of disruption and, indeed, disruption may be caused when the progress of the works previously delayed is recovered, or accelerated.Disruption is the term used to signify the condition precedent to a reduction in productivity which results in an increase in cost for a given quantity of work. [emphasis added] 74     It should be noted that in this exclusion clause, no reference was made to “delays” in a generalised form but only to certain stipulatedevents,viz, downtime, stoppage of work, compliance with judicial or government authorities’ orders or directives, that would cause the progress of construction to come to a complete stop. The heads of damage therefore cannot be excluded on the basis that they were attributable to some form of unspecified delays. Delay is not co-extensive with downtime, stoppage of work or compliance with a judicial or government authority’s order or directive, though it may be a consequence of it. 75     Although the Stop Work order was not an issue at trial, nor was any evidence led on this issue, there must have been a Stop Work order issued by Building and Construction Authority (“BCA”) since a tower crane collapsed and a workman died. In Kay Lim’s Schedule of Estimated Damages at Annex A of their Amended Statement of Claim, there is reference to a Stop Work Order issued by the BCA from 18 March 2010 to 31 March 2010. Such an order would fall within the exclusion as an order or directive issued by a government authority. 76     Drawing all these threads together, Cl 3.7.2 would therefore exclude any claims by Kay Lim against Soon Douglas that arise as a result ofthisperiod of the Stop Work order (assuming these dates are correct, and if not, it will be ascertained at the assessment of damages). This includes liquidated damages, if imposed, during this period, prolongation and disruption claims (eg, office overheads) and stoppage of work claims (eg, payment for idle workers who were not allowed to carry out any work, payments for any machinery or equipment that could not be used during this period, workers quarters and wasted or abortive transportation costs which had to be paid for, site office rental).Prima facietherefore, Kay Lim’s claims for liquidated damages during the period of the Stop Work order (see Serial No.16, Item X of Annex A to the Amended Statement of Claim) from 18 to 31 March 2010, (again assuming that the date is correct), even if proved, are excluded by the first limb of Cl 3.7.2. 77     However, construing the exclusion and limitation strictly or narrowly, claims falling outside the period of the Stop Work order –ie, after 31 March 2010 – and which are not attributable to the order are not caught by the exclusion. 78     The cost of replacement of damaged equipment or plant, rectification or remedial work on any of the works damaged by the accident, breaking up and removing of debris from or caused by the tower crane’s collapse or any professional fees incurred as a result of the foregoing items are clearly not caused by any downtime, stoppage of work or compliance with an order or directive from a government authority and are therefore, subject to proof, recoverable. 79     To aid the assessment of damages, since these are considerations of liability under exclusion or limitation clauses, I illustrate the principles to be applied. If, on the day of the accident, 17 March 2010, Kay Lim required 4 more weeks to complete its contract works,ie, up to 14 April 2010, and were on time, but because of the Stop Work order no work could be carried out from 18 to 31 March 2010, and because of the damage caused by the tower crane to the contract works, Kay Lim took another 12 weeks to remedy, repair and complete the contract works,ie, to 23 June 2010 (ie, 8 weeks to carry out repair and remedial works and checks, plus the original 4 weeks it would have taken to complete their works, if Soon Douglas had removed the tower cranes without mishap) claims falling outside the period of the Stop Work order and not otherwise attributable to the order can still be brought by Kay Lim against Soon Douglas. For example, assuming the hypothetical facts set out below are proved: (a)     If the original insurance cover (putting to one side the cover for the maintenance or defects liability period), would have been in force up to 14 April 2010 and as a result of the accident the insurance policy had to be extended to 23 June 2010, an additional period of 10 weeks, Kay Lim would only be entitled to claim the additional premium for the extended 10 weeks less the 2 weeks of the Stop Work order; although the 2 weeks of the Stop Work order was within a period when the policy was still in force, 2 weeks of the 10 weeks extension was attributable to the Stop Work order. (b)     If, as of 17 March 2010, a crew of 10 workmen were employed up to the scheduled completion, 14 April 2010, to do the external landscaping works (which invariably occur at the end of the contract), and because of the accident and ensuing damage and remedial works as well as their original works they had to be engaged up to 23 June 2010 to complete their external landscaping works: (i)       Kay Lim would not be able to make any claim for abortive wages for the period of the Stop Work order, 18 to 31 March 2010, as it is excluded by the first limb of Cl 3.7.2; (ii)       Kay Lim would not be able to make any claim for the wages incurred between 1 to 14 April 2010 as it would have been incurred in any event as part of Kay Lim’s contract for the original landscaping works; (iii)       Kay Lim would not be able to make any claim for the wages incurred between 15 to 28 April 2010, the additional 2 weeks after the original 4 weeks the workmen would have taken to complete their works, had the accident not happened, as this additional 2 weeks was the direct result of the 2 week Stop Work order; but, (iv)       Kay Lim is entitled to claim for the wages of these workmen for 8 weeks from 29 April to 23 June 2010 as this was not attributable to the Stop Work order but the breach of contract by Soon Douglas in dismantling Tower Crane 4. 80     Claims in Serial Nos. 19 to 25 in Annex A of the Amended Statement of Claim are listed under the main heading “Site running costs/expenses incurredas a result of delays” and may or may not be excluded by Cl 3.7.2. If the expenses were incurred as a result of delays attributable to the Stop Work order, during the period of the Stop Work order, these may be excluded by the first limb of Cl 3.7.2 either as direct or consequential loss. Based on the dates indicated by Kay Lim on the period of the Stop Work order, it appears that there was some additional delay from April to June after the Stop Work order on part of the site was presumably lifted at the end March; as illustrated above, the assessment of damages must therefore consider the extent to which the Stop Work order had a causative effect, and whether the delay was attributable to additional work required to be done on the site as a result of the crane collapse. The latter is not covered by the first limb of Cl 3.7.2 and the resulting expenses are accordingly recoverable. 81     I now need to deal with two further issues that were raised by the parties; the first relates to an implied term and the second relates to the Unfair Contracts Terms Act (Cap 396, Rev Ed 1994) (“UCTA”). 82     Kay Lim argued that, on the basis of thecontra proferentumrule, the exclusion of liability in relation to specific heads of damages would only apply if Soon Douglas fulfilled its contractual obligations, and that the second limb would not apply to exclude general liability for losses suffered by Kay Lim as a result of any defects or the delivery, use and dismantling of the Tower Cranes. 83     The language used in the first limb of Cl 3.7.2 is clear and I cannot read into it a qualification that it should only apply if Soon Douglas had fulfilled its “contractual obligations”. The authorities indicate that a distinction should be drawn between clauses that purport toexcludeliability and those whichlimitliability. InAlisa Craig Fishing Co. Ltd v Malvern Fishing Co. Ltd and another[1983] 1 WLR 964, Lord Fraser observed at 970: ... In my opinion [the principles of construction when considering the effect of exclusion or indemnity clauses] are not applicable in their full rigour when considering the effect of clauses merely limiting liability. Such clauses will of course be read contra proferentem and must be clearly expressed, but there is no reason why they should be judged by the specially exacting standards which are applied to exclusion and indemnity clauses. The reason for imposing such standards on these clauses is the inherent improbability that the other party to a contract including such a clause intended to release the proferens from a liability that would otherwise fall upon him.But there is no such high degree of improbability that he would agree to a limitation of the liability of the proferens... It is enough in the present case that the clause must be clear and unambiguous. [emphasis added] 84     In my view, the first limb of Cl 3.7.2 is a limitation clause that seeks to exclude liability forparticularheads of loss,ie, losses arising from downtime, stoppage of work and compliance with any order or directive from any judicial or governmental authority, without entirely absolving the party in breach from liability for other losses not attributable to the Stop Work order. The language is clear and unambiguous – it excludesanyloss flowing from those heads of damage, and if I were to read it as applying only where Soon Douglas has performed its contractual obligations, it would to all intents and purposes render this clause otiose, as Soon Douglas would not, in such an event, be liable as no losses would not have arisen in the first place as there was due and proper performance of its obligations.",
        "Are Cl 3.7.1 and 3.7.2 reasonable under s 3 of the Unfair Contract Terms Act?": "Scope of s 3 85     Section 3 of the UCTA states: 3.—(1) This section applies as between contracting partieswhere one of them deals as consumer or on the other’s written standard terms of business. (2)    As against that party, the other cannot by reference to any contract term — (a)when himself in breach of contract, exclude or restrict any liability of his in respect of the breach; or (b)    claim to be entitled — (i)    to render a contractual performance substantially different from that which was reasonably expected of him; or (ii)   in respect of the whole or any part of his contractual obligation, to render no performance at all, except in so far as (in any of the cases mentioned in this subsection) the contract term satisfies the requirement ofreasonableness. [emphasis added] 86     It was not disputed that the Rental Agreement was on Soon Douglas’s standard terms and conditions; the submissions on this point were confined to assertions that neither of the parties were dealing as a consumer and the relevant clauses were accordingly not subject to the requirement of reasonableness under s 3 or s 4 of UCTA. Kay Lim advanced the argument that the application of s 3 was not limited to Cl 3.7.2 (the exemption clause) but also extended to Cl 3.7.1 (the indemnity clause) as Soon Douglas was effectively relying on the indemnity clause to exclude its liability for breach of contract. 87     I am satisfied that the Rental Agreement was based on Soon Douglas’s written standard terms and conditions. Soon Douglas did not challenge the evidence given by Mr Tng that Soon Douglas had presented the contract to Kay Lim and that the parties did not negotiate on any of the terms apart from price. Soon Douglas also did not raise any argument with respect to the two other separate contracts presented by Kay Lim as evidence that Soon Douglas routinely contracted upon terms identical to those in the Rental Agreement. 88     It is clear on a plain reading of s 3 that s 3(2)(a) applies to Cl 3.7.2. The position may be somewhat more equivocal with respect to Cl 3.7.1, which does not expressly purport to “exclude or restrict... liability” but imposes an obligation on Kay Lim to indemnify Soon Douglas for certain losses or liabilities. It is true that the common law approach has been to treat an indemnity clause as “the obverse of an exempting clause” (per Viscount Dilhorne inSouth Wales Switchgearat 168) and the courts generally look to substance rather than form. However, UTCA also contains a specific provision in s 4 dealing with indemnity clauses, and this supports an interpretation that s 3 is not intended to cover indemnity clauses. It is therefore arguable that s 4 applies only where the indemnifier is acting as a consumer and has an ostensibly narrower scope than s 3; it may therefore have been a conscious legislative choice not to subject indemnity clauses in standard form contracts – which are very common – to the requirement of “reasonableness”. 89     In my judgment, it is clear that a court’s approach should be focused on the substantialeffectof the clause: seeThe Law of Contract in Singaporeat para 07.132 (and generally from paras 07.086 to 07.096): ...where the person providing the indemnity is the very person suffering the damage, theeffectof the clause would then be to exclude the liability of the person indemnified. The clause could then be subject, in addition to section 4, to the other provisions of UCTA where relevant. 90     Although on my construction of Cl 3.7.1, it is not strictly necessary for me to express an opinion on whether s 3 would apply, I would be prepared to hold that it does. Does Cl 3.7.2 satisfy the requirement of reasonableness? 91     The test of “reasonableness” is defined in s 11: 11.—(1)  In relation to a contract term, the requirement of reasonableness for the purposes of this Part...is that the term shall have been a fair and reasonable one to be included having regard to the circumstances which were, or ought reasonably to have been, known to or in the contemplation of the parties when the contract was made. ... (5)    It is for those claiming that a contract term or notice satisfies the requirement of reasonableness to show that it does. It should be noted at the outset that under s 11(5), once a contract term falls within s 3, it isprima facieunreasonable and the burden shifts to the party seeking to rely on the exemption clause to prove that the clause is reasonable. Counsel for a party seeking to rely on an exemption clause that is subject to the reasonableness requirement under s 3 should provide more than cursory assertions, and if necessary, adduce sufficient evidence of the relevant industry practice to discharge this burden. Under s 11(1), the court is also to determine the question of reasonableness at the time the contract is entered into, and not with hindsight after the contract is breached or when the dispute is before the court. 92     Soon Douglas’s meagre evidence and somewhat sparsely argued case was that the indemnity and exclusion clauses were reasonable because both parties had entered into the Rental Agreement in the course of their respective businesses and there was no imbalance of bargaining power. It was also argued that the parties had business dealings for over ten years and Kay Lim had never raised any objections to the inclusion of the indemnity and exclusion clauses; as the parties had entered into the terms freely, Kay Lim could not now renege on the clauses. 93     The “reasonableness” of a term under s 3 of UCTA was considered inKenwell & Co Pte Ltd v Southern Ocean Shipbuilding Co Pte Ltd[1998] 2 SLR(R) 583, where Warren Khoo J observed at [57]-[58]: 57    For my part, with respect,I find it difficult to see how the fact that the two parties were business or commercial entities dealing with each other in the course of business could go towards satisfying the reasonableness requirement.The Act is intended precisely to cover, indeed to cover only, business liability, and business liability is defined to mean a liability for breach of obligations or duties arising from things done or to be done in the course of business. See s 1(3). It is clear, I think, from the terms of s 3(1) that the protection provided by that section extends not only to those who enter into contracts as consumers; it also extends to any party, consumer or not, who enters into a contract on the other party's written standard terms. A business or commercial concern is not any the less protected by reason of being such. 58...It cannot be doubted that the mere fact that a party has apparently willingly entered into a contract containing exclusion or limitation terms does not prevent him subsequently from raising questions of reasonableness in accordance with the Act. The Act assumes that a contract has been properly entered into, in the sense that the normal consensus requirements for the formation of a contract have been satisfied. [emphasis added] I agree with the principle set out above that a party is still entitled to invoke UTCA even if he had freely entered into the contract containing the impugned term or simply did not turn his attention to the term. I therefore do not accept the argument that Cl 3.7.2 is reasonable merely because Kay Lim had repeatedly entered agreements on similar terms with the present Rental Agreement with no complaint or because the contracting parties were both commercial entities. What weight that has when placed on the scales of ‘reasonableness’ is another thing. I accept however that when dealing with two commercial entities a court should not be too quick to intervene on the ground of unreasonableness: seeThe Law of Contract in Singaporeat paras 07.089 and 07.136 which noted the sentiment expressed by Lord Wilberforce inPhoto Productions Ltd v Securicor Transport Ltd[1980] AC 827. 94     If the true position was that contended for on Soon Douglas’s broad and sweeping interpretation of Cl 3.7.2,viz, the clause excludesallliability for losses suffered by Kay Lim from the presence, delivery, possession, use, operation, removal, dismantling, return of the Tower Cranes and any defects therein, I would have found that the term did not satisfy the requirement of reasonableness. On Soon Douglas’s interpretation, the clause effectively nullifies Soon Douglas’s liability for almost every breach of its obligations under the Rental Agreement. 95     However, based on my attenuated construction of the proper scope of Cl 3.7.2, I am of the view that Cl 3.7.2 is reasonable as it is consistent with the allocation of contractual risk that two commercial parties of equal bargaining power are entitled to agree upon. 96     There is nothing to suggest that Kay Lim had not been in a position to enter into the Rental Agreement without the relevant exemption clause. Rather, Mr Tng candidly acknowledged that the parties were concerned only with negotiation of the price[note: 20]; Kay Lim had not been pressured into accepting the exemption clause on a take-it-or-leave-it basis and Kay Lim did not suggest that it was in an inferior bargaining position. I have also noted that under Cl 3.4.2, the parties expressly contemplated that an insurance policy would be procured to cover both parties’ potential liability tothird parties. 97     In the circumstances, I do not find that Cl 3.7.2 should be struck down as failing the reasonableness test under the UCTA provided it is accorded the narrow and strict construction as I have stated above.",
        "Conclusion": "98     For the reasons set out above, I give judgment accordingly. In summary: (i)     There is an implied term that Soon Douglas would provide skilled and qualified labour and trained personnel to dismantle and remove the Tower Cranes from site. (ii)     There is an implied term that Soon Douglas would ensure that the dismantling and removal of the Tower Cranes would be done in a skilful and proper manner. (iii)     Soon Douglas breached the implied terms set out above. (iv)     Kay Lim did procure the insurance required under Cl 3.4.2. (v)     Cl 3.7.1 does not extend to an indemnity from Kay Lim against its claims against Soon Douglas. (vi)     Based on Kay Lim’s estimated schedule of damages, Cl 3.7.2 only excludes Kay Lim’s claims for direct or consequential loss as a result of any downtime, stoppage of work or compliance with an order or directive from any judicial or governmental authority, including any losses arising from or during the period of the BCA Stop Work order. (vii)     Outside the bounds indicated above, Kay Lim’s other claims are not excluded. (viii)    Section 3 of the UCTA applies to the Rental Agreement. The first limb of Cl 3.7.2 does not breach the test of reasonableness under the UCTA; the application of UCTA does not otherwise arise on a true construction of the other express clauses in contention. 99     Damages are to be assessed by the registrar. 100    I will hear the parties on costs on a date to be fixed.  [note: 1]NE, XXN of Lim Chor Hong, Day 3, p 6 at lines 8-10. [note: 2]See AEIC Lim Chor Hong, Exhibit “LCH-2”. [note: 3]AEIC of Lim Chor Hong dated 25 January 2012, LCH-4. [note: 4]AEIC of Lim Chor Hong dated 25 January 2012 at [12]. [note: 5]AEIC of Tng Kay Lim dated 26 January 2012 at [4]. [note: 6]AEIC of Song Peiqi, Eugenia dated 17 February 2012, SPE-1 Statement of Facts for Summons No 96 of 2011 at [4]-[5]. [note: 7]AEIC of Faisal bin Mohamed dated 25 January 2012, FM-2 at p 275. [note: 8]AEIC of Song Peiqi, Eugenia dated 17 February 2012 at [4]. [note: 9]NE, XXN of Lim Chor Hong, Day 3 pg 9 lines 5-19. [note: 10]NE, XXN of Lim Chor Hong, Day 3, pg 35 at lines 26-32 and pg 36 at lines 1-3. [note: 11]See AEIC Lam Chee Wei, Exhibit “LCW-1”. [note: 12]AEIC of Lim Chor Hong dated 20 January 2012, p 48. [note: 13]Notes of Evidence, 23 February 2012, pages 23 and 24. [note: 14]NE, XXN of Lim Chor Hong, Day 3 pg 9 lines 1-2. [note: 15]AEIC of Faisal bin Mohamed dated 25 January 2012, FM-2 at p 22. [note: 16]AEIC of Ms Song Peiqi, Eugenia, Exhibit “SPE-1”, at pp 6 – 8. [note: 17]See Plaintiff’s Bundle of Documents, pp 1 and 2, the HDB Letter of Award. [note: 18]Notes of Evidence, 21 February 2012 page 24. [note: 19]Notes of Evidence, 21 February 2012 page 24 and 25. [note: 20]NE, XXN of Tng Kay Lim, Day 1 pg 17 at lines 1-3."
    }
}