{
    "case_title": "AYQ\n      v\n      AYR",
    "ncitation": "[2012] SGHC 80",
    "coram": "Woo Bih Li J",
    "sections": {
        "The children": "9       The children presently live with the wife\n                    – the daughter when she is in Singapore. To their credit, the parties\n                    appear to have worked out a mutually satisfactory arrangement that allows the\n                    children to spend enough time with their father. It was in this context that the\n                    husband agreed to give the wife sole care and control of the children with\n                    reasonable access for himself.",
        "Matrimonial property": "10     I will deal first with the division of\n                    matrimonial assets (not arising from the sale of real property) and, secondly,\n                    the division of the sale proceeds from the matrimonial home. Thirdly, I will\n                    discuss the division of the sale proceeds from a house in Australia. The goal\n                    was to achieve a just and equitable result, taking into account the factors\n                    listed in s 122 of the Women’s Charter (Cap 353, 2009 Rev\n                Ed).",
        "Matrimonial assets (not arising from the sale of real\n                property)": "11     The parties were able to agree on\n                        $875,897.19[note: 1]worth of matrimonial assets, held by either the\n                    husband or the wife, by the third hearing on 9 January 2012. This sum\n                    excluded a refund of $178,577.79 to the wife’s Central Provident Fund\n                    (“CPF”) account from the sale proceeds of the matrimonial home\n                    which would be taken into account when such sale proceeds are dealt\n                        with.[note: 2] 12     The parties were not able to agree on five\n                    items of matrimonial assets. The first was the valuation of Clinic C, one of the\n                    husband’s clinics.[note: 3]The husband had\n                    hired a professional accountant to value his shares in Clinic C. The\n                    accountant’s report was dated 27 April 2011 and valued Clinic C at\n                    $197,758 as at 4 November 2007 and $443,281 as at 12 May 2009. The former\n                    valuation was based on Clinic C’s management accounts for the year ending\n                    30 June 2008. The husband was initially happy to rely on this report in his\n                    affidavit filed on 12 May 2011. At the second hearing on 12 October 2011, I was\n                    informed by lawyers for the husband and wife that they had agreed to use\n                    7 November 2007 (being the date the wife left the matrimonial home) as the\n                    date to value the matrimonial assets. This meant that the parties were adopting\n                    the figure of $197,758 for the value of Clinic C since that value was as at\n                    4 November 2007, which was close enough to 7 November\n                2007. 13     However at the fifth hearing of 6 March 2012,\n                    the husband told me that the true valuation of Clinic C as at 4 November 2007\n                    was $3,693 instead. He explained the difference of more than $190,000 on the\n                    basis that Clinic C had taken out a loan to buy medical equipment soon after\n                    4 November 2007. His business at Clinic C had also been very good from\n                    after November 2007 onwards. So the accounts as of 30 June 2008, which had been\n                    used to prepare the valuation, gave an inflated impression of the actual value\n                    of Clinic C as at 4 November 2007. To support his position, the husband tried to\n                    adduce a fresh accountant’s report prepared by the same accountant as\n                    before. He said that the accountant had explained to him that it was standard\n                    accounting practice to use the management accounts for the year ending 30 June\n                    2008 to determine the value of Clinic C as at 4 November 2007, but he\n                    disagreed that this was the correct approach. Hence the fresh report which was\n                    allegedly based on the accounts as at 4 November 2007. Counsel for the wife, Ms\n                    Loo, objected on the basis that the court should not look behind the earlier\n                    accountant’s report. 14     I denied the husband leave to admit the fresh\n                    report. As already noted, the first valuation had been done by the\n                    husband’s own accountant. The husband had been happy at the start to rely\n                    on it. So had his former lawyer acting on his instructions. The husband said\n                    that the figure of $197,758 was an alternative to the other valuation of\n                    $449,781 as at 12 May 2009. He said he did not know that the court might adopt\n                    the figure of $197,758. I was of the view that this was not a valid reason. That\n                    figure was mentioned as an alternative for the court’s possible adoption.\n                    Accordingly I based the value of Clinic C on the accountant’s report of 27\n                    April 2011, this value being $197,758. 15     The second item of disputed matrimonial assets\n                    related to the valuation of Clinic S, which was another of the husband’s\n                        clinics.[note: 4]The wife said its value was\n                    $307,797.70, while the husband’s valuation of it was $214,199. At the\n                    hearing on 9 January 2012, Ms Loo and the husband eventually agreed to the sum\n                    of $250,000. 16     I should mention that although the wife has a\n                    clinic owned through a company, Clinic L, this clinic started after\n                    7 November 2007 which was the cut-off date which both counsel had agreed\n                    upon to value the matrimonial assets, before the husband decided to represent\n                    himself. Hence the wife’s clinic was not taken into account as part of the\n                    matrimonial assets. 17     The third and fourth items in dispute were\n                    respectively, the value of the husband’s company [H][note: 5], and $39,337.47 held in Clinic C’s\n                    account with OCBC bank.[note: 6]According to the\n                    wife, the quantum of the third item was the relatively small sum of $2,866.80.\n                    During the hearing on 9 January 2012, Ms Loo agreed to drop the claim to\n                    it. 18     In relation to the sum held in Clinic\n                    C’s bank account, the wife’s initial stand was that this sum had not\n                    been taken into account by the accountant in his 27 April 2011 valuation.\n                    However Ms Loo eventually accepted that the court should not look behind the\n                    accountant’s valuation and confirmed on 6 March 2012 that the wife\n                    would also not be pursuing her claim in relation to Clinic C’s bank\n                    account. 19     The fifth item of dispute was the wife’s\n                    credit card liabilities for October and November 2007, totalling\n                        $9,155.36.[note: 7]Ms Loo informed me on\n                    9 January 2012 that these expenses had been incurred because the wife was\n                    moving out of the matrimonial home. However when I looked at the respective\n                    credit card statements, it was plain that the sum of $9,155.36 included expenses\n                    for things as varied as groceries, eating at restaurants, internet\n                    “friendfinder”, hairdressing, clothing, and charitable donations.\n                    Neither was it immediately apparent which items of expenditure related directly\n                    to the cost of moving out. I thus decided that it was not appropriate to take\n                    into account these liabilities in determining the matrimonial\n                assets. 20     Hence the total amount of matrimonial assets\n                    was $1,323,655.19. Of this sum, $1,186,532.08 (89.6%) was held by the husband,\n                    and $137,123.11 (10.4%) by the wife. I attach Annex A which contains details of\n                    the matrimonial assets (excluding proceeds from the sale of real\n                    property). 21     The wife asked to keep her share of the\n                    matrimonial assets, and 30% of what the husband held. According to her, she had\n                    made significant indirect financial contributions and non-financial\n                    contributions to the family throughout the marriage. For example, she had\n                    financially supported the family in Australia while the husband had been on a\n                    specialist medical training course from 1990 – 1995, during which period\n                    their daughter had been born. She had also done most of the housework by\n                    herself. According to the wife she was also the primary caregiver of the two\n                    children. She stopped working full-time after the birth of her daughter in 1992\n                    in order to better take care of the family. She was in charge of the day-to-day\n                    care of the children, eg, supervising their homework, taking them to school and\n                    for medical appointments. She spent most of her free time with the children. She\n                    denied socialising much and said that it was about four or five years after the\n                    family had returned to Singapore and the children were older that she started to\n                    go out with her friends. When the family moved to Singapore in 1995, she worked\n                    part-time till 2007 when she started to work full-time. She said that she helped\n                    to pay for the family’s expenses, although she admitted that the husband\n                    paid for the bulk of it. 22     As regards the fact that the wife had left the\n                    matrimonial home in November 2007, the wife said that the tension between the\n                    husband and her was getting intolerable. She did not want her children to be\n                    adversely affected especially before their major exams in 2008 for\n                    ‘O’ levels and the primary school leaving exams respectively. She\n                    said that she would call the children every other day to check on them. She also\n                    wanted the children to stay with her on weekdays to spend time with them and\n                    help with their schoolwork but the husband did not agree to this. It is not\n                    disputed that the children went to live with her about 26 months later from\n                    January 2010. 23     The husband submitted that each party should\n                    keep 100% of the matrimonial assets already in his/her hands. His reason was\n                    that both parties had invested equal amounts of non-financial contributions to\n                    the marriage. Furthermore, he had paid for most of the household expenses. He\n                    also gave evidence of his regular payments of $1,000 to $3,000 into a joint bank\n                    account which he said had been used for household expenses. 24     The husband did not accept the wife’s\n                    assertions about her substantial non-financial contributions to the welfare of\n                    the family. In particular, he stressed that she is a spendthrift and a\n                    gregarious person and that over the years she became more interested in her\n                    social life than in the family. This culminated with the wife leaving the\n                    children with him in November 2007 when she left the matrimonial home and he was\n                    happy to care for them. He disagreed that he had refused to let them stay with\n                    her until January 2010. He obtained a report from a private investigator which\n                    was submitted by the investigator to him on 15 April 2008. It showed that\n                    over a period of a few days in December 2007,ie,\n                    after the wife had left the matrimonial home, she was seen partying at two night\n                    spots on two separate nights, one a weekday and another a weekend. 25     It was clear that the main breadwinner in the\n                    family had been the husband. He had provided a home and a comfortable life for\n                    the family. I accepted that the wife was the primary caregiver of the children,\n                    especially in their formative years. As a result the wife had to make certain\n                    career sacrifices, but she did not give up her career entirely. I also accept\n                    that there was some truth in the husband’s allegation that over the years\n                    the wife became more interested in her social life. Furthermore, she left the\n                    matrimonial home on 4 November 2007 and the husband was the\n                    children’s caregiver for 26 months. I was of the view that she had no\n                    valid reason for leaving the children with the husband if she had really wanted\n                    to have them with her. The husband did not stop her from achieving any such\n                    intention. However, as mentioned above, the children did live with her from\n                    January 2010. 26     In my opinion, it would be just and equitable\n                    to award the wife 20% of the combined matrimonial assets of $1,323,655.19,ie, $264,731.04. Since she held $137,123.11 of\n                    such assets, the husband would have to pay her the balance,ie, $264,731.04 - $137,123.11 = $127,607.93.",
        "Sale proceeds from the matrimonial home": "27     The parties’ matrimonial home in\n                    Singapore was bought in 1997 for $650,000, with a down payment of $126,000. The\n                    dispute was on how much of the down payment the wife had paid. The wife’s\n                    contention was not that she had contributed a specified sum towards the down\n                    payment. Instead she argued that since there was no documentary evidence as to\n                    who had paid for the down payment, a fair and broad brushed approach would be to\n                    take both parties as having contributed equally to the down payment. Importantly\n                    however, she had already acknowledged in Ms Loo’s written submissions (at\n                    para 22) filed on 17 August 2011 that the husband had paid for a\n                    significant portion of the down payment although there was no indication from\n                    her as to how much of the down payment the husband had made. Given that\n                    admission, I was of the view that she did not make half of the down payment, and\n                    that it was just to conclude that the husband had paid the entire down\n                    payment. 28     If the wife had paid half of the down payment,\n                    her direct financial contribution to acquire the matrimonial home would be\n                        23.7%[note: 8]. She sought another 30% for her\n                    non-financial contributions in the marriage, making a total of 53.7% of the net\n                    sale proceeds. 29     On the other hand, the husband’s\n                    position was that the wife should receive only 20% of the net sale proceeds on\n                    the basis that she did not contribute to the down payment. The husband’s\n                    previous lawyer had submitted that if the wife had not contributed to the down\n                    payment, then her direct financial contribution to acquire the matrimonial home\n                    would be 19%.[note: 9]During the hearing on 6 March 2012, Ms Loo confirmed that she did not\n                    dispute this figure if I were to find, as I did, that the wife did not\n                    contribute to the down payment. In addition, I awarded 20% for the wife’s\n                    non-financial contributions, in particular her care of the children. Therefore I\n                    awarded her a total of 39% of the net sale proceeds of $886,887. The net sale\n                    proceeds comprised a $178,577.79 refund to her CPF account and $708,309.21 held\n                    by certain solicitors as stakeholders. The 39% worked out to $345,885.93. As the\n                    wife had already received $178,577.79 in her CPF account, she was entitled to\n                    $167,308.14 from the stakeholders and the balance of the net sale proceeds was\n                    to be paid to the husband.",
        "Sale proceeds from a house in Australia": "30     The husband had bought the Australia house\n                    with his sister in 1987 about one year after the parties’ marriage in May\n                    1986. According to the husband, the Australia house had been rented out until\n                    1994, and he had used the rent and his own money to service a loan secured by a\n                    mortgage of the Australia house. The wife was working in Singapore at the time\n                    of the purchase, and she went to live with him in Australia only in\n                1989. 31     The husband said that he sold his half-share\n                    in the Australia house to his parents for about A$275,000 in 1996, when he\n                    decided to relocate to Singapore. However, on this point he was not entirely\n                    consistent, as he also said at times that he sold the half-share to his father\n                    only. To avoid stamp duty there was no formal transfer. The husband used the\n                    money he received from the sale to partially pay for their matrimonial home in\n                    Singapore. Around 2003 to 2004, the husband’s parents sold the Australia\n                    house (the sister had sold them her half-share in 1989) for about A$1.15m to pay\n                    for his mother’s medical bills. In order to better look after his parents,\n                    the husband brought them over to Singapore and rented an apartment for them.\n                    According to the husband, a sum equivalent to $533,122.52 was then deposited by\n                    his parents into his bank account in Singapore to help defray his expenses in\n                    looking after them. Subsequently, the sum was transferred back to his\n                    father’s bank account in Australia. 32     The husband’s version was challenged by\n                    the wife. She said she had helped him to repay his share of the mortgage, but\n                    was unable to provide any documentary evidence. She also claimed that the\n                    husband never sold his interest in the Australia house to his parents in 1996,\n                    and that the $533,122.52 in fact represented his portion of the proceeds of sale\n                    in 2003 or 2004. The wife claimed half of the $533,122.52 which she said was a\n                    matrimonial asset. 33     There was insufficient evidence to support the\n                    husband’s claim that he had sold his half-share in the Australia house to\n                    his parents in 1996. Even though there was no formal transfer in 1996, one would\n                    have expected some documents from the subsequent sale in 2003 or 2004 to suggest\n                    that the parents were the sole beneficiaries of the Australia house. For\n                    example, there could have been a letter to (or from) their Australian\n                    professional advisors confirming that they had acted on the instructions of the\n                    parents in the sale, or that they had been informed by the husband that the sale\n                    proceeds belonged to the parents. There was no evidence as to whose account the\n                    sale proceeds were initially credited into. Furthermore, there was no reason why\n                    the parents could not open a bank account in Singapore in their own names to\n                    transfer the sale proceeds. Accordingly, I was of the view that the husband did\n                    retain a half-share in the Australia house, of which the $533,122.52 represented\n                    his portion of the sale proceeds. The next question was whether the wife had any\n                    claim to this money. 34     I found that the wife had not proved her\n                    direct financial contributions for the Australia house. She did not adduce any\n                    documentary evidence and it was unlikely that she contributed to the payment of\n                    any monthly instalment. The property was bought by the husband and his sister.\n                    For the first two years after the Australia house was bought, the wife remained\n                    in Singapore while the husband resided in Australia. Further, the parties did\n                    not live in the Australia house even when the wife joined the husband in\n                    Australia subsequently. In the circumstances I found it hard to accept the\n                    wife’s word that she had helped to pay for the mortgage. There was also\n                    hardly any evidence as to how her indirect contributions had assisted the\n                    husband to acquire the Australia house. Nevertheless, the Australia house was\n                    technically part of matrimonial assets because it was acquired by the husband\n                    after the parties were married. In the circumstances, I awarded the wife 5% of\n                    the $533,122.52,ie, $26,656.13. 35     I also ordered that any sum to be paid by the\n                    husband to the wife arising from the division of matrimonial assets could be\n                    set-off against his share of the sale proceeds of the matrimonial\n                home.",
        "Maintenance": "36     The wife initially asked for maintenance of\n                    $10,000 per month for herself and the children, and for the husband to be solely\n                    responsible for the children’s school fees (which was also referred to as\n                    tuition fees). Eventually, the wife was prepared to bear her own living expenses\n                    and those of her children while they lived with her in Singapore, if the husband\n                    paid the school fees. As the daughter was studying in England and the son in a\n                    local international school, the school fees added up to an estimated sum of\n                    about $100,000 every year. On his part, the husband was not prepared to pay any\n                    maintenance for the wife. As for the children, he initially suggested that the\n                    parties bear the children’s expenses equally, including their school fees.\n                    However, he was prepared to pay 55% with the wife paying 45%. This offer was\n                    rejected by the wife. 37     The wife was earning a substantial income and\n                    her earning capacity was about equal to that of the husband’s. I will\n                    elaborate on these points later. For the time being, I will just say that in\n                    view of these points, I ordered the husband to pay her maintenance of $1 per\n                    month from 1 January 2010 so as to keep alive her option of applying for a\n                    variation in the future. 38     The main dispute between the parties on the\n                    issue of maintenance for the children was the school fees. As it was, the\n                    children were studying in an international school in Singapore. The fees would\n                    increase if the children were to study overseas as the daughter was now doing.\n                    There would then be overseas accommodation and living expenses as\n                well. 39     Three reasons led me to conclude that it would\n                    not be fair or equitable to make the husband solely responsible for the school\n                    fees. The first reason was that the wife appeared to have played a part in\n                    encouraging the children to attend an international school in Singapore. She\n                    said in her first affidavit of assets and means filed on 30 April 2009 (at para\n                    45(f)): ... Recently, both the children moved from the local system to [the\n                        international school]. It was I who took the children to talk to a parent\n                        whose child was attending [the international school] and got them interested\n                        in continuing their education there. 40     Yet the wife made a contrary allegation in her\n                    later affidavit of assets and means filed on 2 June 2011 (at para\n                    91): ... The [husband] was aware of the significant difference between the\n                        school fees for [the international school] and local schools. Despite this,\n                        and despite my own preference that the children should attend local schools,\n                        the [husband] insisted on enrolling both children at [the international\n                        school]. Since it was done at [husband’s] insistence, the [husband]\n                        said he would pay the children’s international school fees. In my opinion, this new position was a deliberate attempt by the wife\n                    to avoid her responsibility to bear part of the school fees for an international\n                    school. 41     The second reason was that in 2007 the wife\n                    had already offered to pay half of the school fees. This offer had been made in\n                    a letter dated 5 November 2007 sent by her previous solicitors Bih Li &\n                    Lee to the husband’s former solicitors Bajwa & Co. Even then the wife\n                    baulked at paying her half share, suggesting that she had no money to do so.\n                    Consequently, Bih Li & Lee wrote on 25 June 2009 to suggest that the\n                    husband pay the school fees first. Then in a letter from the wife’s\n                    present solicitors Allen & Gledhill dated 16 June 2010, the wife made a\n                    U-turn. She alleged that parties had agreed that the husband was to pay\n                    (entirely) for the school fees as it was the husband’s wish for the\n                    children to study at an international school. The alleged agreement by the\n                    husband was untrue. It was also untrue that he had insisted that the children\n                    study at an international school which is what the wife was suggesting through\n                    Allen & Gledhill. 42     Ms Loo also tried to persuade me that the\n                    earlier offer of 5 November 2007 was limited to local school fees but I saw\n                    no reason to see the offer as being so restricted. There was no such suggestion\n                    in the correspondence and the wife had not alluded to that in her affidavits.\n                    Neither did Ms Loo mention this point earlier when the husband’s previous\n                    counsel first stressed the wife’s agreement on this point. 43     Third, I looked at the earning capacity of the\n                        parties.[note: 10]The wife initially\n                    said she earned an income of an average of $10,000 per month. The husband\n                    initially said he earned about $13,750 per month. Both did not seem to have\n                    taken into account the profits their clinics made. From various income tax\n                    assessments, their earning capacities did not seem to be very different. Indeed,\n                    the fact that the wife had offered to pay half of the school fees suggested that\n                    she herself had acknowledged that their earning capacities were about equal.\n                    However as the husband was the one who bore most, if not all, the expenses in\n                    the past, I concluded that it would be fair to order the husband and wife to\n                    bear the school fees in the ratio 60:40 respectively. 44     The husband also asked for an order that the\n                    wife reimburse him 40% of the school fees from 1 January 2009. I allowed\n                    the husband’s request and made the order. Ms Loo then objected on the\n                    basis that the earning capacity of the wife in 2009 had been far lower than the\n                    husband’s. I rejected this argument for the same reasons set out above (at[39]–[42]). I also ordered the wife to reimburse\n                    the husband 40% of the daughter’s accommodation and living expenses while\n                    she was studying in England. The husband was to provide the wife with reasonable\n                    documentary evidence of the daughter’s school fees, accommodation and\n                    living expenses overseas to claim reimbursement from the wife. 45     I also ordered that any sum to be paid by the\n                    wife to the husband as reimbursement may be set-off against her share of the\n                    sale proceeds of the matrimonial home. 46     The last issue I had to decide was the amount\n                    that the husband should contribute towards the children’s living expenses\n                    while they were staying in Singapore with the wife. According to the wife, the\n                    personal monthly expenses for the daughter and son were $755 and $635\n                        respectively.[note: 11]The wife also\n                    asked for the husband’s contribution towards the children’s share of\n                    certain household expenses, for example the $4,300 monthly rent of her\n                    apartment, the $1,300 monthly loan repayment for her car, and $285 for\n                    ERP/carpark fees.[note: 12]I set out in\n                    Annexes B and C the wife’s claim for the children’s monthly personal\n                    expenses and for household expenses for all three of them. It seemed to me that\n                    the wife would have incurred many of the household expenses whether or not she\n                    had care and control of the children. For example, it was not her evidence that\n                    she would move to a smaller apartment if she did not have to take care of the\n                    children. My conclusion was reinforced by the fact that at present the daughter\n                    spends a large part of the year in England. For these reasons and using a broad\n                    brush approach, I found the reasonable personal expenses for each child to be\n                    $700 per month (which is close to what the wife was claiming) and an additional\n                    $300 per month for each child for his/her share of household expenses (including\n                    maid expense), making a total of $2,000 a month. The husband was to pay 60%,ie, $1,200 per month from 1 January\n                    2010.",
        "Annex A": "",
        "Husband’s Matrimonial Assets (not arising from\n                the sale of real property)": "",
        "Undisputed": "DescriptionAmount\n                                (S$)Prudential CPF special policy as at April\n                                        200910,922UOB account [xxx] as at 1 November\n                                        20074,008.16POSB account [xxx] as at 1 November\n                                        2007788.17OCBC account [xxx] as at 31 October\n                                        200772,397.25Central Provident Fund as at 1 February\n                                        200849,007.53Total\n                                            :S$137,123.11",
        "Disputed": "DescriptionCourt’s conclusion/eventual\n                                        agreementClinic C for the period June 2007 to June\n                                        2008S$197,758Clinic S for the period January 2007 to\n                                        December 2007S$250,000Clinic H for the period January 2007 to\n                                        December 2007Not\n                                pursuedOCBC account [xxx] as at January\n                                    2008Not\n                                pursuedTotal:S$447,758",
        "Wife’s Matrimonial Assets (not arising from the sale of real\n                property)": "",
        "Disputed liabilities of the wife": "",
        "Annex B": "",
        "Wife’s claim for children’s monthly personal expenses\n                (excluding school fees)": "",
        "Daughter (19 years old)": "DescriptionAmount\n                                (S$)Pocket money50.00Transport100.00School books30.00School uniform, socks and\n                                    shoes18.00Clothes and shoes80.00Books and\n                                entertainment150.00Haircut50.00Medical Insurance –\n                                AXA47.00Dental expenses30.00Holidays200.00Total:S$755.00",
        "Son (15 years old)": "Pocket money50.00Transport100.00School books30.00School uniform, socks and\n                                    shoes18.00DescriptionAmount\n                                            (S$)Clothes and shoes30.00Books and\n                                entertainment100.00Haircut20.00Medical Insurance –\n                                AXA47.00Medical expenses20.00Dental expenses20.00Holidays200.00Total:S$635.00",
        "Annex C": "",
        "Wife’s claim for monthly household expenses (for the children\n                and herself)": "DescriptionAmount\n                                (S$)Food – groceries, toiletries and\n                                        sundries800.00Maid salary280.00Maid levy175.00Maid agency fees19.00Maid airfare27.00Utilities220.00Telephone/Internet\n                                connection216.00Cable TV101.00Rent for apartment4,300.00General maintenance (Air-conditioner\n                                        servicing, plumbing, etc)100.00Newspapers25.00Family outings520.00Car loan instalment\n                                payments1,300.00Road tax93.00Car insurance109.00Petrol720.00Carpark/ERP fees285.00Total:S$9,290     [note: 1]Plaintiff’s reply filed 9 January\n                                2012, tab 1 pp1-2 and 4, excluding item 11 on p\n                        2. [note: 2]Plaintiff’s reply filed 9 January 2012, tab 1 p\n                                4 item 6. [note: 3]Plaintiff’s reply filed 9 January\n                                2012, tab 1 p 2 item 11. [note: 4]Plaintiff’s reply filed 9 January 2012, tab 1 p\n                                3 item 1. [note: 5]Plaintiff’s reply filed 9 January 2012, tab 1 p 3 item\n                                2. [note: 6]Plaintiff’s reply filed 9 January\n                                2012, tab 1 p 3 item 3. [note: 7]Plaintiff’s reply filed 9 January\n                                2012, tab 1 p5 [note: 8]Plaintiff’s submissions filed on 17 August 2011,\n                                at p 4. [note: 9]Defendant’s Further Submissions\n                                filed on 11 October 2011, pp 2 and 3. [note: 10]Plaintiff’s reply filed 9\n                                January 2012, tab 2. [note: 11]Plaintiff’s submissions filed 17\n                                August 2011, tab 6 pp 16-17. [note: 12]Plaintiff’s submissions filed 17\n                                August 2011, tab 6 pp 14-15"
    }
}