{
    "case_title": "Quarella SpA\n      v\n      Scelta Marble Australia Pty Ltd",
    "ncitation": "[2012] SGHC 166",
    "coram": "Judith Prakash J",
    "sections": {
        "Introduction": "1       I had before me an application to set aside two\n                    arbitration awards made in an international arbitration conducted under the\n                    International Arbitration Act (Cap 143A, 2002 Rev Ed) (“the Act”).\n                    The first award dealt substantively with the dispute whilst the second dealt\n                    with costs. 2       The central issue the plaintiff, Quarella SpA\n                    (“Quarella”), wanted me to decide was this: Does a purportedly\n                    wrong interpretation of the choice of law clause (chosen by the parties to\n                    govern their distributorship agreement) by a tribunal justify a setting aside of\n                    an award under Articles 34(2)(a)(iii)-34(2)(a)(iv) of the UNCITRAL Model Law on\n                    International Commercial Arbitration (\"the Model Law\")? The basis of the\n                    plaintiff’s application was that the tribunal had failed to apply the\n                    rules of law that were agreed upon by the parties to govern the merits of the\n                    dispute. 3       In its Originating Summons, Quarella had also\n                    alleged that the rules of natural justice were breached in connection with the\n                    making of the first award and that its rights had been prejudiced thereby. This\n                    ground for setting aside the first award was, however, abandoned at the start of\n                    the hearing. 4       At the conclusion of the hearing I dismissed the\n                    application. I now set out my grounds.",
        "Facts": "",
        "Parties to the dispute": "5       Quarella is a company incorporated in Italy\n                    which manufactures and exports composite stone products. 6       The defendant, Scelta Marble Australia Pty Ltd\n                    (“Scelta”), is a company incorporated in Australia which supplies\n                    composite stone products in Australia. 7       In the proceedings before me, the President of\n                    Quarella, Giuseppe Godi (“Mr Godi”), filed two affidavits. The\n                    Managing Director of Scelta, Stewart Macciolli (“Mr Macciolli”),\n                    filed one affidavit. There was also a legal opinion from Professor Marco\n                    Torsello, a professor at the Department of Law of the University of Verona in\n                    Italy.",
        "Background to the dispute": "8       Quarella and Scelta entered into a\n                    distributorship agreement (“the Agreement”) dated 27 January 2000\n                    for the distribution of Quarella’s products in Australia. The Agreement\n                    provided,inter alia: Clause 25 This Agreement shall be governed by the Uniform Law for International\n                        Sales under the United Nations Convention of April 11, 1980 (Vienna) and\n                        where not applicable by Italian law. Clause 26 Any dispute which might arise shall be decided by arbitration to be\n                        carried out in Singapore in English according to the rules of the\n                        International Chamber of Commerce of Paris. 9       A dispute subsequently arose. Scelta filed a\n                    Request for Arbitration dated 19 October 2009 with the Paris Secretariat of the\n                    International Chamber of Commerce (“ICC”) International Court of\n                    Arbitration. 10     On 10 December 2009, Associate Professor Gary\n                    F Bell was nominated jointly by Quarella and Scelta to be the sole arbitrator.\n                    On 17 February 2010, the Secretary General of the ICC International Court of\n                    Arbitration, pursuant to Article 9(2) of the ICC Rules of Arbitration, confirmed\n                    Associate Professor Gary Bell as the sole arbitrator (“the\n                    Tribunal”). The parties and the Tribunal subsequently agreed on the Terms\n                    of Reference. 11     On 11 November 2011, the Tribunal issued a\n                    Partial Award on All Substantive Issues in Dispute (Final as to All Matters\n                    Except Costs) (“the Award”). The Award was in Scelta’s\n                    favour and Quarella was ordered to,inter alia,\n                    pay A$1,075,964.25 to Scelta as damages for Quarella’s wrongful\n                    termination and breach of the Agreement. On 22 December 2011, the Tribunal\n                    issued a Final Award (on Costs) (“the Costs Award”) which awarded\n                    Scelta costs fixed at A$824,917.50. 12     As at the date of the hearing before me,\n                    Quarella had not made any payment towards settlement of the Award or the Costs\n                    Award. Scelta was attempting to enforce the Award in Italy but this attempt was\n                    resisted by Quarella on the basis that it was seeking to set aside the Award in\n                    Singapore, the supervisory jurisdiction.",
        "The Tribunal’s decision on the applicable law": "13     The question as to what the law applicable to\n                    the arbitration was, did not at first appear to be in doubt. Scelta took the\n                    position that Italian law applied rather than the Uniform Law for International\n                    Sales (“CISG”) under the 1980 UN Vienna Convention and Quarella\n                    seemed to agree. In Quarella’s Answer to the Request for Arbitration, it\n                    stated: In fact the [CISG] has a limited application, as it does not govern\n                        expressly distributorship agreements, which is a framework agreement, but\n                        the sales to which it refers to. In this arbitration therefore we shall\n                        mostly refer to (and rely on) Italian law. 14     Scelta pointed out in its submissions that\n                    Quarella had, from a very early stage of the arbitration, accepted that Italian\n                    law was the law applicable to the merits of the dispute. Scelta argued that it\n                    was clear from the excerpt that Quarella considered and accepted that the CISG\n                    did not apply to the Agreement, which was described as a “Distributorship\n                    Agreement”. Scelta also argued that Quarella exclusively referred to and\n                    relied on Italian law in its subsequent submissions. 15     But Quarella changed its stand. In a letter\n                    dated 15 April 2011, Quarella’s Australian solicitors, Baker &\n                    McKenzie stated: Clause 25 of the Agreement constitutes a direct choice by the parties of\n                        CISG as the “rules of law” to determine the dispute between\n                        the parties pursuant to Article 28 of the Model Law. By virtue of that agreement between the parties, relevant provisions of\n                        CISG (including Articles 7-8 and Articles 74 and 77) apply consistently with\n                        the parties’ express choice of CISG as the primary rules of law\n                        applicable to the [Agreement]. 16     This change of position took place three weeks\n                    before the re-scheduled hearing of the arbitration. As a result, Scelta objected\n                    to Quarella raising the application of the CISG at such a late stage in the\n                    arbitration proceedings. 17     The Tribunal decided three preliminary issues\n                    prior to determining the main issue of whether the CISG applied to the\n                    Agreement. 18     The first was whether arguments that the CISG\n                    applied should be heard at such a late stage. On this, the Tribunal allowed\n                    Quarella to raise the new argument on the applicable law and gave Scelta an\n                    opportunity to reply. 19     The second preliminary issue was whether the\n                    agreement of the parties on the applicable law found in Clause 25 of the\n                    Agreement was modified by mutual agreement so that the CISG did not apply. On\n                    this, the Tribunal found that there was no modification of Clause 25 to\n                    completely exclude the application of the CISG. 20     The third preliminary issue was whether Clause\n                    25 of the Agreement should be interpreted as a direct choice of the substantive\n                    rules of the CISG by the parties so that the CISG applied even if the conditions\n                    for the application of the CISG stated in the CISG were not met. On this, the\n                    Tribunal decided that the correct interpretation of Clause 25 was that the\n                    parties intended the CISG to apply to the extent that the CISG was applicable\n                    according to its own rules on applicability, and if it did not apply in part or\n                    in whole, then Italian law applied. 21     Having decided the above, the Tribunal then\n                    considered the issue of whether the CISG, according to its own internal\n                    criteria, applied to the Agreement. On this, the Tribunal decided that the CISG\n                    was not applicable because the Agreement did not contain a contract of sale but\n                    was a framework agreement.",
        "Quarella’s case": "22     Quarella’s counsel, Mr Ang Wee Tiong\n                    (“Mr Ang”) submitted that the Tribunal’s decision on the\n                    applicable law was wrong, and that the Tribunal failed to apply the law chosen\n                    by the parties. Quarella’s submission on this contained three points.\n                    First, Quarella noted that by cl 26 of the Agreement, the parties had agreed\n                    that: Any dispute which might arise shall be decided by arbitration to be\n                        carried out in Singapore in English according to the rules of the\n                        International Chamber of Commerce of Paris. Quarella pointed out that Art 17 of the ICC Rules provides\n                    that: The parties shall be free to agree upon the rules of law to be applied by\n                        the Arbitral Tribunal to the merits of the dispute. In the absence of any\n                        such agreement, the Arbitral Tribunal shall apply the rules of law which it\n                        determines to be appropriate. 23     Quarella then went on to argue that the option\n                    given to parties was not limited to the election of a national law, and that\n                    parties could also use a different set of rules, including otherwise non-binding\n                    principles (such as the UNIDROIT Principles of International Commercial\n                    Contracts), or otherwise non-applicable conventions, such as the CISG in cases\n                    where it would not apply on the basis of the rules on its\n                applicability. 24     Second, Quarella submitted that it was a well\n                    established principle of contractual interpretation that a construction which\n                    entailed that a contract and its performance was lawful and effective was to be\n                    preferred, and referred toSheng Siong Supermarket Pte Ltd v\n                        Carilla Pte Ltd[2011] 4 SLR 1094 at [40]. Quarella argued that\n                    the Tribunal had, in deciding that the CISG was not applicable because the\n                    Agreement did not contain a contract of sale but was instead a framework\n                    agreement, deprived Clause 25 of any effect. 25     Third, Quarella argued that Italian law was to\n                    be used to supplement the CISG when there was a lacuna, and was not intended to\n                    replace the CISG. 26     These three arguments appeared to me to be\n                    arguments that invited this court to review the merits of the Award and come to\n                    a different conclusion from that of the Tribunal. Professor Torsello’s\n                    instructions, given to him by Quarella, also sought answers that went to the\n                    findings of the Tribunal. In his affidavit, Professor Torsello stated: I have been asked by the Plaintiff to consider and give my\n                        opinion on the following issues: (a)    Whether the Tribunal’s finding on the\n                                issue of the applicable law is correct. (b)    If the Tribunal’s finding is incorrect,\n                                what provision(s) of the CISG could and should have been applicable\n                                to the Agreement. (c)    What difference(s) would it have made to the\n                                Partial Award if the provision(s) of the CISG had been applied by\n                                the Tribunal instead of Italian law. 27     Assuming Professor Torsello is correct in his\n                    opinion (on which I make no comment), and the Tribunal has erred, there can be\n                    no right of appeal against such errors, independent of the Act (see,Sui Southern Gas Company Ltd v Habibullah Coastal Power Company\n                        (Pte) Ltd[2010] 3 SLR 1 at [19]-[22], applying the Court of\n                    Appeal’s decisions in PT AsuransiJasa Indonesia (Persero) v Dexia Bank SA[2007] 1 SLR(R)\n                    597 (\"PT Asuransi\") andSohBeng Tee & Co Pte Ltd v Fairmount\n                        Development Pte Ltd[2007] 3 SLR(R) 86). Mr Ang, in oral\n                    submissions before me, accepted that an error of law was not a ground for\n                    setting aside. However, he also submitted that the application of the wrong law\n                    was a distinct situation.",
        "Scelta’s case": "28     Scelta’s counsel, Mr Cavinder Bull SC\n                    (“Mr Bull”), submitted that the arguments put forward by Quarella\n                    were not being advanced with any real seriousness. In addition, Mr Maciolli\n                    stated in his affidavit that Quarella was in a precarious financial position (an\n                    allegation Mr Godi described as misconceived) and the present application was an\n                    attempt to frustrate Scelta’s enforcement of the Award. 29     Mr Bull argued that: (a)     The Tribunal applied the correct\n                        substantive law; (b)     Even if the Tribunal was wrong to apply Italian law rather than the\n                        CISG to the merits of the dispute, this was not a ground for setting aside\n                        the Award under Article 34(2)(a)(iv) of the Model Law; (c)     It was not a ground for setting aside\n                        the Award under Article 34(2)(a)(iii) of the Model Law to allege that the\n                        Tribunal applied the wrong substantive law. 30     I now turn to deal with the parties’\n                    arguments as they relate to the relevant Articles of the Model\n                Law.",
        "Should the Award be set aside under Article 34(2)(a)(iv) of the Model\n                Law?": "",
        "The relevant Article": "41     Article 34(2)(a)(iii) of the Model Law\n                    states: Article 34. — Application for\n                            setting aside as exclusive recourse against arbitral\n                        award (1)    Recourse to a\n                                court against an arbitral award may be made only by an application\n                                for setting aside in accordance with paragraphs (2) and (3) of this\n                                Article. (2)    An arbitral\n                                award may be set aside by the court specified in Article 6 only\n                                if: (a)    the party making the application furnishes\n                                    proof that: ... (iii)   the award deals with a dispute not\n                                        contemplated by or not falling within the terms of the\n                                        submission to arbitration, or contains decisions on matters\n                                        beyond the scope of the submission to arbitration, provided\n                                        that, if the decisions on matters submitted to arbitration\n                                        can be separated from those not so submitted, only that part\n                                        of the award which contains decisions on matters not\n                                        submitted to arbitration may be set aside;",
        "Quarella’s argument": "32     Quarella’s argument here was that by\n                    failing to apply the CISG and by applying Italian law, the Tribunal had failed\n                    to comply with Article 17 of the ICC Rules and therefore the arbitral procedure\n                    was not in accordance with the agreement of the parties.",
        "Scelta’s argument": "33     Scelta submitted that Quarella’s\n                    argument was wrong. In support, Scelta cited a passage from Gary B Born,International Commercial Arbitration(Kluwer\n                    Law International, 2009) (“Born”): Most national courts have rejected arguments that the\n                            arbitrators failed to comply with the parties’ arbitration\n                            agreement by applying the “wrong” substantive law. This\n                            includes instances where arbitrators allegedly apply a substantive law\n                            other than that chosen by the parties.Save where an\n                        arbitratorexpressly refusesto give effect to\n                        a concededly valid choice-of-law clause, and instead applies some other\n                        legal system, an award’s disposition of choice-of-law issues fall\n                        within the arbitrators’ mandate to decide the substance of the\n                        parties’ dispute and is subject to the same (generally very-limited or\n                        non-existent) judicial review that exists for other substantive\n                        decisions. [emphasis added]",
        "Analysis": "50     I turn to explain why the setting aside\n                    application under s 34(2)(a)(iii) was misconceived. A discussion of Article 34(2)(a)(iii) 51     InPT Asuransi,\n                    the Court of Appeal said, in discussing Article 34(2)(a)(iii) (at [37]): The law on the jurisdiction of an arbitral\n                            tribunal is well established. Article 34(2)(a)(iii) of the Model Law\n                            merely reflects the basic principle that an arbitral tribunal has no\n                            jurisdiction to decide any issue not referred to it for determination by\n                            the parties.In relation to this matter, we note Lord\n                        Halsbury's observations inLondon and North Western and\n                            Great Western Joint Railway Companies v J H Billington,\n                            Limited[1899] AC 79, where he noted, at 81, as\n                        follows: I do not think any lawyer could reasonably contend that, when parties\n                            are referring differences to arbitration, under whatever authority that\n                            reference is made, you could for the first time introduce a new\n                            difference after the order of arbitration was made. Therefore, upon that\n                            question I certainly do give a very strong opinion. [emphasis added] 52     InCRW Joint Operation v PT\n                        Perusahaan Gas Negara (Persero) TBK[2011] 4 SLR 305\n                        (“Persero”), the Court of Appeal\n                    set out the law relating to Article 34(2)(a)(iii) of the Model Law (at\n                    [30]-[33]): InPT AsuransiJasa Indonesia (Persero) v Dexia Bank SA[2007] 1\n                        SLR(R) 597, this court held (at [44]) that the court had to adopt a\n                        two-stage enquiry in assessing whether an arbitral award ought to be set\n                        aside under Art 34(2)(a)(iii) of the Model Law. Specifically, it had to\n                        determine: (a)    first, what matters were within the scope of\n                                submission to the arbitral tribunal; and (b)    second, whether the arbitral award involved\n                                such matters, or whether it involved \"a new difference ... outside\n                                the scope of the submission to arbitration and accordingly ...\n                                irrelevant to the issues requiring determination\" [emphasis in\n                                original] (at [40]). It is useful, at this juncture, to set out some of the legal principles\n                        underlying the application of Art 34(2)(a)(iii) of the Model Law. First, Art\n                        34(2)(a)(iii) is not concerned with the situation where an arbitral tribunal\n                        did not have jurisdiction to deal with the dispute which it purported to\n                        determine.Rather, it applies where the arbitral tribunal\n                            improperly decided matters that had not been submitted to it or failed\n                            to decide matters that had been submitted to it.In other\n                        words, Art 34(2)(a)(iii) addresses the situation where the arbitral tribunal\n                        exceeded (or failed to exercise) the authority that the parties granted to\n                        it (see Gary B Born,International Commercial\n                            Arbitration(Wolters Kluwer, 2009) at vol 2, pp 2606-2607 and\n                        2798-2799). This ground for setting aside an arbitral award covers only an\n                        arbitral tribunal's substantive jurisdiction and does not extend to\n                        procedural matters (see Robert Merkin & Johanna Hjalmarsson,Singapore Arbitration Legislation Annotated(Informa, 2009) (\"Singapore Arbitration Legislation\") at p 117). Second, it must be noted that a failure by an arbitral\n                        tribunal to deal with every issue referred to it will not ordinarily render\n                        its arbitral award liable to be set aside. The crucial question in every\n                        case is whether there has been real or actual prejudice to either (or both)\n                        of the parties to the dispute. In this regard, the following passage in\n                        Redfern and Hunter ([27] supra at para 10.40) correctly summarises the\n                        position: The significance of the issues that were not dealt with has to be\n                            considered in relation to the award as a whole. For example, it is not\n                            difficult to envisage a situation in which the issues that were\n                            overlooked were of such importance that, if they had been dealt with,\n                            the whole balance of the award would have been altered and its effect\n                            would have been different. [emphasis added] Third, it is trite that mere errors of law or even fact\n                            are not sufficient to warrant setting aside an arbitral award under Art\n                            34(2)(a)(iii) of the Model Law(seeSui\n                            Southern Gas Co Ltd v Habibullah Coastal Power Co (Pte) Ltd[2010] 3 SLR 1 at [19]-[22]). In the House of Lords decision ofLesotho Highlands Development Authority v ImpregiloSpA[2006] 1 AC 221, which\n                        concerned an application to set aside an arbitral award on the ground of the\n                        arbitral tribunal's \"exceeding its powers\" (see s 68(2)(b) of the\n                        Arbitration Act 1996 (c 23) (UK) (\"the UK Arbitration Act\")), Lord Steyn\n                        made clear (at [24]-[25]) the vital distinction between the erroneous\n                        exercise by an arbitral tribunal of an available power vested in it (which\n                        would amount to no more than a mere error of law) and the purported exercise\n                        by the arbitral tribunal of a power which it did not possess. Only in the\n                        latter situation, his Lordship stated, would an arbitral award be liable to\n                        be set aside under s 68(2)(b) of the UK Arbitration Act on the ground that\n                        the arbitral tribunal had exceeded its powers. In a similar vein, Art\n                        34(2)(a)(iii) of the Model Law applies where an arbitral tribunal exceeds\n                        its authority by deciding matters beyond its ambit of reference or fails to\n                        exercise the authority conferred on it by failing to decide the matters\n                        submitted to it, which in turn prejudices either or both of the parties to\n                        the dispute (see above at [31]). [emphasis added] 53     The first and third principles are what I\n                    applied to this case. With regard to the first principle, on the facts before\n                    me, this was not a case where the arbitral tribunal improperly decided matters\n                    that had not been submitted to it or failed to decide matters that had been\n                    submitted to it. The issue of the applicable law was submitted to the Tribunal;\n                    the Award addressed this explicitly (at [48] of the Award). The Tribunal did\n                    decide the matters that were submitted to it. 54     With regard to the third principle, besides\n                    examining the guidance set out by the Court of Appeal in the excerpts above,\n                    Quarella would not have had to venture too far to find literature that would\n                    have indicated that the prospects of it succeeding in the setting aside\n                    application on this ground were dim. A recently published monograph by Chan Leng\n                    Sun,Singapore Law on Arbitral Awards(Academy\n                    Publishing, 2011) states (at para 6.127): An issue that is within the scope of submission to arbitration does not go\n                        outside the scope simply because the arbitral tribunal comes to a wrong\n                        conclusion on it. Unless the award contained decisions beyond the scope of\n                        the arbitration agreement, an error in interpreting the contract does not\n                        permit setting aside under Article 34(2)(a)(iii) of the Model Law 1985.Neither would an argument that the tribunal applied\n                            the wrong governing law constitute a ground for setting aside an\n                            award. [emphasis added] 55     Quarella’s attempt to set aside the\n                    Award under 34(2)(a)(iii) was based entirely on a disagreement with the\n                    interpretation the Tribunal took regarding the choice of law clause. The dispute\n                    was not one that engaged Article 34(2)(a)(iii) of the Model Law. 56     Whilst it is not strictly necessary for me to\n                    do so, I would like to explain why the Ferrari/Silberman article did not assist\n                    Quarella. 57     From a reading of the whole article, it is\n                    apparent that the article was making a proposal, as was stated in the heading to\n                    the concluding section. The article was not stating the current legal position.\n                    It was also conceded by the authors that the suggested position was based less\n                    on case law than on policy or views from commentators. Further, the article\n                    refers to thedeliberate disregard or the ignoring by the\n                        arbitratorof the choice of law clause agreed on by the parties.\n                    It is even made clear on more than one occasion that cases of that natureshould be distinguishedfrom situations where\n                    the arbitrators applied the applicable law incorrectly. 58     It would appear that the arguments in the\n                    Ferrari/Silberman article were similar to those put forward earlier under s\n                    34(2)(a)(iv), albeit under a different subsection of the same Article in the\n                    Model Law. In response to the arguments, I found that the Tribunal here did not\n                    deliberately disregard or ignore or overrule the parties’ choice of law\n                    clause. It did not fail to honour (or in the words of Buys, fail to respect) the\n                    choice of law clause set out by the parties. Accordingly, Quarella failed to\n                    convince me that I should set aside the Award pursuant to Article\n                    34(2)(a)(iii). 59     For completeness, Quarella, having failed to\n                    convince me to set aside the Award, also failed to convince me that the Costs\n                    Award should be set aside.",
        "Should the Award be set aside under Article 34(2)(a)(iii) of the\n                Model Law?": "",
        "Quarella’s arguments": "42     Quarella’s arguments in support of this\n                    ground were scant and lacking in substance. It began by setting out the text of\n                    Article 34(2)(a)(iii). Following that, Quarella cited a passage from an article\n                    entitledGetting to the Law Applicable to the Merits in\n                        International Arbitration and the Consequences of Getting It\n                        Wrongby Linda Silberman and Franco Ferrari (“the\n                    Ferrari/Silberman article”), which read: We think that the arbitrators have in fact “exceeded their\n                        powers” or gone beyond the “scope of submission to\n                        arbitration” where an express choice of law has been included by the\n                        parties to govern the merits of their dispute and the arbitrators apply\n                        another law or fail to apply the law chosen. 43     Quarella acknowledged that the passage was\n                    written in the context of Article V(1)(c) of the New York Convention, but\n                    asserted that the words used in Article V(1)(c) arein parimateriawith the words in Article\n                    34(2)(a)(iii) of the Model Law. Accordingly, it submitted, the Tribunal, in\n                    applying Italian law (which was not the law expressly chosen by the parties) had\n                    gone beyond the scope of submission to arbitration. The entire written\n                    submission on this argument was made up of four short and underdeveloped\n                    paragraphs. 44     This was not a particularly novel argument. InThe Arbitrators’ Duty to Respect the Parties’\n                        Choice of Law in Commercial Arbitration, 79 St. John's L. Rev.\n                    59, Cindy Buys states (at 69-72): The contractual nature of arbitration serves to distinguish it from\n                        litigation. Unlike judges, who are appointed or elected by law, arbitrators\n                        are appointed by the private agreement of the parties, and their allegiance\n                        should be to seeing that the terms of that private agreement are carried\n                        out. The arbitrator's duty to respect the wishes of the parties as expressed\n                        in their written agreement extends to respect for the parties' choice of law\n                        in a commercial transaction. ... Absent overriding public policy considerations, reviewing courts also\n                        should respect party autonomy pursuant to two well-established doctrines.\n                        First, respecting party autonomy in arbitration furthers the federal policy\n                        in favor of arbitration as reflected in the FAA. As stated above, the FAA\n                        creates the right to have the arbitration proceed in accordance with the\n                        parties' wishes. If the parties know that courts will uphold arbitration\n                        awards that are made in accordance with the parties' wishes, the parties\n                        will be even more likely to resort to arbitration as an alternative means of\n                        dispute resolution. Routine respect for the parties' agreement makes the\n                        process more certain and predictable, thus allowing business persons to\n                        better plan their business and legal dealings and relationships. Second, respecting the agreement of the parties is consistent with the\n                        general policy favoring freedom of contract. When courts are deciding\n                        disputes arising out of contractual relationships, the intent of the parties\n                        is generally controlling. Likewise, an arbitral tribunal is bound to\n                        effectuate the intent of the parties.These same\n                            principles should be applied to require enforcement of contractual\n                            provisions reflecting the choice of law made by the parties. Thus, if a\n                            court is reviewing an arbitral award where the arbitrators have failed\n                            to respect the parties' choice of law, the court should vacate that\n                            award because the arbitrators have exceeded their\n                        powers. [emphasis added] 45     And in a footnote to the last sentence of the\n                    excerpt, Buys states: The FAA provides that one of the grounds for vacation of an arbitral award\n                        is “[w]here the arbitrators exceeded their powers.” 9 U.S.C.\n                            § 10(a)(4). Despite this language, at least one\n                        scholar, Thomas Carbonneau, suggested that arbitrators have certain inherent\n                        authority implied by their designation as arbitrators to manage and conduct\n                        the proceedings and that this authority may include the power to overrule\n                        the parties' choice of law in the “best interests of the\n                        process.” See Thomas E. Carbonneau, The Ballad of Transborder\n                        Arbitration, 56 Miami L. Rev. 773, 814, 820-21 (2002). He argued that in\n                        choosing arbitration, the parties bargained for a “workable\n                        process” in exchange for placing “enormous authority and trust\n                        in the arbitrator.” Id. at 815. While it is true that arbitrators are\n                        vested with certain inherent authority to manage the arbitral process, this\n                        author believes that the arbitrators' inherent authority is limited to\n                        matters that the parties have not expressly agreed upon, i.e., to fill in\n                        gaps. Where the parties have expressly bargained for and agreed upon a\n                        contractual term, the arbitrator lacks the power tooverrulethe parties' agreement. [emphasis added]",
        "Scelta’s arguments": "46     Scelta argued that, in reality, what Quarella\n                    was saying was that the Tribunal made the wrong decision and fell into error.\n                    Scelta also argued that the Tribunal did not decide matters beyond its ambit of\n                    reference; the Tribunal wasspecifically askedby\n                    Quarella to decide on the applicability of the CISG. 47     Scelta also cited two passages fromBorn, the first of which read: ... a considerable measure of judicial deference is accorded the\n                        arbitrators’ interpretation of the scope of their mandate under the\n                        parties’ submissions. Courts are particularly unwilling to accept arguments\n                            that, by ignoring or refusing to give effect to the terms of the\n                            parties’ underlying contract, the tribunal exceeded its authority.\n                            It is typically held that such arguments amount to an effort to obtain\n                            judicial review of the merits of the tribunal’s decision; as such,\n                            these efforts do not constitute an excess of authority and instead, at\n                            most, involve an allegedly incorrect decision in the exercise of such\n                            authority. [emphasis added] 48     The paragraph which followed (which was not\n                    cited) read: This was reflected in a recent decision inLesotho\n                            Highlands Development Authority v. ImpregiloSpA, where the House of Lords rejected the argument\n                        that an arbitral tribunal’s application of English law, rather than\n                        the terms of the parties’ contract, constituted an excess of authority\n                        which permitted annulment of its award under s 68 of the Act. Lord Steyn\n                        declared that “nowhere in s 68 is there any hint that a failure by\n                        the tribunal to arrive at the ‘correct decision’ could afford a\n                        ground for challenge under s 68.” While this view is both clearly\n                        correct and representative of most decisions, national courts are\n                        nonetheless sometimes persuaded – wrongly – to treat arguable\n                        errors of law as an excess of authority. 49     The second passage cited by Scelta\n                    read: Neither the New York Convention nor most developed\n                            arbitration statutes expressly permit non-recognition of an arbitral\n                            award because the arbitrators erred in their choice-of-law\n                            analysis.Rather, as noted above, and in the absence of a\n                        choice of law agreement, the arbitrators’ choice-of-law decisions are\n                        subsumed within their rulings on the merits of the parties’ dispute,\n                        and thus subject to the general presumption in favour of recognition under\n                        the Convention and most developed arbitration legislation.Thus, except where statutory protections or public policy\n                            issues are involved, judicial review of the arbitrators’\n                            choice-of-law decisions concerning the substantive law applicable to the\n                            merits of the parties’ dispute is usually minimal in developed\n                            national courts, both in common law and civil law\n                            jurisdictions. [emphasis added]"
    }
}