{
    "case_title": "Menjit Singh s/o Hari Singh\n      v\n      Ong Lay Peng",
    "ncitation": "[2012] SGHC 11",
    "coram": "Tan Lee Meng J",
    "sections": {
        "Introduction": "1       The appellant, Mdm Ong Lay Peng (“Mdm\n                    Ong”), appealed against the decision of the Assistant Registrar\n                    (“the AR”) regarding the damages awarded to the respondent,\n                    Mr Menjit Singh s/o Hari Singh (“Mr Singh”), with\n                    respect to the consequences of a whiplash suffered as a result of a relatively\n                    minor accident (“the accident”) in a Housing and Development Board\n                    car park (“the car park”) on 11 November 2006. Mr Singh,\n                    who was a teacher and Head of the Humanities Department at the Holy\n                    Innocents’ High School (“the school”) at the time of the\n                    accident, had claimed that he was so physically disabled by the accident that he\n                    could no longer work as a teacher even though there was ample evidence that he\n                    was still fit enough to walk 3.2 km and could still drive his car and turn his\n                    neck while reversing his car. The AR found that Mr Singh could in all\n                    likelihood have continued his work as a teacher, with perhaps some adjustments\n                    to his work environment. Despite this important finding, she upheld\n                    Mr Singh’s claim for damages for loss of pre-trial and future\n                    earnings as a teacher, which formed the bulk of the damages of more than $1m\n                    claimed by the latter. Hence, Mdm Ong appealed against the AR’s decision\n                    on the alleged loss of pre-trial and future earnings as a teacher.",
        "Background": "2       At around 11 am on 11 November 2006,\n                    Mr Singh reversed his vehicle bearing vehicle registration number SFS 9623Y\n                    out of a parking lot in the car park. At the same time, Mdm Ong, who was looking\n                    for a lot to park her vehicle bearing vehicle registration number SFT 8196P,\n                    reversed her car at around 15 km per hour and hit the back of\n                    Mr Singh’s car. 3       According to Mdm Ong, the accident was so minor\n                    that her four year-old son, who was strapped to a child-seat in the rear\n                    passenger seat, continued to play with his toy. However, Mr Singh, who\n                    claimed that he suffered a whiplash as a result of the accident, did not return\n                    to the school to teach and remained on medical leave for several months. More\n                    than 8 months after the accident, he exhausted his medical leave on 19 July\n                    2007. 4       As Mr Singh continued to insist that he\n                    could not work as a teacher, the Medical Board (“the Medical\n                    Board”) of the Ministry of Education (“MOE”) met on\n                    23 August 2007 to determine whether or not he was unfit to work as a\n                    teacher. In a letter dated 13 November 2007, MOE informed him that the\n                    Medical Board had found him unfit for further service as a Senior Education\n                    Officer and that his last day of service was to be 12 December 2007. By\n                    then, the Ministry of Education (“MOE”) had subsidised his medical\n                    costs for a year and paid him his annual salary of around $113,000 while he\n                    stayed at home. 5       On 10 March 2008, Mr Singh was\n                    employed as a zone manager (special projects) at Educare Cooperative Ltd\n                    (“Educare”), a Singapore Teachers’ Union co-operative. His\n                    starting salary was $1,700 per month. On 1 April 2009, he was appointed the\n                    head of Educare’s business development unit. To help him cope with his\n                    work, Educare purchased a hands-free desk phone and adopted a sympathetic\n                    approach to his need to go on medical leave. 6       On 20 June 2008, more than six months after\n                    leaving the service of MOE, Mr Singh commenced the present proceedings\n                    against Mdm Ong. He claimed that the accident had caused him to suffer permanent\n                    physical disability, especially to his neck, and that this affected his daily\n                    life and prevented him from earning his pre-accident salary as a teacher and\n                    Head of Department. He claimed $956,060 for loss of future earnings, $224,724\n                    for loss of pre-trial earnings, and $91,080 for future medical and transport\n                    costs. 7       On 14 January 2009, the parties agreed to\n                    have interlocutory judgment entered against Mdm Ong, with her liability assessed\n                    at 95%. The Court recorded a consent order which provided that: The Plaintiff’s damages [are] to be assessed by the Registrar and\n                        [the] parties hereto [are] at liberty to address the issue of causation in\n                        relation to matters relevant to quantum of damages and the matters relevant\n                        to quantum of damages include the scope of injuries, [the] issue of whether\n                        the injuries were caused solely by the accident and financial losses.",
        "Assessment of damages by the Assistant Registrar": "8       Damages were assessed by the AR from 25 to\n                    29 January 2010 and on 18 February 2010. 9       Mr Singh called two expert witnesses to\n                    testify on his behalf. The first, Dr Li Yung Hua\n                    (“Dr Li”), an orthopaedic specialist from Orthopaedic\n                    Associates, saw him on 48 occasions from 2007. The second expert witness,\n                    Dr N Venketasubramaniam Ramani (“Dr Ramani”), a senior\n                    consultant neurologist at the National University Hospital, saw him on 11\n                    occasions from 2007. Mdm Ong called one expert witness, namely Dr Chang Wei\n                    Chun, (“Dr Chang”), an orthopaedic surgeon from Orthopaedic\n                    & Traumatic Surgery Pte Ltd. 10     Video tapes of Mr Singh’s daily\n                    activities (“the video tapes”) over a period of time were\n                    furnished to the AR by two of Mdm Ong’s insurers’ private\n                    investigators, Simmon Security & Investigation Services Pte Ltd\n                    (“Simmon”) and Sterling Response Pte Ltd\n                    (“Sterling”). The video tapes showed that contrary to the picture\n                    painted by Mr Singh about his disabilities, he was able to walk more than 3\n                    km at a time, move his neck up and down, and drive and reverse his car without\n                    apparent difficulty. After viewing the video tapes, the AR concluded that\n                    Mr Singh seemed “perfectly capable of going about his activities of\n                    daily living” and “did not seem to exhibit any debilitating\n                    stiffness or pain in the neck or shoulder region”. More importantly, she\n                    stated that Mr Singh would in all likelihood have been able to continue his\n                    work as a teacher or Head of Department, with perhaps some modification in his\n                    work environment and habits. She mentioned that he could take more frequent\n                    breaks and have his computer equipment adjusted. Despite finding that\n                    Mr Singh could continue to work as a teacher, the AR awarded him damages\n                    for loss of pre-trial and future earnings on the basis that he was permanently\n                    disabled from earning his pre-accident salary as a teacher and Head of\n                    Department. 11     The AR held that Mr Singh’s loss of\n                    pre-trial earnings amounted to $233,855. For the purpose of assessing\n                    Mr Singh’s loss of future earnings, the AR accepted that he would\n                    have worked from the age of 46 until the age of 62. She adopted a multiplier of\n                    7 and a multiplicand of $84,590. As such, loss of future earnings was quantified\n                    at $592,130. The specific amounts awarded by the AR as damages were as\n                    follows: General Damages:Pain and suffering$12,000Loss of future earnings (7 x\n                                            $84,590)$592,130Future medical and transport\n                                            expenses$60,000Special\n                                        damages:Pre-trial loss of earnings (less\n                                            tax)$233,855Agreed special\n                                    damages$21,000Total:$918,985   12     After taking into account\n                    Mr Singh’s liability for 5%, the AR held that he was entitled to\n                    $873,035.75.",
        "Scope of Mdm Ong’s appeal": "13     There are two aspects to Mr Singh’s\n                    claim for damages for personal injury resulting from the accident. The first\n                    concerns the whiplash suffered by him. A whiplash, which is often associated\n                    with motor accidents, arises from a sudden and abnormal force applied to the\n                    neck that causes it to move beyond its normal range of movement. It causes soft\n                    tissue neck injury. In regard to this injury, Mr Singh was awarded $12,000\n                    for pain and suffering and $21,000 as special damages. Mdm Ong did not appeal\n                    against these awards. 14     The second aspect of Mr Singh’s\n                    alleged injury, which is the subject matter of the appeal, concerns\n                    “whiplash injury”. While people usually recover from a whiplash,\n                    some accident victims complain of continuing headaches, pain in the neck,\n                    tingling in the arms, dizziness, lumbar pains and fatigue. Mr Singh claimed\n                    to be suffering from such chronic whiplash injury and that this prevented him\n                    from continuing to work as a teacher. Mdm Ong contended that Mr Singh\n                    should not have been awarded damages for loss of pre-trial and future earnings\n                    as he could have continued to work as a teacher if he had wanted\n                to.",
        "The appeal": "15     As the parties amicably settled their dispute\n                    on the award of $60,000 for the cost of future medical care and transport and\n                    Mdm Ong did not appeal against the award of damages for pain and suffering\n                    ($12,000) or special damages ($21,000), the only issue before this court was\n                    whether or not Mr Singh was entitled to damages for loss of pre-trial and\n                    future earnings. Much depended on whether Mr Singh suffers from whiplash\n                    injury and if he does, whether or not the pain and discomfort prevented him from\n                    working as a teacher or Head of Department.",
        "The law": "16     In a claim for damages for personal injuries,\n                    the general rule is that the plaintiff has to prove the damage he claims to have\n                    suffered as a result of the defendant’s actions and the so-called\n                    “but for” test is applicable. InSunny Metal\n                        & Engineering Pte Ltd v Ng Khim Ming Eric[2007] 3 SLR(R) 782 (“Sunny\n                        Metal”), V K Rajah JA explained (at [64]): For the determination of whether a defendant's wrongful conduct is a causein factof the damage to a claimant, the\n                        test, which has almost universal acceptance, is the so-called \"but for\"\n                        test.... In other words, one should, in order to determine whether an act or\n                        omission was a cause of the loss, eliminate the act or omission mentally and\n                        consider whether or not the loss would still have occurred. If the loss\n                        would not have occurred when the act or omission is eliminated, the act or\n                        omission is acondicio sine qua nonfor the\n                        loss. If the loss would still have occurred, even when the act or omission\n                        in question is disregarded, the loss has not been caused by this act or\n                        omission.... However, even if the test yields a positive answer,ie, the loss would not have occurred but for the\n                        defendant's act or omission, it merely qualifies the act or omission as a\n                        possible, though by no means necessarily, sufficient cause for legal\n                        purposes.... [T]his act or omission must then be regarded as the causein lawand then pass an additional test of\n                        remoteness. In other words, \"but for\" is a necessary but not a sufficient\n                        condition of legal responsibility. [emphasis in original] 17     The “but for” test has its\n                    limitations and may not always produce a fair result. InSunny Metal, V K Rajah JA referred to the inadequacy of this\n                    test (at [69]) as follows: However, it has been said by many that the \"but for\" test is,\n                        in some circumstances, insufficient to lead to a just result. McLachlin J of\n                        the Canadian Supreme Court, writing extra-judicially in \"Negligence Law -\n                        Proving the Connection\" (inTorts Tomorrow: A Tribute to\n                            John Fleming(Nicholas J Mullany & Allen M Linden eds)\n                        (LBC Information Services, 1998) pp 16-35), has pointed out (at\n                        p 18) that the problem is that: [S]ometimes when the answer to the but-for test is negative, the\n                            circumstances nonetheless cry out that the defendant was a cause of the\n                            plaintiff's injuries and must be held liable. There is a tension between\n                            the traditional but-for, all-or-nothing, approach to cause-in-fact and\n                            the need to compensate persons who are likely victims of wrongful\n                            conduct, but who would be denied recovery under the traditional\n                            test. McLachlin J then goes on to list three situations in which the \"but for\"\n                        test is \"troublesome\",viz, in (a)\n                        indeterminate defendant cases; (b) indeterminate claimant cases and (c)\n                        indeterminate harm cases. For indeterminate defendant cases, the claimant\n                        has been tortiously injured, but it is not clear who, among a group of\n                        potential tortfeasors, was the cause in fact of the loss. As for the\n                        indeterminate claimant cases, the defendant has engaged in tortious conduct\n                        which has caused loss to a number of persons, but it is not clear whether\n                        the claimant belongs to the group of persons injured by the defendant's\n                        conduct. Finally, in respect of the indeterminate harm cases, a defendant\n                        has engaged in tortious conductvis-à-visthe\n                        claimant, but it is not clear whether the defendant's conduct actually\n                        caused harm to the claimant. All that can be said is that the defendant's\n                        conduct increased the risk of harm in that the claimant lost a chance of\n                        avoiding harm or of achieving a better result. These problems with the \"but\n                        for\" test were also recognised by this court inThe\n                            Cherry(at [69]). 18     Where the “but for” test does\n                    not produce a just result, other approaches are available. One approach noted inSunny Metal(at [73]) concerns the burden of\n                    proof. In appropriate cases, the court may adopt a commonsensical approach to\n                    causation and “although the burden of proving cause in fact is not\n                    reversed and no actual presumption of causation is created, an inference of\n                    causation may be drawn even in the absence of affirmative scientific evidence of\n                    causation, or where the claimant's evidence of causation is minimal”\n                        (Sunny Metalat [73]). Another approach\n                    referred to inSunny Metal(at [74]) relates to a\n                    loss of chance, which requires the causal link to be viewed on the basis of\n                    proportionate loss and the plaintiff’s damage is “effectively\n                    re-categorised as thechanceof obtaining a\n                    benefit or avoiding a loss, rather than the loss itself” [emphasis in\n                    original].",
        "Mr Singh’s evidence": "19     In an attempt to bolster his case that his\n                    chronic whiplash injury was caused by the accident, Mr Singh asserted as\n                    follows: (i)     Mdm Ong’s car was moving at a\n                        high speed when the accident occurred and that his car was badly damaged in\n                        the accident; (ii)     His car was badly damaged as a result of the accident;\n                    and (iii)     He had\n                        suffered from 23 symptoms (“the 23 symptoms”) of whiplash\n                        injury, and he had consulted Dr Li and Dr Ramani on all these\n                        symptoms. 20     As for whether Mdm Ong was driving her car at\n                    a high speed at the time of the accident, Mr Singh admitted that he knew\n                    that the speed at which the two vehicles collided was an important factor for\n                    determining the impact of the collision as well the extent of his injuries.\n                    Despite this, when he went to the Independent Damage Assessment Centre\n                    (“IDAC”) on the day of the accident to file a report (“the\n                    IDAC report”), he did not state that Mdm Ong had reversed her car at a\n                    high speed. In fact, he had agreed all along that Mdm Ong’s car was moving\n                    at only “about 15 to 20 km” per hour when the accident occurred.\n                    Furthermore, if Mdm Ong had reversed her car at a high speed, Mr Singh\n                    could have suffered some injury apart from the whiplash. Although he testified\n                    that he knew that he was required to lodge a police report if he had suffered\n                    even a slight injury in the accident, he stated in the IDAC report that he had\n                    no injuries and he did not lodge any police report on the day of the accident.\n                    He was not unfamiliar with an IDAC report because in his IDAC report in relation\n                    to an earlier accident in November 2004 (“the 2004 accident”), he\n                    stated that he had been injured in that earlier accident. I thus agree with Mdm\n                    Ong’s counsel that Mr Singh’s assertion that she had reversed\n                    her car at a high speed was unfounded. 21     As for the alleged damage to\n                    Mr Singh’s car, the photographs produced by the workshop showed that\n                    the car had only been slightly damaged. Mr Singh conceded that he did not\n                    mention in his affidavit for the assessment of damages that his car had been\n                    badly damaged. More importantly, when cross-examined, he finally admitted that\n                    the only problem he had with his car after the accident was that he had some\n                    difficulty opening the car boot. 22     Mr Singh’s evidence in relation to\n                    the speed at which Mdm Ong reversed her car before his car was hit and the\n                    alleged severe damage to his car showed that he was quite prone to exaggeration\n                    and this was confirmed by his evidence in relation to the 23 symptoms.\n                    Mr Singh claimed to have suffered from the following symptoms of whiplash\n                    injury: (i)     Pain in the neck commencing as mild\n                        pain initially after the accident becoming severe the next\n                    day. (ii)     Stiffness in\n                        the neck beginning on the day following the accident, 12 November\n                        2006. (iii)     Recurring shooting pain from his neck to his left arm and into the fingers\n                        of his left hand between 19 and 21 November 2006 when he was\n                        hospitalised. (iv)     The shooting pain radiated to his right arm after a few months around March\n                        or April of 2007. (v)     Numbness in his fingers beginning between 19 and 21 November\n                        2006. (vi)     Pain in\n                        the shoulder region beginning 12 November 2006. (vii)     Stiffness in the shoulder area\n                        starting around 15 November 2006. (viii)    Recurring headaches commencing while he\n                        was hospitalised between 19 and 21 November 2006 but intensifying from\n                        December 2006 or January 2007 onwards. (ix)     Recurring giddiness beginning in December\n                        2006. (x)     Numbness\n                        in the right cheek beginning in May or June 2007. (xi)     Difficulty lifting over 2kg of\n                        weight without feeling pain in the neck and shoulder region in\n                        November/December 2006. (xii)     Difficulty in squatting for more than 15 minutes\n                        commencing in January 2007. (xiii)    Inability to sit on the floor comfortably to pray at\n                        home or in the temple starting in January 2007. (xiv)     Difficulty working on the computer\n                        continuously for more than 15 minutes without causing strain on his neck and\n                        shoulder commencing in late November 2006. (xv)     A feeling like his neck was getting locked\n                        starting in November 2006. (xvi)     Sudden shooting pains from his neck to his arms and\n                        fingers when he tilts his head backwards or even when he rests on a couch,\n                        beginning in April or May 2007. (xvii)    Difficulty looking up for a prolonged period of time\n                        without experiencing neck pain starting around 14 or 15 November\n                        2006. (xviii)    Difficulty bending his neck down for a prolonged period of time commencing\n                        in December 2006. (xix)     Pain in his right jaw area starting in May 2007. (xx)     Difficulty sleeping starting in\n                        June, July or August 2007. (xxi)     Anxiety starting in late 2008 or early January\n                        2009. (xxii)    Sadness not amounting to clinical depression starting in November\n                        2007. (xxiii)    Inability to concentrate starting around April or May\n                2007. 23     Mdm Ong’s counsel, Mr Vinodh\n                    Coomaraswamy SC (“Mr Coomaraswamy”), wryly observed that\n                    Mr Singh had looked at the entire list of possible symptoms of chronic\n                    whiplash injury and claimed all of them as his own in his attempt to claim a\n                    massive amount of damages for the consequences of a minor\n                accident. 24     Mr Singh claimed that he had related the\n                    23 symptoms to his doctors, including Dr Li and Dr Ramani, as soon as\n                    he began to notice them. He added that all 23 symptoms had manifested themselves\n                    by the time Dr Li wrote his latest report. However, in that report,\n                    Dr Li only referred to Mr Singh’s neck ache, shoulder pain and\n                    headaches. 25     Dr Li’s evidence on the 23 symptoms\n                    contradicted Mr Singh’s testimony. When cross-examined on why he had\n                    not recorded many of the symptoms Mr Singh claimed to be suffering from,\n                    Dr Li said that he only recorded orthopaedic symptoms. Subsequently, he\n                    mentioned that Mr Singh did complain to him about numbness in the fingers\n                    and weakness in the right hand but he did not record these because he\n                    “did not find any objective loss of sensation” in the fingers or\n                    “objective weakness” in the hand. Dr Li added that\n                    Mr Singh had complained to him about numbness in the right cheek but he\n                    referred this to Dr Ramani, who is a neurologist, to treat this condition.\n                    Even if the additional evidence of Dr Li is taken into account, the fact\n                    remains that Mr Singh did not consult him on quite a number of the 23\n                    symptoms. 26     As for Dr Ramani, who treated\n                    Mr Singh’s neurological problems, he mentioned symptoms such as neck\n                    pain, finger numbness and headaches in his report on 4 April 2008 and left\n                    out many of the 23 symptoms. However, he testified that Mr Singh had also\n                    complained to him about giddiness, numbness and pain along the right jaw and\n                    difficulty in lifting heavy objects or sitting for too long. All the same, the\n                    fact remains that Dr Ramani did not see it fit to record these additional\n                    problems in his report and he testified that he could not recall that\n                    Mr Singh had complained to him about difficulty in squatting and sitting\n                    down to pray. Furthermore, he could see nothing in his medical notes about\n                    Mr Singh’s anxiety, sadness or difficulty in sleeping, all of which\n                    were part of the 23 symptoms. 27     When cross-examined, Mr Singh claimed\n                    that while he had noticed the omission of many of his symptoms in\n                    Dr Li’s report, he did not point this out to Dr Li or his\n                    lawyers because he respected Dr Li. However, the inescapable conclusion was\n                    that contrary to Mr Singh’s testimony that he had consulted his\n                    doctors on all the 23 symptoms, quite a number of them had never been disclosed\n                    to his doctors. This unnecessary attempt to bolster his claim for damages, as\n                    well as his assertion that he was involved in a high-speed accident and that his\n                    car was badly damaged in the accident, dented his credibility and made it\n                    necessary to ask whether any possible exaggeration by him of his pain and\n                    discomfort was taken into account by his doctors. After all, neck and shoulder\n                    pains are not uncommon problems and there is justifiable concern that some\n                    accident victims may exaggerate their neck and shoulder pains to make exorbitant\n                    claims against insurers on the basis of whiplash injury. It was thus not too\n                    much to expect Mr Singh’s doctors to conduct objective tests to\n                    verify his claims of pain and discomfort before coming to the conclusion that he\n                    deserved such prolonged medical leave as well as a medical assessment that he\n                    could no longer work as a teacher.",
        "The medical experts’ evidence": "28     Mr Singh’s expert witness,\n                    Dr Li, who has had 15 years of experience as an orthopaedic specialist, was\n                    quite aware of the need to conduct objective tests to verify\n                    Mr Singh’s claims of pain and discomfort. After all, he was aware of\n                    the biopsychosocial model of chronic whiplash injury (“the\n                    biopsychosocial model”), in respect of which there is much medical\n                    literature. This model suggests that the development of chronic symptoms after a\n                    whiplash incident may be linked to psychological, cultural and social factors.\n                    Apparently, in countries where the general population has very little knowledge\n                    or expectation of chronic whiplash injury, the incidence of whiplash injury is\n                    very low. However, where information on the potential for chronic pain after a\n                    whiplash is widely available, the expectation of future chronic pain by some\n                    accident victims may lead them to become hyper-vigilant for symptoms and to\n                    regard some normal bodily sensations as abnormal or alarming. 29     When cross-examined on the biopsychosocial\n                    model, Dr Li testified as follows: QA hyper-vigilant patient who expects chronic\n                            symptoms can start to register previously unintrusive symptoms;\n                            right? AYes. QHe will then attribute them to the whiplash\n                            incident; right? APossible. .... QThis pool of symptoms is just\n                                life’s normal aches and pains, which a hyper-vigilant patient\n                                is now magnifying in his mind; right? APossible. QNot “possible”; its known to happen\n                            and the literature records it; yes? AYes. [emphasis added] 30     Mr Coomaraswamy submitted that\n                    Mr Singh’s complaints of chronic whiplash injury may be accounted for\n                    by the biopsychosocial model. He pointed out Mr Singh’s family\n                    doctor, Dr Wilmot Rasanayagam (“Dr Wilmot”), had\n                    testified that he was “the type of chap who’s very – very,\n                    very curious about his health”. He also noted that Mr Singh had\n                    testified that he had done research on the consequences of a whiplash incident\n                    and had been told by others, including his sister, a nursing officer, that the\n                    pain could be very severe for the rest of his life. 31     Dr Chang took the view that the severity\n                    and range of the symptoms allegedly suffered by Mr Singh were\n                    psychologically caused and/or were due to his personal psychological\n                    magnification of his symptoms. Significantly, Dr Li agreed that there was\n                    some evidence that Mr Singh’s case falls within the biopsychosocial\n                    model and that the latter had exaggerated his symptoms by 30%. When\n                    cross-examined, Dr Li stated: QDo you consider his pain and his whiplash to fall\n                            within what was described as the biopsychosocial model [of] chronic\n                            whiplash? AI think he does have some\n                                evidence of that.A person with chronic pain syndrome\n                            tends to have also some psychological inference into it, which sometimes\n                            cause a little bit of magnification. But to some extentI believe he has both, which is very difficult\n                            to distinguish what is the component, butI think the\n                                genuine part is probably may be 70 per centand thenanother 30 per cent is probably affected by his\n                                psychology. [emphasis added] 32     I agree with the AR’s conclusion that\n                    Mr Singh’s symptoms were “likely to [have been] magnified by\n                    the biopsychosocial model of chronic whiplash”. The question which arises\n                    is whether Mr Singh’s doctors had sufficiently checked whether\n                    Mr Singh’s complaints of pain and discomfort were genuine or\n                    exaggerated.",
        "Lack of objective medical tests by Dr Li and\n                Dr Ramani": "33     Dr Li, who had granted medical leave to\n                    Mr Singh for several months after the accident, agreed that he owed a duty\n                    to the latter’s employer to make sure that the prolonged medical leave was\n                    justified. 34     What a patient tells his doctor is of course\n                    the starting point for the latter’s diagnosis. However, bearing in mind\n                    that Dr Li thought that Mr Singh had exaggerated his symptoms by 30%\n                    (see[31], above), it was rather disturbing\n                    that he relied primarily on the latter’s description of symptoms when he\n                    decided to grant the latter medical leave for such a long time.\n                    Dr Li’s following answers during cross-examination showed just how\n                    much he relied on Mr Singh’s words: Q... [T]o discharge your duty to his employer,\n                            don’t you think you need to ask him how he knows that this pain is\n                            affecting his ability to go to work if he has not been to\n                        work? A....My assessment is\n                            that he shouldn’t be going to work. QBut that assessment, again, is\n                                because he tells you things about what he can’t do at\n                                work? AThat’s\n                            right. QEven though, according to him, he hasn’t been\n                            to work? AThe recordingis what he told\n                        me. [emphasis added] 35     Dr Ramani who testified that he did not\n                    observe any worsening of Mr Singh’s neurological deficits since he\n                    first examined the latter, admitted that he was not an expert on detecting\n                    falsehoods in what his patients tell him. Despite this, he testified that he\n                    accepted Mr Singh’s complaints of pain and discomfort at face value.\n                    He added that he saw no need to check whether or not Mr Singh’s\n                    complaints of pain and discomfort were genuine because he\n                    “trusted” his patient. The relevant part of the proceedings is as\n                    follows: QAnd you take what [Mr Singh] says at face\n                            value. AYes. QYou don’t investigate, you\n                                don’t test what he says for\n                        truthfulness? AI trust what my patient tells\n                                me. …. QYou werenot actively checking to\n                                see whether he was simulatingor manifesting genuinesymptoms, because you trust your\n                            patients? …. AYes. [emphasis added] 36     Dr Ramani may trust Mr Singh.\n                    However, Mdm Ong and her insurers are entitled to the benefit of available\n                    clinical tests to determine whether or not Mr Singh, who was claiming a\n                    massive amount of damages for his alleged chronic whiplash injury, was really\n                    suffering from the symptoms of such injury. 37     Dr Li agreed that whether or not a person\n                    suffers from chronic whiplash injury can, to some extent, be determined\n                    objectively by medical tests. When cross-examined, he stated: QIn fact, if you want to assess disability arising\n                            from whiplash injury, there are various tests which you have to apply;\n                            correct? AThat's right. QOne is the visual analogue scale for\n                        pain? AThat's right. QThe other is the neck disability index;\n                            correct? AThat's right. QAnd applying those, you come up with scores;\n                            correct? AThat's right. QAnd if the score falls below a certain value, you\n                            opine that he is disabled from carrying on? A.That's right. QYou have not referred in your\n                                affidavit to any of those tests, have you? ANo, we didn't do it. But we did,\n                                as a routine, every patient whether they come in, we do a visual\n                                analogue score, VAS score. QWhen was\n                        that? AThat was at the time of\n                                admission. [emphasis added] 38     Dr Li should not have relied on the\n                    Visual Analogue Scale that had been computed at the time of the accident in\n                    November 2006. He candidly admitted that he could have done more before deciding\n                    that Mr Singh was so disabled that he could no longer teach. When\n                    cross-examined, he conceded as follows: QSo you agree it’snot good\n                                practice to form a conclusion on disability without administering a\n                                current VAS and NDI;correct? AYes. QIn that sense, you have not followed good practice\n                            in the affidavit; right? AYes. [emphasis added] 39     Dr Ramani admitted that he was not aware\n                    of the Neck Disability Index and that he did not rely on the Visual Analogue\n                    Scale. Furthermore, unlike Dr Li, Dr Ramani had not heard of the\n                    biopsychosocial model of whiplash syndrome. While there may be other ways to\n                    objectively assess Mr Singh’s condition, the fact remains that\n                    Dr Ramani relied primarily on Mr Singh’s description of his pain\n                    and discomfort for his diagnosis. In the light of Dr Li’s admission\n                    that he had not “followed good practice” when he did not compute a\n                    current Visual Analogue Scale and Neck Disability Index, Dr Ramani must\n                    also be faulted for not relying on these tests or other objective tests for his\n                    diagnosis of Mr Singh’s condition. In any case, Dr Ramani, who\n                    said that his approach to whiplash was primarily from a neurological\n                    perspective, testified more than once that where his diagnosis differed from\n                    that of Dr Li, he would defer to the latter who, being an orthopaedic\n                    specialist, was in a better position to diagnose Mr Singh’s\n                    condition. Admittedly, Dr Ramani subsequently wanted an opportunity to\n                    “rethink” and “revise” his previous responses where\n                    he had agreed to defer to Dr Li. However, Mr Coomarawamy rightly\n                    pointed out that “defer” is an ordinary word which Dr Ramani\n                    understood perfectly and that the latter was in fact trying to change his\n                    evidence. 40     Unlike Dr Li and Dr Ramani,\n                    Dr Chang, who has had 34 years of experience in the field of orthopaedic\n                    and trauma surgery, was convinced that Mr Singh had faked his neck\n                    immobility and part of his discomfort and pain. Dr Chang, who examined\n                    Mr Singh and studied his medical records as well as the private\n                    investigators’ surveillance reports and video tapes, asserted that when he\n                    examined Mr Singh on 24 March 2009, the latter had deliberately\n                    refused to move his neck. He deduced that Mr Singh’s alleged neck\n                    immobility was feigned for a number of reasons. First, Mr Singh held his\n                    neck in a stiff position although there was no muscle spasm. While Dr Chang\n                    conceded that a surgeon cannot tell from a physical examination whether or not a\n                    spasm is genuine, he had called for an x-ray to confirm his diagnosis. Secondly,\n                    Mr Singh’s x-ray results on the same day revealed a normal curvature\n                    in his spine, which was inconsistent with his physical display of stiffness.\n                    Thirdly, a person with severe pain in the neck can usually move a few degrees\n                    but Mr Singh “absolutely” refused to move his neck. Finally,\n                    it appeared from the private investigators’ video tapes that after leaving\n                    his clinic on 24 March 2009, Mr Singh was far more mobile than he had\n                    claimed to be during the medical examination at his clinic. 41     Apart from not conducting sufficient objective\n                    tests to determine Mr Singh’s true condition, the credibility of\n                    Dr Li’s diagnosis was affected when he withdrew his original\n                    diagnosis of the former’s cervical spondylosis, which could give rise to\n                    many of the symptoms in question. Dr Li had initially taken the position\n                    that the accident had caused Mr Singh to have a disc bulge, which is an\n                    aspect of cervical spondylosis, and stenosis, which is an abnormal narrowing of\n                    the spinal canal. Symptoms of stenosis include pain in the neck or back,\n                    numbness as well as weakness or pain in the arms, all of which were included in\n                    Mr Singh’s complaints about his condition. He informed\n                    Mr Singh’s lawyers about this diagnosis. However, when\n                    cross-examined, Dr Li contradicted what he had told Mr Singh’s\n                    lawyers and agreed that his advice that the accident had caused the cervical\n                    spondylosis was wrong. The relevant part of the proceedings is as\n                    follows: QI will put it another way, Dr Li: based on what\n                            you know of the plaintiff and the material before you,you would be wrong to draw the conclusion that the traffic\n                                accident caused the stenosis and the bulge; right? That would be a\n                                wrong conclusion; right? AYes. .... Q... [C]an you confirm that you told\n                            [Mr Singh’s] lawyers that the road traffic accident did cause\n                            the disc bulge and stenosis; that was your opinion? AYes. QDo you recall about 20 minutes ago you said that it\n                            would be wrong to draw the conclusion based on the material you had\n                            before you? AI said I cannot disprove it as well\n                        .... QSo it would have been proper for you to tell\n                            [Mr Singh’s] solicitors that you had no opinion, or you can\n                            express no opinion? AYes. .... QYou should not have said ... the\n                                road traffic accident cause the disc bulge and stenosis;\n                                correct? APossible. QNot possible.You should not have\n                                done that. You have no basis to do that? AOkay,\n                        yes. [emphasis added] 42     Dr Chang, who noted that\n                    Mr Singh’s cervical spondylosis was not uncommonly seen in the\n                    latter’s age group, stated that there was “clear-cut evidence of\n                    degenerative changes of [Mr Singh’s] spine”. He explained that\n                    Mr Singh’s disc bulge was caused by degenerative process rather than\n                    by trauma during the accident. When cross-examined, he testified that if the\n                    disc problem had been caused by the accident, one would see a herniated disc\n                    instead. He added that a disc bulge, which is secondary to a degenerative disc\n                    disease, arises when the disc bulges out of a weak wall. In contrast, a\n                    “herniated disc”, which can be caused by the degenerative process\n                    as well as trauma, refers to a situation in which the discrete disc material\n                    comes through the annulus in a discrete manner and compresses on a\n                nerve. 43     Whatever may have been the cause of\n                    Mr Singh’s cervical spondylosis and stenosis, Dr Li’s\n                    change of position on this matter would have been unnecessary if he had not\n                    given the wrong medical opinion to Mr Singh’s lawyers. 44     When considering Dr Li’s diagnosis\n                    of Mr Singh’s neck problems, it must be borne in mind that he had\n                    assumed that the latter had not complained about neck pain prior to the accident\n                    in 2006. However, the truth was that Mr Singh had been involved in a\n                    similar accident in 2004 and he had stated in his IDAC report on 22 July\n                    2004 (“the 2004 IDAC report”) that he suffered from head and neck\n                    pain. This fact was not disclosed to Dr Li. In fact, the 2004 IDAC report\n                    was only disclosed on 21 January 2010, four days before the hearing on the\n                    assessment of damages commenced. 45     When cross-examined, Mr Singh agreed that\n                    the 2004 accident was “almost exactly the same as what happened in\n                    November 2006” in that his car was hit from the rear at about the same\n                    speed. Dr Li testified that if he had known about the 2004 accident, it\n                    would have been relevant to his consideration of Mr Singh’s\n                    condition. He also agreed that if Mr Singh had complained of neck pain\n                    after the accident in 2004, that pain would be regarded as a whiplash injury.\n                    Most important of all, he accepted that if a person in a car had been struck\n                    from behind by another car in July 2004, it is quite possible that what he\n                    claims to be experiencing now could be due to that earlier accident. On this\n                    point, he testified as follows: QSo somebody could have a whiplash injury, say, in\n                            July 2004, ... and then show symptoms only in 2007; is that\n                            right? AMaybe even 10 years down the road. QEven later than that? AYes. Q....So if the plaintiff was\n                                struck from behind in July 2004, it’s quite possible that what\n                                he is experiencing now is due to that accident,\n                            right? AThat’s\n                            possible. [emphasis added] 46     To sum up, I preferred the evidence of\n                    Dr Chang, which is that while he does have residual neckache and stiffness\n                    from the accident, he was not as debilitated as he claimed to be as a result of\n                    the accident. The next question to be considered is whether\n                    Mr Singh’s medical condition after the accident, shorn of his\n                    exaggerations, affected his ability to teach.",
        "Whether Mr Singh’s pain and discomfort affected his\n                ability to teach": "47     It is one thing for a doctor to say that his\n                    patient suffers from neck and shoulder pain and another to say that the patient\n                    suffers from so much neck and shoulder pain that he can no longer teach. As\n                    Mr Singh did not return to the school to teach after the accident in\n                    November 2006, how did Dr Li and Dr Ramani conclude that Mr Singh\n                    could no longer teach? 48     Surprisingly, Dr Ramani testified that he\n                    could not recall ever having spoken to Mr Singh about returning to work as\n                    a teacher. As for Dr Li, he testified that he had assumed that\n                    Mr Singh had gone back to work while the latter was on medical leave and\n                    had found it difficult to cope with his work. This was a false and fundamental\n                    assumption. 49     Dr Li admitted that the “only\n                    basis” for his conclusion that Mr Singh could no longer work as a\n                    teacher was that he accepted at face value what Mr Singh told him. When\n                    cross-examined, he stated as follows: Q[Mr Singh] complained of having frequent neck\n                            ache and headache.Again, you accepted what he said\n                                at face value; right? AThat's\n                        right. …. Q[Mr Singh] told you that the pain had affected\n                            his work as a teacher and head of department. Is that what he told\n                            you? AYes. …. QSo, he also told you that he had difficulty with\n                            prolonged use of computer which would aggravate his neck pain.Again, you have no objective means of testing\n                                that? AYes. QHe also told you he had a problem looking up during\n                            teaching because of neck stiffness and pain. You have no objective means\n                            of verifying that? AI can actually verify it, because I actually measure\n                            his angles and so on, he has difficulty lifting his head for a prolonged\n                            period of time. QButif he was lying to you about\n                                the pain, he can easily simulate difficulty looking up;\n                                right? .... AYes. QYou say in your report, at page 2: \"He still\n                            experienced pain radiating to his left shoulder which could be\n                            excruciating at times.\" Again, these are his words; right? AThat's right. QWhich you have no objective means of\n                            verifying? AThat's right. QYou go on to say: \"His daily activities and work had\n                            been affected significantly by the symptom.\"Again,\n                                that's what he told you; right? AThat's right. .... QYou say:\"He was not able to\n                                exercise as well.\" That is based only on what he told\n                                you? ACorrect. QAgain, no objective\n                                verification? ACorrect. …. Q... [Y]ou say: \"Mr Menjit Singh sustained\n                            whiplash injury following the road traffic accident. He is still\n                            symptomatic and undergoing treatment.\"The only basis\n                                on which you said he was still symptomatic is because you believed\n                                him not to be simulating his symptoms;\n                        right? ACorrect. [emphasis added] 50     Dr Ramani’s assessment that\n                    Mr Singh could no longer teach was also flawed because he relied primarily\n                    on the latter’s words although he also took into account his own knowledge\n                    of what a teaching job entails. The relevant part of the proceedings is as\n                    follows: Q    If you turn to\n                            paragraph 11 of your affidavit, you expressed the view\n                        there: “The plaintiff is unlikely to return to his previous job as a\n                            teacher or any physically demanding jobs due to his illness as these\n                            will aggravate his symptoms.” All of that is based on what the [Mr Singh] told\n                            you? AAndalso my\n                            understanding of what the job of a teacher entails. [emphasis added] 51     Although Dr Ramani took the view that\n                    Mr Singh could no longer teach after the accident, he gave the following\n                    evidence when he was asked about Mr Singh’s condition on the day he\n                    was cross-examined: Q    You carry on in\n                            paragraph 11 and you say: “I informed the Ministry of Education that\n                            [Mr Singh’s] medical condition did not allow him to continue\n                            as a teacher” That was the report you made in 2007? AYes. QAre you able to express any opinion on\n                            [Mr Singh’s] conditiontoday,\n                            whether his ability to continue or to return to work as a\n                            teacher? AWell, I can’t say\n                                today, but when I saw him on 19 January, which was\n                            about a week ago, when I examined him, my opinion is\n                        unchanged. [emphasis added] 52     It was rather surprising that on the day of\n                    his cross-examination, Dr Ramani could not say for certain that\n                    Mr Singh could no longer teach when he was so sure a week earlier that the\n                    latter could no longer work as a teacher. 53     Dr Chang testified that it was highly\n                    unlikely that Mr Singh could not work as a teacher after the accident. When\n                    cross-examined, he said: I still hold to my belief thathis symptoms are not bad\n                            enough that he has to leave the education service, based on\n                        the fact ... that he had a mild injury, his symptoms, though severe, did not\n                        match what was found physically, andmy total experience\n                            of that was that the symptoms were basically magnified. And\n                        therefore, I feel thatthere was no ... pathological\n                            basis for his symptoms, then he should be able to\n                        work. [emphasis added] 54     When Mr Singh’s counsel,\n                    Mr Chelva Rajah SC, pointed out what a teacher’s job entails,\n                    Dr Chang reiterated that Mr Singh could have continued to teach. The\n                    relevant part of the proceedings is as follows: QIf, as a teacher,\n                            you are required to sit down and mark books hours on end; if as a\n                            teacher you are required to look at your television or your monitor and\n                            work for one hour or two hours in there; if as a teacher you are\n                            required to stand up and write on the white board for long periods of\n                            time; and those are activities which someone suffering from whiplash is\n                            unable to do, wouldn’t you say that that person will not be able\n                            to carry on as a teacher, and as a head of\n                            department? AI agree that he has\n                            some symptoms and signs, but I feel those symptoms and signs are not bad\n                            enough that he needs to be boarded out.If he sits\n                                and marks papers, he can always stand up, walk around, stretch\n                                himself, okay, so he can pace himself at these\n                            things. I‘m not saying that he has no disability,\n                                I’m saying that the disability he has does not preclude him\n                                from continuing to work as a teacher. [emphasis added] 55     The findings of the private investigators who\n                    had tailed Mr Singh for many days and their video tapes shed some light on\n                    the latter’s real condition and support Dr Chang’s view. During\n                    the hearing of the appeal, I viewed the video tapes. I noticed that while there\n                    were a few occasions when Mr Singh was seen rubbing his neck for a little\n                    while, he appeared to have handled his daily activities, including walking for\n                    hours at a time and driving and reversing his car, quite well. It appeared from\n                    the video tapes that Mr Singh had exaggerated his pain and\n                    discomfort. 56     Considering that Mr Singh had complained\n                    that it was difficult for him to stand and move his neck while teaching, the\n                    following conclusions by Sterling on his physical condition (at para 6.1 of\n                    its report) are rather telling: Based on the surveillance conducted, the operatives made the following\n                        observations: 6.1.1[Mr Singh]walked with a\n                                normal gait.He alsowalked briskly\n                                most of the time; 6.1.2He couldwalk for\n                                considerable distancesandremained on\n                                his feet for sustained periods of time; .... 6.1.4He could commute by bus, MRT and\n                        LRT; 6.1.5Hecould drive a\n                                car; 6.1.6Hecould turn his head to the\n                                left, right, up and down; 6.1.7He ascend[ed] and descend[ed]\n                        stairs. [emphasis in original omitted; emphasis added] 57     The second private investigator, Simmon, also\n                    pointed out that Mr Singh could move his neck with ease. In paras 23\n                    and 27 of the Simmon report, it was stated: 23.... The surveillance and investigation revealed\n                            that [Mr Singh] … is able to drive for more than fifteen\n                            minutes, is able to carry out his daily activities of reporting for\n                            work, visiting the Gurdwara Sahib Silat Road Temple.It is also interesting to note that [Mr Singh] was able to\n                                walk a distance of 1.6 km from the lane off Buffalo Road to Plaza\n                                Singapura and back covering a distance of 1.7 km.Operatives furtherdid not see the [Mr Singh]\n                                suffering from any residual\n                        disabilities… ... 27[Mr Singh] drove the very car involved in the\n                            accident andhad no problems looking up to the road\n                                whilst driving. [He] is able to sit for more than fifteen\n                            minutes whilst eating and driving andwas able to\n                                bend his neck with ease. [emphasis added] 58     Dr Li and Dr Ramani thought that the\n                    video tapes were not inconsistent with their view that Mr Singh could no\n                    longer work as a teacher. However, Dr Chang pointed out that as the video\n                    tapes showed that Mr Singh could carry on with daily activities without any\n                    problems, it may be implied that whatever neck symptoms he had, they were not\n                    bad enough to prevent him from working as a teacher. In a letter to Mdm\n                    Ong’s solicitors, United Legal Alliance LLC, on 19 October 2009,\n                    Dr Chang stated: … In both the surveillances it was noted that\n                        [Mr Singh] went about his daily activities with no apparent distress.\n                        He not only walked normally but was able to stand and walk for long periods\n                        and long distances as well as climb up and down stairs. He was:- 1)    noted to move his neck with no suggestion of\n                                pain 2)    able to drive 3)    able to travel by bus, MRT and\n                            LRT. In regard to the queries, please find below the\n                        answers. 1)He carried a soft collar in his right hand when\n                                he [came to my clinic] on 24.3.09 for the examination. The\n                                surveillance also noted that he carried the collar after he left\n                                Gleneagles Medical Centre. The collar was not seen on the other\n                                days. This would imply that he did not require a cervical collar.I had the impression that he probably brought\n                                    the collar to the clinic on 24.03.09 to help magnify his\n                                    symptoms. 2)At the examination of 24.3.09, I was not able\n                                to correlate his symptoms to the clinical findings. During physical\n                                examinationhe held his neck rigidly and refused\n                                    to move it at all. 3)He was able to move his neck\n                                    more freely when away from the clinic setting. This was\n                                    confirmed by the surveillance. This would imply[that]he\n                                    exaggerated his disability during the examination of\n                                    24.3.09. 4)The symptoms and signs of whiplash injury are\n                                very subjective. The alleged severity of his symptoms and marked\n                                immobility of his neck in the clinical setting were disproportionate\n                                to the mild nature of the accident.His\n                                    activities observed by the surveillance companies did not\n                                    indicate any significant neck disability. Since his symptoms and\n                                    signs did not correlate, it was felt that the disability\n                                    portrayed by the plaintiff was exaggeratedi.e. the\n                                perceived disability had a significant non-organic functional (non\n                                specific pathology) aspect. Functional here means “of the\n                                mind”. 5)[Mr Singh] does have\n                                    residual neckache and stiffness from the accident. However it is\n                                    highly unlikely that the symptoms were so severe that he is\n                                    unable to continue his previous job as a teacher and Head of\n                                    Department. [emphasis added] 59     When cross-examined on the video tapes,\n                    Mr Singh conceded that he could walk, albeit not briskly, for 3.2 km and\n                    that he could drive a car for short distances. He also conceded that to an\n                    observer, it appeared that he was not suffering from residual disabilities when\n                    he was walking or driving his car. 60     Teachers do not have to walk briskly in a\n                    classroom and they do have breaks between periods of teaching. If Mr Singh\n                    can walk 3.2 km, he can certainly stand and walk a few steps every now and then\n                    in the classroom while teaching his students. As for neck movements, if\n                    Mr Singh can move his neck while driving andreversinga car, he should be able to move his neck sufficiently\n                    while teaching his students. I had no doubt that Mr Singh was not as\n                    incapacitated as he claimed to be.",
        "The decision of the Medical\n                Board": "61     At this juncture, the fact that Mr Singh\n                    had been medically boarded out as a teacher by MOE will be\n                considered. 62     Undoubtedly, the Medical Board’s\n                    decision must be given ample consideration. In coming to its decision, the\n                    Medical Board relied on Mr Singh’s oral representations that he was\n                    unable to work as a teacher and on the his doctors’ views, which were also\n                    based on the same oral representations on his condition. 63     Mr Singh claimed that his whole world\n                    came crashing down when he was medically boarded out by MOE but he had made no\n                    attempt to persuade the Board to allow him to remain in MOE. Although he had\n                    told the members of the Board that he was unable to carry out a teacher’s\n                    tasks, he wasted the court’s time by testifying that it was not his\n                    opinion that he could not perform a teacher’s tasks. The relevant part of\n                    the proceedings is as follows: QYou explained to the medical board that you felt\n                            yourself unable to perform the tasks you need to carry on as a\n                            teacher? AYes, the difficulty\n                            like bending, looking up, limited use of the computer. QBased on your own treating doctor’s report and\n                            your own oral account, the MOE boarded you out? AThey ... make their own conclusion. QBut they have to base their own conclusions on\n                            facts? AYes, on what I have been telling\n                                them. .... Q[You were] failing to perform, with no prospect of\n                            ever being able to perform, according to you? AIt’s not my opinion.I did\n                                not pass the opinion that I could not\n                        perform. QMr Singh, let’s not go around in circles.\n                            We agreed earlier that they reached an opinion based on what you told\n                            them and what your treating doctor, Dr Li, told them,\n                        right? AYes, from their professional opinion. QAnd the opinion they reached is that ... there was\n                            no reason for you to remain in the education service if you were unable\n                            or unwilling to perform the duties for which you were\n                        engaged? AYes, correct. [emphasis added] 64     As I have found that Mr Singh had\n                    exaggerated his symptoms and could have continued to work as a teacher, what he\n                    told the Medical Board about his medical condition was not a true picture of his\n                    symptoms. 65     The views of Dr Li and Dr Ramani\n                    were relevant to the deliberations of the Medical Board. Dr Li submitted\n                    reports on Mr Singh’s condition to MOE while Dr Ramani was one\n                    of two members of the said Board. When cross-examined on why he thought in\n                    August 2007 that Mr Singh was still unlikely to be able to return to the\n                    school to teach, Dr Ramani showed just how much his opinion was based on\n                    what Mr Singh himself said when he testified as follows: Q.... My question is: in August 2007, what was the\n                            basis for you to think that he was still unlikely to return to his\n                            previous job, when he hadn’t been required to perform those duties\n                            in the entire intervening period? AI did record here on 21 August 2007 that he was\n                            having difficulty with his daily activities, because of pain in the neck\n                            and the numbness in the limbs were troubling him, he couldn’t look\n                            up and down comfortably because of the stiff neck and the pain in his\n                            neck, headache and giddiness were there, and couldn’t lift\n                            objects, even notebooks, and couldn’t sit for too\n                        long. QThat’s all based on what he\n                                told you on that day? AYes. [emphasis added] 66     As has been mentioned, the failure of\n                    Dr Ramani and Dr Li to satisfy the court that Mr Singh was\n                    permanently disabled from working as a teacher undermined Mr Singh’s\n                    claim for damages for loss of pre-trial and future earnings. As the Medical\n                    Board’s decision was based on the same defects as the evidence of\n                    Dr Ramani, Dr Li and Mr Singh at the hearing on assessment of\n                    damages, I hold that the said decision does not stand in the way of a finding\n                    that Mr Singh could have returned to work as a teacher before he was\n                    medically boarded out by the MOE.",
        "Conclusion on Mr Singh’s\n                    condition": "67     A victim who suffers from chronic whiplash\n                    injury after a motor accident should be awarded an appropriate amount of damages\n                    for the injury. However, as chronic whiplash injury can be easily faked, there\n                    must be adequate proof of such an injury. Where possible, objective medical\n                    tests must be conducted by the doctor to test the veracity of an accident\n                    victim’s complaint of chronic whiplash injury. A doctor should not rely\n                    primarily on what an accident victim claims are his symptoms of chronic whiplash\n                    injury to form an opinion that the victim can no longer work. Otherwise, the\n                    door will be open to anyone involved in a minor accident to mount frivolous\n                    claims for damages for such an injury, and especially so when many people who\n                    have not been involved in road accidents also suffer from neck and shoulder\n                    pain, which are two of Mr Singh’s main complaints. If caution is not\n                    exercised, the general public will have to bear the burden of higher premiums on\n                    their motor insurance policies. InHeil v Rankin and another\n                        and other appeals[2001] 1 QB 272, Lord Woolf MR (at\n                        [35]) referred toWise v Kaye[1962] 1 QB 638 at 669-670, where Diplock\n                    LJ stated: [I]nsurance removes the immediate burden of paying damages from the\n                        individual defendants and spreads it ultimately over the general body of\n                        premium-paying policy-holders. Here it increases in most cases the general\n                        cost of goods and services, in some cases merely the cost of private\n                        motoring, with consequent hardship to the public as a whole. To avoid fixing\n                        the scale at a level which would materially affect the cost of living or\n                        disturb the current social pattern is a factor, Benthamite no doubt in\n                        origin, in the empirical process by which the maximum/datum is\n                        determined. 68     In the present case, Dr Li and\n                    Dr Ramani relied primarily on what Mr Singh had told them about his\n                    alleged symptoms and did not do enough to verify Mr Singh’s claims.\n                    After taking all circumstances into account, I accept Dr Chang’s\n                    evidence that while Mr Singh suffers from a residual neckache and stiffness\n                    from the accident, it is “highly unlikely that the symptoms were so\n                    severe that he is unable to continue his previous job as a teacher and Head of\n                    Department”. In view of this, I hold that that it was not proven that\n                    Mr Singh suffered from such chronic and permanent disability as a result of\n                    the accident that he could not continue to work as a teacher or Head of\n                    Department.",
        "Damages for loss of earnings and loss of earning capacity": "69     As it was not established that Mr Singh\n                    could no longer work as a teacher or Head of Department as a result of the\n                    accident, the question of an award of damages for loss of earnings does not\n                    arise and the AR’s award for loss of pre-trial and future earnings is set\n                    aside. 70     A question arises as to whether an award of\n                    damages for loss of earning capacity is appropriate. Such an award is made to a\n                    plaintiff whose chances in the future of getting work as well paid as before the\n                    accident have been lessened by the injury. InFairley v John\n                        Thompson (Design and Contracting Division) Ltd[1973] 2 Lloyd's\n                    Rep 40, Lord Denning MR made it clear (at 42) that while compensation for loss\n                    of future earnings is awarded for real assessable loss proved by evidence,\n                    compensation for diminution in earning capacity is awarded as part of general\n                    damages. 71     InChai Kang Wei Samuel v\n                        Shaw Linda Gillian[2010] 3 SLR 587, the Court of\n                    Appeal stated (at [36]) that “[i]t is\n                    trite that an award for loss of earning capacity (in the context where the\n                    plaintiff is currently employed) can only be awardedif there\n                        is a substantial or real riskthat the plaintiff could lose his\n                    or her present job at some time before the estimated end of his or her working\n                    life and that the plaintiff will, because of the injuries, be at a disadvantage\n                    in the open employment market” (emphasis in original). In the present\n                    case, there was no basis for an award for loss of earning capacity. Apart from\n                    the fact that there was insufficient evidence that Mr Singh could not teach\n                    or that there was a substantial or real risk of losing his teaching appointment\n                    had he not decided to stay away from the school for such a prolonged period,\n                    there was also no evidence before the court that there was a substantial or real\n                    risk that he would lose his present job. Mr Singh confirmed that his\n                    present employer is “sympathetic and understanding”. In view of\n                    this, the question of damages for loss of earning capacity need not be further\n                    considered.",
        "Costs": "72     I will hear the parties on\n                costs."
    }
}