{
    "case_title": "Join-Aim Pte Ltd \n      v\n      BS Mount Sophia Pte Ltd and another",
    "ncitation": "[2012] SGHC 3",
    "coram": "Tay Yong Kwang J",
    "sections": {
        "Introduction": "1       The plaintiff (the main contractor in a building\n                    project) sought an injunction to restrain the 1stdefendant (the employer in the building project) from calling on a Performance\n                    Bond for the amount of S$360,084.62.[note: 1]This Performance Bond was issued by the\n                        2nddefendant.[note: 2] 2       Having heard arguments by both parties, I\n                    decided that the interim injunction granted earlier by Andrew Ang J should\n                    stand, pending arbitration between the plaintiff and the\n                        1stdefendant. I now set out my\n                reasons.",
        "Facts": "",
        "Parties to the dispute": "3       The plaintiff is a Singapore incorporated\n                    company, having its address at Block 201E Tampines Street 23 #04-94, Singapore\n                        527201.[note: 3]It is the main\n                    contractor under the Contract (see[6]).[note: 4] 4       The 1stdefendant is\n                    also a Singapore incorporated company. Its address is at 2 Mistri Road #01-03,\n                    Singapore 079624.[note: 5]It is the employer under the Contract.[note: 6] 5       The 2nddefendant\n                    issued the Performance Bond in favour of the 1stdefendant.[note: 7]",
        "Background to the dispute": "The call on the Performance Bond 6       The plaintiff, as main contractor, entered into\n                    a contract with the 1stdefendant, as developer, on\n                    28 February 2008 (“the\n                    Contract”) for the erection of a 5-storey residential\n                    development comprising 50 units with swimming pool and basement carparks at 95\n                    Sophia Road, Singapore 228163 (“the\n                        Project”).[note: 8]The contract\n                    was valued at over S$9 million.[note: 9]Its terms were in accordance with the SIA\n                    Articles and Conditions of Contract.[note: 10]Pursuant to Clause 41 of the Conditions\n                    of Contract (as amended by the Additions to Conditions of Contract), the\n                    plaintiff submitted Performance Bond No. SD08B04687 (“the Performance Bond”) to the\n                        1stdefendant for the amount of\n                        S$484,440.00.[note: 11] 7       The architect under the Contract was M/s Ronny\n                    Chin & Associates of 147B Selegie Road, Singapore 188313 (“the Architect”).[note: 12]The quantity surveyor was M/s 1MH &\n                    Associates of 10 Lorong 19 Geylang #02-02, Singapore 388492 (“the QS”).[note: 13]Other consultants included Portwood\n                    & Associates (“the Structural\n                    Engineer”) and Elead Associates (“the Services Engineer”).[note: 14] 8       On 4 March 2011, the Architect issued the\n                    Completion Certificate which certified that works under the Contract were\n                    completed on 27 August 2010.[note: 15]Goh Tong Chuan (“Goh”), the Managing Director of the plaintiff,\n                    stated in his affidavit that the plaintiff completed the works on 19 May\n                    2010 even though the plaintiff was entitled to an extension of time till\n                    27 October 2010 to complete the works.[note: 16] 9       The director of the Architect, Chin Hong Onn,\n                    also known as Ronny Chin (“Chin”),\n                    stated in his affidavit that the original date for completion under the Contract\n                    was 1 January 2010. The extended Completion date was 4 April 2010\n                    after the Architect certified that the plaintiff was entitled to 93 days\n                    extension of time by way of the Delay Certificate. As stated earlier (see[8]), the works under the Contract were\n                    certified completed as at 27 August 2010.[note: 17] 10     On 30 March 2011, the Architect sent the\n                    Completion Certificate to the parties by fax. The following day, the Architect\n                    informed the parties by letter of the Completion Date of 27 August\n                        2010.[note: 18] 11     On 24 May 2011, the plaintiff submitted\n                    its request for an extension of time of 298 days. The granting of this extension\n                    would bring the plaintiff’s work in line with the Completion Date of\n                    27 August 2010.[note: 19] 12     On 22 June 2011, the Architect\n                    recommended that an extension of time of 24 days be granted to the plaintiff and\n                    this brought the total extension of time to 93 days.[note: 20] 13     In an email dated 24 June 2011, the\n                    Architect sent the plaintiff a Delay Certificate dated 4 March 2011 which\n                    confirmed that: (a)     the plaintiff was granted 93 days\n                        extension of time, (b)     the revised completion date was to be 4 April 2010 based on the\n                        93 days extension granted, (c)     the plaintiff was in delay.[note: 21] 14     Goh, in his affidavit, stressed the point that\n                    the Delay Certificate was issued only on 4 March 2011, some 6 months after\n                    the certified completion of 27 August 2010.[note: 22] 15     On 15 July 2011, and pursuant to Clause\n                    37(1) of the Conditions of Contract, the plaintiff commenced arbitration\n                    proceedings against the 1stdefendant under the\n                    Singapore Institute of Architects (“SIA”) Arbitration Rules by way\n                    of a Request for Arbitration served on the 1stdefendant.[note: 23]The reliefs sought in the arbitration\n                        were[note: 24]: (a)     A determination from the Arbitrator\n                        to award or otherwise declare an extension of time for the total of 298\n                        days (b)     Prolongation costs and related losses and expense amounting to S$253,339.37\n                        to be paid by 1stdefendant to the\n                        plaintiff (c)     A\n                        determination from the Arbitrator to declare that the plaintiff completed\n                        the works under the Contract on 19 May 2010 (d)     A determination by the Arbitrator that\n                        the plaintiff is entitled to the amount of S$1,197,669.68 claimed under\n                        Progress Claim No. 30 (Revision 4) and the said sum of S$1,197,669.68\n                        is rightfully due and payable to the Plaintiff under the\n                    Contract (e)     Interest (f)     Costs (g)     Such\n                        further or other direction as the Arbitrator deems fit. 16     On 20 July 2011, the plaintiff sent the\n                        1stdefendant’s solicitors a list of\n                    proposed arbitrators. Goh’s affidavit stated that the\n                        1stdefendant completely disregarded the Request\n                    for Arbitration and the system for dispute resolution and instead made an\n                    unconscionable demand on the Performance Bond without any prior notice to the\n                        plaintiff.[note: 25]The 1stdefendant\n                    replied in its written submissions that this assertion was mischievous and\n                    misleading, that the SIA Rules provided that a response was optional and that\n                    the 1stdefendant did not need to file any\n                        response.[note: 26] 17     On 27 July 2011, the\n                        1stdefendant made a demand for the amount of\n                    S$360,084.62 under the Performance Bond shortly after being served with the\n                    Request for Arbitration.[note: 27] 18     On 2 August 2011, the plaintiff obtained\n                    an interim injunction restraining the 1stdefendant\n                    from calling on the Performance Bond.[note: 28] 19     In the light of Clause 2 of the Performance\n                    Bond and the 1stdefendant’s demand, the\n                        2nddefendant informed the plaintiff that unless\n                    an injunction was obtained, payment would be made as demanded by 29 July\n                        2011.[note: 29] Plaintiff’s progress claims 20     On 16 May 2011, the plaintiff submitted\n                    Progress Claim No. 30 (Revision 4) pursuant to clause 31(2) (a) of the\n                    Conditions of Contract for the amount of S$1,197,669.68, in respect of (i)\n                    variation works carried out by the plaintiff after completion of the Contract\n                    works under Architect’s Instructions No. 38-56, and (ii) variation\n                    works carried out by the Plaintiff under several Variation Orders issued by the\n                    Architect. In Goh’s affidavit, it stated that the 1st defendant and the\n                    Architect did not dispute Progress Claim No. 30 (Revision 4) but they also\n                    did not provide any payment response. On 14 June 2011, Progress Claim\n                    No. 30 (Revision 4) was resubmitted by the plaintiff to the Architect and\n                    the 1st defendant. According to Goh, this amount remains due and outstanding\n                    from the 1st defendant to the plaintiff.",
        "Summary of Pleadings": "21     The plaintiff submitted that the injunction\n                    ought to be continued on the ground on unconscionability.[note: 30] 22     The 1stdefendant,\n                    unsurprisingly, opposed the plaintiff’s application for the injunction\n                    restraining the 1stdefendant from calling on the\n                    Performance Bond to be continued.",
        "Plaintiff’s Case": "23     The plaintiff, in support of its case,\n                    essentially stated that[note: 31]: (a)     The amount called for by the\n                            1stdefendant under the performance bond was\n                        incorrect, (b)     The\n                            1stdefendant was not entitled to any\n                        liquidated damages, as: (i)       Any delays were caused by\n                            the 1stdefendant and/or the\n                                1stdefendant’s\n                        consultants (ii)       The Delay Certificate was not issued in accordance with clause\n                            24(1) of the Conditions of Contract. (c)     The call on the Performance Bond was made for a\n                        collateral purpose, in retaliation to the Request for Arbitration and was a\n                        call made in bad faith. 24     In Goh’s affidavit, he stated that it\n                    would be “patently unfair” for the 1stdefendant to receive payment under the Performance Bond when prolongation costs\n                    of S$253,339.37 and the amount of S$1,197,669.68 under Progress Claim\n                    No. 30 (Revision 4) remained due and outstanding from\n                        1stdefendant to the plaintiff. He also stated\n                    that there was no conceivable loss on the part of the\n                        1stdefendant that entitled it to make a demand\n                    on S$360,084.62.[note: 32]",
        "Respondent’s Case": "25     The 1stdefendant\n                    painted the background to the case as such[note: 33]: (a)     By a Delay Certificate dated\n                        4 March 2011, the Architect certified that the plaintiff was granted a\n                        total of 93 days extension of time under the Contract. The Completion Date\n                        was then extended to 4 April 2010. (b)     By a Completion Certificate dated 4 March\n                        2011, the Architect certified that the works under the Contract were\n                        completed on 27 August 2010. The plaintiff was therefore 145 days in\n                            delay.[note: 34]Pursuant to the provision on liquidated\n                        damages for delay under the Contract, the 1stdefendant was entitled to damages of (145 days * $6,000/day[note: 35]) =\n                        S$870,000.00. (c)     On 22 July 2011, the quantity surveyor for the Contract advised the\n                            1stdefendant that based on the draft final\n                        accounts as of 8 July 2011, the value of works carried out by the\n                        plaintiff that remained uncertified was S$29,782.90.[note: 36]The\n                            1stdefendant also withheld S$480,132.48 as\n                        retention money. Accordingly, the balance sum due to the\n                            1stdefendant was (S$870,000.00- S$29,782.90\n                        - S$480,132.48) = S$360,048.62 (d)     Accordingly, the 1stdefendant’s case was that it was entitled to call on the Performance\n                        Bond on 27 July 2011 for the sum of S$360,084.62, being a partial call\n                        on the Bond’s full value of S$484,400.00. 26     The 1stdefendant\n                    argued that: (a)     It was entitled to be paid\n                        liquidated damages as compensation for its loss; (b)     The Architect’s replies to the\n                        extension of time requests were based on the considered views of the\n                        consultants; (c)     Allegations of conspiracy or interference regarding the Architect’s\n                        certifications on the extensions of time were baseless; (d)     The extended completion date was\n                        27 August 2010 and could not have been 19 May\n                    2010; (e)     The\n                        plaintiff’s delay in clearing Powergrid testing was not material in\n                        considering whether the Performance Bond could be called\n                    on; (f)     There were\n                        valid reasons for the time lapse in the issuance of the Completion\n                        Certificate; (g)     The Contract provided the date when the Delay Certificate was to be\n                        issued; (h)     The\n                        plaintiff could not have implemented “catch up” measures after\n                        receiving the Delay Certificate; (i)     Disputes over the plaintiff’s progress claims were\n                        to be arbitrated and was not material in considering whether the Performance\n                        Bond could be called on; (j)     The Performance Bond could be called on even though\n                        claims between parties were to be referred to\n                    arbitration; (k)     There\n                        was no need for the 1stdefendant to respond to\n                        the Request for Arbitration; (l)     There was no agreement between the\n                            1stdefendant and the plaintiff to not call\n                        on the Performance Bond if its validity was extended; (m)     The 1stdefendant was entitled to the full sum claimed under the Performance\n                        Bond.",
        "The decision of the court": "27     The main issue in the case was whether the\n                    plaintiff had shown that there was unconscionable conduct on the\n                        1stdefendant’s part which would warrant a\n                    restraint on the call on the Performance Bond. 28     As can be seen from the facts, the parties\n                    also raised a myriad of other matters during the hearing. Such matters included,inter alia, disputes over extensions of time,\n                    who was to blame for the delay in clearing Powergrid testing[note: 37]and\n                    disputes over which party was liable to pay the other and how much each had to\n                    pay. 29     In my opinion, these concerned run of the mill\n                    construction disputes which were properly the subject of the arbitration. I held\n                    that these issues were not for the determination of this court in an application\n                    of this nature. Accordingly, I decided the case on the one issue which was\n                    sufficient to dispose of the matter before me and I turn to address that\n                    now.",
        "Was there unconscionable conduct on the part of the\n                    1stdefendant which required the call on the\n                Performance Bond to be restrained by injunction?": "Applicable law 30     The law as to when the court may restrain a\n                    call on a performance bond was set out in the case ofJBE\n                        Properties Pte Ltd v Gammon Pte Ltd[2011] 2 SLR 47,\n                    where the Court of Appeal stated: It is now well established that, under our law, apart\n                            from fraud (which is the traditional ground for restraining a call on a\n                            performance bond), unconscionability is a separate and independent\n                            ground for the court to grant an interim injunction restraining a\n                            beneficiary from making a call on a performance bond(see,\n                        inter alia,Bocotra Construction Pte Ltd v AG[1995] 2 SLR(R) 262 at [53] andGHL Pte Ltd v\n                            Unitrack Building Construction Pte Ltd[1999]\n                        3 SLR(R) 44 at [16] and\n                            [20]; see also the GD at\n                            [6]-[7]). This is wider than the English position, which\n                        requires fraud to be clearly proved before a call on a performance bond can\n                        be restrained. [emphasis added] 31     In the recent case ofAstrata (Singapore) Pte Ltd v Tridex Technologies Pte Ltd[2011]\n                    1 SLR 449, Philip Pillai J surveyed the leading cases on the law\n                    on applications to restrain calls on performance bonds. The judge distilled the\n                    following principles from the cases (at [73]): (a)     Whether there is unconscionability\n                        depends on the facts of each case. There is no pre-determined\n                        categorisation. (b)     In determining whether a call on a bond is unconscionable, the entire\n                        picture must be looked at, taking into account all the relevant\n                        factors. (c)     The\n                        concept of unconscionability involves unfairness, as distinct from\n                        dishonesty or fraud, or conduct of a kind so reprehensible or lacking in\n                        good faith that a court of conscience would either restrain the party or\n                        refuse to assist the party. (d)     While in every instance of unconscionability there would\n                        be an element of unfairness, the reverse is not necessarily true. Unfairnessper sedoes not constitute\n                        unconscionability. (e)     In intervening in a call on an on-demand bond/guarantee, the court is\n                        concerned with abusive calls on the bonds. (f)     Mere breaches of contract by the party in\n                        question would not by themselves be unconscionable. (g)     It is important that the courts guard\n                        against unnecessarily interfering with contractual arrangements freely\n                        entered into by the parties. The parties must abide by the deal they have\n                        struck. The Performance Bond 32     The relevant clauses in the Performance Bond\n                    were: 1.    In consideration of\n                            you not insisting on the Contractor payingSINGAPORE\n                                DOLLARS FOUR HUNDRED EIGHTY FOUR THOUSAND FOUR HUNDRED AND FORTY\n                                ONLY (S$484,440/-)as a security deposit for the\n                            Contract, we hereby irrevocably and unconditionally undertake, covenant\n                            and firmly bind ourselves to pay to you on demand any sum or sums which\n                            from time to time may be demanded by you up to a maximum aggregate ofSINGAPORE DOLLARS FOUR HUNDRED EIGHTY FOUR\n                                THOUSAND FOUR HUNDRED AND FORTY ONLY (S484,440/-) (“the Said\n                                Sum”). 2.    Should\n                            you notify us in writing, at any time prior to the expiry of this Bond,\n                            by notice purporting to be signed for and on behalf that you require\n                            payment to be made of the whole or any part of the said sum, we\n                            irrevocably and unconditionally agree to pay the same to you immediately\n                            on demand without further reference to the Contractor and\n                            notwithstanding any dispute or difference which may have arisen under\n                            the Contract or any instruction which may be given to us by the\n                            Contractor not to pay the\n                            same. 3.    We hereby confirm and\n                            agree that we shall be under no duty or responsibility to inquire\n                            into: a.    The reason or circumstances of any demand\n                                hereunder, or b.    The respective rights, obligations and/or\n                                liabilities of yourselves and the Contractor under the Contract,\n                                or c.    The authenticity of your notice or the\n                                authority or entitlement of persons signing such notice, but that we\n                                shall be entitled to and shall rely upon any written demand by you\n                                hereunder. 33     The nature of the Performance Bond was not\n                    disputed. The email setting out the “practical completion\n                date” 34     During the hearing, my attention was drawn to\n                    an email sent by one Elfren Turiano, an “Architectural Associate”\n                    of the Architect. The email was sent on 4 October 2011, from Turiano to,inter alia, Richard Goh and Selvin Teo, who\n                    were the Managing Director and the Project Manager of the plaintiff\n                    respectively. The email is in the following terms: Dear All, We are currently preparing the Completion Cert and we came up to finalised\n                        the date onJuly\n                            19thas the practical completion\n                        date. Please revert back to us if you have any comment or objections before\n                            8thOctober. Regards, Elfren Turiano Architectural Associate RONNY CHIN ARCHITECTS PTE LTD 35     Ronny Chin, the director of the Architect,\n                    took pains in his affidavit to state that “the Architect was not\n                    influenced by or interfered with in its decisions on EOT, the Delay Certificate\n                    and the Completion Certificate”[note: 38]and that the\n                    “Architect’s decisions on time were all based on the\n                    recommendations of the consultants in the Project”[note: 39]. 36     These statements arose because the Architect\n                    had sent letters to the 1stdefendant seeking\n                    “concurrence” on the Architect’s recommendation of\n                    extensions of time. In his affidavit, Ronny Chin stated that it was his personal\n                    style to use a softer approach rather than dictate his decision to the\n                        1stdefendant and stated that upon hindsight,\n                    this might not have been an appropriate phrase to use.[note: 40]Here it was evident\n                    that the Architect was attempting to stave off allegations that the\n                    Architect’s certificates were not issued in abona\n                        fidemanner.[note: 41] 37     However, there was still no acceptable\n                    explanation presented as to why the completion date appeared to have been\n                    changed from 19 July 2010 to 4 April 2010. This, in essence, was a\n                    backdating of the completion date. Counsel for the\n                        1stdefendant, in the hearing before me, admitted\n                    that the 1stdefendant had no real answer on why the\n                    date was changed. The materiality of the change in date was evident; the change\n                    of date from 19 July to 4 April resulted in the plaintiff incurring\n                    $700,000 worth of liquidated damages. This amount of liquidated damages formed\n                    the substantial basis of a call on the Performance Bond. This exhibited a strongprima faciecase of unconscionability and I\n                    was concerned that this was an abusive call on the bond. As I stated above (in[27]-[29]), the cross allegations of breaches of contract fell to be\n                    dealt with in the arbitration proceedings and so I did not consider them in\n                    coming to the conclusion that the 1stdefendant acted\n                    unconscionably. 38     I also kept in mind the oft repeated warning\n                    that the courts should guard against unnecessarily interfering with contractual\n                    arrangements freely entered into by the parties:Eltraco\n                        International Pte Ltd v CGH Development Pte Ltd[2000]\n                    3 SLR(R) 198,AnwarSiraj and anor v Teo Hee Lai Building Construction Pte Ltd[2003] 1 SLR(R) 394 at [16].\n                    Having considered this, I was of the view that the parties did not enter into a\n                    contract where the completion date could be, without good reason, unexpectedly\n                    pushed back by the Architect after having been previously confirmed by\n                    him. 39     Despite the other allusions to collusion\n                    between the Architect and the 1stDefendant, it was\n                    the unexplained reference to 19 July as the practical completion date by\n                    the Architect in the email and the subsequent use of 4 April as the\n                    completion date that was decisive in my decision that the conduct of the\n                        1stdefendant evidenced\n                unconscionability.",
        "Conclusion": "40     I therefore ordered the interim injunction to\n                    stand. Costs fixed at $18,000 plus reasonable disbursements were awarded to the\n                    plaintiff, such costs to be paid by the 1stdefendant.  [note: 1]Plaintiff’s Skeletal Submissions (“PS”) at para\n                                1 [note: 2]Affidavit of\n                                Goh Tong Chuan (“Goh”) at para 12, DS at para\n                            7 [note: 3]Goh at para 6 [note: 4]1stDefendant’s Written Submissions (“DS”) at para\n                                5 [note: 5]Goh at para 6 [note: 6]DS at para\n                                5 [note: 7]Affidavit of Ang Song Lim, Project\n                                Manager of the 1stDefendant\n                                (“ASL”) at para\n                6 [note: 8]DS at para 4,\n                                PS at para 3, ASL at Para 5 [note: 9]Goh at para\n                                9 [note: 10]Goh at para\n                                9 [note: 11]Goh at para 12, PS, para 3-4, DS at\n                                para 7 [note: 12]Goh at para\n                                10 [note: 13]Goh at para\n                                10 [note: 14]Chin at\n                                para 9 [note: 15]Goh at para\n                                38 [note: 16]Goh at para\n                                46 [note: 17]Chin at\n                                para 6 [note: 18]Chin at para\n                16(e) [note: 19]Chin at para\n                        16(f) [note: 20]Chin at para 16(g) [note: 21]Goh at\n                                    para 39 [note: 22]Goh at para\n                                40 [note: 23]Goh at para\n                        15(d) [note: 24]Goh at 27 [note: 25]Goh at para\n                        29 [note: 26]DS at paras\n                        93-94 [note: 27]PS, para\n                    6 [note: 28]PS, para\n                                7 [note: 29]Goh at 14 [note: 30]PS, para 7 [note: 31]PS, paras\n                        11-25 [note: 32]Goh at paras\n                        45-46 [note: 33]DS, para\n                                8-13 [note: 34]ASL at para\n                            7 [note: 35]ASL at para 13 [note: 36]ASL at para 7 [note: 37]Affidavit of Teo Will Chye, Project Manager of the Plaintiff\n                                (“Teo”) at paras 17-58 [note: 38]Chin at\n                                para 17 [note: 39]Chin at para 17 [note: 40]Chin at para 11 [note: 41]Chin at\n                                para 7"
    }
}