{
    "case_title": "Giant Light Metal Technology (Kunshan) Co Ltd \n      v\n      Aksa Far East Pte Ltd",
    "ncitation": "[2012] SGHCR 2",
    "coram": "Terence Tan Zhong Wei AR",
    "sections": {
        "The factual matrix": "3       The parties entered into a contract on or around\n                    18 December 2003 (“the contract”) for the sale and purchase of two\n                    generator sets. On or around 27 December 2003, the parties also signed a\n                    confirmation agreement acknowledging the sale and purchase of the generator\n                    sets. The contract, which was drafted in Chinese, contained an arbitration\n                    agreement (“the arbitration agreement”). It was not disputed that\n                    the arbitration agreement read as follows when translated to English: Arbitration Any dispute or controversy arising out of or relating to this contract\n                        during performance shall be resolved by two parties through friendly\n                        consultation. The dispute or controversy, which cannot be resolved by two\n                        parties through consultation, shall be submitted to relevant departments for\n                        final arbitration. 4       Giant Light Metal Technology (Kunshan) Co Ltd\n                    (“the plaintiff”) alleged that the defendant breached the terms of\n                    the contract by: (a)     failing and or omitting to supply to\n                        the plaintiff generator sets which were brand new; (b)     failing and or omitting to supply to\n                        the plaintiff generator sets that originated from England;\n                    and (c)     supplying to the\n                        plaintiff generator sets that were incapable of use. 5       Arising from the breaches, the plaintiff\n                    commenced proceedings (“the PRC claim”) against the defendant and\n                    Shanghai Yates Genset Co Ltd (“Shanghai Yates”), which was also a\n                    party to the contract as a guarantor, in the Suzhou Intermediate Court\n                    (“the PRC court”), Jiangsu Province, in the People’s\n                    Republic of China (“PRC”). It was not disputed by the defendant\n                    that the plaintiff had served the papers relating to the PRC claim on the\n                    defendant at its registered address in Singapore. However, the defendant chose\n                    not to participate in the proceedings before the PRC court. 6       The PRC court subsequently granted judgment in\n                    favour of the plaintiff (“the PRC judgment”) and made the\n                    following orders: (a)     The contract between the plaintiff\n                        and the defendant be rescinded; (b)     The plaintiff to return the generator sets to the\n                        defendant; (c)     The\n                        defendant to refund the contract price of US$190,000 to the\n                        plaintiff; (d)     The\n                        defendant to compensate the plaintiff for the loss of RMB7,088 within a\n                        month after the PRC judgment came into effect; and (e)     Other claims of the plaintiff,ie, for other losses, were\n                        rejected. It was not disputed that the PRC judgment was\n                    served on the defendant in Singapore. The defendant did not pursue an appeal\n                    against the PRC judgment and the dateline for the defendant to do so expired on\n                    25 April 2011. 7       On 23 July 2011, the plaintiff’s\n                    solicitors sent a letter of demand to the defendant to demand for payment of the\n                    PRC judgement sums and the requisite interest. The defendant rejected this\n                    demand. 8       On 10 February 2012, the plaintiff commenced the\n                    Suit in the Singapore High Court. On 29 February 2012, the defendant took out an\n                    application to stay the Suit pursuant to section 6 of the IAA.",
        "The parties’ arguments": "",
        "The defendant’s case": "9       The defendant submitted that this was a\n                    straightforward application because: (a)     there is an arbitration agreement in\n                        the contract where it is clear that parties intended to arbitrate in the\n                        event of a dispute; (b)     despite the clear intention to arbitrate, the plaintiff has breached\n                        the agreement by taking out an action in the Singapore courts;\n                    and (c)     the Singapore\n                        court can and should grant a mandatory stay of the Suit as the prerequisites\n                        under s 6 of the IAA are met. 10     Before me, the defendant argued that the fact\n                    that the plaintiff had obtained a PRC judgment was irrelevant to this\n                    application. It was further submitted that the plaintiff had pleaded both the\n                    contract and the PRC judgment in their statement of claim, and so if the Suit is\n                    allowed to proceed, this court would have to determine the substantive dispute\n                    between the parties and whether the Chinese court has international jurisdiction\n                    over the defendant.",
        "The plaintiff’s case": "11     The plaintiff argued that the\n                    defendant’s application was misconceived and therefore should be\n                    dismissed. The Suit involves a claim by the plaintiff for a debt arising from\n                    the PRC judgment and not a claim to enforce its rights under the contract\n                    between the parties. 12     It was further contended that s 6 of the IAA\n                    is inapplicable here as there are no live disputes between the parties, since\n                    the PRC court has already adjudicated upon, and disposed of the matter with\n                    finality. The defendant has not adduced any evidence or made any assertion that\n                    the PRC judgment was not made by a court of competent jurisdiction, or that it\n                    was not final and conclusive, or was in any way irregular. 13     Further and/or in the alternative, the\n                    plaintiff submitted that the arbitration agreement is null and void,\n                    inoperative, or incapable of being performed. It was argued that PRC law should\n                    govern the agreement to arbitrate since it was also the law which governed the\n                    contract. The plaintiff adduced a legal opinion from a PRC counsel to show that\n                    the arbitration agreement in the contract is invalid under the laws of the\n                    PRC.",
        "The court’s decision": "14     The main issue in this application is whether\n                    the Suit, which appears to involve a claim by the plaintiff fora debtarising from the PRC judgment, should be stayed\n                    pursuant to s 6 of the IAA. In the circumstances, it is appropriate to begin by\n                    setting out the applicable law, before applying that to the factual matrix at\n                    hand.",
        "Whether the Suit should be stayed pursuant to s 6 of the\n                IAA": "The Law 15     Sections 6(1) and (2) of the IAA provide as\n                    follows: 6.-(1) Notwithstanding Article 8 of the\n                        Model Law, where any party to an arbitration agreement to which this Act\n                        applies institutes any proceedings in any court against any other party to\n                        the agreementin respect of any matter which is the\n                            subject of the agreement, any party to the agreement may, at\n                        any time after appearance and before delivering any pleading or taking any\n                        other step in the proceedings, apply to that court to stay the proceedings\n                        so far as the proceedings relate to that matter. (2)    The court to which an application has been made in\n                            accordance with subsection (1) shall make an order, upon such terms or\n                            conditions as it may think fit, staying the proceedings so far as the\n                            proceedings relate to the matter, unless it is satisfied that the\n                            arbitration agreement is null and void, inoperative or incapable of\n                            being performed. [emphasis added] 16     It is instructive to refer toTjong Very Sumito and others v Antig Investments Pte Ltd[2009] 4 SLR(R) 732 (“Tjong Very\n                    Sumito”), where the Court of Appeal discussed the operation of\n                    s 6 of the IAA at [22] as\n                    follows: 22     Section 6 of the IAA acknowledges the\n                        primacy of the specific arbitration agreement in question. In order to\n                        obtain a stay of proceedings in favour of arbitration under s 6, the party\n                        applying for a stay (\"the applicant\") must first show that he is party to an\n                        arbitration agreement, and that the proceedings instituted involve a \"matter\n                        which is the subject of the [arbitration] agreement\". In other words,the applicant has to show that theproceedings instituted fall within the\n                            terms of the arbitration agreement. If the applicant can show\n                        that there is an applicable arbitration agreement, then the courtmustgrant a stay of proceedings unless the party\n                        resisting the stay can show that one of the statutory grounds for refusing a\n                        stay exists,ie, that the arbitration\n                        agreement is \"null and void, inoperative or incapable of\n                            being performed\". [emphasis in original in italics; emphasis added in bold italics] 17     It is clear from the above that the onus is on\n                    the defendant here to show that the Suit instituted by the plaintiff falls\n                    within the terms of the arbitration agreement. Application of the law to the factual matrix 18     The arbitration agreement in the contract\n                    between the parties provide as follows: Arbitration Anydispute or controversy arising out of or relating\n                            to this contract during performanceshall be resolved by two\n                        parties through friendly consultation. The dispute or controversy, which\n                        cannot be resolved by two parties through consultation, shall be submitted\n                        to relevant departments for final arbitration. [emphasis added] On a plain reading of the arbitration agreement, it appearsprima faciethat it only applies to disputes or\n                    controversies arisingduringperformance of the\n                    contract. In this regard, it is important to determine what exactly the\n                    defendant is seeking to stay in this application. In other words, is the\n                    defendant seeking a stay of the dispute and/or controversy arising out of or\n                    relating to the contract during performance, or is it seeking a stay of the\n                    plaintiff’s claim for a debt arising from the PRC judgment? The answer to\n                    this question would necessarily depend on the characterisation of the\n                    plaintiff’s claim in the Suit, to which I now turn my attention\n                to. 19     At the hearing before me, the defendant argued\n                    that the plaintiff had pleaded both the contract and the PRC judgment in its\n                    statement of claim (“SOC”). Accordingly, if the Suit is allowed to\n                    proceed, this court would have to determine the substantive dispute arising out\n                    of the contract between the parties and also whether the PRC court has\n                    international jurisdiction over the defendant. 20     The defendant also submitted that the terms of\n                    the arbitration agreement cover the Suit instituted by the plaintiff. The\n                    defendant highlighted that the plaintiff had claimed in its SOC that the\n                    defendant had breached the terms of the contract and so the plaintiff is\n                    entitled to the sums of money ordered in the PRC judgment. Therefore, the\n                    plaintiff’s claim clearly arises out of or relates to the contract, as\n                    provided in the arbitration agreement. 21     With respect, I cannot agree with the\n                    defendant’s arguments. 22     First, a plain reading of the SOC clearly\n                    shows that the references to the contract and the circumstances under which the\n                    parties entered into the contract were stated so as to provide the necessary\n                    background to the plaintiff’s claim for a debt arising from the PRC\n                    judgment against the defendant in Singapore. Moreover, the fact that the\n                    plaintiff’s claim is for a debt arising from the PRC judgment against the\n                    defendant in Singapore is also made clear in [17] of the SOC: AND THE PLAINTIFF CLAIMS AGAINST THE\n                            DEFENDANT: a.the sums of US$190,000 and RMB7,088,as ordered in the PRC Judgment; b.RMB14,626, being the Defendant’s PRC Court\n                            Feesordered under the PRC\n                            Judgment; c.in respect of accrued judgment interest on the sums\n                            in (a)in respect of the PRC Judgment Sumsand (b) in respect of theDefendant’s PRC Court\n                                Fees, from 25 April 2011 to 10 February 2012, the sums of\n                            US$9, 971.20 and RMB1,139.55 respectively; d.interest at the rate of 6.56% per annum from 11\n                            February 2012 to the date of full payment; e.costs; and f.such further and other relief as this Honourable\n                            Court deems fit. [emphasis in original in bold; emphasis added in italics] 23     Accordingly, it follows that what the\n                    defendant is seeking to stay in this application is the plaintiff’s claim\n                    for adebtarising from the PRC judgment,and nota claim which concerns any dispute or\n                    controversy arising out of or relating to the contract between the parties\n                    during performance, as provided in the arbitration agreement. Hence, it is clear\n                    that the Suit instituted by the plaintiff,ie, to\n                    claim for a debt arising from the PRC judgment from the defendant in Singapore,\n                    does not fall within the terms of the arbitration agreement. 24     Second, I also note that the defendant does\n                    not dispute that it was duly served with the PRC court papers before the PRC\n                    proceedings took place, and also the PRC judgment after the PRC proceedings\n                    ended. The defendant made the conscious decision of neither objecting to the\n                    proceedings at the PRC court nor appealing against the PRC judgment when it was\n                    subsequently granted. It was also not argued that the PRC judgment was either\n                    not made by a court of competent jurisdiction or that it was in any way\n                    irregular. In the circumstances, there can be no question that the PRC judgment\n                    stands as a final and conclusive judgment. The plaintiff is therefore entitled\n                    to institute the Suit in order to claim the debt arising from the PRC judgment\n                    from the defendant in Singapore. 25     In light of the above, I find that the\n                    defendant has not been able to show, on a balance of probabilities, that the\n                    Suit instituted by the plaintiff falls within the terms of the arbitration\n                    agreement contained in the contract between the parties (seeTjong Very Sumitoat [22]). Accordingly, the defendant’s application to stay\n                    the Suit pursuant to s 6 of the IAA cannot succeed.",
        "Other observations": "26     I note that the defendant had argued in the\n                    second affidavit filed by one Yong Yit Yeng Mavis dated\n                        5thApril 2012, in support of its stay\n                    application, at [21] that she was\n                    advised “… that under the Reciprocal Enforcement of Foreign\n                    Judgments Act [(Cap 265, 2001 Rev Ed)], other than by way of registration of the\n                    judgment, no proceedings for the recovery of a sum payable under a foreign\n                    judgment shall be entertained by the Singapore courts”. 27     The difficulty with this argument is that the\n                    plaintiff is not seeking to register the PRC judgment in Singapore. Instead, as\n                    noted above at[22]–[23], what the plaintiff is seeking to do is\n                    to claim a debt arising from the PRC judgment against the defendant in\n                    Singapore. That the plaintiff is able to do so was noted by Belinda Ang J inBellezza Club Japan Co Ltd v Matsumura Akihiko and\n                        others[2010] 3 SLR 342 at [10]: Foreign judgmentsin personammay be\n                        enforced by a claim in proceedings in Singapore if the foreign judgment is a\n                        money judgment of a court of competent jurisdiction, and that the judgment\n                        pronounced by the foreign court is final and conclusive as between the\n                        parties. 28     Finally, in light of my finding at[25]above that the defendant’s application\n                    to stay the Suit pursuant to s 6 of the IAA cannot succeed, it is not necessary\n                    for me to examine the issues of whether the arbitration agreement is null and\n                    void, inoperative, or incapable of being performed, and whether Singapore or PRC\n                    law should govern the arbitration agreement.",
        "Conclusion": "29     For the reasons set out above, I dismiss the\n                    defendant’s application to stay this action pursuant to s 6 of the\n                    IAA. 30     I will hear the parties on\n                costs."
    }
}