{
    "case_title": "OCBC Capital Investment Asia Ltd\n      v\n      Wong Hua Choon",
    "ncitation": "[2012] SGHC 25",
    "coram": "Steven Chong J",
    "sections": {
        "Introduction": "1       This case concerns the classic issue as to\n                    whether parties to an oral agreement had intended to be bound only upon formal\n                    execution of a written agreement. In determining this issue, it is not\n                    necessarily decisive to establish that the parties hadorallyagreed to the terms of an intended agreement since\n                    written agreements are typically preceded by oral agreements on the terms\n                    between the parties. Ultimately that issue must be determined by reference to\n                    the objective evidence before the court. In this process, the court will attach\n                    significance and weight to the parties’ expressed intention on the\n                    requirement for the execution of a written agreement. When such an intention is\n                    manifested in the contemporaneous documentary evidence, does an inference\n                    necessarily arise that the parties had agreed to defer legal relations until the\n                    formal execution of a written contract and if so, which party has the burden to\n                    displace such an inference? 2       The present dispute concerns a bank that sought\n                    to provide support and assistance to a valued customer during the recent\n                    financial crisis. In so doing, the bank was understandably also motivated to\n                    advance its own financial interest. In this case, the parties had expressly\n                    stated that “[a] Supplemental Agreement [is] to be executed to effect\n                    necessary changes” following a meeting where the parties essentially\n                    agreed on the terms of the agreement. The preparation of the written agreement\n                    was left to the bank. The signing of the written agreement was however\n                    time-sensitive in that there was an expiring time limit during which the bank\n                    could exercise certain rights of sale. The written agreement was only finalised\n                    between the bank and its lawyers on the “eve” of the expiry of the\n                    time limit. All reasonable attempts by the bank to contact the customer to sign\n                    the written agreement proved to be futile. The bank claimed that the customer\n                    was deliberately avoiding its calls to take advantage of the expiring time limit\n                    and indeed the time limit eventually expired without the customer signing the\n                    written agreement. The question before me is whether the customer was entitled\n                    to take advantage of the situation even if he was somewhat “morally\n                    reprehensible” in his conduct. He would be entitled to do so if there was\n                    in fact no binding oral agreement. Unfortunately for the bank, which behaved\n                    fairly throughout the entire episode, I find that the customer is entitled to do\n                    so because I am satisfied from the evidence that the objective intention of the\n                    parties, including the bank, was not to be bound prior to the formal execution\n                    of the written agreement.",
        "Facts": "",
        "The original agreement": "3       The defendant, Wong Hua Choon\n                    (“Mr Wong”), is the President and Chief Executive Officer of\n                    Frontken Corporation Berhad (“Frontken”), a company listed on the\n                    Main Board of Bursa Malaysia Securities Berhad. The plaintiff, OCBC Capital\n                    Investment Asia Limited (“OCIA”), is an investment vehicle of\n                    Oversea-Chinese Banking Corporation Limited\n                (“OCBC”). 4       In April 2007, Mr Wong and/or Frontken\n                    approached OCIA to participate in a placement exercise in respect of shares in\n                    Frontken and on 24 July 2007, OCIA invested RM14,999,380.00 in the\n                    placement exercise. The terms of the arrangement between OCIA, Mr Wong and\n                    Frontken in respect of the placement exercise were as follows: (a)     OCIA would subscribe to 19,736,000\n                        shares in Frontken at a subscription price of RM 0.76 per\n                    share; (b)     Mr Wong\n                        would enter into a Risk Participation Agreement (“RPA”) under\n                        which Mr Wong agreed to personally underwrite the downside risk of any\n                        fluctuation in the value of the shares acquired by OCIA. The relevant terms\n                        of the RPA were as follows: (i)       There would be a moratorium\n                            period of six months from the date the shares were initially listed on\n                            the Malaysian Exchange of Securities Dealing and Automated Quotation\n                            (“MESDAQ”) during which OCIA would not be able to sell the\n                            shares. (ii)       After the moratorium, there would be a further period of six\n                            months commencing from the 19thmonth\n                                (ie, on 11 February 2009) and\n                            ending on the 24thmonth (ie, on 10 August 2009) after the listing of the\n                            shares on MESDAQ (“the Risk Participation Period”) during\n                            which if the shares are sold by OCIA (subject to certain conditions and\n                            procedures) below a “floor price”, which was stipulated\n                            at 85% of the cost of each Frontken share, Mr Wong would have\n                            to pay the difference between the sale price and the floor price\n                            (“Risk Participation”). 5       There was a subsequent bonus issue of 7,894,400\n                    shares to OCIA, such that OCIA was allotted a total of 27,630,400 shares in\n                    Frontken at an average cost of about RM 0.54 per share. All these shares were\n                    subject to the terms of the RPA. The floor price was rounded up to RM 0.47, in\n                    accordance with the definition of “floor price” provided in the\n                    RPA. In the meantime, Frontken shares were also migrated from the MESDAQ to the\n                    Main Board of Bursa Malaysia.",
        "OCIA’s intention to divest": "6       In 2008, the onset of the global financial\n                    crisis caused the share price of Frontken to plummet below the floor price. In\n                    February 2009, OCIA decided to exit from its investment in Frontken, and this\n                    intention was expressly communicated to Mr Wong by two officers of OCIA,\n                    namely Vincent Ng Fook Cheong (“Vincent”) and Goh Chong Jin\n                    (“Mr Goh”). 7       At this point of time, should OCIA exit from its\n                    investment, it would suffer a minimum loss of 15% of its investment in Frontken,\n                    being the difference between its cost and the floor price of each Frontken\n                    share,assumingthat OCIA could sell all its\n                    shares and that Mr Wong would be able to meet his liabilities under the\n                    RPA. The loss would be greater if Mr Wong did not have adequate liquidity\n                    to meet his liabilities under the RPA. On the other hand, Mr Wong faced a\n                    potential liability of about RM7 million to OCIA, being the difference between\n                    the sale price and the floor price of OCIA’s Frontken shares should OCIA\n                    sell its entire shareholding on the open market. In addition, an open market\n                    sale of OCIA’s 4% shareholding in Frontken would likely further depress\n                    the share price of Frontken and thus adversely affect the paper value of\n                    Mr Wong’s 20% shareholding in Frontken. As such, both parties\n                    embarked upon discussions in order to find a mutually beneficial exit option for\n                    OCIA. At this point, OCIA’s representatives were introduced to Nicholas Ng\n                    Wai Pin (“Nicholas”) as Mr Wong’s assistant and aide.\n                    Nicholas is legally trained and was, at all material times, an independent\n                    director of Frontken. 8       On 16 March 2009 (some five months prior to\n                    the expiry of the Risk Participation Period), Mr Wong requested OCIA for\n                    time to raise sufficient funds to purchase OCIA’s Frontken shares.\n                    Mr Wong indicated that he would have some of the funds required immediately\n                    and the remainder in a few months’ time. He proposed to make progressive\n                    purchases which were to commence immediately. Subsequently, on 19 March\n                    2009, Mr Wong communicated to Vincent at a meeting that he had difficulty\n                    raising the funds to purchase OCIA’s entire shareholding in Frontken.\n                    Vincent suggested that there could be alternative solutions available, but\n                    emphasised that OCIA could proceed to sell the shares on the open market\n                    “as early as [in] a couple of weeks” if there was no firm proposal\n                    from Mr Wong. 9       During a follow-up meeting on 25 March\n                    2009, Mr Goh put forward a proposal whereby Mr Wong would purchase\n                    part of OCIA’s Frontken shares and the Risk Participation Period in\n                    respect of its remaining shares would be extended. Mr Goh’s minutes\n                    of the meeting indicated that Mr Wong had appeared\n                    “receptive” at this meeting, as well as at a subsequent meeting on\n                    9 April 2009. Thereafter, negotiations between the parties were centred\n                    upon this proposal. In the meantime, from the instructions given by OCIA to the\n                    brokers of OCBC Bank on 6 April 2009, it was evident that OCIA had\n                    completed its internal preparations to sell its shareholding on the open market\n                    at a moment’s notice.",
        "The 23 June 2009 meeting": "10     Substantive negotiations involving\n                    Mr Goh, Mr Wong and Nicholas between 14 April 2009 and\n                    10 June 2009 culminated in a firm proposal from OCIA, the essence of which\n                    obliged Mr Wong to: (a)purchase 3,703,704 Frontken shares at RM 0.54 per\n                            share;(b)agree to a new Risk Participation Period\n                            commencing 1 July 2010 with no expiry date as long as OCIA held its\n                            Frontken shares; and(c)pledge such number of Frontken shares as would be\n                            required to secure Mr Wong’s liabilities to OCIA under the\n                            terms of the proposal.11     Seven points in relation to the proposal were\n                    raised by Mr Wong and/or by Nicholas on the behalf of Mr Wong:(a)     The imposition of a\n                        “moratorium period”, during which OCIA could not claim for\n                        Risk Participation should it sell its Frontken shares.(b)     The inclusion of a term that Risk\n                        Participation should not be claimable in respect of the last 15% of\n                        OCIA’s Frontken shares.(c)     The quantity of Frontken shares to be pledged by\n                        Mr Wong as security.(d)     The issue of whether the share pledge should only be\n                        given after the moratorium period.(e)     The inclusion of a term requiring OCIA to forfeit a\n                        compensation sum, which was payable by Mr Wong in relation to the share\n                        sale from OCIA to Mr Wong, if there was a breach of the moratorium\n                        period.(f)     The\n                        inclusion of a term for Mr Wong’s right to purchase OCIA’s\n                        remaining Frontken shares.(g)     The issue of the amount of fees for the new arrangement\n                        that would be payable by Mr Wong to OCIA.12     On 16 June 2009, Mr Chua Choon Kiang\n                    (“Mr Chua”), the Vice-President of the Mezzanine Capital Unit\n                    of OCBC, began to be directly involved in the negotiations and requested for a\n                    meeting with Mr Wong to obtain anin-principle\n                        agreementby 22 June 2009, stressing the urgency of the\n                    situation as the window for OCIA to exit within the existing Risk Participation\n                    Period was getting smaller. A meeting was scheduled for 23 June 2009\n                    (“the 23 June 2009 meeting”), and on 17 June 2009,\n                    Mr Chua circulated a summary of the terms and conditions titled\n                    “Summary of Indicative Principal Terms and Conditions” dated\n                    16 June 2009 (“the Term Sheet”). The covering email stated\n                    that the Term Sheet is attached in the hope that both parties “would be\n                    able to finalise on [23 June 2009] and start the documentation immediately\n                    after that”.13     The key provisions of the Term Sheet were as\n                    follows:(a)     Risk Participation Period:\n                        “In force immediately following Restricted Period (1 July 2010)\n                        for as long as [OCIA] continues to hold its Frontken\n                    shares”.(b)     Restricted Period (or moratorium period): “1 July 2009 to\n                        30 June 2010. Risk Participation does not apply during this period;\n                        Compensation Sum will also not apply to the balance Sale Shares if [OCIA]\n                        sells any shares below [RM 0.47] during this\n                    period”.(c)     Sale of Shares to Mr Wong (“Sale Shares”):(i)       Sale of 3,703,704 shares in\n                            five tranches at Market Price,ie, the\n                            closing price quoted by Bursa Malaysia for the trading day immediately\n                            preceding the date of the sale of shares.(ii)       Mr Wong “shall compensate\n                            difference between Market Price and [RM 0.54]” (ie, “the Compensation\n                            Sum”).(iii)       OCIA “may sell balance Frontken shares\n                            at anytime [sic] but if any shares are sold below [RM 0.47] during\n                            Restricted Period, [OCIA] must forgo balance Compensation Sum for\n                            subsequent tranches of the Sale\n                    Shares”.(d)     Security: Mr Wong has to pledge Frontken shares upon signing of\n                        this agreement. Mr Wong “shall undertake to maintain the\n                        [Loan-to-Value ratio (“LTV”)] to be not more than 1. Should\n                        the LTV be more than 1, [Mr Wong] is required to top up by pledging\n                        additional Security so that the [LTV] immediately after topping up is not\n                        more than 0.9”.(e)     Shareholder Profit Sharing: Mr Wong would be\n                        entitled to profit-sharing, should OCIA make any profit from any eventual\n                        disposal of its Frontken shares, according to the formula “(Total Net\n                        Proceeds from sale of all Investor shares – RM 15M) x\n                        25%”.(f)     Right of first refusal: Mr Wong shall have a right of first refusal to\n                        purchase OCIA’s remaining Frontken shares, whereby “the\n                        [s]elling price shall be at least 87.5% the previous day’s closing\n                        price”.(g)     Fees: Waived by OCIA.(h)     Documentation: “A Supplemental Agreement to be\n                        executed to effect necessary changes.”14     As such, each of the seven points raised by\n                    Mr Wong (see [11]) was\n                    addressed in the Term Sheet.15     The 23 June 2009 meeting was held in\n                    Singapore, and was attended by Mr Chua, Mr Wong and Nicholas, with\n                    Mr Goh participating (and Vincent listening in)viadialling in from Malaysia. There is no dispute that the\n                    parties agreed to follow through with the preparation of the formal legal\n                    documentation based on the Term Sheet, and Mr Wong, during his\n                    cross-examination, conceded that the parties were indeed in agreement with\n                    respect to the terms in the Term Sheet. In addition, Mr Wong agreed to bear\n                    all legal fees in connection with the preparation of the formal legal\n                    documentation, subject to agreement on the quantum of the fees.Events after the 23 June 2009 meeting16     On the next day,ie, 24 June 2009, Mr Goh forwarded to Mr Wong and\n                    Nicholas a list of the panel of lawyers that OCIA would be agreeable to appoint\n                    to prepare the formal documentation. After some exchange of correspondence\n                    between Nicholas and Mr Goh as well as Mr Chua during which\n                    Mr Wong (as represented by Nicholas) tried to minimise the legal cost for\n                    preparing the documentation, Mr Wong finally gave his concurrence on\n                    8 July 2009 to the appointment of Shook Lin & Bok (Malaysia) to prepare\n                    the Supplemental Agreement with OCBC’s internal legal department drafting\n                    the Sale and Purchase Agreement as well as the Memorandum of Deposit. From then\n                    till the time when the documentation was sent to Mr Wong, there was no\n                    communication or any meeting between the parties.17     The formal legal documentation was eventually\n                    completed and sent to Mr Wong for execution on 6 August 2009, just\n                    four days before the expiry of the Risk Participation Period with three days\n                    spanning over a long weekend. Despite persistent attempts by Mr Chua and\n                    Mr Goh to contact Mr Wong, they were not able to reach him.\n                    Mr Wong only responded by email on 11 August 2009, the day after the\n                    expiry of the Risk Participation Period, in the following terms:Dear [Mr Chua],I’ve been away since last week to take advantage of the long weekend\n                        in Singapore.If you recall during our meeting in your office there werestill some unresolved issueson the proposed\n                        variation to the RPA. These weresupposed to be dealt\n                            with in the supplemental agreementwhich I noticed have just\n                        been sent to me.I will forward to my lawyers the various documents you\n                            sent me for their review and comments.I’ll come back\n                        to you as soon as I hear back from them.[emphasis added]18     From then until 28 August 2009,\n                    OCIA’s representatives repeatedly sought an update from Mr Wong and\n                    requested that he sign a “Letter of Extension” in order to extend\n                    the Risk Participation Period pending the execution of the Supplemental\n                    Agreement, but to no avail. Eventually a meeting with Mr Wong was arranged\n                    on 28 August 2009 wherein Mr Chua brought the formal documentation for\n                    Mr Wong to sign. Mr Wong declined stating that he was not obliged to\n                    do so as the Risk Participation Period had expired.19     A new “restructuring” proposal\n                    was then floated for OCIA to extend a loan to Frontken to purchase OCIA’s\n                    Frontken shares. However, negotiations on this proposal came to a stalemate, and\n                    OCIA subsequently initiated the present action against Mr Wong. Its cause\n                    of action was principally premised on an alleged oral agreement on the terms of\n                    the Term Sheet reached at the 23 June 2009 meeting.Issues20     At the close of the trial, I invited the\n                    parties to address the following broad issues:(a)     On the contractual issue,(i)       Where the parties\n                            contemplate the signing of a written contract, whether that precludes\n                            the existence of a binding oral contract;(ii)       Whether the conduct of the parties\n                            after the 23 June 2009 meeting was consistent with the existence of\n                            a binding oral contract.(b)     On the estoppel issue,(i)       What was the relevant\n                            conduct, if any, giving rise to the common assumption that a binding\n                            oral contract had been reached;(ii)       What is the relevance of Mr Wong’s\n                            conduct after the receipt of the draft Supplemental Agreement on\n                            6 August 2009 and after the expiry of the Risk Participation Period\n                            on 10 August 2009?Whether contemplation of a written contract precludes the existence\n                of a binding oral contract21     Contemplation of a written contractper sedoes not preclude the existence of a binding oral\n                    contract. That is ultimately a matter of construction of the documentary\n                    evidence as well as the interpretation of the objective intention of the\n                    parties. It was previously thought that the addition of the phrase\n                    “subject to contract” is conclusive of the parties’\n                    intention not to be bound until a contract is signed. SeeUnited Artists Singapore Theatres Pte Ltd and anothervParkway Properties Pte Ltd and another[2003]\n                    1 SLR(R) 791 at [57].\n                    That view was recently revisited inNorwest Holdings Pte Ltd\n                        (in liquidation) v Newport Mining Ltd and another appeal[2011]\n                    4 SLR 617 (“Norwest”)\n                        at [24] where the Court of\n                    Appeal observed that:… thebetter viewis that the questionwhether there is a binding contract between the parties should\n                            be determined by considering all the circumstances, not just the\n                            inclusion of the stock phrase ‘subject to contract’ (on the\n                            basis that the substance of the situation must always prevail). These\n                            would include what was communicated between the parties by words or\n                            conduct. In this regard, we are in agreement with the recent\n                        decision of the UK Supreme Court inRTS Flexible Systems\n                            Ltd v MolkereiAlois Muller GmbH & Co\n                            KG (UK Production)[2010] 1 WLR 753 in which it was\n                        held that (at [56]):Whether in such a case [ie, concerning\n                            an agreement that is ‘subject to contract’] the parties\n                            agreed to enter into a binding contract, waiving reliance on the\n                            ‘subject to [written] contract’ term or understanding will\n                            againdepend upon all the circumstances of the\n                                case, although the cases show that the courtwill not lightly so hold…[original emphasis in italics; emphasis added in bold italics]22     In deciding whether a binding oral contract\n                    was concluded at the 23 June 2009 meeting, it behoves me to consider all\n                    the circumstances of the case including the question of whether parties had\n                    expressed any intention that their discussions and/or oral agreement were\n                    “subject to contract”. In this case, the Term Sheet specifically\n                    provided for “[a] Supplemental Agreement to be executed to effect\n                    necessary changes”.Burden of proof23     The immediate question that arises for\n                    determination is whether such a provision is tantamount to “subject to\n                    contract”. This inquiry is significant because if the Term Sheet was\n                    indeed “subject to contract”, “very strong and exceptional\n                    context” must be demonstrated by OCIA to displace theprima faciemeaning of the parties’ intention not to be\n                    bound prior to the execution of the Supplemental Agreement. SeeNorwestat [29]–[31].24     This proposition appears to be well entrenched\n                    in case law. InThomson Plaza (Pte) Ltd v\n                        Liquidators of Yaohan Department Store Singapore Pte Ltd (in\n                        liquidation)[2001] 2 SLR(R) 483, Selvam J\n                    cited with approval the observations of Gill J inLow\n                        KarYit v Mohamed\n                    Isa[1963] MLJ 165 (“Low KarYit”) at 173:The authorities would appear to support the view that even where there is\n                        nothing in the agreement to suggest that the parties contemplate that the\n                        subsequent contract shall contain any new or different terms, nevertheless\n                        if it appears that the parties do not intend to bind themselves\n                        contractually by the agreement but only by the subsequent contract if and\n                        when they should enter into it, there will be no contract. Moreover,if the reference to the execution of the subsequent\n                            contract is in words which according to their natural construction\n                            import a condition, this will almost invariably be conclusive that the\n                            agreement itself was not intended to be a contract...Perhaps\n                        I should add that the plaintiffs in this case are asking the court to order\n                        the defendants to execute the draft agreement agreed upon, which amounts in\n                        effect to asking the court to enforce an agreement to enter into an\n                        agreement. That is an order which the court clearly has no power to make in\n                        the circumstances of the case.[emphasis added]25     Similarly, the Court of Appeal in New Zealand\n                    inConcorde Enterprises v Anthony Motors(Hutt) Ltd[1981] 2 NZLR 385\n                        (“Concorde”) held that the\n                    negotiations in that case had been conducted partly between the parties'\n                    solicitors and partly between the parties themselves with a view to the\n                    production of a commercial agreement of some complexity to be executed by all\n                    parties. As such, the New Zealand Court of Appeal concluded that thenormal inferenceis that the parties do not intend to be\n                    bound until the written agreement is executed. Cooke J stated\n                    at 389:Unless that inference is displaced the result is\n                            that,even though all the terms to be\n                            included in the document have been agreed, there is no\n                            contractand each party has a locus poenitentiae until at\n                        least execution on both sides. It may be that exchange or delivery of\n                        executed documents is also necessary, but that need not now be decided.\n                        Cases can arise where, without execution of a document on one side or both,\n                        the parties act on it, so that an implied contract arises.Brogden v Metropolitan Railway Co(1877) 2 App\n                        Cas 666 is a leading illustration…[emphasis added]26     Similar views were expressed by the English\n                    Court of Appeal inCheverny Consulting Ltd v Whitehead Mann\n                        Ltd[2007] 1 All ER (Comm) 124 (“Cheverny”) at [45]:Obviously each case depends on its own facts but in my view where, as\n                        here, solicitors are involved on both sides, formal written agreements are\n                        to be produced and arrangements made for their executionthe normal inference will be that the parties are not bound unless and\n                            until both of them sign the agreement…[emphasis added]27     In his Oral Closing Submissions, faced with\n                    the force of the authorities, counsel for OCIA, Mr Edwin Tong\n                    (“Mr Tong”) accepted that if the oral contract was\n                    “subject to contract”, the burden is indeed on OCIA to demonstrate\n                    that the parties intended for legal relations to be immediately binding\n                    following the 23 June 2009 meeting. To do so, OCIA must show “very\n                    strong and exceptional context” to displace the normal orprima facieinference. This is so even if all the terms\n                    have already been agreed. SeeNorwestat [29],Low\n                        KarYitat 173,Concordeat 389 andGround &\n                        Sharp Precision Engineering Pte LtdvMidview\n                        Realty Pte Ltd[2008] SGHC 160 at [18]. If there was no agreement on the terms,\n                    there will be no necessity to consider thefurtherquestion whether parties had intended to be bound immediately or to defer legal\n                    relations until the formal execution of the written contract.Subject to contract28     It is, however, important to recognise that\n                    whether an agreement is “subject to contract” is a matter of\n                    substance and not form. When it is not expressly stated to be “subject to\n                    contract”, it is a question of construction whether the parties intended\n                    that the terms agreed upon should merely be put into form or to be subject to an\n                    agreement to the terms of which are not expressed in detail. This was so stated\n                    inCheverny:… it is not essential that there should have been an\n                        express stipulation that the negotiations are to be ‘subject to\n                        contract’. As Jessel MR pointed out in relation to negotiations\n                        conducted through correspondence inWinn v\n                            Bull(1877–78) LR 7 Ch.29 , 32:“When it is not expressly stated to be subject to a formal\n                            contract it becomes a question of construction, whether the parties\n                            intended that the terms agreed on should merely be put into form, or\n                            whether they should be subject to a new agreement the terms of which are\n                            not expressed in detail.”29     It follows that the mere fact that the parties\n                    did not expressly use the phrase “subject to contract” in either\n                    the discussions or the documents does not necessarily preclude it from being\n                    construed as such. InThomson Plaza, the court was\n                    concerned with a grant of a new tenancy which stipulated that “[t]he\n                    tenancy shall be subject to all the terms and conditions as contained in the\n                    specimen Lease Agreement. On or before commencement of the tenancy, a formal\n                    Lease of the same form as the specimen Lease Agreement shall be executed between\n                    you and the Landlord”. Although the phrase “subject to\n                    contract” was not specifically used, the court nonetheless applied the\n                    principles governing “subject to contract” cases. Selvam J\n                        at [28] held that:Parties who contract on the basis of ‘subject to contract’ do\n                        so because they want an escape route in case they wish to call the\n                        transaction off. They do not consider it a wrong way of business. It is a\n                        last-chance escape route in case they find it impossible or undesirable to\n                        fulfil the contract.Similarly, inConcorde, the agreement\n                    involved was held to be “subject to contract” although there was\n                    no express use of the phrase “subject to contract” –\n                    parties’ solicitors, in their correspondences leading up to an agreement\n                    on terms, merely expressed their intention for the subsequent execution of\n                    formal documentation.30     Where there is anexpress\n                        stipulationthat an agreement is to be embodied in a formal\n                    written document, as in the instant case, its effect will depend on itspurpose:Von\n                        Hatzfeldt-Wildenburg v Alexander[1912] 1 Ch 284\n                        (“Von Hatzfeldt”),\n                    at 288–289.It appears to be well settled by the authorities that if the documents or\n                        letters relied on as constituting a contract contemplate the execution of a\n                        further contract between the parties,it is a question of\n                            construction whether the execution of the further contract is a\n                            condition or term of the bargain or whether it is a mere expression of\n                            the desire of the parties as to the manner in which the transaction\n                            already agreed to will in fact go through. In the former case\n                        there is no enforceable contract either because the condition is unfulfilled\n                        or because the law does not recognize a contract to enter into a contract.\n                        In the latter case there is a binding contract and the reference to the more\n                        formal document may be ignored.The fact that the\n                            reference to the more formal document is in words which according to\n                            their natural construction import a condition is generally if not\n                            invariably conclusive against the reference being treated as the\n                            expression of a mere desire…[emphasis added]31Chitty on\n                        Contracts(H G Beale gen ed) (Sweet & Maxwell, 30th Ed,\n                    2008) Vol 1 (“Chitty”),\n                    para 2-116 lists three possible interpretations where there is anexpress stipulationthat an agreement is to be embodied\n                    in a formal written document:(a)     The agreement is regarded by the\n                        parties as incomplete, or as not intended to be legally binding, until the\n                        terms of the formal document are agreed and the document is duly executed in\n                        accordance with the terms of the preliminary agreement (eg, by signature). Example: Agreements for the sale of land\n                        by private treaty are usually made “subject to contract”\n                        – such agreements are normally regarded as incomplete until the terms\n                        of a formal contract have been settled and approved by the parties:Chitty, para 2-118;Winn v Bull(1877)\n                    7 Ch D 29.(b)     Where a document is only intended as a solemn record of an already\n                        complete and binding agreement.(c)     Where the main agreement lacks contractual force for want\n                        of execution of the formal document but that nevertheless a separate\n                        preliminary contract comes into existence at an earlier stage,eg, when one party begins to render services\n                        requested by the other, so that under this contract, the former party will\n                        be entitled to a reasonable remuneration for those services. Conversely, an\n                        agreement that originally lacked contractual force for want of execution of\n                        a formal document may acquire such force by reason of supervening events.\n                        This could, for example, be the position where “it can be objectively\n                        ascertained that the continuing intention [sc. not to be bound until\n                        execution of the document] of the parties changed or … subsequent\n                        events have occurred whereby the non-executing party is estopped from\n                        relying on his non-execution”. SeeChevernyat [46].The third category is relevant to\n                    the issue of estoppel by convention which will be separately dealt with below.\n                    The issue for now is whether the present case falls into the first or second\n                    category.32     The Australian courts have expanded the\n                    various factual scenarios which can possibly arise in connection with the\n                    requirement of a formal contract. The High Court of Australia inMasters vCameron91 CLR 353 at 360 referred to three situations excluding\n                    estoppel:Where parties who have been in negotiation reach agreement upon terms of a\n                        contractual nature and also agree that the matter of their negotiation shall\n                        be dealt with by a formal contract, the case may belong to any of three\n                        cases. It may be one in which the parties have reached finality in arranging\n                        all the terms of their bargain and intend to be immediately bound to the\n                        performance of those terms, but at the same time propose to have the terms\n                        restated in a form which will be fuller or more precise but not different in\n                        effect. Or, secondly, it may be a case in which the parties have completely\n                        agreed upon all the terms of their bargain and intend no departure from or\n                        addition to that which their agreed terms express or imply, but nevertheless\n                        have made performance of one or more of the terms conditional upon the\n                        execution of a formal document. Or, thirdly, the case may be one in which\n                        the intention of the parties is not to make a concluded bargain at all,\n                        unless and until they execute a formal contract.In each of the first two cases there is a binding contract: in the first\n                        case a contract binding the parties at once to perform the agreed terms\n                        whether the contemplated formal document comes into existence or not, and to\n                        join (if they have so agreed) in settling and executing the formal document;\n                        and in the second case a contract binding the parties to join in bringing\n                        the formal contract into existence and then to carry it into execution. Of\n                        these two cases the first is the more common…33     A fourth permutation was postulated by the\n                    Supreme Court of New South Wales inCiavarellav Polimeni2008 NSWSC 234\n                        at [97]:… where the parties were content to be bound immediately and\n                        exclusively on the terms which they had agreed upon whilst expecting to make\n                        a new contract in substitution for their first contract, containing, by\n                        consent, additional terms.34     The fourth scenario clearly has no relevance\n                    here. The critical inquiry in resolving the applicable scenario is to determine\n                    from the objective evidence whether the parties intended to beimmediately boundto perform on the agreed terms or to\n                    defer legal relations until formal execution of the written contract. Immediacy\n                    of performance is the key consideration.35     Counsel for Mr Wong, Mr Chew Kei-Jin\n                    (“Mr Chew”) asserted that on its face, the Term Sheet clearly\n                    requires the Supplemental Agreement to be executed in order to give effect to\n                    the changes. In my view, such a provision has the same effect as “subject\n                    to contract”. This is no different in substance from the clause inThomson Plazawhich likewise required the\n                    lease to be signed in order to give effect to the tenancy which was already\n                    agreed to be in the same form as the specimen lease. Even if I am left in any\n                    doubt about the construction of the provision, the conduct of the parties can\n                    and should be examined to determine the parties’ intention and purpose in\n                    inserting that provision in the Term Sheet. In this regard, the conduct of the\n                    parties, in particular OCIA (as described in detail in[56]–[84]below), was\n                    entirely consistent with its own understanding that legal relations were\n                    deferred until execution of the Supplemental Agreement.36Chevernyprovides some guidelines for determining when a particular case falls into any\n                    of the scenarios. At [42], it was\n                    stated:… With exceptions immaterial to this case, it is possible to make a\n                        contract orally.But the more complicated the subject\n                            matter the more likely the parties are to want to enshrine their\n                            contract in some written document to be prepared by their\n                            solicitors.This enables them to review all the terms before\n                        being committed to any of them. The commonest way of achieving this ability\n                        is to stipulate that the negotiations are ‘subject to\n                        contract’…[emphasis added]37     As noted earlier, both parties were not\n                    separately represented in the drafting or preparation of the Supplemental\n                    Agreement. Instead, a common set of solicitors was employed. Both parties had\n                    clearly agreed that formal written agreements were to be prepared“to effect necessary changes”and\n                    arrangements were made for their execution. Further, this case also involves a\n                    commercial transaction of some complexity and of a considerably large value.\n                    This is especially compelling in the present case because the Supplemental\n                    Agreement seeks to amend an existing written agreement,ie, the RPA.38     OCIA advanced several points in its attempt to\n                    persuade me that there is no relevant “subject to contract” issue\n                    in the case before me. From the evidential perspective, Mr Tong submitted\n                    that there was no mention whatsoever during the 23 June 2009 meeting that\n                    the agreement was “subject to contract”. This is strictly correct\n                    but the point is neither here nor there especially since the requirement for a\n                    signed Supplemental Agreement was expressly stated in the Term Sheet. From the\n                    pleading point of view, Mr Tong raised (for the first time) in his\n                    Supplemental Closing Submissions that Mr Wong did not specifically plead\n                    that the Term Sheet was “subject to contract”. This is strictly\n                    incorrect as Mr Wong did plead in para 18 of the Defence (Amendment No\n                    3) that the agreement was subject to “a formal written contract being\n                    signed” as envisaged by the Term Sheet.39     Insofar as his submissions on the law,\n                    Mr Tong relied on a number of authorities in support of the proposition\n                    that “unless parties are found to have clearly agreed that no legal\n                    relations are to be had without a further step, the Courts can find that the\n                    parties are immediately bound even if they do contemplate a formal agreement in\n                    writing”. The holdings by Lord Blackburn and Lord Gordon inRossiter v Miller(1877–78) LR 3 App Cas 1124 (“Rossiter”) are cited in support of OCIA’s\n                    argument. Lord Blackburn stated, at 1151:I quite agree with the Lords Justices that (wholly independent of the\n                        Statute of Frauds)it is a necessary part of the\n                            Plaintiff's case to shew that the two parties had come to afinaland\n                            complete agreement, for, if not, there was no contract. So\n                        long as they are only in negotiation either party may retract; and though\n                        the parties may have agreed on all the cardinal points of the intended\n                        contract, yet, if some particulars essential to the agreement still remain\n                        to be settled afterwards, there is no contract. The parties, in such a case,\n                        are still only in negotiation. But the mere fact that the parties have\n                        expressly stipulated that there shall afterwards be a formal agreement\n                        prepared, embodying the terms, which shall be signed by the partiesdoes not, by itself, shew that they\n                        continue merely in negotiation. It is a matter to be taken into account in\n                        construing the evidence and determining whether the parties have really come\n                        to a final agreement or not.But as soon as\n                        the fact is established of the final mutual assent of the parties so that\n                        those who draw up the formal agreement have not the power to vary the terms\n                        already settled, I think the contract is completed.[emphasis added in italics and bold italics]Lord Blackburn’s holding merely reinforced the fundamental\n                    principle that the burden falls upon the party asserting the existence of a\n                    contract to show that the parties had come to “afinaland complete agreement” and the mere fact that\n                    parties have expressly stipulated that a formal agreement is required to be\n                    executed “does not,of\n                        itself” show that the parties are still in\n                    negotiations.40     Lord Gordon stated, at 1154:I concur with your Lordships in thinking that the judgment come to by the\n                        Lords Justices of Appeal is erroneous. I think that the correspondence\n                        founded on, constituted a completed contract for the purchase and sale of\n                        the lots in question, at the price stipulated, and on the conditions\n                        specified in the conditions and stipulations printed on the plan.No doubt these conditions provided for a subsequent and formal\n                            deed being executed by the parties; but that deed was only for the\n                            purpose of more formally setting forth the conditions upon which the\n                            parties had agreed.If there was anything introduced into the\n                        proposed deed, which the purchaser considered beyond the terms and\n                        conditions on which he purchased the property, he would have been entitled\n                        to object, and, if necessary, the proper terms of the deed could have been\n                        adjusted at the sight of a Court of Law. But in my viewthe contractbetween the partieswas\n                            concluded by the correspondence and the conditions which were referred\n                            to and embodied in it…[original emphasis in italics; emphasis added in bold italics]Similarly, Lord Gordon’s decision was based on a finding\n                    that the agreement was alreadyconcludedprior to\n                    formal execution. It is important to bear in mind thatRossiterdid not actually concern a “subject to\n                    contract” issue in the first place. The conditions of the offer to sell\n                    the property expressly stipulated: “Each purchaser will be required to\n                    sign a contract embodying the foregoing conditions”. Lord Cairns who\n                    delivered the main judgment had this to say about the import of that condition\n                    in the context of the correspondence exchanged between the parties:I assume that the construction put by him upon the letter I have quoted\n                        was a proper construction, and I entirely acquiesce in what he says, that if\n                        you find, not an unqualified acceptance of a contract, but an acceptance\n                        subject to the condition that an agreement is to be prepared and agreed upon\n                        between the parties, and until that condition is fulfilled no contract is to\n                        arise, then undoubtedly you cannot, upon a correspondence of that kind, find\n                        a concluded contract. But, I repeat, it appears to me\n                            that in the present case there is nothing of that kind; there is a clear\n                            offer and a clear acceptance.There is no\n                            condition whatever suspending the operation of that acceptance until a\n                            contract of a more formal kind has been made.[emphasis added]41     The House of Lords found that everything\n                    essential to the completion of the agreement had appeared in the written\n                    correspondence exchanged between the parties. An offer was made by the purchaser\n                    which was accepted by the vendors. The purchaser was then under the impression\n                    that the vendors were making a fresh condition in their purported acceptance;\n                    the vendors answered that they were not, and again accepted the same offer. The\n                    purchaser’s solicitors wrote to the vendors: “We shall advise [our\n                    client] that what has occurred creates, as you maintain, a contract mutually\n                    binding”.42     Next, Mr Tong relies on the Privy\n                    Council’s decision inElias v George Sahely & Co\n                        (Barbados)[1983] 1 AC 646 (“Elias”). In that case, the plaintiff and the defendant\n                    made an oral agreement for the sale of premises to the plaintiff. On the same\n                    day, the plaintiff's solicitor wrote to the defendant's solicitor confirming the\n                    oral agreement and setting out its terms. He enclosed a cheque for 10 percent of\n                    the agreed price describing it as a deposit which he directed should be held by\n                    the defendant's solicitor as stakeholder pending completion of the contract of\n                    sale. The defendant's solicitor signed and sent a receipt which stated that he\n                    had received the money as deposit for the property“agreed to be sold”by the defendant to the\n                    plaintiff. This case is of no assistance in the present dispute as there was no\n                    express stipulation requiring the execution of a written contract. The principal\n                    issue before the Privy Council was whether the letter enclosing the deposit\n                    together with the receipt for the deposit constituted sufficient memorandum for\n                    the purposes of the Statute of Frauds given that no written contract was signed\n                    by the parties. This issue does not arise here.43     InPRA Electrical Pty Ltd v\n                        Perseverance Exploration Pty Ltdand Anor\n                    [2007] VSCA 310 (“PRA”),\n                    another case cited by Mr Tong, the parties negotiated a detailed agreement\n                    over a six-week period, and it was an agreement of considerable commercial\n                    import following a tender. The negotiations led to a written award of the\n                    contract setting out the terms and conditions which was accepted in writing by\n                    the contractor. It was, however, a term of the award that the contract did not\n                    come into effect until the formal execution of an instrument of agreement.\n                    However, without waiting for the execution of the formal agreement, the\n                    contractor in fact entered upon the works programme contracted for, and the\n                    employer facilitated it doing so. The contractor also furnished the bank\n                    guarantee in accordance with the award which was also accepted by the employer.\n                    Further, the contractor commenced work at the site and in the course of the\n                    works and even after the contractor was ejected from the site, both parties\n                    repeatedly referred to and relied upon aspects of the documentation listed in\n                    the letter by which the contract was awarded. In fact, the employer wrote to the\n                    contractor stating that it was in “breach of our contract conditions in\n                    regards to the issuing of our Payment certificate”. The Court of Appeal\n                    of the Supreme Court of Victoria inPRAfound\n                    under these explicit circumstances that a contract was implied between the\n                    parties in the terms of the award notwithstanding the omission to execute the\n                    instrument of agreement and that the parties had by their conduct waived the\n                    requirement of formal execution. Parties can by their conduct waive reliance on\n                    the “subject to contract” term. SeeRTS\n                        Flexible Systems LtdvMolkereiAlois Muller GmbH & Co\n                        KG (UK Production)[2010] 1 WLR 753 at [56], cited with approval inNorwestat [24]. No such point was however pleaded or raised by OCIA. In\n                    any event, there is simply no evidence to support any waiver. As explained\n                        in[16]above, nothing happened\n                    between the parties after Mr Wong agreed to the appointment of Shook Lin\n                    & Bok (Malaysia) till the time when the documentation was\n                prepared.44     In each of these three cases (Rossiter,EliasandPRA), the existence of a binding agreement\n                    prior to formal execution was based on the specific facts in each of the cases.\n                    These cases do illustrate the basic point, which is uncontroversial, that\n                    parties can reach a binding contract notwithstanding the requirement for formal\n                    execution. That is a function of the court’s analysis of the objective\n                    evidence whether parties had agreed for legal relations to be immediately\n                    binding or whether parties had agreed to defer legal relations until the formal\n                    execution of the written contract.45     It therefore leaves me now to examine the\n                    conduct of the parties prior to, at and/or subsequent to the 23 June 2009\n                    meeting to determine whether they were consistent with the existence of an oral\n                    contract with immediate binding effect.Whether a binding oral contract was concluded46     I begin by examining OCIA’s case given\n                    that it bears the burden to show “very strong and exceptional\n                    context” to displace theprima facieinference that the parties intended for legal relations to be deferred until the\n                    execution of the Supplemental Agreement. OCIA essentially sought to rely on two\n                    main points in its attempt to displace theprima\n                        facieinference.47     First, OCIA emphasised that prior to the\n                    23 June 2009 meeting, it had addressed all the issues raised by\n                    Mr Wong in the Term Sheet, and that going into the 23 June 2009\n                    meeting, there were no outstanding points for negotiation. However, this only\n                    goes to show there was an agreement on the terms and does not go so far as to\n                    show that the parties had intended to be immediately bound by the oral contract\n                    following the 23 June 2009 meeting without the execution of formal\n                    documentation, especially since the Term Sheet itself specifically contemplates\n                    the requirement for the signing of the Supplemental Agreement “to effect necessary changes”.48     Second, OCIA also stressed that Mr Wong\n                    was fully aware that OCIA was looking to exit from its investment in Frontken\n                    since February 2009 and was keen to prevent OCIA from selling the shares on the\n                    open market. Thus OCIA argued that both parties had placed utmost importance on\n                    the 23 June 2009 meeting with the objective intention to come out of the\n                    meeting with either a binding deal and then for formal documentation to be\n                    prepared, or no deal at all. There was therefore no contemplation of an\n                    agreement “subject to contract”. OCIA relied on an internal email\n                    from Mr Goh to Mr George Lee (“George”), Head of\n                    Investment Banking of OCBC and a member of the OCBC’s investment committee\n                    (“OIC”), dated 18 June 2009 at 6:08pm:Hi George,Just to inform that [Mr Wong] will be coming over to OCBC to meet\n                        with [Mr] Chua next Tuesday, 11:30am to finalize the terms of the Risk\n                        Participation extension. Note that OIC meeting is next Tuesday\n                        afternoon.Email below contains contents of OIC slides (cleared by [Mr] Chua) which\n                        we will be sending to OIC tomorrow 9.30am for approval to divest our\n                        Frontken shares and claim Risk Participation Amountin\n                            the event that Willie cannot agree to our terms. If Willie\n                        agrees, we will seek OIC’s approval for the terms (to be finalized\n                        next Tuesday morning).Regards,[Mr Goh][emphasis added]49     However, on a plain reading of this email, it\n                    at most goes to show that OCIA’s intention was to come out of the meeting\n                    withan agreement on the terms, or no deal at all;\n                    it does not say that the parties’ intention was to arrive at animmediatebindingagreement at the meeting. In fact, the statement “[i]f Willie agrees, we\n                    will seek OIC’s approval for the terms” contradicts the intention\n                    of a binding agreement to be concluded immediately at the meeting as it clearly\n                    expressed the necessity for OIC’s approvalafterthe meeting.50     OCIA also highlighted the fact that there was\n                    a consensus on the terms of the Term Sheet, and that Mr Wong did not raise\n                    objections or disagreed with the same at the 23 June 2009 meeting. Further,\n                    there was no expression by any party at the meeting that the oral contract was\n                    “subject to contract”. However, again, these facts only go to show\n                    that there was an agreement on the terms. The absence of explicit reference by\n                    any party at the 23 June 2009 meeting that the agreement was\n                    “subject to contract” would not be critical as the Term Sheet\n                    itself referred to the necessity for the execution of formal\n                    documentation.51     OCIA relied heavily on two email messages from\n                    Nicholas after the 23 June 2009 meeting:(a)     In his email dated 24 June\n                        2009, Nicholas questioned the fee estimate for the preparation of the\n                        Supplemental Agreement given “the very concise and good summary of\n                        theagreed termsthat [Mr Chua] had\n                        prepared [emphasis added]”.(b)     In his email dated 29 June 2009, Nicholas said in\n                        the context of the legal costs for the drafting of the Supplemental\n                        Agreement that the fee quote should not be so high “to just say that\n                        [Mr Wong]agreedto buy shares in a\n                        company in which he is already a substantial shareholder [emphasis\n                        added]”.In my view, these two email messages do\n                    not take OCIA’s case any further. First, they were sent in the context of\n                    negotiating the legal fees. Secondly, they merely confirmed that since\n                    Mr Wong had agreed to the Term Sheet, the legal fees for drafting the\n                    Supplemental Agreement should not be as high as that quoted. Thirdly, in the\n                    subsequent email messages of 2 and 3 July 2009, Nicholas repeated his\n                    objection to the fee quote since it was a “simple supplemental\n                    agreement” and was based on “the excellent summary” set out\n                    in the Term Sheet. These facts lend support to my finding that the words\n                    “agreed terms” were used to convey Mr Wong’s objection\n                    to the fee quote given the parties’ agreement on the terms. At best, it\n                    demonstrates that the parties had reached an agreement on the terms set out in\n                    the Term Sheet. As explained in[27]above, the fact that parties have reached an agreement on all the terms does not\n                    mean that the phrase “subject to contract”, or its equivalent,\n                    should not be given its ordinary meaning in the absence of “very strong\n                    and exceptional context” to the contrary. This is entirely consistent\n                    with OCIA’s own purpose in calling the 23 June 2009 meeting. In its\n                    own records, both prior and subsequent to the 23 June 2009 meeting, OCIA\n                    revealingly described the agreement as an “in-principle\n                    agreement”. In Mr Chua’s email to Nicholas dated 16 June\n                    2009, Mr Chua expressed the need for the meeting in order for the parties\n                    “to sign-off and [sic] an in-principle agreement”. In OCIA’s\n                    internal memorandum dated 28 July 2009, it was explicitly stated that OCIA\n                    had Mr Wong’s “in-principal [sic] agreement” to extend\n                    the Risk Participation Period and that the documentation process was underway.\n                    This was precisely the agreement that was achieved at the 23 June 2009\n                    meeting,ie, an agreement on the termsinprinciplesubject to\n                    the execution of the Supplemental Agreement to effect the “necessary\n                    changes”. After all, in the covering email attaching the Term Sheet\n                        (see[12]above), the purpose of\n                    the 23 June 2009 meeting was to “finalisethe terms” of the agreement\n                    and to commence the documentation process immediately thereafter. Conspicuously,\n                    OCIA did not describe the agreement as having beenconcluded.52     OCIA also claimed that in reliance of a\n                    binding oral contract, it had held off selling its Frontken shares on the open\n                    market after the 23 June 2009 meeting. However, this fact is equivocal as\n                    it is equally consistent with OCIA’s expectation that the parties would\n                    eventually sign the Supplemental Agreement and not because it thought the oral\n                    contract was binding. It bears mention that OCIA likewise did not sell the\n                    Frontken sharesbeforethe 23 June 2009\n                    meeting even though its right to do so had accrued by 11 February\n                    2009.53     OCIA also highlighted that from the receipt of\n                    the formal documentation until 28 August 2009, Mr Wong did not\n                    expressly renounce the existence of a concluded oral agreement, and had instead\n                    continued to act as if it was merely a matter of time before he would execute\n                    the formal documents, after his lawyers had verified them. Further, OCIA also\n                    relied on Mr Wong’s deceitful and opportunistic conduct in his\n                    dealings with OCIA after receipt of the formal documentation. Mr Wong\n                    deliberately avoided calls from OCIA from 6 August to 11 August 2009\n                    and admittedly lied that he had forwarded the documentation to his solicitors\n                    for review. However, these facts at most go to show that Mr Wong had acted\n                    in a morally reprehensible manner, and do not establish that a binding oral\n                    contract was reached at the 23 June 2009 meeting. The fact that\n                    Mr Wong waited till 11 August 2009 (the day after the expiry of the\n                    Risk Participation Period) to respond to OCIA is equally consistent with his\n                    understanding that he had no liability for Risk Participation after\n                    10 August 2009 and hence there was no binding oral contract.54     It should be noted that OCIA had over six\n                    weeks from the 23 June 2009 meeting to the expiry of the Risk Participation\n                    Period on 10 August 2009 to prepare the Supplemental Agreement. Although\n                    Mr Wong did contribute to some initial delay in the appointment of\n                    solicitors, Shook Lin & Bok (Malaysia) was eventually appointed on\n                    8 July 2009, which was still over a month before the expiry date. By only\n                    sending the documents to Mr Wong on 6 August 2009, just four days\n                    prior to the expiry date with three out of those four days spanning over a long\n                    weekend, OCIA took the risk that Mr Wong might not sign the Supplemental\n                    Agreement prior to the expiry of the Risk Participation Period. Had OCIA acted\n                    more efficiently and promptly in forwarding the formal documentation to\n                    Mr Wong for his execution, it would have had sufficient time to react and\n                    to arrange for an open market sale of the shares should Mr Wong decline to\n                    sign it. In fact, this was the evidence of Mr Chua – if Mr Wong\n                    had declined to sign soon after the 23 June 2009 meeting, OCIA would have\n                    sold its Frontken shares on the open market. Having taken the risks of\n                    (a) sending the documents late in the day and (b) hoping that\n                    Mr Wong would execute the documents within the short time-frame on or\n                    before 10 August 2009, OCIA, regrettably, only has itself to blame when\n                    Mr Wong took advantage to wait out the expiry of the Risk Participation\n                    Period. In the words of Mr Tong during the Oral Closing Submissions,\n                        “along the way the ball was dropped on getting the\n                        thing done”.55     Mr Wong’s behaviour inrefusing or failing to respond between 6 and\n                    10 August 2009 and in misleading OCIA into believing that his lawyers were\n                    reviewing the formal documentation might have been morally reprehensible but as\n                    stated by Gill J inLow KarYit, that is not a relevant consideration:In the result I have reluctantly come to the conclusion that there was no\n                        concluded contract between the parties to this action. I say \"reluctantly\"\n                        because of the conduct of the defendants in breaking off the negotiations\n                        when the terms of the proposed agreement were agreed upon and in\n                        capriciously refusing to sign the agreement. However, in the words of\n                        Tomlin J. inLockett v. Norman\n                            Wright,supra, \"it is no\n                        part of my duty to pronounce whether or not the conduct of any of the\n                        parties concerned in this matter is open to censure. All I have to do is to\n                        determine whether there is or is not a concluded contract between the\n                        plaintiffs and the defendants which the plaintiffs can\n                        enforce\"…Similarly, Selvam J inThomson\n                        Plazaobserved at [26]:The law with regard to a commercial contract between hard-nosed\n                        businessmen is that, save in extreme cases, the court must not rewrite what\n                        the parties have agreed simply by relying on the court's notions of\n                        unreasonable or unconscionable conduct. To do so would undermine certainty\n                        and security in the law of contract.56     Accordingly, I find that OCIA had failed to\n                    adduce sufficient evidence to displace theprima\n                        facieinference. This becomes even clearer upon consideration of\n                    Mr Wong’s submissions. Mr Chew relied on four key points in\n                    support of his submission that the objective intention of the parties was\n                    plainly for the agreement to be legally binding only when the Supplemental\n                    Agreement is duly executed in accordance with the Term Sheet:(a)the fact that the approval of OIC had to be\n                            obtained after the 23 June 2009 meeting and before OCIA could\n                            proceed with the preparation of the Supplemental\n                        Agreement;(b)the manner of the operation of the Supplemental\n                            Agreement both under its terms and in practice;(c)the course of dealing between the parties;\n                            and(d)OCIA’s absence of belief in the existence\n                            of a binding oral contract post the 23 June 2009 meeting and prior\n                            to the commencement of this suit.Approval of OCBC’s investment committee\n                (“OIC”)57     Approval by OIC on any proposal discussed\n                    between OCIA and Mr Wong was always contemplated. In OCIA’s Quarterly\n                    Review dated 16 April 2009, it was expressly stated that if Mr Wong is\n                    agreeable to the proposal, OCIA “will seek OIC’s approval before\n                    proceeding to documentation.” This was repeated in an email dated\n                    18 June 2009 which was sent by Mr Goh to Mr Chua shortly before\n                    the 23 June 2009 meeting wherein Mr Goh said that if Mr Wong\n                    “is agreeable, we will seek OIC’s approval on those\n                    terms”.58     The fact that OIC’s approval was\n                    required is also corroborated by the slides which were prepared for OIC\n                    immediately after the 23 June 2009 meeting. One of the slides specifically\n                    stated:APPROVAL SOUGHTOIC’s approval is sought to:-    approve above proposed terms (including sale of our\n                            3.7M Frontken shares to [Mr Wong] at RM0.54 a share);\n                        and-    authorise [George] to approve on the final details\n                            of divestment.59     Further, the minutes of the OIC meeting\n                    described the terms set out in the Term Sheet as “proposed terms”\n                    and conspicuously made no reference to any oral contract having been concluded\n                    with Mr Wong at the 23 June 2009 meeting.60     The email which was sent by OCIA immediately\n                    after the OIC meeting is also consistent with the fact that OIC’s approval\n                    is necessary and is not a mere formality. In Mr Goh’s email dated\n                    24 June 2009, he added that “…we wish to inform you that we\n                    just got OIC approval to extend the Risk Participation Period for Frontken from\n                    July 2010 until as long as we hold shares in Frontken. We are now going into\n                    documentation on a supplementary agreement”.61     Any residual doubt (which I did not entertain)\n                    as to the requirement of OIC’s approval was effectively removed through\n                    the evidence of Mr Goh in cross-examination:Q    So if [Mr Wong] agrees to the terms, you will\n                            then go up to OIC and get OIC’s approval, right, on those terms.\n                            That is what it says [at 3AB 902] correct?A    Yup....Q    … So if Mr Wong is agreeable, you will\n                            then ask OIC for approval and then if OIC gives its approval, you will\n                            then proceed to documentation. Is that the correct sequence or would\n                            that have been the sequence?A    Yah....Q    … So again, it’s very clear here that\n                            you need OIC’s approval after Willie agrees.\n                        Correct?A    Yah....Court .... Mr Chew’s question is: If that\n                            is right, then it really doesn’t matter whether OIC’s\n                            approval is obtained. Because if it’s obtained, good, fine and\n                            dandy. If it’s not obtained, it’s just too bad, we still\n                            have to proceed. That’s your view, right? So do you agree with\n                            Mr Chew that it doesn’t matter either way whether OIC’s\n                            approval was eventually obtained? From your perspective.WitnessI would say it---it---it\n                                is---it---it matters.QIt does\n                        matter?AYah.Q    Thank you. And that is why you needed OIC approval,\n                            or you were waiting for OIC approval before going into documentation.\n                            Correct? That was part of the sequence?A    That was mmma---mmma---the trend of thought that\n                            time, yah.[emphasis added]62     As rightly pointed out by Mr Chew, as it\n                    was still necessary to obtain the approval of OIC after the 23 June 2009\n                    meeting before OCIA could proceed with the preparation of the Supplemental\n                    Agreement, it would follow that it was still open to OIC to either withhold its\n                    approval or to request for further amendments to the terms of the agreement,\n                    such that the agreement reached at the 23 June 2009 meeting could not be\n                    said to have immediate binding effect upon OCIA or Mr Wong. The fact that\n                    George was kept abreast of the negotiations with Mr Wong prior to the\n                    23 June 2009 meeting and that OIC’s approval was in fact given in the\n                    afternoon of 23 June 2009 after the meeting did not rule out the\n                    possibility that OIC could still have withheld its approval. It is equally\n                    immaterial that Mr Wong was not aware of the requirement for OIC’s\n                    approval as it shows that OCIA could not have intended for legal relations to be\n                    immediately binding given their knowledge that OIC’s approval was\n                    necessary. After all, according to Mr Goh, the approval of OIC\n                        “does matter”. Therefore, in my\n                    view, an oral binding contract did not come into being at the 23 June 2009\n                    meeting prior to the obtaining of OIC’s approval.Manner of operation of the agreement63     The provisions of the Term Sheet and the\n                    conduct of the parties post the 23 June 2009 meeting likewise support the\n                    inference that the agreement is to have binding effect only after the execution\n                    of formal documentation.64     In addition to the express term requiring\n                    “[a] Supplemental Agreement to be executed toeffect\n                        necessary changes”, another provision in the Term Sheet\n                    states: “Shareholder shares in [Frontken] shall be pledged to [OCIA]upon the signing of Agreement”. As\n                    mentioned earlier, Mr Wong was required to pledge Frontken shares as\n                    security for his potential liabilities under the Supplemental Agreement. The\n                    requirement and obligation on Mr Wong to pledge his shares only arises upon\n                    the signing of formal documentation. It therefore lends further support to the\n                    inference that the agreement is to have binding effect only upon such\n                    execution.65     Further, another key provision of the Term\n                    Sheet was that OCIA would sell to Mr Wong 3,703,704 Frontken shares in five\n                    tranches. The first tranche was stipulated to be sold on 31 July 2009, some\n                    five weeks after the 23 June 2009 meeting. However, there was no attempt by\n                    OCIA to sell the first tranche to Mr Wong when the date arrived. There was\n                    no correspondence whatsoever from OCIA in relation to the sale of the first\n                    tranche as would be expected if OCIA had regarded the oral contract to be\n                    immediately binding following the 23 June 2009 meeting. Instead, in the\n                    Sale and Purchase Agreement prepared by OCIA’s legal department which was\n                    sent to Mr Wong on 6 August 2009 together with the Supplemental\n                    Agreement, the date for the sale of the first tranche wasunilaterallychanged by OCIA from 31 July 2009 to\n                    15 August 2009, which was five days after the expiry of the Risk\n                    Participation Period.66     If there was indeed an oral binding contract\n                    concluded on 23 June 2009, OCIA would have taken steps to sell the first\n                    tranche on 31 July 2009. As the Term Sheet stipulated aneffectivesale price of RM 0.54 per share (as Mr Wong is\n                    required to compensate for the difference between Market Price and RM 0.54),\n                    which was OCIA’s average cost per share and was significantly higher than\n                    the market price as well as the floor price per share at that time, OCIA would\n                    have reduced its risk exposure significantly by proceeding with the sale.\n                    Further, it is trite that the terms of a concluded contract can only be varied\n                    by mutual agreement (Chitty, para 22-032);\n                    however, the consent of Mr Wong to the change in the date for the sale of\n                    the first tranche was never procured. While at common law a contract may validly\n                    confer on one contracting party the power to unilaterally vary the contract\n                        (Chitty, para 22-039), there was no such\n                    provision in the agreement here. It is irrelevant that the amendment caused no\n                    prejudice to Mr Wong or that it was in fact “beneficial” in\n                    deferring the purchase date. Instead, OCIA’s failure to sell the first\n                    tranche and its subsequent amendment of the date of sale for the first tranche\n                    evidenced two things: (a) the terms agreed on 23 June 2009 were not\n                    regarded as immediately binding as they could still be amended, and\n                    (b) OCIA viewed the agreement as binding only after its final execution,\n                    and having failed to have the contract executed before 31 July 2009, it\n                    stipulated a new transaction date of 15 August 2009 for the first tranche.\n                    The other difficulty with the unilateral amendment in respect of the sale of the\n                    first tranche is that it necessarily implies that Mr Wong would be in\n                    breach of contract if he fails to purchase the first tranche on 15 August\n                    2009. How could Mr Wong be in breach of a term which he never agreed\n                    to?67     When questioned on OCIA’s omission to\n                    sell the first tranche on 31 July 2009, Mr Goh offered the following\n                    explanation:Q:Can you explain to us why there was no such sale of\n                            the shares to Mr Wong on 31stof July\n                            2009?A:We wanted to---first on our mind is to get the\n                            documentation signed. So---er, er, and then we thought he would execute\n                            it after the signing of the documentation and---and we don’t see\n                            any detriment ah to him lah by not buying, er, slightly earlier---I mean\n                            or slightly later.The first part of Mr Goh’s explanation is unhelpful to\n                    OCIA’s case – the priority placed on the execution of the contract\n                    over an immediate opportunity to reduce OCIA’s risk exposure goes to show\n                    that OCIA had treated the agreement as having legal effect only upon formal\n                    execution. The second part of Mr Goh’s explanation is unconvincing\n                    – it is difficult to believe that OCIA was willing to postpone the sale\n                    because there was no detriment to Mr Wong. This isnon\n                        sequiturto OCIA’s omission to sell the first tranche\n                    shares.68     Furthermore, the preamble in the Term Sheet\n                    referred to a disclaimer which reads as follows:THIS PROPOSAL IS TO BE USED FOR CONTINUED DISCUSSIONS, AND DOES NOT\n                        CONSTITUTE A COMMITMENT OF OCBC BANK TO LEND, INVEST OR AN AGREEMENT OF OCBC\n                        BANK TO PREPARE, NEGOTIATE, EXECUTE OR DELIVER SUCH A COMMITMENT... THE\n                        TERMS AND CONDITIONS OF THIS PROPOSAL...MAY BE MODIFIED\n                            OR SUPPLEMENTED BY OCBC BANK IN ITS SOLE DISCRETION AT ANY TIME AND FROM\n                            TIME TO TIME DURING THE COURSE OF ITS DUE DILIGENCE AND CREDIT APPROVAL\n                            PROCESSOR AS A RESULT OF CHANGED MARKET CONDITIONS OR\n                        OTHERWISE…[emphasis in bold added]69     The above disclaimer was inserted by OCIA in\n                    the Term Sheet for the purpose of the 23 June 2009 meeting. The disclaimer\n                    was added because OCIA knew that the proposal required the approval of OIC and\n                    that OIC may modify the proposal as it deems fit. This is again entirely\n                    consistent with the fact that the proposal was submitted to OIC for approval\n                    immediately after the 23 June 2009 meeting. This is a point of some\n                    significance which is to be contrasted with the court’s finding inPRAat [33] that “neither party was at liberty to insert in the\n                    conformed contract document a term which had not been agreed prior to the award\n                    of the contract”. It is no surprise that inRossiterat 1151, a similar observation which led the House\n                    of Lords to find that a binding contract was concluded was “that those\n                    who draw up the formal agreement have not the power to vary the terms already\n                    settled”.70     The fact that no binding oral contract was\n                    concluded at the 23 June 2009 meeting can also be inferred from the\n                    complete absence of any reference in the Supplemental Agreement to the alleged\n                    oral contract of 23 June 2009 notwithstanding the recital of the background\n                    facts. In fact, cl 7.6 of the Supplemental Agreement states that it\n                    “shall be effective as of the date hereof irrespective of the diverse\n                    dates upon which the respective parties may have executed [it]”.That\n                    certainly does not relate back to 23 June 2009.Course of dealing between the parties71     The course of dealing between the parties also\n                    reveals that the parties have dealt with each other on the basis that agreements\n                    are legally binding only upon formal execution. This was the common\n                    understanding of the parties with respect to the RPA, the very document which\n                    the Supplemental Agreement sought to amend.72     For the RPA, a draft dated 5 July 2007\n                    was sent to Mr Wong and the terms of the draft were presumably agreed some\n                    time shortly thereafter. The RPA was eventually executed on 20 July 2007.\n                    The evidence shows that this was the date treated by the parties as the date on\n                    which binding legal relations came into being:(a)     First, in the Affidavits of\n                        Evidence-in-Chief (“AEICs”) of all three witnesses for OCIA\n                        (Mr Chua, Mr Goh and Vincent), it was common ground that OCIA and\n                        Mr Wong entered into the RPA on 20 July 2007.(b)     Secondly, Vincent’s evidence\n                        during cross-examination was that if Mr Wong had not signed the RPA on\n                        20 July 2007, OCIA would not have proceeded with its purchase of\n                        Frontken shares on 24 July 2007:Q:Right. So let me ask you this, if Mr Wong had\n                            not signed the [RPA] on the 20thof July,\n                            even though instructions had been given to the lawyers to prepare the\n                            execution copy, would OCIA have proceeded and accepted the placement\n                            shares on the 24thof July?A:Er, probably not.Q:Probably not. Probably not because he hadn’t\n                            signed it, correct?A:Er, yes.73     Further, the evidence was that the usual\n                    business practice of OCIA was to act on executed documents, and not on oral\n                    agreements. This was confirmed by Mr Goh in cross-examination:Q:Can you tell me if the bank, OCBC or OCIA, is\n                            generally in the habit of acting on oral agreements?…A:The---the bank’s practice is to have document\n                            [sic].This is most probably true of most, if not all, financial\n                    institutions and reinforces the inference that the common understanding between\n                    OCIA and Mr Wong was that any agreement would only be legally binding when\n                    formal documents are executed as expressly provided for under the Term\n                    Sheet.OCIA’s conduct is consistent with its absence of belief in the\n                existence of a binding oral contract74     In addition, Mr Chew also raised three\n                    material facts to demonstrate OCIA’s own absence of belief of a binding\n                    oral contract concluded at the 23 June 2009 meeting:(a)     OCIA’s attempts to salvage the\n                        agreement after the expiry of the Risk Participation Period, including\n                        –(i)requesting that Mr Wong sign a\n                                “Letter of Extension” in order to extend the Risk\n                                Participation Period; and(ii)negotiating with Mr Wong to restructure\n                                the deal.(b)     Evidence of\n                        OCIA’s representatives under cross-examination indicating their\n                        absence of belief in the existence of a binding oral contract reached at the\n                        23 June 2009 meeting.(c)     The urgency with which OCIA treated the execution of the\n                        Supplemental Agreement in view of the impending expiry of the Risk\n                        Participation Period.75     Before examining the evidence which supports\n                    OCIA’s absence of belief of a concluded oral contract at the 23 June\n                    2009 meeting, I should make clear that the absence of such belief,of itself, is not strictly decisive. As observed by\n                    Michael Black QC sitting as a Deputy Judge inKvaerner\n                        Construction Ltd v Eggar (Barony) Ltd[2000] All ER (D) 1157 (“Kvaerner”), “its only value is as an echo of an\n                    earlier intention, it cannot stand alone”.76     After the expiry of the Risk Participation\n                    Period on 10 August 2009, OCIA requested Mr Wong to sign a\n                    “Letter of Extension” in order to extend the Risk Participation\n                    Period until 31 August 2009. Subsequently OCIA sought to amend the\n                    “Letter of Extension” to grant an indefinite extension to the Risk\n                    Participation Period until the execution of the Supplemental\n                Agreement.77     However, under the Term Sheet, the Risk\n                    Participation Period would be “[i]n force immediately following\n                    Restricted Period (1 July 2010)for as long as [OCIA]\n                        continues to hold its Frontken shares[emphasis added]”.\n                    As such, if a binding oral contract on the terms of the Term Sheet was reached\n                    at the 23 June 2009 meeting, there would have been no need for an extension\n                    of the Risk Participation Period as it would already have been extended\n                    indefinitely. Instead, OCIA’s attempts to obtain an interim extension\n                    prior to execution revealed that OCIA did not itself believe that there was\n                    already a binding oral contract in place. Further, in Mr Chua’s email\n                    to Mr Wong on 21 August 2009, the stated reason for the Letter of\n                    Extension was for the positions for the parties “to remainstatus quo(as at 10/8/09) until we sign the new\n                    supplemental agreement”. This contradicts OCIA’s case as it\n                    suggests that contractual relations between the parties were intended to change\n                    (to that governed by the Term Sheet) only upon the signing of the Supplemental\n                    Agreement.78     After OCIA failed to persuade Mr Wong to\n                    sign the “Letter of Extension” or the Supplemental Agreement, a\n                    meeting with Mr Wong was arranged on 28 August 2009 wherein\n                    Mr Wong again declined to sign the Supplemental Agreement. The following\n                    email was sent by Mr Chua to Mr Wong and Nicholas on the same date,\n                    wherein a new “restructuring” proposal was mentioned as being\n                    discussed at the meeting:Dear [Mr Wong] and NicholasThank you for the meeting, it was very enlightening to understand the\n                        history of the deal.To recap, I would appreciate your confirmation on the basic principle of\n                        restructuring this deal:1.    OCBC cost per share is now brought to RM 0.47\n                            (original RM 15m)2.    Shareholding is 27,630,400 shares (RM\n                            12,986,288)3.    Current share price of Frontken RM 0.23 (RM\n                             6,354,992)4.    The understanding is that OCBC would be able to\n                            recover RM 12.98m from this restructuring with some potential\n                            upside.Initial thoughts are1.    OCBC will extend a RM 10m loan to\n                        Frontken2.    RM6.3m will be retained in a controlled account for\n                            the use of share buy back3.    OCBC will charge RM 3.7m as fees for arranging the\n                            restructuring4.    Frontken will repay a total of RM 12.98M on the\n                            loan over 3 years (preferably quarterly repayments)5.    OCBC will option to buy up to RM 10m worth of new\n                            Frontken shares at exercise price of RM 0.25 with mandatory conversion\n                            at RM 0.47Appreciate your concurrence and comments asap.Regards,[Mr Chua].79     As can be seen, this new proposal was entirely\n                    dissimilar to the agreement envisaged by the Term Sheet. The contracting parties\n                    were now OCIA and Frontken, and Mr Wong was not even a party at all –\n                    there is no sale of shares from OCIA to Mr Wong, no Risk Participation by\n                    Mr Wong and no share pledge by Mr Wong. Instead, the essence of the\n                    new proposal was a loan from OCIA for the purposes of a share buy-back by\n                    Frontken, coupled with an option for OCIA to purchase more Frontken shares. The\n                    rationale behind this new proposal was explained by Mr Chua under\n                    cross-examination:… Nicholas came up with an idea that since Frontken was going to do\n                        a restructuring, maybe, er, a share buyback, er maybe we could restructure\n                        this re---er dealso that, you know, we could still\n                            salvage something out of this…[emphasis added]80     Instead of asserting its rights under the\n                    purported oral contract, OCIA opted to pursue a new and completely distinct\n                    proposal in order to “salvage” the deal with Mr Wong. It is\n                    therefore clear that OCIA itself did not recognise that a binding contract had\n                    come into being at the 23 June 2009 meeting given the non-execution of the\n                    Supplemental Agreement. It is certainly incongruous for OCIA to extend a new\n                    loan of RM10 million to Frontken to resolve a breach of an oral contract by its\n                    CEO, Mr Wong.81     From the evidence of Mr Chua and\n                    Mr Goh under cross-examination, it is apparent that they likewise did not\n                    themselves recognise that a binding contract was concluded at the meeting on\n                    23 June 2009. The most telling evidence came from Mr Chua:Q:So if Mr Wong, after the\n                                23rdJune meeting had called you back\n                            half an hour later and said, “You know, Mr Chua, I---I---I\n                            think I---I don’t want to go through with this”, would you\n                            have said, ”It’s too late”?A:I---I would have said that, erm,\n                            “Mr Wong, er, please be prepared that I’ll be selling\n                            27 million shares into the market within the next\n                            5---with---with---within the next 2 months”.As such, if OCIA had received earlier notice that Mr Wong\n                    would not sign the Supplemental Agreement, it would have treated the RPA as\n                    still binding and the new arrangements under the Term Sheet as not binding, and\n                    would have proceeded to dispose of its shareholding in Frontken “within\n                    the next 2 months”,ie, by August 2009\n                    as provided under the RPA. The obvious inference is that the oral contract could\n                    not have been intended to be binding unless the Supplemental Agreement was\n                    executed. If OCIA had regarded the oral contract as binding, OCIA would not have\n                    sold off the shares immediately since the new Risk Participation Period would\n                    not have commenced prior to 1 July 2010 as stated in the Term\n                Sheet.82     Further, Mr Goh had also conceded under\n                    cross-examination that execution of the Supplemental Agreement is necessary for\n                    the agreement to be binding and that OCIA’s conduct was consistent with\n                    that conclusion:Q:I put it to you, Mr Goh, thatit was all along intended that for there to be any binding\n                                agreement between OCIA and Mr Wong, the parties had to enter\n                                into a written supplemental agreement. Do you agree or\n                                disagree?A:Yah.Q:You agree?A[sic]:And I put it to you that the only agreement\n                            that was reached by the parties on the 23rdof June 2009 after the meet---at the meeting was that a draft\n                            supplemental agreement be prepared on the terms that were set out in the\n                            summary. Agree or disagree?A:Yah, the supplemental to---to follow\n                            the---af---the---to follow up after the meeting....QI put it to you thatyour own\n                                conduct showed---your own conduct after\n                                    23rdof June showed that OCIA was\n                                proceeding on the basis that in order for there to be a binding\n                                supplemental agreement,[Mr Wong]\n                                needed to sign the document first. Do you agree or\n                            disagree?AYahQYou agree. And I put it to you---sorry,\n                        yes.[emphasis added]This concession by Mr Goh is quite critical since he was one of\n                    the key personnel from OCIA who was directly involved in the negotiations with\n                    Mr Wong. It is also entirely in line with the objective evidence before\n                    me.83     The fact that OCIA treated the Risk\n                    Participation Period as binding and the new arrangements under the Term Sheet as\n                    not binding until the signing of the Supplemental Agreement is also evidenced by\n                    the urgency with which OCIA treated the preparation and signing of the\n                    Supplemental Agreement in light of the impending expiry date of 10 August\n                    2009. The urgent requirement for the Supplemental Agreement to be executed can\n                    be gleaned from the following email messages:(a)     Mr Chua’s email to\n                        Mr Wong, Nicholas and Mr Goh on 24 June 2009, 1 day after the\n                        23 June 2009 meeting, in which he stated:Hi [Mr Wong] & NicholasThank you for the meeting yesterday, it was great that we were able to\n                            quickly agree on the outstanding matters. Look forward to signing of\n                            this supplementalwith the same urgency.\n                            Regards, [Mr Chua].[emphasis added](b)     After Shook Lin\n                        & Bok (Malaysia) was engaged to prepare the Supplemental Agreement,\n                        Mr Goh sent the following email to Ms Khong Mei Lin (“Mei\n                        Lin”) from the firm on 14 July 2009:Hi Mei LinHope we can get the draft tomorrow evening in view ofurgency to get client to sign on those negotiated terms\n                                soon as possible.Regards,[Mr Goh][emphasis added](c)     Another email\n                        from Mr Goh to Shook Lin & Bok (Malaysia) on 4 August 2009\n                        pressing for a revised draft of the Supplemental Agreement:Hi Mei LinI refer to our phone conversation yesterday and as indicated, need to\n                            send out the Supplemental Agreement to client soon as possible– [Risk Participation] Period expiring in next few\n                                days. Look forward to the draft this afternoon.Regards,[Mr Goh][emphasis added](d)     Repeated attempts\n                        by OCIA to contact Mr Wong after the formal documentation was sent to\n                        him on 6 August 2009.84     If there was indeed a binding oral contract in\n                    place after the 23 June 2009 meeting, the new terms regarding the Risk\n                    Participation Period would have been in force, while the original expiry date of\n                    the Risk Participation Period of 10 August 2009 superseded. The only\n                    reasonable explanation for OCIA’s repeated displays of urgency in\n                    requiring the execution of the Supplemental Agreement before 10 August\n                    2009, and more significantly its own acknowledgment of the expiry of the\n                    existing Risk Participation Period, is that no binding oral contract was reached\n                    at the 23 June 2009 meeting.85     Mr Tong, however, stressed that\n                    OCIA’s representatives being lay persons may not have fully appreciated\n                    the legal significance of their conduct and/or their language in the email\n                    messages. However, in contract law, the court is concerned with the objective\n                    intention of the contracting parties,ie, what a\n                    reasonable, ordinary observer of their conduct would think their intention was.\n                    The legal knowledge (or lack thereof) of a contracting party is irrelevant if\n                    their conduct is inconsistent with the existence of a binding oral\n                    contract.86     Mr Tong further added that employees of a\n                    bank would invariably insist on formalities and/or procedures to be complied\n                    with so that the bank will be better protected against prospective claims and/or\n                    disputes. This is precisely the point – employees (acting as agents of\n                    banks) and customers of banks typically transact on the basis that formalities\n                    are required for a binding agreement and this inference has to be displaced by\n                    compelling evidence to the contrary in the particular case.87     Having examined all the points raised by\n                    Mr Chew, I would have found that no binding oral contract was concluded at\n                    the 23 June 2009 meeting even if the burden was on\n                Mr Wong.OCIA’s alternative estoppel argument88     OCIA also relied on the doctrine of estoppel\n                    by convention, the elements of which are set out inTravista\n                        Development Pte Ltd v Tan Kim Swee Augustine and others[2008]\n                    2 SLR(R) 474:(a)the parties to a transaction acted on “an\n                            assumed and incorrect state of fact or law”;(b)the assumption is shared by both, or made by one\n                            and acquiesced in by the other; and(c)the parties are precluded from denying the truth\n                            of that assumption, if it would be unjust or unconscionable to allow\n                            them (or one of them) to go back on it.89     Estoppel by convention is further explained inChitty, para 3-107:… Such an estoppel differs from estoppel by representation and from\n                        promissory estoppel in that itdoes not depend on any\n                            representation or promise. It can arise by virtue of a common\n                        assumption which was not induced by the party alleged to be estopped but\n                        which was based on a mistake spontaneously made by the party relying on it\n                        and acquiesced in by the other party. It seems, however, that the assumptionresembles the representation required to give rise to\n                            other forms of estoppel to the extent that it must be\n                            “unambiguous and unequivocal”… [emphasis\n                        added]90     As is the case with estoppel by representation\n                    and promissory estoppel, estoppel by convention is usually considereda “shield” and not a\n                    “sword”, that is to say, it does not create any cause\n                    of action when none existed before. See Chitty, para 3-113. However, as\n                    noted by Phang JA inTeeSoonKayv\n                        Attorney-General[2007] 3 SLR(R) 133, there has\n                    been gradual recognition of the use of estoppel as a\n                    “sword”:… by invoking the doctrine of promissory estoppel, the respondent\n                        appears, whether by design or otherwise, to be utilising this doctrine as a\n                        cause of action in itself. Whether or not this is permissible is an issue\n                        that is still shrouded in some controversy. It was always assumed that such\n                        a course of action was impermissible. However, the leading Australian High\n                        Court decision ofWaltons Stores (Interstate)\n                            Limited v Maher(1988) 164 CLR 387 allowed the\n                        doctrine of promissory estoppel to be utilised as a cause of action in\n                        itself: as (in traditional terminology) a \"sword\" (as opposed to merely a\n                        \"shield\" or defence (as exemplified in the oft-cited English Court of Appeal\n                        decision ofCombe v Combe[1951]\n                        2 KB 215)). There is, in fact, some indication that even in\n                        England, a more flexible approach might be adopted. In the recent English\n                        Court of Appeal decision ofBaird Textiles Holdings\n                            Ltd v Marks & Spencer plc[2002]\n                        1 All ER (Comm) 737, for example, Sir Andrew Morritt VC did\n                        refer to the Australian High Court decision ofWaltons Stores (Interstate) Limited v Maher. Morritt VC,\n                        whilst not completely closing the door to allowing estoppel to function as\n                        the absence of precedent as well as the need for sufficient certainty (which\n                        he did not find on the facts) (seeibidat 751). The learned judge did, however, acknowledge that the House of\n                        Lords might adopt a different (and more liberal) approach in the future\n                        (at 751-752). Judge and Mance LJJ were also of a similar view:\n                        emphasising both the point from precedent as well as the desirability of\n                        distinguishing amongst the various categories of estoppel (at 753-754\n                        and at 760-763 respectively). However, in view of our decision that\n                        there are no problems relating to consideration with regard to the contracts\n                        entered into by the appellants, we do not have to decide this particular\n                        issue in the present appeal.91     The idea that estoppel can only be used as a\n                    “shield” is also somewhat mitigated by the principle that one can\n                    be estopped from denying the existence of a contract which effectively renders\n                    estoppel as an alternative “sword” in the event that an action for\n                    breach of contract fails. SeeWaltons Stores (Interstate)\n                        Limited v Maher(1988) 164 CLR 387\n                        (“Waltons Stores”);Mitsui Babcock Energy Limited v John Brown Engineering(1997) 51 Con LR 129;Kvaerner.\n                    This is the precise context in which OCIA is seeking to apply estoppel by\n                    convention in the present case.92Waltons Storesis a case of particular relevance to our present case as the High Court of\n                    Australia held that although the want of formal execution led to the absence of\n                    a binding lease agreement, the company was estopped from denying that it was\n                    bound. InWaltons Stores, a company had negotiated\n                    to lease some land from the owner. The owner was to demolish a building and\n                    construct a new one to the company's specifications. The company’s\n                    solicitor forwarded a draft lease to the owner’s solicitor to which the\n                    latter suggested certain amendments. On 7 November 1983, the owner’s\n                    solicitor told the company’s solicitor that it was essential that the\n                    agreement be concluded within the next day or so, and that the owner did not\n                    wish to demolish the building until it was clear that there were no\n                    problems with the lease. The company’s solicitor said that the company had\n                    notified him orally that the suggested amendments to the draft lease were\n                    acceptable but he would get formal instructions and would inform the\n                    owner’s solicitor the next day whether the company disagreed with any of\n                    them. He then sent the owner’s solicitor a redrafted lease incorporating\n                    the suggested amendments without objecting to the amendments on the next day or\n                    at all. On 11 November 1983, the owner’s solicitor forwarded to the\n                    company's solicitor an executed lease “by way of exchange”. The\n                    owner then began to demolish the building. About a week later the company had\n                    second thoughts about proceeding with the transaction, and after having been\n                    told by its solicitor that it was not bound to proceed unless parts\n                    were exchanged, told him to “go slow”. Shortly thereafter,\n                    the company became aware that the demolition was proceeding. Early in January\n                    1984, the owner commenced building works. The building was about 40 percent\n                    completed when on 19 January 1984, the company informed the owner that it\n                    did not intend to proceed. No communication was exchanged between the\n                    company’s solicitors and the owner’s solicitor between\n                    11 November 1983 and 19 January 1984.93     Mason CJ, Wilson, Brennan and\n                    Deane JJ. held that the company was estopped from retreating from its\n                    implied promise to complete the contract because knowing the owner had exposed\n                    himself to detriment by acting on the basis of a mistaken assumption that the\n                    contract was concluded, it was unconscionable for it to adopt a course of\n                    inaction which encouraged the owner in the course he had adopted. Deane J\n                    further held that the retention of the executed lease by the company’s\n                    solicitor and the company’s deliberate silence and inaction had caused the\n                    owner to mistakenly assume that a binding contract existed and to act on that\n                    assumption to his detriment. Gaudron J held that the company’s\n                    imprudence in failing to inform the owner that exchange might not occur caused\n                    the owner to act on the assumption that an exchange had taken place, and it\n                    would be unjust and unfair to allow departure from that\n                assumption.94     There is, however, an important distinction\n                    betweenWaltons Storesand the present case. InWaltons Stores, there was an\n                    “unambiguous and unequivocal” assumption that there was a\n                    concluded contract held by the owner which led him to go so far as to demolish\n                    the old building and construct 40 percent of the new building before being\n                    informed by the company that it did not intend to proceed. The company\n                    acquiesced in this assumption by its deliberate silence and inaction despite\n                    knowledge that the demolition work was underway. In the present case, there is\n                    no such “unambiguous and unequivocal” assumption by OCIA as\n                    regards the conclusion of a binding oral agreement. Mr Tong accepted that a\n                    finding by the court that OCIA did not intend to be bound immediately would be\n                    fatal to its alternative estoppel argument.95     As stated earlier at[74]–[84]above, the evidence shows that OCIA was mindful of the fact\n                    that the expiry date of 10 August 2009 under the existing RPA was looming\n                    and treated with some urgency the need to secure the execution of the formal\n                    documentation before that deadline. OCIA neither treated the original expiry\n                    date as having been superseded by the Term Sheet, nor treated formal execution\n                    as a mere formality. While OCIA did hold off an open market sale of its Frontken\n                    shares, that conduct is equally consistent with its understanding that the terms\n                    of the Term Sheet were more advantageous than the option of an open market sale,\n                    and its expectation that Mr Wong would eventually execute the Supplemental\n                    Agreement. However strong that expectation might be, in my view, it did not\n                    qualify as an “unambiguous and unequivocal” assumption. Instead,\n                    OCIA took the risk that Mr Wong might not sign off on the Supplemental\n                    Agreement eventually when it forwarded the finalised draft to Mr Wong with\n                    only four days of the Risk Participation Period remaining. Unfortunately for\n                    OCIA, it waited too long in finalising the draft. In the result, it did not have\n                    any sufficient time to react to Mr Wong’s refusal to sign the\n                    Supplemental Agreement and therefore must bear the unfortunate consequences of\n                    its own delay.96     As such, there is no need in the present case\n                    to decide whether estoppel by convention can be used as a “sword”\n                    as there was no common assumption that a binding oral contract existed or that\n                    the Risk Participation Period had been extended. Accordingly the estoppel\n                    argument failsin limine.Conclusion97     For all the reasons stated above, I find that\n                    nobindingoral agreement was concluded at the\n                    23 June 2009 meeting. Both parties specifically contemplated and agreed\n                    that the changes to the RPA would have to be effected by way of an executed\n                    Supplemental Agreement which was never signed by either party. In the result,\n                    OCIA’s claim is dismissed with costs.",
        "Events after the 23 June 2009 meeting": "16     On the next day,ie, 24 June 2009, Mr Goh forwarded to Mr Wong and\n                    Nicholas a list of the panel of lawyers that OCIA would be agreeable to appoint\n                    to prepare the formal documentation. After some exchange of correspondence\n                    between Nicholas and Mr Goh as well as Mr Chua during which\n                    Mr Wong (as represented by Nicholas) tried to minimise the legal cost for\n                    preparing the documentation, Mr Wong finally gave his concurrence on\n                    8 July 2009 to the appointment of Shook Lin & Bok (Malaysia) to prepare\n                    the Supplemental Agreement with OCBC’s internal legal department drafting\n                    the Sale and Purchase Agreement as well as the Memorandum of Deposit. From then\n                    till the time when the documentation was sent to Mr Wong, there was no\n                    communication or any meeting between the parties. 17     The formal legal documentation was eventually\n                    completed and sent to Mr Wong for execution on 6 August 2009, just\n                    four days before the expiry of the Risk Participation Period with three days\n                    spanning over a long weekend. Despite persistent attempts by Mr Chua and\n                    Mr Goh to contact Mr Wong, they were not able to reach him.\n                    Mr Wong only responded by email on 11 August 2009, the day after the\n                    expiry of the Risk Participation Period, in the following terms: Dear [Mr Chua], I’ve been away since last week to take advantage of the long weekend\n                        in Singapore. If you recall during our meeting in your office there werestill some unresolved issueson the proposed\n                        variation to the RPA. These weresupposed to be dealt\n                            with in the supplemental agreementwhich I noticed have just\n                        been sent to me. I will forward to my lawyers the various documents you\n                            sent me for their review and comments.I’ll come back\n                        to you as soon as I hear back from them. [emphasis added] 18     From then until 28 August 2009,\n                    OCIA’s representatives repeatedly sought an update from Mr Wong and\n                    requested that he sign a “Letter of Extension” in order to extend\n                    the Risk Participation Period pending the execution of the Supplemental\n                    Agreement, but to no avail. Eventually a meeting with Mr Wong was arranged\n                    on 28 August 2009 wherein Mr Chua brought the formal documentation for\n                    Mr Wong to sign. Mr Wong declined stating that he was not obliged to\n                    do so as the Risk Participation Period had expired. 19     A new “restructuring” proposal\n                    was then floated for OCIA to extend a loan to Frontken to purchase OCIA’s\n                    Frontken shares. However, negotiations on this proposal came to a stalemate, and\n                    OCIA subsequently initiated the present action against Mr Wong. Its cause\n                    of action was principally premised on an alleged oral agreement on the terms of\n                    the Term Sheet reached at the 23 June 2009 meeting.",
        "Issues": "20     At the close of the trial, I invited the\n                    parties to address the following broad issues: (a)     On the contractual issue, (i)       Where the parties\n                            contemplate the signing of a written contract, whether that precludes\n                            the existence of a binding oral contract; (ii)       Whether the conduct of the parties\n                            after the 23 June 2009 meeting was consistent with the existence of\n                            a binding oral contract. (b)     On the estoppel issue, (i)       What was the relevant\n                            conduct, if any, giving rise to the common assumption that a binding\n                            oral contract had been reached; (ii)       What is the relevance of Mr Wong’s\n                            conduct after the receipt of the draft Supplemental Agreement on\n                            6 August 2009 and after the expiry of the Risk Participation Period\n                            on 10 August 2009?",
        "Whether contemplation of a written contract precludes the existence\n                of a binding oral contract": "21     Contemplation of a written contractper sedoes not preclude the existence of a binding oral\n                    contract. That is ultimately a matter of construction of the documentary\n                    evidence as well as the interpretation of the objective intention of the\n                    parties. It was previously thought that the addition of the phrase\n                    “subject to contract” is conclusive of the parties’\n                    intention not to be bound until a contract is signed. SeeUnited Artists Singapore Theatres Pte Ltd and anothervParkway Properties Pte Ltd and another[2003]\n                    1 SLR(R) 791 at [57].\n                    That view was recently revisited inNorwest Holdings Pte Ltd\n                        (in liquidation) v Newport Mining Ltd and another appeal[2011]\n                    4 SLR 617 (“Norwest”)\n                        at [24] where the Court of\n                    Appeal observed that: … thebetter viewis that the questionwhether there is a binding contract between the parties should\n                            be determined by considering all the circumstances, not just the\n                            inclusion of the stock phrase ‘subject to contract’ (on the\n                            basis that the substance of the situation must always prevail). These\n                            would include what was communicated between the parties by words or\n                            conduct. In this regard, we are in agreement with the recent\n                        decision of the UK Supreme Court inRTS Flexible Systems\n                            Ltd v MolkereiAlois Muller GmbH & Co\n                            KG (UK Production)[2010] 1 WLR 753 in which it was\n                        held that (at [56]): Whether in such a case [ie, concerning\n                            an agreement that is ‘subject to contract’] the parties\n                            agreed to enter into a binding contract, waiving reliance on the\n                            ‘subject to [written] contract’ term or understanding will\n                            againdepend upon all the circumstances of the\n                                case, although the cases show that the courtwill not lightly so hold… [original emphasis in italics; emphasis added in bold italics] 22     In deciding whether a binding oral contract\n                    was concluded at the 23 June 2009 meeting, it behoves me to consider all\n                    the circumstances of the case including the question of whether parties had\n                    expressed any intention that their discussions and/or oral agreement were\n                    “subject to contract”. In this case, the Term Sheet specifically\n                    provided for “[a] Supplemental Agreement to be executed to effect\n                    necessary changes”. Burden of proof 23     The immediate question that arises for\n                    determination is whether such a provision is tantamount to “subject to\n                    contract”. This inquiry is significant because if the Term Sheet was\n                    indeed “subject to contract”, “very strong and exceptional\n                    context” must be demonstrated by OCIA to displace theprima faciemeaning of the parties’ intention not to be\n                    bound prior to the execution of the Supplemental Agreement. SeeNorwestat [29]–[31]. 24     This proposition appears to be well entrenched\n                    in case law. InThomson Plaza (Pte) Ltd v\n                        Liquidators of Yaohan Department Store Singapore Pte Ltd (in\n                        liquidation)[2001] 2 SLR(R) 483, Selvam J\n                    cited with approval the observations of Gill J inLow\n                        KarYit v Mohamed\n                    Isa[1963] MLJ 165 (“Low KarYit”) at 173: The authorities would appear to support the view that even where there is\n                        nothing in the agreement to suggest that the parties contemplate that the\n                        subsequent contract shall contain any new or different terms, nevertheless\n                        if it appears that the parties do not intend to bind themselves\n                        contractually by the agreement but only by the subsequent contract if and\n                        when they should enter into it, there will be no contract. Moreover,if the reference to the execution of the subsequent\n                            contract is in words which according to their natural construction\n                            import a condition, this will almost invariably be conclusive that the\n                            agreement itself was not intended to be a contract...Perhaps\n                        I should add that the plaintiffs in this case are asking the court to order\n                        the defendants to execute the draft agreement agreed upon, which amounts in\n                        effect to asking the court to enforce an agreement to enter into an\n                        agreement. That is an order which the court clearly has no power to make in\n                        the circumstances of the case. [emphasis added] 25     Similarly, the Court of Appeal in New Zealand\n                    inConcorde Enterprises v Anthony Motors(Hutt) Ltd[1981] 2 NZLR 385\n                        (“Concorde”) held that the\n                    negotiations in that case had been conducted partly between the parties'\n                    solicitors and partly between the parties themselves with a view to the\n                    production of a commercial agreement of some complexity to be executed by all\n                    parties. As such, the New Zealand Court of Appeal concluded that thenormal inferenceis that the parties do not intend to be\n                    bound until the written agreement is executed. Cooke J stated\n                    at 389: Unless that inference is displaced the result is\n                            that,even though all the terms to be\n                            included in the document have been agreed, there is no\n                            contractand each party has a locus poenitentiae until at\n                        least execution on both sides. It may be that exchange or delivery of\n                        executed documents is also necessary, but that need not now be decided.\n                        Cases can arise where, without execution of a document on one side or both,\n                        the parties act on it, so that an implied contract arises.Brogden v Metropolitan Railway Co(1877) 2 App\n                        Cas 666 is a leading illustration… [emphasis added] 26     Similar views were expressed by the English\n                    Court of Appeal inCheverny Consulting Ltd v Whitehead Mann\n                        Ltd[2007] 1 All ER (Comm) 124 (“Cheverny”) at [45]: Obviously each case depends on its own facts but in my view where, as\n                        here, solicitors are involved on both sides, formal written agreements are\n                        to be produced and arrangements made for their executionthe normal inference will be that the parties are not bound unless and\n                            until both of them sign the agreement… [emphasis added] 27     In his Oral Closing Submissions, faced with\n                    the force of the authorities, counsel for OCIA, Mr Edwin Tong\n                    (“Mr Tong”) accepted that if the oral contract was\n                    “subject to contract”, the burden is indeed on OCIA to demonstrate\n                    that the parties intended for legal relations to be immediately binding\n                    following the 23 June 2009 meeting. To do so, OCIA must show “very\n                    strong and exceptional context” to displace the normal orprima facieinference. This is so even if all the terms\n                    have already been agreed. SeeNorwestat [29],Low\n                        KarYitat 173,Concordeat 389 andGround &\n                        Sharp Precision Engineering Pte LtdvMidview\n                        Realty Pte Ltd[2008] SGHC 160 at [18]. If there was no agreement on the terms,\n                    there will be no necessity to consider thefurtherquestion whether parties had intended to be bound immediately or to defer legal\n                    relations until the formal execution of the written contract. Subject to contract 28     It is, however, important to recognise that\n                    whether an agreement is “subject to contract” is a matter of\n                    substance and not form. When it is not expressly stated to be “subject to\n                    contract”, it is a question of construction whether the parties intended\n                    that the terms agreed upon should merely be put into form or to be subject to an\n                    agreement to the terms of which are not expressed in detail. This was so stated\n                    inCheverny: … it is not essential that there should have been an\n                        express stipulation that the negotiations are to be ‘subject to\n                        contract’. As Jessel MR pointed out in relation to negotiations\n                        conducted through correspondence inWinn v\n                            Bull(1877–78) LR 7 Ch.29 , 32: “When it is not expressly stated to be subject to a formal\n                            contract it becomes a question of construction, whether the parties\n                            intended that the terms agreed on should merely be put into form, or\n                            whether they should be subject to a new agreement the terms of which are\n                            not expressed in detail.” 29     It follows that the mere fact that the parties\n                    did not expressly use the phrase “subject to contract” in either\n                    the discussions or the documents does not necessarily preclude it from being\n                    construed as such. InThomson Plaza, the court was\n                    concerned with a grant of a new tenancy which stipulated that “[t]he\n                    tenancy shall be subject to all the terms and conditions as contained in the\n                    specimen Lease Agreement. On or before commencement of the tenancy, a formal\n                    Lease of the same form as the specimen Lease Agreement shall be executed between\n                    you and the Landlord”. Although the phrase “subject to\n                    contract” was not specifically used, the court nonetheless applied the\n                    principles governing “subject to contract” cases. Selvam J\n                        at [28] held that: Parties who contract on the basis of ‘subject to contract’ do\n                        so because they want an escape route in case they wish to call the\n                        transaction off. They do not consider it a wrong way of business. It is a\n                        last-chance escape route in case they find it impossible or undesirable to\n                        fulfil the contract. Similarly, inConcorde, the agreement\n                    involved was held to be “subject to contract” although there was\n                    no express use of the phrase “subject to contract” –\n                    parties’ solicitors, in their correspondences leading up to an agreement\n                    on terms, merely expressed their intention for the subsequent execution of\n                    formal documentation. 30     Where there is anexpress\n                        stipulationthat an agreement is to be embodied in a formal\n                    written document, as in the instant case, its effect will depend on itspurpose:Von\n                        Hatzfeldt-Wildenburg v Alexander[1912] 1 Ch 284\n                        (“Von Hatzfeldt”),\n                    at 288–289. It appears to be well settled by the authorities that if the documents or\n                        letters relied on as constituting a contract contemplate the execution of a\n                        further contract between the parties,it is a question of\n                            construction whether the execution of the further contract is a\n                            condition or term of the bargain or whether it is a mere expression of\n                            the desire of the parties as to the manner in which the transaction\n                            already agreed to will in fact go through. In the former case\n                        there is no enforceable contract either because the condition is unfulfilled\n                        or because the law does not recognize a contract to enter into a contract.\n                        In the latter case there is a binding contract and the reference to the more\n                        formal document may be ignored.The fact that the\n                            reference to the more formal document is in words which according to\n                            their natural construction import a condition is generally if not\n                            invariably conclusive against the reference being treated as the\n                            expression of a mere desire… [emphasis added] 31Chitty on\n                        Contracts(H G Beale gen ed) (Sweet & Maxwell, 30th Ed,\n                    2008) Vol 1 (“Chitty”),\n                    para 2-116 lists three possible interpretations where there is anexpress stipulationthat an agreement is to be embodied\n                    in a formal written document: (a)     The agreement is regarded by the\n                        parties as incomplete, or as not intended to be legally binding, until the\n                        terms of the formal document are agreed and the document is duly executed in\n                        accordance with the terms of the preliminary agreement (eg, by signature). Example: Agreements for the sale of land\n                        by private treaty are usually made “subject to contract”\n                        – such agreements are normally regarded as incomplete until the terms\n                        of a formal contract have been settled and approved by the parties:Chitty, para 2-118;Winn v Bull(1877)\n                    7 Ch D 29. (b)     Where a document is only intended as a solemn record of an already\n                        complete and binding agreement. (c)     Where the main agreement lacks contractual force for want\n                        of execution of the formal document but that nevertheless a separate\n                        preliminary contract comes into existence at an earlier stage,eg, when one party begins to render services\n                        requested by the other, so that under this contract, the former party will\n                        be entitled to a reasonable remuneration for those services. Conversely, an\n                        agreement that originally lacked contractual force for want of execution of\n                        a formal document may acquire such force by reason of supervening events.\n                        This could, for example, be the position where “it can be objectively\n                        ascertained that the continuing intention [sc. not to be bound until\n                        execution of the document] of the parties changed or … subsequent\n                        events have occurred whereby the non-executing party is estopped from\n                        relying on his non-execution”. SeeChevernyat [46]. The third category is relevant to\n                    the issue of estoppel by convention which will be separately dealt with below.\n                    The issue for now is whether the present case falls into the first or second\n                    category. 32     The Australian courts have expanded the\n                    various factual scenarios which can possibly arise in connection with the\n                    requirement of a formal contract. The High Court of Australia inMasters vCameron91 CLR 353 at 360 referred to three situations excluding\n                    estoppel: Where parties who have been in negotiation reach agreement upon terms of a\n                        contractual nature and also agree that the matter of their negotiation shall\n                        be dealt with by a formal contract, the case may belong to any of three\n                        cases. It may be one in which the parties have reached finality in arranging\n                        all the terms of their bargain and intend to be immediately bound to the\n                        performance of those terms, but at the same time propose to have the terms\n                        restated in a form which will be fuller or more precise but not different in\n                        effect. Or, secondly, it may be a case in which the parties have completely\n                        agreed upon all the terms of their bargain and intend no departure from or\n                        addition to that which their agreed terms express or imply, but nevertheless\n                        have made performance of one or more of the terms conditional upon the\n                        execution of a formal document. Or, thirdly, the case may be one in which\n                        the intention of the parties is not to make a concluded bargain at all,\n                        unless and until they execute a formal contract. In each of the first two cases there is a binding contract: in the first\n                        case a contract binding the parties at once to perform the agreed terms\n                        whether the contemplated formal document comes into existence or not, and to\n                        join (if they have so agreed) in settling and executing the formal document;\n                        and in the second case a contract binding the parties to join in bringing\n                        the formal contract into existence and then to carry it into execution. Of\n                        these two cases the first is the more common… 33     A fourth permutation was postulated by the\n                    Supreme Court of New South Wales inCiavarellav Polimeni2008 NSWSC 234\n                        at [97]: … where the parties were content to be bound immediately and\n                        exclusively on the terms which they had agreed upon whilst expecting to make\n                        a new contract in substitution for their first contract, containing, by\n                        consent, additional terms. 34     The fourth scenario clearly has no relevance\n                    here. The critical inquiry in resolving the applicable scenario is to determine\n                    from the objective evidence whether the parties intended to beimmediately boundto perform on the agreed terms or to\n                    defer legal relations until formal execution of the written contract. Immediacy\n                    of performance is the key consideration. 35     Counsel for Mr Wong, Mr Chew Kei-Jin\n                    (“Mr Chew”) asserted that on its face, the Term Sheet clearly\n                    requires the Supplemental Agreement to be executed in order to give effect to\n                    the changes. In my view, such a provision has the same effect as “subject\n                    to contract”. This is no different in substance from the clause inThomson Plazawhich likewise required the\n                    lease to be signed in order to give effect to the tenancy which was already\n                    agreed to be in the same form as the specimen lease. Even if I am left in any\n                    doubt about the construction of the provision, the conduct of the parties can\n                    and should be examined to determine the parties’ intention and purpose in\n                    inserting that provision in the Term Sheet. In this regard, the conduct of the\n                    parties, in particular OCIA (as described in detail in[56]–[84]below), was\n                    entirely consistent with its own understanding that legal relations were\n                    deferred until execution of the Supplemental Agreement. 36Chevernyprovides some guidelines for determining when a particular case falls into any\n                    of the scenarios. At [42], it was\n                    stated: … With exceptions immaterial to this case, it is possible to make a\n                        contract orally.But the more complicated the subject\n                            matter the more likely the parties are to want to enshrine their\n                            contract in some written document to be prepared by their\n                            solicitors.This enables them to review all the terms before\n                        being committed to any of them. The commonest way of achieving this ability\n                        is to stipulate that the negotiations are ‘subject to\n                        contract’… [emphasis added] 37     As noted earlier, both parties were not\n                    separately represented in the drafting or preparation of the Supplemental\n                    Agreement. Instead, a common set of solicitors was employed. Both parties had\n                    clearly agreed that formal written agreements were to be prepared“to effect necessary changes”and\n                    arrangements were made for their execution. Further, this case also involves a\n                    commercial transaction of some complexity and of a considerably large value.\n                    This is especially compelling in the present case because the Supplemental\n                    Agreement seeks to amend an existing written agreement,ie, the RPA. 38     OCIA advanced several points in its attempt to\n                    persuade me that there is no relevant “subject to contract” issue\n                    in the case before me. From the evidential perspective, Mr Tong submitted\n                    that there was no mention whatsoever during the 23 June 2009 meeting that\n                    the agreement was “subject to contract”. This is strictly correct\n                    but the point is neither here nor there especially since the requirement for a\n                    signed Supplemental Agreement was expressly stated in the Term Sheet. From the\n                    pleading point of view, Mr Tong raised (for the first time) in his\n                    Supplemental Closing Submissions that Mr Wong did not specifically plead\n                    that the Term Sheet was “subject to contract”. This is strictly\n                    incorrect as Mr Wong did plead in para 18 of the Defence (Amendment No\n                    3) that the agreement was subject to “a formal written contract being\n                    signed” as envisaged by the Term Sheet. 39     Insofar as his submissions on the law,\n                    Mr Tong relied on a number of authorities in support of the proposition\n                    that “unless parties are found to have clearly agreed that no legal\n                    relations are to be had without a further step, the Courts can find that the\n                    parties are immediately bound even if they do contemplate a formal agreement in\n                    writing”. The holdings by Lord Blackburn and Lord Gordon inRossiter v Miller(1877–78) LR 3 App Cas 1124 (“Rossiter”) are cited in support of OCIA’s\n                    argument. Lord Blackburn stated, at 1151: I quite agree with the Lords Justices that (wholly independent of the\n                        Statute of Frauds)it is a necessary part of the\n                            Plaintiff's case to shew that the two parties had come to afinaland\n                            complete agreement, for, if not, there was no contract. So\n                        long as they are only in negotiation either party may retract; and though\n                        the parties may have agreed on all the cardinal points of the intended\n                        contract, yet, if some particulars essential to the agreement still remain\n                        to be settled afterwards, there is no contract. The parties, in such a case,\n                        are still only in negotiation. But the mere fact that the parties have\n                        expressly stipulated that there shall afterwards be a formal agreement\n                        prepared, embodying the terms, which shall be signed by the partiesdoes not, by itself, shew that they\n                        continue merely in negotiation. It is a matter to be taken into account in\n                        construing the evidence and determining whether the parties have really come\n                        to a final agreement or not.But as soon as\n                        the fact is established of the final mutual assent of the parties so that\n                        those who draw up the formal agreement have not the power to vary the terms\n                        already settled, I think the contract is completed. [emphasis added in italics and bold italics] Lord Blackburn’s holding merely reinforced the fundamental\n                    principle that the burden falls upon the party asserting the existence of a\n                    contract to show that the parties had come to “afinaland complete agreement” and the mere fact that\n                    parties have expressly stipulated that a formal agreement is required to be\n                    executed “does not,of\n                        itself” show that the parties are still in\n                    negotiations. 40     Lord Gordon stated, at 1154: I concur with your Lordships in thinking that the judgment come to by the\n                        Lords Justices of Appeal is erroneous. I think that the correspondence\n                        founded on, constituted a completed contract for the purchase and sale of\n                        the lots in question, at the price stipulated, and on the conditions\n                        specified in the conditions and stipulations printed on the plan.No doubt these conditions provided for a subsequent and formal\n                            deed being executed by the parties; but that deed was only for the\n                            purpose of more formally setting forth the conditions upon which the\n                            parties had agreed.If there was anything introduced into the\n                        proposed deed, which the purchaser considered beyond the terms and\n                        conditions on which he purchased the property, he would have been entitled\n                        to object, and, if necessary, the proper terms of the deed could have been\n                        adjusted at the sight of a Court of Law. But in my viewthe contractbetween the partieswas\n                            concluded by the correspondence and the conditions which were referred\n                            to and embodied in it… [original emphasis in italics; emphasis added in bold italics] Similarly, Lord Gordon’s decision was based on a finding\n                    that the agreement was alreadyconcludedprior to\n                    formal execution. It is important to bear in mind thatRossiterdid not actually concern a “subject to\n                    contract” issue in the first place. The conditions of the offer to sell\n                    the property expressly stipulated: “Each purchaser will be required to\n                    sign a contract embodying the foregoing conditions”. Lord Cairns who\n                    delivered the main judgment had this to say about the import of that condition\n                    in the context of the correspondence exchanged between the parties: I assume that the construction put by him upon the letter I have quoted\n                        was a proper construction, and I entirely acquiesce in what he says, that if\n                        you find, not an unqualified acceptance of a contract, but an acceptance\n                        subject to the condition that an agreement is to be prepared and agreed upon\n                        between the parties, and until that condition is fulfilled no contract is to\n                        arise, then undoubtedly you cannot, upon a correspondence of that kind, find\n                        a concluded contract. But, I repeat, it appears to me\n                            that in the present case there is nothing of that kind; there is a clear\n                            offer and a clear acceptance.There is no\n                            condition whatever suspending the operation of that acceptance until a\n                            contract of a more formal kind has been made. [emphasis added] 41     The House of Lords found that everything\n                    essential to the completion of the agreement had appeared in the written\n                    correspondence exchanged between the parties. An offer was made by the purchaser\n                    which was accepted by the vendors. The purchaser was then under the impression\n                    that the vendors were making a fresh condition in their purported acceptance;\n                    the vendors answered that they were not, and again accepted the same offer. The\n                    purchaser’s solicitors wrote to the vendors: “We shall advise [our\n                    client] that what has occurred creates, as you maintain, a contract mutually\n                    binding”. 42     Next, Mr Tong relies on the Privy\n                    Council’s decision inElias v George Sahely & Co\n                        (Barbados)[1983] 1 AC 646 (“Elias”). In that case, the plaintiff and the defendant\n                    made an oral agreement for the sale of premises to the plaintiff. On the same\n                    day, the plaintiff's solicitor wrote to the defendant's solicitor confirming the\n                    oral agreement and setting out its terms. He enclosed a cheque for 10 percent of\n                    the agreed price describing it as a deposit which he directed should be held by\n                    the defendant's solicitor as stakeholder pending completion of the contract of\n                    sale. The defendant's solicitor signed and sent a receipt which stated that he\n                    had received the money as deposit for the property“agreed to be sold”by the defendant to the\n                    plaintiff. This case is of no assistance in the present dispute as there was no\n                    express stipulation requiring the execution of a written contract. The principal\n                    issue before the Privy Council was whether the letter enclosing the deposit\n                    together with the receipt for the deposit constituted sufficient memorandum for\n                    the purposes of the Statute of Frauds given that no written contract was signed\n                    by the parties. This issue does not arise here. 43     InPRA Electrical Pty Ltd v\n                        Perseverance Exploration Pty Ltdand Anor\n                    [2007] VSCA 310 (“PRA”),\n                    another case cited by Mr Tong, the parties negotiated a detailed agreement\n                    over a six-week period, and it was an agreement of considerable commercial\n                    import following a tender. The negotiations led to a written award of the\n                    contract setting out the terms and conditions which was accepted in writing by\n                    the contractor. It was, however, a term of the award that the contract did not\n                    come into effect until the formal execution of an instrument of agreement.\n                    However, without waiting for the execution of the formal agreement, the\n                    contractor in fact entered upon the works programme contracted for, and the\n                    employer facilitated it doing so. The contractor also furnished the bank\n                    guarantee in accordance with the award which was also accepted by the employer.\n                    Further, the contractor commenced work at the site and in the course of the\n                    works and even after the contractor was ejected from the site, both parties\n                    repeatedly referred to and relied upon aspects of the documentation listed in\n                    the letter by which the contract was awarded. In fact, the employer wrote to the\n                    contractor stating that it was in “breach of our contract conditions in\n                    regards to the issuing of our Payment certificate”. The Court of Appeal\n                    of the Supreme Court of Victoria inPRAfound\n                    under these explicit circumstances that a contract was implied between the\n                    parties in the terms of the award notwithstanding the omission to execute the\n                    instrument of agreement and that the parties had by their conduct waived the\n                    requirement of formal execution. Parties can by their conduct waive reliance on\n                    the “subject to contract” term. SeeRTS\n                        Flexible Systems LtdvMolkereiAlois Muller GmbH & Co\n                        KG (UK Production)[2010] 1 WLR 753 at [56], cited with approval inNorwestat [24]. No such point was however pleaded or raised by OCIA. In\n                    any event, there is simply no evidence to support any waiver. As explained\n                        in[16]above, nothing happened\n                    between the parties after Mr Wong agreed to the appointment of Shook Lin\n                    & Bok (Malaysia) till the time when the documentation was\n                prepared. 44     In each of these three cases (Rossiter,EliasandPRA), the existence of a binding agreement\n                    prior to formal execution was based on the specific facts in each of the cases.\n                    These cases do illustrate the basic point, which is uncontroversial, that\n                    parties can reach a binding contract notwithstanding the requirement for formal\n                    execution. That is a function of the court’s analysis of the objective\n                    evidence whether parties had agreed for legal relations to be immediately\n                    binding or whether parties had agreed to defer legal relations until the formal\n                    execution of the written contract. 45     It therefore leaves me now to examine the\n                    conduct of the parties prior to, at and/or subsequent to the 23 June 2009\n                    meeting to determine whether they were consistent with the existence of an oral\n                    contract with immediate binding effect.",
        "Whether a binding oral contract was concluded": "46     I begin by examining OCIA’s case given\n                    that it bears the burden to show “very strong and exceptional\n                    context” to displace theprima facieinference that the parties intended for legal relations to be deferred until the\n                    execution of the Supplemental Agreement. OCIA essentially sought to rely on two\n                    main points in its attempt to displace theprima\n                        facieinference. 47     First, OCIA emphasised that prior to the\n                    23 June 2009 meeting, it had addressed all the issues raised by\n                    Mr Wong in the Term Sheet, and that going into the 23 June 2009\n                    meeting, there were no outstanding points for negotiation. However, this only\n                    goes to show there was an agreement on the terms and does not go so far as to\n                    show that the parties had intended to be immediately bound by the oral contract\n                    following the 23 June 2009 meeting without the execution of formal\n                    documentation, especially since the Term Sheet itself specifically contemplates\n                    the requirement for the signing of the Supplemental Agreement “to effect necessary changes”. 48     Second, OCIA also stressed that Mr Wong\n                    was fully aware that OCIA was looking to exit from its investment in Frontken\n                    since February 2009 and was keen to prevent OCIA from selling the shares on the\n                    open market. Thus OCIA argued that both parties had placed utmost importance on\n                    the 23 June 2009 meeting with the objective intention to come out of the\n                    meeting with either a binding deal and then for formal documentation to be\n                    prepared, or no deal at all. There was therefore no contemplation of an\n                    agreement “subject to contract”. OCIA relied on an internal email\n                    from Mr Goh to Mr George Lee (“George”), Head of\n                    Investment Banking of OCBC and a member of the OCBC’s investment committee\n                    (“OIC”), dated 18 June 2009 at 6:08pm: Hi George, Just to inform that [Mr Wong] will be coming over to OCBC to meet\n                        with [Mr] Chua next Tuesday, 11:30am to finalize the terms of the Risk\n                        Participation extension. Note that OIC meeting is next Tuesday\n                        afternoon. Email below contains contents of OIC slides (cleared by [Mr] Chua) which\n                        we will be sending to OIC tomorrow 9.30am for approval to divest our\n                        Frontken shares and claim Risk Participation Amountin\n                            the event that Willie cannot agree to our terms. If Willie\n                        agrees, we will seek OIC’s approval for the terms (to be finalized\n                        next Tuesday morning). Regards, [Mr Goh] [emphasis added] 49     However, on a plain reading of this email, it\n                    at most goes to show that OCIA’s intention was to come out of the meeting\n                    withan agreement on the terms, or no deal at all;\n                    it does not say that the parties’ intention was to arrive at animmediatebindingagreement at the meeting. In fact, the statement “[i]f Willie agrees, we\n                    will seek OIC’s approval for the terms” contradicts the intention\n                    of a binding agreement to be concluded immediately at the meeting as it clearly\n                    expressed the necessity for OIC’s approvalafterthe meeting. 50     OCIA also highlighted the fact that there was\n                    a consensus on the terms of the Term Sheet, and that Mr Wong did not raise\n                    objections or disagreed with the same at the 23 June 2009 meeting. Further,\n                    there was no expression by any party at the meeting that the oral contract was\n                    “subject to contract”. However, again, these facts only go to show\n                    that there was an agreement on the terms. The absence of explicit reference by\n                    any party at the 23 June 2009 meeting that the agreement was\n                    “subject to contract” would not be critical as the Term Sheet\n                    itself referred to the necessity for the execution of formal\n                    documentation. 51     OCIA relied heavily on two email messages from\n                    Nicholas after the 23 June 2009 meeting: (a)     In his email dated 24 June\n                        2009, Nicholas questioned the fee estimate for the preparation of the\n                        Supplemental Agreement given “the very concise and good summary of\n                        theagreed termsthat [Mr Chua] had\n                        prepared [emphasis added]”. (b)     In his email dated 29 June 2009, Nicholas said in\n                        the context of the legal costs for the drafting of the Supplemental\n                        Agreement that the fee quote should not be so high “to just say that\n                        [Mr Wong]agreedto buy shares in a\n                        company in which he is already a substantial shareholder [emphasis\n                        added]”. In my view, these two email messages do\n                    not take OCIA’s case any further. First, they were sent in the context of\n                    negotiating the legal fees. Secondly, they merely confirmed that since\n                    Mr Wong had agreed to the Term Sheet, the legal fees for drafting the\n                    Supplemental Agreement should not be as high as that quoted. Thirdly, in the\n                    subsequent email messages of 2 and 3 July 2009, Nicholas repeated his\n                    objection to the fee quote since it was a “simple supplemental\n                    agreement” and was based on “the excellent summary” set out\n                    in the Term Sheet. These facts lend support to my finding that the words\n                    “agreed terms” were used to convey Mr Wong’s objection\n                    to the fee quote given the parties’ agreement on the terms. At best, it\n                    demonstrates that the parties had reached an agreement on the terms set out in\n                    the Term Sheet. As explained in[27]above, the fact that parties have reached an agreement on all the terms does not\n                    mean that the phrase “subject to contract”, or its equivalent,\n                    should not be given its ordinary meaning in the absence of “very strong\n                    and exceptional context” to the contrary. This is entirely consistent\n                    with OCIA’s own purpose in calling the 23 June 2009 meeting. In its\n                    own records, both prior and subsequent to the 23 June 2009 meeting, OCIA\n                    revealingly described the agreement as an “in-principle\n                    agreement”. In Mr Chua’s email to Nicholas dated 16 June\n                    2009, Mr Chua expressed the need for the meeting in order for the parties\n                    “to sign-off and [sic] an in-principle agreement”. In OCIA’s\n                    internal memorandum dated 28 July 2009, it was explicitly stated that OCIA\n                    had Mr Wong’s “in-principal [sic] agreement” to extend\n                    the Risk Participation Period and that the documentation process was underway.\n                    This was precisely the agreement that was achieved at the 23 June 2009\n                    meeting,ie, an agreement on the termsinprinciplesubject to\n                    the execution of the Supplemental Agreement to effect the “necessary\n                    changes”. After all, in the covering email attaching the Term Sheet\n                        (see[12]above), the purpose of\n                    the 23 June 2009 meeting was to “finalisethe terms” of the agreement\n                    and to commence the documentation process immediately thereafter. Conspicuously,\n                    OCIA did not describe the agreement as having beenconcluded. 52     OCIA also claimed that in reliance of a\n                    binding oral contract, it had held off selling its Frontken shares on the open\n                    market after the 23 June 2009 meeting. However, this fact is equivocal as\n                    it is equally consistent with OCIA’s expectation that the parties would\n                    eventually sign the Supplemental Agreement and not because it thought the oral\n                    contract was binding. It bears mention that OCIA likewise did not sell the\n                    Frontken sharesbeforethe 23 June 2009\n                    meeting even though its right to do so had accrued by 11 February\n                    2009. 53     OCIA also highlighted that from the receipt of\n                    the formal documentation until 28 August 2009, Mr Wong did not\n                    expressly renounce the existence of a concluded oral agreement, and had instead\n                    continued to act as if it was merely a matter of time before he would execute\n                    the formal documents, after his lawyers had verified them. Further, OCIA also\n                    relied on Mr Wong’s deceitful and opportunistic conduct in his\n                    dealings with OCIA after receipt of the formal documentation. Mr Wong\n                    deliberately avoided calls from OCIA from 6 August to 11 August 2009\n                    and admittedly lied that he had forwarded the documentation to his solicitors\n                    for review. However, these facts at most go to show that Mr Wong had acted\n                    in a morally reprehensible manner, and do not establish that a binding oral\n                    contract was reached at the 23 June 2009 meeting. The fact that\n                    Mr Wong waited till 11 August 2009 (the day after the expiry of the\n                    Risk Participation Period) to respond to OCIA is equally consistent with his\n                    understanding that he had no liability for Risk Participation after\n                    10 August 2009 and hence there was no binding oral contract. 54     It should be noted that OCIA had over six\n                    weeks from the 23 June 2009 meeting to the expiry of the Risk Participation\n                    Period on 10 August 2009 to prepare the Supplemental Agreement. Although\n                    Mr Wong did contribute to some initial delay in the appointment of\n                    solicitors, Shook Lin & Bok (Malaysia) was eventually appointed on\n                    8 July 2009, which was still over a month before the expiry date. By only\n                    sending the documents to Mr Wong on 6 August 2009, just four days\n                    prior to the expiry date with three out of those four days spanning over a long\n                    weekend, OCIA took the risk that Mr Wong might not sign the Supplemental\n                    Agreement prior to the expiry of the Risk Participation Period. Had OCIA acted\n                    more efficiently and promptly in forwarding the formal documentation to\n                    Mr Wong for his execution, it would have had sufficient time to react and\n                    to arrange for an open market sale of the shares should Mr Wong decline to\n                    sign it. In fact, this was the evidence of Mr Chua – if Mr Wong\n                    had declined to sign soon after the 23 June 2009 meeting, OCIA would have\n                    sold its Frontken shares on the open market. Having taken the risks of\n                    (a) sending the documents late in the day and (b) hoping that\n                    Mr Wong would execute the documents within the short time-frame on or\n                    before 10 August 2009, OCIA, regrettably, only has itself to blame when\n                    Mr Wong took advantage to wait out the expiry of the Risk Participation\n                    Period. In the words of Mr Tong during the Oral Closing Submissions,\n                        “along the way the ball was dropped on getting the\n                        thing done”. 55     Mr Wong’s behaviour inrefusing or failing to respond between 6 and\n                    10 August 2009 and in misleading OCIA into believing that his lawyers were\n                    reviewing the formal documentation might have been morally reprehensible but as\n                    stated by Gill J inLow KarYit, that is not a relevant consideration: In the result I have reluctantly come to the conclusion that there was no\n                        concluded contract between the parties to this action. I say \"reluctantly\"\n                        because of the conduct of the defendants in breaking off the negotiations\n                        when the terms of the proposed agreement were agreed upon and in\n                        capriciously refusing to sign the agreement. However, in the words of\n                        Tomlin J. inLockett v. Norman\n                            Wright,supra, \"it is no\n                        part of my duty to pronounce whether or not the conduct of any of the\n                        parties concerned in this matter is open to censure. All I have to do is to\n                        determine whether there is or is not a concluded contract between the\n                        plaintiffs and the defendants which the plaintiffs can\n                        enforce\"… Similarly, Selvam J inThomson\n                        Plazaobserved at [26]: The law with regard to a commercial contract between hard-nosed\n                        businessmen is that, save in extreme cases, the court must not rewrite what\n                        the parties have agreed simply by relying on the court's notions of\n                        unreasonable or unconscionable conduct. To do so would undermine certainty\n                        and security in the law of contract. 56     Accordingly, I find that OCIA had failed to\n                    adduce sufficient evidence to displace theprima\n                        facieinference. This becomes even clearer upon consideration of\n                    Mr Wong’s submissions. Mr Chew relied on four key points in\n                    support of his submission that the objective intention of the parties was\n                    plainly for the agreement to be legally binding only when the Supplemental\n                    Agreement is duly executed in accordance with the Term Sheet: (a)the fact that the approval of OIC had to be\n                            obtained after the 23 June 2009 meeting and before OCIA could\n                            proceed with the preparation of the Supplemental\n                        Agreement;(b)the manner of the operation of the Supplemental\n                            Agreement both under its terms and in practice;(c)the course of dealing between the parties;\n                            and(d)OCIA’s absence of belief in the existence\n                            of a binding oral contract post the 23 June 2009 meeting and prior\n                            to the commencement of this suit.Approval of OCBC’s investment committee\n                (“OIC”)57     Approval by OIC on any proposal discussed\n                    between OCIA and Mr Wong was always contemplated. In OCIA’s Quarterly\n                    Review dated 16 April 2009, it was expressly stated that if Mr Wong is\n                    agreeable to the proposal, OCIA “will seek OIC’s approval before\n                    proceeding to documentation.” This was repeated in an email dated\n                    18 June 2009 which was sent by Mr Goh to Mr Chua shortly before\n                    the 23 June 2009 meeting wherein Mr Goh said that if Mr Wong\n                    “is agreeable, we will seek OIC’s approval on those\n                    terms”.58     The fact that OIC’s approval was\n                    required is also corroborated by the slides which were prepared for OIC\n                    immediately after the 23 June 2009 meeting. One of the slides specifically\n                    stated:APPROVAL SOUGHTOIC’s approval is sought to:-    approve above proposed terms (including sale of our\n                            3.7M Frontken shares to [Mr Wong] at RM0.54 a share);\n                        and-    authorise [George] to approve on the final details\n                            of divestment.59     Further, the minutes of the OIC meeting\n                    described the terms set out in the Term Sheet as “proposed terms”\n                    and conspicuously made no reference to any oral contract having been concluded\n                    with Mr Wong at the 23 June 2009 meeting.60     The email which was sent by OCIA immediately\n                    after the OIC meeting is also consistent with the fact that OIC’s approval\n                    is necessary and is not a mere formality. In Mr Goh’s email dated\n                    24 June 2009, he added that “…we wish to inform you that we\n                    just got OIC approval to extend the Risk Participation Period for Frontken from\n                    July 2010 until as long as we hold shares in Frontken. We are now going into\n                    documentation on a supplementary agreement”.61     Any residual doubt (which I did not entertain)\n                    as to the requirement of OIC’s approval was effectively removed through\n                    the evidence of Mr Goh in cross-examination:Q    So if [Mr Wong] agrees to the terms, you will\n                            then go up to OIC and get OIC’s approval, right, on those terms.\n                            That is what it says [at 3AB 902] correct?A    Yup....Q    … So if Mr Wong is agreeable, you will\n                            then ask OIC for approval and then if OIC gives its approval, you will\n                            then proceed to documentation. Is that the correct sequence or would\n                            that have been the sequence?A    Yah....Q    … So again, it’s very clear here that\n                            you need OIC’s approval after Willie agrees.\n                        Correct?A    Yah....Court .... Mr Chew’s question is: If that\n                            is right, then it really doesn’t matter whether OIC’s\n                            approval is obtained. Because if it’s obtained, good, fine and\n                            dandy. If it’s not obtained, it’s just too bad, we still\n                            have to proceed. That’s your view, right? So do you agree with\n                            Mr Chew that it doesn’t matter either way whether OIC’s\n                            approval was eventually obtained? From your perspective.WitnessI would say it---it---it\n                                is---it---it matters.QIt does\n                        matter?AYah.Q    Thank you. And that is why you needed OIC approval,\n                            or you were waiting for OIC approval before going into documentation.\n                            Correct? That was part of the sequence?A    That was mmma---mmma---the trend of thought that\n                            time, yah.[emphasis added]62     As rightly pointed out by Mr Chew, as it\n                    was still necessary to obtain the approval of OIC after the 23 June 2009\n                    meeting before OCIA could proceed with the preparation of the Supplemental\n                    Agreement, it would follow that it was still open to OIC to either withhold its\n                    approval or to request for further amendments to the terms of the agreement,\n                    such that the agreement reached at the 23 June 2009 meeting could not be\n                    said to have immediate binding effect upon OCIA or Mr Wong. The fact that\n                    George was kept abreast of the negotiations with Mr Wong prior to the\n                    23 June 2009 meeting and that OIC’s approval was in fact given in the\n                    afternoon of 23 June 2009 after the meeting did not rule out the\n                    possibility that OIC could still have withheld its approval. It is equally\n                    immaterial that Mr Wong was not aware of the requirement for OIC’s\n                    approval as it shows that OCIA could not have intended for legal relations to be\n                    immediately binding given their knowledge that OIC’s approval was\n                    necessary. After all, according to Mr Goh, the approval of OIC\n                        “does matter”. Therefore, in my\n                    view, an oral binding contract did not come into being at the 23 June 2009\n                    meeting prior to the obtaining of OIC’s approval.Manner of operation of the agreement63     The provisions of the Term Sheet and the\n                    conduct of the parties post the 23 June 2009 meeting likewise support the\n                    inference that the agreement is to have binding effect only after the execution\n                    of formal documentation.64     In addition to the express term requiring\n                    “[a] Supplemental Agreement to be executed toeffect\n                        necessary changes”, another provision in the Term Sheet\n                    states: “Shareholder shares in [Frontken] shall be pledged to [OCIA]upon the signing of Agreement”. As\n                    mentioned earlier, Mr Wong was required to pledge Frontken shares as\n                    security for his potential liabilities under the Supplemental Agreement. The\n                    requirement and obligation on Mr Wong to pledge his shares only arises upon\n                    the signing of formal documentation. It therefore lends further support to the\n                    inference that the agreement is to have binding effect only upon such\n                    execution.65     Further, another key provision of the Term\n                    Sheet was that OCIA would sell to Mr Wong 3,703,704 Frontken shares in five\n                    tranches. The first tranche was stipulated to be sold on 31 July 2009, some\n                    five weeks after the 23 June 2009 meeting. However, there was no attempt by\n                    OCIA to sell the first tranche to Mr Wong when the date arrived. There was\n                    no correspondence whatsoever from OCIA in relation to the sale of the first\n                    tranche as would be expected if OCIA had regarded the oral contract to be\n                    immediately binding following the 23 June 2009 meeting. Instead, in the\n                    Sale and Purchase Agreement prepared by OCIA’s legal department which was\n                    sent to Mr Wong on 6 August 2009 together with the Supplemental\n                    Agreement, the date for the sale of the first tranche wasunilaterallychanged by OCIA from 31 July 2009 to\n                    15 August 2009, which was five days after the expiry of the Risk\n                    Participation Period.66     If there was indeed an oral binding contract\n                    concluded on 23 June 2009, OCIA would have taken steps to sell the first\n                    tranche on 31 July 2009. As the Term Sheet stipulated aneffectivesale price of RM 0.54 per share (as Mr Wong is\n                    required to compensate for the difference between Market Price and RM 0.54),\n                    which was OCIA’s average cost per share and was significantly higher than\n                    the market price as well as the floor price per share at that time, OCIA would\n                    have reduced its risk exposure significantly by proceeding with the sale.\n                    Further, it is trite that the terms of a concluded contract can only be varied\n                    by mutual agreement (Chitty, para 22-032);\n                    however, the consent of Mr Wong to the change in the date for the sale of\n                    the first tranche was never procured. While at common law a contract may validly\n                    confer on one contracting party the power to unilaterally vary the contract\n                        (Chitty, para 22-039), there was no such\n                    provision in the agreement here. It is irrelevant that the amendment caused no\n                    prejudice to Mr Wong or that it was in fact “beneficial” in\n                    deferring the purchase date. Instead, OCIA’s failure to sell the first\n                    tranche and its subsequent amendment of the date of sale for the first tranche\n                    evidenced two things: (a) the terms agreed on 23 June 2009 were not\n                    regarded as immediately binding as they could still be amended, and\n                    (b) OCIA viewed the agreement as binding only after its final execution,\n                    and having failed to have the contract executed before 31 July 2009, it\n                    stipulated a new transaction date of 15 August 2009 for the first tranche.\n                    The other difficulty with the unilateral amendment in respect of the sale of the\n                    first tranche is that it necessarily implies that Mr Wong would be in\n                    breach of contract if he fails to purchase the first tranche on 15 August\n                    2009. How could Mr Wong be in breach of a term which he never agreed\n                    to?67     When questioned on OCIA’s omission to\n                    sell the first tranche on 31 July 2009, Mr Goh offered the following\n                    explanation:Q:Can you explain to us why there was no such sale of\n                            the shares to Mr Wong on 31stof July\n                            2009?A:We wanted to---first on our mind is to get the\n                            documentation signed. So---er, er, and then we thought he would execute\n                            it after the signing of the documentation and---and we don’t see\n                            any detriment ah to him lah by not buying, er, slightly earlier---I mean\n                            or slightly later.The first part of Mr Goh’s explanation is unhelpful to\n                    OCIA’s case – the priority placed on the execution of the contract\n                    over an immediate opportunity to reduce OCIA’s risk exposure goes to show\n                    that OCIA had treated the agreement as having legal effect only upon formal\n                    execution. The second part of Mr Goh’s explanation is unconvincing\n                    – it is difficult to believe that OCIA was willing to postpone the sale\n                    because there was no detriment to Mr Wong. This isnon\n                        sequiturto OCIA’s omission to sell the first tranche\n                    shares.68     Furthermore, the preamble in the Term Sheet\n                    referred to a disclaimer which reads as follows:THIS PROPOSAL IS TO BE USED FOR CONTINUED DISCUSSIONS, AND DOES NOT\n                        CONSTITUTE A COMMITMENT OF OCBC BANK TO LEND, INVEST OR AN AGREEMENT OF OCBC\n                        BANK TO PREPARE, NEGOTIATE, EXECUTE OR DELIVER SUCH A COMMITMENT... THE\n                        TERMS AND CONDITIONS OF THIS PROPOSAL...MAY BE MODIFIED\n                            OR SUPPLEMENTED BY OCBC BANK IN ITS SOLE DISCRETION AT ANY TIME AND FROM\n                            TIME TO TIME DURING THE COURSE OF ITS DUE DILIGENCE AND CREDIT APPROVAL\n                            PROCESSOR AS A RESULT OF CHANGED MARKET CONDITIONS OR\n                        OTHERWISE…[emphasis in bold added]69     The above disclaimer was inserted by OCIA in\n                    the Term Sheet for the purpose of the 23 June 2009 meeting. The disclaimer\n                    was added because OCIA knew that the proposal required the approval of OIC and\n                    that OIC may modify the proposal as it deems fit. This is again entirely\n                    consistent with the fact that the proposal was submitted to OIC for approval\n                    immediately after the 23 June 2009 meeting. This is a point of some\n                    significance which is to be contrasted with the court’s finding inPRAat [33] that “neither party was at liberty to insert in the\n                    conformed contract document a term which had not been agreed prior to the award\n                    of the contract”. It is no surprise that inRossiterat 1151, a similar observation which led the House\n                    of Lords to find that a binding contract was concluded was “that those\n                    who draw up the formal agreement have not the power to vary the terms already\n                    settled”.70     The fact that no binding oral contract was\n                    concluded at the 23 June 2009 meeting can also be inferred from the\n                    complete absence of any reference in the Supplemental Agreement to the alleged\n                    oral contract of 23 June 2009 notwithstanding the recital of the background\n                    facts. In fact, cl 7.6 of the Supplemental Agreement states that it\n                    “shall be effective as of the date hereof irrespective of the diverse\n                    dates upon which the respective parties may have executed [it]”.That\n                    certainly does not relate back to 23 June 2009.Course of dealing between the parties71     The course of dealing between the parties also\n                    reveals that the parties have dealt with each other on the basis that agreements\n                    are legally binding only upon formal execution. This was the common\n                    understanding of the parties with respect to the RPA, the very document which\n                    the Supplemental Agreement sought to amend.72     For the RPA, a draft dated 5 July 2007\n                    was sent to Mr Wong and the terms of the draft were presumably agreed some\n                    time shortly thereafter. The RPA was eventually executed on 20 July 2007.\n                    The evidence shows that this was the date treated by the parties as the date on\n                    which binding legal relations came into being:(a)     First, in the Affidavits of\n                        Evidence-in-Chief (“AEICs”) of all three witnesses for OCIA\n                        (Mr Chua, Mr Goh and Vincent), it was common ground that OCIA and\n                        Mr Wong entered into the RPA on 20 July 2007.(b)     Secondly, Vincent’s evidence\n                        during cross-examination was that if Mr Wong had not signed the RPA on\n                        20 July 2007, OCIA would not have proceeded with its purchase of\n                        Frontken shares on 24 July 2007:Q:Right. So let me ask you this, if Mr Wong had\n                            not signed the [RPA] on the 20thof July,\n                            even though instructions had been given to the lawyers to prepare the\n                            execution copy, would OCIA have proceeded and accepted the placement\n                            shares on the 24thof July?A:Er, probably not.Q:Probably not. Probably not because he hadn’t\n                            signed it, correct?A:Er, yes.73     Further, the evidence was that the usual\n                    business practice of OCIA was to act on executed documents, and not on oral\n                    agreements. This was confirmed by Mr Goh in cross-examination:Q:Can you tell me if the bank, OCBC or OCIA, is\n                            generally in the habit of acting on oral agreements?…A:The---the bank’s practice is to have document\n                            [sic].This is most probably true of most, if not all, financial\n                    institutions and reinforces the inference that the common understanding between\n                    OCIA and Mr Wong was that any agreement would only be legally binding when\n                    formal documents are executed as expressly provided for under the Term\n                    Sheet.OCIA’s conduct is consistent with its absence of belief in the\n                existence of a binding oral contract74     In addition, Mr Chew also raised three\n                    material facts to demonstrate OCIA’s own absence of belief of a binding\n                    oral contract concluded at the 23 June 2009 meeting:(a)     OCIA’s attempts to salvage the\n                        agreement after the expiry of the Risk Participation Period, including\n                        –(i)requesting that Mr Wong sign a\n                                “Letter of Extension” in order to extend the Risk\n                                Participation Period; and(ii)negotiating with Mr Wong to restructure\n                                the deal.(b)     Evidence of\n                        OCIA’s representatives under cross-examination indicating their\n                        absence of belief in the existence of a binding oral contract reached at the\n                        23 June 2009 meeting.(c)     The urgency with which OCIA treated the execution of the\n                        Supplemental Agreement in view of the impending expiry of the Risk\n                        Participation Period.75     Before examining the evidence which supports\n                    OCIA’s absence of belief of a concluded oral contract at the 23 June\n                    2009 meeting, I should make clear that the absence of such belief,of itself, is not strictly decisive. As observed by\n                    Michael Black QC sitting as a Deputy Judge inKvaerner\n                        Construction Ltd v Eggar (Barony) Ltd[2000] All ER (D) 1157 (“Kvaerner”), “its only value is as an echo of an\n                    earlier intention, it cannot stand alone”.76     After the expiry of the Risk Participation\n                    Period on 10 August 2009, OCIA requested Mr Wong to sign a\n                    “Letter of Extension” in order to extend the Risk Participation\n                    Period until 31 August 2009. Subsequently OCIA sought to amend the\n                    “Letter of Extension” to grant an indefinite extension to the Risk\n                    Participation Period until the execution of the Supplemental\n                Agreement.77     However, under the Term Sheet, the Risk\n                    Participation Period would be “[i]n force immediately following\n                    Restricted Period (1 July 2010)for as long as [OCIA]\n                        continues to hold its Frontken shares[emphasis added]”.\n                    As such, if a binding oral contract on the terms of the Term Sheet was reached\n                    at the 23 June 2009 meeting, there would have been no need for an extension\n                    of the Risk Participation Period as it would already have been extended\n                    indefinitely. Instead, OCIA’s attempts to obtain an interim extension\n                    prior to execution revealed that OCIA did not itself believe that there was\n                    already a binding oral contract in place. Further, in Mr Chua’s email\n                    to Mr Wong on 21 August 2009, the stated reason for the Letter of\n                    Extension was for the positions for the parties “to remainstatus quo(as at 10/8/09) until we sign the new\n                    supplemental agreement”. This contradicts OCIA’s case as it\n                    suggests that contractual relations between the parties were intended to change\n                    (to that governed by the Term Sheet) only upon the signing of the Supplemental\n                    Agreement.78     After OCIA failed to persuade Mr Wong to\n                    sign the “Letter of Extension” or the Supplemental Agreement, a\n                    meeting with Mr Wong was arranged on 28 August 2009 wherein\n                    Mr Wong again declined to sign the Supplemental Agreement. The following\n                    email was sent by Mr Chua to Mr Wong and Nicholas on the same date,\n                    wherein a new “restructuring” proposal was mentioned as being\n                    discussed at the meeting:Dear [Mr Wong] and NicholasThank you for the meeting, it was very enlightening to understand the\n                        history of the deal.To recap, I would appreciate your confirmation on the basic principle of\n                        restructuring this deal:1.    OCBC cost per share is now brought to RM 0.47\n                            (original RM 15m)2.    Shareholding is 27,630,400 shares (RM\n                            12,986,288)3.    Current share price of Frontken RM 0.23 (RM\n                             6,354,992)4.    The understanding is that OCBC would be able to\n                            recover RM 12.98m from this restructuring with some potential\n                            upside.Initial thoughts are1.    OCBC will extend a RM 10m loan to\n                        Frontken2.    RM6.3m will be retained in a controlled account for\n                            the use of share buy back3.    OCBC will charge RM 3.7m as fees for arranging the\n                            restructuring4.    Frontken will repay a total of RM 12.98M on the\n                            loan over 3 years (preferably quarterly repayments)5.    OCBC will option to buy up to RM 10m worth of new\n                            Frontken shares at exercise price of RM 0.25 with mandatory conversion\n                            at RM 0.47Appreciate your concurrence and comments asap.Regards,[Mr Chua].79     As can be seen, this new proposal was entirely\n                    dissimilar to the agreement envisaged by the Term Sheet. The contracting parties\n                    were now OCIA and Frontken, and Mr Wong was not even a party at all –\n                    there is no sale of shares from OCIA to Mr Wong, no Risk Participation by\n                    Mr Wong and no share pledge by Mr Wong. Instead, the essence of the\n                    new proposal was a loan from OCIA for the purposes of a share buy-back by\n                    Frontken, coupled with an option for OCIA to purchase more Frontken shares. The\n                    rationale behind this new proposal was explained by Mr Chua under\n                    cross-examination:… Nicholas came up with an idea that since Frontken was going to do\n                        a restructuring, maybe, er, a share buyback, er maybe we could restructure\n                        this re---er dealso that, you know, we could still\n                            salvage something out of this…[emphasis added]80     Instead of asserting its rights under the\n                    purported oral contract, OCIA opted to pursue a new and completely distinct\n                    proposal in order to “salvage” the deal with Mr Wong. It is\n                    therefore clear that OCIA itself did not recognise that a binding contract had\n                    come into being at the 23 June 2009 meeting given the non-execution of the\n                    Supplemental Agreement. It is certainly incongruous for OCIA to extend a new\n                    loan of RM10 million to Frontken to resolve a breach of an oral contract by its\n                    CEO, Mr Wong.81     From the evidence of Mr Chua and\n                    Mr Goh under cross-examination, it is apparent that they likewise did not\n                    themselves recognise that a binding contract was concluded at the meeting on\n                    23 June 2009. The most telling evidence came from Mr Chua:Q:So if Mr Wong, after the\n                                23rdJune meeting had called you back\n                            half an hour later and said, “You know, Mr Chua, I---I---I\n                            think I---I don’t want to go through with this”, would you\n                            have said, ”It’s too late”?A:I---I would have said that, erm,\n                            “Mr Wong, er, please be prepared that I’ll be selling\n                            27 million shares into the market within the next\n                            5---with---with---within the next 2 months”.As such, if OCIA had received earlier notice that Mr Wong\n                    would not sign the Supplemental Agreement, it would have treated the RPA as\n                    still binding and the new arrangements under the Term Sheet as not binding, and\n                    would have proceeded to dispose of its shareholding in Frontken “within\n                    the next 2 months”,ie, by August 2009\n                    as provided under the RPA. The obvious inference is that the oral contract could\n                    not have been intended to be binding unless the Supplemental Agreement was\n                    executed. If OCIA had regarded the oral contract as binding, OCIA would not have\n                    sold off the shares immediately since the new Risk Participation Period would\n                    not have commenced prior to 1 July 2010 as stated in the Term\n                Sheet.82     Further, Mr Goh had also conceded under\n                    cross-examination that execution of the Supplemental Agreement is necessary for\n                    the agreement to be binding and that OCIA’s conduct was consistent with\n                    that conclusion:Q:I put it to you, Mr Goh, thatit was all along intended that for there to be any binding\n                                agreement between OCIA and Mr Wong, the parties had to enter\n                                into a written supplemental agreement. Do you agree or\n                                disagree?A:Yah.Q:You agree?A[sic]:And I put it to you that the only agreement\n                            that was reached by the parties on the 23rdof June 2009 after the meet---at the meeting was that a draft\n                            supplemental agreement be prepared on the terms that were set out in the\n                            summary. Agree or disagree?A:Yah, the supplemental to---to follow\n                            the---af---the---to follow up after the meeting....QI put it to you thatyour own\n                                conduct showed---your own conduct after\n                                    23rdof June showed that OCIA was\n                                proceeding on the basis that in order for there to be a binding\n                                supplemental agreement,[Mr Wong]\n                                needed to sign the document first. Do you agree or\n                            disagree?AYahQYou agree. And I put it to you---sorry,\n                        yes.[emphasis added]This concession by Mr Goh is quite critical since he was one of\n                    the key personnel from OCIA who was directly involved in the negotiations with\n                    Mr Wong. It is also entirely in line with the objective evidence before\n                    me.83     The fact that OCIA treated the Risk\n                    Participation Period as binding and the new arrangements under the Term Sheet as\n                    not binding until the signing of the Supplemental Agreement is also evidenced by\n                    the urgency with which OCIA treated the preparation and signing of the\n                    Supplemental Agreement in light of the impending expiry date of 10 August\n                    2009. The urgent requirement for the Supplemental Agreement to be executed can\n                    be gleaned from the following email messages:(a)     Mr Chua’s email to\n                        Mr Wong, Nicholas and Mr Goh on 24 June 2009, 1 day after the\n                        23 June 2009 meeting, in which he stated:Hi [Mr Wong] & NicholasThank you for the meeting yesterday, it was great that we were able to\n                            quickly agree on the outstanding matters. Look forward to signing of\n                            this supplementalwith the same urgency.\n                            Regards, [Mr Chua].[emphasis added](b)     After Shook Lin\n                        & Bok (Malaysia) was engaged to prepare the Supplemental Agreement,\n                        Mr Goh sent the following email to Ms Khong Mei Lin (“Mei\n                        Lin”) from the firm on 14 July 2009:Hi Mei LinHope we can get the draft tomorrow evening in view ofurgency to get client to sign on those negotiated terms\n                                soon as possible.Regards,[Mr Goh][emphasis added](c)     Another email\n                        from Mr Goh to Shook Lin & Bok (Malaysia) on 4 August 2009\n                        pressing for a revised draft of the Supplemental Agreement:Hi Mei LinI refer to our phone conversation yesterday and as indicated, need to\n                            send out the Supplemental Agreement to client soon as possible– [Risk Participation] Period expiring in next few\n                                days. Look forward to the draft this afternoon.Regards,[Mr Goh][emphasis added](d)     Repeated attempts\n                        by OCIA to contact Mr Wong after the formal documentation was sent to\n                        him on 6 August 2009.84     If there was indeed a binding oral contract in\n                    place after the 23 June 2009 meeting, the new terms regarding the Risk\n                    Participation Period would have been in force, while the original expiry date of\n                    the Risk Participation Period of 10 August 2009 superseded. The only\n                    reasonable explanation for OCIA’s repeated displays of urgency in\n                    requiring the execution of the Supplemental Agreement before 10 August\n                    2009, and more significantly its own acknowledgment of the expiry of the\n                    existing Risk Participation Period, is that no binding oral contract was reached\n                    at the 23 June 2009 meeting.85     Mr Tong, however, stressed that\n                    OCIA’s representatives being lay persons may not have fully appreciated\n                    the legal significance of their conduct and/or their language in the email\n                    messages. However, in contract law, the court is concerned with the objective\n                    intention of the contracting parties,ie, what a\n                    reasonable, ordinary observer of their conduct would think their intention was.\n                    The legal knowledge (or lack thereof) of a contracting party is irrelevant if\n                    their conduct is inconsistent with the existence of a binding oral\n                    contract.86     Mr Tong further added that employees of a\n                    bank would invariably insist on formalities and/or procedures to be complied\n                    with so that the bank will be better protected against prospective claims and/or\n                    disputes. This is precisely the point – employees (acting as agents of\n                    banks) and customers of banks typically transact on the basis that formalities\n                    are required for a binding agreement and this inference has to be displaced by\n                    compelling evidence to the contrary in the particular case.87     Having examined all the points raised by\n                    Mr Chew, I would have found that no binding oral contract was concluded at\n                    the 23 June 2009 meeting even if the burden was on\n                Mr Wong.OCIA’s alternative estoppel argument88     OCIA also relied on the doctrine of estoppel\n                    by convention, the elements of which are set out inTravista\n                        Development Pte Ltd v Tan Kim Swee Augustine and others[2008]\n                    2 SLR(R) 474:(a)the parties to a transaction acted on “an\n                            assumed and incorrect state of fact or law”;(b)the assumption is shared by both, or made by one\n                            and acquiesced in by the other; and(c)the parties are precluded from denying the truth\n                            of that assumption, if it would be unjust or unconscionable to allow\n                            them (or one of them) to go back on it.89     Estoppel by convention is further explained inChitty, para 3-107:… Such an estoppel differs from estoppel by representation and from\n                        promissory estoppel in that itdoes not depend on any\n                            representation or promise. It can arise by virtue of a common\n                        assumption which was not induced by the party alleged to be estopped but\n                        which was based on a mistake spontaneously made by the party relying on it\n                        and acquiesced in by the other party. It seems, however, that the assumptionresembles the representation required to give rise to\n                            other forms of estoppel to the extent that it must be\n                            “unambiguous and unequivocal”… [emphasis\n                        added]90     As is the case with estoppel by representation\n                    and promissory estoppel, estoppel by convention is usually considereda “shield” and not a\n                    “sword”, that is to say, it does not create any cause\n                    of action when none existed before. See Chitty, para 3-113. However, as\n                    noted by Phang JA inTeeSoonKayv\n                        Attorney-General[2007] 3 SLR(R) 133, there has\n                    been gradual recognition of the use of estoppel as a\n                    “sword”:… by invoking the doctrine of promissory estoppel, the respondent\n                        appears, whether by design or otherwise, to be utilising this doctrine as a\n                        cause of action in itself. Whether or not this is permissible is an issue\n                        that is still shrouded in some controversy. It was always assumed that such\n                        a course of action was impermissible. However, the leading Australian High\n                        Court decision ofWaltons Stores (Interstate)\n                            Limited v Maher(1988) 164 CLR 387 allowed the\n                        doctrine of promissory estoppel to be utilised as a cause of action in\n                        itself: as (in traditional terminology) a \"sword\" (as opposed to merely a\n                        \"shield\" or defence (as exemplified in the oft-cited English Court of Appeal\n                        decision ofCombe v Combe[1951]\n                        2 KB 215)). There is, in fact, some indication that even in\n                        England, a more flexible approach might be adopted. In the recent English\n                        Court of Appeal decision ofBaird Textiles Holdings\n                            Ltd v Marks & Spencer plc[2002]\n                        1 All ER (Comm) 737, for example, Sir Andrew Morritt VC did\n                        refer to the Australian High Court decision ofWaltons Stores (Interstate) Limited v Maher. Morritt VC,\n                        whilst not completely closing the door to allowing estoppel to function as\n                        the absence of precedent as well as the need for sufficient certainty (which\n                        he did not find on the facts) (seeibidat 751). The learned judge did, however, acknowledge that the House of\n                        Lords might adopt a different (and more liberal) approach in the future\n                        (at 751-752). Judge and Mance LJJ were also of a similar view:\n                        emphasising both the point from precedent as well as the desirability of\n                        distinguishing amongst the various categories of estoppel (at 753-754\n                        and at 760-763 respectively). However, in view of our decision that\n                        there are no problems relating to consideration with regard to the contracts\n                        entered into by the appellants, we do not have to decide this particular\n                        issue in the present appeal.91     The idea that estoppel can only be used as a\n                    “shield” is also somewhat mitigated by the principle that one can\n                    be estopped from denying the existence of a contract which effectively renders\n                    estoppel as an alternative “sword” in the event that an action for\n                    breach of contract fails. SeeWaltons Stores (Interstate)\n                        Limited v Maher(1988) 164 CLR 387\n                        (“Waltons Stores”);Mitsui Babcock Energy Limited v John Brown Engineering(1997) 51 Con LR 129;Kvaerner.\n                    This is the precise context in which OCIA is seeking to apply estoppel by\n                    convention in the present case.92Waltons Storesis a case of particular relevance to our present case as the High Court of\n                    Australia held that although the want of formal execution led to the absence of\n                    a binding lease agreement, the company was estopped from denying that it was\n                    bound. InWaltons Stores, a company had negotiated\n                    to lease some land from the owner. The owner was to demolish a building and\n                    construct a new one to the company's specifications. The company’s\n                    solicitor forwarded a draft lease to the owner’s solicitor to which the\n                    latter suggested certain amendments. On 7 November 1983, the owner’s\n                    solicitor told the company’s solicitor that it was essential that the\n                    agreement be concluded within the next day or so, and that the owner did not\n                    wish to demolish the building until it was clear that there were no\n                    problems with the lease. The company’s solicitor said that the company had\n                    notified him orally that the suggested amendments to the draft lease were\n                    acceptable but he would get formal instructions and would inform the\n                    owner’s solicitor the next day whether the company disagreed with any of\n                    them. He then sent the owner’s solicitor a redrafted lease incorporating\n                    the suggested amendments without objecting to the amendments on the next day or\n                    at all. On 11 November 1983, the owner’s solicitor forwarded to the\n                    company's solicitor an executed lease “by way of exchange”. The\n                    owner then began to demolish the building. About a week later the company had\n                    second thoughts about proceeding with the transaction, and after having been\n                    told by its solicitor that it was not bound to proceed unless parts\n                    were exchanged, told him to “go slow”. Shortly thereafter,\n                    the company became aware that the demolition was proceeding. Early in January\n                    1984, the owner commenced building works. The building was about 40 percent\n                    completed when on 19 January 1984, the company informed the owner that it\n                    did not intend to proceed. No communication was exchanged between the\n                    company’s solicitors and the owner’s solicitor between\n                    11 November 1983 and 19 January 1984.93     Mason CJ, Wilson, Brennan and\n                    Deane JJ. held that the company was estopped from retreating from its\n                    implied promise to complete the contract because knowing the owner had exposed\n                    himself to detriment by acting on the basis of a mistaken assumption that the\n                    contract was concluded, it was unconscionable for it to adopt a course of\n                    inaction which encouraged the owner in the course he had adopted. Deane J\n                    further held that the retention of the executed lease by the company’s\n                    solicitor and the company’s deliberate silence and inaction had caused the\n                    owner to mistakenly assume that a binding contract existed and to act on that\n                    assumption to his detriment. Gaudron J held that the company’s\n                    imprudence in failing to inform the owner that exchange might not occur caused\n                    the owner to act on the assumption that an exchange had taken place, and it\n                    would be unjust and unfair to allow departure from that\n                assumption.94     There is, however, an important distinction\n                    betweenWaltons Storesand the present case. InWaltons Stores, there was an\n                    “unambiguous and unequivocal” assumption that there was a\n                    concluded contract held by the owner which led him to go so far as to demolish\n                    the old building and construct 40 percent of the new building before being\n                    informed by the company that it did not intend to proceed. The company\n                    acquiesced in this assumption by its deliberate silence and inaction despite\n                    knowledge that the demolition work was underway. In the present case, there is\n                    no such “unambiguous and unequivocal” assumption by OCIA as\n                    regards the conclusion of a binding oral agreement. Mr Tong accepted that a\n                    finding by the court that OCIA did not intend to be bound immediately would be\n                    fatal to its alternative estoppel argument.95     As stated earlier at[74]–[84]above, the evidence shows that OCIA was mindful of the fact\n                    that the expiry date of 10 August 2009 under the existing RPA was looming\n                    and treated with some urgency the need to secure the execution of the formal\n                    documentation before that deadline. OCIA neither treated the original expiry\n                    date as having been superseded by the Term Sheet, nor treated formal execution\n                    as a mere formality. While OCIA did hold off an open market sale of its Frontken\n                    shares, that conduct is equally consistent with its understanding that the terms\n                    of the Term Sheet were more advantageous than the option of an open market sale,\n                    and its expectation that Mr Wong would eventually execute the Supplemental\n                    Agreement. However strong that expectation might be, in my view, it did not\n                    qualify as an “unambiguous and unequivocal” assumption. Instead,\n                    OCIA took the risk that Mr Wong might not sign off on the Supplemental\n                    Agreement eventually when it forwarded the finalised draft to Mr Wong with\n                    only four days of the Risk Participation Period remaining. Unfortunately for\n                    OCIA, it waited too long in finalising the draft. In the result, it did not have\n                    any sufficient time to react to Mr Wong’s refusal to sign the\n                    Supplemental Agreement and therefore must bear the unfortunate consequences of\n                    its own delay.96     As such, there is no need in the present case\n                    to decide whether estoppel by convention can be used as a “sword”\n                    as there was no common assumption that a binding oral contract existed or that\n                    the Risk Participation Period had been extended. Accordingly the estoppel\n                    argument failsin limine.Conclusion97     For all the reasons stated above, I find that\n                    nobindingoral agreement was concluded at the\n                    23 June 2009 meeting. Both parties specifically contemplated and agreed\n                    that the changes to the RPA would have to be effected by way of an executed\n                    Supplemental Agreement which was never signed by either party. In the result,\n                    OCIA’s claim is dismissed with costs.",
        "OCIA’s alternative estoppel argument": "88     OCIA also relied on the doctrine of estoppel\n                    by convention, the elements of which are set out inTravista\n                        Development Pte Ltd v Tan Kim Swee Augustine and others[2008]\n                    2 SLR(R) 474: (a)the parties to a transaction acted on “an\n                            assumed and incorrect state of fact or law”;(b)the assumption is shared by both, or made by one\n                            and acquiesced in by the other; and(c)the parties are precluded from denying the truth\n                            of that assumption, if it would be unjust or unconscionable to allow\n                            them (or one of them) to go back on it.89     Estoppel by convention is further explained inChitty, para 3-107:… Such an estoppel differs from estoppel by representation and from\n                        promissory estoppel in that itdoes not depend on any\n                            representation or promise. It can arise by virtue of a common\n                        assumption which was not induced by the party alleged to be estopped but\n                        which was based on a mistake spontaneously made by the party relying on it\n                        and acquiesced in by the other party. It seems, however, that the assumptionresembles the representation required to give rise to\n                            other forms of estoppel to the extent that it must be\n                            “unambiguous and unequivocal”… [emphasis\n                        added]90     As is the case with estoppel by representation\n                    and promissory estoppel, estoppel by convention is usually considereda “shield” and not a\n                    “sword”, that is to say, it does not create any cause\n                    of action when none existed before. See Chitty, para 3-113. However, as\n                    noted by Phang JA inTeeSoonKayv\n                        Attorney-General[2007] 3 SLR(R) 133, there has\n                    been gradual recognition of the use of estoppel as a\n                    “sword”:… by invoking the doctrine of promissory estoppel, the respondent\n                        appears, whether by design or otherwise, to be utilising this doctrine as a\n                        cause of action in itself. Whether or not this is permissible is an issue\n                        that is still shrouded in some controversy. It was always assumed that such\n                        a course of action was impermissible. However, the leading Australian High\n                        Court decision ofWaltons Stores (Interstate)\n                            Limited v Maher(1988) 164 CLR 387 allowed the\n                        doctrine of promissory estoppel to be utilised as a cause of action in\n                        itself: as (in traditional terminology) a \"sword\" (as opposed to merely a\n                        \"shield\" or defence (as exemplified in the oft-cited English Court of Appeal\n                        decision ofCombe v Combe[1951]\n                        2 KB 215)). There is, in fact, some indication that even in\n                        England, a more flexible approach might be adopted. In the recent English\n                        Court of Appeal decision ofBaird Textiles Holdings\n                            Ltd v Marks & Spencer plc[2002]\n                        1 All ER (Comm) 737, for example, Sir Andrew Morritt VC did\n                        refer to the Australian High Court decision ofWaltons Stores (Interstate) Limited v Maher. Morritt VC,\n                        whilst not completely closing the door to allowing estoppel to function as\n                        the absence of precedent as well as the need for sufficient certainty (which\n                        he did not find on the facts) (seeibidat 751). The learned judge did, however, acknowledge that the House of\n                        Lords might adopt a different (and more liberal) approach in the future\n                        (at 751-752). Judge and Mance LJJ were also of a similar view:\n                        emphasising both the point from precedent as well as the desirability of\n                        distinguishing amongst the various categories of estoppel (at 753-754\n                        and at 760-763 respectively). However, in view of our decision that\n                        there are no problems relating to consideration with regard to the contracts\n                        entered into by the appellants, we do not have to decide this particular\n                        issue in the present appeal.91     The idea that estoppel can only be used as a\n                    “shield” is also somewhat mitigated by the principle that one can\n                    be estopped from denying the existence of a contract which effectively renders\n                    estoppel as an alternative “sword” in the event that an action for\n                    breach of contract fails. SeeWaltons Stores (Interstate)\n                        Limited v Maher(1988) 164 CLR 387\n                        (“Waltons Stores”);Mitsui Babcock Energy Limited v John Brown Engineering(1997) 51 Con LR 129;Kvaerner.\n                    This is the precise context in which OCIA is seeking to apply estoppel by\n                    convention in the present case.92Waltons Storesis a case of particular relevance to our present case as the High Court of\n                    Australia held that although the want of formal execution led to the absence of\n                    a binding lease agreement, the company was estopped from denying that it was\n                    bound. InWaltons Stores, a company had negotiated\n                    to lease some land from the owner. The owner was to demolish a building and\n                    construct a new one to the company's specifications. The company’s\n                    solicitor forwarded a draft lease to the owner’s solicitor to which the\n                    latter suggested certain amendments. On 7 November 1983, the owner’s\n                    solicitor told the company’s solicitor that it was essential that the\n                    agreement be concluded within the next day or so, and that the owner did not\n                    wish to demolish the building until it was clear that there were no\n                    problems with the lease. The company’s solicitor said that the company had\n                    notified him orally that the suggested amendments to the draft lease were\n                    acceptable but he would get formal instructions and would inform the\n                    owner’s solicitor the next day whether the company disagreed with any of\n                    them. He then sent the owner’s solicitor a redrafted lease incorporating\n                    the suggested amendments without objecting to the amendments on the next day or\n                    at all. On 11 November 1983, the owner’s solicitor forwarded to the\n                    company's solicitor an executed lease “by way of exchange”. The\n                    owner then began to demolish the building. About a week later the company had\n                    second thoughts about proceeding with the transaction, and after having been\n                    told by its solicitor that it was not bound to proceed unless parts\n                    were exchanged, told him to “go slow”. Shortly thereafter,\n                    the company became aware that the demolition was proceeding. Early in January\n                    1984, the owner commenced building works. The building was about 40 percent\n                    completed when on 19 January 1984, the company informed the owner that it\n                    did not intend to proceed. No communication was exchanged between the\n                    company’s solicitors and the owner’s solicitor between\n                    11 November 1983 and 19 January 1984.93     Mason CJ, Wilson, Brennan and\n                    Deane JJ. held that the company was estopped from retreating from its\n                    implied promise to complete the contract because knowing the owner had exposed\n                    himself to detriment by acting on the basis of a mistaken assumption that the\n                    contract was concluded, it was unconscionable for it to adopt a course of\n                    inaction which encouraged the owner in the course he had adopted. Deane J\n                    further held that the retention of the executed lease by the company’s\n                    solicitor and the company’s deliberate silence and inaction had caused the\n                    owner to mistakenly assume that a binding contract existed and to act on that\n                    assumption to his detriment. Gaudron J held that the company’s\n                    imprudence in failing to inform the owner that exchange might not occur caused\n                    the owner to act on the assumption that an exchange had taken place, and it\n                    would be unjust and unfair to allow departure from that\n                assumption.94     There is, however, an important distinction\n                    betweenWaltons Storesand the present case. InWaltons Stores, there was an\n                    “unambiguous and unequivocal” assumption that there was a\n                    concluded contract held by the owner which led him to go so far as to demolish\n                    the old building and construct 40 percent of the new building before being\n                    informed by the company that it did not intend to proceed. The company\n                    acquiesced in this assumption by its deliberate silence and inaction despite\n                    knowledge that the demolition work was underway. In the present case, there is\n                    no such “unambiguous and unequivocal” assumption by OCIA as\n                    regards the conclusion of a binding oral agreement. Mr Tong accepted that a\n                    finding by the court that OCIA did not intend to be bound immediately would be\n                    fatal to its alternative estoppel argument.95     As stated earlier at[74]–[84]above, the evidence shows that OCIA was mindful of the fact\n                    that the expiry date of 10 August 2009 under the existing RPA was looming\n                    and treated with some urgency the need to secure the execution of the formal\n                    documentation before that deadline. OCIA neither treated the original expiry\n                    date as having been superseded by the Term Sheet, nor treated formal execution\n                    as a mere formality. While OCIA did hold off an open market sale of its Frontken\n                    shares, that conduct is equally consistent with its understanding that the terms\n                    of the Term Sheet were more advantageous than the option of an open market sale,\n                    and its expectation that Mr Wong would eventually execute the Supplemental\n                    Agreement. However strong that expectation might be, in my view, it did not\n                    qualify as an “unambiguous and unequivocal” assumption. Instead,\n                    OCIA took the risk that Mr Wong might not sign off on the Supplemental\n                    Agreement eventually when it forwarded the finalised draft to Mr Wong with\n                    only four days of the Risk Participation Period remaining. Unfortunately for\n                    OCIA, it waited too long in finalising the draft. In the result, it did not have\n                    any sufficient time to react to Mr Wong’s refusal to sign the\n                    Supplemental Agreement and therefore must bear the unfortunate consequences of\n                    its own delay.96     As such, there is no need in the present case\n                    to decide whether estoppel by convention can be used as a “sword”\n                    as there was no common assumption that a binding oral contract existed or that\n                    the Risk Participation Period had been extended. Accordingly the estoppel\n                    argument failsin limine.Conclusion97     For all the reasons stated above, I find that\n                    nobindingoral agreement was concluded at the\n                    23 June 2009 meeting. Both parties specifically contemplated and agreed\n                    that the changes to the RPA would have to be effected by way of an executed\n                    Supplemental Agreement which was never signed by either party. In the result,\n                    OCIA’s claim is dismissed with costs.",
        "Conclusion": "97     For all the reasons stated above, I find that\n                    nobindingoral agreement was concluded at the\n                    23 June 2009 meeting. Both parties specifically contemplated and agreed\n                    that the changes to the RPA would have to be effected by way of an executed\n                    Supplemental Agreement which was never signed by either party. In the result,\n                    OCIA’s claim is dismissed with costs."
    }
}