{
    "case_title": "Sato Kogyo (S) Pte Ltd and another\n      v\n      Socomec SA",
    "ncitation": "[2012] SGHC 76",
    "coram": "Judith Prakash J",
    "sections": {
        "Introduction": "1       This is a claim in tort for\n                    damage resulting from two fires that took place on the night\n                    of 27/28 June 2007. The second plaintiff, Singapore\n                    Telecommunications Limited (“SingTel”), is the\n                    lessee of the premises in which the fires took place. The\n                    first plaintiff, Sato Kogyo (S) Pte Ltd\n                    (“SKS”), was the main contractor employed by\n                    SingTel to carry out certain works on the premises. The\n                    defendant, Socomec SA, is the manufacturer of certain\n                    electronic items which were purchased in connection with the\n                    works. It is the plaintiffs’ case that the fires were\n                    caused by the malfunctioning of the defendant’s goods\n                    but this is denied by the defendant.",
        "Background": "",
        "Relationships between the parties and the\n                Works": "2       SingTel is the lessee of a\n                    building known as Kim Chuan Telecommunications Complex (the\n                    “Complex”). It leased the Complex for the\n                    purpose of containing a data storage facility which could be\n                    rented out to customers. SingTel subsequently (October 2006)\n                    employed SKS as its main contractor to undertake the\n                    construction, completion and maintenance of upgrading and\n                    fit out works (the “Works”) at the Complex so\n                    as to make it suitable for the intended\n                purpose. 3       The Works consisted of\n                    additions and alteration works to the first, second,\n                    seventh, eighth and tenth storeys of the Complex. Among the\n                    things which SKS had to do were to supply, install, test and\n                    commission nine generator sets, four water cooled chillers,\n                    ten oil-immersed type transformers, high tension switchgears\n                    and eight Uninterruptible Power Supply (“UPS”)\n                    systems consisting of eight UPS units and ancillary\n                    electrical components. 4       The purpose of installing\n                    the UPS systems in the Complex was to prevent, in the event\n                    of a power failure from the main supply, loss of electrical\n                    power to the computer equipment that store the database. If\n                    a power failure were to occur, the UPS systems would\n                    immediately take over the supply of electricity to the\n                    computer equipment connected to the main power supply to\n                    ensure no loss of data in the computer equipment. The UPS\n                    systems basically consist of the UPS units, batteries,\n                    battery racks, battery protection boxes, cables and\n                    connectors linking the UPS units to the main power supply,\n                    the batteries, and computers storing the\n                database. 5       The defendant is a well\n                    known and established manufacturer of UPS units in France.\n                    It has a subsidiary in Singapore, Socomec UPS Asia (S)\n                    Pte Ltd (“Socomec Asia”). In October 2006,\n                    SingTel appointed Socomec Asia as one of the subcontractors\n                    for the Works. Shortly thereafter, Socomec Asia ordered\n                    eight UPS units from the defendant for the purpose of\n                    installation in the Works as part of the UPS system. On 30\n                    January 2007, the subcontract between SingTel and Socomec\n                    Asia was novated so that SKS replaced SingTel as the\n                    purchaser. 6       The consequence of all these\n                    arrangements was that there were contractual relationships\n                    between SingTel and SKS, between SKS and Socomec Asia and\n                    between Socomec Asia and the defendant. There were no\n                    contractual relations between SingTel and the defendant or\n                    between SKS and the defendant. 7       The main contract between\n                    SingTel and SKS contained an indemnification clause\n                    (cl 18(2)) which required SKS to indemnify SingTel\n                    “against any damage, expense, liability, loss, claim\n                    or proceedings due to injury or damage of any kind to any\n                    property real or personal (including property of [SingTel])\n                    other than the Works”. The subcontract between SKS\n                    and Socomec Asia also contained an indemnification clause\n                    (cl 9.2) which required Socomec Asia to indemnify SKS\n                    “against any liability of [SKS] to indemnify\n                    [SingTel] under clause 18(2) of the Main Contract\n                    insofar as it may arise out of or in the course of or by\n                    reason of the carrying our of the Sub-Contract\n                    Works”. 8       It should be noted that as\n                    required under the main contract, SKS procured a\n                    Contractor’s All Risks Policy to cover the Works. This\n                    took effect on 1 November 2006 for the period from then\n                    to 16 October 2007. Among the co-insured under the\n                    policy were SKS, SingTel and Socomec Asia.",
        "Tests and installation of the UPS units": "9       The eight UPS units supplied\n                    by the defendant were referred to in the proceedings as UPS\n                    7-1 to UPS 7-8. Between 8 January 2007 and 18 January 2007,\n                    Automatic Tests were conducted on all eight UPS units at the\n                    defendant’s factory in France. It is not in dispute\n                    that UPS 7-8, the allegedly defective unit and cause of the\n                    two fires, passed the Automatic Test. 10     Between 14 and 18 January\n                    2007, the specific Factory Acceptance Test\n                    (“FAT”) was conducted for UPS 7-7 in the\n                    defendant’s factory in France. It is not disputed that\n                    the specific FAT was not conducted for the other seven\n                    units, including UPS 7-8, although some readings from the\n                    Automatic Tests were incorporated into the FAT report for\n                    the UPS 7-8 and accepted by SingTel’s agent,\n                    Mr Goh Soon Huat\n                (“Mr Goh”). 11     The eight UPS units were\n                    installed by Socomec Asia in Level 7 of the Complex with UPS\n                    7-2, 7-4, 7-6 and 7-8 in the UPS room of the north room and\n                    UPS 7-1, 7-3, 7-5 and 7-7 in the UPS room of the south room.\n                    The north and south rooms are at opposite sides of Level 7\n                    with the data banks in the centre and adjacent to each\n                    room. 12     The north room is divided\n                    into two “rooms” which open into each other\n                    – the UPS room which housed the four UPS units and the\n                    UPS bypass panel, and the battery room which housed the\n                    batteries, battery racks and battery protection boxes. The\n                    batteries, battery racks and battery protection boxes were\n                    supplied by third parties not connected to this\n                    action. 13     Each UPS unit was linked\n                    by four cables on overhead metal cable ladders to its own\n                    battery protection box in the battery room. From this box,\n                    eight cables were linked to its own battery in the battery\n                    room via cable ladders,ie,\n                    there were 48 cables in total above the four boxes. During\n                    the course of installation, several tests were conducted on\n                    the UPS units, the cables and the batteries.",
        "The fires": "14     On 27 June 2007,\n                    representatives of HS Inspection Pte Ltd, accompanied by\n                    representatives of Socomec Asia and Hitachi Plant\n                    Technologies Ltd, conducted infrared thermal scanning tests\n                    on the 8 UPS systems. After completion of the tests, at\n                    or around 8.20pm, the same persons witnessed sparks from the\n                    UPS room in the north room, and heard cracking and loud\n                    sounds from the top of UPS 7-8. 15     Subsequently, several of\n                    those persons present heard popping sounds and other heard\n                    popping sounds and saw sparks followed by fire erupting in\n                    the battery bank in the north room. They ran out of the room\n                    and the fire brigade was summoned. 16     Two fires broke out at\n                    that time: a fire in UPS 7-8 which localised and died out on\n                    its own and a fire in the battery room (together the\n                    “27 June fires”). The fire brigade\n                    (“SCDF”) extinguished the fire in the battery\n                    room. They then proceeded to damp down the area of the fire.\n                    The SCDF used water to put out the fire and broke windows in\n                    order to ventilate the battery room. 17     In the early hours on\n                    28 June 2007, there was a second fire (the\n                    “28 June fire”) in the battery room and\n                    the SCDF firemen who were on the scene had to douse the fire\n                    again.",
        "The claim and the defence": "18     After the fires, SKS and\n                    SingTel made claims against the insurer under the all risks\n                    policy, Tokio Marine Insurance Singapore Limited\n                    (“Tokio Marine”). Tokio Marine eventually paid\n                    out the sum of $8,157,686.26 to SKS and the sum of\n                    $450,879.04 to SingTel and thereby became subrogated to\n                    their respective rights. The amounts paid did not include\n                    the cost of replacing UPS 7-8 and the other three damaged\n                    UPS units in the north room as the same were replaced by the\n                    defendant without cost to SingTel. 19     This action was started on\n                    14 May 2009 by Tokio Marine in the names of SingTel and\n                    SKS claiming damages for the loss suffered by reason of the\n                    fires. In the statement of claim, the plaintiffs pleaded\n                    that the fires caused extensive damage to level 7 of the\n                    Complex including the four UPS units, the battery bank and\n                    other electronic and electrical components located there.\n                    The particulars of the damage were given as follows: (a)     Electrical\n                        components inside the UPS 7-8 were\n                    damaged. (b)     Electrical lighting, cables and\n                        fittings in the battery bank section were\n                        damaged. (c)     Overhead cable trays and ceilings in\n                        the battery bank section were severely damaged and\n                        partially collapsed. (d)     About 600 lead acid\n                        batteries were completely destroyed. (e)     DC panels located\n                        in the battery bank section were severely\n                        damaged. (f)     Other contents in the UPS section\n                        were damaged by sustained heat and\n                    smoke. (g)     Other areas sustained heat and smoke\n                        damage. (h)     Smoke damage to property in the\n                            2ndto the\n                            6thstoreys and\n                            9thstorey of the\n                        Complex. 20     The plaintiffs’\n                    position is that their losses were caused by the fires which\n                    in turn were caused by the defective UPS 7-8. As the\n                    manufacturer of the UPS units, the defendant owed a duty of\n                    care to the plaintiffs not to damage their property by\n                    ensuring that the UPS units supplied to SingTel were fit for\n                    the purpose intended. 21     The defendant denies\n                    liability for the loss and damage claimed by the plaintiffs.\n                    It denies that it owes a duty of care to the plaintiffs and\n                    that it has breached its duty of care; it further denies\n                    that the damage was caused by the defendant’s breach.\n                    It alleges that in any event, the plaintiffs contributed to\n                    and/or aggravated the first and/or second fires and that\n                    there was a break in the chain of causation. 22     The trial of the action\n                    was bifurcated and I therefore heard evidence relating to\n                    liability only.",
        "The issues": "23     The issues have been\n                    formulated slightly differently by each party but they can\n                    be rephrased as follows: (a)     Whether the\n                        defendant owed a duty of care to SingTel and to\n                        SKS; (b)     If so, whether the defendant had\n                        breached its duty of care by acting below the standard\n                        of care required of an ordinary skilled\n                        manufacturer; (c)     Whether the fires were caused by a\n                        failure in UPS 7-8; (d)     Whether the actions of the\n                        SCDF in breaking the windows of the battery room and\n                        letting oxygen in constituted anovusactusinterveniensand caused the 28 June\n                        fire; (e)     Whether there was contributory\n                        negligence on the part of SKS because it did not arm the\n                        FM 200 fire extinguishment system;\n                    and (f)     Whether the plaintiffs are estopped from claiming\n                        that UPS 7-8 caused the fires.",
        "The Law": "24     The elements of a claim in\n                    negligence are well established. These were restated by the\n                    Court of Appeal inSpandeck Engineering\n                        (S) Pte Ltd v Defence Science & Technology\n                        Agency[2007] 4 SLR(R) 100\n                        (“Spandeck”)\n                    at [21]: ... in order to succeed in a claim under the tort of\n                        negligence, a claimant has to establish that\n                        (a) the defendant owes the claimant a duty of care;\n                        (b) the defendant has breached that duty of care by\n                        acting (or omitting to act) below the standard of care\n                        required of it; (c) the defendant’s breach\n                        has caused the claimant damage; (d) the\n                        claimant’s losses arising from the\n                        defendant’s breach are not too remote; and\n                        (e) such losses can be adequately proved and\n                        quantified. 25     InSpandeckthe Court of Appeal decided that\n                    the two-stage test of proximity and policy considerations\n                    should be adopted to determine the existence of a duty of\n                    care in all situations, whether the damage is physical\n                    damage or pure academic loss (at [71] and [72]). It also held that\n                    this test is to be approached with reference to the facts of\n                    decided cases although the absence of such cases would not\n                    be an absolute bar against a finding of duty (at [43] and [73]).",
        "Factual foreseeability": "26     Before embarking on the\n                    two-stage test, the threshold requirement of factual\n                    foreseeability has to be satisfied. The defendant argued\n                    that it was not reasonably foreseeable that a defect in UPS\n                    7-8 would cause loss to the plaintiffs because there were\n                    several safety protection mechanisms in the form of safety\n                    fuses in the design of the UPS units which would have\n                    operated. Additionally, as regards SKS, there was no factual\n                    foreseeability that a defect in the UPS would cause loss to\n                    SKS because the defendant did not know of the existence of\n                    SKS prior to the fires. 27     I do not accept the\n                    defendant’s argument. In my judgment, it was factually\n                    foreseeable that a defect in a UPS unit which resulted in a\n                    fire could cause loss to a legitimate ultimate user in whose\n                    premises the UPS unit was installed and who had other\n                    property in the vicinity of the UPS unit. The defendant\n                    would have been well aware that any ultimate purchaser of\n                    its UPS units would install the same in constructed premises\n                    which would also contain other fixtures and fittings. The\n                    UPS units were not intended to be used outdoors. The\n                    defendant would therefore have known that any defect in a\n                    UPS unit would possibly damage the property of the end user.\n                    The fact that the defendant had provided for safety fuses in\n                    the UPS units is irrelevant. If the safety fuses worked,\n                    then no fire would have resulted and no consequent physical\n                    damage to third parties’ property would be caused. It\n                    would, however, be easily foreseeable that if the fuses did\n                    not prevent the fire, the fire could damage other physical\n                    items in the vicinity of the UPS unit. It does not matter\n                    that the defendant was not aware of SingTel’s or\n                    SKS’ identity and had no contractual relationship with\n                    them. The defendant as a manufacturer of the UPS units which\n                    were electronic items providing an uninterruptible power\n                    supply could reasonably foresee the possibility of defective\n                    units leading to fires which would be capable of causing\n                    physical damage to the property of third\n                parties.",
        "Duty of care": "Duty of care to SingTel 28     It has been settled since\n                    1932 that a manufacturer owes a duty of care to the ultimate\n                    user, at least where a defective product would cause damage\n                    to the ultimate user’s property. SeeM’alister (Or Donoghue) (Pauper) v\n                        Stevenson[1932] AC 562 (more\n                    commonly known as “Donoghue v\n                        Stevenson”);Grant\n                        v Australian Knitting Mills, Limited[1936] AC 85 (Privy Council) (“Grant”). This is established\n                    in this case since the UPS units were manufactured by the\n                    defendant and the ultimate user was SingTel. SingTel as the\n                    lessee of the Complex was the owner of the Complex and had a\n                    claim for the physical damage caused to the Complex. It was\n                    also the ultimate owner of the UPS system comprising the UPS\n                    units, the batteries, the cables and other components that\n                    were damaged in the fires. 29     To negate the existence of\n                    a duty of care in this situation, the defendant relied on\n                    the Court of Appeal decision inMan\n                        B&W Diesel S E Asia Pte Ltd and another v PT Bumi\n                        International[2004] 2 SLR(R) 300\n                        (“PT Bumi”) where the plaintiff owned\n                    an oil tanker which had been constructed by a shipyard in\n                    Malaysia and fitted with an engine built by a British\n                    manufacturer and sold to its Singapore subsidiary which then\n                    on-sold it to the shipyard. The engine broke down frequently\n                    in the course of the vessel’s operations and as a\n                    result, the plaintiff suffered a loss of income and also\n                    incurred repair costs. In its action against the defendant\n                    manufacturer and the Singapore subsidiary, the plaintiff\n                    claimed for its losses including the cost of the engine and\n                    the loss of income which it could have earned from the\n                    vessel. This claim was dismissed. The Court of Appeal held\n                    that even though the manufacturer knew that the plaintiff\n                    was the ultimate customer and that the engine was to be\n                    installed in the vessel being built for it, there was no\n                    duty of care owed to the plaintiff because the contractual\n                    arrangements between the shipyard and the Singapore\n                    subsidiary and that entity and the manufacturer had to be\n                    borne in mind (at [36] –\n                    [38]). The defendant\n                    argued that the present case was analogous toPT Bumiand on that basis, no duty\n                    of care could arise on the part of the defendant to either\n                    of the plaintiffs. 30     I disagree.PT Bumihas no application to this\n                    case. It stands for the proposition that a duty of care\n                    should not be easily extended to new situations concerning\n                    economic loss. The duty of care here is a well-established\n                    one, where the damage is not economic loss caused by a\n                    defective product (egloss of\n                    hire of a vessel (PT Bumi) or\n                    the cost of repairing and making good defects caused by a\n                    developer (RSP Architects Planners &\n                        Engineers v Ocean Front Pte Ltd[1995]\n                    3 SLR(R) 653)), but physical damage to the\n                    ultimate user’s own property caused by the defective\n                    product. 31     The difference in approach\n                    was made clear inThe “Sunrise\n                        Crane”[2004] 4 SLR(R) 715,\n                    in which the Court of Appeal found a duty of care where a\n                    transporter of nitric acid, when transferring a cargo of\n                    contaminated nitric acid to a second vessel, failed to\n                    inform the crew of the second vessel of the nature of the\n                    cargo. The second vessel was made of mild steel and\n                    incapable of carrying nitric acid, and the nitric acid\n                    caused physical damage to the second vessel. The court\n                    distinguishedPT Bumiat\n                        [35] –\n                    [37]: More importantly, there is a fundamental difference\n                        between the claim in the present action and that inBumi.Here, the claim was for direct physical\n                            damage to property; there was no attempt to extend\n                            the Donoghue principle to a new\n                        situation. InBumi, it was for pure consequential\n                        economic losses and there the shipowner and the\n                        contractor had by contract expressly provided for the\n                        remedies which would be available in the event that the\n                        vessel (and its engine) did not perform up to\n                        specifications. And that, in fact, happened. However,\n                        the engine was provided to the contractor by a\n                        sub-contractor. The court there held that the plaintiff\n                        was not entitled to claim in tort against the\n                        sub-contractor for the pure economic losses. It is clear that the law does\n                            differentiate between a claim in pure economic loss\n                            and that for personal injuries or physical damage.\n                            In respect of the former, the law is more\n                            restrictive in imposing a duty of care... Thus, the approach taken inBumican have no application to the\n                        present actionwhich came very much\n                            within the traditional mould of a claim in\n                            negligence where direct property damage was\n                            caused. [emphasis added] 32     In thePT Bumi-type situation, the court is obliged\n                    to examine the parties’ contractual relations to\n                    determine if the parties had chosen to allocate loss in a\n                    specific manner. Where the defective productcauses physical damage to the ultimate\n                        user’s own property, the duty of care\n                    is well-established and there is no need to go into long\n                    analysis based on the two-stage test. In such cases, the\n                    existence of contractual remedies is irrelevant unless there\n                    is a contractual exemption clause authorised by the ultimate\n                    user of the product to displace the pre-existing duty of\n                    care on the part of the manufacturer. 33     InGrant, Lord Wright stated\n                    at 105: It is immaterial that the appellant has a claim in\n                        contract against the retailers [who sold the defective\n                        product to the user], because that is a quite\n                        independent cause of action, based on different\n                        considerations, even though the damage may be the same.\n                        Equally irrelevant is any question of liability between\n                        the retailers and the manufacturers on the contract of\n                        sale between them. The tort liability is independent of\n                        any question of contract. 34     The court inPT BumicitedHenderson v Merrett Syndicates Ltd[1994]\n                    3 WLR 761 at 790 (“Henderson”), where Lord Goff\n                    of Chieveley stated: I put to one side cases in which\n                            the sub-contractor causes physical damage to\n                            property of the building owner, where the claim does\n                            not depend on an assumption of responsibility by the\n                            sub-contractor to the building owner; though the\n                            sub-contractor may be protected from liability by a\n                            contractual exemption clause authorised by the\n                            building owner.But if the sub-contracted\n                        work or materials do not in the result conform to the\n                        required standard, it will not ordinarily be open to the\n                        building owner to sue the sub-contractor or supplier\n                        direct... [emphasis added] 35     No such contractual\n                    exemption clause exists here. The contractual obligations on\n                    SKS to indemnify SingTel and on Socomec Asia to indemnify\n                    SKS do not indicate a clear intention to exempt the\n                    defendant from tortious liability. Duty of care to SKS 36     SKS was not the ultimate\n                    owner of the UPS units or any of the components making up\n                    the UPS system. It was the main contractor who had\n                    contracted to procure and install the UPS system and carry\n                    out the rest of the Works. The description in the statement\n                    of claim of the loss sustained by SKS was, however, somewhat\n                    ambiguous and gave the impression that SKS was making a\n                    claim for pure economic loss. 37     SKS submitted that its\n                    claim was not a claim for pure economic loss. Its claim\n                    arose out of physical damage to property of which it was a\n                    bailee and therefore it had a legal right to sue in tort for\n                    such damage. SKS emphasised that under the main contract\n                    with SingTel it was solely responsible for the Works until\n                    the Works were completed to the satisfaction of the\n                    architect. SKS relied on cll 3(3) and 20(2) of the main\n                    contract which provide as follows: Clause 3(3) ... the Works shall remain until completion at the\n                        risk of [SKS], who (subject to the receipt of any\n                        insurance monies under Clause 20 of these Conditions)\n                        shall make good at his own expense and without payment\n                        any accidental or other loss or damage thereto howsoever\n                        caused (including theft or other act of third persons),\n                        ...; Clause 20(2) Upon the occurrence of any loss or damage to the Works\n                        or unfixed materials or goods prior to completion from\n                        any cause whatsoever the Contractor shall (subject to\n                        clause 3(3) of these Conditions) proceed immediately to\n                        restore, replace, or repair the same free of charge,\n                        ... 38     SKS argued that it was\n                    clear from the clauses cited above that as between SingTel\n                    and itself, the parties had agreed that SKS was to bear the\n                    risk of loss or damage to the Works. As SKS was in sole and\n                    exclusive possession of the sections of the Complex where\n                    the Works were to be carried out and was also in possession\n                    of all the components of the Works which had been brought\n                    into those areas of the Complex, SKS was bailee of all\n                    property in the Works until the Works were handed over to\n                    SingTel upon completion. The documents that SKS had produced\n                    substantiated the assertion that the Works were handed over\n                    to SingTel by SKS on various dates after the fires. at the\n                    time of the fires, SKS was in possession of Level 7 of\n                    the Complex. It was accordingly the bailee of the chattels\n                    that were damaged by the fires being, primarily, the UPS\n                    units, the cables, cable ladders, batteries, battery\n                    protection boxes and bypass units. As the main contractor\n                    and as bailee in possession of the Works, until the Works\n                    were completed and handed over to SingTel, SKS retained\n                    possession and had the right to claim against any third\n                    party who negligently damaged the property in the\n                    Works. 39     The defendant argued that\n                    SKS could not bring an action in negligence for physical\n                    damage to property that it had no legal ownership or\n                    possessory title over and it could not bring an action for\n                    economic loss arising out of physical damage to another\n                    person’s property. It relied on the case ofLeigh & Sullivan v Aliakmon Shipping\n                        (“The Aliakmon”)[1986] AC 785 at 809 (“The Aliakmon”) for the\n                    proposition that to make a claim a claimant must have either\n                    the legal ownership of or a possessory title to the property\n                    concerned at the time when the loss or damage occurred and\n                    it is not enough for him to have had contractual rights in\n                    relation to such property which had been adversely affected\n                    by the loss or damage of the property. In that case, the\n                    claimant was the purchaser of steel that was damaged while\n                    on board the defendant’s vessel. At the time of the\n                    damage, the property in the steel still belonged to the\n                    seller though it was at the claimant’s risk under the\n                    terms of the sale contract. The claimant failed in its\n                    attempt to recover damages from the defendant as it was held\n                    to have no proprietary interest in the steel but only a\n                    contractual interest. 40     The defendant also relied\n                    on the case ofNacap Ltd v Moffat Plant\n                        Ltd[1987] SLT 221\n                        (“Nacap”) to\n                    illustrate what the term “possessory title” as\n                    used inThe Aliakmonmeans. InNacap, the plaintiffs had\n                    a contract with the British Gas Corporation (the\n                    “Corporation”) to lay pipelines which were\n                    owned by the Corporation. The pipes were handed over to the\n                    plaintiffs to be laid and due to the negligence of the\n                    defendant plant hirers, the pipelines were damaged. Under\n                    the contract, the plaintiffs were fully responsible for the\n                    care of the works and for any damage or injury to the works.\n                    The plaintiffs sued the defendant for the costs incurred by\n                    them in making good the damage to the pipelines. This claim\n                    was rejected. The court held at 223: In our opinion, although [the plaintiffs] no doubt had\n                        physical possession of the pipes while they were laying\n                        the pipeline in the sense that they handled the pipes,\n                        any possession which they had was for a limited purpose\n                        only. Any possession which they had was much less than\n                        that enjoyed by an owner or a person with a possessory\n                        right or title as recognized by the law. Any possession\n                        which the plaintiffs enjoyed was for the limited purpose\n                        of proceeding with the construction of the works.\n                        ... In our opinion, any rights which [the plaintiffs] had\n                        in relation to the pipeline arose under the terms of the\n                        contract between [the plaintiffs] and the British Gas\n                        Corporation and were thus “contractual rights in\n                        relation to such property which have been adversely\n                        affected by the loss of or damage to it”. Indeed\n                        the terms of the contract between [the plaintiffs] and\n                        the British Gas Corporation make it clear that [the\n                        plaintiffs] are given possession of the site not to\n                        enable them to enjoy any broad right of possession, but\n                        so that they may perform upon the site duties which are\n                        laid upon them under the contract. To describe [the\n                        plaintiffs’] right as “a possessory right\n                        or title” is, in our opinion, wholly inaccurate.\n                        The true description of [the plaintiffs’] rights\n                        in relation to the pipeline is that these are\n                        contractual rights. That being so, [the plaintiffs] are\n                        not persons entitled to claim in negligence for loss\n                        arising from the damage to the pipeline. 41     The defendant argued that\n                    the facts ofNacapwere very\n                    similar to those of the present case and following that\n                    case, physical possession of goods owned by some other party\n                    for example by a contractor engaged for construction\n                    purposes, does not render the contractor an owner or give it\n                    possessory title such as to entitle the contractor to make a\n                    claim for loss of or damage to the goods. A person with\n                    “possessory title” would be a person who was\n                    in a position comparable to that of the legal owner for\n                    example because he had some kind of security such as a lien.\n                    In this case, the defendant submitted, the position of SKS\n                    was essentially identical to the plaintiffs inNacap. Therefore, since SKS had\n                    confirmed that its entire claim arose in respect of items\n                    that belonged to SingTel, it could not claim for the loss\n                    sustained in making good that damage. 42     The facts of the present\n                    case are not quite akin to those ofNacapmuch lessThe\n                        Aliakmonwhere the plaintiffs had no\n                    possession of any sort. InNacap, the court said that the possession\n                    given to the plaintiffs there was a limited possession. This\n                    was not the situation here. Condition 10(2) of the\n                    Articles and Conditions of Building Contract between SKS and\n                    SingTel provided that from the commencement date of the\n                    Works, SKS would be entitled to “free and\n                    uninterrupted possession of the whole ... of the\n                    Site” in which the Works were to be conducted. That\n                    could not be limited possession. Such free and uninterrupted\n                    possession was duly given to SKS and, as shown by documents\n                    produced in evidence, SKS retained such full possession at\n                    the time of the fires. Whilst SKS might not have had\n                    possessory title to the site itself, it was definitely the\n                    bailee in possession of all moveable goods within the site\n                    until possession was handed back to SingTel. 43     It cannot be disputed that\n                    a substantial proportion of the damage caused by the fires\n                    was caused to the goods forming part of the UPS system. SKS\n                    was in sole and exclusive possession of these goods for the\n                    purpose of carrying out the Works. I note that the defendant\n                    argued that there was no evidence that the damaged items\n                    repaired by SKS were all goods as opposed to premises.\n                    However, the fact that some of the loss was not directly\n                    related to the damage sustained by the goods would not\n                    change SKS’s entitlement to sue as bailee of damaged\n                    goods. Whether it could also recover economic loss as a\n                    consequence of having to undertake repairs to real property\n                    of which it was not (and could not be) a bailee would be a\n                    question of remoteness of damage to be decided when the\n                    damages came to be quantified. Such question could not\n                    affect SKS’s title to sue as bailee when the goods\n                    bailed had been physically damaged. 44     I accept the submission\n                    made by SKS that as the main contractor and as bailee in\n                    possession of the Works, until the Works were completed and\n                    handed over to SingTel, SKS retained possession and had the\n                    right to claim against any third party who negligently\n                    damaged the property in the Works. The law on the right of a\n                    bailee to sue in such circumstances is well\n                settled. 45     InJet\n                        Holding Ltd v Cooper Cameron (Singapore) Pte\n                        Ltd[2005] 4 SLR(R) 417 it was held\n                    at [59] that\n                    possession on the part of a bailee would give a complete\n                    title and entitled the bailee to damages for loss or injury\n                    to the property itself. This pronouncement was based onThe Winkfield[1902] P 42\n                    where there was a collision between the steamship“Mexican”and the\n                    steamship“Winkfield”which resulted in\n                    the loss of the“Mexican”with a portion of\n                    the mail which she was carrying at the time. The question\n                    was whether the postmaster general could recover for the\n                    value of letters and parcels which were in his custody as\n                    bailee and lost while on board the“Mexican”. Collins MR held\n                    at 54: ... that possession is good against a wrongdoer and\n                        that the latter cannot set up thejus\n                            tertiiunless he claims under it, is well\n                        established in our law, and really concludes this case\n                        against the respondents. As I shall shew presently, a\n                        long series of authorities establishes this in actions\n                        of trover and trespass at the suit of a possessor. And\n                        the principle being the same, it follows that he can\n                        equally recover the whole value of the goods in an\n                        action on the case for their loss through the tortious\n                        conduct of the defendant. I think it involves this also,\n                        that the wrongdoer who is not defending under the title\n                        of the bailor is quite unconcerned with what the rights\n                        are between the bailor and the bailee; and must treat\n                        the possessor as the owner of the goods for all purposes\n                        quite irrespective of the rights and obligations as\n                        between him and the bailor.",
        "Breach of duty": "46     The next issue to consider\n                    is whether the defendant breached its duty of care to the\n                    plaintiff. The law determining the relevant standard of care\n                    is theBolamtest which was\n                    laid down inBolam v Friern Hospital\n                        Management Committee[1957]\n                    1 WLR 582 with “theBolithoaddendum” as decided by the\n                    Court of Appeal inJSI Shipping (S) Pte\n                        Ltd v Teofoongwonglcloong[2007]\n                    4 SLR(R) 460 (“JSI\n                        Shipping”) where VK Rajah JA said\n                    that theBolamtest had been\n                    qualified by the case ofBolitho v City\n                        and Hackney Health Authority[1997]\n                    4 All ER 771 such that the evidence of experts\n                    must have “a logical basis” (JSI Shipping at[49]). As a result,\n                    the test to be applied is whether the standard of care\n                    displayed in any particular situation met the standard of\n                    the ordinary skilled man exercising and professing to have\n                    the special skill required in that situation. In determining\n                    this issue, the evidence from a body of experts as to\n                    whether the standard has been fulfilled, must have a logical\n                    basis. 47     The eight UPS units\n                    manufactured by the defendant were subjected to two\n                    different tests: UPS 7-7 was subjected to the Factory\n                    Acceptance Tests (“FATs”) while UPS 7-1, 7-2,\n                    7-3, 7-4, 7-5, 7-6 and 7-8 were only subjected to the\n                    Automatic Test. The plaintiffs submitted that as the\n                    defendant knew that it had not conducted the FAT on UPS 7-7,\n                    it should not have allowed that unit to leave its factory.\n                    By shipping UPS 7-8 to Singapore without carrying out the\n                    FAT on that unit, the defendant committed a negligent act.\n                    UPS units are special equipment meant for specific purposes\n                    and the defendant must have been aware of the risks involved\n                    if a defective unit was shipped to the\n                end-user. 48     The question that arises\n                    is whether the defendant fulfilled its standard of care by\n                    subjecting UPS 7-8 to the Automatic Test alone and\n                    by-passing the FAT. 49     The defendant argued that\n                    it had satisfied the standard of care of an ordinary skilled\n                    UPS manufacturer. This was because UPS 7-8 had been\n                    subjected to and had passed the Automatic Test. Further, the\n                    consultant employed by SingTel had confirmed that he had\n                    received the test results for all eight UPS units six weeks\n                    before they were delivered and had found the results and\n                    readings in these tests to be acceptable to him. The\n                    defendant pointed out that readings in the Automatic Tests\n                    for UPS 7-8 were incorporated into the FAT. The defendant\n                    submitted that the Automatic Test alone was sufficient to\n                    show that the defendant had satisfied the standard of care\n                    of an ordinary skilled UPS manufacturer in respect of UPS\n                    7-8. Mr Goh was aware that the test for UPS 7-8 was\n                    different from that for UPS 7-7 when he approved the tests\n                    prior to the shipping of the units. His approval of the\n                    tests results of the Automatic Tests showed, the defendant\n                    submitted, that it had exercised the requisite standard of\n                    care. 50     No expert evidence was\n                    adduced as to the proper procedures and checks that need to\n                    be carried out by a UPS unit manufacturer. In this\n                    situation, the only evidence as to what is required of such\n                    manufacturer comes from the procedures and checks adopted by\n                    the defendant itself. 51     The defendant’s\n                    working document shows that the FATs are conducted as\n                    “proof of the stringent Quality Assurance programme\n                    of the manufacturing of the UPS system in the\n                    factory” (Document entitled “Uninterruptible\n                    Power Supply Installation: Section 7 – Work Tests,\n                    Site Tests and Commissioning”). It also represents\n                    that the following FATs shall be conducted: (a)     UPS functional\n                        test with fast response output voltage waveform\n                        measurement and recording with 100% load including one\n                        step 100% load transfer (b)     Input voltage and current\n                        harmonic measurement on 0%, 25%, 50%, 75%, 100%\n                        load (c)     Efficiency measurement and UPS losses\n                        measurement on 0%, 25%, 50%, 75%, 100%\n                    load (d)     Over load and short circuit\n                    test (e)     Output voltage measurement and recoding for\n                        non-balanced load condition. The\n                    document also states that all tests shall be carried out\n                    under a load power factor of 0.8 leading, 0.9 leading,\n                    unity, 0.9 lagging and 0.8 lagging; five different\n                    situations. 52     The defendant admitted\n                    that while the report for UPS 7-7 (which was subjected to\n                    the FATs) was far more detailed and spanned 115 pages, the\n                    reports for the other UPS units including UPS 7-8 (which\n                    were only subjected to the Automatic Test) were brief and\n                    only spanned six pages. The FATs were far more stringent\n                    tests and importantly included the overload and short\n                    circuit test, which was not present in the Automatic Test.\n                    Results from those two tests would have been relevant to\n                    whether or not the UPS units would fail in a situation of\n                    current overload or short circuit. In the absence of expert\n                    evidence and where the defendant itself prescribes two types\n                    of tests which differ in the level of detail tested and the\n                    care taken, the defendant must be obliged to carry out the\n                    test which fulfils a higher standard of care. It does not\n                    lie in the defendant’s mouth to claim that the less\n                    stringent test is sufficient. 53     I do not accept the\n                    argument that Mr Goh’s acceptance of the test\n                    results for all the units absolved the defendant from its\n                    breach of duty. The evidence was that Mr Goh did not\n                    witness the tests carried out. He was therefore in no\n                    position to confirm the accuracy of the test results\n                    presented to him. In any event, any failing on the part of\n                    Mr Goh could perhaps found an argument of contributory\n                    negligence on the part of the plaintiffs. It cannot absolve\n                    the defendant from its own failure to live up to the\n                    standard of care required. The defendant breached its duty\n                    in carrying out the full range of tests required. That\n                    breach remains a breach whether or not Mr Goh accepted\n                    the tests results.",
        "Cause of the damage": "54     The question here is\n                    whether there was a sufficient causal link between the\n                    defendant’s breach of duty and the damage suffered by\n                    the plaintiffs. The plaintiffs’ theory is that the\n                    fire was caused by the failure of the Insulated Gate\n                    Controlled Bipolar Transistor (“IGBT”) within\n                    the UPS unit that controlled the battery charging current.\n                    The defendant says that the cause of the fires is not\n                    strictly ascertainable, but they were not caused by UPS 7-8.\n                    Further, the fires were most likely caused by the leakage of\n                    current in the battery room, likely from the batteries\n                    and/or the cables. 55     In the discussion that\n                    follows, it must be remembered that the defendant was the\n                    supplier of only one component, albeit, a major component,\n                    of the UPS system. The main components of this system were\n                    the UPS units manufactured by the defendant, the battery\n                    bank and the cables. The batteries and the cables were\n                    supplied by Socomec Asia who purchased them from third\n                    parties. 56     The burden of proof as to\n                    causation lies with the plaintiffs. It is well established\n                    that the trial judge may accept the explanation of either\n                    the plaintiffs or of the defendant; or, if both explanations\n                    are improbable the judge may decide that the action fails\n                    because the plaintiffs have failed to discharge their burden\n                    of proof. SeeRhesa Shipping Co SA v\n                        Edmunds (The Popi M)[1985]\n                    1 WLR 948, endorsed inCooperatieveCentraleRaiffeisen-Boerenleenbank\n                        BA (trading as Rabobank International), Singapore Branch\n                        v Motorola Electronics Pte Ltd[2011]\n                    2 SLR 63. 57     The plaintiffs’\n                    position all along was that the fires were caused by a\n                    defective UPS unit. In the course of the trial, however,\n                    they changed their case on what the exact defects were that\n                    led to the fires. At the start of the trial, the statement\n                    of claim averred in para 7 that the fires were caused by the\n                    defective UPS 7-8 and gave the following particulars of that\n                    averment: 7.2    The first fire started because\n                            of an electrical component failure, specifically\n                            because of an intermittent failure in one phase\n                            rectifier arm of the rectifier SCR\n                            (silicon-controlled rectifier) bridge which was\n                            found missing in the rectifier SCR control bridge.\n                            The location of this missing electrical component\n                            coincided with the area of fire\n                        origin; 7.3    Because of this\n                            component’s intermittent fault, short-circuit\n                            current of a value less than 2.5 times of the\n                            nominal rating of the battery fuses flowed in the\n                            battery, not enough to blow the battery fuses but\n                            enough to initiate the failure of the batteries and\n                            the initiation of the second fire; 7.4    The intermittent failure of\n                            the said rectifier in the rectifier SCR controlled\n                            bridge caused an electrical resonant in the\n                            rectifier/chokes/inverter circuit, and a high\n                            voltage across the missing rectifier to produce\n                            electrical arcing, to eat away the D.C. busbar.\n                            Sparking sound heard by the many witnesses was the\n                            manifestation of the electric arcing at the DC\n                            busbar; 7.5    The first fire started at the\n                            UPS7-8 panel in the UPS section and the intermittent\n                            short-circuit caused the second fire at the battery\n                            section. Because of the overcharging of the battery\n                            section, hydrogen gases were liberated at the\n                            battery terminal, which exploded to cause such\n                            dramatic failures in the battery bank\n                            section. 58     The particulars quoted\n                    above were based on the “Investigation Report on the\n                    Kim Chuan Telecommunication Complex Fire on the\n                    27th June 2007” dated January 2009 and prepared\n                    by Dr Jimmy Chen Wie Ying of Snowflake Technology Pte\n                    Ltd (“Dr Chen”). In January 2011,\n                    Dr Chen prepared a “Further Report on the Kim\n                    Chuan Telecommunication Complex Fire on the 27th June\n                    2007”. In mid February 2011, just as this trial\n                    started, the plaintiffs applied to substitute\n                    Dr Keith J Cornick\n                    (“Dr Cornick”) as their expert witness in\n                    place of Dr Chen on the basis that Dr Chen was\n                    physically unable to give evidence. I allowed this\n                    application and Dr Cornick then affirmed an affidavit\n                    to which he exhibited the two reports prepared by Dr Chen.\n                    He testified that these reports had been prepared by Dr Chen\n                    in consultation with him and he adopted the reports as being\n                    his as well. Dr Cornick also referred to a Response Report\n                    dated 7 December 2010. He affirmed that he had prepared this\n                    Response Report as a reply to a report prepared by Dr\n                    Richard Fletcher (“Dr Fletcher”), the\n                    defendant’s expert. In Dr Fletcher’s report, he\n                    had opined that on balance it was more likely that the\n                    underlying cause of the fire was associated with equipment\n                    in the battery room rather than with UPS 7-8.\n                    Dr Cornick affirmed that in his opinion, the underlying\n                    cause of the incident was in UPS 7-8. 59     Dr Cornick took the stand\n                    on 21 February 2011. He was subjected to a very detailed\n                    cross-examination. In the course of the cross-examination,\n                    Dr Cornick agreed that the plaintiffs’ theory of\n                    failure in the one phase rectifier arm in the rectifier SCR\n                    bridge was wrong. In re-examination, Dr Cornick was taken\n                    through that theory again to confirm what he had said in\n                    cross-examination. He then confirmed that in the light of\n                    the further evidence he had been shown, it was no longer his\n                    view that the initial fire started because of an electrical\n                    component failure associated with one arm of the rectifier\n                    SCR rectifier bridge. He further confirmed that it was no\n                    longer his view that the failure in the one phase rectifier\n                    arm was of an intermittent nature and the rectifier arm was\n                    not able to withstand the reverse voltage intermittently\n                    resulting in intermittent short circuit across the battery\n                    terminals. Thirdly he confirmed that what was stated in\n                    paras 7.3 and 7.4 of the particulars cited in[57]above no longer\n                    constituted his view. 60     Having totally resiled\n                    from the particulars in paras 7.2 to 7.4 of the statement of\n                    claim, Dr Cornick then went on to say that he maintained\n                    that the batteries were overcharged and that the reason for\n                    this was that the IGBT controlled circuit had failed. Dr\n                    Cornick then stated how he believed the IGBT had initiated\n                    the fires. As a result of the change in Dr Cornick’s\n                    evidence, the plaintiffs applied to amend the statement of\n                    claim by amending the particulars in para 7 to reflect what\n                    he had said during re-examination. I allowed the\n                    application. 61     Consequently, at the close\n                    of the trial, the particulars to para 7 of the statement of\n                    claim read as follows: 7.1    The first fire started at the\n                                7thstorey of the\n                            Complex at the UPS section at UPS7-8; 7.2    The first fire started because\n                            of an electrical component failure, specifically the\n                            failure of the Insulated Gate Controlled Bipolar\n                            Transistor (“IGBT”) that controlled\n                            the battery charging current; 7.3    Because of this\n                            component’s fault, a heavy current of a value\n                            well above that recommended, i.e. above 400 mps\n                            flowed in the battery charger circuit and the\n                            battery; 7.4    This current was not enough to\n                            blow the battery fuses but sufficient to overcharge\n                            the UPS 7-8 batteries. This overcharging resulted in\n                            batteries giving off hydrogen and oxygen gases,\n                            which exploded to start the second\n                        fire. 62     The defendant submitted\n                    that the plaintiffs had not come close to discharging their\n                    burden of proof on a balance of probabilities in relation to\n                    the new theory of the failure in the IGBT. It said there was\n                    no evidence before the court emanating from the\n                    plaintiffs’ expert that the IGBT failed by itself on a\n                    stand-alone basis (as opposed to the failure of the IGBT\n                    being caused by a chain of events as had been propounded in\n                    relation to the earlier theory) such as to cause the\n                    batteries to be overcharged and to cause the fires in the\n                    battery room and the localized fire in UPS\n                7-8. 63     To repeat, the\n                    plaintiffs’ current claim is that the failure of the\n                    IGBT caused “a heavy current of a value well above\n                    that recommended, i.e. above 400 amps [to flow] into the\n                    battery charger circuit and the battery. This current was\n                    not enough to blow the battery fuses but sufficient to\n                    overcharge the UPS 7-8 batteries”. It is essential to\n                    note that the plaintiffs describe the IGBT failure as a\n                    “low overcurrent condition”, i.e. a current\n                    that was too low to blow the fuses gradually caused the\n                    batteries to overheat and caused the 27 June and the 28 June\n                    fires. Having considered the evidence, I find that the\n                    plaintiffs have not shown that the fires were more likely\n                    caused by a failure at UPS 7-8. 64     The 27 June fires, which\n                    occurred at 8.20 pm, consisted of two separate fires, the\n                    first occurring in UPS 7-8 itself and the second occurring\n                    in the battery room. It is not disputed that the UPS 7-8\n                    fire was localized and died out on its own. The plaintiffs\n                    must show that the battery room fire was caused by the\n                    failure of UPS 7-8. At this point, it should be noted that\n                    even in the statement of claim, the plaintiffs do not\n                    explain the causal nexus between the UPS failure and the\n                    battery room fire. It is only said there that “the\n                    first fire started because of an electrical component\n                    failure” in the IBGT. Rather, the plaintiffs’\n                    theory of the batteries overheating is apparently in\n                    relation to the 28 June fire that occurred at 2.10 am, more\n                    than five hours after the earlier fires. When the plaintiffs\n                    came to make their submissions, however, their stance seems\n                    to have changed as the closing submissions seek only to\n                    establish the theory of batteries overheating as the cause\n                    of the 27 June fires, not the 28 June fire. 65     The available objective\n                    evidence does not support the plaintiffs’ case with\n                    regard to the 27 June fires. First, the plaintiffs’\n                    expert, Dr Cornick, stated that such overheating would take\n                    “many minutes” or “20 minutes”.\n                    In his report he had stated that the heating of the\n                    batteries was not a short term action. He also said that the\n                    fuses meant to protect the batteries did not blow for a long\n                    time but let in enough overcurrent to the batteries to\n                    overcharge them and to initiate battery failures. However,\n                    the evidence given by eyewitnesses who were working or\n                    present in the North Room immediately before the 27 June\n                    fires makes clear that the explosions in the battery room\n                    occurred almost at the same time as, or a few seconds after,\n                    sparks were seen at UPS 7-8. When this evidence was put to\n                    Dr Cornick, he agreed that there was a discrepancy between\n                    the timing of what the witnesses saw and the alleged IGBT\n                    failure. He also had to accept that he could not disagree\n                    with what the witnesses had seen. 66     Secondly, the\n                    plaintiffs’ theory relies heavily on the photographic\n                    evidence of (allegedly) the bulging batteries connected to\n                    UPS 7-8, and Dr Cornick’s claim that the theory\n                    of batteries overheating was proven by how there were\n                    “bubbles in the battery that have started to appear\n                    bursting”, and how the “connections have been\n                    [pushed] out at the top of the internal pressure”.\n                    This photographic evidence was put forward to establish\n                    overheating of the batteries connected to UPS 7-8. However,\n                    Mr Li Bang Hao, the photographer, testified that the\n                    photographs Dr Cornick relied on were of batteries located\n                    next to the cable ladder in the North Room. The diagram of\n                    the North Room confirms those batteries were then connected\n                    to UPS 7-6, not to UPS 7-8. Thus there is no direct evidence\n                    that the plaintiffs can rely on to show that the batteries\n                    of UPS 7-8 had overheated. Further, the internal overheating\n                    of the batteries connected to UPS 7-6 is physically\n                    incompatible with the notion that the 27 or 28 June fires\n                    was caused by the overheated batteries of UPS 7-8. A fire\n                    deriving from the batteries of UPS 7-8 would not have caused\n                    internal overheating of the batteries of UPS 7-6; a more\n                    likely explanation is that the fires were caused by internal\n                    malfunction of the batteries themselves. In addition, the\n                    fact that the batteries of UPS 7-8 remained almost\n                    completely intact, while other batteries in the battery room\n                    were burnt to a cinder, is logically inconsistent with the\n                    notion that the fire originated from the batteries of UPS\n                    7-8. 67     Thirdly, the\n                    plaintiffs’ theory of overheated batteries relies\n                    heavily on another piece of physical evidence,vizthe damaged battery charger\n                    chokes in the battery banks of UPS 7-8. Dr Cornick\n                    maintained that the damage was caused by overheating while\n                    the defendant’s expert, Dr Fletcher, maintained that\n                    the damage was caused by electric arcing. In my judgment, Dr\n                    Fletcher’s opinion bears more weight because he had\n                    physically examined the battery charger chokein situ, and peeled back the outer\n                    layer of the foil to discover no damage to the inner layer\n                    of the foil (which would indicate internal overheating). On\n                    the other hand, Dr Cornick reached his conclusion without\n                    having physically examined the battery charger chokes.\n                    Further, the battery charger chokes were fixed to the casing\n                    of UPS 7-8. Therefore if they had been overheating for some\n                    time as propounded by Dr Chen and Dr Cornick, this\n                    overheating would have, in Dr Fletcher’s opinion, been\n                    obvious to the various engineers working around the panel as\n                    discoloration or blistering of paint. The engineers from HS\n                    Inspection who were on the site at the time did not say that\n                    they had detected any such thing. Rather, the evidence of\n                    the persons who had conducted infra-red thermal testing of\n                    the unit shortly before the incident was that the thermal\n                    scanning showed no hot-spots inside UPS7-8. 68     In their closing\n                    submissions the plaintiffs sought to piggy back on certain\n                    evidence given by Dr Fletcher to help found their new theory\n                    of the cause of the fires. While some of the evidence that\n                    Dr Fletcher gave was helpful to the plaintiffs’ case,\n                    it could not by itself fill in all the gaping holes in the\n                    same. The plaintiffs’ big problem was that they came\n                    to court with one theory which was completely discredited on\n                    the stand and then had to cast about for another theory to\n                    support their case. This second theory was only enunciated\n                    in re-examination and was put forward by a witness who at\n                    the beginning of his testimony had held tightly to the first\n                    theory as being the correct explanation for the fires. Yet\n                    in a matter of a day or two, when forced to discard a theory\n                    which had been worked on for 2 years, he was able to come\n                    up, on the hop as it were, with an alternative explanation\n                    which put the blame squarely on the UPS unit. I did not find\n                    this satisfactory or convincing. In their original case, the\n                    plaintiffs had never relied on the IGBT as a component that\n                    failed on a stand-alone basis. It was always part of the\n                    “chain” starting from the alleged failed SCR\n                    rectifier. Thus there was no report before me to\n                    substantiate, and give the technical basis for, the\n                    allegation that the IGBT had failed on its own and thereby\n                    caused the overcharging of the batteries. Dr Fletcher\n                    agreed that the IGBT failed but not that it failed on its\n                    own. Rather he opined that it could have resulted from a\n                    short circuit of the battery circuit connected to the UPS\n                    unit arising from an initiating fault in the\n                battery. 69     I have found that the\n                    plaintiffs have not established that the fires were caused\n                    by a fault in UPS7-8 for which the defendant can be made\n                    responsible. I do not have to go on to find what the actual\n                    cause of the fires was. Dr Fletcher’s opinion was\n                    that given the extent of damage, which was particularly\n                    severe in the battery room, it was not possible to determine\n                    the cause of the fire on the basis of the remaining physical\n                    evidence. He therefore went on to consider which of the two\n                    possible causes was more likely: that the fire in the\n                    battery room resulted from a fault in the UPS or that the\n                    fault in the UPS resulted from a fault in the battery room\n                    that also caused the fires. He concluded that it was\n                    relatively unlikely that the fault in the battery room that\n                    led to the fires was caused by the short-lived failure in\n                    the UPS and that it was more likely that a gradual failure\n                    of the battery equipment associated with UPS 7-8 went\n                    unnoticed but placed additional stress on the UPS ultimately\n                    resulting in the failure of the charger circuit. The\n                    resulting short circuit in the UPS might then have\n                    exacerbated the developing fault in the battery leading to\n                    the battery room ‘explosions’ and the rapid\n                    onset of fire. I make no finding on Dr Fletcher’s\n                    theory as it is not necessary for the decision in this case.\n                    Dr Fletcher was, however, a more convincing witness\n                    than Dr Cornick.",
        "Other issues": "70     Having found that the\n                    plaintiffs have not been able to prove that the damage\n                    resulted from a defect in UPS 7-8, there is no need for me\n                    to deal in detail with the remaining issues. I will,\n                    however, express my views on them briefly. Novus actus interveniens 71     The first of these issues\n                    is whether the actions of the SCDF in breaking the windows\n                    on the 7th storey constituted anovusactusintervenienssufficient to relieve\n                    the defendant of liability if the same had been found. The\n                    assertion by the defendant was the acts of the SCDF in\n                    fighting the 27 June fire aggravated that fire in the\n                    battery room and caused the 28 June fire in the battery\n                    room. 72     The principles to be\n                    applied in deciding this issue were set out in Michael\n                    Jones, Anthony Dugdale (eds),Clerk &\n                        Lindsell on Torts(Sweet & Maxwell,\n                        20thEd, 2010)\n                        (“Clerk &\n                        Lindsell”) at p 128 as follows: The question of the effect of anovusactus“can only be answered on a\n                        consideration of all the circumstances and, in\n                        particular, the quality of that later act or\n                        event.” Four issues need to be addressed. Was the\n                        intervening conduct of the third party such as to render\n                        the original wrongdoing merely part of the history of\n                        events? Was the third party’s conduct either\n                        deliberate or wholly unreasonable? Was the intervention\n                        foreseeable? Is the conduct of the third party wholly\n                        independent of the defendant, i.e. does the defendant\n                        owe the claimant any responsibility for the conduct of\n                        that intervening third party? In practice, in most cases\n                        ofnovusactusmore than one of the above\n                        issues will have to be considered together. The same text at p 138 also states that a\n                    deliberate act of rescue will virtually never constitute anovusactusunless the reaction of the rescuer is\n                    so grossly foolish and disproportionate to the danger as in\n                    effect to be a “sham” rescue. 73     In the present case,\n                    addressing the issues set out inClerk\n                        & Lindsell, results in the conclusion\n                    that the acts of the SCDF cannot be consider anovusactusthat could relieve the defendant of\n                    liability for its wrongdoing. First of all, the intervening\n                    conduct of the SCDF in fighting the fire could not render\n                    the initial defect in the UPS unit (on the assumption one\n                    had been found) which initiated the fire merely a part of\n                    the history of events. The actions of a professional fire\n                    fighting force in dealing with the 27 June fires cannot be\n                    considered as an unreasonable response or an effort that\n                    went beyond what was required by the circumstances. The\n                    reaction to the fire was a consequence properly attributable\n                    to the initial wrongdoing and SCDF’s acts did not\n                    eclipse that wrongdoing. From the time of the 27 June fires,\n                    damage was sustained by the batteries, the UPS units and\n                    certain other components. If SCDF’s actions in\n                    fighting the 27 June fires were not sufficient to totally\n                    deal with the problems caused by that fire and may instead\n                    have aggravated the 28 June fire, that does not mean that\n                    the 28 June fire arose solely from the SCDF’s actions.\n                    The technical evidence did not support such a conclusion. In\n                    any case, it cannot be said that the action of the SCDF in\n                    coming to the rescue and in taking the actions it considered\n                    necessary to douse the fires were grossly foolish and\n                    disproportionate to the danger caused by the fires\n                    notwithstanding that the methods that the SCDF used may not\n                    have been wholly suitable for an electrical\n                fire. Estoppel by convention 74     The next issue is estoppel\n                    by convention. The defendant submitted that the plaintiffs\n                    were estopped under this doctrine from alleging that it was\n                    UPS 7-8 which was responsible for causing the fires. The\n                    factual background to this assertion was a meeting that took\n                    place between the plaintiffs, Socomec Asia and the\n                    defendant’s representative (via video link) on 10\n                    August 2007. At that meeting, the defendant alleged, the\n                    parties had agreed that the cause of the fire was\n                    unascertainable but, most likely that it was the batteries\n                    or cables which caused the fire. Subsequent to that meeting,\n                    the plaintiffs redesigned the location of the battery\n                    protection boxes by reverting to the original designieeach box was placed at\n                    the end of each of its batteries so that any leakage of\n                    current and/or fire would not spread to the other three UPB\n                    systems via the cables or cable ladder. The plaintiffs\n                    submitted that by not putting the battery protection boxes\n                    back in the positions they were in prior to the fire the\n                    plaintiffs had taken the view that relocating the boxes\n                    would result in less risk of a fire and/or spread of the\n                    fire. 75     The plaintiffs disagreed\n                    that there had been a consensus at the meeting held on 10\n                    August 2007. Mr Goh who was present at that meeting had said\n                    in evidence that he was not asked whether he agreed or\n                    disagreed with the comments of the defendant’s\n                    engineers on the cause of the fire. He said that he was at\n                    the meeting merely to listen to what the defendant’s\n                    engineers had to say about the possible cause of damage and\n                    was not asked to make a comment. Whilst the\n                    plaintiffs’ then expert, Professor Liew Ah Choy\n                    (“Professor Liew”), was also present at the\n                    meeting, as he did not give evidence at the trial, the court\n                    ought to reject the defendant’s references to\n                    Professor Liew’s purported agreement with their\n                    views. 76     I do not think it is\n                    necessary for me to decide on this dispute of facts as in\n                    any event, it is my view that estoppel by convention would\n                    not apply here. For estoppel by convention to apply, the\n                    parties must have agreed on certain statements of facts, the\n                    truth of which has been assumed by the parties to be the\n                    basis of the transaction and it must be unjust to allow one\n                    party to go back on the agreed facts. Even if at the time of\n                    the meeting the plaintiffs’ representatives had agreed\n                    that the cause of the fire was unascertainable, that was an\n                    opinion held at a particular time and not a statement of\n                    fact. Secondly, the defendant has not shown me why it would\n                    unjust to allow the plaintiffs to go back on such opinion\n                    and sue them on the basis of subsequently acquired knowledge\n                    or evidence. There is nothing before me to show any change\n                    of position on the part of the defendant by reason of the\n                    meeting of 10 August 2007 that would make it unfair to allow\n                    the plaintiffs to pursue this action if indeed they were\n                    able to establish that UPS 7-8 was the cause of the\n                    fire. Contributory negligence 77     The final issue is that of\n                    contributory negligence. The defendant submitted that\n                    whatever the root cause of the fires, the damage caused by\n                    the 27 June fire could have been substantially reduced if\n                    the plaintiffs had armed the FM200 fire extinguishment\n                    system (“the FM200 system”) on the day in\n                    question prior to carrying out the scheduled infra-red\n                    thermal testing. 78     It was not disputed that\n                    the FM200 system had been installed but was not armed on 27\n                    June 2007. The plaintiffs explained that the system was not\n                    armed at the material time because if it had been activated\n                    by a fire, it would have asphyxiated the persons who were\n                    then present in the UPS room to carry out the infra-red\n                    thermal testing of the UPS units. Secondly, the Works were\n                    still in a “construction phase”. 79     Dr Fletcher took the view\n                    that if the FM200 system had been armed, it could have\n                    detected the slowly developed fire in the battery room at\n                    the time the infra-red thermal test were being done and it\n                    could have limited the development of the fire. Dr Cornick\n                    thought that the batteries of UPS 7-8 could not have been\n                    saved but that the system might have saved much damage to\n                    the remaining batteries and most certainly the fabric of the\n                    battery room. Whilst he expressed the view that there was a\n                    possibility that someone may be asphyxiated, Dr Cornick\n                    agreed that if there had been a delay mechanism in the FM200\n                    system, no one would be asphyxiated by the operation of the\n                    same. 80     Having considered the\n                    facts, I think the plaintiffs were negligent in not arming\n                    the FM200 system before they commenced their infra-red\n                    thermal imaging work on 27 June 2007. They would have known\n                    that such testing would generate high heat and therefore\n                    there may be a risk of fire. The explanation regarding the\n                    danger of asphyxiation was not convincing since it was a\n                    term of the main contract that the FM200 system had to have\n                    a delay mechanism. Dr Fletcher studied the specifications of\n                    the Dupont FM200 system which SKS had installed. He reported\n                    that this document made it clear that the FM200 system was\n                    entirely safe for use in areas where people were working and\n                    therefore there was no reason why the system should not have\n                    been armed while commissioning tests were being carried out.\n                    I accept this evidence. The damage would have been reduced\n                    if the system had been operating. If I had found the fire to\n                    be caused by UPS 7-8, I would have held that due to\n                    contributory negligence on their part, the plaintiffs should\n                    recover only 75% of the damage sustained.",
        "Conclusion": "81     For the reasons given\n                    above, the plaintiffs’ claim is dismissed with\n                    costs."
    }
}