{
    "case_title": "Edwards Jason Glenn \n      v\n      Australia\nand New Zealand Banking Group Ltd",
    "ncitation": "[2012] SGHC 61",
    "coram": "Tay Yong Kwang J",
    "sections": {
        "Introduction": "1       This\ncase, at its simplest, is one of a borrower who took out a loan\nto buy properties and to invest and now refuses or is unable to\npay it back. It is complicated by the mechanisms within the loan,\nfor example, the different currencies that denominate the different\ntranches of the loan, as well as the different triggers that set\noff related calls on the loan but, at its heart, it is a case of\na borrower who is facing a claim from the bank and seeking a declaration\nto absolve himself of his debts. In attempting to do so, the plaintiff\nhas mounted a multi-pronged attack on the contract he signed on, claiming,\namong other things, that the contract is void for uncertainty and that\nthere are multiple difficulties in the construction of the contract. 2       Having\nconsidered the evidence and the parties’ three sets of written submissions\ntendered sequentially after the trial, I have decided to dismiss the\nPlaintiff’s claim and to allow the Defendant’s counterclaim. I now\ngive the reasons for my decision.",
        "Facts": "",
        "Parties to the dispute": "3       The\nplaintiff, Jason Glenn Edwards (“Edwards”) is an Australian citizen\nwho has lived in Singapore for 6 years.[note: 1]He\nis General Counsel at Clearwater Capital Partners[note: 2], a firm in the business of private equity\nand fund management.[note: 3]He\nwas previously a partner at the law firm, Baker and McKenzie.[note: 4]It\nis not in dispute that Edwards is a financially astute and sophisticated\ncustomer who was proactive in buying and selling instrument funds\nas well as booking forward currency conversions.[note: 5]His\nincome is paid to him in either USD or SGD.[note: 6] 4       The\ndefendant, Australia and New Zealand Banking Group Limited (“ANZ”),\nis an international banking group operating in Singapore. ANZ provides\nbanking and financial services, including deposits services and loan\nfacilities.[note: 7] 5       Edwards\ntestified at the trial. An Australian property valuer who did a valuation\nof 61 George Street in Queensland (see[10]below),\none of the properties in issue here, and an Australian estate agent\nengaged by the previous owner of 61 George Street to sell the said\nproperty in January 2008 were supposed to testify at the trial via\nvideo-link. However, it was agreed at the start of the trial that\ntheir affidavits of evidence-in-chief (“AEIC”) be admitted without\ncross-examination but would be subject to submissions to be made.\nThe witnesses who appeared for ANZ at the trial were: (a)     Ms Jodene\nFrances Edwards (“Jodene Frances”), a former employee of ANZ in\nSingapore from 2004 - June 2007.[note: 8]She\nis a former Private Banker in ANZ, specializing in the sale of dual\nand multi-currency facilities. She met Edwards sometime before January 2006\nin her capacity as private banker after he was referred to her by one\nof her colleagues.[note: 9] (b)     Malcolm\nGeorge Crispe (“Crispe”), an ANZ Associate Director of Private Banking\nat ANZ. He dealt with Edwards after Edwards’ account was transferred\nto him from Jodene Frances in April 2007.[note: 10]Crispe\nwas Edwards’ Relationship Manager till April 2009, when Edwards’\naccount was transferred to the Asset Management Unit of ANZ.[note: 11] (c)     Maya\nLim, the Senior Manager, Lending Services Asia of ANZ. He dealt\nwith Edwards from 20 April 2010 onwards. 6       Similarly,\nan Australian valuer engaged by ANZ to do a retrospective valuation\nof 61 and 75 George Street (the latter being the other property\nin issue here- see[9]below)\nwas also supposed to have testified via video-link. His AEIC was\nalso admitted by consent without cross-examination but subject to\nsubmissions to be made.",
        "Background to the dispute": "",
        "The promising start": "7       In\n2006, Edwards wanted to purchase property in Australia and, to this\nend, wanted to borrow and make mortgage payments in the currency\nof his income or alternatively in a low interest currency like the\nJapanese Yen. He sought to avoid having to convert his income into\nAustralian Dollars to make his mortgage payments because if the\nAustralian Dollar appreciated against the currency he was paid in,\nthe cost of his monthly payments would rise.[note: 12]He\nalso found borrowing in Japanese Yen not too “burdensome” as the\ninterest rate was low.[note: 13] 8       In\nJanuary 2006, ANZ advertised a package that appeared to be perfectly\nsuited to Edwards’ needs.[note: 14]It\nfeatured the ability to borrow in income currency and/or property\ncurrency and the flexibility to switch in between.[note: 15] 9       On\n24 January 2006, Edwards signed a facility letter for a Multi Currency\nTerm Loan Facility (“the Facility Letter”). Funds were made available\nto Edwards in Japanese Yen (“JPY”), Singapore Dollars (“SGD”), Australian\nDollars (“AUD”) and US Dollars (“USD”). ANZ’s Standard Terms and\nConditions (“the T&Cs”) were issued as part of the Facility Letter.[note: 16]The\nstated purpose of the facility was to refinance an existing loan with\nCommonwealth Bank of Australia, Hong Kong, for a property located at 75\nGeorge Street, Burleigh Heads, Queensland, Australia (“75 George Street”),\nfor investment purposes, and to finance the purchase of a residential\nproperty located in Singapore.[note: 17]The Facility Letter was subsequently\nvaried by variation letters dated: 22 March 2006[note: 18],\n13 April 2006[note: 19], 27 July 2006[note: 20],\n21 August 2007[note: 21], 10 December 2007[note: 22], 14 July 2008[note: 23]and\n23 October 2009[note: 24](collectively,\n“the Variation Letters”).[note: 25]The\nFacility Letter, Variation Letters and the T&Cs together formed\nthe entire facility agreement (“the Facility Agreement”) entered\ninto between Edwards and ANZ.[note: 26]I\ndraw particular attention here to the 14 July 2008 variation letter\n(“the 14 July letter”). It is of central importance in this trial and\nalmost the entirety of the trial was spent on interpreting the clauses\nin the 14 July letter (see[42]–[102]below). The purchase of 61 George Street 10     In\nJuly 2008, Edwards wanted to purchase 61 George Street Central, Burleigh\nHeads, Queensland 4220 (“61 George Street”). He sought a variation\nof the existing loan facility to obtain additional loan funds in order\nto assist in financing the purchase.[note: 27]On\n14 July 2008, Edwards signed the 14 July letter which set out how\nmuch funds would be made available to Edwards and what securities\nANZ wanted from Edwards. It also set out terms relating to the Loan\nto Security Ratio (“LVR”) and terms relating to the consequences\nof breaching certain LVRs (see[43]below\nfor the exact terms). On or about 25 July 2008, Edwards drew down\non the new facility. The amount required was AUD 1,714,879.11, of\nwhich Edwards requested that:[note: 28] (a)     AUD\n1,000,000 be converted to JPY, with the resulting loan being JPY\n103,709,000;[note: 29] (b)     AUD\n714,879.11 be converted to USD, with the resulting loan being USD\n688,078.29.[note: 30] 11     As\nof or about 25 July 2008, Edwards’ total loan principal under the Facility\nAgreement (“the Total Loan Principal”) was:[note: 31] (a)     AUD\n269,073.04; (b)     JPY\n180,297,938; and (c)     USD\n997,148.29. LVR exceeds 80% 12     On\n7 October 2008, the LVR was in excess of 80%, a stipulated threshold\nin the Facility Agreement (see[43]below).[note: 32]On\n10 October 2008, Crispe informed Edwards via email that a call had\nbeen triggered on the remaining loans.[note: 33]Crispe\nasked that Edwards call him to discuss his options. Crispe also\nattached to the email:[note: 34] (a)     A\nletter dated 9 October 2008 by Michael Byers, the Head of Risk and\nCompliance, Private Banking, Asia, by which ANZ informed Edwards\nthat: LVR was in excess of 90% and that Edwards was required to\neither (1) provide additional security of a pledged cash deposit\nof an amount not less than AUD 1,139,000; (2) reduce the loan outstanding\nby AUD 1,025,000; or (3) provide other security that would be acceptable\nto ANZ by 20 October 2008. If he did not do either of the three,\nANZ would exercise its right to convert Edwards’ loan outstandings.[note: 35] (b)     A\nspreadsheet summarising Edwards’ position, containing the value\nof the securities, the amount of loan outstandings, the maximum\napproved LVR and the amount of payment that needed to be made by\nEdwards to cure the LVR breach.[note: 36] Edwards proposes to repay loans 13     On\n10 October 2008, Edwards responded that he wanted to:[note: 37] (a)     liquidate\nthe funds that were being used as security for the facility; (b)     repay\nthe AUD loan in full; (c)     make\npartial repayment of the USD loan the following week; (d)nothave the loans converted. 14     On\nor about 24 October 2008, Edwards’ LVR was still in excess of 80%.[note: 38]On\n31 October 2008, Edwards informed Crispe via email that he had set\nup the standing instruction to transfer USD 10,000 a month, beginning\n3 November 2008.[note: 39]On\nor around 6 November 2008, USD 10,000 was received by ANZ.[note: 40] The first conversion (JPY to\nAUD) 15     On\n17 November 2008, Crispe informed Edwards over the phone that ANZ\nhad decided to convert all loan outstandings to AUD, as LVR was\nin excess of 90%. Edwards expressed disappointment and stressed\nthat he had the capacity to make payment to reduce the loan outstandings.[note: 41] 16     In\nemail replies on 18 November 2008, Edwards reiterated his proposals\nto avoid conversion. He proposed to pay the AUD loan with:[note: 42] (a)     at\nleast USD 200,000 from his bonus; (b)     proceeds\nfrom the sale of his Thai property; and (c)     proceeds\nfrom the sale of the Series 11 Fund. 17     He\nalso proposed to reduce the USD portion of the loan from approximately\nUSD 997,000 to USD 350,000.[note: 43]He\nwould then continue to pay USD 10,000 each month and add to these\nmonthly payments to make sure the rest of the USD loan was repaid\nin full in less than two years. These proposed payments would leave\nhim with the JPY portion outstanding.[note: 44] 18     In\nan email dated 18 November 2008, Crispe informed Edwards that the\nJPY loan would be converted to AUD but Edwards could retain the USD\nportion of the loan on the basis that USD 500,000 would be repaid\nby March 2009, with USD 300,000 paid from the proceeds of sale of\nthe Thai property and USD 200,000 from Edwards’ bonus. Upon conversion\nof the JPY loan to AUD, the proceeds from the sale of the Series\n11 Fund and term deposit of AUD 44,047.27 would be used to repay\npart of the AUD loan, with the remaining AUD loan being AUD 2,635,000.[note: 45]In response, Edwards’ sent an\nemail to Crispe the same day, proposing to pay an additional USD\n300,000 to avoid the conversion of the JPY loan. Edwards stated\nthat he may have to seek a loan from his employer to raise the USD 300,000.\nHe stated that this proposal would bring the LVR down to 90% in\na few months, and following from that, he could repay the remaining loans.[note: 46] 19     On\n19 November 2008, Crispe called Edwards to inform him that his proposal\nwas rejected. The JPY loan was to be converted but the USD portion\nof the loan could be retained.[note: 47]According\nto a diary note prepared by Crispe, Edwards expressed his disappointment\nover the JPY conversion and wanted to challenge the decision.[note: 48]Crispe advised that the decision was\nfinal and would not be reviewed.[note: 49]On\n20 November 2008, when the LVR stood at 120.93%, ANZ confirmed the\nconversion of the JPY loan to AUD by way of email and written confirmations\nwhich set out the amounts that were converted.[note: 50]JPY\n180,297,938.00 would be converted to AUD 2,962,518.97.[note: 51]The\nActual conversions took place on 25 November 2008 (LVR at 119.6%),\n17 December 2008 (LVR at 120.8%), and 26 March 2009 (LVR at 117%).[note: 52] 20     Between\nDecember 2008 and April 2009, Edwards liquidated some of the security\nthat he had pledged to ANZ and used the funds to repay his loans.\nHe also made monthly repayments of USD 10,000.00 from November 2008\nto March 2010, as proposed earlier (see[17]above).[note: 53]However,\nhe failed to make the USD 300,000 payment which was supposed to\ncome from the proceeds of sale of the Thai property and also did\nnot make repayments from his bonus, two repayments that were part\nof the same proposal.[note: 54]The\nUSD 10,000 payments were insufficient to reduce the loan significantly\nand the LVR remained in excess of 90%.[note: 55]Crispe reminded\nEdwards in an email of 3 March 2009 that the retention of the USD\nportion of the loan was conditional on the payments coming from Edwards’\nbonus and the proceeds of sale of the Thai property. Edwards replied\nthe same day via email, stating that his bonus was only USD 150,000 and\nthat it was payable in instalments. More importantly, Edwards demanded\nto know what assurance ANZ would give him before he would commit\nto repayment.[note: 56] 21     As\nof 16 April 2009, Edwards’ total outstandings under the Facility Agreement\nwere AUD 2,591,134.06 and USD 997,148.29.[note: 57]After\nthe earlier liquidations, the residual securities were the mortgages\nover 61 and 75 George Street.[note: 58]On\n3 April 2009, 29 April 2009 and 30 April 2009 ANZ sent letters to\nEdwards proposing repayment arrangements, but these were rejected\nby him.[note: 59] The second conversion (USD to\nAUD) 22     By\n6 May 2009, ANZ had not received the USD payment from the sale of\nthe Thai property. Crispe sent an email to Edwards on the same day informing\nEdwards that his USD loan outstandings would be converted to AUD\nif he did not furnish the sum of USD 285,000.[note: 60]Edwards replied the same\nday stating that the buyer of the property wanted three more months and\nthat the funds had not been transferred.[note: 61]Crispe\nreplied stating that ANZ was not prepared to offer any further concessions\nwith regard to the receipt of payments and would exercise its rights\nunder the Facility Agreement and convert the USD loan to AUD if\nthe payments were not received.[note: 62] 23     On\n7 May 2009, nearly seven months after default,[note: 63]Crispe informed\nEdwards that his USD loan outstandings would be converted[note: 64]and\nconfirmed the conversion by way of written confirmations.[note: 65]The total\nloan outstandings in USD of USD 997,148.29 would be converted to AUD\n1,332,144.82.[note: 66]The conversions took place\non 15 May 2009[note: 67](LVR at 118.4%),\n22 May 2009[note: 68](LVR\nat 117.4%) and 25 September 2009[note: 69](LVR\nat 117.4%). Post conversions 24     As\nof 25 September 2009, Edwards’ total loan outstanding was AUD 3,923,278.88\n(“the post conversion amount”).[note: 70] 25     In\na letter dated 22 October 2009 (“the 22 October letter”), ANZ offered\nEdwards, on a without prejudice basis, certain terms of repayment.[note: 71]Edwards\nsigned the letter, acknowledging that the total debt owing by him\nas at 19 October 2009 was that of the post conversion amount.[note: 72] Events leading to trial 26     On\n14 March 2010, Edwards sent an email to ANZ informing the bank that\nhe was no longer able to meet him repayment obligations (as agreed\nto in the 22 October letter) and proposed two alternative repayment plans.[note: 73]On 29 March 2010, Edwards\nrequested a copy of the facility letters from ANZ.[note: 74]From April to May 2010, ANZ’s\nemployees and Edwards engaged in discussions to restructure the\nloans.[note: 75]In\nMay 2010, Edwards made a complaint to the Australian Financial Ombudsmen\nService.[note: 76]ANZ ceased\ndiscussions with Edwards.[note: 77]In\nJune 2010, Edwards contacted ANZ regarding the sale of 75 George\nStreet.[note: 78]On\n30 June 2010, ANZ’s solicitors sent a letter of demand to Edwards.[note: 79]On\n5 July 2010, Edwards commenced these legal proceedings.[note: 80]On\n21 July 2010, pursuant to Clause 21 of the T&Cs, ANZ issued\na Conclusive Certificate for the amount of AUD 4,021,855.59. Edwards\nargued that this certificate was not sent to him.[note: 81]This\namount consisted of:[note: 82] (a)     Principal\nsum: AUD 3,923,278.88; (b)     Interest\naccrued pursuant to Clause 4 of the 23 October 2009 Variation Letter:\nAUD 95,902.51; (c)     Default\nFee pursuant to Clause 7 of the T&Cs: AUD 1,024 (SGD 1,200 converted\nat SGD/AUD rate of 0.8535); and (d)     Valuation\nFees pursuant to Clause 15 of the T&Cs: AUD 1,650.00. 27     On\nor about 30 August 2010, Edwards, with ANZ’s consent, sold 75 George\nStreet for AUD 1.1 million and ANZ received the sale proceeds of AUD\n1,057,059.96[note: 83],\nwhich was set off against ANZ’s counterclaim.[note: 84]",
        "Summary of Pleadings": "28     Edwards’\nclaims against ANZ are: (a)     A\ndeclaration that the two conversions amounted to breaches of ANZ’s\nduties to Edwards and were invalid; (b)     Further\nor in the alternative, damages for ANZ’s breaches to be assessed; (c)     Interest; (d)     Costs;\nand such further or other relief as the Court deems fit. 29     ANZ’s\ncounterclaim is:[note: 85] (a)     A\nsum of AUD 2,964,795.63; and (b)     Default\ninterest on the sum of AUD 4,021,855.59 at the rate of 4% per annum\nabove ANZ’s Costs of Funds, from 21 July 2010 to 29 August 2010;\nand (c)     Default\ninterest on the sum of AUD 2,964,795.63 at the rate of 4% per annum\nover ANZ’s Costs of Funds, from 30 August 2010 until date of full\npayment; and (d)     Costs\non an indemnity basis.",
        "Issues before this Court": "30     This\ncase centres on the construction of 2 clauses which formed part of\nthe 14 July letter.[note: 86] 31     Edwards’\ncase was that the only real issue was whether the Variation Letter\ngave ANZ the right to convert the denominations of the currency used\nin the loans. He submitted that the Variation Letter clearly did\nnot give ANZ this right.[note: 87]In\ndeploying this argument, he assailed certain words in the two clauses\nand argued, in the main, that the contract was uncertain. 32     Before\nI begin on the issues, though, it would be useful to set out the law\nthat governs cases such as this which turn on the interpretation\nof contracts.",
        "The law on contractual interpretation": "33     The\ninterpretation of a contract is an objective exercise. This was made\nclear by the Court of Appeal inZurich Insurance\n(Singapore) Pte Ltd v B-Gold Interior Design & Construction\nPte Ltd[2008] 3 SLR(R) 1029; [2008] 3 SLR 1029 (“Zurich Insurance”), where the court (at\n[131]) endorsed a summary of principles set out by Gerard McMeel\nin his book,The Construction of Contracts:\nInterpretation, Implication, and Rectification(Oxford\nUniversity Press, 2007) (“McMeel”),\ntwo of which I find useful to set out as a backdrop for the exercise\nof construction that this case requires: The aim of\nconstruction First, the aim of the exercise of construction of a contract\nor other document is to ascertain the meaning which it would convey\nto a reasonable business person. The objective\nprinciple Secondly, theobjective principleis\ntherefore critical in defining the approach the courts will take.\nThey are concerned usually with the expressed intentions of a person,\nnot his or her Actual intentions. The standpoint adopted is that of\na reasonable reader. 34     Lord\nSteyn referred to this objective exercise inSirius\nInternational Insurance Co (Publ) v FAI General Insurance Ltd and\nothers[2004] UKHL 54 (at[18]-[19]), where he addressed the approach\nto take when construing a commercial instrument: The settlement contained in the Tomlin\norder must be construed as a commercial instrument. The aim of the\ninquiry is not to probe the real intentions of the parties but to\nascertain the contextual meaning of the relevant contractual language.The inquiry is objective: the question is what a reasonable\nperson, circumstanced as the Actual parties were, would have understood\nthe parties to have meant by the use of specific language.The answer\nto that question is to be gathered from the text under consideration and\nits relevant contextual scene. There has been a\nshift from literal methods of interpretation towards a more commercial\napproach.InAntaios Compania Naviera\nSA v Salen Rederierna AB[1985] AC 191, 201 , Lord Diplock,\nin an opinion concurred in by his fellow Law Lords, observed:\"if detailed semantic and syntactical analysis of a\nword in a commercial contract is going to lead to a conclusion that\nflouts business common sense, it must be made to yield to business\ncommon sense.\"InMannai Investment\nCo Ltd v Eagle Star Life Assurance Co Ltd[1997] AC 749,\n771, I explained the rationale of this approach as follows: \"In determining the\nmeaning of the language of a commercial contract ... the law ...\ngenerally favours a commercially sensible construction. The reason\nfor this approach is that a commercial construction is more likely\nto give effect to the intention of the parties.Words\nare therefore interpreted in the way in which a reasonable commercial\nperson would construe them. And the standard of the reasonable commercial\nperson is hostile to technical interpretations and undue emphasis\non niceties of language.\" The tendency should\ntherefore generally speaking be against literalism.What\nis literalism? It will depend on the context. But an example is given\ninThe Works of William Paley(1838\ned), vol III, p 60. The moral philosophy of Paley influenced thinking\non contract in the 19thcentury. The\nexample is as follows: the tyrant Temures promised the garrison\nof Sebastia that no blood would be shed if they surrendered to him.\nThey surrendered. He shed no blood. He buried them all alive. This\nis literalism. If possible it should be resisted in the interpretative process.\nThis approach was affirmed by the decisions of the House inMannai Investment Co Ltd v Eagle Star Life Assurance\nCo Ltd[1997] AC 749, 775 e-g, per Lord Hoffmann and\ninInvestors Compensation Scheme Ltd v West\nBromwich Building Society[1998] 1 WLR 896, 913 d-e,\nper Lord Hoffmann. 35     The\nobjective nature of the inquiry as set out in the above case was referred\nto in the Court of Appeal case ofThe “Asia\nStar”[2007] 3 SLR(R) 1 (at[36]).\nI now turn to addressing the parties’ arguments. As will be seen, Edwards’\narguments were essentially in the same vein as the literalism Lord Steyn\ncautioned against.",
        "Are the terms in the 14 July\nletter unknown?": "36     This\nwas an argument that Edwards raised at a rather belated stage.[note: 88]Edwards\napplied, on the second day of trial, to amend his pleadings to take this\nargument into account.[note: 89]He\nargued that the 14 July letter was impossible to understand because\nit varied a “mysterious facility letter dated 10 December 2007 whose\nterms are unknown” (“the 10 December Facility Letter”)[note: 90]. For\nclarity, this was what the beginning of the 14 July letter stated:[note: 91] We refer to our facility letter dated 10 December\n2007 (hereinafter shall be referred to as the “Facility Letter”). Further to your request for an additional\nloan facility, we are pleased to revise the following clauses of\nthe Facility Letter. Terms defined and references construed in the\nFacility Letter have the same meaning and structure in this letter. 37     Edwards\nthen argued that the terms of the 10 December Facility Letter were\nessential to a proper understanding of the terms and structure of\nthe 14 July letter.[note: 92] 38     There\nwere two more documents that were referred to by the parties: (a)     an\nunsigned 10 December 2007 variation letter titled “Facility Letter\n1” (“the unsigned letter”);[note: 93] (b)     another\n10 December 2007 letter (“the second 10 December letter”).[note: 94] 39     Crispe\ntestified that the unsigned letter that was produced in discovery\nwasthe10 December Facility Letter.[note: 95]ANZ’s\narguments were as follows: (a)     The\n10 December Facility Letter was immaterial to the interpretation\nof Clauses 14 and 16.[note: 96] (b)     The\nunsigned letterwasthe 10 December\nFacility Letter that was referred to in the 14 July letter. ANZ\nargued that though Edwards claimed to have signed a letter (meaning\nthat the unsigned letter could not be the letter referred to), he\ndid not deny that the unsigned letter bore the same terms as the\n10 December Facility Letter which formed part of the facility arrangement.[note: 97] (c)     The\ncontents of the second 10 December letter and the evidence of Crispe\nclarified that the second 10 December letter related to a separate\nterm loan facility.[note: 98] (d)     This\ncontention regarding the referencing of the correct letters was\nnot a genuine contention but an afterthought that came up only during\ntrial. The contention did not appear anywhere in Edwards’ pleadings,\nearlier affidavits or AEIC, despite the unsigned letter having been\ndisclosed by ANZ very early in the proceedings.[note: 99]The remedial\nAction taken by Edwards’ was to seek to apply to amend his pleadings\non the second day of trial. This was dismissed by the court.[note: 100] 40     As\nI stated when I dismissed the application to amend during the trial, I\nwas of the view that it was incumbent on Edwards, having contested\nthat the letter was not the same one as the one he signed, to prove\nhis assertion by oral or documentary evidence. To continue to contend\nthat the unsigned letter was a mystery letter thatcouldhave\nbeen a version different from the 10 December Facility Letter, in\nand of itself and without proof, would be a venture into the realm\nof speculation.[note: 101] 41     Ideally,\nof course, I would have preferred to have had sight of a signed copy\nof the 10 December Facility Letter. However, this was not produced and\nEdwards’ inability to prove his assertion leaves me with the version\nthat ANZ has produced, the unsigned letter, which I take to contain\nthe contents of the 10 December Facility Letter.",
        "Construction of Clauses 14 and\n16 of the 14 July letter": "42     The\n14 July letter was a document that both parties placed a great deal of\nemphasis on. It was a variation letter sent to Edwards from ANZ’s\nHead of Risk and Compliance for its Private Bank division, Michael\nByers.[note: 102] 43     It\nwould be beneficial to set out the relevant clauses of the 14 July letter\nin full. The relevant clauses are: ... 12. SECURITY The following security document(s) completed shall continue\nto be held by the Bank as security. It is necessary for the securities\nto be legally enforceable and in form and substance satisfactory\nto the Bank: i)A\nFirst Registered Mortgage over the property located at 75 George Street,\nBurleigh Heads, QLD 4220, Australia (herein referred to as “Property\n1”); - Held ii)A First Registered Mortgage over the\nproperty located at 64 [sic] George\nStreet, Burleigh Heads, QLD 4220, Australia (herein referred to as\n“Property 2”); iii)An Assignment of the Fire Insurance\nPolicy to the Bank or its nominees; iv)A Letter of Charge (Direct) over the\nterm deposit(s) (“Term Deposit”) in a deposit account with Australia\nand New Zealand Banking Group Limited, Singapore Branch held in\nthe name of Jason Glenn Edwards (“the “Depositor”). The total amount\nof the Term Deposit must be for an account to be determined by the\nBank and agreed with the Borrower in accordance with the clawback\nconditions herein; v)A Letter of Charge (Direct) over AUD511,650.00\nof Series 11 OM-IP 220 Limited (herein referred to as “Fund”) registered\nin the name of ANZ IPB Nominees Pte Ltd and held to our order. The\nFunds should be rated A or better but should any funds be replaced\nas a result of Clause 4 herein then the Letter of Charge shall be\nover the replacement funds as well. – Held The above (i) and (ii) shall hereinafter\ncollectively be referred to as the “Property” and together with\n(iii), (iv), and (v) shall herein constitute as “Security”, which\nexpression shall, where there is more than one security, include\nany one or more of them. In addition to the specific security documentation\ndetailed, the Borrower will execute (or arrange to have executed)\nany supplemental and ancillary documents or any other security document\nthe Bank may require to perfect the Security detailed herein from\ntime to time. In order to ensure the Bank is entitled\nto vacant possession of any security property, the Borrower of the\nsecurity provider undertakes to (if requested by the Bank) execute\n(or arrange to have executed) any supplementary or ancillary documentation\nas may be required by the Bank from time to time. 13. CONDITIONS\nPRECEDENT The Bank’s obligations under this Facility Letter are subject\nto all the following conditions precedent being met to the Bank’s\nsatisfaction: (a)The Bank receives a copy of the insurance for the Property; (b)The Bank receives a copy of receipt\nevidencing full payment of the Borrower’s equity portion for the\npurchase of Property 2; (c)The Banks receives an executed copy\nof the Sale & Purchase Agreement of Property 2; (d)The Bank receives a copy of a new\nvaluation report for Property 1; (e)The Bank receives the duplicate copy\nof this Facility Letter duly accepted and signed by the Borrower; (f)Completion of all security documents; (g)Completion of all terms and conditions\noutlined in this Facility Letter. 14. GENERAL\nCONDITIONS The Bank reserves the right to: (a)require the Borrower to reduce the amount owing or contingently liable\nunder the Facility in the event that the loan/security ratio exceeds 80%.\nFor the purpose of calculating this ratio in this sub-clause, security\nis the total value of the Property and Fund held and pledged to the\nBank assessed in the Bank’s sole discretion. The Bank may in its absolute\ndiscretion, in addition, require the Borrower to provide such further\nsecurity in such form and substance as shall be satisfactory to the\nBank; (b)require the Borrower to re-denominate\nthe Facility into a different currency other than USD/SGD/JPY upon\nchange in currency of the Borrower’s main income in USD/SGD. ... 16. CLAWBACK\nCONDITION Subject to the provisions in clause 14, in the event the outstanding\nloan amount is denominated in a different currency to the currency\nof the Security, the following clawback conditions will apply: (a)For the purposes of this clause, the loan to security ratio\nis the ratio of the outstanding amount(s) and/or contingent liabilities\nof the Facility after notional conversion(s)* (at the prevailing\nrate(s) as determined solely by the Bank which may include the Bank’s\nown prevailing rate(s)) into the currency that the Property/ Fund\nis denominated in, expressed as a proportion of the value of assets\nheld and charged as Property/ Fund by the Bank. The term “currency that the Security is\ndenominated in” shall in the case where immovable security is concerned,\nrefer to the currency of the country in which the immovable security\nis situated and in the case of movable security, shall refer to\nthe currency in which the Security is denominated in. * If there are more than two currencies\ninvolved in the notional conversions, the Bank shall have the sole\nright to determine the relevant base currency to be utilized for\nthe notional conversions for comparison purposes. (b)If at any time (for the avoidance of doubt, this includes\nthe period from the booking date of any spot foreign exchange contract(s)\nto the value date of the same) the loan to security ratio should\nexceed 80%, then the bank may demand that the Borrower deposit an\namount in a currency acceptable to the Bank equal to the excess\nover a 80% loan to security ratio in a deposit account with the\nBank in the name of the Borrower but charged to the Bank and/or\nprovide to the Bank such additional securities, in form and substance\nsatisfactory to the Bank, and in such value as the Bank may require,\nat the option of the Bank. (c)If such deposits and/or securities\nas provided for in CLAWBACK CONDITION – Clause 13(b) above are not\nreceived within 3 days of such demand, or should the loan to security\nratio exceeds 90% at any time, then the Bank at its absolute discretion\nmay immediately convert the relevant amount in CLAWBACK CONDITION\n– Clause 13(a) into any currency (at the Bank’s then prevailing\nrate of exchange) that the Bank deems fit in order to fully eliminate\nits foreign exchange risks. All costs associated with such conversion\nwill be for the Borrower’s account. The Bank shall also not be held\nresponsible in any way if it chooses not to convert at any level\nbut instead continues to demand for additional securities or if\nit chooses to convert when the loan to security ratio is higher\nthan 90%. Following any conversion, the loan to security ratio will\nstill have to be re-instated to 80%. ... 44     It\nwas explained by ANZ during the trial that the reference to “Clause 4”\nin Clause 12(v) was Actually a reference to Clause 12(iv). Having\nset out the relevant clauses, I now address the arguments relating\nto them.",
        "Was ANZ only entitled to effect\na redenomination of Edwards’ loans upon a change of currency of\nhis income, by virtue of clause 16 being read with clause 14?": "45     Edwards’\nposition is that, consistent with ANZ’s promotional material and\nEdwards’ own understanding of the matter from the outset and the\nclear terms of the 14 July letter, ANZ was only entitled to effect\na redenomination of Edwards’ loans upon a change of currency of\nEdwards’ income.[note: 103] 46     In\nsupport of this position, Edwards relies on the words “Subject to the\nprovisions in clause 14...” at the beginning of Clause 16 and argues\nthat the clear and obvious meaning of these words is that Clause\n16 is subservient to Clause 14.[note: 104]He\nargues that:[note: 105] (a)     Any\nlimitations applicable to the dominant clause will apply equally\nto the subservient clause.[note: 106] (b)     Clause\n14, the dominant clause, states that ANZ couldonlyredenominate\nloans upon a change in Edwards’ income currency. (c)     Clause\n16, being subservient, must be limited by the same. (d)     Accordingly,\nbecause the currency of Edwards’ main income never changed, ANZ\ndid not have any right to redenominate his loans.[note: 107] 47     Edwards\nargues that if it was intended that Clause 16 could provide for\nredenomination in circumstances not envisaged by Clause 14, Clause\n16 would have started with the words “Notwithstanding the provisions\nin Clause 14” and not “Subject to the provisions in Clause 14”.[note: 108] 48     ANZ’s\nposition is that Edwards’ interpretation is ill fitting and submits\nas follows: (a)     the\nmeaning of “Subject to the provisions in clause 14” in Clause 16\nis that the rights or obligations in Clause 16 are subject to ANZ having\nthe rights that it has reserved in Clause 14.[note: 109] (b)     Clause\n14 is not a clause that sets out limitations or conditions on ANZ’s\nrights. 49     I\nagree with ANZ’s argument that Clause 14 is not a clause that sets out\nlimitations or conditions on ANZ’s rights. Firstly, clause 14 relates\nto “General Conditions”. By this, I understand that the two rights\nANZ reserves to itself in Clause 14(a) and (b) are the right to\nrequire the borrower to reduce the amount owing under the Facility\nAgreement if LVR exceeded 80%, and the right to require Edwards\nto redenominate the Facility into a different currency other than\nUSD/SGD/JPY upon a change in the currency of his main income. 50     The\nscenario envisioned in Clause 16 is a slightly different one. Here, the\nevent that is being considered is that of the outstanding loan amount being\ndenominated in a currency different from the currency of the Security.\nWhen a scenario falls under this description, the clawback conditions\nin Clause 16 will apply. The words “Subject to the provisions in clause\n14...”, in my opinion, mean that ANZ retains the two rights in Clause 14\nbutinthis\nparticular situationof there being an outstanding loan amount\nthat is denominated in a currency different from the currency of the\nSecurity, the clawback conditions in Clause 16 will apply. In a\nsense, Clause 16 is a sub-specie of the general scenarios envisaged\nin Clause 14. 51     Accordingly,\nI do not agree with Edwards’ submission that ANZ was only entitled\nto effect a redenomination of the loan upon a change of currency\nof his income.",
        "Problems with Clause 16(c)": "52     For\nease of reference and understanding, I set out Clause 16(c) again. I\nhave emphasized the phrases in the clause which are the bone of contention\nhere: If such deposits and/or securities as provided\nfor inCLAWBACK CONDITION – Clause 13(b)above\nare not received within 3 days of such demand, or should the loan\nto security ratio exceeds 90% at any time, then the Bank at its\nabsolute discretion may immediately convert therelevant amountinCLAWBACK CONDITION – Clause 13(a)into\nany currency (at the Bank’s then prevailing rate of exchange) that\nthe Bank deems fit in order tofully eliminate\nits foreign exchange risks. All costs associated with\nsuch conversion will be for the Borrower’s account. The Bank shall\nalso not be held responsible in any way if it chooses not to convert\nat any level but instead continues to demand for additional securities\nor if it chooses to convert when the loan to security ratio is higher\nthan 90%. Following any conversion, the loan to security ratio will\nstill have to be re-instated to 80%. Were the references to Clause\n13(a) and (b) in Clause 16(c) typographical errors? 53     Edwards’\ncase is as follows: Clause 13(b) makes no reference to “additional\nsecurities” that Edwards may be required to furnish to ANZ.[note: 110]Similarly, Clause 13(a) does not\nrefer to any relevant amount for any “CLAWBACK CONDITION”.[note: 111]The only thing that is clear about Clause\n16(c) is that it does not give ANZ the right to redenominate Edwards’\nfacilities in the manner that it did.[note: 112] 54     ANZ’s\ncase is that the references to “CLAWBACK CONDITION – Clause 13(a)”\nand “CLAWBACK CONDITION – Clause 13(b)” in Clause 16(c) were typographical\nerrors.[note: 113]ANZ\ndoes not deny making a mistake in the references to Clause 13(a)\nand (b).[note: 114]ANZ\nargues that the correct references should be to “CLAWBACK CONDITION\n– Clause 16(a)” and “CLAWBACK CONDITION – Clause 16(b)” respectively. 55     First,\nClause 16 is the only clause in the 14 July letter that is titled “CLAWBACK\nCONDITION” and the inclusion of the phrase “CLAWBACK CONDITION”\nin the erroneous references indicates clearly that Clause 16(c)\nwas referring to Clauses 16(a) and 16(b).[note: 115] 56     Second,\nthe terms “relevant amount” and “deposits and/or securities” are\nnot mentioned in Clause 13 at all. Clause 13 (titled “CONDITIONS PRECEDENT”)\ndeals with completely different subject matters and that makes it\neven clearer that parties could not have intended the references\nto be to Clauses 13(a) and 13(b), which provide that ANZ’s obligations\nunder the Facility Letter are subject to the bank receiving a copy\nof the insurance for the two properties in issue and a copy of the\nreceipt evidencing full payment of Edwards’ equity portion for the\npurchase of 61 George Street (wrongly stated as 64 George Street\nin Clause 12(ii) and as 6 George Street in Clause 6). . 57     Third,\nthe initial facility letter of 24 January 2006 (“the Initial Facility Letter”)\nthat was signed by Edwards has the same “CLAWBACK CONDITION” clause\nat Clause 16, where the references to the sub-clauses are correct.\nClause 16 of the Initial Facility Letter reads as follows: 16. CLAWBACK CONDITION Subject to the provisions in clause 14, in the event the outstanding\nloan amount is denominated in a different currency to the currency\nof the Security, the following clawback conditions will apply: (a)For the purposes of this clause, the loan to security ratio\nis the ratio of the outstanding amount(s) and / or contingent liabilities\nof the Facility after notional conversion(s)* (at the prevailing\nrate(s) as determined solely by the Bank which may include the Bank’s\nown prevailing rate(s)) into the currency that the Property is denominated\nin, expressed as a proportion of the value of the assets held and\ncharged as Property by the Bank. The term “currency that the Property is\ndenominated in” shall in the case where immovable property is concerned,\nrefer to the currency of the country in which the immovable property\nis situated and in the case of movable property, shall refer to\nthe currency in which the Security is denominated in. * If there are more than two currencies\ninvolved in the notional conversions, the Bank shall have the sole\nright to determine the relevant base currency to be utilised for\nthe notional conversions for comparison purposes. (b)If at any time (for the avoidance of doubt, this includes\nthe period from the booking date of any spot foreign exchange contract(s)\nto the value date of the same) the loan to security ratio should\nexceed 55%, then the Bank may demand that the Borrower deposit an\namount in a currency acceptable to the Bank equal to the excess\nover a 55% loan to security ratio in a deposit account with the\nBank in the name of the Borrower but charged to the Bank and/or\nprovide to the Bank such additional securities, in form and substance\nsatisfactory to the Bank and in such value as the Bank may require,\nat the option of the Bank. (c)If such deposits and/or securities\nas provided for in CLAWBACK CONDITION – Clause 16(b) above are not\nreceived within 3 days of such demand, or should the loan to security\nratio exceeds 65% at any time, then the Bank at its absolute discretion\nmay immediately convert the relevant amount in CLAWBACK CONDITION\n– Clause 16(a) into any currency (at the Bank’s then prevailing\nrate of exchange) that the Bank deems fit in order to fully eliminate\nits foreign exchange risks. All costs associated with such conversion\nwill be for the Borrower’s account. The Bank shall also not be held\nresponsible in any way if it chooses not to convert at any level\nbut instead continues to demand for additional securities or if\nit chooses to convert when the loan to security ratio is higher\nthan 65%. Following any conversion, the loan to security ratio will\nstill have to be re-instated to 55%. 58     ANZ\nthen submits that the court has the power to correct obvious mistakes\nin the written expression of the intention of the parties and, once corrected,\nthe contract is interpreted in its corrected form.[note: 116] 59     I\nfind ANZ’s arguments on this matter persuasive. First, the clauses referred\nto in Clause 16(c) were labelled “CLAWBACK CONDITION - 13(a)” and\n“CLAWBACK CONDITION - 13(b) above”. In the 14 July letter, there\nare no other clauses with the heading “CLAWBACK CONDITION”. Second,\na similar clause in the Initial Facility Letter referred correctly\nto Clauses 16(a) and (b). 60     I\nadopt the principle set out in Kim Lewison,The\nInterpretation of Contracts(Sweet & Maxwell, 5thEd,\n2011) (\"Lewison\") at para 9.01,\np 465: As part of the process of construction\nthe court has power to correct obvious mistakes in the written expression\nof the intention of the parties. Once corrected, the contract is\ninterpreted in its corrected form. 61     The\nlearned author goes on to cite a few cases supporting the proposition,\ntwo of which I find useful in the present case. InEast\nv Pantiles (Plant Hire) Ltd[1982] E.G.L.R 111, a case\nwhich the parties also cited in their submissions,[note: 117]Brightman LJ held: Two conditions must be satisfied: first\nthere must be a clear mistake on the face of the instrument; secondly\nit must be clear what correction ought to be made in order to cure\nthe mistake. If those conditions are satisfied, then the correction\nis made as a matter of construction. 62     InG & s Brough Ltd v Salvage Wharf Ltd[2009]\nEWCA Civ 21, Jackson LJ stated: Where a written agreement as drafted is\na nonsense and it is clear what the parties were trying to say the\ncourt will, as a matter of construction, give effect to the obvious\nintention of the parties. 63     Clause\n16(c) was deliberately inserted in the contract for one clear reason.\nThis is to allow the bank to convert, at its discretion, the relevant amount\ninto any currencyifthe borrower\ndoes not provide additional deposits or securities. If Clause 16(c)\nrefers to Clause 13(a) and Clause 13(b), which speak of a copy of\nthe insurance and a receipt for full payment respectively, it would\nbe, in the words of Jackson LJ, nonsense. Clause 16(a) and Clause\n16(b) are clearly the clauses that ANZ intended to refer to in the 14 July\nletter and ANZ’s error, which it has admitted was a careless one,\nis an obvious typographical error. The obvious mistake can be easily\nand fairly rectified and I do not think that Edwards can honestly\nclaim to have been misled or prejudiced in any way by the error\nin the clause numbers. In the same vein, Edwards was also not misled\nby the wrong house number in Clause 12(ii) where 61 George Street\nwas, again carelessly, stated as 64 George Street. Accordingly,\nI treat the references to Clauses 13(a) and (b) as references to\n16(a) and 16(b). Even if Clause 16(c) referred\nto Clause 16(a) and Clause 16(b), the 14 July letter failed to identify\na “relevant amount” in Clause 16(a) for the purposes of Clause 16(c) 64     Edwards\nargues that Clause 16(a) does not provide for any “relevant amount”.[note: 118]He says that Clause 16(a) is simply\na definition clause and provides for a mechanism for a notional\ndetermination of the loan to security ratio.[note: 119] 65     ANZ\nargues that the “relevant amount” is the outstanding amount(s) that\nis not in the currency of the Property / Fund (“Property” and “Fund”\nas defined in Clause 12 of the 14 July letter) which is the subject\nof the notional conversion done in Clause 16(a). 66     In\nmy view, Edwards is correct in characterising Clause 16(a) as a definition\nclause. However, it is also clear from the opening words of Clause 16(a)\n(viz, “For the purposes of this\nclause...”) that the definition of LVR set out in 16(a) applies\nto the entire of Clause 16. To understand the meaning of “relevant\namount”, one has to look at Clause 16 in its entirety. It is from examining\nClause 16 as a whole that I take the view that “relevant amount” refers\nto the outstanding loan amount denominated in currencies other than\nthe currency the securities are denominated in. I agree with Edwards that\nbased on apurely literalreading\nof Clause 16(a), there is no use of the term “relevant amount” or\nany figure that would be seen as a “relevant amount”. However, I\ndo not think that means, in the words of Edwards, that “it is impossible\nto say what conversions were envisaged” and that the clause is void\nfor uncertainty. I refer to the case ofTravista\nDevelopment Pte Ltd v Tan Kim Swee Augustine and others[2008]\n2 SLR(R) 474; [2007] SCGA 57, where the Court of Appeal held (at[20]): The law on documentary construction is\nclear. It is an established principle of documentary interpretation\nthat a clause must not be considered in isolation, but must instead\nbe considered in the context of the whole document. 67     This\nproposition is also addressed inZurich Insurance,\nwhere it was made clear that when construing contracts, the court\nwill take a holistic approach (at [131]): The holistic\nor 'whole contract' approach Thirdly, the exercise is one based on the whole contract or\nan holistic approach. Courts are not excessively focused upon a\nparticular word, phrase, sentence, or clause. Rather the emphasis\nis on the document or utterance as a whole. 68     Applying\nthis principle, Clause 16(a) should not be considered in isolation\nbut must be considered in the context of the whole document. In this\ncase, Clause 16(a) refers to the “outstanding amount”. Just above\nthat, there is the phrase “...in the event\nthe outstanding loan amount is denominated in a different currency\nto the currency of the Security...”. Seen in totality,\nthese references to the “outstanding amount” provide the answer to\nthe question as to what “relevant amount” refers to. This outstanding loan\namount which is denominated in a currency different from the currency\nof the Security in Clause 16 was the subject of the conversion ratio in\nClause 16(a) which was referred to in Clause 16(c). 69     Accordingly,\nI disagree with Edwards’ submissions that the 14 July letter failed\nto identify a “relevant amount” for the purposes of Clause 16(c). A conversion of the loan should\nnot have been performed, as the “outstanding loan amount” referred\nto in Clause 16 was not denominated in a different currency to the\ncurrency of the security 70     Edwards\nargues that Clause 16 does not envisage situations where loans in\nmultiple currencies were secured by assets in multiple currencies.[note: 120]Accordingly, Clause 16 does not apply\nto the present case. 71     He\nsupports this by stating, first, that the outstanding loan amount here\nwas not denominated in a currency different from the currency of\nthe security. Two of the loan tranches (Tranches 2 and 8) were denominated\nin AUD. This was the same currency as the mortgaged properties.\nThe “outstanding loan amount” could not be converted to the currency\nof the security, as part of it wasalreadyin\nthat currency.[note: 121] 72     Second,\nhe states that Clause 16 refers to the “currency of the Security”.\nThis shows that the clause does not cover a situation where loans in\nmultiple currencies were secured by securities in multiple currencies.\nHe points out that the securities in this case included:[note: 122] (a)     a\nterm deposit of AUD 44,047.27 and a cash pledge of SGD 42,000; (b)     an\ninvestment in a fund known as Series II OM-IP 220 Limited in the\namount of AUD 511,650; and (c)     an\ninvestment in Nomura Protected Global Emerging Market Notes in the\nvalue of around USD 500,000. 73     He\nthen closes his argument by raising the question: for the purpose of\ncalculating the LVR, which security currency is to be used?[note: 123] 74     ANZ\nhas four main counter-arguments. First, ANZ argues that the phrase\n“in the event the outstanding loan amount is denominated in a different\ncurrency to the currency of the Security” refers to the situation where\nany portion of the outstanding loan is denominated in a currency different\nfrom the currency of the security.[note: 124] 75     Second,\nANZ points to the purpose of Clause 16. ANZ argues that Clause 16\nis there to eliminate ANZ’s foreign exchange risk resulting primarily\nfrom a depreciation of the currency of the security against the different\ncurrency or currencies of the outstanding loan. The risk is present as\nlong as any part of the loan amount is in a currency that differs\nfrom the currency of the security. Accordingly, the phrase “in the\nevent the outstanding loan amount is denominated in a different\ncurrency to the currency of the Security” has to include the situation\nwhere any portion of the outstanding loan is in a currency different\nfrom that of the security.[note: 125] 76     Third,\nANZ addresses the second argument of Edwards that the clause does\nnot cover a situation where loans in multiple currencies were secured\nby securities in multiple currencies (at[72]above).\nANZ argues that this argument was made without the benefit of careful examination[note: 126]and follows up by referring to Clause\n12 of the 14 July letter (see[42]above).\nANZ argues that under Clause 12, “Security” encompasses the mortgages\nover 61 and 75 George Street, the assignment of the properties’\nfire insurance policy to ANZ, the charge over the term deposit (AUD\n44,047.27) and the charge over AUD 511,650.00 Series 11 OM-IP 220\nLimited. ANZ argues that these are all denominated in AUD.[note: 127]However, Edwards, in his reply submissions,\nrefers to paragraph 44(d) of Crispe’s AEIC, where it states that\nANZ held a cash pledge of SGD 42,000. Accordingly, the term deposit\nof AUD 44,047.27 was not the only term deposit held as security. 77     Fourth,\nto the question posed by Edwards as to which security currency is\nto be used for the purpose of calculating the LVR (see[73]above), ANZ states that the\ncurrency of the security refers to the currency of the Property\n(defined in Clause 12 of the 14 July letter to mean 61 and 75 George\nStreet)andthe Fund (as defined\nin Clause 12 of the 14 July letter) and the express provisions of\nboth Clauses 14(a) and 16(a) of the 14 July letter provide guidance\nfor this. Both the Property and the Fund are denominated in AUD.[note: 128] 78     It\nis clear to me that the scenario this case presents is on all fours\nwith that envisaged in Clause 16. I agree with ANZ’s arguments.\nThe only hesitation I have with regard to the third argument of\nANZ was Edwards’ counter-argument in his Reply that Crispe had asserted\nthere were other term deposits that were not denominated in AUD.[note: 129]Having\nreferred to the paragraph cited (paragraph 44(d)), I see no such\nreference to the cash pledge in SGD. However, Maya Lim’s evidence\nwas that sometime in October or November 2008, a term deposit of\nAUD 44,047.27 (which is unobjectionable, being in AUD)anda cash pledge of SGD 42,000 were pledged\nby Edwards as security under the facility arrangement.[note: 130]Seeking to\nclarify this by going through the other pieces of evidence, I find\nthat Crispe’s evidence (at a different location from where counsel\npointed me to) reiterates that on 30 October 2008, AUD 44,027.27\nand SGD 42,000 were both pledged as security for the Facility Agreement.[note: 131]Does\nthis now mean that there is no singular currency for the Security\nas claimed by ANZ and if so, is the clause operative? 79     Before\nI answer these questions, there appears to be some confusion over\nthe SGD cash pledge and the AUD 44,047.27. Maya Lim’s evidence was\ncorrected by Crispe’s evidence. Crispe stated that the term deposit\nof AUD 44,047.27 and the cash pledge of SGD 42,000 were, in addition\nto another term deposit of AUD 27,861.26, pledged for the purposes\nof aseparatestandalone facility\ndated 3 April 2008, under which a loan of USD 400,000 was disbursed\nto the Plaintiff. This loan was secured in the 3 April 2008 facility\nagreement by Edwards’ investment of USD 500,000 in Global Emerging\nMarket Notes. The term deposits were pledged on 15 August 2008 as\nadditional security when the LVR for the USD 400,000 loan was breached\nand the SGD 42,000 was used to meet interest payments on that same\nloan on 10 October 2008.[note: 132]However,\nthe SGD 42,000 was not used to pay down the interest as the said\nNotes were sold on 16 October 2008 and the proceeds from the sale\nwere sufficient to repay the loan in full. As the term deposits\nand the cash pledge were no longer required for the USD 400,000\nloan facility, a request was made on 30 October for the release\nof both the term deposits. The credit team approved the release\nof the AUD 27,861.26 term deposit. The AUD 44,047.27 term depositandthe cash of SGD $42,000 were pledged\nas security for the Facility Agreement. The answer to the questions\nI posed above is that on an objective interpretation of the clause,\nthe reference is to a singular currency for the “Security”. It is evident\nthat the “Security” consists of 61 and 75 George Street, the assignment\nof the Fire Insurance Policy to the Bank or its nominees, “Term Deposit”\nand “Fund”. All these securities were in the same currency (AUD). In\nmy opinion, the conversion of the loans was valid. Applying the construction\nI have adopted to the facts of the case, it is clear that the only contentious\nsecurity is that of the SGD cash pledge. The two other term deposits\nwere in AUD and could be assimilated into Clause 12(iv) (the “Term\nDeposit” clause). In my view, the SGD cash pledge cannot be classified\nas a term deposit. Instead, the provision of the said cash pledge falls\nunder Clause 16(b), which allows ANZ to demand a deposit in a currency\nacceptable to the bank and/or demand additional securities should\nthe LVR exceed 80%. At the time the cash pledge was taken in (viz, 30 October 2008), the LVR for the\npurposes of the Facility Agreement was above 80%.[note: 133] 80     Accordingly,\nI find that, contrary to Edwards’ arguments, Clause 16 applies to\nthe present case. The conversion increased, rather\nthan eliminated ANZ’s foreign exchange risks 81     Edwards\nargues that ANZ was only entitled to redenominate his loan to “fully\neliminate its foreign exchange risks” (see Clause 16(c) at[52]). He argues that ANZ’s conversion\nof the loan at the material time would not fully eliminate ANZ’s\nforeign exchange risks. Instead, the foreign exchange risks would\nhave been increased. He posits the following scenario: (a)     Edwards’\nincome was in USD/SGD; (b)     After\nconversion of the loan, an appreciation of the AUD would result\nin payment by Edwards of substantially larger sums in USD/SGD to\nmake the requisite payments of principal and interest in AUD; (c)     This\nwould increase ANZ’s foreign exchange risks. 82     Accordingly,\nthere was no elimination of foreign exchange risks. 83     Second,\nEdwards argues that the conversion of Edwards’ loan into the security\ncurrency will fully eliminate ANZ’s foreign exchange risks only\nif the security was realised when the LVR is less than 100% as the\nsale proceeds would settle the full outstandings. However, ANZ did\nnot issue a margin call until LVR was 115%.[note: 134]This was ANZ trying to earn higher interest\nand increase the price of the loan in terms of Edwards’ income currency.[note: 135] 84     ANZ\nargues that the meaning of its “foreign exchange risks” is very clear:\nit is ANZ’s risk of the value of the security it holds depreciating against\nthe loan outstanding as a result of currency fluctuations, in particular\ndue to a depreciation of the security currency against the loan currency\nthat is different from the security currency.[note: 136] 85     Second,\nANZ argues that Edwards’ submissions on ANZ’s foreign exchange risks\nActually address the risk of Edwards defaulting on the repayments\nand that Edwards’ interpretation of the phrase is contrary to the\nordinary and natural meaning of the phrase.[note: 137] 86     Third,\nANZ attacks Edwards’ arguments by stating that he makes two assumptions.\nThe two assumptions are that the AUD continually appreciates against\nhis income currency[note: 138]and\nthat Edwards’ income is the main form of repayment for the outstanding\nloans.[note: 139]On\nthe former, ANZ submits that had the AUD depreciated (an event ANZ\ndescribes as indeterminable and uncertain), the risk that Edwards\ndescribed would be eliminated. On the latter, ANZ submitted that\nthe main form of repayment wasnotEdwards’\nincome but was the security that ANZ held.[note: 140] 87     I\nfirst address Edwards’ arguments. It appears to me that Edwards mischaracterised\nthe risk that ANZ was seeking to protect itself against when ANZ\nspoke of currency exchange risks. He seemed to allude to a default\nrisk rather than a currency exchange risk; the risk here was that Edwards\nhimself would default due to a conversion of the USD loan to AUD\ncoupled with a rising AUD. Edwards, being paid in USD/SGD, would have\nto pay more USD as the AUD under the loan would have appreciated. This,\nI agree with ANZ, can be characterised as Edwards’ repayment risk\nor Edwards’ (as opposed to ANZ’s) foreign exchange risk. Whether\nthe risk highlighted by Edwards is called repayment or default,\nit is nonethelessnotANZ’s foreign\nexchange risk which is protected in the following manner: (a)     LVR\n(as defined in Clause 16(a)) is set at 80%; (b)     If\nLVR is breached, ANZ can demand additional deposits or securities; (c)     If\nthere are no additional deposits or securities provided or it LVR\nis more than 90%, then ANZ can, at any time in its absolute discretion,\nconvert the relevant amount (outstanding loan) that the Bank deems\nfit in order to fully eliminate its foreign exchange risks. 88     A\nkey factor in the bank’s consideration of protecting itself must\nbe that the value of the loan it extends does not exceed the value\nof the securities it holds. Two scenarios illustrate how ANZ’s protection\nworks. Assuming that the outstanding loan amount is denominated\nin a currency (USD) different from the currency of the Security\n(AUD): (a)     Scenario\n1: AUD appreciates against USD. After notional conversion, LVR is\nlower. There is no imminent threat of LVR breach. (b)     Scenario\n2: AUD depreciates against USD. After notional conversion, LVR is\nhigher. The rise in LVR threatens a breach of the LVR. 89     It\nis in Scenario 2 that ANZ will turn to Clauses 16(b) and (c) to protect\nitself. 90     In\nrespect of Edwards’ second argument, I dispose of it by reference\nto Clause 16(c). Under that clause, ANZ is free not to convert the\nloan at any level or to convert when the LVR is higher than 90%. Clause 16(c) is void for uncertainty\nbecause it does not provide a mechanism for the calculation of security\nvalue 91     Edwards\nargues that Clause 16(c) is void for uncertainty. He argues that\nClause 16(c) does not provide for a mechanism for valuing the security for\nthe purposes of determining the LVR. He submits that the value of\nthe security is an absolutely essential element in the LVR formula\nand without any provision as to how it is to be calculated, the\nwhole formula fails.[note: 141] 92     Edwards\nalso takes issue with ANZ’s arguments that the LVR referred to in\nClause 14(a) is the same as the ratio in Clause 16. First, he says\nthat the power to determine the LVR in ANZ’s sole discretion is\nexpressly limited in Clause 14 to that particular sub-clause (viz, Clause 14(a)).[note: 142]He argues too that the right bestowed\nupon ANZ under Clause 14(a) (viz,\nthe right to seek payments to reduce the amount owing when LVR exceeds\n80%) allowed for a “rough and ready” approach. This was as compared\nto the right that allowed ANZ to redenominate a borrower’s outstanding\nloan to a foreign currency which would expose the borrower to interest\nrate and foreign exchange risks. He claimed the latter right was\ndrastic and it could not have been parties’ intentions that the\n“rough and ready” approach - applicable in Clause 14(a) - be applicable\nin Clause 16.[note: 143] 93     Lastly,\nEdwards argues that whenever the need arose to put in a reference\nto discretion, ANZ did so. He points to Clause 14(a) and 16(a) and\nstates that any provision that ANZ may value the securities in its\nsole discretion is glaringly absent.[note: 144] 94     ANZ\ndoes not deny that Clause 16 does not specifically provide for the\nmethod of assessing the value of the security.[note: 145]ANZ’s argument is that Clause 14(a)\nprovides the method for assessing the value of the security. The\nratio referred to in Clause 14(a) is the same ratio that is referred\nto in Clause 16. This ratio is the LVR.[note: 146]In\naddition, ANZ also refers to Clause 16(f) of the Terms and Conditions\nwhere ANZ may at its sole discretion, require a revaluation of the\nmortgaged property if ANZ was of the opinion that the value of the\nproperty had declined from the initial valuation amount.[note: 147] 95     Clause\n16(c) refers to the LVR, as defined specifically in Clause 16(a). The\nLVR defined in Clause 16(a) refers specifically to the scenario\nset out in Clause 16 (viz, “the\noutstanding loan amount is denominated in a different currency to\nthe currency of the Security”). The LVR set out in Clause 14(a) refers\nto a more general scenario which did not involve different currencies. In\nthat sense, the two LVRs are not the same. However, I do not believe\nthe fact that both LVRs are not the same makes the contract void\nfor uncertainty. Accordingly, I agree with ANZ that Clause 16(c)\nis not void for uncertainty. It does provide a mechanism for the\ncalculation of security value; the mechanism being that the bank\nwould assess the values in its sole discretion. ANZ did not rely on any valid\nvaluation 96     Edwards’\nmain argument here is that the valuations ANZ had on file were not\nvalid at the time of the conversions as their validity period was expressly\nlimited to three months.[note: 148]It\nis his case that when ANZ conducted its first conversion, the valuations\nwere more than four months old and when ANZ conducted its second\nconversion, the valuations were more than 10 months old. Edwards\nstates that if a valid valuation was used, his LVR would have been\nconsiderably less than the LVR stated by ANZ. He would then have\nbeen able to make payment of a sufficient sum to reduce the LVR\nto acceptable levels, avoiding the conversions.[note: 149] 97     To\nthis, ANZ argues that it has the contractual right to assess the\nvalue of the security using its discretion. This is not incompatible\nwith ANZ using the valuations for 61 and 75 George Street done on\n4 July 2008. ANZ also argues that the disclaimer for the valuations\nof 4 July 2008 states that the report is “for the use of the party\nto whom it is addressed and for no other purpose, and no responsibility\nis accepted to any third party for the whole or part of its contents”\nand therefore the disclaimer stating that the valuation was valid\nfor three months applied to ANZ only and did not apply to Edwards.[note: 150] 98     In\naddition, ANZ states that the values were not very outdated in any case\nand also contests Edwards’ assertion that he would have been able\nto repay the loan if updated and higher valuations were given to\nthe securities.[note: 151] 99     I\nagree with ANZ’s first proposition, that ANZ has the contractual right\nto assess the security using its sole discretion. However, a point\nthat was not canvassed before me was whether this discretion was\nunfettered and, if it was not unfettered, whether it was exercised\nincorrectly. To answer the question, I turn toLewison,\nwho states the following principle (at 14.11): Where a contract confers a discretion on\none party, and the exercise of that discretion may adversely affect\nthe interests of the other party, it will usually be implicit that\nthe discretion must be exercised honestly and rationally and for\nthe purpose for which it was conferred. 100    Recently,\nthe High Court has reviewed the authorities and addressed this question\nas well. InMGA International Pte Ltd v Wajilam\nExports (Singapore) Pte Ltd[2010] SGHC 319, the Court\nstated (at[103]-[106]): A contractual discretion is not usually\nas unfettered as Ms Tan would like this court to believe. The authorities\non contractual discretion recognise that there is a corresponding\nexpectation that the discretion would be exercised fairly and rationally.\nGuidance can be drawn fromHorkulak v Cantor Fitzgerald\nInternational[2005] ICR 402 (“Horkulak”),\nan employment case, on the court’s approach to contractual discretion\nat[30]: ... while, in any such situation, the parties\nare likely to have conflicting interests and the provisions of the\ncontract effectively place the resolution of that conflict in the\nhands of the party exercising the discretion, it is presumed to\nbe the reasonable expectation and therefore the common intention\nof the parties that there should be a genuine and rational, as opposed\nto an empty or irrational, exercise of discretion. Thus the courts\nimpose an implied term of the nature and to the extent described. Rix LJ inSocimer\nBank Ltd v Standard Bank Ltd[2008] 1 Lloyd’s Rep 558 (“Socimer”) summarised the position in relation\nto exercise of contractual discretion as follows (at[66]): It is plain from these authorities that\na decision-maker’s discretion will be limited, as a matter of necessary\nimplication, by concepts of honesty, good faith, and genuineness,\nand the need for the absence of arbitrariness, capriciousness, perversity\nand irrationality. The concern is that the discretion should not\nbe abused. Reasonableness and unreasonableness are also not concepts\ndeployed in this context, but only in a sense analogous to Wednesbury\nunreasonableness, not in the sense in which that expression is used\nwhen speaking of the duty to take reasonable care, or when otherwise\ndeploying entirely objective criteria: as for instance when there\nmight be an implication of a term requiring the fixing of a reasonable\nprice, or a reasonable time. In the latter class of case, the concept\nof reasonableness is intended to be entirely mutual and thus guided\nby objective criteria. InJML Direct v Freesat\nUK Ltd[2009] EWHC 616, Blackburn J referred toSocimerandHorkulakas\nauthority for the proposition that discretion conferred on one party\nby the other is not wholly unfettered contractual discretion. As\nRix LJ observed inSocimer, the\nconcern is that the discretion is not abused. Hence, the courts\nwill impose an implied term that the discretion should be exercised\nin good faith and not arbitrarily, capriciously or irrationally.\n“Irrationally” in this connection, (Blackburn J accepts the explanation\ninSocimer) is not an objective\ntest of reasonableness but is used in an analogous sense to the\nWednesbury unreasonableness (seeSocimerat[66]). The courts will not intervene so long as\nthe contractual “discretion is exercised honestly and in good faith\nfor the purposes for which it was conferred, and provided also that\nit was a true exercise of discretion in the sense that it was not\ncapricious or arbitrary or so outrageous in its defiance of reason\nthat it can be properly categorised as perverse” (seeLudgate Insurance Co Ltd v Citibank[1998]\nLloyd’s Rep IP 221 at[35]summarising\nthe principles drawn from cases likeWeinberger\nv Inglis[1919] AC 606;Dundee General\nHospitals Board of Management v Walker[1952] 1 All ER 896;Docker v Hymans[1969] 1 Ll R 487; andAbu Dhabi National Tanker Company v Product Star\nShipping Company Limited[1993] 1 Lloyd’s Rep 397). 101    ANZ\ntherefore does not have untrammelled discretion. Applying that to\nthe present case, I am of the view that the exercise of discretion\nby ANZ in using the previous valuations was not arbitrary or capricious\nor perverse. The valuations done by CB Richard Ellis on 4 Jul 2008\nwere four months and ten months old at the time of the first and\nsecond conversions respectively.[note: 152]The\nvalue given for 61 George Street was AUD 2m while that for 75 George\nStreet was AUD 1.3m. It would not be irrational to rely on them\nas the periods that had elapsed between the valuations and the conversions\nwere not unreasonably long. It is also not uncommon to find differences\nin valuations done by different valuers. Edwards’ valuer did a retrospective\nvaluation of 61 George Street after inspecting it on 29 Sep 2011.\nHe opined that its value as at 18 Nov 2008 would have been AUD 2.5m.\nThe estate agent engaged to sell 61 George Street stated that the highest\noffer recorded for 61 George Street at an auction on 26 Jan 2008\nwas AUD 2.4m but the sale did not go through as the vendor insisted\non a sale price of AUD 2.45m. No valuation was done for 75 George\nStreet as Edwards had sold it in 2010 for AUD 1.1m. He said he was\nforced to do so by ANZ. ANZ’s valuer did a retrospective valuation\nfor both Australian properties. He gave his opinion as to their\nvalues on four dates, namely, 4 Jul 2008, 1 Jan 2009, 1 Jul 2009\nand 19 Nov 2009. For 61 George Street, the values given were AUD\n2m, 1.9m, 1.9m and 1.8m respectively. For 75 George Street, the\nvalues were AUD 1.3m, 1.2m, 1.2m and 1.1m respectively. The fact\nthat Edwards’ valuer gave a higher value to one of the Australian\nproperties does not necessarily mean that ANZ’s earlier valuations\nwere wrong. The same comment applies to ANZ’s updated valuations\ndone for the purposes of this trial. 102    I\nam satisfied that ANZ Acted honestly and in good faith in relying\non the valuations done by CB Richard Ellis on 4 Jul 2008. Although\nboth these valuation reports stated that “[t]his valuation can be\nrelied upon for a period of three months from the date of valuation\nfor first mortgage security purposes only”, that does not mean that\nthey are of no value whatsoever after three months. It merely means\nthat no liability attaches to the valuer if ANZ chooses to rely\non the reports after the three-month period. Accordingly, I am of\nthe view that ANZ Acted within its “sole discretion” in valuing\nthe Australian properties in the way that it did. The argument by\nEdwards that an updated valuation would have shown that the LVR\nwas lower and that he could have avoided conversion is thus disposed of\nas well.",
        "Subsequent conduct of the parties": "103    Edwards’\nmain arguments are that any ambiguity in the contract should be\nconstrued against the maker of the contract, that subsequent conduct\nis irrelevant and that the subsequent conduct relied on does not support\nANZ’s position.[note: 153] 104    ANZ’s\narguments are in the alternative. First, ANZ reiterates its argument\nthat Clauses 14 and 16 of the 14 July letter entitled ANZ to effect the\nconversions in the circumstances that it did.[note: 154] 105    In\nthe alternative, ANZ submits that the conduct of the parties will resolve\nany ambiguity in the Clauses in favour of the interpretation offered by\nANZ.[note: 155]ANZ\nargues: (a)     that\nthis Court can look at the subsequent conduct of the parties; (b)     that\nEdwards was fully aware of how the facility worked and was aware\nof ANZ’s entitlement to convert Edwards’ loan outstandings; (c)     that\nEdwards was aware that the conversions had been effected; (d)     that\nEdwards was fully aware of the value attributed to the mortgaged\nproperties in the LVR calculations; (e)     that\nthis Court should take note of Edwards’ reaction to the conversions; (f)     that\nEdwards acknowledged his debt in the 22 and 23 October 2009 letters; (g)     that\nEdwards made various unfulfilled promises to repay. 106    Both\nparties cited the pronouncements of the Court of Appeal inZurich Insuranceto bolster their case.\nHowever, the parties agreed that subsequent conduct does not have\nto be looked at. Edwards submits that the subsequent conduct does\nnothing for ANZ’s case and ANZ argues in the alternative only that\nsubsequent conduct has to be referred to. As I have found that Clauses\n14 and 16 of the 14 July letter entitled ANZ to effect the conversions\nin the circumstances that it did, there is no need to address this alternative\nargument.",
        "ANZ’s default interest rate\nis penal": "107    Edwards\nargues that the ANZ’s default interest rate is manifestly extravagant\nand is not a genuine preestimate of loss, stating that the only additional\nloss that could be suffered in such circumstances is the additional\nadministrative costs involved in recovery. He also argues that there\nis no evidence that ANZ incurred AUD cost of funding and it would have\nbeen illogical to do so since Edwards’ loans were not in AUD. 108    ANZ\nstates that the interest rates applicable to Edwards pre-default was\n1% - 1.25% above Cost of Funds. As such, the increase in interest\nin the event of default was only an increase of 2.75% - 3%. ANZ\nalso argues that it did incur cost of funding. Crispe explained\nANZ’s borrowing as follows:[note: 156] Q.And\nthis is just a conversion, right? The bank didn't borrow this Australian\ndollar amount? A.The bank does borrow those amounts,\nyes. They are not a paper profit/paper loss to the bank. When the\nclient borrows US dollars, the bank borrows that on behalf of the\ncustomer. Q.Right, but when the bank converts a\nUS dollar loan into Australian dollars -- A.Then we buy -- Q.-- the bank is not buying Australian\ndollars? A.No. We buy US dollars and we sell Australian\ndollars. So we buy the US dollars to be able to have the US dollars\nto pay out the US dollar loan and obviously sell the Aussie dollars,\nso the client owes us that back. Q.Is there any document to show that\nthe bank borrowed this money in Australian dollars? A.None that I have. However, it would\nbe run by our treasurer, our markets operation. 109    The\nCourt of Appeal recently reaffirmed the principles with regard to penalty\nclauses inCLAAS Medical Centre Pte Ltd v Ng\nBoon Ching[2010] 2 SLR 386 (at[63]): Where parties stipulate in a contract the\nsum to be paid in the event of a breach, the contract sum is enforceable\nif it is a genuine pre-estimate of loss but not if it constitutes\na penalty. It is for the party being sued on the agreed sum to show\nthat the term is a penalty. Therefore, the burden is on the Respondent\nto prove that the term was a penalty. 110    As\nto what a penalty is, the Court of Appeal in the same case stated\n(at[64]): InDunlop Pneumatic\nTyre Company, Limited v New Garage and Motor Company, Limited[1915] AC 79,\nLord Dunedin explained, at 86-87, that the question whether a sum\nstipulated was a penalty or liquidated damages was a question of\nconstruction to be decided \"upon the terms and inherent circumstances\nof each particular contract, judged of as at the time of the making\nof the contract, not at the time of the breach\". He then laid down\nthe following guidelines, at 87, to assist in determining if a clause\nfor payment of a fixed sum was a penalty or a genuine pre-estimate\nof loss: (a)    It\nwill be held to be a penalty if the sum stipulated for is extravagant\nand unconscionable in amount in comparison with the greatest loss\nthat could conceivably be proved to have followed from the breach. (b)    It will be held to be a penalty if\nthe breach consists only in not paying a sum of money, and the sum\nstipulated is a sum greater than the sum which ought to have been\npaid. (c)    There is a presumption (but no more)\nthat it is penalty when \"a single lump sum is made payable by way\nof compensation, on the occurrence of one or more or all of several\nevents, some of which may occasion serious and others but trifling\ndamage\". 111    In\nmy view, the increase in interest rates is neither extravagant nor unconscionable\nin amount in comparison with the greatest loss that could conceivably\nbe proved to have followed from the breach. The burden is on Edwards\nto show that the increase was so extravagant that it cannot constitute\na genuine pre-estimate of the damages which ANZ would suffer. He\nhas not discharged this burden. 112    Edwards\nhas no evidence to back up his claim that ANZ did not borrow the\nAUD that it converted Edwards’ loans into. He simply states that\nit would not have made sense to do so. With that, he wraps up his argument\nthat ANZ did not incur any cost in funding the AUD conversions.\nThese bare assertions are insufficient to discharge the burden. 113    In\naddition, Edwards cites the case ofHong Leong\nFinance Ltd v Tan Gin Huay & another(“Hong Leong Finance”) [1999] 1 SLR(R) 755.\nHe cites paragraphs 26 and 27 which I find to be useful here but\nI also add the principles that the Court of Appeal set out in paragraphs\n24 and 25: [24]More\nrelevant to this appeal was the decision of Colman J inLordsvale Finance plc v Bank of Zambia[1996] QB 752\nwhich concerned the question of default interest in a syndicated\nloan. In that case, the defendant bank entered into two facility\nagreements with two syndicates of banks under which the sums of\nUS$100m and $130m were made available to the defendant.The agreements provided that in the event of default\nthe defendant was to pay interest during the period of default at\nthe aggregate rate of (a) the cost of obtaining dollar deposits\nto fund the banks' participation, (b) the margin (which was defined\nas 1½ per cent) and (c) an additional, but unexplained, one per\ncent.When the facility advances fell due for repayment\nthe defendant defaulted. The plaintiffs, who were assignees of the\nrights of certain members of the syndicates, claimed payment of\nthe principal sum together with default interest due under the agreements. On\nthe hearing of an application for summary judgment under O 14 of\nthe rules of the Supreme Court, the plaintiffs did not proceed with\nthe claim for summary judgment for interest. It was ordered that\nthe defendant should have leave to defend upon condition that it\npaid £800,000 into court, but that in default of payment the plaintiffs\nwere to be at liberty to sign judgment for the principal sum claimed\n\"plus interest (if any) to be assessed\". The defendant failed to\ncomply with the condition for payment and judgment was entered against\nit in the agreed terms. The defendant failed to pay the default interest\nand the plaintiff commenced a second Action to recover it. [25]Colman J\ncomprehensively reviewed not only some authorities of great antiquity\nbut also American, Canadian and Australian authorities, andheld, inter alia, that the additional rate of one\nper cent could not be said to bein terroremand that it was consistent with an increase in\nthe consideration for the loan by reason of the increased credit\nrisk represented by a borrower in default, and that accordingly,\nthe provision for payment of the default interest was fully enforceable.The\nlearned judge said at 763: [T]he borrower in\ndefault is not the same credit risk as the prospective borrower\nwith whom the loan agreement was first negotiated. Merely for the\npre-existing rate of interest to continue to accrue on the outstanding\namount of the debt would not reflect the fact that the borrower\nno longer has a clean record. Given that money is more expensive\nfor a less good credit risk than for a good credit risk, there would\nin principle seem to be no reason to deduce that a small rateable increase\nin interest charged prospectively upon default would have the dominant\npurpose of deterring default.That is not because there\nis in any real sense a genuine pre-estimate of loss, but because\nthere is a good commercial reason for deducing that deterrence of\nbreach is not the dominant contractual purpose of the term. He later said at 763-764: There would therefore seem to be no reason\nin principle why a contractual provision the effect of which was\nto increase the consideration payable under an executory contract\nupon the happening of a default should be struck down as a penalty\nif the increase could in the circumstances be explained as commercially justifiable,\nprovided always that its dominant purpose was not to deter the other\nparty from breach. Reverting to the case before him the learned\njudge concluded, at 767: If the increased\nrate of interest applies only from the date of default or thereafter\nthere is no justification for striking down as a penalty a term providing\nfor a modest increase in the rate. I say nothing about exceptionally\nlarge increases. In such cases it may be possible to deduce that\nthe dominant function is in terrorem the borrower. But nobody could\nseriously suggest that a 1 per cent increase could be such. It is\nin my judgment consistent only with an increase in the consideration\nfor the loan by reason of the increased credit risk represented\nby a borrower in default. [26]On the authorities which we have considered, a provision\nin a contract stipulating an increased rate of interest applicable\nfrom the date of default is, depending on the circumstances, enforceable\nand will not be struck down as a penalty, provided that the increase\n(or difference) is not \"extravagant and unconscionable in amount\nin comparison with the greatest loss that could conceivably be proved\nto have followed from the breach\" (perLord Dunedin inDunlop\nPneumatic Tyre([18]supra) at 87). It\nis otherwise, if the increased rate is \"exceptionally large\". [27]In\nthe present case, cl 18 of the standard terms and conditions and\ncl 10 of the terms of the mortgage provided for payment of default\ninterest at the rate of 18% per annum for late or non-payment of\nmoneys due under the mortgage. As laid down inDunlop\nPneumatic Tyre[1915] AC 79 at 86 andEsanda\nFinance(1989) 63 ALJ 238 ([22]supra) at 242, these provisions should\nbe construed from the point of view of the parties at the time of entering\ninto the transaction, and the character of these provisions as penal or\ncompensatory is to be perceived as a matter of degree depending\non all the circumstances, including the nature of the subject matter\nof the agreement. Looking at these provisions objectively and \"judged\nof\" as at the time of the execution of the mortgage, it seems to\nus that the default rate at 18% per annum was eminently an extravagant\nincrease from the rate of 5.5% for the first two years of the term\nloan and 6.75% thereafter and was not referable to the true amount\nof the loss suffered by the appellants following the breach by the\nrespondents. The effect of these provisions is that the first respondent would\nhave to cough up $1,750 per month (or $56.81 a day), which far exceeded\nthe original monthly instalments of $939.65 (at 5.5%) or $1,017.65 (at 6.75%).\nIn our opinion, this rate was fixedin terroremof\nthe respondents and was intended to deter a breach of the agreement.\nIn our judgment, the default interest at the rate of 18% per annum\nwas manifestly extravagant and was out of all proportion in comparison\nwith the greatest loss that could conceivably be proved to have\nfollowed from the breach by the respondents and was therefore a\npenalty and was unenforceable, As such, the default interest claimed\nby the appellants is irrecoverable. The appellants' argument that\nthe default rate was unexceptional in the market and that other\nfinance houses also charged default interest at rates of 18% or\nmore per annum was really besides the point. If default interest\nat 18% per annum was a penalty, as we held it was, the fact that\nit was an industry-wide practice did not make it less so. [emphasis added] 114    Applying\nthe principles set out inHong Leong Financeleads\nme to the conclusion that the default interest rate is not penal.\nThe calculation of the default interest here is similar to that\ninLordsvale Finance plc v Bank of Zambia[1996] QB 752.\nIt was (a) the cost of funds or the prime lending rate, (b) the\nmargin, which was 1%-1.25%, and (c) the additional 3.75%- 4%. The\nincrease in interest rates here is nowhere close to the increase\nin interest rates inHong Leong Finance.\nThere, it was 5.5% to 18% or 6.75% to 18%, which is an increase\nof 12.5% or 11.25% respectively.",
        "Conclusion": "115    InSoon Kok Tiang and others v DBS Bank Ltd and another\nmatter[2011] SGCA 55, the Court of Appeal observed (at[63]): In view of our decision in this appeal,\nwe think it apposite and timely to remind the general public that\nunder the law of contract, a person who signs a contract which is\nset out in a language he is not familiar with or whose terms he\nmay not understand is nonetheless bound by the terms of that contract.\nIlliteracy, whether linguistic, financial or general, does not enable\na contracting party to avoid a contract whose terms he has expressly\nagreed to be bound by. The principle of caveat emptor applies equally\nto literates and illiterates in such circumstances. 116    If\nthose who are unschooled in the law or in finance are held to such\na standard, what more a person who is familiar with both? In the\npresent case, Edwards cannot claim that he is not familiar with\nthe language of the contract he entered into. He is clearly far\nfrom illiterate. Edwards is a lawyer who works in the finance industry,\nwho took out a mortgage loan with ANZ on terms he agreed to and\nwho knew what he was getting into. However, the same terms, which\ncould have benefited him had the course of the financial markets\ntaken a different direction, have now saddled him with obligations\nwhich he no longer wishes to or is unable to bear and which he now\nwants this court to relieve him of. On the facts here, the court\nis not able to grant him the relief he seeks. The contract read\nas a whole is not uncertain. Where there were careless errors, they\nwere clear on the face of the document and could be addressed using\nthe principles of contractual interpretation. 117    In\nthe circumstances, Edwards fails in his claim (see[28]above) against ANZ and ANZ’s\ncounterclaim (see[29]above)\nagainst him succeeds. 118    Edwards\nshould pay ANZ the costs of these proceedings on an indemnity basis\nin accordance with Clause 15 of the T&Cs. However, ANZ should\nbear some responsibility for the many errors in the 14 July letter, some\nof which have engendered the contentions made in this trial. I therefore\norder that Edwards pay ANZ 90% of the costs of these proceedings\non an indemnity basis.  [note: 1]Plaintiff’s\nOpening Statement (“POS”) at[10] [note: 2]Notes of Evidence (“NE”), 31 October 2011, Page 120 at line\n2 [note: 3]AEIC\nof Jodene Frances Edwards (“JFE”)\nat[18] [note: 4]JFEat[18] [note: 5]Plaintiff’s Reply Submissions\n(“PRS”) at [122(6) and (7)] [note: 6]POSat[10] [note: 7]AEIC\nof Maya Lim (“ML”) at[3] [note: 8]JFEat[2]-[3] [note: 9]JFEat[11] [note: 10]AEIC of Malcolm George\nCrispe (“MGC”) at[6] [note: 11]MGCat[7] [note: 12]POSat[11] [note: 13]POSat[11] [note: 14]POSat[13] [note: 15]POSat[13] [note: 16]MGCat[17]; AEIC of Jason Glenn Edwards\n(“JGE”) at page 38 [note: 17]JGEat page 28;MGCat\n46 [note: 18]JGEat\npage 49;MGCat 52 [note: 19]JGEat page 55;MGCat\n58 [note: 20]JGEat\npage 59;MGCat 62 [note: 21]JGEat page 65;MGCat\n63 [note: 22]JGEat\npage 78; Agreed Bundle of Documents (“AB”)\n1130 [note: 23]JGEat\npage 92;MGCat 68 [note: 24]MGCat 75 [note: 25]JGEat[7]andMGCat [16(e)] [note: 26]MGCat[18] [note: 27]MGCat[39] [note: 28]MGCat[47] [note: 29]MGCat page 193 [note: 30]MGCat page 194 [note: 31]MGCat[48] [note: 32]MGCat[54] [note: 33]Defendant’s\nCore Bundle (“DCB”) at 154 [note: 34]MGCat[55] [note: 35]ABat\npage 451 [note: 36]ABat page 452 [note: 37]MGCat[56];MGCat\npage 197 [note: 38]MGCat[57] [note: 39]MGCat[59];MGCat page 255 [note: 40]MGCat[60] [note: 41]MGCat[61];MGCat\npage 250 [note: 42]MGCat[62];MGCat\npage 258 [note: 43]MGCat page 258 [note: 44]MGCat[62];MGCat page 258 [note: 45]MGCat[64];MGCat\npage 257 [note: 46]MGCat[65];MGCat\npage 257 [note: 47]MGCat[67] [note: 48]MGCat\npage 262 [note: 49]MGCat page 262 [note: 50]DCSat[42] [note: 51]DCSat[42];MGCat[68] [note: 52]MGCat\npage 265-273 [note: 53]DCSat[43] [note: 54]DCSat[43] [note: 55]MGCat[84] [note: 56]MGCat[86] [note: 57]MGCat[80]; Defendant’s Bundle of Affidavits\nof Evidence in Chief, Vol 2, at pages 358-359 [note: 58]MGCat[81] [note: 59]DCSat[45] [note: 60]DCBat\n190; Defendant’s Bundle of Affidavits of Evidence in Chief, Vol\n2, at page 300 [note: 61]Defendant’s\nBundle of Affidavits of Evidence in Chief, Vol 2, at page 300 [note: 62]DCB189; Defendant’s Bundle of Affidavits\nof Evidence in Chief, Vol 2, at page 299 [note: 63]MGCat[95] [note: 64]Defendant’s Bundle\nof Affidavits of Evidence in Chief, Vol 2, at page 298 [note: 65]DCSat[46] [note: 66]MGCat[96];\nDefendant’s Bundle of Affidavits of Evidence in Chief, Vol 2, at\npages 319- 324 [note: 67]Defendant’s\nBundle of Affidavits of Evidence in Chief, Vol 2, at page 320 [note: 68]Defendant’s\nBundle of Affidavits of Evidence in Chief, Vol 2, at page 322 [note: 69]Defendant’s\nBundle of Affidavits of Evidence in Chief, Vol 2, at page 324 [note: 70]DCSat[48];MGCat[99] [note: 71]DCSat[49] [note: 72]Defendant’s Bundle\nof Affidavits of Evidence in Chief, Vol 2, at page 326 [note: 73]DCSat[50];ABat\npage 616-617 [note: 74]DCSat[51];ABat\npage 637-638 [note: 75]DCSat[52] [note: 76]DCSat[53] [note: 77]DCSat[53] [note: 78]DCSat[54] [note: 79]JGEat[60] [note: 80]JGEat[60] [note: 81]JGEat[63] [note: 82]MLat[52];MLat page 127 [note: 83]MLat pages 133-134 [note: 84]DCSat[54] [note: 85]MLat[59] [note: 86]DCSat[2],[25] [note: 87]POSat[26] [note: 88]PRSat[38] [note: 89]NE, 1 November 2011, page 87, line 16 [note: 90]PCSat[84] [note: 91]ABat\n1144 [note: 92]PCSat[85] [note: 93]ABat 1130 [note: 94]ABat\n1135 [note: 95]DCSat[102] [note: 96]DCSat[100] [note: 97]DCSat[103] [note: 98]DCSat[104] [note: 99]DCSat[106] [note: 100]DCSat[107] [note: 101]NE, 1 November 2011, pages 87-97 [note: 102]DCBat 29-34 [note: 103]PCSat[93] [note: 104]PCSat[96] [note: 105]PCSat[104] [note: 106]PCSat[104] [note: 107]PCSat[95] [note: 108]PCSat[105] [note: 109]DCSat[113] [note: 110]PCSat\n[121] [note: 111]PCSat\n[121] [note: 112]PCSat [122] [note: 113]DCSat [141] [note: 114]DCSat [167] [note: 115]DCSat\n[161] [note: 116]DCSat\n[142] [note: 117]PRSat[69]andDCSat\n[143] [note: 118]PCSat\n[131] [note: 119]PCSat\n[131] [note: 120]PCSat\n[140] [note: 121]PCSat [142] [note: 122]PCSat\n[145] [note: 123]PCSat\n[145] [note: 124]PCSat [194] [note: 125]PCSat [198] [note: 126]DCSat\n[200] [note: 127]DCSat\n[202] [note: 128]CDS at [204] [note: 129]PRSat[82] [note: 130]MLat[29] [note: 131]MGCat[74] [note: 132]MGCat[70]-[72] [note: 133]MGCat[54] [note: 134]PCSat\n[151] [note: 135]PCSat\n[151] [note: 136]DCSat\n[206] [note: 137]DCSat\n[209] [note: 138]DCSat [210(a)] [note: 139]DCSat [210(b)] [note: 140]DCSat\n[213]-[216] [note: 141]PCSat [161] [note: 142]PCSat\n[157] [note: 143]PCSat [158] [note: 144]PCSat [160] [note: 145]DCSat\n[223] [note: 146]DCSat [224] [note: 147]DCSat\n[225] [note: 148]PCSat [175] [note: 149]PCSat\n[178] [note: 150]DCSat\n[235]-[237] [note: 151]DCSat [241] [note: 152]PCSat [176] [note: 153]PCSat [212] [note: 154]DCSat\n[307] [note: 155]DCSat [308] [note: 156]NE, 2 November 2011, page 110 at line\n7-25"
    }
}