{
    "case_title": "BFC Development LLP \n      v\n      Comptroller of Property Tax",
    "ncitation": "[2012] SGHC 237",
    "coram": "Tay Yong Kwang J",
    "sections": {
        "Introduction": "1       This case turns on the interpretation of s 8 of the Property Tax Act (Cap 254, 2005 Rev Ed) (“the Act”). The applicant, BFC Development LLP (“the Applicant”), is seeking property tax refunds under s 8 of the Act from the respondent, the Comptroller of Property Tax (“the Comptroller”), in respect of various units (“the units”) that the Applicant owns at the Marina Bay Financial Centre Towers 1 and 2 situated at Nos. 8 and 10 Marina Boulevard[note: 1](respectively, “Tower 1” and “Tower 2”). 2       On 17 July 2012, I granted leave to the Applicant to apply for a mandatory order that the Comptroller refund the property tax in issue and for a declaration that the Applicant is entitled to such refund. I heard the parties on the substance of the application on 25 October 2012 and reserved judgment. Having considered the arguments, I have come to the view that the Applicant is not entitled to the property tax refunds under s 8 of the Act for the reasons that follow.",
        "Factual background": "3       The Temporary Occupation Permits (“TOPs”) for Towers 1 and 2 were issued on 18 March 2010 and 27 August 2010 respectively.[note: 2]However, prior to those dates, the Applicant had already found parties committed to leasing various units therein.[note: 3]These tenants had signed Letters of Offer (“Offer Letters”) enclosing the Form of Lease agreement with the Applicant and were granted legal possession of the units upon issuance of the TOPs. The Offer Letters provided the tenants with a rent-free period for the units to be fitted out for occupation (“fitting-out period”) before the commencement of the lease on the term start date. Save for the fact that the duration of the fitting-out periods differed among the various tenants, the Offer Letters were fairly standard, providing that[note: 4]: 8.1The Tenant must take possession of the Premises as they stand on [the Possession Date]. 8.2The Landlord will grant the Tenant a fitting out period (the “Fitting Out Period”) free of Rent and Management Charge starting on the Possession Date and ending [one day before the Term Start Date], for the Tenant to carry out its fitting out works to the Premises. 8.3Prior to the Term Start Date, the Tenant shall not without the prior written consent of the Landlord (which consent may be granted on such terms and conditions as the Landlord deems fit in its absolute discretion) use the Premises for any purpose other than for carrying out the [fitting out works]. 4       The various units were individually assessed by the Chief Assessor for property tax purposes and tax was duly paid for each unit, including tax assessed in respect of the fitting-out periods.[note: 5]Following that, the Applicant filed claims for property tax refunds for the various units for the period starting from the TOP date and ending at the commencement of the respective leases (“claim periods”).[note: 6]These claims were made pursuant to s 8(1) of the Act which provides for a refund of property tax where the property is “unoccupied” for an unbroken period of at least 30 days or a calendar month. 5       Although the Comptroller initially allowed the claims for refunds in respect of the entire claim periods[note: 7], it later withdrew the refunds[note: 8], explaining in a letter dated 10 April 2012[note: 9]that no refunds were due to the Applicant as the units in question were “occupied”. In a subsequent letter dated 7 June 2012[note: 10], the Comptroller further explained that the rent-free fitting-out periods given to the tenants did not qualify for refunds as the tenants were already in “possession” of the properties. 6       The Applicant then took out the present Originating Summons pursuant to Order 53 of the Rules of Court (Cap. 322, R 5, 2006 Rev Ed) for leave to apply for a mandatory order and a declaration that it is entitled to such refunds for the claim periods during which the Applicant did not receive any rent.[note: 11]",
        "Refund on “unoccupied” property": "7       Property tax in Singapore is levied on the ownership of property, independent of its occupation or beneficial use (Malaysia Investments Ltd v Chief Assessor[1969] 1 MLJ xlix at li). However, s 8 of the Act provides for a full tax refund where tax has been paid for unoccupied premises, provided certain specified conditions are fulfilled: Refund on unoccupied buildings 8—(1) Where tax has been paid under the provisions of this Act in respect of any building, the Comptrollershall, subject to this section,refund a part of the tax proportionate to any period during which the building is unoccupiedexcept that no refund shall be allowed in respect of any unbroken period of less than 30 days or a calendar month. (2)    Any owner of a building claiming under this section a refund of the tax which he has paid in respect of that building, for any period commencing from 1st November in any year to 31st October in the ensuing year, shall submit his claim in writing to the Comptroller not later than 15th November in the ensuing year or such other date as the Minister may by order prescribe. (3)    The Comptroller may, in his discretion, make a refund under this section to the extent of the whole or any part thereof, where — (a)    the person claiming the refund failed to submit his claim within the time specified in subsection (2) and the Comptroller is satisfied as to the reason for such failure; or (b)    part of the continuous period of 30 days falls before 1st November in any year and another part of that period falls on or after that date. (4)No refund shall be allowedin respect of any buildingunlessthe owner satisfies the Comptroller — (a)    that the building is in good repair and fit for occupation; (b)    thatevery reasonable effort to obtain a tenant has been made; (c)    that the rent demanded is a reasonable one; and (d)    that the building has beenvacantduring the whole of the period in respect of which a refund is claimed. (5)    Where a refund is claimed in respect of a period during which the building has been undergoing repairs for the purposes of rendering it fit for occupation, it shall not be necessary to prove in respect of the claim, the matters specified in subsection (4)(a), (b) and (c). [emphasis added] 8       The meaning of “unoccupied” in s 8(1) of the Act is at the crux of the present dispute. The specific issue to be resolved is this: can a property be said to be “unoccupied” for the purposes of s 8 of the Act where a tenant has commenced work to fit out the property prior to actually moving in? 9       Counsel for the Applicant, Mr Tan Kay Kheng (“Mr Tan”), submitted that a property is “unoccupied” where there has been no enjoyment of it,eg, when it is “merely being prepared for future occupation”.[note: 12]It follows, he argued, that the units were “unoccupied” for purposes of s 8 during the fitting-out period. In reply, Counsel for the Comptroller, Mr Lau Kai Lee (“Mr Lau”), argued that the relief provided under s 8 was only intended for property owners who are genuinely unable to let out their properties. He stressed that the Applicant was not in such a position because it had already found tenants who were in possession of the various units and were already carrying out fitting-out works therein.[note: 13]",
        "The meaning of “unoccupied” in s 8(1) of the Act": "10     In considering the issue of whether the units were “unoccupied” during the fitting-out periods for purposes of property tax refund, the starting point must be the Act itself. This is crucial because “occupation” is capable of taking on various shades of meaning dependent upon the specific context under consideration. As Lord Nicholls observed inGraysim Holdings Ltd v P & O Property Holdings Ltd[1996] 1 AC 329 at 334-335: [T]he concept of occupation is not a legal term of art, with one single and precise legal meaning applicable in all circumstances. Its meaning varies according to the subject matter.Like most ordinary English words “occupied,” and corresponding expressions such as occupier and occupation, have different shades of meaning according to the context in which they are being used. Their meaning in the context of the Rent Acts, for instance, is not in all respects the same as in the context of the Occupiers’ Liability Act 1957. This is not surprising. In many factual situations questions of occupation will attract the same answer, whatever the context. A tenant living alone in a detached house under a residential lease would be regarded as the sole occupier of the house. … Butthe answer in situations which are not so clear cut is affected by the purpose for which the concept of occupation is being used.In such situations the purpose for which the distinction between occupation and non-occupation is being drawn, and the consequences flowing from the presence or absence of occupation, will throw light on what sort of activities are or are not to be regarded as occupation in the particular context. [emphasis added] 11     The key word in contention here - “unoccupied” - is not defined in the Act. The only oblique assistance from the Act is in s 2(1), which defines “occupier” as follows: the person in occupation of the premises in respect of which the word is used or having the charge, management or control thereof either on his own account or as agent of another person, but does not include a lodger. Greater insight may however be derived from the legislative history of the refund provisions which were briefly removed from our statute books from 1961 to 1963 before being reinstated in modified form on 1 January 1964.",
        "Legislative intent": "12     Section 8 of the Act may be traced back to s 60 of the Municipal Ordinance (Cap 133, 1936 Ed), which provided as follows: 60(1).    If any building isunoccupied and no rent is payablein respect thereof during a period of not less than one month, part of a half-yearly period in respect of which a rate has been paid under the provisions of section 59, the Commissioners shall refund a part of such rate proportionate to the period during which the building has been unoccupied. … 60(4).    No refund shall be allowed in respect of any building, unless the owner proves to the satisfaction of the Commissioners - (a)    that such building is in good repair and fit for occupation; (b)    that every reasonable effort to obtain a tenant has been made; (c)    that the rent demanded is a reasonable one; (d)    that the building has been vacant during the whole period in respect of which refund is claimed: … [emphasis added] 13     The same language was adopted in s 110 of the Local Government Ordinance (No. 24 of 1957) which also provided for refunds where the building in question was “unoccupied and no rent is payable in respect thereof”. These refund provisions were however omitted when the Property Tax Ordinance (No. 72 of 1960) came into force on 1 January 1961. 14     There appeared ostensibly to be two reasons for the omission of the refund provisions in the Property Tax Ordinance. First, property tax became a tax on ownership of immovable properties instead of rates levied on the beneficial use of the properties. Refunds on property tax in respect of unoccupied properties were thus seen as being inconsistent with the levying of property tax based on ownership. In the words of the then-Minister for Finance, Dr Goh Keng Swee, during the Second Reading of the Property Tax Bill 1960 (Sing.Parliamentary Debates, vol. 14, col. 896 (29 December 1960)): It is proposed to make it mandatory for any person who owns property which has not been assessed to give notice thereof to the Chief Assessor. It will also be mandatory for him to notify the Chief Assessor when a building ceases to be occupied by the owner thereof and is let.Because the tax is a tax on the ownership of property irrespective of whether it is occupied or not, refunds of tax for \"letted\" buildings which have become unoccupied during the tax year will cease. [emphasis added] 15     Second, it appeared that Parliament wanted to discourage vacancies at a time when there was an acute shortage of housing in Singapore. As Dr Goh Keng Swee explained (Sing.Parliamentary Debates, vol. 14, col. 904 (29 December 1960)): Today we know that there is a shortage of housing. It is very difficult to get accommodation at reasonable rents. There is no excuse whatsoever for any large number of houses to go vacant for any long period of time. If that happens, it merely means that the land-owners are charging too high a rent. This being the case, it is only fair, taking the long-term view of their net income, that they should pay tax during the periods when their property is vacant. … But in the present circumstances, where there is a shortage of housing, it is absolutely scandalous that any large numbers of houses should be vacant. If the tax on vacant houses will have the effect of inducing landlords to lower their rent, then I think we will have achieved a very desirable social objective. (see also Leung & Usilappan, Property Tax in Singapore and Malaysia (Butterworths, 2ndEd, 1997) (“Property Tax in Singapore and Malaysia”) at 89-90). 16     Subsequently, the housing situation improved and the refund provisions were reintroduced by the Property Tax (Amendment) Ordinance 1963 (No. 25 of 1963) which came into force on 1 January 1964. The relevant refund provision stated as follows: 6A.    Where tax has been paid under the provisions of this Ordinance in respect of any building the Comptroller shall, subject to the provisions of subsections (2) and (3) of this section, refund a part of such tax proportionate to any period during which the building is unoccupied: … 17     The reintroduction of the refund provisions was justified during the Second Reading of the Property Tax (Amendment) Bill in the following way (Sing.Parliamentary Debates, vol. 22, cols 1019-1020 (19 December 1963) (Minister for Finance, Dr Goh Keng Swee)): But when the property tax was imposed in 1961, no provision was made for a refund of tax onunoccupiedbuildings as tax was on ownership of property as an additional source of general revenue. … There was also at that time an acute shortage of housing and it was intended to discourage house owners from exploiting the situation by holding the houses invacancyin the hope of collecting higher rentals later. Due to the successful efforts of the Housing and Development Board and due to extensive private development, the housing shortage has eased considerably since then. And it is now possible to allowa house owner, who has made a genuine effort to let out his house at a fair rental but has failed to do so, to claim a refund of tax for any period his house has beenvacantfor 30 days or more continuously. [emphasis added] I note here that the words “unoccupied” and “vacant” have been used interchangeably in the Minister’s speech. Purposive approach 18     In the light of the foregoing, can the units be considered “unoccupied” for the purposes of s 8 of the Act during the fitting-out periods? I do not think so. Parliament’s intention was clearly to alleviate the financial burden on property owners who have failed to obtain tenants for their properties despite having expended reasonable efforts to let out their properties at a fair rental. This policy is expressed through the four conditions set out in s 8(4) of the Act and “unoccupied” in s 8(1) must be construed with this in mind. I add here that “unoccupied” in s 8(1) is synonymous with “vacant” in s 8(4)(d). This accords with the words’ ordinary meaning and with the Minister’s speech at [17] above. The sort of vacancy contemplated in s 8(5) is where the property in question is “undergoing repairs for the purposes of rendering it fit for occupation”. Such “repairs” are not the sort of works done during the fitting-out periods. If it were otherwise, then s 8(4)(a) (“that the building is in good repair and fit for occupation”) could not be satisfied in any event. The parties are agreed that  s 8(5) is not relevant here as the issuance of the TOPs in this case isprima facieevidence that the units are suitable for occupation (s 12(4) of the Building Control Act (Cap 29, 1999 Rev Ed)). 19     There is also a fundamental problem with the Applicant’s case arising from the requirement in s 8(4)(b) of the Act that the property owner must establish that he has made “every reasonable effort to obtain a tenant”. Such a requirement must rest on the premise thatno tenanthas yet been found by the property owner claiming a refund under s 8, a state of affairs which is clearly absent in the present case where a tenant has already been found and who has been given the permission to take possession of the units and commence his preferred fitting-out works before moving in. Such a premise was clearly also inferred by the authors ofProperty Tax in Singapore and Malaysiawho observed at 92-93 as follows: The tax refund for vacancy is only given where a building is vacantwhen the owner is unable to get a tenant meanwhile.In support of this policy, [s 8(4) of the Act] sets out the conditions for the giving of refunds. The owner will have to satisfy the Comptroller with regard to the following: (1)that the building for which the tax refund is claimed is in good repair and fit for occupation - unless the building is in bad physical state, there is usually little real problem for the owner to satisfy the Comptroller in this regard; (2)that every reasonable effort to obtain a tenant has been made - the owner should be able to produce proof of advertisement and/or efforts made by estate agents on his behalf. The frequency of the advertisements in the light of the prevailing rental market conditions may also be taken into account when assessing whether reasonable efforts have been made to obtain a tenant; (3)that the rent demanded is a reasonable one - there is usually little problem here as the owner is in the market and isusually quite anxious to let his building. He is generally in tune with the market and will adjust his ‘asking’ rent in line with the prevailing market conditions; and (4)that the building has been vacant during the whole period in respect of which a refund is claimed - if proof is ever required, the owner may be able to prove by way of the low consumption of water and electricity in relation to the building for the period concerned. It can be seen that tax relief is only given when a vacant property is intended for letting. No refund is given for a property left vacant for sale or for any other purpose. There is only one exception: where a refund is claimed in respect of a period during which the building has been undergoing repairs for the purpose of rendering it fit for occupation, it is not necessary to prove the matters specified in paras (a), (b) and (c) [in s 8(4) of the Act]. The operative word is ‘repairs’. Where a property is renovated or improved, it will not qualify for a refund. [emphasis added] 20     To get around this difficulty, the Applicant pointed to the fact that s 8(4) does not explicitly state that a property owner is precluded from claiming a refund once he finds a tenant. However, the fact that tax refunds under s 8 are given where a building is vacant because the owner is unable to get a tenant must be implicit, if not obvious, for s 8(4)(b) of the Act to make sense. I also reject the Applicant’s argument that, unlike the requirement of vacancy in s 8(4)(d), the requirements in ss 8(4)(a) to (c) are not tied to the claim periods. This would lead to the perverse result that an owner may claim a refund over a twelve-month period although the building was not fit for occupation during eleven of those twelve months. Similarly, an owner who expends no effort to obtain a tenant during eleven out of twelve months would be able to recover property tax refunds for the full year as long as the property was kept vacant throughout the year. Such a construction of s 8 would defeat the express policy of compensating an owner who has failed to obtain a tenant despite genuine efforts to let out his property at fair rental. In my opinion, the words “during the whole of the period in respect of which a refund is claimed” in s 8(4)(d) ought to apply to ss 8(4)(a) to (c) as well. “Possession” as occupation 21     Mr Lau attempted to justify the same outcome by equating “occupation” with “possession”. Relying onLee Wah Bank Ltd v The Commissioner of Federal Capital of Kuala Lumpur(1962) 28 MLJ 23 (“Lee Wah Bank”), he argued that there must be sufficient control over a property for the property to be occupied.[note: 14]In that case, a holding of a bank contained over its entire area a nine-storey building in the course of construction. The relevant statutory provision (s 2 of the Town Board Enactment) provided the Commissioner with the option to assess any holding which is vacant or unoccupied or only partially built upon at 10% of its improved value. The Commissioner exercised this option and the bank appealed. The court allowed the bank’s appeal and made the following observations on the meaning of “occupation” (Lee Wah Bankat 24-25): It is clear that the holding in actual fact is neither vacant nor partially built upon, since a building nine stories high and covering its entire area is in course of construction. The only point, therefore, on which conflicting views arise, is as to the meaning of the word \"unoccupied.\" Taking that word first in its ordinary meaning in the English language, I do not think that the holding can properly be said to be unoccupied while building contractors and their workmen were in continuous possession and occupation thereof since work on the foundation began. Secondly, in s 2 of the Enactment there appears this definition: “‘Occupier’ means the person in occupation of the holding or building in respect of which the word is used, or having the charge, management or control thereof either on his own account or is agent of another person, but does not include a lodger.” In my view this definition issufficiently wide to cover builders and contractors who are on the holding, for the purpose of erecting a building thereon, whether they occupy on their own account or as agents of the owner of the holding. Thirdly, I would respectfully adopt what Lord Denning said inNewcastle City Counsel v Royal Newcastle Hospital[1959] 1 All ER 734; [1959] 2 WLR 476, 479 that “occupation is matter of fact and only exists when there is sufficient measure of control to prevent strangers from interfering.” In the instant case I think the building contractor can bring an action of trespass against any stranger entering upon the premises or interfering with the building operations. [emphasis added] 22     This raises the question: what amounts to “sufficient control”? Mr Lau submitted that “possession” should be the touchstone, such that the Applicant’s tenants must for all intents and purposes be taken to be occupying the units from the time they take possession at the start of the fitting-out periods.[note: 15]That appears to me to be a sensible and workable solution. In this sense, the right to occupy is equated with occupation even if the tenant has not factually shifted into the units. Similarly, the units would not be unoccupied or vacant even if the tenant decides to move in later than he is entitled to for whatever reasons. The fact that certain restrictions were imposed during the fitting-out periods, for instance, disallowing the use of common property such as the toilets (the management charge was waived too, possibly to compensate for such restrictions), does not detract from the reality that the tenants were in possession of their units and had the right to occupy (ie, move into the units) even though they chose not to do so for the time being, whether it was because they wished to furnish or improve the units first or due to other reasons specific to each tenant. Under the Offer Letters, an earlier factual moving in during the fitting-out period merely triggered the early payment of rent (termed a Business Commencement Charge). This can be seen from clauses 8.4 and 8.5 of the Offer Letters:[note: 16]: 8.4… the Tenant may at any time prior to the Term Start Date move into the Premises or any part of the Premises with a view to commencing business on a certain date (the “Business Commencement Date”) and by giving to the Landlord not less than 14 days’ prior written notice of its moving in, which written notice shall specify (i) (if applicable) that part of the Premises where the Tenant intends to move into … and (ii) the Business Commencement Date, subject to: 8.4.1  the proper completion of the [fitting-out works] in the Premises … on or before the date the Tenant moves into the Premises …; and … 8.5The Tenant must pay to the Landlord a sum (the “Business Commencement Charge”) together with the GST payable on the Business Commencement Charge, for the period commencing from and including the Business Commencement Date up to and including the day immediately before the Term Start Date … 23     Although occupation presupposes a sufficient measure of control to prevent strangers from interfering, such control is not capable of being defined conclusively and comprehensively. It is a factual matter to be decided in accordance with the legislative intent underlying s 8, as set out in [18]-[20] above, and in a way consonant with commonsense. 24     For instance, an owner may authorize an estate agent to conduct an “open house” every weekend for the purpose of allowing prospective tenants to view the premises. The estate agent could conceivably be within the definition of “occupier” in s 2(1) of the Act as someone “having the charge, management or control ... as agent of another person”, yet the premises in question could not be said to have ceased to be vacant on those weekends. Similarly, where an owner hires a caretaker to clean an unoccupied apartment once every month, it would be hard to assert that the apartment has ceased to be unoccupied.  I think the same can be said of an unoccupied bungalow being guarded 24 hours a day by security personnel.",
        "The Applicant’s construction of “occupation”": "Enjoyment of the property 25     The Applicant’s attempt to root the notion of “occupation” in the requirement of “enjoyment of the property” is also problematic at several levels. First, it begs the question: what does “enjoyment” mean? The Applicant’s response is that enjoyment entails the usage of the property according to its intended purposes,ie, there is no enjoyment of the units in question during the fitting-out periods because those units were then “unfurnished and not ready for habitation for the particular would-be tenant’s purposes”[note: 17]. Mr Tan agreed during oral submissions that this effectively means that there can only be “occupation” when the tenant has officially moved into the premises and has commenced business. 26     Such a construction can however lead to absurd results. Taken to its logical conclusion, it would mean that if a tenant fails to complete his fitting-out works within the stipulated fitting-out period, such that the fitting-out works overrun into the lease term, the owner would be able to claim property tax refunds in respect of the period of overrun because there is no enjoyment of the property according to its intended purposes until the fitting-out works are completed. This is inconsistent with the legislative intent of providing relief where no tenancy is secured and Mr Tan rightly stopped short of arguing that property tax refunds would be claimable during the period of overrun. He agreed during oral submissions that in such a situation, refunds may only be claimed up to the lease start date. This however undermines the argument that “occupation” in s 8 is tied to the enjoyment of the property. 27     Second, the English authorities from which the Applicant drew inspiration for its argument based on the “enjoyment of the property” are not directly applicable. Indeed, one must proceed with caution when referring to English cases in this field. Rating in England is based not on ownership but on occupation which is actual, exclusive, beneficial and sufficiently permanent (Ryde on Rating: The Law and Practice(Butterworth & Co, 13thEd, 1976) at 20, 26-27). Judicial interpretation of “occupation” in England is therefore often coloured by this context. For instance, the Applicant relied on the following passage inArbuckle Smith & Co Ltd v Greenock Corporation[1960] AC 813 (“Arbuckle Smith”)[note: 18]at 823-824perLord Reid: What, then, is the meaning of \"unoccupied\" in the [Local Government (Scotland) Act 1947]? … There is singularly little authority ... I therefore think it proper to begin by taking the word \"unoccupied\" as an ordinary word of the English language and considering its possible meanings. It could, I suppose, mean that no one ever set foot in the premises during the relevant period, but I reject that meaning at once, both because it has never even been suggested so far as I know in any authority or textbook, and because, very properly, it was not argued in this case. So if the owner can himself enter or send in others without thereby \"occupying\" the premises, the criterion of occupation must be either how frequently he or his representatives go in or what they do when they are here. No one has contended that entry for inspection or cleaning or ordinary maintenance such as heating in cold weather or carrying out ordinary repairs to make the premises wind- and water-tight constitutes occupation, and it appears to me that occupation must involve something more than that. But if that be so, I have difficulty in seeing on what reasonable principle the making of the alterations in this case can be held to constitute occupation. … But I can see a clear distinction between maintaining, repairing or improving a fabric, on the one hand, and enjoying the accommodation which it provides, on the other.And I think that it would accord with the ordinary use of language to say thatthe owner who in some way enjoys the accommodation is occupying the premises, but that the owner who merely maintains, repairs or improves his premises is not thereby occupying them: he is preparing for future occupation by himself, his tenant or his disponee. [emphasis added] 28     It is however important to note thatArbuckle Smithwas concerned with rateable occupation in England. The appellants there had acquired certain premises with a view to using them as a bonded warehouse but before the premises could be used for that purpose, certain security requirements needed to be fulfilled. The appellants thus made alterations with a view to improving the premises’ security. The specific question before the Privy Council was whether the premises were “unlet, unoccupied and unfurnished” such that the appellants were not liable for rates on the premises. Although Lord Reid had set out to consider “unoccupied” as an ordinary word of the English language, it did not appear that the discussion could be so neatly divorced from the context. It appears instead that the analysis was closely tied to the question of rateability and therefore the type of use to which the property was put. This is apparent when Lord Reid proceeded to hold as follows (Arbuckle Smithat 824-825): [t]he difficulty in this case arises from a misapplication of the requirement that, to be rateable, occupation must be beneficial. The argument is that if you find the owner making use of his property, and if that use is beneficial, then there must be occupation: the kind of use does not matter.But if the word \"use\" is used in that wide sense that argument must, I think, be wrong or at least too widely stated.If bricking up doors and windows is beneficial use, I do not see how it can be said that replacing or repairing broken doors and windows is not also beneficial use: the premises might be unusable until the repairs had been done.The real question in this case, to my mind, is not whether that kind of use was beneficial. It is whether that kind of use, beneficial or not, can amount to occupation. [emphasis added] 29     The notion that some form of “enjoyment” of the property must exist for it to be occupied was also expressed by Lord Radcliffe, whose analysis was deeply coloured by the particular context in question (Arbuckle Smithat 826-829): What is meant by \"occupation\"? And that, I think, can only be answered by considering what acts, intentions or situations are requisite to constitute occupationfor the purposes of rating. … It is evident … that there will not be occupation in the context of rating unless some use is made of the hereditamentin the course of the relevant year. \"Use\" is not a word of precise meaning, butin general it conveys the idea of enjoyment derived by the user from the corpus of the object enjoyed.When rating law turns its attention from dwelling-houses to industrial or commercial premises the same conceptions are, in my opinion, applicable to determine whether or not occupancy ceases or begins, though they must be adapted to the particular circumstances of such premises, factory or warehouse, and the business for the purpose of which they are created. … Now, the appellants never used the warehouse in question here as a warehouse during 1957-58. That, I think, is the determining point. … Since language is not a precise instrument, it is possible to say that there was use of the premises in the circumstance that they were entered and subjected to the work of adaptation.I do not think, however, that it is this sort of user that is relevant when the court is considering whether a warehouse was in rateable occupation. There was no enjoyment of the value of the building as a warehouse. [emphasis added] No rent was collected 30     Mr Tan also argued that refunds ought to be made in respect of the fitting-out periods because rent was not collected by the Applicant during those periods.[note: 19]In this connection, he argued that s 8 was put in place to protect property owners from being unduly penalised by the charge of property tax where the said owners wereunable to collect any rentdespite making a genuine effort to let out the property at a fair rental.[note: 20]The non-collection of rent is however a separate matter from the inability to secure a tenant (and therefore having no rental income) and it is clearly the latter which Parliament was concerned with (see [17] above). On the facts, the Applicant had already obtained tenants for its units and hadwillinglyextended rent-free fitting-out periods to the tenants prior to the official lease start dates. These concessions must, as Mr Lau correctly argued[note: 21], be viewed in tandem and holistically with the lease terms such that the fitting-out period, although rent-free, essentially formed part of the lease arrangement between the Applicant and the respective tenants.  The property tax regime cannot be defeated by simply stipulating that part of the lease term is to be rent-free. 31     There are two further difficulties with the Applicant’s contention. First, when the refund provisions were reintroduced in 1964, the words “and no rent is payable in respect thereof”, which formed part of s 60 of the Municipal Ordinance (Cap 133, 1936 Ed) and s 110 of the Local Government Ordinance (No. 24 of 1957), were conspicuously omitted. This probably had to do with the change in basis on which property tax was levied,viz, post-1961, the levy of property tax no longer depended on beneficial use of the property and therefore whether rental income was received in respect of the property was no longer determinative (seeProperty Tax in Singapore and Malaysiaat 85). Accordingly, Mr Lau argued, quite correctly, that the removal of that phrase signified that payment of rent is not a factor to consider for the purposes of s 8 of the Act.[note: 22] 32     Although it is implicit that with a tenant comes rent, where a landlord agrees to forego rent for any period, that is a commercial decision taken willingly by him. The refund provisions lighten his tax burden where he is genuinely unable to secure a tenant for his property, not where he decides to forego rent in order to make the rental of his property more attractive to the tenant. 33     Second, according determinative weight to whether rent has started to accrue may encourage property owners to provide tenants with longer rent-free fitting-out periods in order to claim tax refunds while recouping the rent lost during those periods by back-loading the rent after the term start date. This can be easily done if the lost rent is spread out over a 24-month or 36-month tenancy. This would certainly fly in the face of the policy underlying    s 8 of the Act. I acknowledge, however, the counter-argument that such back-loading of rent may also have the effect of raising the annual value of the property, resulting in higher taxes being paid by the owner.",
        "Conclusion": "34     In the circumstances, on a purposive reading of the statutory provisions, the units cannot be said to be unoccupied or vacant within the meaning of s 8 of the Act during the fitting-out periods. Even if the units were deemed unoccupied or vacant, the Applicants could not have fulfilled the requirement for refund contained in s 8(4)(b), which only becomes relevant where no tenant has been obtained. It must be remembered that the refund in   s 8(1) is “subject to this section” and s 8(4) states clearly that no refund shall be allowed unless the owner satisfies the Comptroller in respect of all four conditions listed in ss 8(4)(a) to (d) since they are linked conjunctively by the word “and”. The only exception is in s 8(5) and that has no application on the facts here. 35     The application in Originating Summons No 635 of 2012 is therefore dismissed with costs to be paid by the Applicant to the Comptroller, such costs to be agreed or taxed. 36     I thank counsel for both parties for their able and balanced written and oral submissions and for the light-hearted moments during the arguments in court despite the very weighty legal issues here. I was informed that a sum of about $6.9m is at stake in the applications for refund of property tax in this case.  [note: 1]Statement pursuant to Order 53 Rule 1(2) (2 July 2012) at [4]; Affidavit of William Bright (29 June 2012) at [4]. [note: 2]Affidavit of William Bright (29 June 2012) at WB1. [note: 3]Applicant’s Written Submissions (12 October 2012) at [8]; Respondent’s Written Submissions (11 October 2012) at [3]. [note: 4]Affidavit of Warren Bishop (13 September 2012) at BW3. [note: 5]Affidavit of William Bright (29 June 2012) at [8]. [note: 6]Affidavit of William Bright (29 June 2012) at [9]. [note: 7]Affidavit of William Bright (29 June 2012) at [10] and WB7. [note: 8]Affidavit of William Bright (29 June 2012) at [12] and WB10. [note: 9]Affidavit of William Bright (29 June 2012) at WB10. [note: 10]Affidavit of William Bright (29 June 2012) at WB12. [note: 11]Originating Summons (Ex parte) Am. No. 1 (2 July 2012) at [1]. [note: 12]Applicant’s Written Submissions (12 October 2012) at [29][30]. [note: 13]Respondent’s Written Submissions (11 October 2012) at [24], [28]. [note: 14]Respondent’s Written Submissions (11 October 2012) at [31][41]. [note: 15]Respondent’s Written Submissions (11 October 2012) at [28][29]. [note: 16]Affidavit of Warren Bishop (13 September 2012) at WB3. [note: 17]Applicant’s Written Submissions (12 October 2012) at [31][32]. [note: 18]Applicant’s Written Submissions (12 October 2012) at [28][29]. [note: 19]Applicant’s Written Submissions (12 October 2012) at [49]. [note: 20]Applicant’s Written Submissions (12 October 2012) at [49]. [note: 21]Respondent’s Written Submissions (11 October 2012) at [29]. [note: 22]Respondent’s Written Submissions (11 October 2012) at [18]."
    }
}