{
    "case_title": "Excalibur Group Pte Ltd \n      v\n      Goh Boon Kok",
    "ncitation": "[2012] SGHC 71",
    "coram": "Quentin Loh J",
    "sections": {
        "Introduction": "1       This is an application by the plaintiff,\n                    Excalibur Group Pte Ltd, for a declaration as to whether leave of court is\n                    required before commencing an action against the defendant, Goh Boon Kok, in his\n                    capacity as the liquidator of Kaki Bukit Industrial Park Pte Ltd (“the\n                    Company”) in relation to the administration of the affairs of the Company\n                    or otherwise in relation to his conduct as the Company’s\n                        liquidator.[note: 1]The plaintiff has also\n                    prayed that leave be granted for the plaintiff tocontinueits action if leave is required.[note: 2]The plaintiff has already commenced\n                    proceedings against the defendant in Suit No 162 of 2011\n                        (S162/2011).[note: 3]",
        "Background": "",
        "The plaintiff’s affidavit in support of this\n                application": "2       One of the plaintiff’s directors and\n                    shareholders, Lawrence Leow Chin Hin, filed an affidavit in support of this\n                    application. The following background facts and assertions are taken from this\n                    affidavit. 3       On or about the end of 2001, one Loh Lin Kett\n                    (“Loh”), trading as L K Loh Construction Company, applied to wind\n                    up the Company.[note: 4]The application was heard\n                    and granted by Woo Bih Li JC on 11 January 2002.[note: 5]The defendant was appointed as the\n                        liquidator.[note: 6] 4       According to the plaintiff, on or about\n                    8 November 2002, the defendant, in his capacity as the liquidator of the\n                    Company, invited parties to tender for the purchase of the whole of Lot 5643M\n                    together with the uncompleted building erected on 10 Kaki Bukit Industrial\n                    Terrace Singapore 471819 (“the Property”).[note: 7]On 7 January 2003, the\n                    plaintiff submitted two tenders, one in its name and the other in the name of an\n                    associated company, M/s Fiordland Pte Ltd\n                        (“Fiordland”).[note: 8]The\n                    plaintiff submitted a tender in the sum of $5,318,000 and paid the sum of\n                    $800,000 as a tender fee.[note: 9]Fiordland submitted a\n                    tender in the sum of $7,238,000 and also paid a tender fee of\n                        $300,000.[note: 10] 5       The plaintiff was later informed on\n                    8 January 2003 that the two tenders were rejected.[note: 11]It claims to have subsequently\n                    found out that the tender was awarded to M/s Wellsprings Properties Pte Ltd\n                        (“Wellsprings”).[note: 12]Wellsprings\n                    had submitted a tender in the sum of $8,200,818.[note: 13] 6       The plaintiff claims that on or about October\n                    2009, it came to Loh’s knowledge that Wellsprings had paid secret\n                    commissions in the amount of $270,000 to the defendant in 2004.[note: 14]The plaintiff found out about\n                    this through Loh who was, at the material time, engaged as the defendant’s\n                    personal assistant.[note: 15]The plaintiff claims that\n                    Loh discovered the following invoices at the defendant’s offices while\n                    assisting the defendant:[note: 16] (a)     An invoice dated 16 November 2003\n                        from M/s K S Resource & Management Services (“K S\n                        Resource”) to Wellsprings for the total sum of $75,000. According to\n                        the plaintiff, this was purportedly a “finder’s fee” for\n                        identifying and securing the Property for Wellsprings. A completion account\n                        and mode of disbursement for the sale of the Property was attached to the\n                        invoice. The plaintiff alleges that it was apparent from the\n                        defendant’s handwritten notes on the invoice that he had acknowledged\n                        receipt of $30,000 on 10 March 2004 and $120,000 on 28 September\n                        2004. (b)     An invoice\n                        dated 31 December 2004 from K S Resource to Peh Lee Construction Pte Ltd for\n                        the total sum of $44,000. According to the plaintiff, this was purportedly a\n                        consultancy fee for wall cladding and the provision of quality control\n                        services. (c)     An\n                        invoice dated 3 January 2005 from K S Resource to Wellsprings for the\n                        total sum of $76,000. According to the plaintiff, this was purportedly a\n                        consultancy fee for an investment at Xiamen, China. (d)     A handwritten note in relation to the\n                        contents of the 31 December 2004 invoice and the 3 January 2005\n                        invoice. 7       The plaintiff’s representative deposed\n                    that K S Resource is a sole proprietorship owned by one Mdm Goh Yang\n                    Soo, who the plaintiff understands to be the defendant’s “common\n                    law wife”.[note: 17]Consequently, the\n                    plaintiff believes that the defendant and/or his proxies had been paid secret\n                    commissions in the sum of $270,000 to award the tender to\n                        Wellsprings.[note: 18] 8       As a result of the foregoing, the plaintiff\n                    commenced an action against the defendant in S162/2011.[note: 19]In this action, the plaintiff has\n                    alleged that the defendant was, at the material time, the controlling mind,\n                    will, alter ego and/or the agent of the Company.[note: 20]It has also\n                    alleged that the defendant breached the contract between the plaintiff and the\n                    company, induced the breach of this contract, breached the plaintiff’s\n                    legitimate expectation that the tender process for the sale of the property\n                    would be conducted in good faith, committed fraud by receiving secret\n                    commissions from Wellsprings to award a tender to it, and/or breached his common\n                    law duty of care, which he owed to all the bidders of the Property, to treat all\n                    bidders fairly and equally.[note: 21] 9       On 25 April 2011, the defendant filed an\n                    application to strike out the plaintiff’s statement of claim in\n                        S162/2011.[note: 22]In support of this\n                    application, the defendant had deposed that the plaintiffs’ causes of\n                    action in tort and contract were time barred.[note: 23]It was also\n                    alleged that the court’s leave should have been obtained before commencing\n                        S162/2011.[note: 24] 10     The plaintiff’s representative has\n                    deposed that he believes and has been advised that there was no need to seek the\n                    court’s leave before commencing S162/2011.[note: 25]However, if leave was required, he asserted that leave should be granted because\n                    there is aprima faciecase against the\n                        defendant.[note: 26]",
        "The defendant’s reply affidavit": "11     The defendant pointed out that the plaintiff\n                    took out a similar application in Summons No 600093 of 2011\n                    (“SUM600093/2011”) for leave of court on 30 May\n                        2011.[note: 27]I heard that application. I voiced\n                    my view that there were procedural irregularities in that application. On\n                    26 July 2011, the plaintiff sought and obtained leave from me to withdraw\n                    that application.[note: 28] 12     The defendant referred to and incorporated his\n                    reply affidavit for SUM600093/2011 in his reply affidavit for the present\n                        application.[note: 29]In his reply affidavit for\n                    SUM600093/2011, the defendant deposed that the tender was awarded to Wellsprings\n                    which had submitted the highest bid.[note: 30]The\n                    defendant referred to the affidavit that he had filed in support of his\n                    application to strike out the plaintiff’s statement of claim in S162/2011.\n                    The plaintiff had deposed that, as a court-appointed liquidator, he was an\n                    officer of the court.[note: 31]Hence, leave of the\n                    court should have been obtained before commencing the action.[note: 32]The defendant also asserted that the plaintiff has not managed to establish aprima faciecase against him that would\n                    warrant the grant of the court’s leave.[note: 33]The\n                    defendant maintained that the plaintiff has made unfounded allegations which\n                    have been categorically denied.[note: 34]",
        "Issues": "13     The following issues arise for my\n                    consideration: (a)     Does the Companies Act (Cap 50,\n                        2006 Rev Ed) (“CA”) and Companies (Winding Up) Rules\n                        (Cap 50, R 1, 2006 Rev Ed) (“C(WU)R”) require a\n                        plaintiff to obtain the court’s leave before commencing an action\n                        against a liquidator of a company\n                    (“Issue 1”)? (b)     If not, is there a common law rule to that effect\n                        (“Issue 2”)? (c)     If there is such a common law rule, can leave be granted\n                        retrospectively (“Issue 3”)? The relevance of this issue\n                        is that the plaintiff hasalreadycommenced\n                        action against the defendant (see[1]above). (d)     If so, should leave be granted\n                        (“Issue 4”)?",
        "My decision": "",
        "Issue 1: Does the CA and the C(WU)R require a plaintiff to obtain the\n                court’s leave before commencing an action against a liquidator of a\n                company?": "14     Neither the CA nor the C(WU)R requires a\n                    plaintiff to seek the court’s leave before suing a liquidator. In passing,\n                    however, I should highlight three provisions in the CA concerning the legal\n                    liabilities of liquidators. The first is s 265 of the CA which provides for\n                    the Official Receiver to have oversight over private liquidators (see s 265\n                    of the CA): Control of unofficial liquidators by Official\n                            Receiver 265.—(1)  Where in the winding up of a company by the\n                        Court, a person, other than the Official Receiver, is the liquidator the\n                        Official Receiver shall take cognizance of his conduct and if the liquidator\n                        does not faithfully perform his duties and duly observe all the requirements\n                        imposed on him by any written law or otherwise with respect to the\n                        performance of his duties, or if any complaint is made to the Official\n                        Receiver by any creditor or contributory in regard thereto, the Official\n                        Receiver shall inquire into the matter, and take such action thereon as he\n                        may think expedient. (2)    The Official Receiver may at any time require any\n                            such liquidator of a company which is being wound up by the Court to\n                            answer any inquiry in relation to any winding up in which he is engaged,\n                            and may, if the Official Receiver thinks fit, apply to the Court to\n                            examine him or any other person on oath concerning the winding\n                            up. (3)    The Official Receiver may also direct a local\n                            investigation to be made of the books and vouchers of such\n                            liquidator. The second provision is s 313(2) of the CA which provides\n                    that the court is to take cognizance of the conduct of liquidators: Control of Court over\n                            liquidators (2)    The Court shall take cognizance of the conduct of\n                            liquidators, and if a liquidator does not faithfully perform his duties\n                            and observe the prescribed requirements or the requirements of the Court\n                            or if any complaint is made to the Court by any creditor or contributory\n                            or by the Official Receiver in regard thereto, the Court shall inquire\n                            into the matter and take such action as it thinks fit. The third provision is s 341 of the CA which confers the\n                    court with the power to assess damages against,inter\n                        alia, a liquidator: Power of Court to assess\n                            damages against delinquent officers, etc. 341.—(1)    If, in the course of winding up, it\n                            appears that any person who has taken part in the formation or promotion\n                            of the company or anypast or present\n                                liquidatoror officer hasmisapplied\n                                or retained or become liable or accountable for any money or\n                                property of the company or been guilty of any misfeasance or breach\n                                of trust or duty in relation to the company, the Court\n                            may on the application of the liquidator or of any creditor or\n                            contributory examine into the conduct of such person, liquidator or\n                            officer and compel him to repay or restore the money or property or any\n                            part thereof with interest at such rate as the Court thinks just, or to\n                            contribute such sum to the assets of the company by way of compensation\n                            in respect of the misapplication, retainer, misfeasance or breach of\n                            trust or duty as the Court thinks just. (2)    This section shall extend and apply to and in\n                            respect of the receipt of any money or property by any officer of the\n                            company during the 2 years preceding the commencement of the winding up\n                            whether by way of salary or otherwise appearing to the Court to be\n                            unfair or unjust to other members of the company. (3)    This section shall have effect notwithstanding\n                            that the offence is one for which the offender is criminally\n                            liable. [emphasis added in bold italics]",
        "Issue 2: Is there a common law rule to that effect?": "15     I first examine the position in Singapore\n                    before considering the approach taken in other jurisdictions and I will conclude\n                    by providing my view. The position in Singapore 16     There is no case law in Singapore directly on\n                    point. The leading treatise on Singapore company law,Walter Woon on Company Law(Tan Cheng\n                    Han gen ed) (Sweet & Maxwell, Rev 3rd Ed, 2009), does not suggest that there\n                    is a requirement for leave of court before a party can commence an action\n                    against the liquidator of a company. 17     I note, however, that there is at least one\n                    case in Singapore of an action against a private liquidator (seeTrustee of Estate of Ong Thiam Huat v Chan Hock Seng[2004] SGHC 232, which was a claim against liquidator for negligence\n                    in failing to recover a debt before it became time-barred). Unfortunately, the\n                    narrative of the background in the judgment does not explain whether the\n                    plaintiff in that case had applied for leave before commencing his\n                    action. Australia 18     The Australian position is well settled. There\n                    is ample case law holding that leave of court is required in order to commence\n                    proceedings against a liquidator (Armitage v Gainsborough\n                        Properties Pty Ltd and another[2011] VSC 419\n                        (“Armitage”) at [34]–[42],Baxter v\n                        Hamilton[2005] TASC 64 (“Baxter”) at [32],Mamoneand another v Pantzer[2001] NSWSC 26\n                        (“Mamone”),Sydlow Pty Ltd (in liq) v TG Kotselas Pty Ltd[1996] 144 ALR 159[note: 35]at 165 (“Sydlow”) andRe Siromath Pty Ltd\n                        (No 3)[1991] 25 NSWLR 25 (“Siromath”)). 19     The rationale for requiring leave is two-fold\n                    (seeMamoneat [4]): (a)     First, the courts have an interest\n                        in protecting their own officers from facing “spurious or vexatious\n                        litigation” (seeSiromathat 29\n                        andArmitage at[35]). (b)     Secondly, the courts have an interest in\n                        protecting the integrity of the winding-up process so that the process is\n                        conducted quickly and efficiently for the benefit of all interested persons\n                        (seeSydlowat [29]). Requiring the court’s leave\n                        in order to commence proceedings against a liquidator is one of the measures\n                        that the court can adopt to achieve this objective (ibid). 20     The Australian position does not appear to be\n                    based on any provision in the relevant Australian legislation. England 21     To my knowledge, there is no English case law\n                    on whether leave of court is required to commence an action against a\n                    liquidator. 22     There is, however, a requirement for leave in\n                    order to sue a receiver (seeRe Maidstone Palace of\n                        Varieties[1909] 2 Ch 283 at 286\n                        (“Re Maidstone Palace of\n                    Varieties”),McGowan v Chadwick and\n                        another[2002] EWCA Civ 1785 at [32] andWeston v\n                        Dayman[2006] EWCA Civ 1165 at [16]). The rationale for the requirement for\n                    leave appears to be similar to the first rationale in the Australian cases (see\n                    above at [19(a)]),viz, the desire to protect\n                    an officer of the court (seeRe Maidstone Palace of Varieties\n                        at286): In this case the applicant is a receiver appointed by this Court in a\n                        debenture-holders' action, and by virtue of that appointment he has had the\n                        management of the theatre known as the Maidstone Palace of Varieties. In the\n                        course of that management he made use of certain plant which is claimed by\n                        the respondent company as their property. They say that he had no right to\n                        use it except on the terms of paying them a rent, and they claim a\n                        considerable sum. It appears to me that a dispute of that kind is one which,\n                        as is shewn by Aston v. Heron, the Court will deal with itself, and thatit will not allow its officer to be subject to an\n                            action in another Court with reference to his conduct in the discharge\n                            of the duties of his office, whether right or wrong. The\n                        proper remedy for any one aggrieved by his conduct is to apply to this Court\n                        in the action in which he was appointed. If any wrong has been done by the\n                        officer, the Court will no doubt see that justice is done, but no one has a\n                        right to sue such an officer in another Court without the sanction of this\n                        Court. The present application is accordingly right in form. The respondents\n                        must therefore bring in their claim in the debenture-holders' action within\n                        fourteen days, and must be restrained from commencing any other proceedings\n                        against the receiver. [emphasis added in bold italics] Canada 23     The Canadian Bankruptcy and Insolvency Act RSC\n                    1985 (c B-3) (“the BIA”)expresslyprovides that leave of court is required in order to\n                    sue the Canadian equivalent of a liquidator (a trustee) (see s 215 of the\n                    BIA and L W Houlden, G B Morawetz & Janis Sarra, Bankruptcy\n                    and Insolvency Law of Canada vol 3 (Carswell, 4th Ed Revised, Looseleaf Ed,\n                    2009) at para K§5 (“Houlden”)): No Action against\n                            Superintendent, etc, without leave of\n                        court 215.Except by leave of the court, no action lies against the\n                            Superintendent, an official receiver, an interim receiver or atrusteewith respect to any report made under,\n                            or any action taken pursuant to, this Act. [emphasis added] 24     It should be noted that the BIA applies to\n                    both personal and corporate insolvency (see Marketplace Framework Policy Branch,\n                    Policy Sector, Report on the Operation and Administration of the Bankruptcy and\n                    Insolvency Act and the Companies’ Creditors Arrangement Act (September\n                    2002) at p 7 – accessible at\n                    http://www.iiiglobal.org/component/jdownloads/finish/60/665.html (accessed\n                    on 4 April 2012)). Malaysia 25     The Malaysian courts, like their Australian\n                    counterparts, require leave to be obtained in order to bring proceedings against\n                    a liquidator (see, for example,See Teow Guan & Ors v\n                        KianJoo Holdings SdnBhd & Ors[2010] 1 MLJ 547\n                        (“See Teow Guan”)\n                        at [6]–[9],Abric Project\n                        Management SdnBhd v Palmshine Plaza SdnBhd and another[2007] 3 MLJ\n                        571[note: 36](“Abric”) at [24],Chin CheenFoh v Ong Tee Chew[2003] 3 MLJ 57,Chi Liung Holdings SdnBhd v Ng PyakYeow[1995]\n                        3 MLJ 204[note: 37](“Chi Liung Holdings”)). 26     The rationale underlying the Malaysian\n                    position is similar to the first rationale in the Australian cases (see above\n                    at [19(a)]). Leave is required because a court-appointed liquidator is an\n                    officer of the court (see, for example,Chi Liung\n                        HoldingsandAbric\n                        at[24]). 27     The Malaysian position is not based on any\n                    express provision in the relevant legislation in Malaysia. It should be noted,\n                    however, that the Malaysian Court of Appeal inChi Liung\n                        Holdingsreferred to a provision in the Malaysian legislation\n                    (s 236(3) of the Companies Act 1965 (Act 125 of 1965) (Mal)) in\n                    support of its reasoning that the liquidator is an officer of the court. The\n                    relevant provision reads: (3)    The exercise by the liquidator of the powers\n                            conferred by this section shall be subject to the control of the Court,\n                            and any creditor or contributory may apply to the Court with respect to\n                            any exercise or proposed exercise of any of those powers. The Singapore CA has anidenticalprovision (see s 272(3) of the CA): (3)    The exercise by the liquidator of the powers\n                            conferred by this section shall be subject to the control of the Court,\n                            and any creditor or contributory may apply to the Court with respect to\n                            any exercise or proposed exercise of any of those powers. My view 28     In my view, the Australian and Malaysian\n                    positions should be followed in Singapore. A common law requirement for leave\n                    will promote the desirable objective of ensuring that the winding-up process is\n                    conducted efficiently and expeditiously in the interest of all stakeholders. The\n                    observations of V K Rajah JC, (as he then was), inKorea Asset Management Corp v Daewoo Singapore Pte Ltd (in\n                        liquidation)[2004] 1 SLR(R) 671\n                        (“Korea Asset Management”) in\n                    the context of the strictures imposed upon the commencement of proceedings\n                    against a company once winding-up proceedings have been instituted are useful in\n                    this regard: 36    The rationale for these provisions [ie,\n                            ss 262(3), 299(2) and 227C(c) of the CA] is axiomatic: it is to\n                            prevent the company from being further burdened by expenses incurred in\n                            defending unnecessary litigation.The main focus of\n                                a company and its liquidators once winding up has commenced should\n                                be to prevent the fragmentation of its assets and to ensure that the\n                                interests of its creditors are protected to the fullest extent.In other words, returns to legitimate\n                                creditors should be maximised; the process of collecting assets and\n                                returning them to legitimate creditors should be attended to with\n                                all practicable speed.Unnecessary costs should not be\n                            incurred; liquidators should act in the collective interests of all\n                            legitimate stakeholders and not with a view to enhancing their own\n                            self-interests or fees. [emphasis added in bold italics] This rationale applies equally to claims against a liquidator. A\n                    requirement for leave would ensure that frivolous claims are weeded out at the\n                    outset. This would avoid unnecessary and expensive legal\n                proceedings. 29     The other reasoning adopted by the Australian\n                    and Malaysian courts,viz, that the liquidator is\n                    an officer of the court is, in my opinion, less persuasive. Advocates and\n                    solicitors are also “officers of the court” (see s 82(1) of\n                    the Legal Profession Act (Cap 161, Rev Ed 2009)). It is trite that\n                    there is no requirement for leave in order to sue a lawyer. In my view, the\n                    underlying reason for why liquidators are viewed as requiring the court’s\n                    protection is that they play a central role in administering the winding-up\n                    process. They should be protected against unmeritorious, frivolous or vexatious\n                    legal proceedings which will cause delays and incur additional expense to the\n                    general body of creditors.",
        "Issue 3: Can leave be obtained retrospectively?": "30     There is a suggestion in an Australian\n                    decision that leave can be sought retrospectively ornunc pro\n                        tunc(seeMcDonald v Dare[2001] QSC 405 (“McDonald”) at [25]).McDonaldconcerned an\n                    application for the removal of liquidators of a company (“the parent\n                    company”) on the ground of a “prospect, existence or appearance of\n                    bias or of a conflict of interest” in the light of the liquidators’\n                    involvement as co-defendants in legal proceedings arising from the sale of a\n                    property owned by a company (“the subsidiary”). The parent company\n                    owned 50% of the shares in the subsidiary. In dismissing the application, the\n                    court observed that the other legal proceedings involved allegations that the\n                    liquidators had breached their duties (McDonaldat [25]). Accordingly, leave of\n                    court was required. Significantly, the court suggested that leave should be\n                    soughtnunc pro tunc: [25]  Another problem with the Supreme Court proceeding\n                            is that as it seeks relief against the respondents for alleged breaches\n                            of duty arising in the course of performing their duties as liquidators,\n                            the leave of the court is required before such a proceeding is\n                            commenced:Sydlow Pty Ltd (in liquidation) v TG\n                                Kotselas Pty Ltd(1996) 65 FCR 234, 241 andMamone v Pantzer[2001] NSWSC 26; (2001) 36 ACSR 743, 746.Before the plaintiffs seek to serve the claim and\n                                statement of claim in the Supreme Court proceeding, leave should be\n                                sought nunc pro tunc in respect of commencing the Supreme Court\n                                proceeding. [emphasis added in bold italics] 31     There is a division in the Canadian\n                    authorities as to whether leave may be granted retrospectively (see the cases\n                    listed inHouldenat para K§7). One line of\n                    cases reasons that the failure to obtain leave before commencing action will\n                    cause the action to be a nullity (ibid). The other\n                    line of cases states that leave may be obtained retrospectively as long as there\n                    is no prejudice (in the sense that the trustee was not taken by surprise), the\n                    action was brought in good faith and is not frivolous or vexatious and leave\n                    would have been granted if it had been sought at the outset (ibid). The authors ofHouldentake\n                    the view that the second line of cases is the preferred interpretation of\n                    s 215 of the BIA (see[23]above)\n                    because “it avoids a technical interpretation of the [BIA] and achieves a\n                    fair and just result” (Houldenat\n                    para K§7). I tend to agree. 32     As the plaintiff has submitted[note: 38], the Singapore High\n                    Court has granted leavenunc pro tuncin the\n                    context of a claim against acompanyin\n                    liquidation (seeJumabhoy Rafiq v Scotts Investment\n                        (Singapore) Pte Ltd (in compulsory liquidation)[2003] 2 SLR(R) 422 (“Jumabhoy”)). Leave is expressly required by the CA in\n                    order to commence such a claim (see s 262(3) of the CA). Woo Bih Li J\n                    took the view that the purpose underlying the requirement for leave under\n                    s 262(3) of the CA is to ensure that the liquidators do not get distracted\n                    and expend the company’s assets to defend unnecessary actions (Jumabhoy at[48]). The purpose was not to allow the\n                    liquidators (and hence the other creditors) to enjoy an “unexpected\n                    windfall” which would have been the effect if Woo J took the view\n                    that leave could not have been granted retrospectively. 33     In my view, the reasoning inJumabhoyapplies equally here. As I have stated above,\n                    the purpose of the requirement for leave is to ensure that the winding-up\n                    process is carried out expeditiously and efficiently and to sieve out claims\n                    that are without merit or aimed at delaying the liquidation process\n                        (see[28]above). That purpose\n                    would not be served by holding that leave can only be granted if it is applied\n                    for prospectively.",
        "Issue 4: Should leave be granted?": "34     There is no clear test for the grant of leave\n                    in the Australian authorities. Some of the cases take the view that there is no\n                    specific threshold for the grant of leave to sue a liquidator (seeSydlowat 166; followed inMamone at[5]).\n                    According to these authorities, aprima faciecase\n                    need not necessarily be shown. All the circumstances have to be taken into\n                    account in determining whether leave should be granted (seeSydlowat 166). An example of a factor that would influence\n                    the grant of leave is whether there was an unjustifiable delay in commencing\n                    proceedings against the liquidator (seeMamone\n                        at[6]). Another case\n                    held that the standard was simply one of whether there is aprima faciecase (seeRe Biposo Pty Ltd;\n                        Condon v Rodgers(Unreported, Supreme Court of New South Wales,\n                    Young J, 2 August 1995) cited inArmitageat [37]). Yet another case\n                    appeared to apply a combined test of whether there was aprima faciecase and whether there was sufficient evidence to\n                    show that the proposed claims had a prospect of success (seeArmitageat [65]). The Malaysian authorities do not also\n                    speak with one voice on the threshold for leave. One case applied a test of\n                    whether there was “sufficientprima facieevidence” to support the allegations against the liquidator (seeAbricat [30]). Another case took the view, similar to some of the\n                    Australian authorities, that the threshold for leave would depend on the\n                    circumstances and that a variety of factors such as the “sufficiency of\n                    the evidence adduced” and the “likelihood of success” of\n                    the proposed action should be considered (seeSee Teow\n                        Guanat [7]). Another\n                    authority considered that the court hearing the application for leave will\n                    “act liberally” (Chi Liung Holdings\n                        at210G–H). However, the applicant is required to\n                    satisfy the court of the “probable success” of the action and that\n                    the action is “not vexatious or merely oppressive” (ibid). The Canadian approach seems to set the threshold\n                    at a lower level. Leave will not be denied “unless there is no foundation\n                    for the claim or the claim is frivolous or vexatious” (seeHouldenat para K§8). 35     The foregoing cases show a considerable range\n                    in the different standards of proof to be met before leave is granted. In my\n                    view, all the facts and circumstances of the case have to be taken into\n                    consideration when deciding whether to grant leave. Hard and fast rules should\n                    not be laid down. To my mind, the applicant must at least be able to show aprima faciearguable case. An applicant need\n                    not go so far as to show he will or is likely to succeed. Applications without\n                    any foundation or that are frivolous or vexatious or calculated to delay\n                    proceedings or with an ulterior motive will not be allowed. The stage at which\n                    the proceedings are when such applications are made will also be a very relevant\n                    consideration. Delays in taking out such applications, unless there are good\n                    reasons, will also weigh against an applicant. 36     In the context of the present application, the\n                    Company has already been wound-up.[note: 39]There is, accordingly, no purpose to be\n                    served by withholding leave to commence any action against the defendant. As I\n                    have held above, the rationale for the requirement of leave is to ensure that\n                    the winding-up process is conducted expeditiously and efficiently for the\n                    benefit of all the stakeholders in the company (see[28]above). In these circumstances, I do not\n                    consider that it is necessary to set the threshold for leave at a high level.\n                    Proceeding only on the basis of the evidence set out before me, I find that the\n                    plaintiff has aprima faciearguable case against\n                    the Liquidator. Hence, I grant the plaintiff retrospective leave to commence\n                    S162/2011. 37     In relation to the merits of the claims\n                    against the defendant in S162/2011, I understand that there is a pending\n                    striking out application,viz, Summons\n                    No 1778 of 2011 (“SUM1778/2011”) in S162/2011. The striking\n                    out application has been taken out on the basis that the statement of claim\n                    discloses no reasonable cause of action and/or is scandalous, frivolous or\n                    vexatious and/or may prejudice, embarrass or delay the fair trial of the action\n                    and/or is an abuse of process of the court. I make no comment on the merits of\n                    the plaintiff’s claims which will be addressed in the hearing of\n                    SUM1778/2011.",
        "Conclusion": "38     For the reasons set out above, I grant the\n                    plaintiff an order in terms of prayers 1 and 2 of this\n                application. 39     I will hear the parties on\n                costs.  [note: 1]Originating Summons No 636 of 2011\n                                – Prayer 1. [note: 2]Originating Summons No 636 of 2011 – Prayer\n                                2. [note: 3]See the EFS Case File for Suit\n                                No 162 of 2011. [note: 4]Affidavit of Lawrence Leow Chin Hin\n                                dated 27 July 2011 at [4]. [note: 5]Affidavit of Lawrence Leow Chin Hin dated 27 July 2011 at\n                                    [5]. [note: 6]Ibid. [note: 7]Affidavit of Lawrence Leow Chin Hin dated 27 July 2011 at\n                                    [6]. [note: 8]Affidavit of\n                                Lawrence Leow Chin Hin dated 27 July 2011 at [8]. [note: 9]Ibid. [note: 10]Ibid. [note: 11]Affidavit of Lawrence Leow Chin Hin dated 27 July 2011 at\n                                    [9]. [note: 12]Ibid. [note: 13]Ibid. [note: 14]Affidavit of Lawrence Leow Chin Hin dated 27 July 2011 at\n                                    [10]. [note: 15]Ibid. [note: 16]Ibid. [note: 17]Affidavit of Lawrence Leow Chin Hin\n                                dated 27 July 2011 at [11]. [note: 18]Affidavit of Lawrence Leow Chin Hin\n                                dated 27 July 2011 at [11]. [note: 19]Affidavit of Lawrence Leow Chin Hin dated 27 July 2011 at\n                                    [12]. [note: 20]Ibid. [note: 21]Ibid. [note: 22]Affidavit of Lawrence Leow Chin Hin\n                                dated 27 July 2011 at [14]. [note: 23]Ibid. [note: 24]Ibid. [note: 25]Affidavit\n                                of Lawrence Leow Chin Hin dated 27 July 2011 at [15]. [note: 26]Affidavit of Lawrence Leow Chin Hin\n                                dated 27 July 2011 at [16]–[30]. [note: 27]Affidavit of Goh Boon Kok dated 18 August 2011 at\n                                    [4]. [note: 28]Minute Sheet of Quentin Loh J dated 26\n                                July 2011. [note: 29]Affidavit of Goh Boon Kok dated 18\n                                August 2011 at [5]. [note: 30]Affidavit\n                                of Goh Boon Kok for SUM600093/2011 dated 24 June 2011 at [8]. [note: 31]Affidavit of Goh Boon Kok for\n                                SUM600093/2011 dated 24 June 2011 at [13]. [note: 32]Ibid. [note: 33]Affidavit\n                                of Goh Boon Kok for SUM600093/2011 dated 24 June 2011 at [18]. [note: 34]Ibid. [note: 35]Plaintiff’s Bundle of Authorities at Tab\n                        6. [note: 36]Defendant’s Bundle of Authorities at Tab\n                                5. [note: 37]Defendant’s Bundle of\n                                Authorities at Tab 2. [note: 38]Plaintiff’s submissions at [19]. [note: 39]See the\n                                winding up order in the case file for CWU600336 of 2001 (dated 11\n                                January 2002, before Woo Bih Li JC (as he then\n                        was))."
    }
}