{
    "case_title": "Manickam Sankar\n      v\n      Selvaraj Madhavan (trading as MKN Construction &\n                Engineering) and another",
    "ncitation": "[2012] SGHC 99",
    "coram": "Chan Seng Onn J",
    "sections": {
        "Introduction": "1       This was an action by\n                    Manickam Sankar (“the plaintiff”) against his\n                    former employer, Selvaraj Madhavan (trading as MKN\n                    Construction & Engineering) (“Madhavan”),\n                    as the first defendant and Trans Equatorial Engineering Pte\n                    Ltd (“TEE”) as the second defendant. The\n                    plaintiff instituted his action on 16 March 2011,\n                    claiming that both defendants were liable for his fall from\n                    the area between the false ceiling of the first storey and\n                    the floor slab of the second storey of Terminal 1, Changi\n                    Airport (“the Ceiling Space”) which caused him\n                    to suffer various injuries. 2       TEE was the main contractor\n                    in a project for the “Design, Supply, Installation,\n                    Testing and Commissioning of VAV Boxes and Associated\n                    Control and Electrical Works in T1 and T2, Singapore Changi\n                    Airport” (“the Project”). The project\n                    owner was the Civil Aviation Authority of Singapore\n                    (“CAAS”). 3       Madhavan failed to enter an\n                    appearance although the writ of summons was served on him by\n                    way of personal service on 19 March 2011. Consequently,\n                    interlocutory judgment in default of appearance was entered\n                    against him by the plaintiff on 29 March\n                2011. 4       The plaintiff’s action\n                    against TEE was bifurcated on 29 June\n                2011.",
        "The evidence": "",
        "The plaintiff’s case": "5       The plaintiff was the sole\n                    witness called in support of his case. His account in his\n                    Affidavit of Evidence-in-Chief (“AEIC”) of the\n                    events leading up to the fall was as follows[note: 1]: 4    On the night of 19.05.2009, I\n                            was working at Singapore Changi Airport Terminal 1.\n                            As I did not know the way to Singapore Changi\n                            Airport Terminal 1, I met one Kannan and followed\n                            him. We reached the Singapore Changi Airport\n                            Terminal 1 at or about 11.00pm. As work was to start\n                            at 1.00am, Kannan and I went to a warehouse to pick\n                            up some equipment (air-conditioner spare parts)\n                            before going to Terminal 1. Upon reaching Terminal\n                            1, as there was still time to spare, the other\n                            workers and I were sitting around the bus terminal\n                            and drinking coffee. 5    A group of 10 workers including\n                            me were involved in carrying out the works at the\n                            material time. Rex [a supervisor, one Selvaraj Arun\n                            Johansonrex (“Rex”)] came to the spot\n                            and told all the workers including me to be at the\n                            work area by [11.50pm] as work had to start at\n                            [midnight]. Accordingly all the other workers and I\n                            walked to the work area.At\n                                [11.55pm] all the workers including myself were\n                                given safety belts without any explanation. We\n                                were not issued with other safety equipment like\n                                safety helmets. Even the safety shoes I was\n                                wearing on the day of the accident was my\n                                own. Thereafter, Rex told us to\n                            follow Kannan and go up and start work.Rex did not do or say anything else. We\n                                did not have any safety briefing that\n                                day. 6    We were working on the staging\n                            of the said premises which is about 12 metres high.\n                            We were fixing the air-conditioner. As such, each of\n                            the workers including myself had carried a ladder to\n                            the work area.Rex did not climb\n                                the ladder. 7    When I was mounting the ladder,\n                            I had already worn my safety belt as I had already\n                            commenced work.The area wasnot well lit and\n                                lighting was insufficient for the workers\n                                including myself to differentiate between the\n                                catwalks and the false ceiling (“ceiling\n                                panels”).Further, approximately every 3 feet of the work\n                                area was covered with huge railings. There was\n                                no space for the other workers and myself to\n                                walk and do our work. Thus, we had to crawl on\n                                our bellies to move from one point to the other.\n                                Furthermore,there\n                                was nowhere for the workers including myself to\n                                anchor our safety harness while we were crawling\n                                and doing our work. 8Kannan was\n                                the first person to crawl to the other side of\n                                the work area. Thereafter, two other workers\n                                carried equipment and crawled to the other side\n                                of the work area after Kannan. I was the next\n                                worker who carried equipment and crawled to the\n                                other side of the work area. After passing the\n                                equipment to Kannan, the two other workers and I\n                                turned around to crawl back to the other side of\n                                the work area.I\n                                was the first worker to crawl\n                            back. 9On my way\n                                back,the staging\n                                gave wayand I fell about 78 to 80\n                            feet to the ground and was injured as a result. At\n                            the time of the accident I weighed about106 kilogramsand was about6 feet tall.\n                            ... [emphasis added in italics and bold italics] When the plaintiff stated “On the night of\n                    19.05.2009...” at para 4 of his AEIC, this was\n                    clearly a mistake because the plaintiff reached Changi\n                    Airport on the night of 18 May 2009 and the accident\n                        (ie, the fall from the\n                    Ceiling Space) occurred in the early hours of 19 May\n                    2009. Nothing turned on this. 6       The plaintiff’s\n                    account in his AEIC of what happened was elaborated upon in\n                    oral evidence. Before the plaintiff went up the ladder to the\n                Ceiling Space 7       The plaintiff is an Indian\n                    national. Before he arrived in Singapore sometime in March\n                    or April 2009[note: 2], he was\n                    working, and had always been working, as a marketing\n                    executive in the finance sector in India[note: 3].\n                    This job did not require him to wear a safety\n                        harness[note: 4]. 8       Sometime in March or April\n                    2009, the plaintiff attended a “Construction Safety\n                    Orientation Course for Workers (General Trade)” which\n                    was conducted in Singapore by an entity called\n                    “Armstrong Health and Safety Training\n                    Providers” (see Plaintiff’s Bundle of Documents\n                    (“PB”) at p 50) (“the Safety\n                        Course”)[note: 5]. The plaintiff was\n                    taught how to wear a safety harness and how to hook the\n                    safety harness to metal railings[note: 6]. However, the\n                    Safety Course did not teach him how to hook the safety\n                    harness to objects which were larger than the opening of the\n                        hook[note: 7]. I\n                    demonstrated to the plaintiff how the safety harness could\n                    be hooked to such objects by looping the rope around the\n                    object and then attaching the hook to the rope itself\n                    (“loop-hooking”). The plaintiff stated that he\n                    was not taught this method of hooking the safety harness at\n                    the Safety Course, and that he had not personally thought\n                    about this method before[note: 8]. Furthermore,\n                    during the Safety Course he was only told that the safety\n                    harness should be hooked when he was at the place where the\n                    work proper was being carried out. He was not told that he\n                    should also hook the harness when he was moving\n                        around[note: 9]. 9       On 18 May 2009,\n                    Madhavan instructed the plaintiff to report for work at\n                    Changi Airport for “air-con\n                        renovation”[note: 10]. The\n                    plaintiff arrived at Changi Airport at about 11pm on\n                    18 May 2009. At about 11.30pm, Rex told him and some\n                    other workers to be at the work area by 11.50pm because work\n                    would start at midnight[note: 11]. When\n                    the plaintiff reached the work area at Terminal 1, he saw\n                    two Chinese men. No briefing was given by these two men to\n                    the workers[note: 12]. The\n                    ten workers, including the plaintiff, were told that the\n                    works would commence at midnight and that they should wear\n                    their safety harnesses[note: 13].\n                    Further, they were told that it was getting late and that\n                    they should commence work[note: 14]. Rex\n                    fixed the safety harness to the plaintiff because the latter\n                    did not know how to do so[note: 15]. 10     The safety harness which\n                    TEE produced at trial was not of the same type as the safety\n                    harness which was in fact provided to the plaintiff on\n                    18 May 2009[note: 16]. The\n                    safety harness which was supplied to him had hooks with a\n                    gap of about 4cm. This was significantly smaller than the\n                    hooks of the safety harness which was produced in court\n                    (which had a gap of about 7cm)[note: 17]. 11     Before the plaintiff went\n                    up the ladder to the Ceiling Space, he was not shown any\n                    diagrams or photos of the Ceiling Space or of the particular\n                    area in the Ceiling Space where he would be working that\n                        night[note: 18]. He\n                    was also not toldhowto hook\n                    the safety harness[note: 19]. Rex told the\n                    plaintiff to follow one Ramanujan Kamalakkannan\n                    (“Kannan”). The plaintiff, Kannan and another\n                    pair of workers then went up the ladder[note: 20]. Rex remained at the\n                    foot of the ladder on the first storey and was supposed to\n                    pass things to the workers, who would then bring the things\n                    up to the Ceiling Space[note: 21]. When\n                    cross-examined, the plaintiff maintained that Rex was not in\n                    the Ceiling Space when the accident occurred because Rex was\n                    on the ground level near the ladder[note: 22]. Events occurring in the Ceiling Space 12     At the top of the ladder,\n                    the plaintiff and the other workers stepped onto a catwalk\n                    (see, for example, p 54 Second Defendant’s Bundle of\n                    Documents (“SDBD”))[note: 23]. Each worker was\n                    carrying a plank to be carried to the worksite. The workers\n                    then walked along the catwalk to the area where some old VAV\n                    boxes were located (see red arrows at SDBB p 41)[note: 24]. However,\n                    at some parts the workers had to stoop or crawl because\n                    there were obstructions. The plaintiff was following\n                    Kannan. 13     There were fluorescent\n                    tubes placed every 7 or 8 feet “within some\n                    gaps” in the Ceiling Space (see, for example, p 54\n                    SDBD). However, it was dark at the place where the plaintiff\n                        fell[note: 25]. That\n                    area was not bright and not clear, but the plaintiff could\n                    see his own feet[note: 26]. 14     At this juncture, it is\n                    necessary to set out the following diagram of the immediate\n                    vicinity of where the fall occurred[note: 27]:  The part marked\n                    “Ceiling Panels” in the diagram was the area\n                    from which the plaintiff fell. Photos of this area can be\n                    found at pp 47–51 SDBD. 15     Once the workers\n                    (including the plaintiff) reached A, they left the planks\n                    there because there were some “stage works”\n                    which were going to be carried out in that area[note: 28]. Kannan had a\n                    fluorescent light (chemically operated) in his hand, whereas\n                    the plaintiff did not have a light[note: 29]. Kannan was\n                    the first person to cross from A to B, and Kannan had told\n                    the plaintiff to follow the route which he (Kannan) took.\n                    However, Kannan did not tell the plaintiff of the location\n                    of the ceiling panels and that he should not step on\n                        them[note: 30]. 16     Once Kannan had reached B,\n                    he stopped there and motioned for the three other workers\n                    (including the plaintiff) to bring the planks\n                        over[note: 31].\n                    Kannan and the other two workers did not hook their safety\n                    belts to any external objects when they were crossing from A\n                    to B[note: 32]. The plaintiff was the\n                    last to cross from A to B. He stated that he could not\n                    recall how he got across from A to B, and that he may have\n                    placed his foot on the area marked by dotted marks (see p 6\n                    of Rex’s AEIC and the southeast part (relative to the\n                    marking “B”) of the photo at p 51 SDBD)\n                    (“the Transverse Grating”)[note: 33]. The plaintiff could\n                    not remember clearly[note: 34]. He stated that\n                    there was “some kind of railing by the side”\n                    and that “[they] stacked onto it”[note: 35]. 17     The plaintiff was the\n                    first person to attempt to return to A from B[note: 36]. The three other workers\n                    were behind him. The fall occurred because the plaintiff\n                    placed his foot in the wrong place when he was in a stooping\n                        position[note: 37]: Witness:To---for\n                                        about 3 feet, we have to crawl. And\n                                        according to the photo, we\n                                        cannot---we---after two---we will be\n                                        crawling for about 3 feet. After which,\n                                        we could get up and---we cannot stand at\n                                        our full height but maybe you can just\n                                        bend down a\n                                    little.Court:Yes,\n                                        that’s where I’m getting at.\n                                        You’ll bend down. At that time\n                                        when you fell through, were you\n                                        crawling? Were you---were you crawling\n                                        or---or stooping as you were---as you\n                                        were walking before---just before you\n                                        fell? ...Witness:I was\n                                        stooping, your\n                                    Honour.Court:So just\n                                        before you fell, you were actually\n                                        stooping to go back, stooping to\n                                        walk---walk in a stooping position to go\n                                        back, right, you’re\n                                        stooping?Witness:Yes,\n                                        your Honour.Court:So you\n                                        step off the---the---the metal grating\n                                        and onto the false\n                                        ceiling?Interpreter:Sorry,\n                                        your Honour. Can you repeat\n                                        that?Court:That\n                                        means to say, in his stooping position,\n                                        as he was making his way back, he\n                                        stepped off the metal grating onto the\n                                        false ceiling whilst making his way\n                                        back.Witness:Yes,\n                                        your Honour, that was the time [I fell\n                                        off after I\n                                    turned.]...Court:Above\n                                        “B”, there is a bar,\n                                        right, I mean it would be\n                                        a---Tan:There’s a\n                                    railing....Witness:Yes,\n                                        your Honour.Court:So\n                                        actually, you---you---your head was\n                                        below the---you were stooping, right, so\n                                        you fell through underneath the railing\n                                        into the hole because you were in a\n                                        stooping position, right, making your\n                                        way back?Witness:It\n                                        was---it was---I was stooping low. It\n                                        was the point when I try to rest up a\n                                        bit, that was when I fall\n                                        off.Court:Yes, you\n                                        fell through the hole, I mean beneath\n                                        the railing. It’s not as though\n                                        you fell over the railing. You\n                                        step---you step out of\n                                        “B”, one foot, and then\n                                        you practically---your---your first foot\n                                        fell through and then your body just\n                                        followed beneath the railing and out\n                                        through the hole of the---between the\n                                        railing and the\n                                    grating?Witness:Yes,\n                                        your Honour.Court:So\n                                        actually you were stooping to make your\n                                        way back, walking slowly to make your\n                                        way back except that one foot went to\n                                        the wrong place and you fell\n                                        through?Witness:Yes,\n                                        your Honour.Court:I see.\n                                        So you did not see clearly where you\n                                        were going in that sense, it was\n                                        dark?Witness:There\n                                        wasn’t much light there, your\n                                        Honour.Court:Right.\n                                        So you couldn’t see between the\n                                        grating and the false ceiling in that\n                                        sense, you couldn’t differentiate\n                                        between the grating and the false\n                                        ceiling?Witness:Yes, I\n                                        could not differentiate, your Honour\n                                        [and there wasn’t much\n                                        light.]   18     I observed that the\n                    plaintiff was fairly big-sized and tall. In his AEIC (at\n                    para 9), he said that he was 6 feet tall and weighed about\n                    106 kg at that time. Due to his size, manoeuvring in such a\n                    confined space would not have been easy especially when he\n                    had to bend down to clear the horizontal railing before he\n                    could get back from B to A. From a stooping position, he\n                    would have to extend his leg out to step on the Transverse\n                    Grating (seen as dotted lines in the diagram above) to\n                    support himself before climbing on top of the Air Con Duct\n                    at C, which was at a higher level, in order to reach A. The\n                    plaintiff’s fall had to be seen in that context\n                    because the horizontal railing was in the way, which made it\n                    rather difficult to cross over safely in my\n                opinion. 19     The plaintiff was\n                    cross-examined on why his report of the accident to the\n                    Ministry of Manpower had stated that “the stagingand the safety beltgave\n                    way [emphasis added]”[note: 38], even though he had\n                    earlier testified that his safety harness was not hooked\n                    onto anything when he fell[note: 39]. This report was\n                    interpreted to the plaintiff in Tamil before he signed it.\n                    The plaintiff explained that what he meant was that he had\n                    fallen offtogether withthe\n                    safety harness. He asserted that he did not tell the\n                    interpreter that the safety harness had given\n                        way[note: 40]. The\n                    plaintiff also stated that he did not know what the word\n                    “staging” meant. 20     When asked whether the\n                    safety harness was hooked by him to an anchor point during\n                    the crossing over from B to A, the plaintiff responded by\n                    saying that he had not hooked it because there was no place\n                    to hook it to[note: 41].",
        "TEE’s case": "Evidence of the supervisor, Rex 21     Rex is presently an\n                    employee of Nam Hong Construction & Engineering Pte Ltd.\n                    At the time of the accident, Rex was employed by a company\n                    called Yong Teng Engineering (“Yong Teng”) and\n                    he was assigned to work on the Project. After he arrived at\n                    Changi Airport sometime between 11.30pm and 11.45pm on\n                    18 May 2009, he met four workers supplied by Madhavan.\n                    Two of the four workers, Kannan and Masilamani\n                    Chandrasekaran (“Chandra”), were not new\n                    workers in that they had worked on the Project before.\n                    However, it was the first day on the job for the other two\n                    workers (one of whom was the plaintiff) and Rex was aware of\n                        this[note: 42]. The plaintiff was paired up\n                    with Kannan by Rex[note: 43]. 22     Rex did not show the\n                    diagrams at pp 4 and 6 of his AEIC (see above at[14]for the diagram at p 6 of\n                    his AEIC) to the plaintiff before the latter went up the\n                    ladder even though he knew that the plaintiff was working at\n                    that site for the first time and the other workers who had\n                    worked on the Project before knew about the\n                        diagrams[note: 44].\n                    TEE’s project engineer, Tommy Liaw Chee Wee\n                    (“Liaw”), was the first person to go up the\n                    ladder, followed by Rex, Kannan, and three other workers\n                    (including the plaintiff)[note: 45]. Liaw\n                    and Rex did not carry anything up the ladder, while Kannan\n                    and the three workers were carrying tools[note: 46]. The wooden planks were\n                    already in the Ceiling Space because some work was done\n                    there on the previous night[note: 47]. 23     After all the workers had\n                    climbed up the ladder, Rex’s evidence was that he had\n                    told the plaintiff that there were metal catwalks and metal\n                    railings. Rex said that he had also shone his torchlight to\n                    show the plaintiff where to go and where not to\n                        go[note: 48].\n                    Specifically, Rex asserted that he had shone his torchlight\n                    on the ceiling panels and told the plaintiff that it was\n                    dangerous if he went closer to the ceiling\n                        panels[note: 49]. Rex\n                    made the plaintiff and Kannan cross from A to B and he\n                    crossed over last[note: 50].\n                    Although Kannan had a headlight[note: 51], he did not turn it\n                        on[note: 52]. As\n                    Rex was crossing from A to B, he hooked his safety harness\n                        somewhere[note: 53]. Once\n                    the three of them were at B, Rex showed the plaintiff and\n                    Kannan the location where they would be working that night.\n                    Rex then crossed back from B to A, followed by\n                        Kannan[note: 54]. When\n                    Rex was past A and Kannan was at A, Kannan called out to Rex\n                    to say that someone fell down, and Rex came running\n                        over[note: 55]. When\n                    Rex saw that the plaintiff had fallen to the ground level,\n                    he informed Liaw and all the works were stopped[note: 56]. 24     When questioned by the\n                    court, Rex explained that in order to cross from A to B, one\n                    would first have to stand on top of the air-con duct marked\n                    C (see bottom right section of photo 14 at p 47\n                        SDBD)[note: 57].\n                    After that, one would have to hook the safety harness on the\n                    beam (see square beam running diagonally downwards from\n                    upper right to middle of photo 14). However, as the opening\n                    of the hook was not large enough to fit around the beam\n                    directly, the loop-hooking method would have to be\n                        used[note: 58]. This method of\n                    hooking the safety harness was demonstrated by Rex in court.\n                    Once the harness was hooked to the beam, one would then have\n                    to step down to the Transverse Grating which was\n                    about 40cm wide (see lower centre section of\n                    photo 14, and also the area demarcated by dotted lines\n                    in the diagram at[14]above)[note: 59]. The Transverse\n                    Grating was about 73cm lower than the air-con\n                        duct[note: 60]. The\n                    distance between the air-con duct and the catwalk at B\n                        (ie, the length of the\n                    Transverse Grating) was about 1.5m[note: 61]. Rex explained that one\n                    would then have to stoop underneath a horizontal metal\n                    railing in order to step onto B[note: 62]. This railing was\n                    higher than the catwalk at B by\n                        about 1.38m[note: 63]. 25     Rex also explained how one\n                    would cross from B back to A. First, while standing on\n                    the catwalk at B, one would have to hook on to the\n                    horizontal metal railing first[note: 64].\n                    Next, one would have to stoop under the horizontal metal\n                    railing and step on the Transverse Grating (most likely with\n                    the left foot) to hook the safety harness (using\n                        loop-hooking[note: 65]) to the roof\n                    truss which was further away. Both hooks of the safety\n                    harness would not be hooked at the same time to the same\n                        spot[note: 66].\n                    After hooking the harness to the beam while stooping under\n                    the horizontal metal railing, one would have to detach the\n                    other hook from the said railing (“sequential\n                    hooking”). One would then step onto the air-con duct\n                    which was higher than the platform by\n                        about 73cm[note: 67]. Rex did not\n                    explain to the plaintiff how to navigate the path back\n                    from B to A[note: 68].\n                    However, he maintained that the air-con duct was the only\n                    obstacle there[note: 69]. Evidence of the safety supervisor, Heng 26     Heng Chin Aun\n                    (“Heng”) is presently employed by TEE as a\n                    safety supervisor. At the time when the accident occurred,\n                    Heng had been employed by TEE for about 10 years and\n                    was the safety supervisor for the Project. 27     Heng’s evidence was\n                    that on 18 May 2009, the work day started at about\n                    midnight with a toolbox meeting for all workers who were\n                    scheduled to work that night[note: 70]. This toolbox meeting was\n                    held on the ground floor. It was “to remind the\n                    workers of the safety issues that they have to pay attention\n                    to at work” as they would be working at a height of\n                    about 8m from the ground[note: 71]. The toolbox meeting was\n                    conducted mainly by Liaw who did most of the talking. Heng\n                    added his comments and observations where necessary. It was\n                    emphasised to the workers as a group that they would be\n                    working at a height and that they should put on their safety\n                    harness and hook it at all times[note: 72]. Among other\n                    things, Heng made sure that all the workers were wearing\n                    their safety harnesses, and he also told them that they\n                    should hook the safety harness to a safe anchor\n                        point[note: 73]. However, he did\n                    not demonstrate how they should go about doing\n                        this[note: 74].\n                    Although Heng knew that the plaintiff was coming to work on\n                    the Project for the first time, he did not explain the\n                    safety issues to the plaintiff separately[note: 75]. 28     After the toolbox meeting,\n                    Heng checked to ensure that each worker had put on his\n                    safety harness before climbing the ladder[note: 76]. After the workers went\n                    up the ladder to the Ceiling Space, Heng remained on the\n                    ground floor with one Mohammad Mohsin Bashir Ahammad\n                    (“Mohsin”). Mohsin helped Heng to cordon off\n                    an area on the ground floor in order to avoid injury from\n                    falling objects to persons who were passing by. After the\n                    cordon was set up, Heng was supposed to go up to the Ceiling\n                    Space to ensure that the workers complied with safe work\n                    procedures, especially as regards the hooking of their\n                    safety harnesses[note: 77]. When the plaintiff fell\n                    from the Ceiling Space, Heng was still setting up the cordon\n                    on the ground floor. Heng ran to the plaintiff’s\n                    location to help him and Heng noticed that the plaintiff was\n                    still wearing his safety harness[note: 78]. Evidence of the project engineer, Liaw 29     Liaw is presently employed\n                    by Sembawang Engineers and Constructors Pte Ltd as a\n                    mechanical engineer[note: 79]. At\n                    the time of the accident[note: 80], Liaw was employed by TEE as\n                    a project engineer. At about 11.50pm on 18 May\n                    2009, a toolbox meeting was held. Liaw testified that he had\n                    reminded a group of workers, including the plaintiff, of\n                    safety issues[note: 81]. Although Liaw\n                    was aware that the plaintiff was working at the site for the\n                    first time, he did not explain the safety issues to the\n                    plaintiff separately[note: 82].\n                    Among other things, Liaw told the workers that they were\n                    required to wear their safety harnesses and to hook the\n                    harnesses while they were working[note: 83]. However,\n                    he did not demonstrate to the workers how they were supposed\n                    to hook the harnesses[note: 84]. The\n                    reason for the absence of any demonstration was because Liaw\n                    assumed that all the workers knew how to use the\n                        harness[note: 85]. The\n                    plaintiff had not come forward to ask how to use the\n                        harness[note: 86]. 30     Liaw was the first to go\n                    up the ladder[note: 87]. He\n                    led the workers to the first work location which was about\n                    6 metres from A (see the two VAV boxes coloured in red\n                    and which were closest to A at p 39 of\n                    Liaw’s AEIC)[note: 88].\n                    Those two VAV boxes were scheduled to be replaced that\n                    night. Liaw assigned two workers to remove the VAV boxes and\n                    another two workers to assist them. When Liaw was still at\n                    this location, he heard a loud shout and he was told that\n                    someone had fallen through the ceiling panels. At that time,\n                    the workers were just about to start work on the VAV boxes\n                    at the first work location. 31     After the accident, CAAS\n                    asked TEE to halt the works and to brief it on how the\n                    accident could have happened and whether even more safety\n                    measures could be taken to ensure the safety of workers. In\n                    order to prepare for the briefing, Liaw went up to the\n                    working area on 2 June 2009 to take photographs of the\n                    location where the accident occurred[note: 89].",
        "Events leading up to the accident": "32     Counsel for TEE, Mr Tan\n                    Joo Seng (“Mr Tan”), argued that TEE’s\n                    version of events should be accepted in preference to that\n                    of the plaintiff’s for two reasons. First, Rex was an\n                    “independent” witness in that he was not an\n                    employee of TEE and had never been in its employment. Thus,\n                    he had nothing to gain or lose from the outcome of the case.\n                    Mr Tan argued that the same could be said of Liaw. By\n                    contrast, a lot was at stake for the plaintiff because\n                    although he had initially applied for workmen’s\n                    compensation with the Ministry of Manpower\n                    (“MOM”), he later opted not to accept\n                    MOM’s assessment of damages and instead to pursue his\n                    rights under the common law. The plaintiff had every reason\n                    and motivation to twist his evidence to advance his\n                    case. 33     Secondly, the\n                    plaintiff’s evidence was inherently implausible and\n                    demonstrated a selective recollection of the facts: (a)     It was highly\n                        implausible that the plaintiff was not taught how to\n                        hook the safety harness at the Safety Course. A safety\n                        harness was a crucial piece of equipment to be worn by\n                        workers working at height. It was very unlikely that\n                        workers were not taught how to secure the harness\n                        properly during the Safety Course. (b)     The plaintiff said\n                        that he did not know how he had managed to cross from A\n                        to B. This selective amnesia was deliberate. The\n                        plaintiff managed to cross over safely the first time\n                        and did not want to show the court that it could be\n                        done. It was inexplicable that he could recall in much\n                        detail the events occurring before he crossed from A to\n                        B (including the lighting) but not the actual crossing\n                        itself. (c)     Liaw, Heng and Rex all testified that\n                        there was a safety briefing and their evidence on this\n                        was not challenged. (d)     Rex did enter the Ceiling\n                        Space. Heng stated that all workers then entered the\n                        Ceiling Space except for Mohsin and himself, who\n                        remained on the ground to set up a cordon. This aspect\n                        of Heng’s evidence was not challenged by the\n                        plaintiff’s solicitors. Further, there was no\n                        reason for Rex to remain on the ground\n                    level. 34     In response, counsel for\n                    the plaintiff, Mr R Kalamohan\n                    (“Mr Kalamohan”), advanced the following\n                    arguments: (a)     TEE’s case\n                        was loaded with inconsistencies between their witnesses\n                        as to what happened on the day of the accident,\n                        especially between the testimony of Rex and Liaw.\n                        Additionally, there were internal contradictions between\n                        the AEIC and testimony of the same witnesses,\n                        particularly Rex and Liaw. (b)     There was no evidence\n                        produced to disprove the plaintiff’s evidence that\n                        he was not taught loop-hooking and sequential hooking\n                        during the Safety Course. Therefore, the court should\n                        accept the plaintiff’s evidence to that effect.\n                        TEE’s argument was purely\n                    speculative. (c)     It was understandable that the\n                        plaintiff was not able to remember exactly how he\n                        crossed from A to B given that almost three years had\n                        elapsed between the accident and the time he testified\n                        in court. Furthermore, he had spent very little time in\n                        the Ceiling Space (which had poor lighting) and had only\n                        crossed from A to B once. It was not fair for TEE to\n                        regard the plaintiff’s inability to recollect how\n                        he crossed from A to B and his ability to remember the\n                        lighting conditions as selective amnesia because the\n                        lighting would be the first thing that one would notice\n                        upon entering the Ceiling Space.",
        "Before the plaintiff went up the ladder to the\n                Ceiling Space": "35     The first area of dispute\n                    between the parties was whether the plaintiff had been\n                    taught at the Safety Course in March or April 2009 how to\n                    hook the safety harness by loop-hooking and sequential\n                    hooking. I accepted the plaintiff’s evidence that he\n                    was not taught these methods of hooking the safety harness\n                    at the Safety Course. He appeared to me to be an honest\n                    witness who was trying his best to recall the events which\n                    occurred about three years ago. It would have been highly\n                    implausible if the plaintiff had not been taught how to hook\n                    the safety harnessat all.\n                    However, as the plaintiff testified, he was in fact taught\n                    how to wear the safety harness and how to hook the safety\n                    harness to objects such as metal railings (where the objects\n                    were smaller than the gap in the hook). Given that this was\n                    so, I rejected Mr Tan’s submission that the additional\n                    methods of loop-hooking and sequential hooking were also\n                    taught during the Safety Course. It was open to TEE to have\n                    called the course instructors to testify in court but it did\n                    not do so. 36     The second area of dispute\n                    was whether a safety briefing had been conducted on the\n                    night of 18 May 2009 and, if so, what matters were\n                    touched upon during the briefing. Based on the evidence of\n                    Liaw and Heng, I accepted that there had been a safety\n                    briefing on that night and that the workers had been\n                    reminded that they should wear their safety harnesses and\n                    hook their safety harnesses to roof trusses, steel\n                    structures or railings at all times. To a limited extent, I\n                    was fortified in reaching this conclusion by reason of the\n                    fact that the plaintiff testified that he had been told to\n                    wear his safety harness (see[9]above). 37     Both parties did not\n                    dispute the following facts: (a)     The plaintiff\n                        had not been shown any diagrams or pictures of the\n                        Ceiling Space before he went up the\n                    ladder; (b)     The plaintiff was in fact wearing a\n                        safety harness before he went up the ladder. The hook of\n                        the safety harness which the plaintiff was wearing was\n                        smaller than the hook of the safety harness which was\n                        produced by TEE in court; (c)     The plaintiff had not been\n                        told by Liaw, Heng or Rex how to hook the safety harness\n                        onto objects by way of loop-hooking or sequential\n                        hooking; and (d)     The plaintiff had been paired up with\n                        Kannan who was a more experienced\n                    worker. In the circumstances, I accepted\n                    these undisputed facts which were also established by the\n                    evidence. I will now examine the events occurring in the\n                    Ceiling Space.",
        "Events in the Ceiling Space": "38     The first area of dispute\n                    was whether Rex had gone up the ladder together with the\n                    plaintiff and Kannan. While the plaintiff insisted that Rex\n                    had remained at the foot of the ladder in order to pass\n                    things to the workers, Rex testified that he had climbed up\n                    the ladder. 39     I believed the\n                    plaintiff’s evidence that Rex had remained at the foot\n                    of the ladder to pass things to the workers. There were no\n                    inconsistencies in the plaintiff’s evidence in this\n                    regard. On the other hand, I agreed with Mr Kalamohan\n                    that there were several inconsistencies which indicated that\n                    Rex’s story was untrue[note: 90]: (a)     Rex stated in\n                        his AEIC (at para 16) that he was the second person\n                        to go up the ladder and he was followed by one Tong Jian\n                        Wei (“Tong”). Tong was allegedly employed\n                        by Yong Teng as Rex’s supervisor and did most of\n                        the technical work to the VAV boxes. The other workers\n                        (including Rex) were there only to assist Tong and\n                        followed Tong’s instructions. However, Rex’s\n                        oral testimony was that he was followed up the ladder by\n                        Kannan and no mention was made of\n                    Tong. (b)     Rex stated that Liaw did not stay in the vicinity\n                        of A and went to another location outside the diagram at\n                        exhibit “SAJ-3” of Rex’s\n                            AEIC[note: 91].\n                        This was contradicted by Liaw’s testimony (see[30]above). (c)     Rex stated in his AEIC (at\n                        paras 25 and 26) that he had\n                        “explained” to the plaintiff how to get\n                        from A to B and that he crossed over to B after this\n                        explanation, followed by the plaintiff and Kannan.\n                        However, Rex stated during cross-examination that the\n                        plaintiff and Kannan crossed from A to B first and that\n                        he crossed over last[note: 92]. (d)     Rex stated in his\n                        AEIC (at para 28) that he heard a shout just after\n                        returning to A. However, he stated in court that he was\n                        moving away from point A when Kannan informed him that\n                        the plaintiff had fallen, and that he had not heard any\n                        sound of the plaintiff falling[note: 93]. (e)     Rex testified in\n                        court that he had hooked his safety harness when he was\n                        crossing from A to B and back from B to A. However, he\n                        had not stated this fact anywhere in his AEIC. This was\n                        a highly material fact. In\n                    particular, I was of the view that Rex’s failure to\n                    mention Tong when he was questioned as to the identities of\n                    the persons who went up the ladder into the Ceiling Space\n                    was very significant. Rex affirmed his AEIC only about five\n                    months before the trial (in September 2011). If Tong had\n                    been Rex’s supervisor (from the same company, Yong\n                    Teng) and had played such an important technical role in the\n                    Project, Rex’s failure to mention him when testifying\n                    in court was inexplicable. 40     As for the question of\n                    whether Heng’s evidence had any corroborative effectvis-à-visRex’s\n                    evidence, Heng’s AEIC stated (at paras 12 and 13)\n                    that “Nine workers would go up first with the Project\n                    Engineer, Tommy” and that one worker, Mohsin,\n                    remained below with Heng to set up the cordon. It could\n                    possibly be inferred from the “Daily Toolbox Meeting\n                    Form” (at p 8 of Heng’s AEIC) that Rex was\n                    one of the nine workers who, according to Heng, went up the\n                    ladder. I noted that Heng’s AEIC was less than\n                    satisfactory because it did not expressly state that the\n                    nine workersdid in factgo up\n                    the ladder. Nonetheless, even leaving aside this point, I\n                    was of the view that Heng’s evidence had no\n                    corroborative effect (and in fact undermined Rex’s\n                    credibility and therefore the veracity of his evidence)\n                    because it materially contradicted Rex’s oral\n                    testimony that a total ofsixpersons went up the ladder. Therefore, Rex’s evidence\n                    in this regard was not merely internally inconsistent (see\n                    [39(a)] above) but also externally\n                inconsistent. 41     I was of the opinion that\n                    it was not true that there was absolutely no reason for Rex\n                    to have remained at the foot of the ladder. As the works for\n                    the night had just begun, it was not unlikely that there\n                    were things which had to be brought from below to the\n                    Ceiling Space. In this regard, Rex’s explanation as to\n                    the location of the wooden planks was highly\n                        evasive[note: 94]. 42     The second area of dispute\n                    was whether Rex had informed the plaintiff of the following\n                    matters when they were both in the Ceiling Space before the\n                    accident occurred: (a)     How to cross\n                        safely from A to B and back from B to\n                    A; (b)     The danger posed by the ceiling panels;\n                        and (c)     The proper method of hooking the\n                        safety harness to the roof trusses, steel structures or\n                        railings (ie, loop-hooking\n                        and sequential hooking). 43     I accepted the\n                    plaintiff’s evidence that Rex had not informed him of\n                    any of these matters. First, as I stated earlier, I accepted\n                    the plaintiff’s evidence that Rex had not gone up the\n                    ladder into the Ceiling Space before the accident. Secondly,\n                    even if I was wrong on that point and Rex did in fact go\n                    into the Ceiling Space together with the plaintiff before\n                    the accident occurred, it did notnecessarilyfollow that Rex hadadditionallyinformed the plaintiff\n                    of those three matters. I was not convinced by Rex’s\n                    evidence in this regard because there were numerous\n                    inconsistencies between his AEIC and his testimony in court\n                    (see[39]above).\n                    Furthermore, Rex was evasive when he was cross-examined on\n                    whether he had shown the plaintiff where to hook his safety\n                        harness[note: 95]: Q:And when you purportedly went\n                            to point B from point A, did you have a safety\n                            harness on? Did you have a---no, did you\n                            have? A:Yes, your Honour, I wore\n                            one. Q:Yes. And on the way along from\n                            point A to point B, did you hook your safety harness\n                            anywhere? A:Yes, your Honour. Q:And did you\n                                show the plaintiff where to hook his safety\n                                harness? A:From point\n                                A to point B, we have---we have to---it’s\n                                quite a big hook so we can’t hook it the\n                                normal way, we have to hook it in a different\n                                way. Q:Okay, all right. Now is this\n                            hooking of the safety harness a very important\n                            safety facet for the plaintiff and workers like\n                            you? A:Yes, your Honour. Q:And you’ll agree this is\n                            important. Yes? A:Yes, your Honour, it’s\n                            important. Q:Why is that\n                                fact of you hooking on your safety harness and\n                                you teaching the plaintiff hooking on the safety\n                                harness not stated in your\n                            affidavit? A:No one\n                                asked me anything about that; it’s only\n                                now that they’re asking me about this\n                                hooking. Q:I’m\n                                putting it to you, witness, that this story\n                                about you going from point A to point B is a\n                                fiction; that is why that very important detail\n                                is missing. A:I disagree,\n                                your Honour. [emphasis added in bold italics] 44     I also found it odd that\n                    TEE produced in court a different safety hook that was much\n                    larger instead of the smaller type of safety hook that was\n                    actually supplied to the plaintiff at that time for his use.\n                    In his examination-in-chief, the plaintiff denied that the\n                    safety hook produced in court was of the same size as the\n                    one which was supplied to him on 18 May 2009, which was\n                    much smaller[note: 96]. He was not\n                    challenged on this point by Mr Tan. In my opinion,\n                    TEE’s production of a larger hook was an attempt to\n                    establish that the plaintiff could have used the larger hook\n                    to secure the safety harness to an anchor point by simple\n                    hooking. Before the trial, TEE probably had not thought of\n                    the possibility of adapting the other equally effective\n                    loop-hooking method to secure the safety harness equipped\n                    with small hooks to the big roof trusses that were present\n                    in the area where the plaintiff fell from. Hence, I was not\n                    surprised that the plaintiff was not taught the alternative\n                    method of loop-hooking with the smaller hook since TEE\n                    apparently also never contemplated that possibility itself,\n                    even up to the stage of the trial. If it had done so, then\n                    there would have been no need to impress the court with a\n                    different larger safety hook which the plaintiff flatly\n                    denied was ever issued to him.",
        "Negligence": "",
        "The parties’ arguments": "TEE’s case 68     Mr Tan relied on s 60(1)\n                    of the Workplace Safety and Health Act (Cap 354A,\n                    2007 Rev Ed) (“the Act”) to support his\n                    submission that the plaintiff did not have a private right\n                    of action against TEE for breach of ss 11 and 12 of the\n                    Act. The relevant sections of the Act are as follows: Meanings of\n                            “employee” and\n                            “employer” 6.—(1)  Subject to\n                        subsections (2), (3), (4) and (5), in this\n                        Act — ... “employer” means a person who, in the\n                        course of the person’s trade, business, profession\n                        or undertaking, employs any person to do any work under\n                        a contract of service. ... (4)    Where — (a)    an employer places an employee (referred to in this\n                            subsection as the loaned employee) at the disposal\n                            of another person to do work for that other person;\n                            and (b)    there is no contractual relationship between the\n                            employer and that other person regarding the work to\n                            be performed by the loaned employee, then, for the purposes of this\n                        Act — (i)the loaned employee shall\n                                be regarded as if he were an employee of that\n                                other person (instead of his employer) while the\n                                loaned employee is at work for that other\n                                person; (ii)that other person shall\n                                be regarded as if he were the employer of the\n                                loaned employee while the loaned employee is at\n                                work for that other person; and (iii)the loaned employee\n                                shall be regarded as if he were at work when\n                                doing work for that other person. ... Duty of\n                            occupier of workplace 11.    It shall be the duty of every occupier of any\n                            workplace to take, so far as is reasonably\n                            practicable, such measures to ensure\n                            that — (a)    the workplace; (b)    all means of access to or egress from the\n                            workplace; and (c)    any machinery, equipment, plant, article or\n                            substance kept on the workplace, are safe and without risks to health to every person\n                        within those premises, whether or not the person is at\n                        work or is an employee of the occupier. Duties of\n                            employers 12.—(1)  It shall be the duty of every\n                        employer to take, so far as is reasonably practicable,\n                        such measures as are necessary to ensure the safety and\n                        health of his employees at work. (2)    It shall be the duty of every employer to take, so\n                            far as is reasonably practicable, such measures as\n                            are necessary to ensure the safety and health of\n                            persons (not being his employees) who may be\n                            affected by any undertaking carried on by him in the\n                            workplace. (3)    For\n                            the purposes of subsection (1), the measures\n                            necessary to ensure the safety and health of persons\n                            at work\n                                include — (a)    providing\n                            and maintaining for those persons a work environment\n                            which is safe, without risk to health, and adequate\n                            as regards facilities and arrangements for their\n                            welfare at\n                                work; (b)    ensuring\n                            that adequate safety measures are taken in respect\n                            of any machinery, equipment, plant, article or\n                            process used by those\n                                persons; (c)    ensuring\n                            that those persons are not exposed to hazards\n                            arising out of the arrangement, disposal,\n                            manipulation, organisation, processing, storage,\n                            transport, working or use of\n                            things — (i)in their workplace;\n                                or (ii)near their workplace and\n                                under the control of the employer; (d)developing and implementing procedures for dealing\n                            with emergencies that may arise while those persons\n                            are at work; and (e)ensuring that those persons at work have adequate\n                            instruction, information, training and supervision\n                            as is necessary for them to perform their\n                            work. (4)Every employer shall, where\n                            required by the regulations, give to persons (not\n                            being his employees) the prescribed information\n                            about such aspects of the way in which he conducts\n                            his undertaking as might affect their safety or\n                            health while those persons are at his\n                            workplace. ... Civil\n                            liability 60.—(1) Nothing in this\n                        Act shall be construed — (a)as conferring a right of\n                                action in any civil proceedings in respect of\n                                any contravention, whether by act or omission,\n                                of any provision of this Act; or (b)as conferring a defence to\n                                an action in any civil proceedings or as\n                                otherwise affecting a right of action in any\n                                civil proceedings. (2)    Subsection (1) shall not\n                            affect the extent (if any) to which a breach of duty\n                            imposed under any written law is\n                        actionable. Mr Tan argued thatMa\n                        HongFei, which held that s 60(1) did not have\n                    the effect of removing a plaintiff’s right of private\n                    action in relation to a breach of the Act, was incorrect and\n                    should not be followed by this court. In support of this\n                    argument, Mr Tan relied on Gary Chan Kok Yew and Lee\n                    Pey Woan,The Law of Torts in\n                        Singapore(Academy Publishing, 2011)\n                        (“Chan &\n                    Lee”) at pp 332–334, and Ravi\n                    Chandran,The Workplace Safety and Health\n                        Act: An Overview(2007) 19 SAcLJ 15\n                        (“Chandran”)\n                    at paras 10 and 11. Mr Tan also submitted that the\n                    recent decision inTan JuayPah v Kimly Construction\n                        Pte Ltd and others[2012] SGCA 17\n                        (“Tan JuayPah”),\n                    where the Court of Appeal considered the effect of s 60\n                    of the Act, supported his argument that a breach of the Act\n                    did not confer a right of action in civil\n                    proceedings. 69     In any event, Mr Tan\n                    submitted that TEE had not breached its duties under ss 11\n                    and 12 of the Act. In relation to the duty imposed under\n                    s 11 of the Act, Mr Tan accepted that TEE fell\n                    within the definition of “occupier” in\n                    s 4. However, he argued that TEE had taken all\n                    reasonably practicable measures to ensure that the\n                    plaintiff’s workplace was safe. It had: (a)     Held a toolbox\n                        meeting with the workers every day to remind them of the\n                        safety issues; (b)     Reminded the workers to hook up their\n                        harnesses to the roof trusses, steel structures or\n                        railings at the working area; (c)     Ensured that all\n                        workers put on their safety harnesses before entering\n                        the Ceiling Space; (d)     Provided additional lighting at the\n                        working areas where the VAV boxes were to be replaced;\n                        and (e)     Requested the workers’\n                        supervisors to keep a close watch to ensure that they\n                        took adequate care when carrying out their\n                    works. 70     In relation to the duty\n                    imposed under s 12 of the Act on “every\n                    employer”, Mr Tan submitted that TEE was not the\n                    plaintiff’s “employer” as defined in\n                    s 6 of the Act. Mr Tan submitted that TEE did not\n                    have any contractual relationship with the plaintiff, and\n                    the plaintiff was not placed at its disposal to do work for\n                    it. Instead, the plaintiff was under the control and\n                    supervision of Madhavan and/or Yong Teng. The plaintiff’s case 71     Mr Kalamohan submitted\n                    thatMa HongFeiwas good law\n                    and should be followed by the court. He argued that the\n                    court was merely stating that a plaintiff had to havelocus standibefore he\n                    could commence a civil action for breach of statutory duty\n                    under the Act, and that the test oflocus\n                        standiwas whether a plaintiff could show\n                    that his injuries werecausedby the breach of the Act. The criticism inChan & Leewas misplaced because\n                    it was premised on a misunderstanding of that\n                    decision. 72     In relation to s 11 of the\n                    Act, Mr Kalamohan submitted that TEE had failed to take\n                    all reasonably practicable measures to ensure that the\n                    plaintiff’s workplace was safe: (a)     Regarding the\n                        alleged toolbox meeting, it was not sufficient for TEE\n                        simply to remind the workers of the safety issues. It\n                        should have explained the safety issues in detail,\n                        including how to manoeuvre around difficult, problematic\n                        and risky areas such as between A and B, especially\n                        because it knew that the plaintiff was a new\n                        worker. (b)     Regarding the alleged reminder to\n                        hook the safety harnesses, it was not sufficient to\n                        remind the plaintiff to do so since he was a new worker.\n                        TEE should have showed pictures or diagrams of the\n                        workplace to the plaintiff before allowing him into the\n                        Ceiling Space. Also, TEE should have demonstrated to the\n                        plaintiff how to hook the harness (loop-hooking and\n                        sequential hooking). It was fundamentally wrong to\n                        assume that the plaintiff would have known how to\n                        loop-hook and sequentially hook his safety\n                        harness. (c)     Regarding the alleged checks to\n                        ensure that all workers were wearing safety harnesses\n                        before going up the ladder, this fell short of the\n                        statutory duty to take all reasonably practicable\n                        measures. It would be more reasonable for Heng to have\n                        entered the Ceiling Space together with the workers.\n                        Heng could then have instructed the plaintiff as to how\n                        and where to hook the safety harness. (d)     Regarding the\n                        additional lighting at the area near the VAV boxes, it\n                        was clear from the photos that the workplace was not\n                        well lit, especially between A and B. TEE should have\n                        provided additional lighting at all areas of the\n                        workplace. At the very least, it should have provided\n                        the workers with helmets with attached headlights. This\n                        would have aided the plaintiff to see the ceiling panels\n                        clearly. (e)     Regarding the alleged request to the\n                        workers’ supervisors to keep a close watch on\n                        them, TEE should not delegate the duty to take all\n                        reasonable steps to ensure the safety of the workers and\n                        the workplace to other workers (ie, the supervisors). Even if this duty\n                        was delegated, TEE was still vicariously liable for the\n                        conduct of those to whom its responsibility was\n                        delegated. 73     In relation to s 12 of the\n                    Act, Mr Kalamohan submitted that TEE was the\n                    plaintiff’s “employer” under the Act and\n                    therefore owed him a duty under s 12 to take all reasonably\n                    practicable measures to ensure his safety at the workplace.\n                    Mr Kalamohan relied on the following facts to support\n                    this argument: (a)     The plaintiff\n                        was at the workplace to do work for the business of TEE.\n                        The plaintiff was a loaned employee, and, by virtue of\n                        the contractual relationship between TEE, Sing Wah\n                        (sub-contractor), Yong Teng (sub-sub-contractor) and\n                        Madhavan (sub-sub-sub-contractor), TEE was the\n                        plaintiff’s employer at the time of the\n                        accident. (b)     On the day of the accident, the\n                        plaintiff was under the control and supervision of TEE\n                        and not Madhavan. The plaintiff was on the worksite at\n                        TEE’s disposal to do work for them. It was TEE who\n                        allegedly held a toolbox meeting, who asked the workers\n                        to sign an undertaking (see p 29 of Liaw’s AEIC),\n                        and who allegedly took it upon itself to ensure that all\n                        workers were wearing safety harnesses before entering\n                        the Ceiling Space. 74     Mr Kalamohan pointed out\n                    that TEE had not pleaded in its Defence that Yong Teng was\n                    the plaintiff’s employer and that Yong Teng should be\n                    liable for his injuries. In any event, Mr Kalamohan\n                    submitted that if the court found that the plaintiff was\n                    under the control and supervision of Yong Teng and not TEE,\n                    TEE should still bevicariouslyliable for Rex’s failure\n                    to ensure the plaintiff’s safety.",
        "The court’s findings": "75     InTan\n                        JuayPah, the\n                    Court of Appeal stated: 63While s\n                                60(1)(a) of the\n                                WSHA provides that the WSHA does not confer any\n                                right of action in civil proceedings,\n                            s 60(1)(b) provides\n                            (inter alia) that the WSHA also does not affect any\n                            (independent or pre-existing) right of action in\n                            civil proceedings.In other\n                                words, s 60 of the WSHA neither confers nor\n                                takes away any right to bring a private claim in\n                                respect of a breach of statutory duty under the\n                                WSH Regime. More importantly for present\n                                purposes,s 60\n                                does not answer the question of whether there is\n                                an independent or a pre-existing private right\n                                of action for such a breach. ...\n                            [U]nder theSpandecktest, it is clear that the mere fact that a\n                            particular statutory duty exists does not suffice to\n                            give rise to a common law duty of care founded on\n                            that statutory duty. ... [emphasis added in italics and bold italics] 76Tan\n                        JuayPahstands\n                    for the proposition that s 60 has no effect on the\n                    existence (or otherwise) of an independent or pre-existing\n                    private right of action for the breach of a duty imposed by\n                    the Act. Where there is an independent or pre-existing\n                    private right of action, the right is not taken away by\n                    virtue of s 60. 77     InAnimal Concerns Research & Education Society v Tan\n                        Boon Kwee[2011] 2 SLR 146\n                        (“Animal\n                    Concerns”), the Court of Appeal stated as\n                    follows: 21    We should highlight at the\n                            outset that even if the Appellant's construction of\n                            s 10(5) of the Act is correct, s 10(5) is,\n                            strictly speaking, not determinative of the\n                            Respondent's civil liability to the Appellant in an\n                            action for negligence, for it is trite law thatthere is no common law tort\n                                of \"careless performance of a statutory\n                                duty\"(see the House of Lords\n                            decision ofX (Minors) v\n                                Bedfordshire County Council[1995]\n                            2 AC 633 (\"X v\n                                Bedfordshire CC\") at\n                        732-735). 22    In other words,what the courts in this area are\n                                looking for is still a duty of care at common\n                                law(see, for example, the English\n                            Court of Appeal decision ofConnor v Surrey County Council[2010] 3 All ER 905 at [102]),ie, the statutory\n                            duty which a plaintiff alleges sounds in negligence\n                            must have been previously held to give rise to a\n                            common law duty of care, or must be so declared by\n                            the court adjudicating the matter, applying the test\n                            inSpandeck([16]supra). A\n                            statutory duty does notipso\n                                factoimpose a concomitant duty of\n                            care at common law.A statutory\n                                duty may, of course, form the backdrop to and\n                                inform the existence (or lack thereof) of a\n                                common law duty of care(see, for\n                            example,X v Bedfordshire\n                                CCat 739),but that does not mean the statutory\n                                dutyper seis a\n                                duty of care, even if it is phrased (as here) in\n                                terms of requiring the taking of \"reasonable\n                                steps\" and \"due\n                        diligence\". 23    Even if the Appellant's\n                            construction of s 10(5)(b) of the Act is correct, therefore,\n                            themere existenceof\n                            a statutory duty on the Respondent to supervise the\n                            backfilling is not sufficient to establish an action\n                            in negligence at common law by the\n                        Appellant. 24    Nevertheless, if there is\n                            indeed such a statutory duty on the Respondent under\n                                s 10(5)(b) of\n                            the Act (as construed by the Appellant), and the\n                            Respondent had breached such a duty,another possible cause of action that\n                                the Appellant might have pursued against the\n                                Respondent would be one based on the tort of\n                                breach of statutory duty. However,\n                            this alternative legal route does not appear to have\n                            been adopted by the Appellant. Although s 10(5)\n                            of the Act clearly imposes some sort of statutory\n                            duty on site supervisors, the Act only states that\n                            breach of that duty will give rise tocriminalliability under\n                            s 10(8) of the Act. Asthe\n                                Act is completely silent on whether breach of\n                                s 10(5) also gives rise tocivilliability, and, if so,\n                                whether such liability is incurred to a private\n                                individual who has suffered loss as a result of\n                                the breach, the success of a claim\n                            for breach of statutory duty would, in the main,\n                            have depended on the construction of the Act in\n                            general and s 10(5)(b) in particular, in order to\n                            ascertain whether the Legislature impliedly intended\n                            to provide a right of civil action to enforce the\n                            statutory duty (see the leading House of Lords\n                            decision ofCutler v Wandsworth\n                                Stadium Ltd[1949] AC 398\n                            at 407 and 412). [emphasis added in bold italics] In other words, a distinction has to be drawn\n                    between, on the one hand, determining whether a duty of care\n                    is owed at common law, and, on the other hand, determining\n                    whether the breach of a statutory dutyper segives rise to a right of civil\n                    action. In the present case, Mr Kalamohan’s\n                    arguments on the purported claim for “breach of\n                    statutory duty” (see[72]–[73]above) were directed at the former\n                    rather than the latter. Furthermore, Mr Kalamohan did\n                    not advance any arguments on Parliamentary intention which,\n                    as the Court of Appeal noted inAnimal\n                        Concerns(at [24]), is the primary determinant of whether\n                    the breach of a statutory dutyper\n                        segives rise to a right of civil action. As\n                    I had already found that TEE owed a duty of care at common\n                    law (in the torts of negligence and occupier’s\n                    liability) to the plaintiff, and that this duty of care was\n                    breached, it was not necessary for me to go on to consider\n                    whether ss 11 and 12 of the Act were breached by reason\n                    of the facts raised by Mr Kalamohan. 78     I should add that if Mr\n                    Kalamohan had argued that a breach of ss 11 and/or 12\n                    of the Actper segave rise to\n                    a right of civil action, s 60(1)(a) indicates that Parliament did not intend\n                    such a result (as the Court of Appeal inTan JuayPahnoted at [63]).\n                    Mr Kalamohan’s reliance onMa\n                        HongFeiwas misplaced because it was a case\n                    where the principal question was whether a duty of care was\n                    owed at common law in the tort of occupier’s liability\n                    (see [43]–[45] thereof). The court’s comments inMa HongFeion s 60 of\n                    the Act must therefore be read in that\n                context.",
        "Occupier’s liability": "",
        "Breach of statutory duty": "",
        "Contributory negligence": "",
        "Contributory negligence of the\n                plaintiff": "79     Mr Tan citedParnoin support of TEE’s\n                    allegation of contributory negligence by the plaintiff. InParno, the Court of Appeal\n                    stated: 59    The classic statement of the law on contributory\n                            negligence was expounded by Lord Denning MR in\n                            the well-known case ofFroom v\n                                Butcher[1976] QB 286 at\n                            291: Negligence depends on a breach of duty, whereas\n                            contributory negligence does not. Negligence is a\n                            man’s carelessness in breach of duty to\n                            others. Contributory negligence is a man’s\n                            carelessness in looking after his own safety. He is\n                            guilty of contributory negligence if he ought\n                            reasonably to have foreseen that, if he did not act\n                            as a reasonable prudent man, he might hurt\n                            himself. 60    Section 3(1) of the Contributory Negligence and\n                            Personal Injuries Act (Cap 54, 1994 Ed)\n                            provides as follows: Where any person suffers damage as the result\n                            partly of his own fault and partly of the fault of\n                            any other person or persons, a claim in respect of\n                            that damage shall not be defeated by reason of the\n                            fault of the person suffering the damage, but the\n                            damages recoverable in respect thereof shall be\n                            reduced to such extent as the court thinks just and\n                            equitable having regard to the claimant’s\n                            share in the responsibility for the damage.\n                            [emphasis added] 61    InStapley v\n                                Gypsum Mines Ltd[1953] AC 663, Lord\n                            Reid said at 682 that a court must deal broadly with\n                            the problem of apportionment and in considering what\n                            is just and equitable, must have regard to the\n                            blameworthiness of each party. The claimant’s\n                            share in the responsibility for the damage cannot\n                            however be assessed without considering the relative\n                            importance of his acts in causing the damage apart\n                            from his blameworthiness. InDavies v Swan Motor Co (Swansea) Ltd[1949] 2 KB 291 at 326 Denning LJ said that no true\n                            apportionment can be reached unless both the factors\n                            of blameworthiness or fault, and causation are borne\n                            in mind. 80     Mr Tan submitted that the\n                    plaintiff should be held to be contributorily negligent for\n                    the following reasons: (a)     The plaintiff\n                        failed to hook up his safety harness when he was\n                        crossing from B to A, even though he knew or should have\n                        known that he was required to hook the safety harness at\n                        all times. (b)     The plaintiff failed to retrace his\n                        route on the way back from B to A. (c)     The plaintiff\n                        failed to keep a proper look-out for the ceiling panels.\n                        He could have seen the ceiling panels because the\n                        lighting conditions were sufficient for him to see his\n                        feet. 81     Mr Kalamohan submitted\n                    that the plaintiff was not contributorily negligent for the\n                    following reasons: (a)     With respect\n                        to (a), TEE did not have any evidence to show that\n                        the plaintiff was contributorily\n                    negligent. (b)     With respect to (b), TEE had not\n                        proved that the plaintiff was shown the safe and proper\n                        route to cross from A to B, or from B to\n                    A. (c)     With respect to (c), while crossing from A\n                        to B the plaintiff had followed Kannan and had somehow\n                        managed to cross safely. However, on the return from B\n                        to A, the plaintiff was the first person to cross and he\n                        fell through the ceiling panels on his first step. Just\n                        because he could see his feet did not mean that he could\n                        see the ceiling panels. Furthermore, the plaintiff had\n                        no knowledge that the ceiling panels would give way if\n                        he stepped on them. 82     After considering the\n                    evidence as a whole, I found that the plaintiff was\n                    contributorily negligent to the extent of one third. In\n                    reaching this conclusion, I took into account the following\n                    factors: (a)     It was\n                        undeniable that the plaintiff could have reasonably\n                        taken more care for his own safety when he was crossing\n                        from B to A. It could be said, for example, that the\n                        plaintiff should have spoken up and asked Kannan or the\n                        other two workers how he should hook his safety harness\n                        to a safe anchor point in that area. The plaintiff\n                        should not have taken the risk and proceeded with the\n                        crossing from A to B and back again, when he did not\n                        know how to secure his safety harness to the roof\n                        trusses and steel structures due to the limited\n                        knowledge he had. However, I was of the opinion that\n                        this should not be counted as a very significant factor\n                        against the plaintiff given that he was a new worker and\n                        that neither Kannan nor the other two workers had hooked\n                        their safety harnesses to any anchor points in that\n                        area. Further, no steps were taken by Liaw or Heng to\n                        ensure that all workers knew how to hook their safety\n                        harnesses using loop-hooking or sequential hooking.\n                        These were methods which were essential to safe work in\n                        the Ceiling Space given the numerous obstructions and\n                        the absence of anchor points for simple hooking in that\n                        area. Heng, as the safety supervisor, was not even there\n                        at the work area in the Ceiling Space to answer the\n                        workers’ questions on safety, if any, and to\n                        advise and supervise the workers\n                    accordingly. (b)     The lighting conditions in the area\n                        were poor, making it difficult for the plaintiff to\n                        differentiate between the catwalk and the ceiling\n                        panels. (c)     The plaintiff had been paired with\n                        Kannan who was the more experienced worker. However, TEE\n                        did not call Kannan as a witness to substantiate its\n                        assertion that Kannan warned the plaintiff of the\n                        various dangers and taught him how to hook his safety\n                        harness and how to navigate from A to B and back from B\n                        to A.",
        "Contributory negligence of the first\n                defendant": "83     Mr Tan also submitted that\n                    the court had the power to apportion liability between\n                    Madhavan and TEE even though the former did not defend the\n                    action and judgment in default of appearance had been\n                    entered against him. Paras [30] and [31] ofNg Kim Cheng v\n                        Naigai Nitto Singapore Pte Ltd and another[1991] 1 SLR(R) 270 (“Ng\n                        Kim Cheng”) were cited as authority\n                    for this proposition. Mr Tan went on to argue that\n                    Madhavan had breached his duty to take reasonable care for\n                    the plaintiff’s safety and should therefore be held\n                    100% liable to the latter, thereby implying that TEE should\n                    not be held liable at all to the plaintiff. 84     I was of the view that\n                    this argument did not assist TEE. InTV\n                        Media Pte Ltd v De Cruz Andrea Heidi and another\n                        appeal[2004] 3 SLR(R) 543, the\n                    Court of Appeal stated as follows: 155    The law as to the apportionment of damages between\n                            joint tortfeasors is laid out inDingle v Associated Newspapers Ltd[1961] 2 QB 162, which was adopted by us inChuangUming (Pte) Ltd v Setron Ltd[1999] 3 SLR(R) 771  . The\n                            English Court of Appeal held at\n                        188-189: Where injury has been done to the plaintiff and\n                            the injury is indivisible,any\n                                tortfeasor whose act has been a proximate cause\n                                of the injury must compensatefor the whole of\n                                it. As between\n                                the plaintiff and the defendant it is immaterial\n                                that there are others whose acts also have been\n                                a cause of the injury and it does not matter\n                                whether those others have or have not a good\n                                defence. These factors would be relevant in a\n                                claim between tortfeasors for contribution, but\n                                the plaintiff is not concerned with that; he can\n                                obtain judgment for total compensation from\n                                anyone whose act has been a cause of his\n                                injury. [emphasis added] 156    We also find it useful to refer to the case ofWong Jin Fah v L & M\n                                Prestressing Pte Ltd[2001]\n                            3 SLR(R) 1  , where the judge\n                            held at [92]: ... [The] defendants were each a proximate cause\n                            of the injury inflicted on the plaintiff. Although\n                            they were not acting in concert when the accident\n                            happened, their contemporaneous acts of omission\n                            caused the indivisible damage to the plaintiff. The\n                            defendants left it to the others to take the\n                            necessary precautions and, cumulatively, they did\n                            nothing at all. Each turned a blind eye to safe\n                            working practices and relied on the others. Their\n                            faults and breaches indisputably overlapped such\n                            that each of them must be held liable to the\n                            plaintiff for the whole damage. [emphasis added in bold italics] Therefore, TEE’s liabilityto the plaintifffor his injuries\n                    caused by the accident was unaffected by the fact that\n                    Madhavan was made 100% liable (by virtue of the\n                    interlocutory judgment in default of appearance)to the plaintifffor those injuries.\n                    The injuries suffered by the plaintiff were indivisible and\n                    stemmed from a single event. 85     As for Mr Tan’s\n                    argument that the court had the power to apportion liability\n                    between Madhavan and TEE, this would only be relevant if TEE\n                    had brought contribution proceedings against Madhavan under\n                    ss 15 and 16 of the Civil Law Act (Cap 43,\n                    1999 Rev Ed). I would add that even if TEE had in fact\n                    brought contribution proceedings against Madhavan by way of\n                    a third party notice in this suit, this would not have\n                    affected the extent of TEE’s liabilityto the plaintiff(see[84]above). 86     I did not think thatNg Kim Chengwas of\n                    assistance to TEE for three reasons. First, the\n                    apportionment of liability between the first and second\n                    defendants in that case was based on counsel’s\n                    submission without any citation by counsel of any\n                    authorities to the court on joint and several liability (see\n                        [31] ofNg Kim Cheng). The second\n                    defendant had instructed its counsel not to defend the\n                    claim; thus, there were no arguments in rebuttal of the\n                    first defendant’s submission on apportionment. Second,\n                    it was not clear from the judgment whether contribution\n                    proceedings had been brought by the first defendant against\n                    the second defendant. Third, it was not clear from the\n                    judgment (at [30]–[31]) whether the apportionment of liability\n                    was between only the first and second defendants (with their\n                    individual liability to the plaintiff being unaffected), or\n                    whether the court had in fact held that the plaintiff could\n                    only recover 30% of his loss from the first defendant and\n                    had to recover the remaining 70% of his loss from the second\n                    defendant. The fact that the court referred (at [31]) to the apportionment\n                    of liability “between the two defendants”\n                    suggested that the court was not dealing with the\n                    plaintiff’s entitlement to recovery. 87     In any event, the issue of\n                    Madhavan’s liabilityvis-à-visTEE was not pleaded in the\n                    Defence. Therefore, even if I was wrong to hold that\n                    TEE’s liability to the plaintiff was unaffected by the\n                    apportionment of liability between Madhavan and TEE (if\n                    any), TEE could not rely on the fact that Madhavan was\n                    adjudged 100% liable (by virtue of the interlocutory\n                    judgment in default of appearance) to the plaintiff for\n                    those injuries as a defence to the plaintiff’s claim.\n                    In assessing the plaintiff’s contributory negligence,\n                    I took into account all the plaintiff’s acts and\n                    omissions that had contributed to the accident as a whole,\n                    whether they were in relation to the breach of the duty of\n                    care by TEE or Madhavan. Once the total damage less the\n                    contributory negligence of the plaintiff as a whole has been\n                    assessed, it is for the joint tortfeasors to sort out\n                    between themselves their respective portions (if they so\n                    wish), which would not be the concern of the plaintiff. The\n                    plaintiff could still proceed against Madhavan for 100% of\n                    his loss by virtue of the interlocutory judgment in default\n                    of appearance. If Madhavan chose to contest the default\n                    judgment on the merits, Madhavan would be able to argue,inter alia, that he should\n                    only be liable for 66.67% of the plaintiff’s loss on\n                    the basis of the latter’s contributory negligence\n                    which I assessed at one third after taking into account all\n                    the plaintiff’s acts and omissions that had\n                    contributed to the accident as a whole.",
        "Conclusion": "88     For the above reasons, I\n                    found that TEE was liable to the plaintiff in negligence and\n                    occupier’s liability. However, I also found that the\n                    plaintiff was contributorily negligent to the extent of one\n                    third of the losses sustained by him as a consequence of the\n                    accident. I ordered the damages to be assessed by the\n                    Registrar with costs of the assessment reserved to the\n                    Registrar. After hearing the parties on costs, I ordered TEE\n                    to bear 90% of the costs of the plaintiff up to the\n                    completion of this trial.  [note: 1]Plaintiff’s AEIC, paras\n                                4–9 (incorporating corrections to the\n                                timings which were made by the plaintiff on the\n                                stand) [note: 2]NE, p 25 [note: 3]NE, p 31 [note: 4]NE, pp\n                        31–32 [note: 5]NE, pp\n                        25–26 [note: 6]NE, pp\n                        25–29 [note: 7]Ibid [note: 8]NE, pp\n                        27–28 [note: 9]NE, pp\n                        40–41 [note: 10]NE, p 34 [note: 11]Ibid [note: 12]NE, p 35 [note: 13]Ibid [note: 14]NE, p 68 [note: 15]NE, p\n                    21 [note: 16]NE, p 18 [note: 17]NE, p\n                    19 [note: 18]NE, p 23 [note: 19]NE, pp\n                        22–23 [note: 20]NE, p\n                            23 [note: 21]NE, pp\n                        74–75 [note: 22]NE, pp\n                                74–77 [note: 23]NE, p\n                            43 [note: 24]NE, p\n                                44–45 [note: 25]NE, p 36 [note: 26]NE, pp\n                        71–73 [note: 27]Rex’s AEIC,\n                                p 6 [note: 28]NE, p\n                            46 [note: 29]NE, pp\n                                49–50 [note: 30]NE, p\n                    52 [note: 31]NE, p 51 [note: 32]NE, p\n                            65 [note: 33]NE, pp 49 and\n                                53 [note: 34]NE, pp\n                        46–47 [note: 35]NE, p\n                            46 [note: 36]NE, p\n                            36 [note: 37]NE, pp\n                        36–39 [note: 38]Plaintiff’s Bundle of Documents,\n                                p 8 [note: 39]NE, pp\n                        67–68 [note: 40]Ibid [note: 41]NE, p\n                    68 [note: 42]Rex’s AEIC, para\n                        8 [note: 43]Rex’s AEIC, para\n                        14 [note: 44]NE, p 80 [note: 45]NE, p 81 [note: 46]NE, p\n                            83 [note: 47]NE, p\n                    82 [note: 48]NE, p 85 [note: 49]NE, p 86 [note: 50]NE, p 86 [note: 51]NE, p\n                            97 [note: 52]NE, p 98 [note: 53]NE, p 91 [note: 54]NE, p 90 [note: 55]Ibid [note: 56]Ibid [note: 57]NE, p 99 [note: 58]NE, p 101; see also pp 91 and\n                                100 [note: 59]NE, pp\n                        101–102 [note: 60]NE, p 114 [note: 61]NE, p\n                            115 [note: 62]NE, p\n                            105 [note: 63]NE, p\n                    114 [note: 64]NE, p 109 [note: 65]NE, pp\n                        106–109 [note: 66]NE, p 109 [note: 67]NE, pp\n                        106–109 [note: 68]NE, p 111 [note: 69]NE, pp\n                        111–112 [note: 70]Heng’s AEIC, para\n                        7 [note: 71]Heng’s AEIC, para\n                        9 [note: 72]Heng’s AEIC,\n                                para 10 [note: 73]NE, pp\n                        118–119 [note: 74]Ibid [note: 75]NE, p\n                            118 [note: 76]NE, p\n                            118 [note: 77]Heng’s AEIC, para\n                            14 [note: 78]Heng’s AEIC,\n                                para 15 [note: 79]NE, p 120 [note: 80]Liaw’s AEIC, para\n                        4 [note: 81]NE, pp\n                        121–122 [note: 82]NE, p 121 [note: 83]NE, pp\n                                122–124 [note: 84]NE, p 123 [note: 85]NE, p 128 [note: 86]Ibid [note: 87]NE, p 126 [note: 88]Liaw’s AEIC, paras 25–27;\n                                NE, pp 125–126 [note: 89]Liaw’s AEIC,\n                                para 30 [note: 90]Plaintiff’s Closing Submissions,\n                                para 47 [note: 91]NE, p 94 [note: 92]NE, pp 86 and\n                            97 [note: 93]NE, p\n                                    90 [note: 94]NE, p\n                    82 [note: 95]NE, p\n                    91 [note: 96]NE, pp\n                        18–19 [note: 97]Plaintiff’s Closing Submissions,\n                                para 14"
    }
}