{
    "case_title": "AYB\n      v\n      AYC",
    "ncitation": "[2012] SGHC 38",
    "coram": "Belinda Ang Saw Ean J",
    "sections": {
        "Introduction": "1       The parties divorced after 20 years of marriage,\n                    and the matrimonial ancillary matters came before me for determination. These\n                    include the division of the matrimonial assets, the issue of custody, care and\n                    control for the children of the marriage, and the issue of maintenance.\n                    Following the hearing of the ancillary matters over several intermittent days\n                    between 11 July 2010 and 27 June 2011, I made the following orders on\n                    27 June 2011: (a)     The matrimonial home known as\n                        [Property 1] shall be sold in the open market and the net sale proceeds\n                            (ie, after deducting payment of\n                        outstanding mortgage, CPF withdrawal plus accrued interest and payment of\n                        the costs and expenses of sale including legal costs) be divided between the\n                        plaintiff, AYB, (“the Wife”) and the defendant, AYC,\n                        (“the Husband”)( “the parties”) as\n                        follows:- (a)       60% to the Husband;\n                            and (b)       40%\n                            to the Wife. (b)     [Property 1] shall be sold within 6 months from the date\n                        hereof, with Husband and Wife to have joint conduct of the sale of [Property\n                        1] at a price of $1,500,000 or higher. (c)     As for the property known as [Property 2] (in which the\n                        parties jointly own together with the Husband’s brother, [K], and the\n                        Wife’s sister, [P]), if [K] and [P] wish to sell [Property 2], the\n                        parties shall likewise agree in principle to a sale. (d)     In the event [Property 2] is sold, upon\n                        receipt of 24.35% share of the net sale proceeds (“the parties’\n                        sale proceeds of [Property 2]”):- (a)       The Wife is to receive\n                            $34,000 being her CPF contribution toward the purchase;\n                        and (b)       Of the\n                            remaining balance, 25% to the Wife and 75% to the\n                    Husband. (e)     If\n                        either party refuses to execute the transfer documents, the Registrar of the\n                        Supreme Court is empowered to execute the said documents on his or her\n                        behalf as the case may be. (f)     The Husband is to transfer to the Wife an amount\n                        equivalent to 25% of the value of the Husband’s RSAF Savers Account\n                        (“Savers Account”) such that the Wife’s share of the\n                        Savers Account is $195,000 (based on a value of\n                    $781,000). (g)     The Wife\n                        is to have a 25% share of the moneys refunded into the Husband’s CPF\n                        Ordinary Account following the sale of [Property 1]; and that the CPF Board\n                        shall transfer a sum equivalent to 25% of the said moneys into the\n                        Wife’s CPF Ordinary Account within 14 days after the date of\n                        completion of the sale of the [Property 1]. (h)     Any other assets in the sole name of the parties\n                        are to be retained by him or her as the case may be. (i)     The Husband is to pay monthly\n                        maintenance in the total sum of $3,800, of which $1,800 is for the Wife and\n                        $2,000 for their two children. 2       By consent, the parties are to have joint\n                    custody of their two children with care and control to the Wife. Since the\n                    Husband was going to be stationed in the United States for four months from\n                    1 July 2011, he was granted liberal access to his children by email or\n                    telephone contact for that period. Upon his return to Singapore, the following\n                    permanent access arrangement is to apply: S/NAccessDetails1Weekend accessAlternate weekend overnight access from\n                                            Saturday 6pm to Sunday 3pm, alternate Sunday from 3pm to\n                                            9pm2Weekday accessWednesday or Thursday evening from 5pm to\n                                            10pm for younger son [J] only3New Year’s EveAlternate year full-day access (8am to\n                                            10pm) starting from 20124Chinese New Year’s\n                                    Eve4pm to 6pm5Chinese New Year2nd day of Chinese New Year: full-day\n                                            access (8am to 10pm)6March school\n                                    holidays2 consecutive days access with overnight\n                                            on first two days of the school\n                                    holidays7June school holidays2 consecutive full-week access including\n                                            overseas holidays on 3rd and 4th weeks of the June\n                                            school holidays8September school\n                                    holidays2 consecutive days access with overnight\n                                            on first two days of the school\n                                    holidays9December school\n                                    holidays2 consecutive full-week access including\n                                            overseas holidays on 3rd and 4th weeks of the December\n                                            school holidays10Children’s birthdays (24th May and\n                                            5th October)Evening access on the eve of the birthdays\n                                            from 5pm to 10pm11Husband’s birthday\n                                            (4 April)Evening access on the actual day from 5pm\n                                            to 10pm12Wake of relative or close friend of the\n                                            HusbandEvening access, but limited to 2\n                                            hours   3       I made no order in respect of the Wife’s\n                    joint accounts with her mother. However, I disallowed the Wife’s claim for\n                    car rental against the Husband. 4       As for costs for the ancillaries, each side was\n                    ordered to bear his or her respective costs. The Husband was allowed to set off\n                    the previous costs orders made against the Wife from moneys ordered to be paid\n                    to the Wife. 5       The Wife has appealed against my\n                    decision.",
        "The parties": "6       The parties were married on 1 August 1988\n                    at the Singapore Marriage Registry. The children to the marriage, [G] and [J],\n                    are currently 17 and 11 years old respectively. 7       The Wife is a 45 year old housewife who, at the\n                    time of the hearing of the ancillaries, lives with the children of the marriage\n                    at [Property 1]. The Wife has not worked since 1992. She has not had an earned\n                    income since 1992. 8       The Husband is 48 year old. Prior to May 2011,\n                    he was a RSAF pilot who held a command appointment. Initially, the\n                    Husband’s intention was to join the RSAF-SilkAir Pilot Scheme which was\n                    established as a second career transition for RSAF senior pilots from age\n                    43½ to 50 years.[note: 1]The Husband applied for and was\n                    granted release from regular service with effect from May 2011. However, the\n                    Husband, for health concerns, had to give up his plan to be a commercial pilot.\n                    In June 2011, he found employment as a Flight Simulator Instructor and was to be\n                    stationed at the RSAF’s Flight Simulator Centre.[note: 2]This appointment required him to undergo four\n                    months of training in America. 9       In December 2007, the Wife filed a Writ for\n                    Divorce against the Husband. On 12 June 2009, Interim Judgment was\n                    granted. 10     I should mention that the Wife had wanted the\n                    Husband to vacate the matrimonial home as early as August 2007[note: 3]. After the Wife filed\n                    for divorce in December 2007, she continued to press the Husband to move out. On\n                    10 June 2008, the Wife gave the Husband one-month notice to move out in\n                        writing.[note: 4]The\n                    Husband refused. As he saw it, he owned the property and was paying the mortgage\n                    and outgoings. Besides, he could not afford the additional expense of setting up\n                    home elsewhere.[note: 5]In July 2008, the Wife\n                    unceremoniously dumped the Husband’s personal belongings outside the front\n                    door before locking the Husband out of [Property 1]. Ever since then the Husband\n                    has had to live in rented accommodation.[note: 6]If I were to take the\n                    time the Husband said the Wife stopped washing his clothes and cooked his meals\n                    in March 2008 and the time she locked him out of the matrimonial home in July\n                    2008, which I was inclined to do although the Interim Judgment was granted in\n                    2010, the marriage lasted for 20 years. Even if the marriage was said to have\n                    lasted till the Interim Judgment, that additional two years would not have made\n                    a material difference for present purposes.",
        "Hearing of Ancillaries": "11     The ancillary matters to be resolved between\n                    the parties were: (a)     Division of matrimonial\n                        assets; (b)     Maintenance for the Wife and children; and (c)     Care and control of the\n                children. 12     An issue in dispute was whether the lump sum\n                    benefit under the RSAF SAVER plan for in-service officers is a matrimonial asset\n                    within the meaning of s 112(10) of the Women’s Charter\n                    (Cap 153, Rev Ed 2009). The acronym “SAVER” stands for\n                    Savings and Employee Retirement plan, and the participating officer received a\n                    lump sum retirement payment after a full career with RSAF. It was, however, not\n                    a legal objection that could be taken very far. I agreed with the Wife’s\n                    position that the Savers Account was a matrimonial asset. Furthermore, the issue\n                    of care and control was strenuously contested. However, after March 2011, there\n                    was a shift in the Husband’s position, and this is explained\n                below. 13     At the ancillaries, the Wife was represented\n                    by Mr Ahmad Nizam Abbas (“Mr Nizam”). The Husband was\n                    initially represented by Mr Rajan Chettiar\n                    (“Mr Chettiar”). At the adjourned hearing of 30 August\n                    2010, Mr Nizam informed the court that the Wife had revised her earlier\n                    position. It is a convenient juncture to set out the Wife’s revised\n                    proposal: IssueWife’s revised\n                                    proposalCustody, care and control of the 2\n                                            childrenJoint custody with care and control of the\n                                            2 children to the Wife.Husband shall have\n                                            reasonable access.[Property 1]Husband is to transfer all his rights,\n                                            share, interest and title in [Property 1] to the\n                                            Wife.There shall be no refund of the\n                                            Husband’s CPF and accrued interest utilized\n                                            towards the purchase of [Property 1] ($575,235.25).Upon\n                                            the transfer of [Property 1], the Wife will pay the\n                                            monthly mortgage instalments.Savers AccountWife is seeking a fixed sum of$300,000.00(this is less than\n                                            50% of the value of the Retirement Fund).Both parties have set the amount of the Savers Account\n                                            at$644,682.62as at\n                                            December 2009.If the Wife is granted a\n                                            share of the retirement fund, she will forego her claims\n                                            in the bank accounts, any shares, stocks and bonds,\n                                            health and life insurance.Insurance PoliciesAs stated above, the Wife is willing to\n                                            forego her claims of the insurance policies if she\n                                            receives a share of the retirement fund.For\n                                            practical purposes, she requests that:Her\n                                            Hospitalization Protection Plan (AIA [xxx]) is to be\n                                            transferred to her name.The 2\n                                            children’s Hospitalization Protection Plans (AIA\n                                            [xxx] and [xxx]) is to be transferred to the\n                                            Wife’s name.Wife will service the\n                                            premiums through her own CPF.MaintenanceHusband is to pay a monthly maintenance\n                                            sum of $4,000 for the Wife and $6,000 for the 2 children\n                                            into the Wife’s OCBC account\n                                    [xxx].CarHusband is to provide the Wife with a car\n                                            comparable to the capacity, size and make to a Honda\n                                            Stream to be registered under her name or a lump sum of\n                                            $60,000 to be used towards the purchase of the said car\n                                            (bearing in mind the price is around\n                                            $90,000).Husband is to reimburse the Wife\n                                            the car rentals amounting to $26,215 ($1,872.50 per\n                                            month).   14     At the next substantial hearing on\n                    20 January 2011, the Husband was without legal representation. He appeared\n                    as a litigant in person. The Husband explained that he could no longer afford\n                    legal representation because he had spent a fair amount of money to defend the\n                    Personal Protection Order (“PPO”) proceedings initiated by the\n                    Wife who accused him of violence and mental anguish. He was terribly upset with\n                    the wasted time and costs spent on what he saw as a trumped up and frivolous\n                    application based on a “script”, to borrow the Husband’s\n                    words, portraying him as a “monster” and the Wife as the\n                    “victim”. It was a farce because it had all to do with his refusal\n                    to move out of [Property 1]. In particular, after the Wife locked him out, she\n                    applied for a PPO the same day and obtained an Expedited Order to keep him out\n                    of his own property.[note: 7]Even though he won, the distress\n                    engendered by the contested proceedings was painful and emotionally draining. He\n                    was upset when he recounted the time when the Wife attempted to jeopardise his\n                    career by questioning the state of his health and pointing out, at the same\n                    time, the hazard and risk of allowing the Husband to fly a fighter plane or a\n                    commercial plane. It was a bizarre attack seeing that the Husband’s\n                    ability to pay maintenance was dependent on his job. Needless to say, the\n                    divorce and PPO proceedings would also have affected the emotional well-being of\n                    the Wife and children. It would have been a difficult, painful and stressful\n                    time for them. 15     At the conclusion of arguments on the division\n                    of matrimonial assets on 28 March 2011, the parties were still unable to\n                    amicably resolve the issue of the care and control of the two children. It was\n                    plain to me that the parties continue to be very upset by the events surrounding\n                    the PPO and the divorce, and that they both love their children dearly. Each\n                    parent wanted care and control of the children. I directed that a Custody\n                    Evaluation Report be submitted. Interviews were conducted on 20 April 2011\n                    and 18 May 2011. The custody evaluation was subsequently aborted as the\n                    parties reached an amicable agreement that gave to the Wife care and control of\n                    the children. The Husband duly informed the court of his decision to give up his\n                    fight for care and control in a letter dated 20 May 2011. He also requested\n                    an early hearing date for the resolution of the ancillaries before his departure\n                    from Singapore for training as a Flight Simulator Instructor. As stated, the\n                    orders set out in[1]-[4]above were made on 27 June 2011. 16     This Grounds of Decision is to be read as\n                    referring to the final submissions as of 27 June 2011.",
        "Matrimonial Assets": "",
        "(a)   Real property": "17     In 1988, the parties bought a Housing and\n                    Development (“HDB”) maisonette (“Property 3”). Below\n                    is a table of the source of funds and amounts contributed by the parties towards\n                    the purchase of [Property 3]. The figures in the table came from the\n                    Wife. Table of initial monetary contributions\n                                        to [Property 3]OwnerCPF contributionCash contributionWife$43,536.61$40,000 (Loan from Wife’s\n                                            mother)Husband$112,312.16-Nil-   18     Initially, the Husband denied that the Wife\n                    had contributed to the purchase by way of her CPF contributions. The Wife did\n                    not provide documentary proof whereas the Husband had shown that $111,964\n                    (almost the entire purchase price of [Property 3]) and monthly contributions of\n                    $929 were withdrawn from his CPF account.[note: 8]In relation to the\n                    allegation that $40,000 to renovate [Property 3] in the form of an interest-free\n                    loan came from the Wife’s mother, Mr Chettiar for the Husband\n                    explained that the loan amount was $30,000, and not $40,000. Furthermore, the\n                    Husband had repaid the loan to his mother-in-law.[note: 9]I noted that it was not the\n                    Wife’s case that the loan was not repaid (see[20]below). 19     At subsequent hearings attended by the Husband\n                    as a litigant in person, the Husband clarified and explained the efforts he had\n                    made to ascertain the total amount of the Wife’s CPF contributions. Even\n                    though he tried, he was unable to obtain information of the Wife’s CPF\n                    contributions. However, he was prepared to accept that the Wife had contributed\n                    financially towards this purchase and agreed to accept the HDB’s letter in\n                    1996 which referred to the sum of $43,670.03 as the Wife’s CPF\n                    contributions (which is slightly higher than the Wife’s figure in the\n                    table above). 20     At this juncture, I should mention that\n                    whenever the Wife made references to loans from her mother, it was never her\n                    case that the loans were unpaid and they remained outstanding. The loans were\n                    mentioned in an attempt by the Wife to claim some credit attributable to her as\n                    “contribution” to the acquisition of the property in question. I\n                    did not regard this as relevant to these proceedings. 21     In 1992, the Wife quit her job as a\n                    Communications Officer at the Ministry of Defence and pursued various courses in\n                    beauty therapy and cosmetology, and on completion of the various courses, the\n                    Wife was awarded six diplomas. The Husband said he paid for the courses. This\n                    was not disputed by the Wife. 22     In March 1993, the Husband was posted to\n                    Arizona for RSAF training. The Husband initially went alone while the Wife\n                    completed her diploma course. The Wife joined the Husband in Arizona in May\n                    1993. 23     The parties purchased a home in Arizona for\n                    $116,000 (“[Property 4]”). The Wife claimed that she contributed\n                    $65,000 to the purchase of the home in the form of an interest-free loan from\n                    her mother. She admitted that this loan was repaid.[note: 10] 24     The Wife did not work while in Arizona. She\n                    gave birth to [G] on 24 May 1994 in Arizona. In 1995, the parties returned\n                    to Singapore. [Property 4] was sold in May 1999.[note: 11] 25     Upon their return to Singapore, the parties\n                    sold [Property 3] for $483,000. The completion of the sale was in January 1996\n                    which wasafter[Property 1] was purchased in 1995\n                    at a price of $1,080,000 with both registered as joint tenants. The significance\n                    of this fact is that the sale proceeds of [Property 3] were not used to fund the\n                    purchase of [Property 1]. Rather the money went towards the purchase and\n                    renovation of [Property 2] which I will come to later. 26     Returning to the matrimonial home which is\n                    [Property 1], the Husband claimed that the Wife made no financial contributions\n                    towards its acquisition. Mr Nizam for the Wife accepted this in\n                    submissions. The Husband paid the 10% initial deposit of $108,000 and the legal\n                    completion fee of $42,604.18 in cash, as well as $50,000 worth of\n                        renovations.[note: 12]It is undisputed that\n                    throughout the marriage, the Husband paid for the mortgage and all the outgoings\n                    in relation to the matrimonial home. The Wife contended that her mother again\n                    gave them a loan of $50,000. The Husband accepted that there was a loan but\n                    maintained that it was for a sum of $40,000 and not $50,000, and that he had\n                    repaid his mother-in-law’s loan. 27     [Property 2] was purchased at $1,230,000 in\n                    1996. It is a freehold one-storey semi-detached house registered in four names,\n                    that of the Husband, the Wife, [K] and [P]. The table below sets out their\n                    respective monetary contributions. Table of owners’ initial monetary\n                                        contributions to [Property 3]OwnerCPF contributionCash contributionWife$34,000.00-Nil-Husband$114,451.08$200,316.19[K]$105,000.00-Nil-[P]$99,000.00-Nil-   The Wife alleged that she obtained an interest-free loan of $61,000\n                    from her mother and this was part of her initial cash contribution.[note: 13]The Husband, however, denied this\n                        loan.[note: 14]The Wife also alleged that the net profits of [Property 3] were used to buy\n                    [Property 2]. The Husband explained that $200,316.19 of the net sale proceeds of\n                    [Property 3] was spent on [Property 2] as follows: cash contributions of\n                    $90,316.19 for the initial deposit and $110,000 for renovations. The balance sum\n                    of $119,891.62 went towards defraying the family expenses in Australia for four\n                        years.[note: 15]Having regard to the\n                    Wife’s direct financial contribution of 22% towards [Property\n                        3],[note: 16]the Wife’s\n                    share of the sum of $200,316.19 was $44,069.56 (22%), and to the Husband the sum\n                    of $156,246.62 (78%). 28     It was not disputed that CPF moneys were\n                    refunded to the parties’ respective CPF Accounts following the sale of\n                    [Property 3] such that for [Property 2] the Wife’s direct contribution\n                    from her CPF Account was the sum of $34,000 and the Husband’s the sum of\n                        $114,451.08.[note: 17]The Husband and Wife lived\n                    in [Property 2] from 1996 until 2004. The Husband’s evidence is that the\n                    mortgage repayments, property tax, renovation and insurance were “jointly\n                    serviced” by him and his brother, [K].[note: 18]However, after the\n                    parties moved out of [Property 2] to live in [Property 1], the Husband requested\n                    [K] to pay the former’s portion of the mortgage repayment of about $2,000\n                    from 2004 to 2008 as he could not afford to do so. From 2009 onwards, [K] had\n                    difficulties paying the Husband’s share of the mortgage repayments, and\n                    the Husband resumed paying his share of the mortgage repayments.[note: 19][K]’s CPF statement showed that as\n                    at 27 September 2010, the total amount of CPF moneys utilised to\n                    finance the purchase together with accrued interest was $572,759.72, and the\n                    monthly deduction from CPF was $3,000.[note: 20] 29     From 1996 to 2004, [Property 1] was rented\n                    out. The Wife alleged that the rentals went towards servicing the mortgage loan\n                    of [Property 2].[note: 21]This was refuted by the Husband who\n                    explained that it was particularly hard on him as the sole breadwinner to\n                    finance the purchase of two private properties ([Property 1] and [Property 2])\n                    in 1995-1996, and the financial burden was later exacerbated by the downturn in\n                    the property market in 1997. He had mis-predicted the property market by\n                    assuming that rental returns would continue to hold. According to the Husband,\n                    [Property 1] was rented out for four years. For the first two years, the monthly\n                    rental was $4,500, but for the next two years, the monthly rental was\n                        $2000.[note: 22]The rentals were used to cover\n                    living expenses of the family since his salary was used to pay the mortgage\n                    repayments. This explanation is plausible since a huge slice of the\n                    Husband’s monthly salary was consumed by mortgage repayments of [Property\n                    1] and [Property 2]. The total monthly mortgage cash repayments were $5,748 for\n                    both properties. The Husband exhibited a copy of the Credit POSB mortgage\n                    statement to show that a sum of $3,648 (for [Property 1]) and $2,000 ([Property\n                    2]) were disbursed from his then salary of about $7,000.[note: 23]Even when\n                    his salary increased, for example, in 2000, the Husband’s evidence is that\n                    on their return from Australia, his net salary was $11,458 after tax but the\n                    monthly expenses such as mortgages, insurance, household and family’s\n                    expenses was around $10,000 to $11,000 leaving little savings to “handle\n                    exigencies” and the Husband’s grave concern was that they were\n                    “living at the edge”.[note: 24] 30     The Husband rejected as outrageous the\n                    Wife’s baseless claim that he stood to make $831,744 from the sale of\n                    [Property 2]. The Husband explained that if the property were to be sold at\n                    $1,600,000, the Wife and her sister would recover their CPF contributions but\n                    the Husband and his brother would suffer hefty losses given their larger\n                    contributions. 31     The Wife provided no evidence to contradict\n                    the Husband’s position that it had been agreed amongst the four of them\n                    that each person’s share in [Property 2] would be based on the amount of\n                    contribution made by each person. So if [Property 2] is sold, the CPF principal\n                    plus accrued interest would be reimbursed to the respective parties concerned\n                    and the net profits would be shared in the ratio of the amount of contribution\n                    made by the parties.[note: 25]Thus far, [K] had contributed\n                    75% of the mortgage repayments[note: 26]and the Husband\n                    25%. The Husband’s estimated the contributions in percentage terms (albeit\n                    not exactly 100%) as follows: (a)     [K]: 68%; (b)     [P]: 7.5%; (c)     Husband: 22%; and (d)     Wife: 2.35%.",
        "(b)   Shares": "32     The Wife alleged that the Husband had not\n                    disclosed his shares portfolio. The Husband rejected the Wife’s\n                    allegation, and I accepted his overall explanation as credible. 33     It appeared that the Wife’s list of\n                    shares were unreliable. As the Wife accepted, the list included the names of\n                    stock brokers such as Interactive Brokers, a firm of stock brokers in New York,\n                    and Commonwealth Securities, a stock broking firm in Australia. In addition,\n                    Computershare Investor Services Pte Ltd is a share registry firm. Lastly, on the\n                    Wife’s list is Wisely 98 Ltd, the management company of [Property\n                        1].[note: 27] 34     In respect of Australian shares on the\n                    Wife’s list, the Wife’s supplementary submissions stated that the\n                    profits from the sale of [Property 4] were used to buy shares in Australian\n                    companies. The Husband refuted the Wife’s claim stating in clear terms\n                    that the sale proceeds were not used to buy shares in Australian\n                        companies.[note: 28]The\n                    parties had decided to have a second child, and [Property 4] was sold to meet\n                    the extra expenses of the second child (born on 5 October 2000) and the\n                    family. [Property 4] was purchased with his funds and loan from his\n                    mother-in-law. As the Wife had admitted, the loan had been repaid. 35     As for Australian shares, the Husband said he\n                    used his savings to buy some shares but they were eventually sold at a loss\n                    because of the internet bubble burst. Moreover in 2008, some Australian shares\n                    were liquidated for a family holiday in Australia.[note: 29]Before the adjourned hearing on 28 March 2011, the Husband said he made\n                    calls overseas to check up on the Wife’s claims that there were\n                    undisclosed shares in Australian companies. He confirmed that the position was\n                    the same as that shown in the portfolio account statement provided to his\n                    previous solicitor, Mr Chettiar, which showed nil shares in the portfolio\n                    account with Commonwealth Securities Ltd.[note: 30] 36     The Husband’s investment in Sunshine\n                    Empire Investment is worthless. The only shares that the Husband now holds are\n                    190 SingTel shares. The Wife holds 1,360 SingTel shares. A fair solution was to\n                    allow each to retain the shares in his or her name.",
        "(c)   Insurance policies": "37     The Husband explained that most of the\n                    insurance policies were term policies and as such they have no surrender\n                        values.[note: 31]The\n                    hospitalisation policies were for the Wife and the children but they were not\n                    transferable. There is a small education policy for [G] which I have excluded\n                    from the pool of matrimonial assets. The Husband has a Prudential whole life\n                    policy with a sum insured of $80,000. There is no evidence of its surrender\n                    value. The Wife has two policies in her name (Prudential Prulink SuperGrowth\n                    Policy Nos [xxx] and [xxx])[note: 32]. She bought them\n                    using her CPF moneys. No surrender values were provided. In any case, the sum\n                    insured was relatively small. In the circumstances, to avoid further delay, a\n                    pragmatic and fair solution was to allow the parties to retain the policies in\n                    his or her name.",
        "(d)   Bank Accounts": "38     The Wife declared that she has three bank\n                    accounts in her sole name.[note: 33]There are two bank accounts in the Husband’s name and one in the joint\n                    names of the Husband and Wife. The amounts in the bank accounts were\n                    insignificant to make any meaningful division. The Wife has bank accounts in the\n                    joint names of herself and her mother. The Husband was not able to refute the\n                    Wife’s contention that the money in the joint accounts was her\n                    mother’s money and not matrimonial asset.[note: 34]",
        "(e)   Car and motor cycle": "39     The Husband’s motor cycle had a damaged\n                    engine which was too costly to repair, and the plan was to deregister the motor\n                    cycle by 26 March 2010[note: 35]. As for the car\n                    (registration no [xxx]), the Husband sold it for $51,000 on 1 November\n                    2008. However, he paid about $1,280.82 in order to fully redeem the car loan of\n                    $52,280.82 from Citibank. In short, it was a negative asset. A pragmatic and\n                    fair solution was to disregard and exclude the motor cycle and\n                car.",
        "Division of matrimonial assets in the pool": "40     The following matrimonial assets were to be\n                    divided: (a)     [Property 1]; (b)     The Husband’s Savers Account in\n                        the sum of $781,000; (c)     The Husband’s CPF Ordinary Account in the sum of $585,000 (on\n                        assumption of a refund to CPF following sale of [Property 1]);\n                    and (d)     [Property 2] in\n                        which the Wife owns 2.35% and the Husband 22%. 41     Section 112(1) of the Women’s Charter\n                    empowers the court to order a division of matrimonial assets. This discretion is\n                    circumscribed by the requirement that the division be in proportions that the\n                    court finds just and equitable. Section 112(1) states: The court shall have power, when granting or subsequent to the grant of a\n                        judgment of divorce, judicial separation or nullity of marriage, to order\n                        the division between the parties of any matrimonial asset or the sale of any\n                        asset and the division between the parties of the proceeds of any such asset\n                        in such proportions as the court thinks just and equitable. 42     Section 112(2) sets out a list of\n                    circumstances that the court may take into account when deciding whether and how\n                    to exercise its discretion. This list is not exhaustive, and is still subject to\n                    the overriding discretion of what is just and equitable in all the circumstances\n                    of the case. Section 112(2) states: It shall be the duty of the court in deciding whether to\n                        exercise its powers under subsection (1) and, if so, in what manner, to have\n                        regard to all the circumstances of the case, including the following\n                        matters: (a)    the extent of the contributions made by each\n                                party in money, property or work towards acquiring, improving or\n                                maintaining the matrimonial assets; (b)    any debt owing or obligation incurred or\n                                undertaken by either party for their joint benefit or for the\n                                benefit of any child of the marriage; (c)    the needs of the children (if any) of the\n                                marriage; (d)    the extent of the contributions made by each\n                                party to the welfare of the family, including looking after the home\n                                or caring for the family or any aged or infirm relative or dependent\n                                of either party; (e)    any agreement between the parties with respect\n                                to the ownership and division of the matrimonial assets made in\n                                contemplation of divorce; (f)    any period of rent-free occupation or other\n                                benefit enjoyed by one party in the matrimonial home to the\n                                exclusion of the other party; (g)    the giving of assistance or support by one\n                                party to the other party (whether or not of a material kind),\n                                including the giving of assistance or support which aids the other\n                                party in the carrying on of his or her occupation or business;\n                                and (h)    the matters referred to in section 114(1) so\n                                far as they are relevant. 43     I refer to s 112(2)(h)which requires me to have regard for matters referred to in\n                    s 114(1) so far as they are relevant: In determining the amount of any maintenance to be paid by a\n                        man to his wife or former wife, the court shall have regard to all the\n                        circumstances of the case including the following matters: (a)    the income, earning capacity, property and\n                                other financial resources which each of the parties to the marriage\n                                has or is likely to have in the foreseeable future; (b)    the financial needs, obligations and\n                                responsibilities which each of the parties to the marriage has or is\n                                likely to have in the foreseeable future; (c)    the standard of living enjoyed by the family\n                                before the breakdown; (d)    the age of each party to the marriage and the\n                                duration of the marriage; (e)    any physical or mental disability of either of\n                                the parties to the marriage; (f)    the contributions made by each of the parties\n                                to the marriage to the welfare of the family, including any\n                                contribution made by looking after the home or caring for the\n                                family; and (g)    in the case of proceedings for divorce or\n                                nullity of marriage, the value to either of the parties to the\n                                marriage of any benefit (for example a pension) which, by reason of\n                                the dissolution or annulment of the marriage that party will lose\n                                the chance of acquiring. 44     Having regard to the relevant factors listed\n                    in s 112(2) of the Women’s Charter, I divided [Property 1] in the\n                    proportion of 40% for the Wife and 60% for the Husband. In respect of the other\n                    assets listed under (b) to (d) in[40]above, I applied a different division, namely 25% for the\n                    Wife, and 75% for the Husband. A different percentage was used for the other\n                    assets for the following reasons: (a)     [Property 2] was an investment\n                        property owned by the parties and two others. It was not disputed that the\n                        arrangement amongst the four investors was that the investor’s stake\n                        in the investment property was dependent on the amount his or her actual\n                        financial contributions. (b)     The Savers Account was a retirement fund for in-service\n                        staff. The RSAF is responsible for the management and investment of the\n                        retirement fund. The benefits derived from the retirement fund are payable\n                        to in-service staff after release from regular service. 45     In respect of [Property 1], I adopted the\n                    approach of a percentage division on a realisation resulting in profit. The\n                    calculation of the proportion of division was based on a snap shot valuation of\n                    $1,500,000 as of October 2010. The Husband had provided a valuation report dated\n                    19 October 2010 and this valuation was not disputed by the Wife. Once the\n                    liabilities and expenses such as outstanding mortgage of $530,000, CPF moneys\n                    withdrawn and accrued interest of $585,000, agency commission and legal fee of\n                    $20,000 (estimated) were deducted from the sum of $1,500,000, the net sale\n                    proceeds available for division was $365,000. 46     I did not adopt the approach where the Husband\n                    would have to refund the CPF with moneys from his share of the sale proceeds\n                    because such an approach would leave the Husband with insufficient money to\n                    repay in full the CPF. To illustrate: Sale of [Property\n                                    1]:$1,500,000Less(a) Bank Loan$ 530,000(b) Commission & legal\n                                        fees$ 20,000---------------------Net sale proceeds$ 950,000---------------------H’s 60% =\n                                    $570,000W’s 40% =\n                                    $380,000   47     In this illustration, the Husband would have\n                    to find $15,000 to top up his share of the sale proceeds in order to refund to\n                    the sum of $585,000 to the CPF. It is to be noted that I had also given the Wife\n                    25% of $585,000. After refund to CPF, the Husband would have $439,000 in his CPF\n                    Ordinary Account but with no disposable sale proceeds in hand in respect of a\n                    property which he had shouldered the full financial burden. In this connection,\n                    I did not consider the Wife’s proposal (see[13]above) to be fair. In submissions, Mr Nizam explained\n                    the reason why the Wife wanted the Husband to transfer his title in [Property 1]\n                    without refund of CPF moneys to the Husband’s CPF Ordinary Account. As\n                    at 3 September 2009, the Husband had only $93.84 in his CPF Ordinary\n                    Account, and that in the normal course the Wife would be entitled to a direct\n                    share of his CPF moneys, but she was deprived of this benefit because the\n                    Husband had used too much money from the CPF Ordinary Account.[note: 36]Her argument is remarkably skewed and\n                    has turned logic on its head. The Husband exhibited his CPF statement dated\n                    10 October 2010 which showed that as at that date, his Ordinary Account is\n                        nil.[note: 37]There was no element of sharing in the Wife’s proposal which showed that\n                    she wanted to take all of $585,000 withdrawn from the CPF. The outcome of her\n                    proposal would leave the Husband with (a) nil balance in his CPF Ordinary\n                    Account, and (b) zero monetary return from [Property 1]. To leave the\n                    Husband in this position after all that he has done for the family would not, in\n                    my judgment, be fair (see[57]below).\n                    This outcome has also to be viewed together with the situation concerning\n                    [Property 2]. 48     I now come to [Property 2]. The Wife tendered\n                    an updated valuation report dated 24 March 2011 which valued [Property 2]\n                    at $2,000,000. Assuming [K] and [P] were willing, and [Property 2] was sold at\n                    that snap shot valuation as of 24 March 2011, the Husband said [K]’s\n                    quick calculations indicated that he would still be out of pocket by $100,000 to\n                    $150,000. This will affect [K]’s decision to sell the property at\n                    $2,000,000. However, for present purposes, assuming the property is sold at\n                    $2,000,000, the Husband calculated that after deducting the outstanding loan of\n                    $520,000 and expenses relating to the sale and legal fees, the estimated net\n                    sale proceeds is $1,440,000 to be shared as follows: (a)Husband’s 22%$ 316,000(b)Wife’s 2.35%$ 34,000(c)[P]’s 7.5%$ 108,000(d)[K]’s 68%$ 979,000   49     Assuming [Property 1] is sold at $1,500,000,\n                    [Property 2] sold at $2,000,000, the Husband’s CPF moneys used to finance\n                    the purchase of [Property 1] plus accrued interest in the sum of $585,000 and\n                    the Savers Account in the sum of $781,000, the total net value of the\n                    matrimonial assets is $2,081,000 ($365,000 + $585,000 + $781,000 +\n                    $350,000). 50     Excluding the proceeds of $350,000 from\n                    [Property 2], the Wife will get a total of $487,000 in the medium term ($146,000\n                    from [Property 1] (if sold at $1.5 million), $146,000 from the Husband’s\n                    CPF Ordinary Account and $195,000 from the Savers Account). From the notional\n                    sale proceeds of [Property 2],ie$350,000, the\n                    Wife would receive the principal withdrawn from CPF namely $34,000 plus an\n                    addition a sum of $79,000 being 25% share of the balance sum of $350,000.\n                    Coincidentally, this sum of $113,000 is more than enough to cover her CPF\n                    withdrawal of $34,000 plus accrued interest and her share of [Property 3] sale\n                    proceeds. For ease of reference, the Husband had ascribed as her direct\n                    financial contributions to [Property 2] the figure of $97,079.05 ($47,000 +\n                        $50,079.05).[note: 38]With this approach, the Wife gets the first bite\n                    to take back her direct financial contributions together with some gains.\n                    However, it leaves the Husband vulnerable to shortfalls. For example, unlike the\n                    Wife, he does not get back in full his share of [Property 3] proceeds of saleie, $156,246.62 (see[27]above). However, the money is enough to\n                    refund to CPF the principal with interest in the sum of $170,252.92.[note: 39] 51     In summary, based on the notional sale prices,\n                    the Wife’s share of the total matrimonial assets would be $600,000. With\n                    this money, the Wife should be able to purchase a HBD flat. 52     It was not disputed that the Husband was the\n                    sole breadwinner and applied his income on family expenditure. Furthermore, it\n                    was the Husband, and not the Wife, who was involved in financial matters\n                    relating to the marriage. The Wife was the primary caregiver of the children and\n                    had taken care of the home, husband and family wherever they resided. The\n                    Husband did not dispute the Wife’s non financial contributions both as a\n                    wife and mother. 53     As the sole breadwinner, the Husband paid for\n                    all the family’s expenses and outgoings in relation to [Property 1] which\n                    was the matrimonial home. The Wife made no direct or indirect financial\n                    contributions towards the purchase of [Property 1]. 54     Her direct financial contributions in the sum\n                    of $43,670.03 were in the acquisition of [Property 3] (see[19]above). [Property 2] was an investment with\n                    two others and in that investment the Wife’s CPF contribution was $34,000.\n                    Part of the net sale proceeds of [Property 3] was used to buy [Property 2]. I\n                    have referred to the total amount of the Wife contributions in[27]above taking into consideration her share of\n                    [Property 3]. 55     In contrast, the Husband had contributed in\n                    excess of $500,000 in the form of CPF moneys and cash toward the acquisition of\n                    [Property 2] and [Property 3] (see[27],[28]and[48]above). 56     That said, direct and indirect, financial and\n                    non-financial contributions are all to be given equal weight and no single\n                    factor should be determinative of the outcome. This is clear in the statutory\n                    wording of Section 112 of the Women’s Charter which places no greater\n                    weight to any single type of contribution. InLim Choon Lai v\n                        Chew Kim Heng[2001] 2 SLR(R) 260 (“Lim Choon Lai”) at [14(b)], the Court of Appeal\n                    approved the dicta of Judith Prakash J inYow MeeLan v Chen Kai Buan[2000]\n                    2 SLR(R) 659 (“Yow MeeLan”) and held that non-financial contributions\n                    can be just as important as financial contributions, depending on the\n                    circumstances of the case. InNK v NL[2010]\n                    4 SLR 792 (“NK v NL”), the\n                    Court of Appeal approved of bothLim Choon LaiandYow MeeLan, and\n                    went a step further by acknowledging that financial contributions are just one\n                    of the many factors to be taken into account, thus placing all the relevant\n                    factors, financial and non-financial, on equal footing. In addition, at\n                        [34] ofNK v\n                        NL, the Court held that any difficulty encountered in defining or\n                    measuring non-financial contributions should not be an obstacle to a just and\n                    equitable division of the assets. 57     Before I discuss the Wife’s indirect\n                    contributions, there is one important feature of this case which is in the\n                    Husband’s favour as his indirect contributions which must not be\n                    overlooked in the division of the matrimonial assets. I accepted the\n                    Husband’s unchallenged evidence in respect of the financial burden he\n                    faced from acquiring two private properties given his primary source and limited\n                    income. Against uncertainties and risks, he weathered the bad economic climate\n                    of the 1990’s. He struggled to finance two properties through the bad\n                    years and, at the same time, kept afloat the family by providing for the Wife\n                    and children. During that period, the Wife according to the Husband had not\n                    appreciated and accepted the financial situation and was uncooperative when it\n                    came to tightening unnecessary expenses.[note: 40]It was because\n                    of the Husband’s fortitude and sterling fund management that now more than\n                    ten years on the parties still have the very same two properties available for\n                    division. Therefore, it is only right that I take into account the\n                    Husband’s indirect contributions in weathering the financial storm no\n                    matter how much pressure it put him under, and no matter how limited liquidity\n                    he had. 58     Over the course of this 20-year marriage, the\n                    Wife’s indirect contributions were in her roles as wife and mother. In\n                    1993, she followed the Husband to Arizona where he was undergoing RSAF training.\n                    I was satisfied with the Husband’s explanation[note: 41]which was\n                    reasonable and discounted the Wife’s claim that she sacrificed a business\n                    opportunity in the form of a business plan dealing with beauty products for the\n                    sake of the Husband. In August 1994, the Wife gave birth to [G]. During the\n                    Husband’s training stint in Arizona, the Wife had to take care of their\n                    son, housekeep and cook for the family. 59     I also did not think there was anything in the\n                    Wife’s claim that she gave up a chance to study in Australia on account of\n                    the family. In August 1996, the Husband received an RSAF scholarship to study in\n                    Australia and the family went along. In April 1997, the Wife applied for a\n                    degree course in interior architectural course at University of New South Wales\n                    (“UNSW”). The Wife received a conditional offer which required\n                    completion of a foundation year after undergoing a course in English, and to\n                    pass an English proficiency test which she did. I accepted the Husband’s\n                    explanation as to why the Wife did not pursue the course. Counting the\n                    foundation year plus the degree course of four years, the Wife would only be\n                    able to complete her studies by end 2002. It was not feasible to embark on a\n                    course of studies with a much later completion date than the Husband’s\n                    because by end 2000, he and the family had to return to Singapore. Besides, the\n                    family’s finances would not have allowed her to stay behind.[note: 42] 60     I accepted the Wife’s evidence that she\n                    did her fair share of ferrying the children to and from school, enrichment\n                    classes and tuition. When it came to the children’s education, I accepted\n                    that Husband’s evidence that as between him and the Wife, it was he (with\n                    his tertiary degree) rather than the Wife (with her GCE O-Level Certificate) who\n                    guided the children’s education and assisted [J] when it came to his\n                    studies. This version is consistent with the Husband’s repeated request\n                    during the ancillaries for the Wife to give him access to the children, in\n                    particular, in order to tutor and prepare [J] for Gifted Education Programme\n                        exams.[note: 43]Finally,\n                    the access which the party had worked out and which formed part of my order gave\n                    the Husband weekday access on Wednesday or Thursday from 5pm to10pm to coach [J]\n                    in his studies. 61     As with so much else in the division of\n                    matrimonial assets, there can be no hard and fast rule so long as the court has\n                    properly balanced the factors in s 112 of the Woman Charter that are\n                    relevant to the circumstances of the case. Ultimately, the process of division\n                    of matrimonial assets is not an exact science. AsZO v\n                        ZPand another appeal [2011] SGCA 25 makes clear, at\n                        [23]: Ultimately, the court is directed to take a “broad-brush”\n                        approach to the process of division of matrimonial assets by resisting the\n                        “temptation to lapse into a minute scrutiny of the conduct and\n                        efforts of both spouses, which may be objectionable in disadvantaging the\n                        spouse whose efforts are difficult to evaluate in financial\n                        terms” 62     At the end of a 20 year marriage to which both\n                    had made reasonable contributions in their own respective ways, one exit with\n                    about 70% and the other with about 30% of the overall matrimonial assets that\n                    comprised their matrimonial home, a collective share in an investment property,\n                    the Husband’s CPF refund with accrued interest, and Savers Account. While\n                    the division left the Husband with significantly more cash, this apparent\n                    disparity is not, in my judgment, unjust and inequitable as there were good\n                    reasons for doing so given the overall circumstances of the case as explained\n                    earlier (seeeg,[57]above) and here: (a)     The Husband has housing needs such\n                        as separate accommodation for himself and the children during the periods\n                        they are with him including a proper place to tutor [J] once a week (see\n                            s 112(2)(c) read with\n                            s112(2)(h) and s 114(1)(b)); (b)     The welfare of the children would be promoted by the\n                        Husband having a home (see section 112(2)(c)); (c)     The financial responsibility for the children’s tertiary\n                        education was acknowledged by the Husband to be his alone to bear (see\n                            s 112(2)(c) read with\n                            s 112(2)(h) and s 114 of\n                        subsections (1)(b) and (f)); and (d)     The realities are that with a reduced income and earning\n                        capacity (non-flying career) in the future, the Husband would have to make\n                        provision from his share of the matrimonial assets for the children’s\n                        tertiary education (see s112(2)(h) read with\n                        s 114(1)); and (e)     The division also took account s 112(2)(f) whereby the Wife excluded the Husband from the\n                        matrimonial home since July 2008, and had lived there rent-free with the\n                        children for over three years. The Husband complained that even after the\n                        PPO and Domestic Exclusion order were set aside, the Husband’s request\n                        to be allowed access into the matrimonial home was refused by the\n                            Wife.[note: 44] 63     I should elaborate on my earlier point on the\n                    Husband’s housing needs and the consideration of a home where the children\n                    can enjoy their contact time with him. In some cases, there is not enough to\n                    provide a home for either or that there is only enough to provide for one.\n                    Ordinarily, preference will be given to the party who has care and control of\n                    the children. However, in the present case, the division here would enable both\n                    to acquire public housing for themselves. A division which achieves such an\n                    outcome is, in my view, just and equitable. 64     As for the future education of the children,\n                    it was not disputed that the children are clever and have promising academic\n                    potential. He repeatedly said that he wanted to ensure that he had enough money\n                    to take care of the children’s future education, and had fought for the\n                    Savers Account to be left intact, and not to be subject to division. I was\n                    satisfied with the Husband’s wholehearted commitment to finance in the\n                    future the children’s tertiary education. As such there was no need to\n                    make an order that the Husband earmarks money from his share of the matrimonial\n                    asset but to simply allow him to retain cash for this purpose, which could turn\n                    out to be a fairly sizeable amount for two children. Therefore, attributing a\n                    larger share of the matrimonial assets to the Husband was, in the circumstances,\n                    just and equitable. 65     For completeness, I refer to a related\n                    argument made by the Husband. He brought up the Wife’s close association\n                    with [L]. The Husband claimed that [L] lived in [Property 1] and had also made\n                    use of the family car before the Husband took it away. According to the Husband,\n                    it was [L] who had coached the Wife to make unreasonable demands at the\n                    ancillaries. I did not think that the Wife’s relationship with [L] should\n                    in principle affect the quantum with which the Wife should exit this marriage\n                    any more than the alleged existence of another family which the Wife had accused\n                    the Husband of having should affect the Husband’s share.",
        "Monthly maintenance": "66     On 24 September 2008, under a consent\n                    order (“the consent order”) made by District Judge Carolyn Woo in\n                    MSS 2836/2008, the Husband agreed to pay the Wife and the children monthly\n                    maintenance of $4,493.30.[note: 45]In MSS 5638/2008, the monthly\n                    maintenance was increased to $4,797.30 by District Judge Jen Koh (“the\n                    maintenance sum”).[note: 46] 67     In the ancillaries, the Wife claimed that a\n                    reasonable amount for maintenance for herself and the children would be $10,200,\n                    a breakdown of which is as follows: (a)     $4,200 for herself;\n                    and (b)     $6,000 for the\n                        children. 68     However, this sum of $10,200 was on the\n                    condition that the Husband transferred his entire share in [Property 1] to the\n                    Wife her without a refund to his CPF account of moneys withdrawn towards\n                    purchase of [Property 1], that the Husband purchased a car for the use of the\n                    Wife and children. If her conditions were met, the Wife would service the\n                    outstanding mortgage repayment. The Husband saw through the Wife’s\n                    conditions that came with the maintenance tag of $10,200. The figure was\n                    deliberately inflated to disguise the fact that he would be indirectly paying\n                    the monthly mortgage payment of about $5,000 which the Wife had agreed to take\n                    over if the Husband’s share in [Property 1] was transferred to her without\n                    refund of CPF moneys used to finance the purchase of [Property 1]. Furthermore,\n                    the Husband pointed out, and quite rightly so, that with interim monthly\n                    maintenance of $4,797.30, the Wife could afford to set aside $1,872.50 per month\n                    on car rental. I noted the Husband’s point that something was wrong. As he\n                    put it, “Someone must be lying outright about the maintenance required or\n                    the amount of money she has”.[note: 47]In short, the Wife and\n                    children were able to live on a monthly sum of $2,872.30. 69     I should also mention that the interim\n                    maintenance of $4,797.30 was made when the Husband was still with the RSAF. In\n                    2009, his take home salary, before income tax, was about $19,500 (rounded up).\n                    There is now no prospect of a second career as a commercial pilot. Prior to his\n                    release from regular service in May 2011, he was grounded for a knee injury and\n                    episodes of breathlessness.[note: 48]He now has a non-flying job as a\n                    Flight Simulator Instructor. His earns a gross monthly salary of $12,500, which\n                    is very much less than what he used to earn. His take home pay is about $10,500\n                    per month before tax. It is important to bear in mind that the Husband is\n                    willing to maintain the Wife; she is, to use his words, “the mother of\n                    his children’. The simple point he repeatedly made was that the amount of\n                    the maintenance must be withinhismeans, and\n                    given his current take home pay, her demand for $10,200 per month was\n                    outrageous. 70     The Husband said that without [Property 1] his\n                    monthly expenses would be about $7,000. That was still on the high side even\n                    after taking into account income tax liability, rental, and mortgage repayments\n                    before sale of [Property 2]. 71     On the affidavit evidence, I saw no\n                    supportable basis for the Wife’s demands for a nearly three-fold increase\n                    in the maintenance sum ordered by District Judge Jen Koh in MSS 5638/2008. This\n                    is especially since the Wife had consented to a sum of $4,493.30 in MSS\n                    2836/2008. Above all, I found the reasons advanced by the Husband plausible, and\n                    they were accepted by me. 72     The Wife submitted that one of the reasons for\n                    the substantial increase in maintenance was that she would rather pay out of the\n                    monthly maintenance for several outgoings such as electricity and other\n                    services. This is because the Husband had in the past refused to pay for the\n                    services, resulting in the electricity being cut off and the telephone line\n                    being disconnected. In addition, she claimed that the money provided for food,\n                    vitamins, books, stationery and tuition fees had proved to be\n                        insufficient.[note: 49] 73     I found that the Wife’s accusations that\n                    the Husband had refused to pay bills for services to be untrue. In fact, the\n                    very same accusations were disbelieved during a Maintenance Enforcement Trial\n                    heard before a District Judge. I found that the Wife had refused to pass the\n                    Husband his mail and bills addressed to [Property 1]. She had also prevented\n                    SingPost from redirecting his mails to another address. The Husband also had to\n                    call Starhub personally to settle the bills so that the TV services would be\n                    available for the children. In addition, the Wife had neglected to pay for\n                    Singapore Power bills despite being given $350 under the interim maintenance\n                        sum.[note: 50]In\n                    addition, the Husband had stated that the children still approached him for\n                    money on an ad hoc basis, and that he would give them some money whenever he met\n                    them. On special occasions, he had voluntarily given the children extra money.\n                    He gave the example of his $1,000 “hong bao” to each child for the\n                    Chinese New Year even though he knew that they would give the money to their\n                    mother. On the Wife’s birthday, the Husband gave the children some money\n                    knowing that they would use it to get a gift for their mother. 74     Having considered all the circumstances, I am\n                    of the opinion that, in the medium term whilst [Property 2] is not sold, a fair\n                    sum of maintenance for the Wife and the children is $3,800, of which: (a)     $1,800 is for the Wife;\n                    and (b)     $2,000 is for\n                        the children.",
        "Claim for car rental": "75     In November 2008, the Husband sold the family\n                    car, a Honda Stream. The sale price was less than the outstanding loan\n                        (see[39]above).[note: 51]The Wife claimed that\n                    the rental of a car was necessary for her to drive the children around. The\n                    monthly rental of the car came up to $1,872.50 per month.[note: 52]As such, the Wife\n                    claimed a sum of $56,292.50 for the rental of a car from November 2008 to June\n                    2011. 76     The Husband submitted that the issue of\n                    reimbursement of the car rental had already been brought up before the District\n                    Judge Jen Koh in MSS 5638/2008. The Wife argued that the sale of the family car\n                    was in breach of paragraph [5] of the\n                    Consent Order dated 24 September 2008,[note: 53]which stated that the\n                    Husband was to: ... make payments directly for the following:- (1)    Car loan for vehicle number [xxx]; (2)    Road Tax for vehicle number [xxx];\n                        and (3)    Maintenance and sinking fund for [Property\n                            1]. 77     District Judge Jen Koh ruled that as the car\n                    was still in the Husband’s name, he could do what he wanted with the car.\n                    The consent order did not prohibit the Husband from selling the car. However,\n                    District Judge Jen Koh on 1 September 2009 did order the Husband to pay the\n                    Wife $900 per month for transport costs backdated to 28 January\n                        2009.[note: 54]According to the\n                    Husband, this backdating was to cover the transport expenses after he took away\n                    the car in November 2008. The Husband argued that the Wife therefore had no\n                    valid basis to claim car rental from him. In reply to the Wife’s other\n                    argument that she needed as car as [Property 1] was too far from the main road,\n                    the Husband pointed out that [Property 1] was not that inaccessible. It was 500\n                    metres from [xxx] Road and 900 meters from [xxx] MRT station, both places he\n                    identified were within walking distance.[note: 55]In my view, the $900 for\n                    transport was sufficient to meet the needs of the Wife and the children. The\n                    Wife could not explain why she needed to hire a Mitsubishi Grandis (2400cc)\n                    which is a MPV with a bigger engine capacity compared to the family car, a Honda\n                    Stream (1700cc). From the 2011 invoices, the rental car was a Nissan Presage\n                    (2500cc). In the absence of an explanation, the Wife’s behaviour was\n                    unreasonable. I was minded to believe that there was in effect an element of\n                    tit-for-tat in the decision especially after the Husband took away and sold the\n                    family car. In the circumstances, I disallowed the Wife’s claim for the\n                    costs of car rental from November 2008 to June 2011.",
        "Costs": "78     As for costs, I ordered each party to bear its\n                    own legal costs. The Husband is allowed to set off the previous cost orders made\n                    against the Wife from moneys that have been ordered to be paid to the Wife. At\n                    present, the previous cost orders made against the Wife amount to\n                $8,100.  [note: 1]Husband’s\n                                    4thAffidavit of 22 November 2010 at\n                                pp38-39 [note: 2]Husband’s letter to Court of 20 May\n                        2011 [note: 3]Wife’s 3rdAffidavit of 25\n                                February 2010 at p57 [note: 4]Husband’s 2ndAffidavit of 19 January 2010 at p 171 [note: 5]Husband’s\n                                    2ndAffidavit of 19 January 2010 at\n                                pp176-178 [note: 6]Husband’s 3rdAffidavit dated5\n                                March 2010 at para 37 [note: 7]Husband’s\n                                    2ndAffidavit of 19 January 2010 at\n                                para 10 [note: 8]Husband’s 3rdAffidavit of 5 March\n                                2010 at para 5 [note: 9]Husband’s 3rdAffidavit of 5 March\n                                2010 at para 5 [note: 10]Wife’s 1stAffidavit of 14\n                                October 2009 at para 11 [note: 11]Husband’s 2ndAffidavit of 19\n                                January 2010 at paras 23 &\n                62 [note: 12]Husband’s Submissions dated 14\n                                July 2010 at para 40. [note: 13]Wife’s Submissions dated 9 July 2010 at para\n                            64 [note: 14]Husband’s 4thAffidavit of 22 November 2010 at para 25 [note: 15]Husband’s\n                                    4thAffidavit of 22 November 2010 at\n                                paras 26 & 27 [note: 16]Husband’s Supplemental Submissions for 28 March\n                                2011 hearing at para 20 [note: 17]Husband’s\n                                    2ndAffidavit of 19 January 2010 at\n                                pp 54 & 55 [note: 18]Husband’s 2ndAffidavit of 19\n                                January 2010 at para 31 [note: 19]Husband’s 3 Affidavit of 5 March 2010 at para\n                            16 [note: 20]Husband’s 4thAffidavit of 22\n                                November 2010 at p 44 [note: 21]Wife’s\n                                    1stAffidavit of 14 October 2009 at\n                                para 7 [note: 22]Husband’s\n                                    4thAffidavit of 22 November 2010 at\n                                para 29 [note: 23]Husband’s 2ndAffidavit of\n                                19 January 2010 at para 14, p4 [note: 24]Husband’s 2ndAffidavit of 19\n                                January 2010 at para 36 [note: 25]Husband’s\n                                    2ndAffidavit of 19 January 2010 at\n                                para 75 p 15 [note: 26]Husband’s 4thAffidavit of 22\n                                November 2010 at pp 44-45 [note: 27]Husband’s 2ndAffidavit of 19\n                                    January 2010 at para\n                    21 [note: 28]Husband’s 3rdAffidavit of 5\n                                    March 2010 at para 9 [note: 29]Husband’s Supplementary Submissions for 28\n                                    March 2011 hearing at para 4 [note: 30]Husband’s Supplementary Submissions for 28 March\n                                    2011 hearing at para\n                    3 [note: 31]Husband’s 4thAffidavit of 22\n                                    November 2011 at para 52; Husband’s\n                                        1stAffidavit of of 5 November\n                                    2010 at p34 [note: 32]Wife\n                                        3rdAffidavit of 25 February 2010\n                                    at para 5 [note: 33]Wife’s 1stAffidavit of 14\n                                    October 2009 at para 13 [note: 34]Wife’s 3rdAffidavit\n                                    of 25 February 2010 at paras 7 to\n                        12 [note: 35]Husband’s 1stAffidavit of 5\n                                November 2009 at para 8(e) [note: 36]Wife’s Submissions dated 9 July 2010 at paras 59 and\n                                60 [note: 37]Husband’s 4thAffidavit of 22 November 2010 at pp 42-43 [note: 38]Husband’s Supplementary\n                                Submissions for 28 March 2011 hearing at para\n                        31 [note: 39]Husband’s 4thAffidavit\n                                dated 22 November 2010 at p\n                42 [note: 40]Husband’s 2ndAffidavit dated 19\n                                January 2010 at p 4 para 14 [note: 41]Husband’s 2ndAffidavit of\n                                19 January 2010 at para 61 [note: 42]Husband’s 2ndAffidavit of\n                                19 January 2010 at paras 36 &\n                65 [note: 43]Husband’s\n                                    2ndAffidavit of 19 January 2010 at\n                                p57; Husband’s 3rdAffidavit of 5\n                                March 2010 at paras 58 & 59 [note: 44]Husband’s\n                                        2ndAffidavit of 19 January 2010\n                                    at para 39 [note: 45]Plaintiff’s 2ndAffidavit of 20\n                                Jan 2010 at pp 61 – 62; Husband’s\n                                    3rdAffidavit of 5 March 2010 at para\n                                49 [note: 46]Plaintiff’s 2ndAffidavit of 20\n                                Jan 2010 at p 46 [note: 47]Husband’s Supplementary Submissions for hearing on 28 March\n                                2011 at para 6 [note: 48]Husband’s Supplementary Submissions for 28 March 2011 hearing\n                                at para 50 [note: 49]Wife’s Affidavit of 20 January\n                                2010 at pp. 14 – 15, paras\n                    53-56 [note: 50]Husband’s 3rdAffidavit of 5 March 2010 at para 53 [note: 51]Husband’s 3rdAffidavit of 5\n                                March 2010 at para 22 [note: 52]Wife’s 2ndAffidavit of 20\n                                January 2010 at pp 47-60 [note: 53]Wife’s 2ndAffidavit of 20 January\n                                2010 at pp 61-62 [note: 54]Wife’s 2ndAffidavit\n                                of 20 January 2010 at p 46 [note: 55]Husband’s 3rdAffidavit of 5 March\n                                2010 at para 55"
    }
}