{
    "case_title": "The Ministry of Rural Development, Fishery, Craft, Industry and Environment of the Union of Comoros\n      v\n      Chan Leng Leng and another",
    "ncitation": "[2012] SGHCR 15",
    "coram": "Tan Teck Ping Karen AR",
    "sections": {
        "Introduction": "1       This is the defendants’ application for security for costs pursuant to Order 23 rule 1(1)(a) of the Rules of Court (Cap 322, R 5, 2006 Rev Ed) (“Rules of Court”). After hearing the submissions of counsel I reserved judgment to fully consider the authorities cited to me, particularly because the plaintiff’s case is that security for costs cannot be ordered against it as it enjoys certain immunities and privileges conferred on it under section 15 of the State Immunity Act (Cap 313, 1985 Rev Ed) (“the Act”).",
        "Factual Background": "2       The plaintiff is a department of the government of the Union of Comoros. The Union of Comoros is an archipelago island nation located in the Indian Ocean. One of the main industries of the Union of Comoros is the fishing industry, which contributes substantially to the economy of the Union of Comoros. 3       The 1stdefendant is the appointed liquidator of the 2nddefendant. The 2nddefendant was a company incorporated in Singapore. It was a holding company which owned the companies which owned the vessels (“the Vessels”) in respect of which the plaintiff’s claim arises. 4       The plaintiff’s case is that the 2nddefendant had previously obtained the right to carry the flag of the Union of Comoros. This right, however, did not confer the right to carry out fishing activities in the waters of the Union of Comoros. In or around early February 2005, it came to the plaintiff’s knowledge that the Vessels were carrying out fishing activities in the high seas of the Union of Comoros. The plaintiff commenced proceedings in the Court of 1stInstance in the Union of Comoros against the 2nddefendant for losses incurred as a result of the 2nddefendant’s action. 5       There is some dispute between the parties as to the validity of the various judgments that were obtained in courts of the Union of Comoros. However, for the purposes of this application, it suffices to state that judgment was obtained against the 2nddefendant in the Court of 1stInstance which was upheld on appeal to the Court of Appeal of the Union of Comoros. 6       On 12 September 2011, the 2nddefendant entered a Member’s Voluntary Liquidation. Information relating to the voluntary liquidation was published in the four local daily newspapers on 12 September 2011. The deadline for creditors to submit their claims or debts and prove the said claims or debts against the 2nddefendant was on or before 12 October 2011. 7       On 1 December 2011, the plaintiff’s solicitors wrote to the 1stdefendant bringing to her attention the judgment of the Court of Appeal of the Union of Comoros and informing her that, pursuant to the judgment, the 2nddefendant was to pay the sum of EUR3,298,000 (“Judgment sum”) to the plaintiff. 8       The 1stdefendant responded on 12 December 2011 stating that the Judgment sum was not referenced in the 2nddefendant’s accounts. A Proof of Debt was lodged by the plaintiff with the 2nddefendant on 5 January 2012. On or about 7 March 2012, the 1stdefendant proceeded to adjudicate the plaintiff’s claim and rejected the Proof of Debt on 12 March 2012. 9       As a result of the 1stdefendant’s rejection of the Proof of Debt, the plaintiff commenced the current proceedings seeking an order that the 1stdefendant’s decision to reject the Proof of Debt be reversed.",
        "The Issue": "10     The issue to be determined here is whether the plaintiff should be ordered to give security for the defendants’ costs in these proceedings. 11     As the plaintiff is a State, there is a preliminary issue of whether an order for the plaintiff to provide security for costs may be made in light of the provisions of the Act. If the answer is in the affirmative, then no such security for costs may be ordered. If the answer is in the negative, then the normal principles governing the provision of security of costs would apply.",
        "The law in respect of whether the plaintiff, as a State, may be ordered to provide security for the defendants’ costs (“the preliminary issue”)": "12     It would be helpful to begin by laying out the relevant portions of section 15 of the Act: Other procedural privileges 15. ... (2)    Subject to subsections (3) and (4) — ... (b)    the property of a State shallnot be subject to any process for the enforcement of a judgmentor arbitration award or, in an action in rem, for its arrest, detention or sale. (3)    Subsection (2) does not prevent the giving of any relief or the issue of any process with the written consent of the State concerned; and any such consent (which may be contained in a prior agreement) may be expressed so as to apply to a limited extent or generally; but a provision merely submitting to the jurisdiction of the courts is not to be regarded as a consent for the purposes of this subsection. (4)    Subsection (2)(b) does not prevent the issue of any process in respect of property which is for the time being in use or intended for use for commercial purposes. [emphasis added] 13     Since s 15(2)(b) of the Act refers to the “process for the enforcement of a judgment”, it would be necessary to examine what would constitute a “process for the enforcement of a judgment” under the Rules of Court. 14     The purpose of ordering security of costs was set out by Sir Nicholas Browne-Wilkinson V-C inPorzelack KG v Porzelack (UK) Ltd[1987] 1 All ER 1074 (“Porzelack”) at 1076-1077 (which was adopted by the Court of Appeal inCreative Elegance (M) SdnBhd v Puay Kim Seng and another[1999] 1 SLR(R) 112 (“Creative Elegance”) at [22]) as follows: The purpose of ordering security for costs against a plaintiff ordinarily resident outside jurisdiction is to ensure that a successful defendant will have a fund available within the jurisdiction of this court against which it can enforce the judgment for costs... 15     Since a judgment for costs is a judgment for payment of money, Order 45 rule 1 of the Rules of Court would be applicable and it states as follows: (1)    Subject to these Rules and section 43 of the Subordinate Courts Act (Chapter 321) where applicable, a judgment or order for the payment of money, not being a judgment or order for the payment of money into Court, may be enforced by one or more of the following means: (a)    writ of seizure and sale; (b)    garnishee proceedings; (c)    the appointment of a receiver; (d)    in a case in which Rule 5 applies, an order of committal. ... (3)    Paragraphs (1) and (2) are without prejudice to any other remedy available to enforce such a judgment or order as is therein mentioned or to the power of a Court under the Debtors Act (Chapter 73) to commit to prison a person who makes default in paying money adjudged or ordered to be paid by him, or to any written law relating to bankruptcy or the winding up of companies.",
        "Application of the law on the preliminary issue": "16     The defendants submitted that s15(2)(b) of the Act does not specifically prohibit the making of an order for security for costs against a plaintiff State. Order 45 rule 1 of the Rules of Court sets out the means by way a judgment for cost may be enforced. In other words, this would be “the process for the enforcement of a judgment”, and an order for security for costs is not included under this Order. The defendants further argued that security for costs is a procedural rule of the courts, similar to the obligation to provide discovery, and not a process for enforcement. 17     The plaintiff, naturally, disagreed with the defendants. The plaintiff took the position that security for costs cannot be ordered against the plaintiff as it is entitled to certain immunities and privileges under section 15 the Act. 18     The plaintiff relied onCreative Eleganceand submitted that the effect of ordering security for costs would be that property of the plaintiff would be made subject to a process for enforcement of a judgment for costs against the plaintiff and this is not permitted under section 15(2)(b) of the Act unless there is written consent by the plaintiff.  Since there is no such written consent, the Act would prohibit an order that the plaintiff provide security for costs.",
        "My decision on the preliminary issue": "19     After considering the arguments of the parties, I find that s15(2)(b) of the Act does not prohibit the court from ordering the plaintiff to provide security for the defendants’ costs in these proceedings. 20     A careful reading of s15(2)(b) of the Act reveals that the prohibition under this section only relates to “any process for the enforcement of a judgment”. This gives rise to two questions: (a)     What is a process for the enforcement of a judgment? (b)     Is an order for security of costs such a process for enforcement of a judgment? 21     It is clear from O45 r1(1) of the Rules of Court that a judgment or order for the payment of money, not being a judgment or order for the payment of money into Court, may be enforced by one or more of the following means (or processes): (a)     writ of seizure and sale; (b)     garnishee proceedings; (c)     the appointment of a receiver; (d)     in a case in which Rule 5 applies, an order of committal. 22     It is important to note that security for costs is not included as a process for enforcement of a judgment for cost under O45 r1(1) of the Rules of Courts. 23Singapore Civil Procedure 2007(Sweet & Maxwell Asia 2007) at para 23/0/2 states that the basis for an order for security of costs is “to enable the defendant to recover costs from the plaintiff from a fund within the jurisdiction in the event the claim against him proves to be unsuccessful”. However, it should be borne in mind that, at the time an order is made for security for costs to be paid, a judgment for costs has not been made. Therefore, it follows that the issue of enforcement of a judgment for costs would not arise at this time as no such judgment exists. 24     Support for the above analysis may be found inNML Capital Ltd v Republic of Argentina[2010] EWCA Civ 41 at [51],  where the English Court of Appeal stated that section 13(2)(b) of the United Kingdom’s State Immunity Act 1978 (which isinparimateriawith section 15(2)(b) of the Act) “is aimed at cases where a party has obtained a judgment against a state (whether in the UK or elsewhere) and seeks to enforce it against the “property” of a state within the jurisdiction of a UK court”. 25     In addition,Halsbury’s Law of Englandvol 61 (LexisNexis 5thEd 2010) states at paragraph 262: ...When a foreign state sues in an English court it must comply with the procedural rules of the court. Thus the foreign state may be required to furnish security for costs, and it must make disclosure. 26     In light of the above, I am of the view that it is clear that s15(2)(b) of the Act does not apply to an application for security for costs as no judgment for costs exist at the time such an application is made. Further, security for costs is a procedural rule and is not a “process for enforcement of a judgment” under O45 r1(1) of the Rules of Court. 27     Having found that the Act does not apply to prohibit an order for security for costs, I now turn to consider the principles to be considered in deciding whether to make an order for security.",
        "Principles governing an order for security for costs": "28     Order 23 rule 1 of the Rules of Court provides: (1)    Where, on the application of a defendant to an action or other proceeding in the Court, it appears to the Court — (a)    that the plaintiff is ordinarily resident out of the jurisdiction; (b)    that the plaintiff (not being a plaintiff who is suing in a representative capacity) is a nominal plaintiff who is suing for the benefit of some other person and that there is reason to believe that he will be unable to pay the costs of the defendant if ordered to do so; (c)    subject to paragraph (2), that the plaintiff’s address is not stated in the writ or other originating process or is incorrectly stated therein; or (d)    that the plaintiff has changed his address during the course of the proceedings with a view to evading the consequences of the litigation, then, if, having regard to all the circumstances of the case, the Court thinks it just to do so, it may order the plaintiff to give such security for the defendant’s costs of the action or other proceeding as it thinks just. 29     Once one of the factors in O23 r1(1) has been fulfilled, the Court, having regard to all the circumstances of the case, may if it thinks it just to do so, make an order for security for costs. The factors to be considered in the exercise of the Court’s  discretion include: (a)     The merits of the plaintiff’s claim. (b)     Difficulty that a successful defendant would face in enforcing a judgment for costs in the jurisdiction in which the plaintiff is ordinarily resident. (c)     The conduct of the parties. (d)     Whether the order for security would stifle the plaintiff’s claim.",
        "My decision on whether to order the plaintiff to provide security for costs": "30     It is not in dispute that the plaintiff is ordinarily resident out of jurisdiction. Therefore, the threshold requirement in O23 r1(1) has been met. The only remaining issue is whether, having regard to all the circumstances of the case, it would be just to order the plaintiff to provide security for the defendants’ costs. 31     One of the factors to be considered is the merits of the plaintiff’s claim. InCreative Elegance, the Court of Appeal at [24] referred toOmar Ali bin Mohd v Syed Jafaralsadeg bin AbdulkadirAlhadad & Ors[1995] 2 SLR(R) 407 where Chao Hick Tin J said at [21]: [referring toPorzelack]...Brown-Wilkinson VC did not think that a hearing for security for costs was an appropriate occasion to investigate in considerable detail the likelihood or otherwise of success in the action. But he recognised that if it could clearly be demonstrated that the plaintiff was likely to succeed, in the sense that there was a high probability of success, then that was a matter that could properly be weighed in the balance. But he deplored any attempt to go into the merits of the case \"unless it can be clearly demonstrated one way or another that there is a high degree of probability of success or failure. 32     The plaintiff’s action was initially commenced by way of an Originating Summons. The defendants’ application for the action to be converted to a Writ of Summons came before me. Having heard the parties’ submissions, I found that that there are sufficient dispute of fact for the action to be converted to a Writ of Summons. Having made this finding, I am of the view that both parties have an arguable case and it would not be appropriate to investigate or consider in detail the likelihood or success of each party’s case. 33     The possibility that a judgment of costs may be enforced by way of treaty or convention is another factor to be taken into consideration. There is no reciprocal enforcement treaty between Singapore and the Union of Comoros and a judgment for costs by the Singapore courts will have be enforced in accordance with the law of the Union of Comoros. This is a factor that will weight in favour of making an order for security. 34     The next question is whether an order for security will stifle the plaintiff’s action. Sir Nicolas Browne-Wilkinson V-C inPorzelackat pp 1079-1080 stated: The next matter that I taken in account is that on the evidence before me, there is little doubt that if I order security on anything like the scale asked for, the plaintiff’s action will in fact be stifled. It simply does not have the means to put up the money. It is always a matter to be taken into account that any plaintiff should not be driven from the judgment seat unless the justice of the case makes it imperative. I am always reluctant to allow applications for security for costs to be used as a measure to stifle proceedings. 35     The plaintiff has asserted at paragraph 11 in the 2ndaffidavit of Mr Mahmoud filed on 16 July 2012 that “the Union of Comoros and the Plaintiff can and will pay any sum if the Courts of Singapore make such an order”. Since the plaintiff has given such an assurance, there is little fear that an order for security for costs will stifle the plaintiff’s action. 36     Next, there is the issue of the conduct of the parties. The plaintiff argued that the defendants acted in an unreasonable manner. It was submitted that the defendants’ concern regarding the decision of the Court of Appeal of the Union of Comoros was only expressed in affidavits that were filed in these proceedings and not in the correspondence between parties before the Proof of Debt was rejected. The plaintiff also pointed out that the 2nddefendant had entered into a Member’s Voluntary Winding Up and at that point of time, appeared to have a surplus of USD5,235,863 after paying its debts. The bulk of this has been distributed and there is only a balance of USD20,000 left. 37     The defendants asserted that the 1stdefendant had at all times acted properly in adjudicating the plaintiff’s Proof of Debt. They rely onFustar Chemicals Ltd (Hong Kong) v Liquidator of Fustar Chemicals Pte Ltd[2009] 4 SLR(R) 458 at [20] where the Court of Appeal held: ...The liquidator has to ensure that the assets of the company are only distributed to creditors who have debts that have been genuinely created and remain legally due. He has extensive powers to go behind documents. Even judgments and compromise agreements can be re-evaluate to ensure that the debts are genuine....heisonly bound to take extraordinary steps to scrutinise a proof of debt on the basis that it could be a false claim in cases where he has reason to be suspicious about is genuineness or legal validity...[emphasis in the original] 38     The defendants submitted that the 1stdefendant had sufficient reason to be suspicious of the genuineness or legal validity of the decision of the Court of Appeal of the Union of Comoros and since the plaintiff refused to provide further evidence as requested, the 1stdefendant was entitled to reject the plaintiff’s Proof of Debt. 39     As stated above, in the earlier application to convert the Origination Summons to a Writ of Summons, I had found that each party has an arguable case. Therefore, I am of the view that it cannot be said that the 1stdefendant’s action in rejecting the plaintiff’s Proof of Debt was so unreasonable as to prevent an order for security for costs.",
        "Conclusion": "40     Having considered all the relevant circumstances of the case, I find that it would be just to make an order for security for costs. I accordingly order the plaintiff to provide security for the defendants’ costs in this action. I will hear parties on costs."
    }
}