{
    "case_title": "Lau Pang Cheng David\n      v\n      Tan Boon Heng",
    "ncitation": "[2012] SGHC 223",
    "coram": "Tay Yong Kwang J",
    "sections": {
        "Background": "2       The facts of this case are not in dispute. On 15 January 2006 at about 6.30 am, the plaintiff was part of a group of four cyclists riding in a single file along the extreme left lane of West Coast Highway in the direction of Jurong. The group was riding past the entrance of Pasir Panjang Wholesale Centre when the defendant’s car made a right turn into the entrance and collided with the plaintiff and two of the other cyclists, thereby injuring the plaintiff. The collision caused the plaintiff to be thrown against the windscreen of the car and thereafter to land on the road.[note: 1] 3       The plaintiff was treated by Dr Peter Manning, a Senior Consultant at the Emergency Medicine Department of the National University Hospital (“NUH”) about an hour after the accident. He was found to have abrasions and contusions to his lower legs as well as a contusion over his left buttock. He reported mild pain and declined analgesia. Although his helmet was dented and cracked in several places, the plaintiff was not rendered unconscious by the accident and did not vomit or have a headache. He was given a medical certificate for 3 days.[note: 2] 4       After the accident, the plaintiff began to notice neck pains that had not been present previously.[note: 3]He saw Dr Yue Wai Mun, Senior Consultant (Spine Service) of the Department of Orthopaedic Surgery at the Singapore General Hospital (“SGH”) on 19 January 2006 for this reason.[note: 4]An X-ray of his cervical spine was normal and magnetic resonance imaging (“MRI”) revealed pre-existing disc degeneration but no injuries that could be attributed to the accident. However, Dr Yue found that the plaintiff had pain on extension and rotation of his neck and that he was tender in the left trapezius muscle. As will be seen, the existence of a neck injury and its impact on the plaintiff’s work as a Ear, Nose and Throat (“ENT”) Surgeon are the focus of this appeal. 5       This writ of summons was filed in the Magistrates Courts on 2 June 2008 but the case was subsequently transferred to the District Courts. Interlocutory judgment was entered by consent on 15 July 2010, with 95% liability to be borne by the defendant. On 20 September 2011, Andrew Ang J granted an application to transfer the case to the High Court. Subsequently, the assessment of damages took place over 7 days in March and April 2012, with the plaintiff claiming under 10 heads: (a)     chronic neck pain, (b)     aggravation of existing degenerative changes to the plaintiff’s cervical spine, (c)     contusions, (d)     loss of future earnings, (e)     loss of earning capacity, (f)     medical expenses, (g)     pre-trial loss of income, (h)     loss of pre-trial earnings, (i)     costs of replacement bicycle and heart rate monitor, and (j)     travelling expenses for overseas cycling trips.",
        "The AR’s decision": "6       The AR awarded damages amounting to $281,877.75, with interest on special damages at half of 5.33% from the date of service of writ to the date of judgment and interest on general damages at 5.33% from the date of service of writ to the date of judgment. No interest was awarded for loss of future earnings. The total sum was derived as follows: S/NoItemAmount AllowedRemarks1Neck injury and aggravation of existing degenerative changes$20,000.002Contusions and abrasions$1,000.003Loss of future earnings$177,076.90Multiplicand: $22,997.00Multiplier: 11 yearsDiscount for pre-existing degenerative changes: 30%4Loss of pre-trial earnings$78,189.80Multiplicand: $22,997.00Multiplier: 4 yearsDiscount for pre-existing degenerative changes: 15%5Past medical expenses$71.056Replacement bicycle and heart rate monitor$5,540.00",
        "The appeal": "7       The defendant appealed against the AR’s decision with respect to the following (items 1, 3, 4 and 6 of the table above): (a)neck injury and aggravation of existing degenerative changes,(b)loss of future earnings,(c)loss of pre-trial earnings, and(d)replacement bicycle and heart rate monitor.The plaintiff did not cross-appeal.Neck injury and aggravation of existing degenerative changes8       The defendant disputed the existence of any neck injury to the plaintiff on four main bases. First, the defendant noted that the plaintiff had not complained of any injury to his neck when he was at NUH for treatment and that Dr Manning had found no spinal tenderness at all. Second, the X-ray and MRI scan taken four days later and analysed by both Dr Yue and Dr Raymond Tan, a Senior Consultant at the Department of Diagnostic Radiology of SGH, disclosed no injury that could be attributed to the accident. The degenerative changes and loss of lordosis found in the plaintiff’s cervical spine were likely to have pre-existed the accident. Third, the medical reports in evidence which reported a neck injury were based on the plaintiff’s unverifiable assertions of pain and of having a limited range of motion in his neck. Finally, surveillance on the plaintiff conducted over 5 days in January and February 2010 showed him to be apparently untroubled by his injury.[note: 5]Loss of earnings9       The bulk of the damages awarded by the AR were for the plaintiff’s claim for loss of earnings, which was said to have been caused by his neck injury. While the plaintiff did not allege that this injury was particularly serious, he claimed that it had a large impact on his work and, consequently, his earnings. At the time of the accident, the plaintiff was a Consultant in the Department of Otolaryngology at SGH. He was promoted to Senior Consultant on 1 May 2006, not long after the accident.[note: 6]As an ENT Surgeon, the plaintiff needs to hold his neck still for prolonged periods of time when conducting surgeries. He is hampered in doing so by his persistent neck pains, which are particularly acute with more complex surgeries as these take a longer time.10     At the time of the accident, the plaintiff was receiving a basic monthly salary of $14,250 comprising a base pay of $9,250 and a clinicians’ allowance of $5,000. After he was promoted to Senior Consultant, this increased to $18,000, with a base pay of $12,000 and a clinicians’ allowance of $6,000.[note: 7]The plaintiff is separately remunerated by a variable professional fee that is based on the quantity and nature of his workload.[note: 8]If the professional fee due to the doctor exceeds his clinicians’ allowance, the difference will be paid to him the following month. In other words, the clinicians’ allowance is the guaranteed minimum a doctor will receive as his variable professional fee. This fee is correlated to the number of surgeries a doctor undertakes. The plaintiff adduced evidence to show that his surgeries and variable professional fees suffered a pronounced decrease following the accident:[note: 9]YearNumber of Surgeries Undertaken by the PlaintiffProfessional Fees20041,501$131,40220051,494$123,93320061,329$124,42820071,296$119,35720081,347$139,5102009879$102,8572010775$106,48411     In addition to disputing the existence of a neck injury, the defendant sought to cast doubt on the causal relationship between the injury and the decrease in surgeries. The defendant relied primarily on the fact that the number of ENT surgeries carried out by doctors of a similar rank to the plaintiff had also decreased during this time, with more surgeries being conducted by junior doctors:[note: 10]YearNo. of ENT Surgeries performed by ENT DepartmentNo. of ENT Surgeries performed by Doctors, Excluding Medical Officers and Registrars200410,8009,360200510,9979,697200611,46110,097200712,40811,211200811,3779,132200910,8987,393201011,7267,01212     The plaintiff claimed to have declined surgeries because of his injury and that his head of department was aware of the issue. He also claimed to have arranged with his clinic manager to limit the number of his consultations. However, the defendant noted that the plaintiff had failed to call these persons to give evidence and argued that this failure undermined the veracity of the plaintiff’s claims.Replacement bicycle and heart rate monitor13     It was not disputed that the bicycle the plaintiff was riding at the time of the accident was irretrievably damaged. The defendant disputed the plaintiff’s claim for his expenditure on a replacement bicycle purchased in 2006 as the plaintiff no longer had his receipt and the retailer of the replacement bicycle did not maintain records as far back as 2006. An employee of the retailer gave evidence that the price list from the time of the sale indicated that the bicycle would have cost $5,000.00.[note: 11]However, the defendant took issue with the fact that no documentary evidence could be given of the price actually paid. The defendant also noted that the plaintiff had not mentioned a heart rate monitor in either of his AEICs and that there was no evidence that he was actually wearing one at the time of the accident.The approach to take on appeal14     Counsel for the defendant prefaced his submissions at the hearing before me by suggesting that a judge in chambers hearing an appeal against an AR’s decision isin no waybound by that decision. This view is, with respect, based on a misconception that warrants clarification.15     It is well established that a judge in chambers is not bound by an AR’s exercise ofdiscretion. InChang Ah Lek and others v Lim Ah Koon[1998] 3 SLR(R) 551, a case concerning an assessment of damages, the Court of Appeal approved the House of Lords decision inEvans v Bartlam[1937] AC 473, holding that registrars are not trial judges and that an appeal from the registrar to a judge in chambers is not an appeal in the true sense of an appeal from the judge in chambers or a judge sitting in open court to the Court of Appeal (at [14] to [20]). The observation that the judge in chambers deals with an appeal from the registrar “as though the matter came before him for the first time” was also approved. It is for this reason that fresh evidence can be adduced before the judge in chambers, unrestricted by theLadd v Marshallconditions that apply to an appeal before the Court of Appeal in respect of a judgment given on the merits (although the approach taken is less liberal where assessment of damages is concerned:Lassiter Ann Masters v To Keng Lam (alias Toh Jeanette)[2004] 2 SLR(R) 392 at [19] to [26]).16     The basis for this approach was elucidated by Chan Sek Keong J (as the Honourable Chief Justice then was) in the oft-cited case ofHerbs and Spices Trading Post Pte Ltd v Deo Silver (Pte) Ltd[1990] 2 SLR(R) 685. It was explained there that the judge in chambers hearing an appeal against an AR’s decision is not exercising appellate jurisdiction but is instead exercising a form of confirmatory jurisdiction (at [11] and [12]). This is because the AR only exercises substituted and not primary jurisdiction; the judge in chambers is therefore not bound by the exercise by the AR of what is in reality his discretion.17     As evidence is adduced by way of affidavit in interlocutory matters heard in chambers, a judge hearing an appeal against an AR’s decision faces no practical difficulty in rehearing the matter afresh. However in cases such as the present which involve an assessment of damages, proceedings before the AR take on the nature of a trial and the AR the nature of a trial judge. As Judith Prakash J observed inAng Leng Hock v Leo Ee Ah[2004] 2 SLR(R) 361 at [15], an appeal against an AR’s award of damages is an appeal:that is against a final decision, albeit by a registrar, which has been taken after a full trial on the merits in that discovery has taken place, documents and affidavits of evidence-in-chief have been filed,viva voceevidence has been given and the parties have had the opportunity of cross-examining each other’s witnesses. ... The assessment hearing has all the characteristics of a trial. In procedure there is no distinction between that hearing and the hearing of a trial before a judge.18     It is appropriate to remind ourselves of why appellate courts are reluctant to reverse findings of fact in courts below. InPeh Eng Leng v Pek Eng Leong[1996] 1 SLR(R) 939, the Court of Appeal approved the following passage from the House of Lords decision inClarks v Edinburgh & District Tramways Co Ltd(1919) SC (HL) 35:When a judge hears and sees witnesses and makes a conclusion or inference with regard to what is the weight on balance of their evidence, that judgment is entitled to great respect, and that quite irrespective of whether the judge makes any observation with regard to credibility or not. I can of course quite understand a Court of Appeal that says that it will not interfere in a case in which the judge has announced as part of his judgment that he believes one set of witnesses, having seen them and heard them, and does not believe another. But that is not the ordinary case of a cause in a court of justice. In courts of justice in the ordinary case things are much more evenly divided; witnesses without any conscious bias towards a conclusion may have in their demeanour, in their manner, in their hesitation, in the nuance of their expressions, in even the turns of the eyelid, left an impression upon the man who saw and heard them which can never be reproduced in the printed page. What in such circumstances, thus psychologically put, is the duty of the appellate court? In my opinion, the duty of an appellate court in these circumstances is for each judge of it to put to himself, as I now do in this case, the question, Am I - who sit here without those advantages, sometimes broad and sometimes subtle, which are the privilege of the judge who heard and tried the case - in a position, not having those privileges, to come to a clear conclusion that the judge who had them was plainly wrong? If I cannot be satisfied in my own mind that the judge with those privileges was plainly wrong, then it appears to me to be my duty to defer to his judgment.19     It is immediately apparent that these concerns are equally applicable to a judge in chambers hearing an appeal from an AR’s assessment of damages. As already noted, the rehearing of a matter afresh by a judge in chambers does not usually have occasion to interact with the customary deference an appellate court has for the trial judge’s findings of fact as the evidence before the court is of a documentary nature. However, it should be noted for clarity that any apparent inconsistency between these considerations when they do apply in an appeal from an assessment of damages is in fact illusory. Each consideration has a different field of application. This will be recognised once the exercise of discretion is distinguished from the factual determination upon which it is exercised. When coming to a decision, the AR must first make findings of fact and then exercise his discretion based on those findings. The fresh exercise of discretion by a judge in chambers is in turn dependent on the AR’s findings of fact on the oral as well as documentary evidence, and in this regard he suffers the same disadvantage as an appellate court in relation to a trial judge. This understanding is borne out by the cases inasmuch as only discretion, and not findings of fact, are said to be unfettered. InSie Choon Poh (trading as Image Galaxy) v Amara Hotel Properties Pte Ltd[2008] 2 SLR(R) 1076, Andrew Ang J noted:It is settled law that a judge in chambers hearing an appeal from a decision of the AR exercises a confirmatory jurisdiction. The judge deals with the matter as though it came before him for the first time and is entitled to exercise an unfettered discretion of his own: per Chan Sek Keong J (obiter) inHerbs and Spices Trading Post Pte Ltd v Deo Silver (Pte) Ltd[1990] 2 SLR(R) 685 at [12] affirmed by the Court of Appeal inAugustine Zacharia Norman v Goh Siam Yong[1992] 1 SLR(R) 746. Nevertheless, unless there are grounds upon which he differs from the AR, he should be slow to disturb the AR's findings, particularly where the AR's decision involved an examination of witnesses. Due weight should be given to the decision of the AR:Evans v Bartlam[1937] AC 473 followed by the Court of Appeal in Chang Ah Lek v Lim Ah Koon [1998] 3 SLR(R) 551.20     I note for completeness that the discretion of the judge in chambers would be properly exercised even if the judge wholly adopts the AR’s reasoning (see Jeffrey Pinsler,Singapore Court Practice 2009, LexisNexis 2009 at 56/1/4).The decision of the courtThe existence of a neck injury21     The arguments made by the defendant against the existence of a neck injury were summarised above. I found each of these arguments readily met on the evidence. First, while the plaintiff did not complain of any neck injury when he was treated at NUH immediately after the accident and no evidence of such an injury was found on examination, Dr Manning stated in his report that the plaintiff “told me that he planned to cancel his operating list at SGH on 16/1/2006 due to the anticipated aches and pains that would almost certainly arise by then”.[note: 12]It appears taken for granted by both doctors that aches and pains not immediately apparent after an accident would arise later. When cross-examined, Dr Manning explained the concept of a distracting injury, where pain from an obviously injured area can distract the patient from complaining of milder pain in other areas.[note: 13]It bears noting that the plaintiff sought treatment for the neck injury just 4 days later.22     Second, the fact that the X-ray and MRI scan taken on 19 January 2006 did not disclose any evidence of a neck injury is inconclusive. The doctors who gave evidence in this case stated that it is possible for an MRI scan to fail to detect an injury. Most tellingly, Dr James Lee, a Consultant Orthopaedic Surgeon in private practice who examined the plaintiff and gave evidence on his behalf, said in cross-examination that “we do know from the literature that up to 30 to 40% of MRIs can miss or not show any of these changes, subtle changes, as a result of [hyperextension, hyperflexion or an axial mechanism] to the neck”.[note: 14]Dr Lee had separately opined in a medical report that the plaintiff’s neck is likely to have experienced one of these mechanisms in the accident.[note: 15]Such a high failure rate should not be overlooked.23     Third, although the medical reports favourable to the plaintiff’s case were based on the plaintiff’s own unverifiable assertions of pain and limited range of motion, these reports should not be understood to be equivocal or inconclusive. Indeed, the doctors made firm and confident findings based on the exercise of their professional judgment that the plaintiff had suffered an injury to his neck. For example, in Dr Yue’s report dated 26 February 2011, he noted of the first consultation on 19 January 2006:[note: 16]On examination during his first consultation, he had a full range of neck motion but his spinal rhythm was abnormal. There was pain on extension and rotation, especially to the right. He was tender in the left trapezius muscle....Overall, the accident has severely exacerbated a pre-existing degenerative condition of Dr Lau’s cervical spine. The impact of the accident was significant as it resulted in both his helmet and the car’s windscreen suffering significant damage. He did not suffer from neck pain before. Now he has neck pain that interferes with his occupation as an ENT surgeon.24     Dr Yue was not just repeating the plaintiff’s complaints. It is clear from the language used that he was exercising his professional judgment in reporting what he found to be the plaintiff’s medical condition at the time of the consultation. This is confirmed by Dr Yue’s oral evidence:[note: 17]Q    In cases like this where compensation is an issue, you are not really able to diagnose any injury unless you rely on face value the history and complaints?A    His physical examination is not entirely normal as well. He has abnormal spinal rhythm and tenderness over the left trapezius muscle.Q    You agree earlier on that these issues are patient-subjective as well?A    Correct. You have to judge at different points of time whether someone was pretending to have pain. If he was normal at the time he first saw me, and then the complaint arose at the time when he saw me for the report, it would have aroused my suspicion. The first consultation was 4-5 days after the accident, there is less reason for me to suspect that he is suffering when he is not.25     Dr Yue was equally emphatic in defending his finding that the pre-existing degenerative condition affecting the plaintiff’s cervical spine was exacerbated by the accident:Q    ... On what grounds did you come to the conclusion that the accident had severely exacerbated the pre-existing degenerative condition of his cervical spine?A    Degenerative changes occur in everyone. 40% of persons over 40 years old, on MRI, we might see degenerative changes. In the majority of people, they do not have any symptoms. What I have is the history of a quite significant accident of great impact and Dr Lau complaining of pain after that and on examination, whether subjective or not, he appears to be in discomfort, this has led to a reduction in his work capacity. With these, I came to the conclusion that while he has a pre-existing degenerative condition, the accident did exacerbate his condition physically, if not from the imaging studies.26     Even the defendant’s witness, Dr Peter Lee, an Orthopaedic Consultant in private practice, came to similar conclusions. Dr Peter Lee noted in his report produced on the defendant’s behalf that:[note: 18]David has residual chronic neck and right upper limb discomfort which is likely to remain permanently. Although he is still able to perform his vocation as an ENT surgeon, he has not been able to performed (sic) surgery of long duration due to his neck symptom.David is likely to require periodic oral medication and physiotherapy for his symptom.27     Dr James Lee came to similar conclusions as Dr Yue and Dr Peter Lee.[note: 19]It would take weighty evidence indeed to rebut independent findings by three doctors who are specialists in the relevant field that the plaintiff did suffer a neck injury. None was supplied by the defendant. It is also relevant that both Dr Yue and Dr James Lee gave evidence before the AR, who found no reason to doubt their testimony.28     As for the surveillance report: the plaintiff’s apparent ability to go about his daily activities unimpeded by a neck injury is not a weighty consideration given that the surveillance was conducted some 4 years after the accident. By this time, the plaintiff could be expected to have recovered substantially. Nor was it the plaintiff’s case that he had been severely injured or that he remains significantly incapacitated. The damages claimed for loss of earnings under the next head of claim are not insignificant but they are not premised on a severe injury and are instead due to the nature of the plaintiff’s work.29     I therefore found the defendant’s arguments not borne out by the evidence. Instead, the evidence supports the conclusion that the plaintiff did sustain a neck injury. Accordingly, I found no reason to differ with the AR’s findings of fact or his decision to award the plaintiff $20,000 as damages for the neck injury and aggravation of the pre-existing degenerative condition.Loss of earnings30     The fact that doctors of Consultant rank and above have conducted less ENT surgeries in the years following the plaintiff’s accident may have contributed to the drop in the number of surgeries conducted by the plaintiff. However, this consideration was already taken into account by the AR, who quite appropriately accepted the plaintiff’s argument that his performance should be compared to that of his peers year to year. This is illustrated in the following table:YearAverage number of surgeries per doctor (excluding plaintiff)[note: 20]Number of surgeries conducted by the plaintiffPlaintiff’s surgeries as a percentage of the average20041,3101,501115%20051,2821,494117%20061,1851,329112%20071,1801,296110%20081,3191,348102%20091,01887986%20101,04077575%31     It is immediately apparent that the number of surgeries conducted by the plaintiff has fallen relative to those of his peers. While he had previously out-performed his peers by a 17% margin, he was 25% lower than the average by 2010. Equally telling is the distribution of the plaintiff’s surgeries:[note: 21]Number of Surgeries Performed by the PlaintiffYearTable 1Table 2Table 3Table 4Table 5Table 6 and above20041,221691114654020051,198741254254120061,045701025457120071,046561014942220081,07260127424422009674589635160201057554804025132     In SGH’s administrative nomenclature, Table 1 represents the least complex cases, with each successive table indicating cases of increasing complexity. As may be expected of the apparent redistribution of cases to more junior doctors and in keeping with the plaintiff’s increasing seniority, the plaintiff’s number of Table 1 surgeries has decreased markedly. However, contrary to what may reasonably be expected, the number of Table 5 surgeries conducted by the plaintiff has more than halved between 2004 and 2010 and he has made no headway at all with Table 6 surgeries. One would expect that with increasing experience and seniority come more complex cases. The plaintiff’s lack of progress in this regard is consistent with the fact that more complex surgeries take a longer time and he is more greatly hampered by his neck injury in longer surgeries.33     The defendant correctly argued that plaintiff ought to have called his head of department and clinic manager to give evidence of his having declined surgeries and limited his consultations. Such evidence would have been of significant assistance to the court. However, notwithstanding this omission, I am of the opinion that the plaintiff has satisfied the burden of proof. It is undeniable that the plaintiff’s performance has suffered since the accident. The defendant’s argument that this was caused by a change in policy leading to the allocation of more surgeries to junior doctors has already been taken into account and the evidence does not suggest another explanation.34     Furthermore, I am of the opinion that it is highly unlikely that the plaintiff would have contrived this marked decrease in performance in order to establish his claim for loss of earnings. Not only is his professional reputation at stake, his continued success in his field may be irreversibly undermined by a failure to gain surgical experience, particularly in complex matters. The acquisition of experience and skill being the constant endeavour of all professional men, this is a gambit that the plaintiff is particularly unlikely to have taken. It would also be inconsistent with the character of a person who was previously driven enough to outperform his peers. In this regard, the following observations of the AR are highly relevant:[note: 22]I would also note that I am not persuaded that the Plaintiff is a malingerer. He has come across as a honest and credible witness, and he can be seen to be a driven employee, as seen from his over performance (in terms of caseload) prior to the accident. I am not convinced that he would deliberately cut his caseload from 17% above average to 25% below average for purposes of claiming compensation in the present proceedings, especially when the loss in professional standing and future career development from such actions could have the potential of outweighing the monetary compensatory gains.35     I agree with the AR’s reasoning. I would add that this is precisely the sort of finding that a judge in chambers hearing an appeal from an AR is ill-placed to contradict. The judge in chambers exercises confirmatory jurisdiction and his discretion is unfettered but in this respect he stands in no better a position than any court sitting in an appellate capacity.36     For these reasons, I agreed with the AR’s finding that the plaintiff’s decrease in surgeries and consequent decrease in professional fees were the result of his neck injury. I also saw no reason to differ from the AR’s decision to award damages based on a multiplicand of $22,997.00. I note that this figure was proposed by the plaintiff and based on the difference between the average of his professional fees in the years of 2004 and 2005 on the one hand and 2009 and 2010 on the other. The plaintiff has been quite modest in seeking to recoup only the difference between what he previously earned and what he now earns under this aspect of his remuneration. As a Senior Consultant with more years of experience, it would be reasonable to suppose that his professional fees would now be higher than before the accident. He would have been entitled to claim this amount with the requisite proof. I also saw no reason to interfere with the multiplier applied by the AR or the discounts used to factor in the plaintiff’s pre-existing degenerative condition. Accordingly, the sums of $177,076.90 and $78,189.80 awarded for loss of future earnings and loss of pre-trial income respectively are upheld.Replacement bicycle and heart rate monitor37     The defendant complained that the plaintiff had not mentioned the existence of a heart rate monitor in either of his AEICs, let alone that it had gone missing. However, two photographs in the plaintiff’s first AEIC do show a component of a heart rate monitor attached to the bicycle damaged in the accident.[note: 23]The defendant also criticises the plaintiff’s failure to produce an original receipt for the replacement bicycle. However, unless the defendant was alleging that the witness representing the retailer of the bicycle was mistaken or not telling the truth, there is no basis to doubt his evidence regarding the price the plaintiff would have paid.Conclusion38     Upon looking at the whole matter, I was of the opinion that the AR’s decision should not be interfered with. The appeal was dismissed with costs fixed at $6,000.00 plus reasonable disbursements.[note: 1]The Plaintiff’s Affidavit of Evidence in Chief (“AEIC”) dated 15 September 2009 at [2].[note: 2]Medical Report, Dr Peter Manning’s AEIC dated 23 November 2011.[note: 3]Notes of evidence of 5 March 2012 at pages 9 and 10.[note: 4]Medical Report, Dr Yue Wai Mun’s AEIC dated 14 November 2011.[note: 5]Surveillance report, Chew Chin Hun Alex’s AEIC dated 7 October 2010.[note: 6]Certification of Employment, Katherine Koh Choon Hwa’s AEIC dated 16 May 2011.[note: 7]Lau Kung Ngieng’s AEIC dated 11 July 2011 at [3].[note: 8]Lau Kung Ngieng’s AEIC dated 11 July 2011 at [3] and [4].[note: 9]Ibidat [7] and [9].[note: 10]Ibidat [6].[note: 11]Sng Teng Yeow Daniel’s AEIC; notes of evidence of 13 April 2012 at page 2.[note: 12]Medical Report, Dr Peter Manning’s AEIC dated 23 November 2011.[note: 13]Notes of evidence of 3 April 2012 at page 7.[note: 14]Notes of evidence 3 April 2012 at page 20.[note: 15]Medical Report, Dr James Lee Chong Hwa’s AEIC dated 29 December 2011.[note: 16]Medical Report, Dr Yue Wai Mun’s AEIC dated 14 November 2011.[note: 17]Notes of evidence 2 April 2012 at page 20.[note: 18]Medical Report, Dr Peter Lee Yew Chung’s AEIC dated 22 November 2011.[note: 19]Medical Report, Dr James Lee Chong Hwa’s AEIC dated 29 December 2011.[note: 20]Total number of surgeries conducted by the plaintiff’s peers, divided by the number of such peers: Certification of Employment, Katherine Koh Choon Hwa’s AEIC dated 16 May 2011, Lau Kung Ngieng’s AEIC dated 11 July 2011 at [6].[note: 21]Lau Kung Ngieng’s AEIC dated 11 July 2011 at [6].[note: 22]Notes of evidence 31 May 2012 at page 11.[note: 23]The Plaintiff’s AEIC dated 15 September 2009 at pages 67 and 68.",
        "Neck injury and aggravation of existing degenerative changes": "8       The defendant disputed the existence of any neck injury to the plaintiff on four main bases. First, the defendant noted that the plaintiff had not complained of any injury to his neck when he was at NUH for treatment and that Dr Manning had found no spinal tenderness at all. Second, the X-ray and MRI scan taken four days later and analysed by both Dr Yue and Dr Raymond Tan, a Senior Consultant at the Department of Diagnostic Radiology of SGH, disclosed no injury that could be attributed to the accident. The degenerative changes and loss of lordosis found in the plaintiff’s cervical spine were likely to have pre-existed the accident. Third, the medical reports in evidence which reported a neck injury were based on the plaintiff’s unverifiable assertions of pain and of having a limited range of motion in his neck. Finally, surveillance on the plaintiff conducted over 5 days in January and February 2010 showed him to be apparently untroubled by his injury.[note: 5]",
        "Loss of earnings": "30     The fact that doctors of Consultant rank and above have conducted less ENT surgeries in the years following the plaintiff’s accident may have contributed to the drop in the number of surgeries conducted by the plaintiff. However, this consideration was already taken into account by the AR, who quite appropriately accepted the plaintiff’s argument that his performance should be compared to that of his peers year to year. This is illustrated in the following table: YearAverage number of surgeries per doctor (excluding plaintiff)[note: 20]Number of surgeries conducted by the plaintiffPlaintiff’s surgeries as a percentage of the average20041,3101,501115%20051,2821,494117%20061,1851,329112%20071,1801,296110%20081,3191,348102%20091,01887986%20101,04077575%   31     It is immediately apparent that the number of surgeries conducted by the plaintiff has fallen relative to those of his peers. While he had previously out-performed his peers by a 17% margin, he was 25% lower than the average by 2010. Equally telling is the distribution of the plaintiff’s surgeries:[note: 21] Number of Surgeries Performed by the PlaintiffYearTable 1Table 2Table 3Table 4Table 5Table 6 and above20041,221691114654020051,198741254254120061,045701025457120071,046561014942220081,072601274244220096745896351602010575548040251   32     In SGH’s administrative nomenclature, Table 1 represents the least complex cases, with each successive table indicating cases of increasing complexity. As may be expected of the apparent redistribution of cases to more junior doctors and in keeping with the plaintiff’s increasing seniority, the plaintiff’s number of Table 1 surgeries has decreased markedly. However, contrary to what may reasonably be expected, the number of Table 5 surgeries conducted by the plaintiff has more than halved between 2004 and 2010 and he has made no headway at all with Table 6 surgeries. One would expect that with increasing experience and seniority come more complex cases. The plaintiff’s lack of progress in this regard is consistent with the fact that more complex surgeries take a longer time and he is more greatly hampered by his neck injury in longer surgeries. 33     The defendant correctly argued that plaintiff ought to have called his head of department and clinic manager to give evidence of his having declined surgeries and limited his consultations. Such evidence would have been of significant assistance to the court. However, notwithstanding this omission, I am of the opinion that the plaintiff has satisfied the burden of proof. It is undeniable that the plaintiff’s performance has suffered since the accident. The defendant’s argument that this was caused by a change in policy leading to the allocation of more surgeries to junior doctors has already been taken into account and the evidence does not suggest another explanation. 34     Furthermore, I am of the opinion that it is highly unlikely that the plaintiff would have contrived this marked decrease in performance in order to establish his claim for loss of earnings. Not only is his professional reputation at stake, his continued success in his field may be irreversibly undermined by a failure to gain surgical experience, particularly in complex matters. The acquisition of experience and skill being the constant endeavour of all professional men, this is a gambit that the plaintiff is particularly unlikely to have taken. It would also be inconsistent with the character of a person who was previously driven enough to outperform his peers. In this regard, the following observations of the AR are highly relevant:[note: 22] I would also note that I am not persuaded that the Plaintiff is a malingerer. He has come across as a honest and credible witness, and he can be seen to be a driven employee, as seen from his over performance (in terms of caseload) prior to the accident. I am not convinced that he would deliberately cut his caseload from 17% above average to 25% below average for purposes of claiming compensation in the present proceedings, especially when the loss in professional standing and future career development from such actions could have the potential of outweighing the monetary compensatory gains. 35     I agree with the AR’s reasoning. I would add that this is precisely the sort of finding that a judge in chambers hearing an appeal from an AR is ill-placed to contradict. The judge in chambers exercises confirmatory jurisdiction and his discretion is unfettered but in this respect he stands in no better a position than any court sitting in an appellate capacity. 36     For these reasons, I agreed with the AR’s finding that the plaintiff’s decrease in surgeries and consequent decrease in professional fees were the result of his neck injury. I also saw no reason to differ from the AR’s decision to award damages based on a multiplicand of $22,997.00. I note that this figure was proposed by the plaintiff and based on the difference between the average of his professional fees in the years of 2004 and 2005 on the one hand and 2009 and 2010 on the other. The plaintiff has been quite modest in seeking to recoup only the difference between what he previously earned and what he now earns under this aspect of his remuneration. As a Senior Consultant with more years of experience, it would be reasonable to suppose that his professional fees would now be higher than before the accident. He would have been entitled to claim this amount with the requisite proof. I also saw no reason to interfere with the multiplier applied by the AR or the discounts used to factor in the plaintiff’s pre-existing degenerative condition. Accordingly, the sums of $177,076.90 and $78,189.80 awarded for loss of future earnings and loss of pre-trial income respectively are upheld.",
        "Replacement bicycle and heart rate monitor": "37     The defendant complained that the plaintiff had not mentioned the existence of a heart rate monitor in either of his AEICs, let alone that it had gone missing. However, two photographs in the plaintiff’s first AEIC do show a component of a heart rate monitor attached to the bicycle damaged in the accident.[note: 23]The defendant also criticises the plaintiff’s failure to produce an original receipt for the replacement bicycle. However, unless the defendant was alleging that the witness representing the retailer of the bicycle was mistaken or not telling the truth, there is no basis to doubt his evidence regarding the price the plaintiff would have paid.",
        "The approach to take on appeal": "14     Counsel for the defendant prefaced his submissions at the hearing before me by suggesting that a judge in chambers hearing an appeal against an AR’s decision isin no waybound by that decision. This view is, with respect, based on a misconception that warrants clarification. 15     It is well established that a judge in chambers is not bound by an AR’s exercise ofdiscretion. InChang Ah Lek and others v Lim Ah Koon[1998] 3 SLR(R) 551, a case concerning an assessment of damages, the Court of Appeal approved the House of Lords decision inEvans v Bartlam[1937] AC 473, holding that registrars are not trial judges and that an appeal from the registrar to a judge in chambers is not an appeal in the true sense of an appeal from the judge in chambers or a judge sitting in open court to the Court of Appeal (at [14] to [20]). The observation that the judge in chambers deals with an appeal from the registrar “as though the matter came before him for the first time” was also approved. It is for this reason that fresh evidence can be adduced before the judge in chambers, unrestricted by theLadd v Marshallconditions that apply to an appeal before the Court of Appeal in respect of a judgment given on the merits (although the approach taken is less liberal where assessment of damages is concerned:Lassiter Ann Masters v To Keng Lam (alias Toh Jeanette)[2004] 2 SLR(R) 392 at [19] to [26]). 16     The basis for this approach was elucidated by Chan Sek Keong J (as the Honourable Chief Justice then was) in the oft-cited case ofHerbs and Spices Trading Post Pte Ltd v Deo Silver (Pte) Ltd[1990] 2 SLR(R) 685. It was explained there that the judge in chambers hearing an appeal against an AR’s decision is not exercising appellate jurisdiction but is instead exercising a form of confirmatory jurisdiction (at [11] and [12]). This is because the AR only exercises substituted and not primary jurisdiction; the judge in chambers is therefore not bound by the exercise by the AR of what is in reality his discretion. 17     As evidence is adduced by way of affidavit in interlocutory matters heard in chambers, a judge hearing an appeal against an AR’s decision faces no practical difficulty in rehearing the matter afresh. However in cases such as the present which involve an assessment of damages, proceedings before the AR take on the nature of a trial and the AR the nature of a trial judge. As Judith Prakash J observed inAng Leng Hock v Leo Ee Ah[2004] 2 SLR(R) 361 at [15], an appeal against an AR’s award of damages is an appeal: that is against a final decision, albeit by a registrar, which has been taken after a full trial on the merits in that discovery has taken place, documents and affidavits of evidence-in-chief have been filed,viva voceevidence has been given and the parties have had the opportunity of cross-examining each other’s witnesses. ... The assessment hearing has all the characteristics of a trial. In procedure there is no distinction between that hearing and the hearing of a trial before a judge. 18     It is appropriate to remind ourselves of why appellate courts are reluctant to reverse findings of fact in courts below. InPeh Eng Leng v Pek Eng Leong[1996] 1 SLR(R) 939, the Court of Appeal approved the following passage from the House of Lords decision inClarks v Edinburgh & District Tramways Co Ltd(1919) SC (HL) 35: When a judge hears and sees witnesses and makes a conclusion or inference with regard to what is the weight on balance of their evidence, that judgment is entitled to great respect, and that quite irrespective of whether the judge makes any observation with regard to credibility or not. I can of course quite understand a Court of Appeal that says that it will not interfere in a case in which the judge has announced as part of his judgment that he believes one set of witnesses, having seen them and heard them, and does not believe another. But that is not the ordinary case of a cause in a court of justice. In courts of justice in the ordinary case things are much more evenly divided; witnesses without any conscious bias towards a conclusion may have in their demeanour, in their manner, in their hesitation, in the nuance of their expressions, in even the turns of the eyelid, left an impression upon the man who saw and heard them which can never be reproduced in the printed page. What in such circumstances, thus psychologically put, is the duty of the appellate court? In my opinion, the duty of an appellate court in these circumstances is for each judge of it to put to himself, as I now do in this case, the question, Am I - who sit here without those advantages, sometimes broad and sometimes subtle, which are the privilege of the judge who heard and tried the case - in a position, not having those privileges, to come to a clear conclusion that the judge who had them was plainly wrong? If I cannot be satisfied in my own mind that the judge with those privileges was plainly wrong, then it appears to me to be my duty to defer to his judgment. 19     It is immediately apparent that these concerns are equally applicable to a judge in chambers hearing an appeal from an AR’s assessment of damages. As already noted, the rehearing of a matter afresh by a judge in chambers does not usually have occasion to interact with the customary deference an appellate court has for the trial judge’s findings of fact as the evidence before the court is of a documentary nature. However, it should be noted for clarity that any apparent inconsistency between these considerations when they do apply in an appeal from an assessment of damages is in fact illusory. Each consideration has a different field of application. This will be recognised once the exercise of discretion is distinguished from the factual determination upon which it is exercised. When coming to a decision, the AR must first make findings of fact and then exercise his discretion based on those findings. The fresh exercise of discretion by a judge in chambers is in turn dependent on the AR’s findings of fact on the oral as well as documentary evidence, and in this regard he suffers the same disadvantage as an appellate court in relation to a trial judge. This understanding is borne out by the cases inasmuch as only discretion, and not findings of fact, are said to be unfettered. InSie Choon Poh (trading as Image Galaxy) v Amara Hotel Properties Pte Ltd[2008] 2 SLR(R) 1076, Andrew Ang J noted: It is settled law that a judge in chambers hearing an appeal from a decision of the AR exercises a confirmatory jurisdiction. The judge deals with the matter as though it came before him for the first time and is entitled to exercise an unfettered discretion of his own: per Chan Sek Keong J (obiter) inHerbs and Spices Trading Post Pte Ltd v Deo Silver (Pte) Ltd[1990] 2 SLR(R) 685 at [12] affirmed by the Court of Appeal inAugustine Zacharia Norman v Goh Siam Yong[1992] 1 SLR(R) 746. Nevertheless, unless there are grounds upon which he differs from the AR, he should be slow to disturb the AR's findings, particularly where the AR's decision involved an examination of witnesses. Due weight should be given to the decision of the AR:Evans v Bartlam[1937] AC 473 followed by the Court of Appeal in Chang Ah Lek v Lim Ah Koon [1998] 3 SLR(R) 551. 20     I note for completeness that the discretion of the judge in chambers would be properly exercised even if the judge wholly adopts the AR’s reasoning (see Jeffrey Pinsler,Singapore Court Practice 2009, LexisNexis 2009 at 56/1/4).",
        "The decision of the court": "",
        "The existence of a neck injury": "21     The arguments made by the defendant against the existence of a neck injury were summarised above. I found each of these arguments readily met on the evidence. First, while the plaintiff did not complain of any neck injury when he was treated at NUH immediately after the accident and no evidence of such an injury was found on examination, Dr Manning stated in his report that the plaintiff “told me that he planned to cancel his operating list at SGH on 16/1/2006 due to the anticipated aches and pains that would almost certainly arise by then”.[note: 12]It appears taken for granted by both doctors that aches and pains not immediately apparent after an accident would arise later. When cross-examined, Dr Manning explained the concept of a distracting injury, where pain from an obviously injured area can distract the patient from complaining of milder pain in other areas.[note: 13]It bears noting that the plaintiff sought treatment for the neck injury just 4 days later. 22     Second, the fact that the X-ray and MRI scan taken on 19 January 2006 did not disclose any evidence of a neck injury is inconclusive. The doctors who gave evidence in this case stated that it is possible for an MRI scan to fail to detect an injury. Most tellingly, Dr James Lee, a Consultant Orthopaedic Surgeon in private practice who examined the plaintiff and gave evidence on his behalf, said in cross-examination that “we do know from the literature that up to 30 to 40% of MRIs can miss or not show any of these changes, subtle changes, as a result of [hyperextension, hyperflexion or an axial mechanism] to the neck”.[note: 14]Dr Lee had separately opined in a medical report that the plaintiff’s neck is likely to have experienced one of these mechanisms in the accident.[note: 15]Such a high failure rate should not be overlooked. 23     Third, although the medical reports favourable to the plaintiff’s case were based on the plaintiff’s own unverifiable assertions of pain and limited range of motion, these reports should not be understood to be equivocal or inconclusive. Indeed, the doctors made firm and confident findings based on the exercise of their professional judgment that the plaintiff had suffered an injury to his neck. For example, in Dr Yue’s report dated 26 February 2011, he noted of the first consultation on 19 January 2006:[note: 16] On examination during his first consultation, he had a full range of neck motion but his spinal rhythm was abnormal. There was pain on extension and rotation, especially to the right. He was tender in the left trapezius muscle. ... Overall, the accident has severely exacerbated a pre-existing degenerative condition of Dr Lau’s cervical spine. The impact of the accident was significant as it resulted in both his helmet and the car’s windscreen suffering significant damage. He did not suffer from neck pain before. Now he has neck pain that interferes with his occupation as an ENT surgeon. 24     Dr Yue was not just repeating the plaintiff’s complaints. It is clear from the language used that he was exercising his professional judgment in reporting what he found to be the plaintiff’s medical condition at the time of the consultation. This is confirmed by Dr Yue’s oral evidence:[note: 17] Q    In cases like this where compensation is an issue, you are not really able to diagnose any injury unless you rely on face value the history and complaints? A    His physical examination is not entirely normal as well. He has abnormal spinal rhythm and tenderness over the left trapezius muscle. Q    You agree earlier on that these issues are patient-subjective as well? A    Correct. You have to judge at different points of time whether someone was pretending to have pain. If he was normal at the time he first saw me, and then the complaint arose at the time when he saw me for the report, it would have aroused my suspicion. The first consultation was 4-5 days after the accident, there is less reason for me to suspect that he is suffering when he is not. 25     Dr Yue was equally emphatic in defending his finding that the pre-existing degenerative condition affecting the plaintiff’s cervical spine was exacerbated by the accident: Q    ... On what grounds did you come to the conclusion that the accident had severely exacerbated the pre-existing degenerative condition of his cervical spine? A    Degenerative changes occur in everyone. 40% of persons over 40 years old, on MRI, we might see degenerative changes. In the majority of people, they do not have any symptoms. What I have is the history of a quite significant accident of great impact and Dr Lau complaining of pain after that and on examination, whether subjective or not, he appears to be in discomfort, this has led to a reduction in his work capacity. With these, I came to the conclusion that while he has a pre-existing degenerative condition, the accident did exacerbate his condition physically, if not from the imaging studies. 26     Even the defendant’s witness, Dr Peter Lee, an Orthopaedic Consultant in private practice, came to similar conclusions. Dr Peter Lee noted in his report produced on the defendant’s behalf that:[note: 18] David has residual chronic neck and right upper limb discomfort which is likely to remain permanently. Although he is still able to perform his vocation as an ENT surgeon, he has not been able to performed (sic) surgery of long duration due to his neck symptom. David is likely to require periodic oral medication and physiotherapy for his symptom. 27     Dr James Lee came to similar conclusions as Dr Yue and Dr Peter Lee.[note: 19]It would take weighty evidence indeed to rebut independent findings by three doctors who are specialists in the relevant field that the plaintiff did suffer a neck injury. None was supplied by the defendant. It is also relevant that both Dr Yue and Dr James Lee gave evidence before the AR, who found no reason to doubt their testimony. 28     As for the surveillance report: the plaintiff’s apparent ability to go about his daily activities unimpeded by a neck injury is not a weighty consideration given that the surveillance was conducted some 4 years after the accident. By this time, the plaintiff could be expected to have recovered substantially. Nor was it the plaintiff’s case that he had been severely injured or that he remains significantly incapacitated. The damages claimed for loss of earnings under the next head of claim are not insignificant but they are not premised on a severe injury and are instead due to the nature of the plaintiff’s work. 29     I therefore found the defendant’s arguments not borne out by the evidence. Instead, the evidence supports the conclusion that the plaintiff did sustain a neck injury. Accordingly, I found no reason to differ with the AR’s findings of fact or his decision to award the plaintiff $20,000 as damages for the neck injury and aggravation of the pre-existing degenerative condition.",
        "Conclusion": "38     Upon looking at the whole matter, I was of the opinion that the AR’s decision should not be interfered with. The appeal was dismissed with costs fixed at $6,000.00 plus reasonable disbursements.  [note: 1]The Plaintiff’s Affidavit of Evidence in Chief (“AEIC”) dated 15 September 2009 at [2]. [note: 2]Medical Report, Dr Peter Manning’s AEIC dated 23 November 2011. [note: 3]Notes of evidence of 5 March 2012 at pages 9 and 10. [note: 4]Medical Report, Dr Yue Wai Mun’s AEIC dated 14 November 2011. [note: 5]Surveillance report, Chew Chin Hun Alex’s AEIC dated 7 October 2010. [note: 6]Certification of Employment, Katherine Koh Choon Hwa’s AEIC dated 16 May 2011. [note: 7]Lau Kung Ngieng’s AEIC dated 11 July 2011 at [3]. [note: 8]Lau Kung Ngieng’s AEIC dated 11 July 2011 at [3] and [4]. [note: 9]Ibidat [7] and [9]. [note: 10]Ibidat [6]. [note: 11]Sng Teng Yeow Daniel’s AEIC; notes of evidence of 13 April 2012 at page 2. [note: 12]Medical Report, Dr Peter Manning’s AEIC dated 23 November 2011. [note: 13]Notes of evidence of 3 April 2012 at page 7. [note: 14]Notes of evidence 3 April 2012 at page 20. [note: 15]Medical Report, Dr James Lee Chong Hwa’s AEIC dated 29 December 2011. [note: 16]Medical Report, Dr Yue Wai Mun’s AEIC dated 14 November 2011. [note: 17]Notes of evidence 2 April 2012 at page 20. [note: 18]Medical Report, Dr Peter Lee Yew Chung’s AEIC dated 22 November 2011. [note: 19]Medical Report, Dr James Lee Chong Hwa’s AEIC dated 29 December 2011. [note: 20]Total number of surgeries conducted by the plaintiff’s peers, divided by the number of such peers: Certification of Employment, Katherine Koh Choon Hwa’s AEIC dated 16 May 2011, Lau Kung Ngieng’s AEIC dated 11 July 2011 at [6]. [note: 21]Lau Kung Ngieng’s AEIC dated 11 July 2011 at [6]. [note: 22]Notes of evidence 31 May 2012 at page 11. [note: 23]The Plaintiff’s AEIC dated 15 September 2009 at pages 67 and 68."
    }
}