{
    "case_title": "Deutsche Bank AG\n      v\n      Chang Tse Wen",
    "ncitation": "[2012] SGHC 248",
    "coram": "Philip Pillai J",
    "sections": {
        "Introduction": "1       This action raises two questions of law relating to private banking: (i) under what circumstances may private banks acquire pre-contractual legal duties to prospective clients and (ii) how do subsequently signed banking documents affect such earlier acquired legal duties. This case turns on its particular unusual facts which will be set out at length in this judgment. In the light of this, I will summarise the facts pertaining to the parties, main events and claims to bring the two questions of law into sharper focus. 2       The plaintiff, Deutsche Bank AG (“DB”), filed the original claim against the defendant, Dr Chang Tse Wen (“Dr Chang”), for repayment of US$ 1,788,855.41 (with interest) outstanding from his private wealth management account with DB’s Singapore branch. The defendant counterclaims for damages arising from actionable misrepresentation, fraudulent misrepresentation, breach of a duty of care and breach of fiduciary duty against DB and DB’s relationship manager, Mr Wan Fan Ting, (whom I shall refer to hereafter as “Mr Wan” with respect to events prior to 15 March 2007 and thereafter as “the RM”) as the first and second defendant respectively. DB and the RM deny Dr Chang’s counterclaims. They further rely on the banking documents (specifically, the non-reliance, own-judgment, non-advisory clauses in these documents) to operate as evidential or contractual estoppels that prevent Dr Chang from establishing the necessary legal elements of his claims. 3       Dr Chang’s claims are founded on his averment that the RM and DB undertook to advise him to manage his new wealth. They failed to do this. They later sold him 32 derivative products within three weeks and two more thereafter, all of which led him to lose about US$49 million. 4       In December 2006, Dr Chang, accompanied by Professor Carmay Lim Siow Chiow (“Prof Lim”), first met Mr Wan, when Mr Wan was then the Priority Banking Manager of Standard Chartered Bank, Hong Kong (“StanChart HK”). Both Dr Chang and Prof Lim were research scientists. Mr Wan came to learn then that Dr Chang was to come into considerable new wealth from the sale of his shares in Tanox Inc., a NASDAQ-traded drug development company a corporation of which he was co-founder. At this meeting, Prof Lim gave Mr Wan her contact and email details. 5       In January 2007, Mr Wan left StanChart HK to join DB’s Hong Kong Private Wealth Management Services (“PWMS”) unit as a relationship manager. In February 2007, in his capacity as DB’s RM, Mr Wan contacted Prof Lim, asking to meet up with her and Dr Chang. On 15 March 2007, the RM met Prof Lim and Dr Chang in Taipei (“the 15 March 2007 meeting”) to persuade each of them to open private banking accounts with DB. The RM had, prior to this meeting, learnt about an announced tender offer to purchase Tanox Inc. shares at US$20 per share. 6       At this second meeting, the RM made a presentation to Prof Lim and Dr Chang on the range of services that DB could provide each of them and separately recorded their respective investment experience and needs. Prof Lim signed an account application form immediately whereas Dr Chang, when invited to sign an account application form too, told the RM that he would appoint DB to advise him on managing his new wealth and would sign the form when he received his share sale proceeds. 7       Just before receiving his share sale proceeds, Dr Chang informed the RM that he was ready to sign the account application form, which he did which was 1 August 2007. He followed up by depositing a portion of his cash receipts with DB. Prior to this, Dr Chang had sought and received advice from the RM on how to effect the transfer of his Tanox Inc. founder shares. 8       On 19 November 2007, Dr Chang purchased a Citigroup Discount Share Purchase Program (“DSPP”) from DB and signed the DSPP documents. DB unilaterally extended and applied margin financing to Dr Chang for this and all his DSPP purchases thereafter. Between 19 November and 12 December 2007, within a span of 23 days, Dr Chang purchased 32 DSPPs on the RM’s advice and 2 more DSPPs in February 2008. 9       By 18 December 2007, he started receiving margin calls from DB. On 7 March 2008, Dr Chang learnt from DB for the first time that he had an exposure of US$76 million. In November 2008, Dr Chang unwound his open DSPPs and DB exercised its contractual termination and security rights against Dr Chang’s accumulated shares. Dr Chang claims to have suffered a total loss of about US$49 million from the 34 DSPP transactions. 10     It is Dr Chang’s case that the RM and DB misrepresented the nature of the services they would provide him; that they assumed a duty of care to use reasonable care to advise him on managing his new wealth which they, in these circumstances, failed to do; and finally that they assumed a fiduciary obligation to him which they, in these circumstances, breached.",
        "Facts": "11     As the unusual facts of this action are critical in determining the outcome of this action, I shall first set out the material events in evidence as they unfolded chronologically in relation to the banking documents’ terms and conditions signed by Dr Chang under the following broad headings: (a)     the events that occurred before the Service Agreement dated 1 August 2007 (“Part I—The Pre-Service Agreement Events”); (b)     the Service Agreement dated 1 August 2007 (“Part II—The Service Agreement”); (c)     the Derivative Agreement dated 23 November 2007 and the DSPP purchases (“Part III—The Derivative Agreement”); and (d)     the termination events (“Part IV—The Termination Events”).",
        "Part I: The Pre-Service Agreement Events": "12     This part of the narrative describes how Dr Chang first came to meet Mr Wan in Hong Kong on 28 December 2006 and leading up to the 15 March 2007 meeting in Taipei. The meeting in Hong Kong on 28 December 2006 13     Prof Lim, accompanied by Dr Chang, visited StanChart HK on 28 December 2006 to enquire whether her account had been credited with the sale proceeds of her father’s gift of shares to her. They met Mr Wan, who was StanChart’s priority banking manager then, for the first time. Wishing to open a personal new account, Dr Chang signed a StanChart HK account opening form which Mr Wan gave him. Mr Wan informed him that the bank required independent documentary confirmation of his address. Dr Chang returned subsequently and gave Mr Wan a faxed copy of his Fidelity account statement which contained his address. This statement contained other information which revealed that Dr Chang owned Tanox Inc., last valued at an estimated US$50 million. According to Dr Chang, Mr Wan looked visibly surprised when he noticed this information. Prof Lim thereupon informed Mr Wan that Dr Chang was co-founder of Tanox Inc., which was soon to be acquired by Genentech Inc., a major US bio-engineering corporation. 14     At the trial, Mr Wan claimed that he became aware that Dr Chang was the co-founder and substantial shareholder of Tanox Inc. only at the 15 March 2007 meeting. He then admitted that when they first met in Hong Kong, Prof Lim informed him that Dr Chang “was going to receive some money soon and wished to invest such money upon receipt”. I find Mr Wan to be an evasive and unreliable witness. In court, he admitted initially that he had seen Dr Chang’s Fidelity account statement at StanChart HK, but that the statement had been unclear. He then changed his position, claiming that he could not recall if he had even received the Fidelity account statement. He later clarified that he was under the impression from the first meeting that Dr Chang was worth at least US$5 million. He finally admitted under cross-examination that he knew Dr Chang’s net worth was at least about US$26 million from his StanChart HK days. This was just one of several instances in which Mr Wan prevaricated in court and was obliged to resile from his initial evidence as the following narrative will reveal. 15     In the course of their first meeting in Hong Kong, Prof Lim wrote and gave Mr Wan her contact details. She explained in court that this was for him to notify her when her own share sale proceeds were received in her StanChart HK account and also to facilitate the opening of Dr Chang’s new StanChart HK account. I accepted her explanation and disbelieved Mr Wan’s explanation that he had then informed them that he was leaving StanChart HK to join another bank and that Prof Lim had given him her contact details for him to contact her after he “settled down”. Given this was their first meeting and that she obtained no confirmation of the receipt of expected funds into her account, there is nothing to suggest that Prof Lim would have volunteered her personal contact details and invite him to contact her after he settled down in his new position at another bank. Furthermore, his explanation is not substantiated by the “cold-call” tone and content of his two subsequent emails to Prof Lim. His email to Prof Lim, dated 5 February 2007 and titled “Hello from Johnny Wan”, read: I would like to express my sincere apology to you and Mr. Chang because I left Standard Chartered Bank and have joined Deutsche Bank (Hong Kong) on Feb 2007. … ... I have 12 years experience in financial service industry and had been worked [sic] for Morgan Stanley, Charles Schwab and HSBC for years. I believe my experience and expertise can definitely add value to you. I will be in Taiwan at the month end andI truly appreciate the opportunity to meet with you and Mr. Chang.I am look [sic] forward to seeing you and Mr. Chang. [emphasis added] 16     His second email dated 5 March 2007 titled “Trip to Taipei” sent by him to Prof Lim, which Prof Lim forwarded to Dr Chang, read: My name is Johnny Wan and used to help you at Standard Chartered Bank. I will be in Taipei for business trip on March 14-15, 2007. I would like to stop by at your convenience. Please let me know. Thank you and look forward to meeting with you. 17     It was revealed in court that Dr Chang’s StanChart HK account was never opened and that Mr Wan had not followed up with Prof Lim at StanChart HK to update Prof Lim on the receipt of her expected funds. I find that Mr Wan had come to know that Dr Chang was soon to come into considerable wealth when he received Dr Chang’s Fidelity account statement while he was still at StanChart HK. I further find that Mr Wan had retained Prof Lim’s contact details for the purpose of contacting not only her, but, more importantly, Dr Chang with knowledge of his forthcoming wealth upon the sale of his Tanox Inc. shares. 18     I find that given the short time between their first meeting and his departure to join DB as a private banking relationship manager, Mr Wan retained this contact information for the purpose of using it in his new employment to prospect Dr Chang as a client. I find that Prof Lim was only an incidental but necessary contact and prospect, through whom Mr Wan sought to reach Dr Chang and persuade him to appoint him and DB as his private bankers. The meeting and presentation on 15 March 2007 19     The next meeting between the RM and Dr Chang took place on 15 March 2007 over lunch at a restaurant in Taipei. The RM gave Dr Chang and Prof Lim his new DB name card, which described him as an Assistant Vice-President of DB’s PWMS unit. Dr Chang testified that at this lunch, the RM told them that he knew then that Tanox Inc.’s shareholders had approved Genentech Inc.’s tender offer of US$20 per share. This had been reported in the financial media. The RM asked Dr Chang how much he would receive from the sale of his Tanox Inc. shares and was informed by Dr Chang that he expected to receive about US$118 million from this sale. 20     Over lunch, the RM gave Dr Chang and Prof Lim DB’s Private Wealth Management Brochure (“the Brochure”) whilst he himself used his laptop copy of the Brochure for his presentation (“the Presentation”). The Brochure itself is a promotional and non-contractual document. The Presentation variously described DB’s wealth planning services as “providing estate planning and wealth transfer planning solutions to target high net worth clients in Asia” and “providing customised investments and estate and wealth planning solutions to high net worth individuals”. The Presentation also stated that DB promised integrated solutions tailored to the “individual’s wealth protection, wealth enhancement and wealth distribution.” The RM highlighted DB’s experience, reputation, level of service and expertise in, as well as team approach to, private wealth management. 21     After the Presentation, Dr Chang told the RM that he was impressed with the Presentation and “[i]n particular ... the emphasis on the building of trust with the client and the team approach in managing the client’s wealth and investments appealed to me greatly and I could relate to it”. 22     The RM then asked Prof Lim before asking Dr Chang individually if each of them would open an account with DB. The RM first asked Prof Lim a series of questions and he recorded her financial background, investment experience and objectives. It is not disputed that Prof Lim received, signed and returned a detached account application form to the RM and received a copy of DB’s Service Agreement (“Service Agreement”). The account application form expressly refers to and incorporates the terms of the Service Agreement to accounts, services and transactions with DB. The RM similarly asked and recorded the same information from Dr Chang. However, when the RM proffered the account application form to Dr Chang for signature, Dr Chang told him that he would retain the RM and DB to advise him on managing his new wealth and would sign the form when he received his new wealth. The RM offered Dr Chang a copy of the Service Agreement which Dr Chang did not take. Later, just before Dr Chang received his new wealth, he did indeed ask for and signed the account application form dated 1 August 2007. 23     I find that from this meeting, the RM knew that Dr Chang was about to receive US$118 million and that he was looking for advice to manage,ie, “wealth preservation” and “wealth enhancement” in relation to this new wealth as he had informed the RM that he had limited investment experience and would not have the time to do this himself whilst continuing his academic and research work. The RM, acting fully within his authority as DB’s relationship manager, had represented to Dr Chang that he and DB were able to and would provide Dr Chang with customised investment, estate and wealth planning solutions. I find that at this meeting, the RM and DB assumed a duty of care to advise Dr Chang on managing his new wealth which, from the range of capabilities presented to him, would in these circumstances include advising him on wealth preservation, enhancement and investment solutions. Such solutions would necessarily entail prudential asset allocation, diversification and the documenting of his investment objectives and risk appetite, quite apart from proposing investment strategies to meet Dr Chang’s objectives as well as thereafter advising him on the risks of particular investments. 24     Apart from the Presentation, it transpired that Prof Lim had also asked the RM whether she might have sold her father’s gifted shares too early as the share price had risen thereafter. The RM told her that she could buy back the shares at a discount of about 15% to 20% and proceeded to explain how this could be achieved through purchasing DSPPs. According to Dr Chang, this was when the RM first introduced DSPPs to Prof Lim. The RM then explained to Prof Lim that a DSPP would allow her to buy and accumulate shares of publicly listed companies at a discount to their current market price. Prof Lim asked him why a seller would sell shares at a discount to market price and the RM explained that shares were sold through DSPPs at a fixed price lower than the current market price because of the uncertainty of the future underlying share price. This, he said, enabled the bank “to design better products for its customers”. As he explained the mathematics of a hypothetical DSPP, Prof Lim wrote notes on the back of her copy of the Service Agreement which the RM helpfully completed in his own hand. 25     The RM however had a different explanation of how the topic of DSPPs was raised. He said that it was Prof Lim who brought up DSPPs, as she told him that “she had heard about a financial product available in the market which was popular amongst investors in Hong Kong because it could be used to accumulate shares at a discount.” 26     I am unable to accept his explanation of the conversation. There is nothing in evidence which suggests that Prof Lim, known to the RM to be a research scientist, had any exposure beyond that regarding bank accounts and listed equity shares. When cross-examined, the RM sought to explain that Prof Lim had separately called him prior to the 15 March 2007 meeting to ask about this product, a new explanation that I find improbable. There is nothing in the stream of subsequent emails to her on DSPPs which evidences that she had herself any interest or understanding of this complex derivative product. I find that the RM introduced DSPPs to Prof Lim in response to her question as to whether she might have sold her father’s gifted shares too early. I find that the RM had taken her question as his opportunity to introduce and promote DSPPs to her. 27     This is an appropriate juncture at which to describe the DSPP product as it looms large over Dr Chang’s case against DB and the RM and accounts for the losses he incurred. 28     The DSPP is an instrument differently labelled by different banks and commonly referred to as an accumulator. A client purchaser of a DSPP contracts to buy from the bank a fixed number of reference shares per day at a fixed price discounted to current market price for the duration of one year. In the event that the market price of the reference share reaches a fixed ceiling, the DSPP is knocked-out meaning that the bank seller is no longer obliged to deliver shares at the agreed discounted price for the remaining duration of the DSPP. However should the market price of the reference share drop below the discounted DSPP share price, the purchaser remains obliged to purchase the reference shares for the one year duration of the DSPP. His only alternative is to terminate his DSPP by paying an unwinding fee. Banks who distribute DSPPs, enter into back-to-back transactions with the product originators at a lower price and sell marked up DSPPs to their clients as principal. Where DSPPs are unwound, the distributing bank also retains a mark up from what they pay to the product originators.",
        "Part II: The Service Agreement dated 1 August 2007": "29     I turn to the next milestone, namely Dr Chang’s signing of the account application form dated 1 August 2007. After Prof Lim signed her account application form on 15 March 2007 (dated 19 March 2007), the RM followed up by sending her several emails providing details about specific DSPPs between 24 April 2007 and 6 June 2007. On 7 June 2007, Prof Lim informed him by email copied to Dr Chang that Dr Chang would “act on [her] behalf”. Thereafter, the RM sent two emails dated 21 June 2007 and 26 June 2007 respectively relating to DSPPs to both Prof Lim and Dr Chang. 30     Sometime in July 2007, Dr Chang informed the RM that his Tanox Inc. shares sale was imminent and asked the RM to send him the necessary DB account application form for him to sign. Dr Chang signed and returned the account application form (dated 1 August 2007) which incorporated the Service Agreement in the following manner: I/We request you to open in my/our names an account or accounts, whether of a discretionary or advisory nature, including sub-current account(s), sub-deposit account(s), sub-custody account(s) and any other sub-accounts(s)).All accounts and businesswith you shall be governed by this application and Deutsche Bank Private Wealth Management Service Agreement (the “Service Agreement”).By signing this account application, ... I/We acknowledge receipt of a copy of the Service Agreement and I/we have read and understood its terms, as well as the ‘Risk Disclosure Statement’. [emphasis added in bold and italics; emphasis in original omitted] Service Agreement 31     I proceed next to summarise the content of the Service Agreement which has 3 sections: “General Business Terms and Conditions”, “Product Terms and Conditions” and “Risk Disclosure Statement”. General Business Terms and Conditions 32     This part of the Service Agreement sets out the terms relating to bank statements, hold all mail, regulatory exemptions, disclosure of potential conflict of interest, indemnity, set-off and security rights of DB, events of default, and remedies. In particular, there is a: (a)Negligence liability limitation clause Our responsibilities 1. We and our agents are not responsible for any loss you suffer except in the case of our gross negligence or wilful misconduct. In the case of gross negligence or wilful misconduct, our liability for any securities or other property is limited to the market value of such securities or property at the time of default. If you contribute to the loss, the extent to which parties shall bear the loss will be determined in accordance with the principles of contributory negligence. 33     Besides setting out the general responsibilities, this part of the Service Agreement also sets out the following disclaimers: (a)A non-fiduciary, non-advisory clause 7. We and our affiliates arenot acting as your fiduciaryor adviser in respect of any services provided to you or any contract with you,unless expressly agreed in writing. ... (b)Various own-judgment clauses (e)    [Y]ou have made your own decisions in relation to any transaction with us and as to whether any such transaction is appropriate for you ... (g)    [Y]ou understand and accept the terms and conditions and risks of any transactions with us. (c)A fee agreement clause Fees 1. We may charge you fees for any facility or service we provide to you, which may be charged without notice. We may remunerate or share fees with a third party for referring new business. (d)Various conflict disclosure clauses 1. [DB]may carry out transactions through or with affiliated parties even if a conflict of interest may arise. Parties affiliated with [DB] may be buying, selling, holding significant long or short positions, acting as investment and/or commercial bankers, engaging in market making or be represented on the board of the issuer of the securities represented in any of the investments that [DB] may make. [DB] may be dealing with affiliated parties or be buying, selling or investing in financial products, schemes or instruments that may be issued, operated, advised, managed or arranged by affiliated parties and as such [DB] may be subject to conflicts of interest. 2. [DB]may carry out transactions in which[it has]a direct or indirect material interest. [DB] may receive profit, commission or other benefit customarily charges or received in respect of any transaction with [the client] whether [it is] acting as principal or agent. [DB] need not disclose or account for any such profit, commission or other benefit to [the client]. [emphasis added] 34     In this judgment, I shall refer to the above clauses collectively as “the Service Agreement Disclaimers” and to them individually and correspondingly as the non-fiduciary clause, non-advisory clause, the own-judgment clause and the conflicts disclosure clauses, where appropriate. Product Terms and Conditions 35     The Product Terms and Conditions deal with the specific products and facilities, including investment services, custody services, fiduciary term deposits, discretionary management, credit, banking and foreign exchange facilities, dual currency investment and yield-enhanced security. Risk Disclosure Statement 36     The Service Agreement contained a generic Risk Disclosure Statement (“the Statement”) setting out the risks relating to the whole range of products that a client might potentially transact through the bank: margin transactions, stop loss orders, options risks, forward trading risks, swaps risk, pricing risks in relation to over-the-counter financial derivative transactions, exchange traded instruments and electronic trading risks, leveraging risks, currency, liquidity, credit and legal risks and hedge fund risks (collectively defined as “Transactions”). When a client transacts in products which carry the relevant risk, the Statement describes some of these risks. The Statement also advises the client to consult his own advisors and carefully consider whether the Transaction is appropriate for him. The Statement contains a representation that the client acknowledges that he has made his own assessment and relies on his own judgment (own-judgment clause) and accepts all risks. 37     The Statement further sets out the following clauses: (a)Conflicts clause When we undertake a Transaction for you, we or some other person connected with us may have a material interest, relationship or arrangement in Transaction and may be dealing as principal or as agent for the account of another customer. (b)Non-reliance clause We may (but need not) give advice or make recommendations. If we do so, such advice or recommendations are given and on the basis you will make your own assessment and rely on your own judgment. 38     In summary, the Service Agreement sets out the general business terms under which accounts are operated, the terms relating to specific products and facilities and a generic risk disclosure statement, all of which pertain to general retail banking services and relate to the bank’s role and responsibilities in executing the instructions of clients. 39     It is necessary to set banking general terms and conditions in their proper functional context in order to appreciate how they operate. The genesis of general banking terms and conditions lies in the practical business purpose and function: to simplify documentation and avoid requiring clients to sign additional documents each time a client operates, retains or transacts in generally available accounts, services or transactions with or through the bank. To this end, it is commonplace for banks to require clients to sign only one account application form which incorporates by reference all the general terms and conditions of general accounts, services or transactions that a client may normally undertake with the bank. A client may after signing the account application form operate, retain or transact any one or more of these general accounts, services and transactions without having to sign any further documents. When a client operates any particular account, service or transaction with or through the bank, he contractually activates the relevant terms and conditions relating to such particular account, service or transaction and he is bound by these alone. Conversely, where a client having signed the account application form, does not open or operate, retain or transact any further account, service or transaction with or through the bank, these general terms and conditions can have no overarching contractual effectin vacuoon the client. 40     Quite apart from the general banking services provided by banks the terms of which are set out in the general terms and conditions, banks do provide specialised accounts, services and products which require the client to sign separate service or transaction agreements. These separate agreements would ordinarily expressly either supplement or supersede the general terms and conditions. 41     Beyond general or specialised service or transaction agreements, banks may by conduct assume further legal obligations depending on the particular facts and circumstances: see foregHedley, Byrne & Co Ltd v Heller & Partners Ltd[1964] AC 465. 42     I accept the expert opinion of Lord Millett, Peter Julian (“Lord Millett”) on English law that the Service Agreement is concerned with the ordinary general services of a retail bank. The position under Singapore law is no different. If indeed on the facts the bank had undertaken to provide Dr Chang with specialised advisory services, the Service Agreement would have no application to such advisory services.",
        "DB’s Client Acceptance and Profile Report dated 3 August 2007": "43     As part of DB’s compliance with know-your-client regulations, the RM completed and submitted a DB’s Client Acceptance and Profile Report (“CAPR”) dated 3 August 2007 (“CAPR 3 August 2007”) for internal approval. I find some of the material information entered by the RM into this CAPR 3 August 2007 to be palpably fictitious. For example, under the heading “Details (type of business, employer, position, etc.)”, the RM described Dr Chang as “a customer of HSBC and I used to serve him since 2003”. 44     The above declaration to DB was clearly false as it is in evidence and undisputed that Dr Chang and Prof Lim first met the RM on 26 December 2006 at StanChart HK. The RM was obliged to admit under cross-examination that the declarations he made in the CAPR 3 August 2007 were not true: Mr Pillai:... Do you confirm that that sentence has two untruths: (a) Dr Chang was never a customer of HSBC. Do you agree with that?A:I agree.Q:And (b), you did not serve him since 2003?A:Agree.   45     The RM also admitted under cross-examination that his declaration in the CAPR 3 August 2007 that “Initial Source of Funds: Initial USD 2M will come from Citibank Taiwan. Some other assets will transfer from Standard Chartered Bank” were assumptions made by him which he “casually believe[d].” The RM admitted that he had no knowledge or information regarding whether or not Dr Chang had any account or assets in Standard Chartered Bank or whether Dr Chang had a Citibank Taiwan account. When questioned on his basis for recording Dr Chang’s salary as “USD350,000 per year” (which Dr Chang denied), the RM stated that this was his recollection from Dr Chang’s completed StanChart HK account opening form. I do not accept his explanation, given his earlier disavowals and shifting admissions relating to his knowledge of the contents of Dr Chang’s Fidelity account statement. None of his explanations alter the conclusion that his CAPR 3 August 2007 entries were materially fabricated to obtain DB’s internal approval to open this account. 46     On 30 August 2007, Dr Chang deposited about US$26 million with DB, and this was placed in time deposits, dual currency time deposits and bonds. The RM would contact Dr Chang to introduce and give suggestions on appropriate deposits or bonds, and, according to Dr Chang, he “usually purchased the particular time deposit or bond based on [the RM]’s recommendation since [he] trusted [the RM]”. With respect to the execution-only services relating to deposits and bonds, the relevant Service Agreement terms and conditions would operate to define the bank’s obligations to Dr Chang. 47     It is noteworthy that up to this time, the RM and DB had not reverted to Dr Chang regarding what advisory services within the range of DB’s suite of advisory, fiduciary and other services they would offer him and what specialised service agreements he would have to sign with DB.",
        "Part III: The Derivative Agreement dated 23 November 2007": "48     I next turn to set out the circumstances surrounding Dr Chang’s signature of DB’s Master Agreement for Foreign Exchange Trading and Derivatives Transactions dated 23 November 2007 (“the Derivative Agreement”), which included a Risk Disclosure Statement (Foreign Exchange and Derivative Transactions). DB relies on the operation of the Derivative Agreement as evidential or contractual estoppels to exclude Dr Chang’s claim in misrepresentation, as well as the duty of care and fiduciary obligation owed by the RM and DB to Dr Chang. 49     The RM insisted in court that Dr Chang had signed the Derivative Agreement before Dr Chang made his first DSPP purchase on 19 November 2007, notwithstanding that the Derivative Agreement was dated 23 November 2007. I will consider the evidence more fully in [66]–[74] below. 50     The Derivative Agreement was the only specific product agreement signed by Dr Chang. The Derivative Agreement contained the following disclaimers (hereinafter be referred to as “the Derivative Disclaimers”): (a)The no-representation disclaimer 3.REPRESENTATIONS The Counterparty represents to the Bank ... that: … (h) it is not entering into this Agreement or Transactions in reliance on any representations made to it by the Bank; (b)The non-reliance disclaimer 12.RELATIONSHIP BETWEEN THE PARTIES: Each party will be deemed to represent to the other party ... that ... : (a)Non-Reliance. It is acting for its own account, and that it has made its own independent decisions to enter into that Transaction and as to whether that Transaction is appropriate or proper for it based upon its own judgment and upon such advisers as it has deemed necessary.It is not relying on any communication (written or oral) of the other party as investment advice or as a recommendation to enter into that Transaction; it being understood that information and explanation related to the terms and conditions of a Transaction shall not be considered investment advice or a recommendation to enter into that Transaction. No communication (written or oral) received from the other party shall be deemed to be an assurance or guarantee as to the expected results of that Transaction; (c)The own-judgment disclaimer (b)Assessment and Understanding. It is capable of assessing the merits of and understanding (on its own behalf or through independent professional advice), and understands and accepts the terms, conditions and risks of that Transaction. It is also capable of assuming, and assumes, the risks of that Transaction; (d)The non-fiduciary, non-advisory disclaimer (c)Status of Parties. The other party is not acting as fiduciary or an adviser to it in respect of that Transaction; … (e)The no-representation disclaimer (h) [he] is not entering into this Agreement or Transactions in reliance on any representations made to [him] by [DB] [emphasis added in bold italics; emphasis in bold in original] 51     There was also the following clause in the Derivative Agreement: 13.11 Other terms and conditions to apply. To the extent relevant, the Service Agreement shall also apply to any Transactions between the Bank and the Counterparty. In the event of any inconsistency between this Agreement and the Service Agreement, this Agreement shall prevail with respect to any Transactions. 52     For completeness I should add that DB would send Dr Chang a confirmation term sheet containing the principal pricing, duration and customised terms of each derivative product transaction. These confirmation term sheets are based on the International Swaps and Derivatives Association, Inc form (“the ISDA form”). The Derivative Agreement, together with the confirmation term sheet, contains the bilateral terms and conditions applicable to each product sold by DB to Dr Chang. 53     The scope and function of the ISDA form is explained in Philip Wood,Set-off and Netting, Derivatives, Clearing Systems(Sweet & Maxwell, 2nd Ed, 2007) (“Philip Wood”) at para 12-005: The idea of the ISDA form is to settle the common terms likely to apply to most transactions and to leave the terms of particular deals to be settled individually in contracts entered into on each occasion and evidenced by “confirmations agreed by the parties …” it has equivalents of representations, covenants, events of default and the usual boiler-plate bespeaking its origins. The actual terms of each deal are contained elsewhere (in the confirmations) so that the master is the skeleton not the body, that the clauses are reciprocal,egthe events of default apply to both parties, and that, since it covers a multitude of contracts between the parties, set-off and netting to reduce exposures are a central preoccupation. 54     The ISDA form is designed to preserve the integrity of the derivative product and enable bilateral terms to be set out with respect to each leg of a derivative transaction,iethe terms and conditions between the product originator and the financial institution distributor as well as the terms and conditions between the financial institution distributor and its client counterparty. The ISDA form and in turn the Derivative Disclaimers are not designed or intended to exclude the financial institution distributor’s liability to its counterparty client where such liability arises apart from the product or the product transaction itself but independently from pre-existing or co-existing legal duties that might exist. As explained further inPhilip Woodat para 13-012: A derivatives trader may incur legal liability if it has duties as adviser to its customer e.g. because the trader holds itself out as advising the customer. There may be a duty under the law of agency, contract or tort, but it depends on the facts. There may also be legal liability if a trader misrepresented the market or benefits or documentation to the customer, who relied on the misrepresentation. Consider the general law of misrepresentation in contract and tort, especially whether a forecast can be misrepresentation. Banks can be liable for negligent misrepresentation: see Hedley Byrne v Heller & Partners [1964] AC 465 (negligent credit reference). The general rule is that banks are under no duty to advise on the prudence of a transaction from the customer’s point of view, unless the bank clearly undertook to advise the customer. The standard bank documents usually expressly provide that the bank does not have a duty to advise customers on the prudence of a transaction. 55     Lord Millett’s English law expert opinion, which I accept, is consistent with the above account and also reflects the position under Singapore law. Lord Millett opines that the Derivative Disclaimers are designed to shift the commercial risk of the financial loss of a transaction from the bank which acts as a counterparty to the client. They are not designed for use by banks in their quite independent capacity as investment advisers to immunise them from suits by their clients arising under such advisory capacity. 56     The Derivative Disclaimers accordingly have no direct effect on Dr Chang’s claims based on misrepresentation, duty of care or fiduciary obligations which arose prior to the Derivative Agreement. Dr Chang’s claims are not founded on disclaiming any of the DSPP purchases on grounds that the product or transactions themselves were misrepresented to him. Dr Chang is also not disclaiming any DSPP purchase on the basis of DB’s advice with respect to any particular DSPP. His claims against the RM and DB are founded on misrepresentations as to the nature of the advisory services they would provide him, and the independent duty of care and fiduciary obligation they had previously assumed to advise him in managing his new wealth. 57     Dr Chang, who made his first DSPP purchase on 19 November 2007 and signed the Derivative Agreement dated 23 November 2007, was unilaterally extended unsolicited margin facilities through DB’s letter dated 28 November 2007 for US$10 million, which provided that Dr Chang was “deemed conclusively to have accepted the terms set out in this letter if you do not object to its contents within 14 days from the date of this letter or if you make use of the Facility set out herein, whichever is the earlier.” Dr Chang did not request for margin trading facilities. The RM had unilaterally applied for DB’s margin trading facility to be extended to him. The RM unilaterally applied DB’s Margin Trading Facility to pay for Dr Chang’s DSPP purchases. This application, according to the terms of the letter itself, automatically triggered Dr Chang’s agreement. 58     The US$10 million margin trading facility was subsequently increased to US$25 million by a similarly worded letter of 28 November 2007 and further to US$35 million by a similarly worded letter dated 10 March 2008. The RM explained that even though it was not requested by Dr Chang, the margin facility was successively unilaterally increased “because Dr Chang continuously to enter [sic] into DSPP”. 59     Significantly, prior to the granting of a margin facility, the RM is obliged to obtain DB’s prior approval by completing a Margin Trading Checklist. The RM did complete a Margin Trading Checklist dated 19 November 2007, which was approved by DB on 20 November 2007. Curiously, the earlier CAPR 3 August 2007 sets out Dr Chang’s investment and risk profile as follows: “Low experience” in IPOs, FX trading, Derivatives/structured products, Fiduciary services, Alternative Investment and Others; “Medium experience” in bonds, stocks and managed portfolios, and Dr Chang’s investment return expectation as “balanced” which is defined to mean an investor who is prepared to accept risk of infrequent and modest losses and who seeks total return both from income and capital appreciation. 60     However, the RM’s subsequent Margin Trading Checklist 19 November 2007 entries made by him now painted a markedly different profile: Client has more than 20 years of experience in blue-chip stocks and experience. He understands structure products such as ROCA and DSPP. He is well aware the risk involves in those products such as losing of principle and commitment of time. Furthermore, he is only interested in blue chips such as US stock such as Citibank and General Electric and seldom involved in any speculative shares ... [the RM] explained the features of both DSPP and ROCA and Dr Chang had understood the risks with regards to market volatility and liquidity; Dr Chang had been trading in Derivative Markets for 15 years in “Standard Chartered Bank, Citibank”; Dr Chang understood the concept of margin trading and will top up upon margin calls; Dr Chang’s net asset value was close to US $135 million; “What expected added value will the Bank receive from this Client”?”, “Profitable Trades”; Dr Chang’s risk appetite: “Medium to High Risk (35 Millions USD” with an investment strategy of a “buy-and-hold strategy by identifying blue chip depressed shares and using DSPP or ROCA to accumulate those shares and invest for the long haul. 61     The later Margin Trading Checklist of 19 November 2007 unavoidably alludes to the Citigroup DSPP purchase on 19 November 2007 but paints a different profile. In the first CAPR 3 August 2007, the RM had recorded that Dr Chang had “low experience” in structured products, but in the later Margin Trading Checklist 19 November 2007, the RM records Dr Chang as having had 15 years of experience in derivative transactions in “Standard Chartered Bank, Citibank.” 62     When questioned, the RM explained that during a short meeting on 22 August 2007 with Dr Chang to sign follow-up bank documents, Dr Chang told him that he had traded options in the United States. I do not accept his contrived explanation, bearing in mind that this follow-up meeting had been a short meeting for Prof Lim and Dr Chang to sign documents. There is nothing in Dr Chang’s antecedent disclosures of his limited money market fund and deposits experience which would explain why Dr Chang would now raise or volunteer information about traded options at such a meeting. This was yet another instance where the RM subsequently sought self-servingly to layer his explanations in order to explain away his earlier conflicting contemporaneous written reports or evidence. 63     It is undisputed that Dr Chang had not asked for original or increased margin trading financing. There is no evidence to show that the RM had asked him whether he required margin financing or Dr Chang was told that the RM was going to use the margin facility to pay for Dr Chang first and subsequent purchases. Neither the RM nor DB explained the leverage multiplication implications of margin trading or the need for prudent risk management. All these were in the face of their knowledge that Dr Chang was in receipt of about US$118 million in cash and was not in any need of financing. When the RM was asked whether he had asked Dr Chang whether he required margin financing his answer was that he thought Dr Chang understood. When asked whether he had advised Dr Chang on any risk management process between November 2007 and January 2008, his answer was that Dr Chang had not asked any questions. 64     The RM attempted to explain his unilateral application for unsolicited, margin financing to Dr Chang as follows: A:If you -- you need to do derivatives trading, it has to be -- we have to grant you margin trading.Court:Why?A:It’s just the -- just the way it is.Court:A man who has $26 million gives you a deposit. Why does he need margin?A:He can -- not to use it, just use whatever, see -- your Honour, if we progress, okay, if he has only $26 million, he can stick with the $26 million, he does not have to use margin. Just, the facility is there. If he said, “Okay, Johnny, I don’t want to use margin, just I want to buy DSPP, can I do that?” I say, “Yeah, you can do that”, we just do exactly $26 million, then there’s no margin. You don’t have to utilise it.Court:So you’re saying it’s up to the customer to tell you specifically he doesn’t want margin financing?A:Once he does the DSPP, the margin trading facility will be granted to him and we will send out letters.Court:Whether or not he requests it?A:Yeah.…Q:the RM, the question stands, did he or did not ask you for a margin trading facility; “yes” or “no”?A:He asked for a DSPP trading. It’s on margin basis.Q:Let me clarify.Court:You are saying, any client who asks you that he wants to trade on DSPP must trade, as far as the bank is concerned, on margin?A:That’s as far as I understood.Court:That cannot be the bank’s position, which is why the bank asks you to fill in this form.A:The derivatives products, it’s enter into margin. You may utilise it or you may not utilise it. If you want to utilise it, you can use it. If you don’t want to use it, there will be a letter sent in saying “We grant you the margin trading facilities, you have 14 days to reject”.[emphasis added]   The 34 DSPPs purchases between 19 November 2007 and 4 February 2008 65     Within the short period between 19 November 2007 and 12 December 2007, Dr Chang purchased 32 international bank share DSPPs. He purchased two further DSPPs in early February 2008. The RM admits that between 19 November 2007 and 4 February 2008, he continued to communicate with Dr Chang between two to five times a day by telephone through recorded landlines and unrecorded mobile phone lines. The first DSPP purchase on 19 November 2007 66     Dr Chang testified that the RM continually sought to persuade him to purchase DSPPs through a series of telephone calls and emails between August 2007 and 19 November 2007. The RM’s emails were usually preceded or followed by a telephone call usually from the RM’s mobile phone. They became very friendly with one another and would often have more than one conversation a day. 67     On 19 November 2007, the RM sent Dr Chang an email at 3.38 pm about the discount for a Citigroup DSPP. Dr Chang’s evidence is that the RM told him that the Citigroup DSPP was a “very good deal”, it was “not possible” for a blue chip like Citigroup to “go under” and it was a “good thing” if the share price fell since Dr Chang would be able to “buy more shares”. Dr Chang referred to the email dated 19 November 2009 that the RM had sent to him, which states as follows: If Citi go up more than 3% say 35.03, then you will Guarantee to receive 4 weeks allocation and contract cancel. If Citi fall below 27.26, then you are entitled to receive double the portion (Gear Version) say 300 shares per day. 68     The RM clarified that it was Dr Chang who had initiated this purchase. The RM testified that on 19 November 2007: Dr Chang contacted me to suddenly express interest in purchasing and accumulating Citigroup shares by way of DSPP contracts. I was surprised since, prior to this, Dr Chang had not even expressed to me any interest in purchasing [i]nternational [b]ank shares (whether through DSPP contracts or otherwise). I had also not provided him with any brochures or sample term sheets on the purchase of [i]nternational [b]ank shares (whether through DSPP contracts or otherwise). [emphasis added] 69     The RM had earlier that day sent Dr Chang an email at 3.38 pm, providing him with quotations for normal, guaranteed and geared versions of Citigroup and DB DSPPs. The email explained that for geared versions of DSPPs, Dr Chang would be “entitled” to receive double the number of shares should the market price of the shares fall below the strike price. The RM’s evidence is that Dr Chang understood from their previous conversations that “entitled” meant he was obliged to purchase double the number of shares. 70     The RM’s evidence is that in a follow-up call by Dr Chang the same day at 4.18 pm, Dr Chang confirmed that he had received the RM’s earlier email and asked if Prof Lim could enter into one DSPP contract. It is the RM’s evidence that they then discussed the features of the various versions of the DSPPs and he highlighted to Dr Chang that in the event the knock-out price of a DSPP was reached, the DSPP would be knocked out if it was not guaranteed or the guarantee period had lapsed. The RM also gave evidence that he had also informed Dr Chang that for geared DSPPs, Dr Chang would receive double the number of shares for each day that the price of such shares fell below the pre-determined strike price. 71     Dr Chang called the RM again later the same day at 4.46 pm to inform him that Prof Lim had decided to purchase a DSPP. The RM suggested HSBC DSPPs as an alternative to Citigroup DSPPs as he thought it was more stable, but the discount for an HSBC DSPP was less than that for a Citigroup DSPP. The RM’s evidence is that he suggested to Dr Chang not to rush into a DSPP but to wait for Prof Lim’s purchase of her DSPP. The RM relied on the following part of the transcript (in which he is referred to as Johnny): Johnny:... Do you want [Prof Lim] to try first then we see how, then we decide or you want to do it immediately also? Because the variation in there is quite a lot.Dr Chang:That means you are saying there are quite a lot of options, is it?Johnny:Correct, what I meant is because inside it has quite a lot of options, I feel that er, nah, because we have---we have some different situation that will occur, sometimes the shares go down all the way, which is go down then we can’t do anything, keep on waiting lah. Then or sometimes it will er ---Dr Chang:“Go down all the way, can’t do anything (but) wait,” what does it mean?Johnny:Then we have to wait for one year, for example, its shares does not go up at all, keep dropping downwards, then we have to wait for one year. The contract will last for a year.Dr Chang:Of course....Johnny:... I would feel that you let [Prof Lim] try that one first and see how it is, to see what’s going on then wait until hers has ended, then we review the contract, then we go in or it’s up to you, but I feel that if it is a bit safer, then (I) would do it in this way, because now the market has not completely stabilised yet lor.Dr Chang:Mm-hm.Johnny:Yah.Dr Chang:That’s why I say want to see–--that is want to see this opportunity.[emphasis in original omitted]   72     The RM’s recollection from this recorded telephone call is that Dr Chang was himself particularly keen on acquiring Citigroup shares and not HSBC shares. Despite the RM’s caution that the market had not completely stabilised and the Citigroup DSPP was priced normally at a large discount in a “very volatile market”, according to him, Dr Chang “maintained his eagerness to accumulate Citigroup shares using DSPP contracts”. As a result, on 19 November 2007, Dr Chang personally purchased one geared and guaranteed DSPP for 300 Citigroup shares. What the RM did not appear to have explained to Dr Chang in this conversation was that the deeper DSPP price discount of 20.6% to the then current share market price was a reflection of the market’s pricing of the higher risk of a drop in the underlying share price for the duration of the DSPP. 73     I note that the conversation as recorded in the transcript opens with Prof Lim’s interest in purchasing a DSPP but concluded with Dr Chang himself deciding to purchase the DSPP. I find it noteworthy that Dr Chang had not signed DB’s Derivative Agreement prior to 19 November 2007. It follows from this that once the RM confirmed Dr Chang’s Citigroup DSPP purchase, sometime after 4.46 pm that day, it now became necessary for Dr Chang himself to sign DB’s Derivative Agreement. This explains why the RM kept insisting in court that the Derivative Agreement had been signed on 19 November 2007 despite it being dated 23 November 2007 which was not alleged as being erroneous. As Dr Chang had suddenly decided sometime after 4.46 pm on 19 November 2007 to purchase the DSPP, there is no evidence that he had DB’s Derivative Agreement signed by DB in hand for him to sign and return on 19 November 2007. 74     The evidence does reveal that the RM had written a Voice Log entry on DB’s copy of the Term Sheet recording that “T&C Conveyed and Accepted by Client at 16:55, 19 November 2007” which he explained in court that he had written a few days later although he dated it 19 November 2007. The RM had to insist that the paperwork had been signed by Dr Chang on the same day as Dr Chang’s first DSPP purchase of 19 November 2007 although the documentary and oral evidence suggests signature and approvals of a later date. I find on the evidence that Dr Chang’s first DSPP purchases were transacted on 19 November 2007 and there is no evidence that he had duly signed DB’s Derivative Agreement on or before 19 November 2007. 75     I next turn to consider the significance of the transcript of the single recorded telephone conversation between the RM and Dr Chang on 19 November 2007. The RM did not clarify whether there had been other calls between them on that day even though he confirmed that they spoke several times each day on his mobile phone of which there were no recordings. The single extracted transcript of the recorded telephone call nevertheless reveals that Dr Chang was himself interested in and had decided that day to purchase the Citigroup DSPP in his own name. The RM is also recorded to have alerted Dr Chang that the share price could go down for the duration of the DSPP. Beyond this, I am unable to draw any further conclusion on this transcript of an isolated recorded telephone conversation given that they spoke several times a day on unrecorded mobile phone lines but no further evidence was adduced of any other conversations that day. 76     Following Dr Chang’s first purchase of Citigroup DSPPs on 19 November 2007, he thereafter made in quick succession 31 further international bank share DSPP purchases up to 12 December 2007 and two more in February 2008. During this period, the RM and DB appear to have been completely oblivious of their undertakings at the first meeting of 15 March 2007 that they would advise Dr Chang to manage his new wealth. DB’s internal processes did not pick out the material discrepancies recorded in the RM’s CAPR 3 August 2007 against its Margin Trading Checklist 19 November 2007. Further, no review of these records appear in evidence when DB first granted the margin financing of US$10 million and progressively increased the facility to US$20 million and further to US$35 million in the space of just one month. 77     It is the RM’s evidence in court that he had cautioned Dr Chang that DSPPs would not be good investments if the price of the underlying shares fell below the pre-determined strike price and did not rise above the same thereafter. In the light of this, the RM had recommended blue chip share DSPPs to Dr Chang. Both the RM and Dr Chang at that time held the same view that Citigroup was regarded to be a blue chip share notwithstanding its share price volatility, but the RM said he had cautioned that DB had issued a “sell” rating for Citigroup shares. To sell a Citigroup DSPP to Dr Chang to whom the RM and DB had undertaken a duty of care to advise him when DB itself had issued a “sell” rating for Citigroup shares in a volatile market is, in my view, at variance with exercising reasonable care to advise Dr Chang. The RM’s advice contained the common refrain that through DSPPs, Dr Chang could acquire international bank shares cheaply and should the market price fall below the strike price, Dr Chang would be entitled to accumulate double the number of shares. Other than the RM’s recollection in court, there is no corroborating evidence produced from the emails to support the view that the RM had on any occasion during the one month when the 32 DSPP purchases were made, pointed out to Dr Chang the downside risks of purchasing such magnitude and concentration of DSPPs on margin in a volatile market in the event of a protracted declining market. The first summary report dated 3 December 2007 78     Dr Chang did not receive any information, advice or warning from DB about appropriate risk management processes or about his total liability or potential exposure as a result of his successive international bank share DSPP purchases between 19 November 2007 and 12 December 2007. He was first given an Excel summary report of his DSPP positions on 3 December 2007, but this report did not show him his outstanding total exposure (the “Total Exposure”). It was only after he complained and requested better risk monitoring systems in March 2008 that DB began to provide him with Excel summary positions now with a new column setting out his Total Exposure.",
        "Part IV: The Termination Events": "79     By 12 December 2007, 17 of Dr Chang’s 32 DSPP contracts were knocked out, leaving 15 DSPP contracts still open. By 18 December 2007, Dr Chang had an account shortfall of US$1.2 million, which he topped up. 80     The RM thereafter advised Dr Chang to sell Premium Share Sale Program (“PSSP”), in addition to selling some of his underlying accumulated international bank shares. A PSSP is the reverse of a DSPP—a client who sells a PSPP agrees to sell a fixed number of shares each week for the duration of the PSSP at a strike price being a premium over the PSSP date market price. A PSSP is sold by a seller who does not expect the price of the underlying share to increase beyond the premium for the one year duration of the PSSP. Conversely, a PSSP is bought by a purchaser who expects the price of the underlying share to increase beyond the premium in the same duration. 81     The RM emailed Dr Chang on 9 January 2008 to suggest a Citigroup PSSP and elaborated on the advantages of this strategy. He pointed out that a PSSP would enable Dr Chang to sell his shares at a premium to the market price without paying a commission. Dr Chang would be able to offset the PSSPs against his open DSPPs. He could thereby unload his accumulated Citigroup shares to reduce his overall risk. However, the PSSP had the disadvantage of Dr Chang’s accumulated Citigroup shares being locked up for delivery for the duration of the PSSP as he would remain obliged to deliver the shares at the strike price should its market price rise. He would not be able to sell his accumulated Citigroup shares on the open market in such a case. 82     On 10 January 2007, Dr Chang sold two PSSPs, each for 300 Citigroup shares, which were both knocked out on 17 January 2007. The RM also then advised Dr Chang to continue selling “some of the shares to reduce overall position to leave room for alternatives”. However, Dr Chang’s evidence is that he did not sell his accumulated shares because he relied on the RM’s advice to match PSSPs with his open DSPPs. Margin Call on 22 January 2008 83     On 22 January 2008, the Dr Chang’s account shortfall deteriorated further by US$8 million. Dr Chang deposited US$5 million into his account on 24 January 2008, which he explained was done upon the RM’s assurance that what made this necessary was temporary adverse market conditions. 84     On 30 January 2008, Dr Chang sold one 300 Citigroup PSSP, and then another on 1 February 2008. In early February 2008, Dr Chang purchased two international bank share DSPPs. Between 5 February and October 2008, he sold three further Citigroup PSSPs with little effect on his remaining open DSPPs. Dr Chang thereafter unwound his remaining 16 open DSPPs and bore the unwinding costs. Updating of CAPR in February 2008 85     The RM updated Dr Chang’s CAPR in February 2008 (“CAPR 15 February 2008. This CAPR 15 February 2008 now reported Dr Chang’s total assets for investment to be between US$130 million and US$150 million and a net worth of about US$160 million. His experience in derivative and leveraged products is reported to be “High”, his investment objective to be capital growth and his risk profile to be “Growth (higher risk/possible higher return)”. This risk profile is defined in the CAPR 15 February 2008 to mean that Dr Chang was “prepared to accept risk of market-like losses in line with those of the equity markets and who intends to meet the possibility of significant short-term fluctuations by long-term investments” and for whom “[l]iquidity is of no primary concern”. This CAPR 15 February 2008, which was only internally approved by DB four months later on 3 July 2008, reported a completely different risk profile from that reported six months earlier in the CAPR 3 August 2007 (see [59] above). Closing out in November 2008 86     Dr Chang’s evidence is that he was only advised for the first time by the RM that he had a total exposure of US$76 million when he received a conference call on 6 March 2008 from the RM and his superior, one Ms Cecilia Yan. Dr Chang testified that he was stunned at his total exposure disclosed to him and immediately requested “better risk monitoring systems” for him. Only after this did he receive Excel reports setting out his total exposure in a new column. Thereafter, seven margin call letters were issued in 2008 on the following dates: 22 January, 7 March, 26 June, 18 September, 24 October, 1 and 20 November. DB exercised its contractual right under the Security Agreement and liquidated almost all of the remaining Citigroup shares in Dr Chang’s account. Dr Chang lamented that DB sold all his Citigroup shares on a day when Citigroup shares were at the lowest point in the period between 2007 and 2008. After the sale of all the shares, the balance owed by Dr Chang to DB is US$1,788,855.41, which is the subject matter of DB’s claim against Dr Chang.",
        "The governing law": "87     Before I frame the legal issues, I shall first determine the applicable law. The Service Agreement is expressly governed by Singapore law with Dr Chang irrevocably submitting to the non-exclusive jurisdiction of the Singapore courts. The Derivative Agreement is expressly governed by English law. The expert witnesses on English law were: Lord Millett and Mr Craig Orr QC. They were called by Dr Chang and DB respectively. The expert witnesses on Hong Kong law were: Mr Anderson Chow SC and Mr Adrian Bell SC. They were called by Dr Chang and DB respectively. In addition, Dr Chang called Professor Ho Yew Ee as his expert on the behaviour of experienced investors. 88     Counsel for all parties agreed at the outset of this trial that this court apply Singapore law to all of Dr Chang’s claims based on actionable misrepresentation, breach of duty of care and breach of fiduciary obligations, all of which were averred to have arisen prior to the Service Agreement and the Derivative Agreement.",
        "Legal Issues": "89     Having determined that the applicable law for all the legal issues is Singapore law, the substantive issues before me are as follows: (a)     Misrepresentation (i)       Were actionable misrepresentations (fraudulent or non-fraudulent) made by DB and the RM to Dr Chang on 15 March 2007? (ii)       If so, do the Service Agreement Disclaimers and the Derivative Disclaimers operate as evidential or contractual estoppels, resulting in Dr Chang being unable to establish actionable misrepresentation? (b)     Fiduciary obligation before the Service Agreement dated 1 August 2007 (i)       Did DB and the RM assume a fiduciary obligation to Dr Chang before the Service Agreement dated 1 August 2007? (ii)       If so, do the Service Agreement Disclaimers and Derivative Disclaimers operate as evidential or contractual estoppels, resulting in Dr Chang being unable to establish a fiduciary obligation or its breach? (c)     Duty of care before the Service Agreement dated 1 August 2007 (i)       Did DB and the RM assume a duty of care to Dr Chang before the Service Agreement dated 1 August 2007? (ii)       If so, do the Service Agreement Disclaimers and the Derivative Disclaimers operate as evidential or contractual estoppels resulting in Dr Chang being unable to establish a duty of care or its breach? (d)     Remedies (i)       Depending on which, if any, of the above causes of action have been established, what are the appropriate remedies?",
        "Misrepresentation": "90     Dr Chang’s misrepresentation claim can be dealt with briefly. Dr Chang claims that the RM’s Presentation on 15 March 2007 falsely and fraudulently represented the nature of DB’s services that would be provided to him. The gist of this claim is that the RM and DB had represented to Dr Chang that they would provide him with advice to manage his new wealth and had failed to do so. Instead, they had proceeded to advise and recommend DSPPs to Dr Chang. Dr Chang argued that these representations induced him to (i) sign the account application form incorporating the Service Agreement and (ii) subsequently purchase the 34 DSPPs. 91     DB’s defence is that Dr Chang’s alleged representations were not actionable representations because they did not constitute representations of fact, but were rather statements as to future conduct. It was argued that the statements in the Presentation were essentially marketing pitches, at best salesman’s puffs, and were thus not actionable. As such, DB submits that Dr Chang’s misrepresentation claim was misconceived and devoid of merit. 92     In his closing submissions, Dr Chang framed his misrepresentation claim in the following way: 117The purport of the written representations from the Presentation are that: a.DBwouldalways act in the best interest of its clients and that its clients can trust DBPWM to manage their wealth and investments; b.DBwouldact as a financial adviser to its clients and would help to manage its clients’ wealth and investments; c.DBwoulddo its utmost to understand its clients investment objectives and investment experience; d.DBwouldbe able to provide financial products and investment advice that are customized to suit its clients’ investment objectives and investment experience; and e.DBwouldprovide a team of competent and responsible bankers, relationship managers and resources who are qualified and authorized to advise on and manage its clients’ wealth and investments. 118As for the oral representations, Dr Chang’s evidence is that Mr Wan had made the following representations in the course of the Presentation: a.Mr Wan fully understood Dr Chang’s and Prof Lim’s investment objectives and concerns that they had shared with him verbally at the First Meeting; b.DBPWMwouldbe able to provide financial advice to Prof Lim and Dr Chang and manage their wealth and investments in accordance with their investment objectives and needs; c.Within DBPWM, one of Mr Wan’s strengths was in the area of bond investments and his team members in DBPWM had strengths in other areas of investment; d.As a team, DBPWMwouldbe able to meet the wealth management and investment needs of Prof Lim and Dr Chang; e.As a team, DBPWMwouldbe able to offer a variety of financial products which would be tailored to meet the requirements of Prof Lim and Dr Chang; f.The services provided by DBPWM was amongst the best when compared to other international banks; and g.If Prof Lim and Dr Chang are customers of DBPWM, Mr Wan could travel to Taiwan to meet them if they needed to speak to him in person on their wealth management and investment needs. [emphasis added in bold italics] Present facts and future intention 93     For a statement to constitute an actionable misrepresentation, it must be a statement of a present fact. This would exclude statements as to future intention, predictions, statements of opinion or belief, sales puffs, exaggerations and statements of law. Chao Hick Tin J inBestland Development Pte Ltd v Thasin Development Pte Ltd[1991] SGHC 27 (“Bestland”) helpfully stated the law as follows: The first question to determine is, are the alleged statements representations? To constitute a representation, a statement must relate to a matter of fact. It must be a matter of present or past fact … A distinction ought to be drawn between a representation of an existing fact and a promise to do something in the future. Furthermore, mere praise by a man of his own goods or undertaking is a matter of puffing and pushing and does not amount to representation. However, a statement of opinion may in certain circumstances involve a statement of fact. 94     Following the test laid down inBestland, I have difficulty seeing how any of the written representations could be considered statements of present fact given the way they were framed such as to contain the word “would”. The word “would” appearing in para 117, and in sub-paras (b), (d) and (e) of para 118 of Dr Chang’s closing submissionsprima faciesuggests that the alleged statements were statements of future intention. A statement by one party that he “would” do something for the other party in the future is in essence a promise, which becomes actionable only if such promise was subsequently incorporated into the contract as a term: see generallyThe Law of Contract in Singapore(Andrew Phang Boon Leong gen ed) (Academy Publishing, 2012) at paras 11.029–11.030. 95     However, a finding that the statements in question were statements as to future intention rather than statements of present fact is not necessarily fatal to a misrepresentation claim. InBank Leumi Le Israel BM v British National Insurance Co Ltd and others[1988] 1 Lloyd’s Rep 71 at 75, Saville J accepted that a statement as to a future fact “can and often does carry with it a representation that the person making the statement has an honest belief or expectation, based on reasonable grounds, that events will turn out to be as stated or forecast”, which made it a statement of present fact. 96     Statements as to future facts may therefore be re-characterised as statements implying (i) that the maker of the statement honestly believed that the event would happen in the future; or (ii) that the maker of the statement had reasonable grounds for making such an assertion. A careful analysis is warranted to avoid the dangers observed by Lord Wilberforce inBritish Airways Board v Taylor[1976] 1 WLR 13 at 17: Everyone is familiar with the proposition that a statement of intention may itself be a statement of fact and so capable of being true or false.But this proposition should not be used as a general solvent to transform the one type of assurance with another: the distinction is a real one and requires to be respected ... [emphasis added] 97     The main difficulty in trying to found an action for misrepresentation on statements of future intention is an evidential one. The representee must prove, on a balance of probabilities, the maker’s lack of honest belief in the statement. The Court of Appeal held inTan Chin Seng and others v Raffles Town Club Pte Ltd[2003] 3 SLR(R) 307 at [12] and [14] that: 12    A representation is a statement which relates to a matter of fact, which may be a past or present fact.But a statement as to a man’s intention, or as to his own state of mind, is no less a statement of fact and a misstatement of the state of a man’s mind is a misrepresentation of fact:perBowen LJ inEdgington v Fitzmaurice(1885) 29 Ch D 459 at 483. … 14    Of course, it will be difficult to prove what was the state of a person’s mind at any particular point in time. Nevertheless, that is a matter of proof and it should not be confused with the substantive principles of law. [emphasis added] 98     Returning to Dr Chang’s pleaded case, I fail to see how any of the representations referred to above at [92] were statements of fact. Those statements were at best statements of future intention. I have some trouble accepting that these statements were, without more, anything more than business promotional puffs. However, even if I were to take Dr Chang’s pleaded case at its highest and accept that those statements could be re-characterised as statements of fact, I am still not satisfied that Dr Chang has proven on a balance of probabilities that the RM or DB did not honestly hold such a belief that those statements were true when those statements were made to Dr Chang. They were able to provide advice at that time and there is no evidence to show that the RM or DB had no intention of providing such advice to Dr Chang. Exaggeration and puffs 99     I shall next examine the remaining statements in para 118 of Dr Chang’s closing submissions that did not use the word “would”. For sub-para (a) of para 118, I find that the alleged representation made by the RM that he “fully understood Dr Chang’s and Prof Lim’s investment objectives and concerns” that they had shared with him verbally at the meeting was indeed made. I also find that the representation was true, which negates the possibility of it being a misrepresentation. While Dr Chang’s misrepresentation claim has failed here, the significance of the above finding of fact would become apparent later. 100    For sub-paras (c) and (d) of para 118, I also find that while those statements were representations of fact rather than of future intention, the statements were true. I am satisfied that the RM possessed expertise in the area of bond investments and other teams in DB had strengths in other areas of investment, and that the RM could, if necessary, have travelled to Taiwan to meet Dr Chang. Therefore, those statements are not actionable misrepresentations. 101    For sub-para (f) of para 118, I find that a statement in the Brochure stating that “[t]he services provided by DBPWM was amongst the best when compared to other international banks” was, in isolation, a sales puff and did not amount to a statement of fact. The law distinguishes between mere praise and non-actionable hyperbole on one hand and statements of opinion which may be analysed as assertions of fact on the other. 102    In the light of the above, my conclusion is that Dr Chang’s pleaded case does not reveal any false statement of present facts made in the Presentation such as to constitute actionable misrepresentations. Accordingly, Dr Chang’s misrepresentation claim fails. It is not necessary for me to proceed to further consider Dr Chang’s claims for fraudulent misrepresentation. Neither is it necessary for me to examine whether and how evidentiary or contractual estoppels averred to have arisen from the Service Agreement Disclaimers or the Derivative Disclaimers might affect Dr Chang’s misrepresentation claims.",
        "Breach of fiduciary duties": "103    Dr Chang next claimed that the RM and DB undertook a fiduciary obligation to him prior to his signing of the account application form dated 1 August 2007 which they breached. I shall first examine whether on the present facts, DB had undertaken to act as Dr Chang’s fiduciary, its scope and whether there was breach. I shall thereafter examine whether DB had any defences to a breach of fiduciary duty. Did DB undertake to act as Dr Chang’s fiduciary? 104    The classic definition of a “fiduciary” was formulated by Millett LJ inBristol and West Building Society v Mothew[1998] 1 Ch 1 (“Bristol”) at [18] (cited with approval inNg Eng Ghee and others v Mamata Kapildev Dave and others (Horizon Partners Pte Ltd, intervener)and another appeal[2009] 3 SLR(R) 109 (“Ng Eng Ghee”) at [135]): A fiduciary is someone who has undertaken to act for or on behalf of another in a particular matter in circumstances which give rise to a relationship of trust and confidence.The distinguishing obligation of a fiduciary is the obligation of loyalty. The principal is entitled to the single-minded loyalty of his fiduciary. This core liability has several facets. A fiduciary must act in good faith; he must not make a profit out of his trust; he must not place himself in a position where his duty and his interest may conflict; he may not act for his own benefit or the benefit of a third person without the informed consent of his principal. [emphasis added] 105    It is trite that a fiduciary relationship may arise in law in three situations: by contract; by the established categories of relationships; or in the particular factual circumstances. The High Court of Australia held inHospital Products Limited v United States Surgical Corporation And Others(1984) 156 CLR 41 at 68 that: The authorities contain much guidance as to the duties of one who is in a fiduciary relationship with another, but provide no comprehensive statement of the criteria by reference to which the fiduciary relationship may be established. The archetype of a fiduciary is of course the trustee, but … there are other classes of persons who normally stand in a fiduciary relationship to one another — e.g., partners, principal and agent, director and company, master and servant, solicitor and client, tenant-for-life and remainderman. There is no reason to suppose that these categories are closed. However, the difficulty is to suggest a test by which it may be determined whether a relationship, not within one of the accepted categories, is a fiduciary one. 106    However, I note that beyond contract and the established categories, the court will find a fiduciary relationship to have arisen only where the circumstances are regarded to be sufficiently exceptional. 107    InGovernor and Company of the Bank of Scotland v A Ltd and others[2001] 1 WLR 751, Lord Woolf CJ outlined the rationale behind why courts do not ordinarily consider banks as fiduciaries (at [25]): These submissions call for some explanation since on the face of itthe relationship between a bank and its customer is not a fiduciary relationship.It is a commercial relationship founded in contract into which the intrusion of equitable doctrinessuch as constructive noticemay result inthe well known words of Lindley LJ inManchester Trust v Furness[1895] 2 QB 539, 545, in “doing infinite mischief and paralysing the trade of the country”.The need for certainty in commercial transactionsunderpinned many of the submissions ... madeon behalf of the defendants. [emphasis added] 108    Professor Paul D Finn explained the critical functional difference between self-interested contractual obligations and other-interested fiduciary obligations in his article “Contract and the Fiduciary Principle” (1989) 12 UNSWLJ 76 at 83: A contracting party, ordinarily, is bound at least to do some prescribed act or acts for the other’s benefit and can be relied upon for this: such is the effect of the consideration doctrine. A fiduciary, ordinarily, is obliged to act in the beneficiary’s interests in some particular matter or matters and can be relied upon for that. Yet despite the apparent similarity we hold there is a difference.It is one thing to act for another’s benefit. It is another to act in that other’s interests. When we describe a relationship as being fiduciary we are saying not only that it possesses certain characteristics but also that we wish to exact a particular standard of conduct (i.e.loyalty) from one or both parties to it.An ordinary contractual relationship for its part may possess many if not all of the supposed characteristics of a fiduciary relationship, but despite this the conduct standard we wish to exact from contractors is a different one. This can be illustrated simply. A fiduciary is accountable for profit made from a breach of fiduciary duty. A contractor is not liable, as a rule, for profit made from breach of contract. [emphasis added] 109    Conversely, however, the fact that DB’s relationship with Dr Chang was a commercial one does not necessarily preclude a finding of a fiduciary relationship. The fact that the relationship is a “commercial” one is irrelevant. Rather, the real question is whether or not the nature of the relationship between the parties satisfied the criteria of a fiduciary relationship. J R F Lehane explained in “Fiduciaries in a Commercial Context” inEssays in Equity(The Law Book Company Limited, 1985) (P D Finn ed) (“Essays in Equity”) ch 5 at 104: [T]he distinction between “commercial” and other transactions must be a red herring. It cannot be the case that … the decision should simply have been that the relationship was not fiduciary because it was commercial. Agencies, partnerships and trusts are established between substantial parties whose relationship is undoubtedly “commercial” and who act at arm’s length. Doubtless—as Deane J makes very clear—the reason why, in commercial contexts, transactions outside the traditional categories do not give rise to fiduciary duties is that most of such transactions do not,as a matter of fact, satisfy the criteria (whatever precisely they are) which lead courts to characterise a relationship between private parties as fiduciary.It is because they do not satisfy the criteria, not because they are commercial, that such transactions do not usually carry with them financial duties and the remedies flowing from such a breach of such duties. [emphasis added] 110    What then constituted “exceptional circumstances” in which the courts have found a fiduciary relationship to exist? To answer this question, the English, Australian and Singapore courts have consistently applied the undertaking approach which focuses on whether or not the fiduciary has undertaken, expressly or impliedly, to act as a fiduciaryvis-à-visthe principal,ieto put the principal’s interests ahead of its own. Whether the undertaking was in exchange for a benefit or entirely gratuitous is irrelevant. InNg Eng Ghee, the Court of Appeal stated at [110] and [111] that: 110    Theraison d’êtreof fiduciary obligations is that an agent who has undertaken to act in the interests of another person (the principal) should not be permitted to act against his principal’s interest. Indeed, a distinguishing characteristic of recognised fiduciary relationships (see [108] above) is the peculiar vulnerability of a party to be affected by an abuse of a power or duty that has been entrusted to another. … 111    Finn further observes inFiduciary Obligationsthat it does not even matter if the relationship is entirely gratuitous (at para 467): He is, simply, someone who undertakes to act for or on behalf of another in some particular matter or matters. That undertaking may be of a general character. It may be specific and limited. It is immaterial whether the undertaking is or is not in the form of a contract.It is immaterial that the undertaking is gratuitous.And the undertaking may be officiously assumed without request. ... [emphasis in original] 111    However, given the extensive equitable remedies that a beneficiary has access to resulting from a breach of fiduciary duties, the court should, save in the most exceptional cases, be extremely slow to find that a fiduciary relationship had arisen outside of contract and outside the established categories of relationships. Proof of facts supporting a finding of an express or implied undertaking is necessary in every case and it is grossly unacceptable for the court to “read equity backwards” and impose fiduciary duties on an errant party whenever the court thinks that it is fair, just and reasonable to do so. I would take into account the three cautionary statements in Laura Hoyano, “The Flight to Fiduciary Haven” inPrivacy and Loyalty(Peter Birks ed) (Oxford University Press, 1997) (“Privacy and Loyalty”) at p 182: First, it is crucial todistinguish the process of identifying the existence of a fiduciary relationship from the content of a fiduciary obligation. Definitions of the fiduciary relationship which turn on the duty of loyalty ultimately are circular, and provide no guidance on when that fiduciary obligation should be attached to a relationship between the parties. Secondly, just as it is crucial not to ‘read equity backwards’ from the desirability of a particular remedy to imposition of an obligation, it is also important not to reason from conduct which would constitute a breach of fiduciary obligation,if it existed, backwards to characterisation of a relationship as being fiduciary. As Sopinka J cautioned inLac Minerals,the presence of conduct which incurs the censure of a court of equity in the context of a fiduciary duty cannot itself create the duty. Thirdly, where it is claimed that a fiduciary relationship exists outside the traditional categories, it is logical torequire proof of an express or implied undertaking to act solely in the interests of the other in a manner which affects the other’s vital interests, as initiating the fiduciary relationship. [emphasis added] 112    Keeping these cautionary statements in mind, the pivotal question to be determined in this part of my judgment is whether the RM and DB undertook to act as Dr Chang’s fiduciary prior to the account application form dated 1 August 2007. In other words, did the commercially self-interested RM and DB undertake to act in Dr Chang’s interests and to subordinate Dr Chang’s interests to their own? 113    The facts here reveal that the RM, whilst employed by another bank, first fortuitously came to meet Dr Chang and thereby know that Dr Chang would soon thereafter receive considerable new wealth. With this knowledge the RM procured a meeting with Dr Chang to secure him as a DB private banking client. As DB’s relationship manager, following his Presentation, the RM met Dr Chang and Prof Lim to persuade each of them to retain DB. The RM then made solicitous enquiries regarding their investment objectives and, in particular, about Dr Chang’s new wealth management needs from his expected wealth of US$118 million, all of which the RM dutifully recorded. The RM knew about and recorded that Dr Chang was financially inexperienced, and that Dr Chang’s investment experience was limited to mutual funds and money market deposits. The RM’s Presentation and solicitude so impressed Dr Chang that he decided at the 15 March 2007 meeting to open an account with DB when he received his new wealth in order for DB to advise him in managing his new wealth. 114    In the end, as pointed out in E P Ellinger, E Lomnicka and C V M Hare,Ellinger’s Modern Banking Law(Oxford University Press, 5th Ed, 2011) (“Ellinger”) at p 128, “the concept of selflessness lies at the heart of the fiduciary relationship and a fiduciary is expected to promote his principal’s interests above his own”. Based on the facts in the present case, whilst the conduct does not reflect best industry practice, it is insufficient to establish that the RM and DB had exceptionally undertaken to promote Dr Chang’s interests above their own. The starting point of a self-interested RM and DB has not on these facts been displaced by exceptional circumstances warranting an assumption of a fiduciary obligation to Dr Chang. 115    I note for completeness that both Lord Millett and Mr Craig QC agreed that under English law, if DB had undertaken a fiduciary obligation to Dr Chang before the account application form dated 1 August 2007, then the Service Agreement Disclaimers and the subsequent Derivative Disclaimers would have no effect on the fiduciary obligations which have previously arisen. The position under Singapore law is no different. I now turn to Dr Chang’s claim for negligence.",
        "Breach of duty of care": "116    Dr Chang’s next claim is founded on his averment that DB assumed a duty of care to advise him on his financial affairs before he signed the account application form dated 1 August 2007 which incorporated the Service Agreement. He averred that DB had failed to take reasonable care in advising him, thus causing him damage. Dr Chang submitted that the applicable test in Singapore was the basic two-stage test premised on proximity and policy considerations, with its application preceded by a preliminary requirement of factual foreseeability. The Court of Appeal held inSpandeck Engineering (S) Pte Ltd v Defence Science & Technology Agency[2007] 4 SLR(R) 100 (“Spandeck”) at [115] that: To recapitulate: A single test to determine the existence of a duty of care should be applied regardless of the nature of the damage caused (ie, pure economic loss or physical damage). It could be that a more restricted approach is preferable for cases of pure economic loss but this is to be done within the confines of a single test.This test is a two-stage test, comprising of, first, proximity and, second, policy considerations. These two stages are to be approached with reference to the facts of decided cases although the absence of such cases is not an absolute bar against a finding of duty.There is, of course, the threshold issue of factual foreseeability but since this is likely to be fulfilled in most cases, we do not see the need to include this as part of the legal test for a duty of care. [emphasis added] 117    Dr Chang’s case is that this duty of care arose on 15 March 2007, when the RM, representing DB, undertook to him that DB would advise him on managing his new wealth. There was factual foreseeability in the sense that DB could have foreseen that Dr Chang would suffer financial loss if it breached its duty of care to advise him on managing his newly acquired wealth. In any event, the threshold issue of factual foreseeability is almost always satisfied: seeSpandeckat [75]. There was also sufficient legal proximity between Dr Chang and DB based on the twin criteria of “voluntary assumption of responsibility” and “reliance” because DB had through its actions voluntarily assumed responsibility towards Dr Chang, and Dr Chang had relied on DB’s voluntary assumption: seeSpandeckat [81]. Aprima facieduty of care thus arose. Dr Chang also submitted that there are no applicable policy considerations, such as (i) the presence of a contractual matrix which clearly defines the rights and liabilities of the parties, and (ii) the relative bargaining positions of the parties, that would arise to negate this duty of care: seeSpandeckat [83]. I accept this submission. 118    DB submitted that it did not owe Dr Chang any duty of care and in any event there was no breach of any duty of care by reason of the evidential or contractual estoppels arising from the Service Agreement Disclaimers and/or the Derivative Disclaimers. I shall therefore determine whether a duty of care arose and, if it did arise, whether evidential or contractual estoppels arose from the Service Agreement Disclaimers and/or the Derivative Disclaimers. If Dr Chang was not estopped, I shall then proceed to determine whether DB had breached the duty of care owed to Dr Chang. Did DB assume a duty of care? 119    In deciding whether a duty of care arose, I note that while an incremental approach is to be applied, the absence of analogous precedent cases is not an absolute bar against a finding of duty. While reported decisions may provide some guidance, there is always a need for the court to adopt a pragmatic approach based on the particular facts of each case. Hamblen J inStandard Chartered Bank v Ceylon Petroleum Corporation[2011] EWHC 1785 (Comm) (“Ceylon”) stated (at [478]): In considering whether a duty of care arises and, if so, its scope, recent case law has emphasised the importance of a pragmatic approach which concentrates on the exchanges and dealings between the parties considered in their context rather than the application of high level statements of principle. Attention should be concentrated on “the detailed circumstances of the particular case and the particular relationship between the parties in the context of their legal and factual situation as a whole” –perLord Bingham inCommissioners of Customs & Excise v Barclays Bank[2007] 1 AC 181 at [8]. 120    DB and Dr Chang had an adviser-client relationship. However, labels such as “adviser” and “advisory relationship” are inherently ambiguous and reveal very little about the content of the relationship. Gloster J inJP Morgan Chase Bank (formerly known as The Chase Manhattan Bank) (a body corporate) and othersvSpringwell Navigation Corporation[2008] EWHC 1186 (Comm) (“Springwell”) emphasised that the factual matrix must be closely examined to determine whether a duty of care indeed arose on each particular set of facts. The principles laid down by Gloster J inSpringwellwere summarised by Hamblen J inCeylonat [508] into the following eight propositions: (1)    The term “advisory relationship” is ambiguous: “one has to be clear whether the term simply refers to a situation where A gives advice to B in the context of a commercial relationship; or whether the term necessarily connotes the existence of an obligation on the part of the provider of the advice to take reasonable care and / or to give advice about certain matters” (at [374]). (2)    Accordingly, the fact that a person, in the capacity of a salesperson, gives investment advice, “tells us nothing about what, if any, obligations were in fact owed … still less does it inform us to the extent of any such duties of care as were owed. In order to decide whether the advice given gave rise to obligations that went beyond the normal recommendations or “advice”, given in the daily interactions between an institution’s sales force and a purchaser of its products, so as to import obligations of the type owed by a fully-fledged investment advisor, one needs to look at all aspects of the objective evidence of the relationship between the parties” (at [374]). (3)    The real question, therefore, is not whether there was an “advisory relationship” between the parties but whether the giving of investment advice by a salesperson in that capacity attracts the obligations and duties of care of an investment advisor (para 451). In this respect, it is important to bear in mind that there is “a real distinction … between the investment advisor, properly so-called, who is retained to advise a client, usually backed by considerable research … and the advice or recommendations given by a bonds salesperson … as part of the selling process” (at [452]). (4)    It should be appreciated that the expressing of opinions and giving of advice is “part and parcel of everyday life of a salesman in emerging markets” (at [361]). (5)It follows that mere giving of advice, even specific investment advice, is not sufficient to establish a duty of care.This is the case even where the investment advice is relied upon by a customer: “The fact that…a salesman…was, in that capacity, giving such advice and making recommendations, and that the customer was taking the salesman’s advice and recommendations into account…does not in my judgment predicate that a duty of care arises on the party of the salesman. Reliance on its own, even if established, does not necessarily give rise to an advisory relationship, with consequential duties of care” (at [449]). (6)    Accordingly, the fact that a witness accepts that they were giving investment advice to a customer (as was the case inSpringwell) does not constitute an admission as to the existence of an “advisory relationship” in the relevant sense of that phrase (at [379]). (7)    Where phrases such as “trusted financial advisor” are used in internal documents, or even in correspondence between the parties, the court has to construe their meaning in the relevant context. Such words and phrases may be a mere “slogan” or “buzzword … intended to encourage relationship managers to maintain close relationships with their customers and to understand their business as a whole” (at [380]). (8)    The absence of any written advisory agreement “is a significant pointer against the existence of an advisory obligation” (at [440]). [emphasis added; emphasis in original omitted] 121    I agree that the mere giving of advice, even specific investment advice, is without more insufficient to establish a duty of care. I shall also disregard the slogans and buzzwords bandied by the parties and instead look at the facts in their entirety. 122    The primary enquiry focuses on the factors laid out by Gloster J inSpringwell, which are helpfully summarised inEllingerat pp 163–165: First a court should assess the customer’s degree of commercial sophistication and financial acumen .... Secondly, a court should examine the extent to which a bank has held itself out as offering advisory services or as a financial expert, whether orally, in its contractual documentation or in promotional literature .... Thirdly, a court should treat as relevant the status and role within the bank of any individual with whom the customer deals and the capacity in which that person tenders any alleged advice .... Fourthly, even in circumstances where the bank might otherwise have crossed the line, to become a financial adviser, a court must consider the possibility that the terms of the parties’ contractual relationship may operate to negate the existence of any implied or concurrent duty of care ... 123    I find that the RM had sought out Dr Chang, and arranged for the 15 March 2007 meeting where he recorded Dr Chang’s financial inexperience and that he was looking for advice to manage his new wealth. The RM then undertook to Dr Chang during the Presentation that DB was able to and would advise Dr Chang in managing his new wealth. As a result of the RM’s Presentation on 15 March 2007, Dr Chang was persuaded to retain the RM and DB to advise him on managing his new wealth. Although there was no express contract governing their relationship between March and August 2007, Dr Chang had in the interim sought and obtained the RM’s advice on how to transfer his Tanox Inc. founder shares. When Dr Chang received the funds from the sale of the Tanox Inc. shares in August 2007, he promptly opened an account with DB. Dr Chang’s lack of sophistication and his looking to the RM and DB to advise him in managing his new wealth was clearly demonstrated by the 15 March 2007 meeting and this was confirmed by the RM’s later recording of the same in the RM’s submission of Dr Chang’s CAPR 3 August 2007. 124    The absence of a specialised advisory agreement does not preclude in these factual circumstances the assumption of a duty of care by the RM and DB to advise Dr Chang in managing his new wealth. There was no follow-up action on the part of the RM or DB after the 15 March 2007 meeting until August 2007 when Dr Chang signed the account application form and placed deposits with DB. The RM and DB did not follow up by informing Dr Chang what services, advisory or otherwise, they would offer him. 125    I find that these unusual facts cross the line resulting in the RM and Dr Chang assuming a duty of care in advising Dr Chang on managing his new wealth from the 15 March 2007 meeting. What were the effect of the Service Agreement Disclaimers and the Derivative Disclaimers? 126    It is trite law that a general duty of care may arise as a concurrent tortious duty co-existing alongside contractual duties, to the extent that the contractual duty does not limit or exclude the tortious duty: seeHenderson v Merrett Syndicates Ltd[1995] 2 AC 145 andGo Dante Yap v Bank Austria Creditanstalt AG[2010] 4 SLR 916 (“Go Dante Yap”). In a banker-client relationship, the relationship between concurrent duties owed by the bank to the client in contract and tort is naturally a very close one. 127    The English courts have held that contractual disclaimers effectively exclude a concurrent tortious duty of care between commercially sophisticated parties where the bank was not acting as adviser: seeIFE Fund SA v Goldman Sachs International[2007] 2 Lloyd’s Rep 449. In the English High Court decision ofTitan Steel Wheels Ltd v The Royal Bank of Scotland plc[2010] EWHC 211 (Comm) (“Titan Steel”), Steel J reached a similar conclusion on similarly worded disclaimers (at [85]): I turn to the impact of these terms. In this regard there was some confusion in Titan’s case as to whether it was alleging a pre-existing duty of care at the time the products were purchased or that the Bank assumed a duty of care in respect to Ms Plested’s “advice”.But on either basis, I conclude that the terms outlined, taken as a whole, are only consistent with the conclusion that Titan and the Bank were agreeing to conduct their dealings on the basis that the Bank was not acting as an advisor nor undertaking any duty of care regardless of what recommendations, suggestions or advice were tendered. [emphasis added] 128    However, the decision inTitan Steelis of limited assistance in the present case. There is on these facts a complete asymmetry of commercial sophistication and experience between Dr Chang and the RM and DB such as would not necessarily exclude a concurrent duty of care. In any event, on these facts Dr Chang is relying on a pre-contractual duty of care. Evidential or contractual estoppels 129    The next issue is whether the Service Agreement Disclaimers or the Derivative Disclaimers operate as evidential or contractual estoppels resulting in Dr Chang being unable to establish a duty of care or its breach. The English courts have approached similar clauses through the lens of evidential or contractual estoppel. I start by noting that the position under English law with regard to the doctrines of evidential estoppel and contractual estoppel appear to be rather unsettled. 130    Evidential estoppel operates to prevent the party who has given an acknowledgment from asserting in subsequent litigation that the acknowledgment given to the same party is not true: seeE A Grimstead & Son Ltd v Francis Patrick McGarrigan[1999] EWCA Civ 3029 (“Grimstead”). The genesis of the doctrine of evidentiary estoppel appears to beLowe v Lombank Ltd[1960] 1 WLR 196 (“Lowe”), where Diplock J held (at [205]) that it must be shown that: (a)     The clause (acknowledgement) was clear and unambiguous; (b)     that the representee had intended the representor to act on the statements in the clause; and (c)     that the representor must have entered into the contract in the belief that they were true. 131    InGrimstead, Chadwick LJ further addressed the efficacy of such non-reliance clauses by stating that an acknowledgement of non-reliance was capable of operating as an evidential estoppel, especially in cases involving professionally-drawn commercial contracts between experienced parties of equal bargaining power: In my view an acknowledgement of non-reliance … is capable of operating as anevidential estoppel. It is aptto preventthe party who has given the acknowledgementfrom asserting in subsequent litigation against the party to whom it has been given that it is not true. That seems to me to be a proper use of an acknowledgement of this nature, which, as Mr Justice Jacob pointed out in theThomas Wittercase, has become a common feature of professionally drawn commercial contracts. … There are … at least two good reasons why the courts should not refuse togive effect to an acknowledgement of non-reliance in a commercial contract between experienced parties of equal bargaining power -a fortiori, where those parties have the benefit of professional advice.First, it is reasonable to assume that the parties desire commercial certainty. They want to order their affairs on the basis that the bargain between them can be found within the document which they have signed. They want to avoid the uncertainty of litigation based on allegations as to the content of oral discussions at pre-contractual meetings. Second, it is reasonable to assume that the price to be paid reflects the commercial risk which each party - or, more usually, the purchaser - is willing to accept. [emphasis added] 132    Subsequently, in England, the second and third requirements of the doctrine of evidential estoppel set out by Diplock J inLoweappear to have been watered down by the development of a new doctrine of contractual estoppel, starting fromPeekay Intermark Ltd & Anor v Australia and New Zealand Banking Group Limited[2006] EWCA Civ 386 (“Peekay”). InPeekay, the plaintiff was a company trading in a variety of investments such as bonds, bills, and derivatives. The plaintiff sued the defendant bank for damages for misrepresentation made as to the nature of certain bonds. The bank relied on certain non-reliance clauses. Moore-Bick LJ observed at [56] – [57] that the bank was entitled to do so on the basis of evidential estoppel as well as contractual estoppel: 56.    There is no reason in principle why parties to a contract should not agree that a certain state of affairs should form the basis for the transaction,whether it be the case or not. For example, it may be desirable to settle a disagreement as to an existing state of affairs in order to establish a clear basis for the contract itself and its subsequent performance.Where parties express an agreement of that kind in a contractual document neither can subsequently deny the existence of the facts and matters upon which they have agreed, at least so far as concerns those aspects of their relationship to which the agreement was directed. The contract itself gives rise to an estoppel: seeColchester Borough Council v Smith[1991] Ch 448, affirmed on appeal [1992] Ch 421. 57.    It is common to include in certain kinds of contracts an express acknowledgment by each of the parties that they have not been induced to enter the contract by any representations other than those contained in the contract itself.The effectiveness of a clause of that kind may be challenged on the grounds that the contract as a whole, including the clause in question, can be avoided if in fact one or other party was induced to enter into it by misrepresentation.However, I can see no reason in principle why it should not be possible for parties to an agreement to give up any right to assert that they were induced to enter into it by misrepresentation, provided that they make their intention clear, or why a clause of that kind, if properly drafted, should not give rise to a contractual estoppel of the kind recognised in Colchester Borough Council v Smith.However, that particular question does not arise in this case. … [emphasis added] 133    I note that while Moore-Bick LJ thought that a contractual estoppel was theoretically possible, he did not find that a contractual estoppel arose on the facts ofPeekay. The doctrine of contractual estoppel suggested by Moore-Bick LJ inPeekaywas adopted by Steel J inTitan Steel. The high watermark of the doctrine of contractual estoppel appears to be the decision of the English Court of Appeal inSpringwell Navigation Corporation v JP Morgan Chase Bank & Ors[2010] EWCA Civ 1221 (“Springwell Navigation”), where Aikens LJ held at [143] that parties could by contract agree on the state of affairs upon which a contract was made: If A and B enter into a contract then, unless there is some principle of law or statute to the contrary, they are entitled to agree what they like ... [T]here is no legal principle that states that parties cannot agree to assume that a certain state of affairs is the case at the time the contract is concluded or has been so in the past,even if that is not the case, so that the contract is made upon the basis that the present or past facts are as stated and agreed by the parties. [emphasis added] 134    It is important to note that the both above decisions inTitan SteelandSpringwell Navigationinvolved actions by bank customers against banks in their capacity as derivative counterparties. The English courts’ approach has been that it is undesirable for courts to intervene in commercial transactions between parties of equal bargaining power, especially where such parties had the benefit of professional legal advice. The role of the court is to allow parties to allocate their respective risks and responsibilities, and not to re-write their agreement so as to undermine reasonable commercial expectations:Ceylonat [572]. 135    In Singapore, the leading case on the doctrines of evidential and contractual estoppel is the Court of Appeal decision inOrient Centre Investments Ltd and another v Société Générale[2007] 3 SLR(R) 566 (“Orient”), which involved an application to strike out the plaintiffs’ claims against a bank for misrepresentations, breach of fiduciary and other duties and negligence in relation to structured financial products. The Court of Appeal inOrientaffirmed the High Court’s decision to strike out the plaintiffs’ claims. Although it was not necessary for the court to consider the effect of the particular terms on the relevant claims, the Court of Appeal nevertheless observed at [50] that: In our view, the combined effect of the express general and specific terms and conditions applicable to the structured products provides an insuperable obstacle to any claim by the [plaintiffs] against [the defendant] based on the alleged breach of representations or duties, fiduciary or contractual or on negligence on the part of [the second plaintiff]. 136    DB relies onOrientto argue that the Service Agreement Disclaimers or the Derivative Disclaimers were sufficient to prevent any duty of care from arising or estopping Dr Chang. However, it is important to note that both plaintiffs inOrientwere financially sophisticated parties: the first plaintiff was an investment company, whilst the second plaintiff was a knowledgeable financial investor. At least with respect to relatively unsophisticated customers, the Court of Appeal appears to have subsequently retreated somewhat from its previous position inOrientthat express terms in banking documents provided an “insuperable obstacle” to any claim based on alleged breaches or duties, whether fiduciary, contractual or tortious. Recently, in the Court of Appeal decision ofAls Memasa and another v UBS AG[2012] SGCA 43 (“Als Memasa”), Chan Sek Keong CJ held at [29] that it may be desirable for the courts to reconsider whether financial institutions should be entitled to invoke such non-reliance clauses against unsophisticated customers: However, in the light of the many allegations made against many financial institutions for “mis-selling” complex financial products to linguistically and financially illiterate and unwary customers during the financial crisis in 2008,it may be desirable for the courts to reconsider whether financial institutions should be accorded full immunity for such “misconduct” by relying on non-reliance clauses which unsophisticated customers might have been induced or persuaded to sign without truly understanding their potential legal effecton any form of misconduct or negligence on the part of the relevant officers in relation to the investment recommended by them. [emphasis added] 137    On the facts before me, I find that DB has failed to establish an evidential estoppel because the second element ofLowe(ie, that the representee had intended the representor to act on the statements) was not satisfied. There was no evidence to suggest that the relevant disclaimers were even brought to Dr Chang’s attention. The case might have been different had Dr Chang been told by the RM before he signed the account application form that he could not rely on the RM and DB to exercise reasonable care in advising him on managing his new wealth but that he should retain his own independent professional or legal advisors to advise him on any service or transactions he would enter through or with the RM and DB. 138    Given the Court of Appeal’s observations inAls Memasa, I would be extremely hesitant to apply the doctrine of contractual estoppel developed in the line of cases followingPeekay. Although I am bound by the Court of Appeal’s decision inOrient, that case can be distinguished from the present case on the basis that Dr Chang was known to the RM and DB to be financially inexperienced and the RM and DB themselves have the expertise and undertook pre-contractually to advise him in managing his new wealth. I further find that even if the doctrine of contractual estoppel did operate in Singapore, that the precondition to its operation,viz, the clear intention for it to operate, has not been established on the evidence before me. 139    I accept Lord Millett’s expert opinion that the Derivative Agreement under English law governs relevant individual transactions of purchase or sale which DB carried out on Dr Chang’s instructions. It is my finding that the Derivative Agreement does not affect DB’s liability for any assumption of a duty of care which had arisen previously and where the issue in question has nothing to do with the validity and effect of the DSPPs purchased under the Derivative Agreement. Was the duty of care breached? 140    Having found that DB had assumed a duty of care, and such a duty was not negated, nor estopped by the doctrines of evidential and contractual estoppel, the next question is whether the RM and DB had breached this duty of care. 141    Up to 1 August 2007, nothing took place with respect to Dr Chang other than the provision of advice by the RM and DB to Dr Chang on how Dr Chang’s Tanox Inc. founder shares could be transferred. No other advice was provided to Dr Chang and no other specialised services were provided to him. There were no acts or omissions by the RM and DB during this period from which any claim for failure to take reasonable care arose. 142    The crux of Dr Chang’s claim for the RM’s and DB’s alleged failure to exercise reasonable care arises from the losses Dr Chang suffered by reason of his purchases of 34 international bank share DSPPs from DB between 19 November 2007 and February 2008. The duty of care which was assumed was a duty to take reasonable care to advise Dr Chang on managing his new wealth; which necessarily meant in this factual matrix (i) to advise Dr Chang on preserving, growing and investing his US$ 118 million; (ii) provide him with advice on appropriate asset allocation and investment strategies in light of his investment objectives; and (iii) advise him on the risks of the recommended investment products. 143    The factual matrix reveals the following: First, the RM and DB sold Dr Chang 34 DSPPs concentrated on international bank shares and in particular Citigroup DSPPs. They were sold to Dr Chang over a short period of about 3 weeks in November to December 2007. The evidence shows that in the month of November 2007 the magnitude of DSPPs discount to market price of Citigroup shares ranged from 20.6% on 19 November 2007, down to a deep discount of 35.6% on 27 November 2007 and ended on 30 November 2007 at the discount of 22.15%. Such deep discount reflects the market’s pricing of the risk, quite apart from the volatility reflected during this period. Neither the RM nor DB had drawn Dr Chang’s attention to his fast escalating risks over this short period, nor did they provide him with any risk management advice. 144    The RM applied for and DB extended unsolicited and unilateral margin trading facilities to Dr Chang. Dr Chang was not asked nor was he advised of the multiplication risks of margin financing, even though both the RM and Dr Chang knew that he had recently received US$ 118 million and that he was financially inexperienced. The margin facility was triggered automatically without his concurrent knowledge when he made his first purchase of a Citigroup DSPP on 19 November 2007. The evidence reveals that this was made prior to his signing and prior to DB’s execution and despatch of the Derivative Agreement and necessarily prior to the bank sending him the Margin Trading Facility letter which informed him of its availability. 145    I note also the material changes in Dr Chang’s recorded risk profile in the CAPR 3 August 2007 and those recorded in 19 November 2007 which ought to have triggered an internal DB enquiry but passed unnoticed by DB. Furthermore, the sudden recorded changes in Dr Chang’s risk profile between the CAPR 3 August 2007 and Margin Trading Checklist dated 19 November 2007 appears not to have been noticed or, if noticed, did not result in any enquiry. As Dr Chang proceeded to purchase 32 international bank share DSPPs in quick succession within a short period of about three weeks, the RM and DB failed to alert him to his accumulating, concentrated and multiplying risks. They did not inform him of his total accumulating exposure and they failed to provide him with any risk management advice. 146    In the light of the above circumstances, I find that the RM and DB failed to take reasonable care in advising Dr Chang on managing his new wealth. I shall deal with Dr Chang’s claim for damages for breach of the duty of care.",
        "Damages": "147    Given my finding that Dr Chang has succeeded in his claim for breach of duty of care, I now come to the issue of damages. Quantification of damages for breach of duty of care 148    The law governing damages for breach of duty of care is relatively well-settled in Singapore by the Court of Appeal decision inSunny Metal & Engineering Pte Ltd v Ng Khim Ming Eric[2007] 3 SLR(R) 782 (“Sunny Metal”), where the court held at [50] that the plaintiff had the burden of establishing causation both in fact and in law, and that the damage suffered was not too remote. 149    I have found that the duty of care had arisen pre-contractually. I have also found that, from Dr Chang’s purchase of his first DSPP and right up to the purchase of his last DSPP, all the losses that Dr Chang suffered were caused in fact and in law by the RM and DB’s breach of duty of care. Dr Chang’s total loss caused by the RM and DB’s breach of duty of care comprised the amounts and assets he deposited with DB as well as the margin call top ups which he quantifies to be US$49,047,721.12 which was not challenged in the plaintiff’s closing submissions. DB’s claim 150    I note that DB has claimed US$1,788,855.41 as owing by Dr Chang by reason of his DSPP purchases net of DB having appropriated Dr Chang’s deposits assets and margin top ups and sale of accumulated shares. In the light of DB’s liability for damages for breach of its duty of care to Dr Chang, this sum is not payable by Dr Chang. Interest 151    In addition to damages, Dr Chang claimed compound interest, or, in the alternative, simple interest pursuant to s 12 of the Civil Law Act (Cap 43, 1999 Rev Ed). On this issue, Dr Chang submitted that the law relating to compound interest laid down by the House of Lords inSempra Metals Ltd(formerly Metallgesellschaft Ltd)v Inland Revenue Commissioners and another[2008] 1 AC 561 (“Sempra”) should be followed in Singapore. 152    Previously, the equitable jurisdiction for courts to grant compound interest only existed in cases involving deceit or equitable fraud, such as misapplication of funds by fiduciaries in breach of their fiduciary duties. However, this rule was abolished by the House of Lords inSempra, where it was held that the award of compound interest was no longer so restricted.Semprawas followed locally by Chan Seng Onn J inThe Oriental Insurance Co Ltd v Reliance National Asia Re Pte Ltd[2009] 2 SLR(R) 385 (“Oriental Insurance”), whose analysis I agree with. InOriental Insurance, Chan J concluded at [137] that: For the reasons I have stated, I would follow this decision of the House of Lords inSempra Metalsand it also accords with commercial and economic reality because a claimant in long-running case such as this will be severely under-compensated in damages were the court to have power only to award simple interest and no discretion to award any compound interest even in a deserving case.The correct legal position in Singapore is that the courts are not so hampered and have an unfettered discretion to award simple or compound interest as damages as is appropriate that would justly compensate the person for the loss that he has suffered. [emphasis added; emphasis in original omitted] 153    Lord Nicholls inSempraheld (at [601]) that there were no special rules for the proof of facts in order to justify an award of compound interest. The award of compound interest would still be subject to the usual burdens of proof and the usual principles governing damages for the pleaded cause of action. Dr Chang submitted that but for the RM and DB’s breach of duty of care, he would not have applied the cash deposits in his account towards the purchase of the DSPPs and would have placed them in safer interest bearing deposits. 154    Whilst I accept the principle that compound interest might in the discretion of the court be awarded in an appropriate case, to award compound interest on the basis of speculating what Dr Chang might have otherwise done would be unwarranted. Accordingly I would award the normal simple interest starting from 21 November 2008, being the day Dr Chang’s losses were actualised through DB’s closing out of his account, until the date of full payment by DB.",
        "Conclusion": "155    Given that I have found that Dr Chang had succeeded on his counterclaim against DB for breach of duty of care, I award Dr Chang damages of US$49,047,721.12, with simple interest commencing from 21 November 2008 until the date of full payment by DB. Costs to Dr Chang are to be agreed or taxed. 156    This action necessarily generated multi-jurisdictional legal issues which required close analysis and understanding. I would like to record my deep appreciation to the English law experts, Lord Millett and Mr Craig Orr QC, the Hong Kong law experts, Mr Anderson Chow SC and Mr Adrian Bell SC and Professor Ho Yew Ee, for their valuable expert evidence of English law, Hong Kong law and investor behaviour respectively. I should also record my appreciation to both Singapore legal counsel, Mr K Muralidharan Pillai and Mr Ang Cheng Hock SC for their able conduct of this case."
    }
}