{
    "case_title": "Intuition Publishing Ltd\n      v\n      Intuition Consulting Pte Ltd",
    "ncitation": "[2012] SGHC 149",
    "coram": "Judith Prakash J",
    "sections": {
        "Background": "8       On 23 May 2007, Mr Simon Banks (“Mr Banks”), the Executive Vice President of the plaintiff, had a telephone conversation with the defendant’s Chief Operating Office, Mr Robert Plant (“Mr Plant”). According to Mr Banks he had explained to Mr Plant the extent of the plaintiff’s rights to the Marks, but the response was that the defendant did not provide identical products and/or services since the defendant did not deal with pre-prepared courses. Mr Plant told Mr Banks that the plaintiff and the defendant were in completely different industries. 9       The plaintiff said that it subsequently discovered that the defendant had been offering similar, if not identical, goods and/or services as those provided by the plaintiff even before May 2007. This prompted the plaintiff to instruct its Irish solicitors to send a cease and desist letter to the defendant on 8 August 2008, demanding that the defendant immediately cease its use of the “INTUITION” mark and transfer the domain name <www.intuition.com.sg> to the plaintiff. This was followed by a second letter when there was no response from the defendant. It was only the third cease and desist letter sent on 26 November 2008 by the plaintiff’s Singapore lawyers that provoked a response. On 22 December 2008, the defendant refused to accede to the plaintiff’s demands. 10     The plaintiff’s Singapore lawyers subsequently sent another letter to the defendant’s solicitors. The defendant once again rejected the plaintiff’s demands, prompting the plaintiff to commence the present action some time later. 11     The plaintiff’s evidence was that when it was established in 1985, it supplied computer-based education and training to persons working in the financial markets. Since then it has grown to become a leading provider of technology-enabled learning to a broad range of industries including financial services, medicine and life science and to the government and public sector. The plaintiff says that it is a leading developer of “eLearning” content – both custom and off-the-shelf products. It designs and delivers learning programs that align training investments with business results. All the plaintiff’s courses may be delivered via the internet, through corporate intranets or via CD-Roms. It provides products and services that enable its clients to author, manage and deploy a range of learning activities including eLearning, mobile learning and instructor-led events. 12     The defendant emphasised that it does not market its services to the general public. It named Hewlett-Packard, Cisco Systems and Nokia as providing 80% of its business while another 18% comes from Microsoft, Intel and Google. The remaining two percent is from other multinational IT companies. The services provided by the defendant to its customers are channel and sales programs; design services (that is putting content together for training purposes); product sales training; business acumen training; consulting services; and materials used in relation to the foregoing. The defendant said that it only provides bespoke services and products. There are no “ready-made”, off-the-shelf, products that a customer can buy online. The defendant designs courses to meet each client’s specific requirements and prepares specific course materials for each course in coordination with the client concerned.",
        "Pleadings": "13     The plaintiff’s Statement of Claim (Amendment No. 1) contains the following particulars of infringement in relation to the Marks: a.    The Defendant has since 1999 provided bespoke consulting and training services under the INTUITION Sign. In particular, the Plaintiff relies on the fact that these services have been offered by the Defendant on its website, namely www.intuition.com.sg (the “Defendant’s Website”), since 2000. b.    According to the Defendant’s Website, the Defendant provides consulting services on: “channel profitability”; “business strategy design”; “route-to-market planning”; “partner advisory boards”; “services strategy”; and “sales deployment”. The Defendant claims that these consulting services are aimed at helping its customers implement effective channel strategies, build partner loyalty and develop sales force effectiveness. c.    According to the Defendant’s Website, the Defendant provides business acumen training on: “training”; “instructional design”; “channel, sales, finance and business management programs”; “content research and development”; “blended learning frameworks”; “traditional and web 2.0 deployment”; and “post-training monitoring and ROI modeling”. In particular, the Plaintiff relies on the fact that the Defendant offers training courses on: channel finance; business finance; financial management; organisational strategy; strategic thinking; business strategy planning; profit-driven sales techniques; profit sales strategy; building a business profit strategy; and retail management. The Defendant claims that its business acumen training provides blended learning solutions based on best practices in high-tech channels and sales. d.    According to the Defendant’s Website, the Defendant provides product sales training on: “sales process alignment”; “product sales enablement”; “training content creation”; “sales message simplification”; “presentation design”; and “training packages”. The Defendant claims that its product sales training turn its customers’ product, technical and customer information into highly effective sales and channel training. e.    The Defendant offers the abovementioned consulting and training services under the INTUITION Sign via a “blended” training programme that consists of both e-learning and instructor-led workshops. Apart from the Defendant’s existing training programmes, the Defendant also offers bespoke training programmes that are customised to the requirements of each individual customer. f.    The Defendant also provides training materials for its training programmes, both online through the Internet and through computer programmes, and off-line through data storage devices and printed matter. 14     It is clear from the plaintiff’s pleadings that only two types of infringing goods and services are alleged: (a)     the bespoke consulting and training services (the “Bespoke Services”); and (b)     the materials prepared for its training programmes (the “Training Materials”). 15     In its closing submissions, however, the plaintiff also alleged that the defendant has used the Signs in relation to the following goods: (a)     Computers; (b)     Sales kits, booklets and other content in relation to computers; and (c)     Newsletters. Since these items do not fall within the plaintiff’s pleaded case, they must be disregarded when the similarity of the defendant’s goods and services to those protected by the Marks is assessed.",
        "Claims under s 27 of the Act": "16     Section 27 of the Act reads: Acts amounting to infringement of registered trade mark 27. —(1) A person infringes a registered trade mark if, without the consent of the proprietor of the trade mark, heuses in the course of tradea sign which is identical with the trade mark in relation to goods or services which are identical with those for which it is registered. (2)    A person infringes a registered trade mark if, without the consent of the proprietor of the trade mark, heuses in the course of tradea sign where because — (a)    the sign is identical with the trade mark and is used in relation to goods or services similar to those for which the trade mark is registered; or (b)    the sign is similar to the trade mark and is used in relation to goods or services identical with or similar to those for which the trade mark is registered, there exists a likelihood of confusion on the part of the public. (3)    A person infringes a registered trade mark which is well known in Singapore if — (a)    without the consent of the proprietor of the trade mark, heuses in the course of tradea sign which is identical with or similar to the trade mark in relation to goods or services which are not similar to those for which the trade mark is registered; (b)    the use of the trade mark in relation to those goods or services would indicate a connection between those goods or services and the proprietor; (c)    there exists a likelihood of confusion on the part of the public because of such use; and (d)    the interests of the proprietor are likely to be damaged by such use. ... [emphasis added] 17     It can be seen from the language of the section that a common requirement to be satisfied in an action for infringement of a plaintiff’s trademark is that the plaintiff establish that the infringing party has used “in the course of trade” a sign which is identical or similar to the trademark. In closing, the plaintiff argued that the defendant had used the Signs in the course of trade. The defendant noted that this was a requirement but did not make any assertion that it had not used the Signs in the course of its trade or business. The evidence established that the defendant had used all of its Signs in relation to the Bespoke Services because it had offered these services under Signs B, E, F and G by way of its website and business proposals, had used Signs A, C, D, E and G on its invoices and used Signs B, F and G in advertising the Bespoke Services. It had also applied its Signs, apart from Sign B, in one or more Training Materials and invoices relating thereto. The defendant must have realised that this legal requirement had been amply satisfied and therefore offered no argument on the same. 18     I now turn to consider the individual subsections of s 27 and whether there was infringement under any of them.",
        "The claim under s 27(1) of the Act": "19     In order for a claim under s 27(1) of the Act to succeed, the plaintiff must prove the following elements: (a)     The Signs are identical to one or more of the plaintiff’s Marks; and (b)     Any such identical Sign(s) and Mark(s) are applied on identical goods. While the plaintiff had pleaded a claim under s 27(1) in relation to all of the Signs, in its closing submissions the plaintiff restricted its claim under s 27(1) of the Act to Signs A to E. Therefore, I need deal only with these Signs. Likeness of the plaintiff’s Marks and the defendant’s Signs 20     The Court of Appeal inCity Chain Stores (S) Pte Ltd v Louis Vuitton Malletier[2010] 1 SLR 382 (“City Chain”) affirmed the strict approach in examining the degree of likeness to each other of marks or signs under s 27(1) of the Act, holding that minor differences would make a mark and sign non-identical (City Chainat [39]). The Court of Appeal explained the rationale for such a strict approach: The protection accorded under this provision cannot be extended beyond the situations for which it was envisaged, in particular, to those situations more specifically covered by another provision,eg, s 27(2)(b) of the Act on similar goods or services or where the sign is similar: see SASociété LTJ Diffusion v SadasVertbaudet SA[2003] FSR 34 at [50]. Such a strict approach is taken with regard to s 27(1) of the Act because once a case is shown to fall within that provision, protectionipso factofollows, irrespective of whether there is proof of likelihood of confusion on the part of the public. The Court of Appeal continued: Reed Executive plc v Reed Business Information Ltd[2004] RPC 40 provides a useful illustration. There the court, confronted with the question of whether \"Reed Business Information\" was identical to \"Reed\", held that it was not ... 21     In its closing submissions, the plaintiff relied onPan-West (Pte) Ltd v Grand Bigwin Pte Ltd[2003] 4 SLR(R) 755 (“Pan-West”) to argue that to establish that a mark and sign are identical, it would suffice if the distinctive and dominant components of the alleged infringing sign are identical to the registered trade mark (the “broader approach”). However, inThe Polo/Lauren Co, LP v Shop In Department Store Pte Ltd[2006] 2 SLR(R) 690 (“Polo”), the Court of Appeal cast doubt on this aspect ofPan-Westwhen it said: 20    InPan-West (Pte) Ltd v Grand Bigwin Pte Ltd[2003] 4 SLR(R) 755, (“Pan-West”), where the contest was between “Katana Golf” and “Katana”, the court held the two marks were identical as the main thing in the registered mark “Katana Golf” was really “Katana”. Relying on the case, the appellant argued that if in that situation the court could hold that the two marks were identical, even though they were not really so, then the court should, in the present case, hold that the appellant’s mark and the respondent’s sign were at least similar. We recognise that there could be a difference of views as to whether “Katana” could really be said to be identical to “Katana Golf”. 21    On the other hand, inOrigins Natural Resources Inc v Origin Clothing Ltd[1995] FSR 280, the court held that “Origin” was not identical to the registered mark “Origins” because of the omission of the letter “s”. This case shows a stricter approach to the question of what is “identical”. And this was further elucidated by the European Court of Justice in the case ofSA Societe LTJ Diffusion v SadasVertbaudet SA[2003] FSR 34 [“Sadas”], where it said (at [50]): The criterion of identity of the sign and the trade mark must be interpreted strictly. The very definition of identity implies that the two elements compared should be the same in all respects. 22     The Court of Appeal did not expressly overrulePan-WestinPolobecause there was no issue in that case of whether the sign of the respondent was identical to the mark of the appellant. What the court was concerned with was similarity of the sign and the mark. When it came toCity Chain, however, the court had to consider the issue of whether the sign was identical with the mark. In coming to its conclusion that the two were not identical, the Court of Appeal adopted the strict approach advocated bySadas. Although it did not expressly mentionPan-West, the effect of the court’s decision inCity Chainis thatPan-Westhas been overruled. Accordingly, I consider that the broader approach to determining whether marks and signs are identical under s 27(1) of the Act adopted inPan-Westcan no longer be applied. 23     Applying the strict approach in determining likeness of marks and signs, it is clear that none of the Signs are identical to the plaintiff’s word plus device Marks because these Marks contain the plaintiff’s device while none of the defendant’s Signs contain the same device. 24     As regards the plaintiff’s word Marks, Signs A and B are identical to the plaintiff’s word Marks. This is because a mark registered in upper case in plain font covers all stylistic permutations of the mark. (SeeFerrero SPA v Sarika Connoisseur Cafe Pte Ltd[2011] SGHC 176 (“Ferrero”)). 25     The other Signs,vizC, D and E, are not identical to the word Marks. Signs C and D have the addition of the word “Consulting” while Sign E has the addition of the words “Consulting Pte Ltd”. Are the goods and services identical? 26     I must next consider if the goods and services in respect of which Signs A and B are used are identical to the specifications of Marks A and B. The plaintiff submitted that when determining the nature of goods under s 27(1) of the Act, only the specifications need to be compared. It argued that a global assessment of the facts using the factors inBritish Sugar Plc v James Robertson & Sons Ltd[1996] RPC 281 (“British Sugar”) would only be necessary if the goods are not found to be identical and the court moves on to considering similarity. The plaintiff citedRichemont International SA v Goldlion Enterprise (Singapore) Pte Ltd[2006] 1 SLR(R) 401 (“Richemont”) for this proposition. This proposition was also endorsed by Professor Ng-Loy Wee Loon in her bookLaw of Intellectual Property of Singapore (Revised Edition)(Sweet & Maxwell: 2009, Singapore). InFerreroChan J agreed and said at [78] that once it has been determined that the goods are identical from a comparison of the goods’ specifications, there is no need to consider theBritish Sugarguidelines. 27     I therefore move to compare the goods and services for which the defendant has used Signs A and B with the specifications for Marks A and B. 28     There is evidence that Sign A has been used in relation to both the Bespoke Services and the Training Materials and Sign B has been used in relation to the Bespoke Services. Adopting the plaintiff’s submissions on the functions of punctuation marks in a trade mark’s specifications, the specifications for Marks A and B can be expressed as follows: (a)     Mark A (“INTUITION”): Class 16 (i)       Tapes and cards, none being magnetic, for the recordal of computer programmes, not including computer manuals or printed matter relating to computer games (ii)       Paper for the recordal of computer programmes, not including computer manuals or printed matter relating to computer games (iii)       Computer manuals (handbooks) and printed matter not including computer manuals or printed matter relating to computer games (b)     Mark B (“INTUITION”): Class 9 (i)       Computers (ii)       Electronic data input and output apparatus for use with computers (iii)       Computer programmes (iv)       Disc tapes and wires, being magnetic and for the storage of computer programmes (v)       Electronic apparatus for the transmission of data (All not including computer games or goods for use with computer games) It can immediately be seen that the specifications of Marks A and B relate togoods. Hence, it is clear that the defendant’s Bespoke Services are not identical to the specifications of Marks A and B. 29     As for the Training Materials, the plaintiff submitted that they are identical to all of the specifications registered for Marks A and B save for the specification “Tapes and cards, none being magnetic”. I do not accept this submission. 30     First, the defendant’s Training Materials are not identical to the plaintiff’s specification “Paper for the recordal of computer programmes, not including computer manuals or printed matter relating to computer games” registered for Mark A, and the specification “Computer programmes” registered for Mark B. As regards the specification “Paper for the recordal of computer programmes”, it is clear that the Training Materials recorded on compact discs are not identical to this specification. As for the Training Materials recorded on paper, the evidence showed that these materials consisted mainly of the defendant’s presentation slides printed on paper. This constitutes recordal ofcontentcreated by computer programmes rather than computer programmes themselves. This distinction can also be seen in the following excerpt of the cross-examination of Mr McGrath, the defendant’s founder and chief executive: Q:So Mr McGrath, your Flash pointpresentations, whatprogrammesare they written on? A:So on PowerPoint, which is one of the programmes that Microsoft builds like Word. But you can produce more graphics on PowerPoint. And with Flash you can produce interactivity. Q:Flash is a programme? A:It is a programme produced by Macromedia. ... Q:So you use Flash in order to create interactive files. ... A:Yes,we use the programme to create content. Q:And what are your SWF files? A:It is like – when Microsoft Word has a dot something – I can’t remember what it is called – a D-O-C, you name your file something .doc. With PowerPoint it is .ppt, and for Flash it is .swf and it is called “SWF”. Q:So, the SWF file is built using the SWF programme created by Macromedia, is that what you’re saying? A:That’s what I’m saying. Q:And you’re saying you provide content, not the programme? You use the programme to convey your content? A:Yes. [emphasis added] This distinction between computer programmes andcontentcreated by computer programmes also means that the defendant’s Training Materials are not identical to the specification “Computer programmes” registered for Mark B. 31     Next, the defendant’s Training Materials are not identical to the plaintiff’s specification “Computer manuals (handbooks) and printed matter, not including computer manuals or printed matter relating to computer games” registered for Mark A. Again, it is clear that the Training Materials provided online and those recorded in the medium of compact discs are not identical to this specification. As regards the defendant’s presentation slides printed on paper, it is also clear that they are not identical to “computer manuals” or “computer handbooks” because they do not instruct readers on how to use computers. 32     As to whether or not the defendant’s Training Materials fall within the specification “printed matter”, the plaintiff contended that the defendant’s presentation slides printed on paper definitely did so. The defendant’s response was that “printed matter” in this specification only covers printed matter related to computers for the following reasons: (a)     The specifications for Mark A (reproduced at [2] above) refer only to computers and materials related to computers; (b)     The words “printed matter” are  part of “computer manuals and printed matter” and should be read in relation to “computer manuals”; (c)     The qualification “not including computer manuals or printed matter relating to computer games” must restrict the scope of “printed matter” to printed matter related to computers. The defendant further contended that this interpretation of the plaintiff’s specifications was supported by the plaintiff’s specifications for Mark D which is registered in the same class as Mark A,viz, class 16. 33     The plaintiff registered the following specifications for Mark D: (a)     Computer manuals and printed matter; (b)     Books and publications; (c)     Training, educational and reference books, booklets, instructional materials and newsletters relating to the field of financial services. The defendant argued that if the specification for “computer and manuals and printed matter” under Mark D covered all printed matter, there would have been no need to include the other specifications for Mark D. The plaintiff’s reply was that both the broad and narrow specifications were included within Mark D as part of a common and prudent practice used by trade mark proprietors to maximise their protection against infringing goods and/or services. With respect, this argument appears specious. If the reason for the registration of broad and narrow specifications in Mark D was indeed that this is a common and prudent practice of trade mark proprietors, the plaintiff has not explained why this practice was not adopted for its other Marks. In my judgment, the defendant’s explanation as to the interpretation of the specifications for Mark D makes more sense. 34     Further, the plaintiff could have, but did not, include in the specifications for Mark A the specifications which it did for Mark D, in particular, the specification “Training, educational and reference books, booklets, instructional materials and newsletters”. Having omitted such additional specifications, the plaintiff must have intended that the term “printed matter” in the specification “Computer manuals (handbooks) and printed matter” would be limited to printed matter relating to computer manuals, like computer sales kits and booklets. I find therefore that the defendant’s Training Materials are not identical to the specifications for Mark A. 35     The plaintiff also argued that the defendant’s use of Signs A and B in relation to sales kits and other related content for persons selling Hewlett Packard personal computers and also in relation to the defendant’s website was covered by “Computers” in its specification for Mark B. As pointed out earlier, the plaintiff did not plead these allegations. In any case, it would be straining the meaning of the word “Computers” to find that sales kits and related material and websites are identical to computers. This objection also applies to the plaintiff’s argument that the defendant’s Training Materials in the form of electronic “SWF” files are similarly covered by “Computers”. 36     The plaintiff made an argument that the defendant’s use of Sign A on one of its invoices which referred to two computer models, amounted to use of the sign in relation to “Computers”. When Mr McGrath was asked about this, however, he explained that the reference in the invoice was not to the sale of any computer. What the invoice referred to was the sales kit that the defendant had created for Hewlett-Packard to assist it and its distributors in the marketing of the two computer models mentioned on the invoice. There is no reason to doubt this explanation as the defendant is not in the business of selling computers but instead provides customised sales material and training which is not at all the same thing. 37     The plaintiff’s final argument in this connection was that the defendant’s use of one of its Signs on an invoice that showed a sale to an employee of a computer amounted to use in relation to “Computers”. This argument is open to two objections, the first being that the defendant’s evidence was that the transaction was not a sale but was a reimbursement to an employee of the cost of a computer which that employee had purchased for his work. Even if it had been a sale to the employee, my view is that this would bedeminimisas the defendant was not trading in computers to the public at large but only supplying one of its own employees with the machine. In any case, an examination of the invoice shows that only Signs E and G which are not identical to the word Marks were used on that invoice. Therefore this argument does not assist the plaintiff in its claim under s 27(1). 38     Next, the plaintiff contended the defendant’s use of Signs A and B in relation to its website and its SWF files fell under the above specifications. However, the plaintiff did not plead that the defendant’s website infringed its Marks. Further, neither the website nor the SWF files can easily be classified as “apparatus” for use with computers since the word “apparatus” refers to a tangible item rather than to intangible ones. In this connection, it is relevant that Mark B was registered in 1986 when both websites and SWF files were uncommon even if they existed at all and it is thus highly unlikely that by using the word “apparatus” the plaintiff intended to cover items of this nature. I do not accept this argument made by the plaintiff. 39     I also find that the defendant’s Training Materials are not identical to the specification “disc tapes and wires, being magnetic and for the storage of computer programmes”. This specification only relates to magnetic disc tapes. It does not apply to compact discs which are not magnetic but optical devices. The plaintiff could have protected compact discs and optical devices under Mark B, as this is permitted under Class 9, but since it did not do so, it has no basis to complain that the defendant’s Training Materials in that form are infringing its Marks.",
        "The claim under s 27(2)(b) of the Act": "40     In order for a claim under s 27(2)(b) to succeed, the plaintiff must prove similarity of Marks and Signs, usage of the same in relation to similar goods or services, and a likelihood of confusion. 41     When considering whether a Mark and a Sign are similar, the court considers whether there is visual, aural and conceptual similarity between the two. This exercise is entirely a question of fact (Johnson & Johnson v Uni-Charm Kabushiki Kaisha[2007] 1 SLR 1082). The courts have taken a two-step approach to this exercise in that they have considered both similarity to and the distinctiveness of the trademark that has allegedly been infringed. InOzone Community Corp v Advance Magazine Publishers Inc[2010] 2 SLR 459 the two steps were undertaken in the order mentioned but inPolothe Court of Appeal first discussed whether or not the word “POLO” was distinctive before moving on to discuss whether or not the marks and signs were similar. It may be helpful in this case to adopt that order asPolohas indicated (at [10]) that a more distinct mark generally receives greater protection, that is, a higher degree of alteration of the allegedly infringing sign is needed to make it dissimilar from a distinct registered mark. Thus, determining distinctiveness first would make it easier to decide on the similarity of the mark and the design when one moves to aural, visual and conceptual similarity. 42     Concerning the distinctiveness of a word mark, thePolojudgment contains the following observations (at [23]): (a)     Some marks are inherently distinctive because they consist of inventive words without any notional or allusive quality, for example, “Volvo”; (b)     Where common words are included in a registered mark, the courts should be wary of granting a monopoly in their use; (c)     Any alleged distinctiveness must be acquired through use; and (d)     It does not follow that the incorporation of an entire registered word mark in an allegedly infringing sign would automatically lead to infringement. 43     InDoctor’s Associates Inc v Lim Eng Wah (trading as SUBWAY NICHE)[2012] SGHC 84 (“SubwayNiche”), citingLloyd Schuhfabrik Meyer & Co GmbH v Klijsen Handel[1999] 2 CMLR 1343, a decision of the ECJ, I held that the following factors may be relevant in determining whether a mark has acquired distinctiveness through use: (a)     The market share held by the registered mark; (b)     The nature of the use (whether or not it was intensive, widespread, long-standing); (c)     The amount invested in promoting the mark; (d)     The proportion of the relevant class of individuals who identify goods sold under the mark as from a particular source; and (e)     Statements from trade associations and chambers. Of course, not all the factors would be present or play a significant part in every case. 44     It would also appear that where a particular mark is always used in conjunction with other marks or signs, extensive use of the mark may not result in the acquisition of distinctiveness through use.Polowas a case of this kind. It was found there that the appellant had not done anything either to promote or use the mark “POLO” on its own, but had always used and linked the mark “POLO” with “RALPH LAUREN”. The Court of Appeal held, therefore, that the word mark “POLO” had not acquired distinctiveness through use. Distinctiveness 45     The word “intuition” is an ordinary English word, not an invented word. However, it does not necessarily follow that an ordinary English word can never be inherently distinct when used as a word mark. InPontiac Marina Pte Ltd v CDL Hotels International Ltd[1997] 1 SLR(R) 422 (“CDL-HC”), one of the issues the High Court had to decide was whether the word “Millenia” was a descriptive word or a fancy one in the context of a passing off claim. Chao Hick Tin J was of the view that it was not a wholly descriptive word. He said (at [52]): While \"Millennia\" may be an English word, I do not think in the context it is wholly a descriptive word. It has no reference to the character or quality of offices, hotels or shops. It may have a connotation of longevity or a new era. It is quite unlike \"cleaning services\" inOffice Cleaning Services Ltd v Westminister Window and General Cleaners Ltd(1946) 63 RPC 39 or \"building information centre\" inHornsby Building Information Centre v Sydney Building Information Centre(1977) 140 CLR 216 or \"oven chips\" inMcCain International Ltd v Country Fair Foods Ltd[1981] RPC 69 or \"vacuum cleaner\" inBritish Vacuum Cleaner Company, Limited v New Vacuum Cleaner Company, Limited[1907] 2 Ch 312, which are obviously descriptive … Then is \"Millenia\" a fancy word?A fancy word is one which has no obvious relevance to the character or quality of the goods or business in relation to which it is used.Of course whether a word is fancy or descriptive may depend on how it is used. Whether a word is termed descriptive or fancy, the significance lies in the fact that distinctiveness is very much more easily acquired for fancy words. Whatever it is, at the end of the day, the crucial question is still this, and I can do no better than quoteWadlow on the Law of Passing Off(at p 392): However, the decision to categorise a word as fancy or descriptive is only one part of the wider issue of whether there is a material representation to restrain.Inherent ability to distinguish is always a matter of degree with there being a continuous spectrum between the highly fanciful and the obviously descriptive. Wherever the name may fall on that range, what matters is whether the name is distinctive in fact. In the context of the spectrum referred to by Wadlow, I would be inclined to think that the name \"Millenia\" lies somewhere in the middle, perhaps closer to being highly fanciful than obviously descriptive. [emphasis added] This approach was affirmed on appeal (CDL Hotels International Ltd v Pontiac Marina Pte Ltd[1998] 1 SLR(R) 975 (“CDL-CA”). 46     In the present case, clearly, the word “INTUITION” is not purely descriptive of the goods and services which the plaintiff provides, since it brings to mind a quality of mind rather than a service or a product. However, unlike the word “Millennia” which was used to describe offices, hotels and shops inCDL-HC, the use of “INTUITION” by the plaintiff is closer to being obviously descriptive because it is possible to conceive of training and educational courses teaching creative and/or intuitive thinking and both teaching and intuition are cognitive activities. Therefore, it probably lies in the middle of the spectrum between the highly fanciful and the obviously descriptive and this gives it some degree of distinctiveness. As for any inherent distinctiveness in the plaintiff’s word plus device Mark, this would have the same degree of distinctiveness as the word Mark as there is no proposition of law that devices are inherently distinctive. 47     As regards distinctiveness acquired through use, the evidence indicated that the plaintiff rarely used the word Marks alone. Indeed, the evidence suggested that the word Marks are predominantly used with the device appearing in the word plus device Mark. Mr Banks also admitted that he was unable to find any “marketing piece that doesn’t have [its] globe and swirl”. Therefore, on the evidence, I cannot hold that the word Marks have acquired distinctiveness through use. 48     As to whether the plaintiff’s word plus device Marks have acquired distinctiveness through use, there is no evidence of: (a)     The market share secured by the word plus device Marks in the field of business and management consultancy and training services in Singapore; (b)     The amount the plaintiff had invested in promoting the mark in Singapore. The documents produced by Mr Banks pertained only to advertising efforts abroad; and (c)     The proportion of the relevant class of individuals who identify goods sold under the word Marks as emanating from the plaintiff. Further, while the plaintiff has adduced evidence of use of the word plus device Marks since 1999, such evidence did not suggest that such use is intensive and widespread in Singapore. Therefore, I hold that the word plus device Marks have also not acquired distinctiveness through use. However, because of their slight degree of inherent distinctiveness, in the overall analysis, the word plus device Marks are, like the word Marks, somewhat distinctive. Similarity 49     I now turn to the visual, aural and conceptual similarities of the defendant’s Signs and the plaintiff’s Marks. (1)   Similarity of Signs A and B with the word Marks 50     I have found (at [24] above) that Signs A and B are identical to the word Marks.A fortiori, Signs A and B are similar to the word Marks. (2)   Similarity of Signs C and D with the word Marks 51     I next move on to Signs C and D, both of which comprise two wordsviz“INTUITION” and “CONSULTING”. 52     Considering visual similarity first, Signs C and D are not visually similar to the word Marks. In the case of word marks, a determination of visual similarity typically involves looking at the following factors (seeOzone Communityat [49] citing Bently & Sherman,Intellectual Property Law(Oxford University Press, 3rd Ed, 2009) at 865): (a)     length of the marks; (b)     structure of the marks (ie, whether there are the same number of words); and (c)     whether the same letters are used in the marks. 53     Applying this test, the word Marks and Signs C and D are not visually similar because the word Marks consist of nine letters in total while Signs C and D consist of nineteen letters in total, and further because the word Marks consist only of one word while Signs C and D consist of two words. Even a consumer with an imperfect recollection who has seen both the word Marks and Signs C and D would still remember that Signs C and D have an additional word apart from the word “INTUITION”, especially since both “INTUITION” and “CONSULTING” consist of roughly the same number of letters and one would not overshadow the other (seeOzone Communityat [53]). 54     When comparing marks aurally, the court usually carries out a quantitative assessment and considers if the mark and sign in question have more syllables in common than not (Ozone Communityat [55] citing with approvalBently & Shermanat 865). In the present comparison, the syllables in common, namely, “in”, “tu” “ee” and “tion”, outnumber the syllables that are not (“con”, “sult” and “ting”). However, the number of common syllables is only a factor for consideration. Woo Bih Li J inOzone Community(at [14]) cited with approval the following paragraph from the judgment of the Principal Assistant Registrar of Trade Marks in the tribunal below: I still cannot help but find that a simple analysis is all that is required of the test of aural similarity. The simple analysis here is that the complete sound of [AMP's GLAMOUR] mark is different from [Ozone's HYSTERIC GLAMOUR] mark. The simple facts are that [Ozone's HYSTERIC GLAMOUR] mark is made up of five readable syllables in two words with a pause in between, whereas [AMP's GLAMOUR] mark is two syllables in one word. Three of the syllables in [Ozone's HYSTERIC GLAMOUR] mark are not duplicated as sounds in [AMP's GLAMOUR] mark. This basic analysis shows that there is a fair bit of dissimilarity between the two marks in terms of syntax. The question is whether the repetition of two common syllables that form a common word 'glamour' will cause these two marks, as a whole, to be considered as aurally similar. My answer is no ... From this passage, it can be seen that the courts also consider the total number of syllables and whether there is a pause in the reading of the mark and sign (as when the mark or sign is made up of two discrete words). Since the word Marks consist of four syllables with no pause in pronunciation, while Signs C and D consist of seven syllables with one pause after the fourth syllable, the word Marks and Signs C and D are not aurally similar. 55     Next, conceptual similarity. In considering whether there is conceptual similarity between the word Marks and Signs C and D, it is necessary to consider the ideas that lie behind or inform the word Marks (Bently &Shermanat 866). The word “INTUITION” brings to mind either direct perception of truth or fact independent of any reasoning process, or a keen and quick insight. While Mr McGrath testified that he came up with the word “INTUITION” because it is an amalgamation of the words “internet” and “tuition”, saying that it reflected his aspiration to teach using the Internet, he admitted too that the word also imports the idea of applying knowledge instinctively. Mr McGrath’s explanation of how he came up with “INTUITION” is, in my view, a strained one as no one would ordinarily think that that word came from the amalgamation of the words “internet” and “tuition”. There is therefore no reason to impute to “INTUITION” any idea other than the commonly known meaning of the word. As far as the ordinary consumer is concerned, there would be no perceptible difference in conception between the use of “INTUITION” in the Signs and in the Marks. 56     Moving on to the other component of Signs C and D, the word “CONSULTING” on its own imports the idea of the provision of professional advice, which may or may not have an impact on the idea behind “INTUITION”. However, when the word “Consulting” is placedafterthe word “INTUITION” in Signs C and D, it could give the impression that “INTUITION CONSULTING” is a subsidiary or branch of a parent “INTUITION” company. Viewed from this angle, the word “CONSULTING” is no longer a conceptually neutral term, but rather it reinforces the conceptual similarity of Signs C and D and the word Marks. Hence, overall, the word Marks and Signs C and D are conceptually very similar. 57     In the overall comparison of Signs C and D with the word Mark, the word Marks and Signs C and D are similar under s 27(2)(b) of the Act. It is noted that the word Marks are somewhat distinctive (see [46] above). Therefore, a fair degree of alteration in Signs C and D from the word Marks is necessary to distinguish them from the latter. In this case, the visual and aural dissimilarities are insufficient to distinguish Signs C and D from the plaintiff’s word Marks given the strong conceptual similarity. (3)   Similarity of Sign E with the word Marks 58     Moving on to Sign E, that sign is, like Signs C and D, similar to the word Marks. Sign E consists of the word “INTUITION” followed by the words “CONSULTING PTE LTD”. 59     Visually, Sign E is more dissimilar to the word Marks than Signs C and D because Sign E consists of 25 letters, as compared to nine in the word Marks, and is made up of four words as compared to only one in the word Marks. 60     Aurally too, Sign E is more dissimilar from the word Marks than Signs C and D because Sign E contains more non-common syllables than common syllables when compared to the word Marks. Only four syllables are common while eight syllables are non-common. The pronunciation of Sign E also involves three pauses in between the words while the pronunciation of the word Marks involves no such pause. 61     Conceptually, while Sign E has the additional abbreviation “PTE LTD”, these abbreviations come after the words “INTUITION” and “CONSULTING” as well. Thus, as is the case for Signs C and D, these additions could similarly give the impression that “INTUITION CONSULTING PTE LTD” is a subsidiary or branch of a parent “INTUITION” company. Sign E and the word Marks are, therefore, conceptually similar. 62     In the overall comparison of Sign E with the word Marks, the word Marks and Sign E are similar under s 27(2)(b) of the Act. (4)   Similarity of Signs F and G with the word Marks 63     Signs F and G are similar to the word Marks. Signs F and G are composite signs comprising the word “INTUITION” and the “Crazy Wayne” device displayed either on the left of the word (for Sign F) or above the word (for Sign G). 64     Visually, Signs F and G both contain a device which the word Marks do not contain. The device component in both Signs is also displayed prominently, and the device is rather distinct and memorable. Even if one could not recall exactly what the device in Signs F and G looks like, one would at least recall that there is a device in the defendant’s Signs which is absent from the word Marks. On this basis, Signs F and G would not be visually similar to the word Marks. However, inFestina Lotus SA v Romanson Co Ltd[2010] 4 SLR 552 (“Festina”), Tay J placed emphasis on the visual and oral impact of theword componentin a word plus device mark. Tay J observed that if a customer in that case wished to buy one of the plaintiff’s watches from its online store, he had to input the word component of the mark into the address bar or search engine to get to the desired website. Thus, such a customer would need to recall the word component rather than the device component of the Mark, making the visual impact of the device component less significant as compared to the aural and visual impact of the word component, despite the device being significantly larger than word (Festinaat [55]). 65     In the present case, the plaintiff’s services are offered mainly through its website. This means that the visual and aural component of the word component “Intuition” should be given more significance despite the device component in the word plus device Marks being much larger than the word component. Tay J’s observation carries the implicit assumption that the plaintiff’s customers are already acquainted with the name of the plaintiff’s products or firm, because someone who does not know of the product or firm name cannot input that name into the address bar or the search engine. However, Tay J’s observation would also apply to potential customers who are looking for training or consultancy services but do not yet know about “INTUITION”. This is because while such customers would probably use search terms like “training services”, when the search results do appear, only the word component of the word plus device Marks (ie, “INTUITION”) would appear independent of the device. In the present case, therefore, since the visual impact of the word component would be more significant than that of the device, Signs F and G would be visually similar to the word Marks. 66     Aurally, Signs F and G are similar to the word Marks since the defendant’s “Crazy Wayne” device cannot be verbalised with ease (seeFestinaat [56]). 67     Conceptually, Signs F and G are similar to the word Marks. The word “INTUITION” imports the idea of a direct perception of truth or fact independent of any reasoning process, or a keen and quick insight. The “Crazy Wayne” device which indicates some activity going on in a human head imports a similar idea. 68     Given the visual, aural and conceptual similarity between the word Marks and Signs F and G, I find they are similar. 69     In the result, all of the defendant’s Signs are similar to the plaintiff’s word Marks. (5)   Similarity of the defendant’s Signs to the word plus device Marks (Marks C, D and E) 70     I next move on to consider if the defendant’s Signs are similar to the plaintiff’s word plus device Marks. Given that I have held that the visual and aural impact of the word component in the word and device Marks is more significant than the device component, it follows that all the Signs are similar to the word plus device Marks just as they are similar to the word Marks. (6)   Similarity of goods and services protected by the defendant’s Signs 71     I must now consider the second element for a claim under s 27(2)(b) of the Act to succeed, namely, the similarity of the goods and services with which the defendant’s Signs are used with the goods and services protected by the plaintiff’s Marks. 72     In considering if goods and services are similar, the factors enumerated by Jacob J inBritish Sugarmay be helpful: (a)     the respective uses of the goods; (b)     the respective users of the goods; (c)     the physical nature of the goods; (d)     the trade channels through which the goods reach the market; (e)     for self-serve consumer items, whether in practice they are found or likely to be found, in particular, on the same or different shelves; and (f)     the extent to which the respective goods are competitive. Factor (e) above is not relevant in this case since the Bespoke Services and the Training Materials are not self-serve consumer items, while factor (c) is irrelevant where the comparison of services is undertaken. 73     All of the defendant’s Signs were used in relation to the Bespoke Services and the Training Materials, save for Sign B which was not used in relation to the Training Materials. Therefore, both the Bespoke Services and the Training Materials must be compared to the goods and services protected under the plaintiff’s Marks. 74     From the evidence submitted, it appears that the plaintiff’s word Marks and its word plus device Marks have been applied on its handouts containing presentation slides and other content as well as on its CDs containing its e-learning modules. The word plus device Marks have additionally been applied on guides/manuals and books published by the plaintiff and used in relation to the plaintiff’s service of renting out or licensing of its various e-learning modules (eg, “Intuition Plus”, “Intuition Web”, “Intuition Web Select”) and its customised training programmes. 75     Applying the relevantBritish Sugarfactors, the defendant’s Bespoke Services and Training Materials can be said to be somewhat similar to the goods and services protected under the plaintiff’s word Marks and word plus device Marks: (a)The uses of the goods and services: both the plaintiff’s and the defendant’s goods and services are similar in theirfunction, namely, to instruct and educate the end user. Whilst the contents of the materials and courses vary so that they can be used to instruct and educate clients on a large variety of matters in various fields I do not think it is correct to say that the uses are different simply because they are applied to different fields of training. (b)The users of the goods and services: if this factor is interpreted broadly, one could say that the users of both the plaintiff’s and the defendant’s goods and services are similar in that are all employees of large organisations. However, if a narrow interpretation is given and in this context, the narrow approach is preferable, the users of both the plaintiff’s and the defendant’s goods and services are different because they come from different industries, that is, the plaintiff services mainly clients from the financial, life sciences and defence and security sectors while the defendant services only clients from the IT and telecommunications industries. (c)The physical nature of the goods or acts of service: when comparing the parties’ training materials, it is clear that they are similar in nature. (d)The trade channels through which the goods and services reach the market: both the plaintiff’s and the defendant’s goods and services reach the market through the same trade channels, namely, through word of mouth, website and investigation and by personal enquiry rather than through retail outlets. (e)The extent to which the respective goods and services are competitive: both the plaintiff and the defendant provide goods and services which can be customised to suit the client’s needs. Thus, in theory the plaintiff’s customers could approach the defendant to fashion the same training materials and training services for them andvice versa. Hence, both the plaintiff’s and the defendant’s goods and services, to the extent that they are customisable, are similar. However, the evidence suggested that a large proportion of the plaintiff’s goods and services consist of “off-the-shelf” products available for licensing to its customers. For example, the plaintiff markets itself on its website as “a leading developer of eLearning content – both custom and off-the-shelf products”, but with an “extensivecatalogue of off-the-shelf titles”. This is corroborated by the plaintiff’s brochures marketing the litany of “pre-prepared” courses it offers. The plaintiff’s invoices also suggested that a large portion of its business in Singapore comes from the licensing or rental of “off-the-shelf” content to its clients. Finally, in its consolidated financial statements, the plaintiff described its principal activities to be “the development, manufacture and distribution of e-learning products”. In contrast, the defendant’s goods and services almost entirely consist of developing client-specific content on-demand and are aimed at only two industries. The defendant’s witnesses emphasised that the defendant did not and was not proposing to service other industries and stressed the specialised nature of its business. Accordingly, the degree of similarity of the defendant’s goods and services to the plaintiff’s training materials should not be overstated. Whether there is a likelihood of confusion because of the similarity of mark and sign and identity or similarity of protected goods and services 76     Next, I will consider if, because of the similarity of the defendant’s Signs with the plaintiff’s Marks and the fair degree of similarity of the defendant’s goods and services with the plaintiff’s, there arises a likelihood of confusion. 77     In a claim under s 27(2)(b) of the Act, the confusion must stem from the similarity between the mark and the sign as well as the goods to which they are applied. If the confusion is caused by other factors, there is no infringement (Poloat [33]). Confusion in this context also includes the situation where the consumer mistakenly assumes some kind of economic link or connection between the users of the registered mark and the allegedly infringing sign. However, it is pertinent to note that the “mere association” of the public between the two marks based on their similar use is notin itselfa sufficient basis for concluding that there is a likelihood of confusion in the absence of any possibility of misapprehension as to theoriginof the goods or services (City Chainat [58] andFerreroat [100]). It does not necessarily follow from the fact that the registered mark and the sign, as well as the goods and services are similar that confusion will automatically arise. If that were intended, s 27(2)(b) of the Act would have provided that where the mark and sign, as well as the goods, are similar, there shall be deemed to be confusion (Poloat [25]). 78     In considering if there is a likelihood of confusion, the court will consider the question globally, taking into account all the circumstances of the case (City Chainat [52]).Polohighlighted three additional factors which should be kept in mind in determining the likelihood of confusion: (a)     First, the steps taken by the defendant to distinguish his goods from the plaintiff’s (at [28]); (b)     Second, the level of similarity between the marks and the distinctiveness of both marks (at [28]); and (c)     Third, the level of sophistication and discernment of the plaintiff’s target consumers (at [34]). It is also clear that the relevant time for assessing the existence of confusion is the point of commencement of the alleged infringing use of the sign (City Chainat [51]). 79     In relation to the interpretation of the phrase “on the part of the public” in s 27(2)(b) of the Act, it is well established that this refers to the average consumer of the goods and services in question. Such a consumer is reasonably well-informed, reasonably observant and circumspect, and will exercise ordinary care and intelligence (Ferreroat [95]). The Court of Appeal inCity Chain(at [54]) affirmed Phang J’s observation inNation Fittings (M) SdnBhd v Oystertecplc[2006] 1 SLR(R) 712 (at [97]) that “[t]he case law appears to suggest that the ‘average consumer’ neednot,depending on the specific facts,necessarily meanthe general public” (emphasis in original). There must also arise a likelihood of confusion amongst asubstantial portionof therelevantpublic which, while not amounting to a majority, must be taken above a “de minimislevel” (Mobil Petroleum Co Inc v Hyundai Mobis[2010] 1 SLR 512 (“Mobil”) at [77]-[78]). 80     Finally, as to what sort of proof the plaintiff must produce to make out this element of likelihood of confusion, Tan Tee Jim SC in his bookLaw of Trade Marks and Passing Off in Singapore(2nded., 2005: Sweet & Maxwell Asia) proposes (at [6.38]) that: where [both the mark and the sign being compared] have been in use, it would be useful to adduce evidence to prove likelihood of confusion, such as: (1)    evidence of witnesses purporting to testify to actual confusion; (2)    evidence of trade witnesses who gave their opinion of the likelihood of confusion; and (3)    evidence of witnesses who had responded to a survey carried out on behalf of the plaintiff. This is also the position taken byBently & Sherman(at 874). 81     Turning to the facts of the present case, the general public does not consume the plaintiff’s and defendant’s goods and services. These services are utilised by employees in a firm who are undergoing or who need to undergo training programmes conducted by the firm and in particular by those employees who are in charge of arranging such programmes. The invoices adduced in evidence by the plaintiff were mostly addressed to training managers or training associates, and, occasionally, to human resource managers, of the plaintiff’s corporate clients. In this regard, the plaintiff’s submission that relevant consumers of the parties’ services are people from large organisations is somewhat overstated since, by the plaintiff’s own admission, these individuals are only “required by their employers to participate in training courses … rather than signing up for these training courses themselves…”. Whilst these persons may be part of the relevant consumer group as far as the plaintiff is concerned because they use the services provided by the plaintiff and may themselves draw the attention of their management to such services or recommend them to colleagues, they would not form part of the consumer group that approaches the defendant to design a bespoke training program. Therefore, the relevant group is only comprised of training managers and associates who source for or commission educational programs. As to the relevant date of assessment for the likelihood of confusion, it is clear that the relevant datevis-a-visSigns A to D is end 1999 or January 2000, since that was when the defendant commenced operations and started using those Signs. The relevant datevis-a-visSigns E to G would be the year 2001 since that was, according to Mr McGrath, the time when the defendant started to phase in the use of Signs E to G. 82     Having defined the relevant consumer group and the relevant time for assessing the likelihood of confusion, I find that there is no evidence of actual confusion between the plaintiff’s Marks and the defendant’s Signsin this consumer group. The plaintiff sought to provide the necessary evidence via the testimony of three individuals but in my judgment, their evidence is not sufficient to establish the plaintiff’s assertion of likelihood of confusion. 83     Mr Donagh Hourihan (“Mr Hourihan”), the Operations Manager of plaintiff, gave evidence that he received an email from one Mr Lawrence Sim (“Mr Sim”) of Global Lingo (S) Pte Ltd (“Global Lingo”) marketing their services to the plaintiff. Mr Hourihan said that he attended a meeting with two representatives from Global Lingo during which Mr Sim indicated to him that Mr Sim was under the impression that the plaintiff was connected to or associated with the defendant. This account did not help the plaintiff for two reasons. First, it did not assist the plaintiff because Mr Sim was not part of the relevant consumer group. Mr Sim was clearly not a potential consumer of the plaintiff’s goods and services, and the purpose of his email and meeting with Mr Hourihan was to offer Global Lingo’s services to the plaintiff. Second, the weight to be assigned to Mr Hourihan’s evidence must be reduced because the plaintiffs could have, but did not call Mr Sim to testify on its behalf. Thus, it is unclear if Mr Sim merelyassociatedthe plaintiff with the defendant, or whether Mr Sim was really confused as to theoriginof the plaintiff’s goods or services because of the similarity of the parties’ marks and signs and goods to which they are applied. 84     Mr Anil Ladislaus D’Souza (“Mr D’Souza”), a former employee of the plaintiff, gave evidence that when he did a search for the plaintiff on the Internet, the search results guided him to the defendant’s website instead. Mr D’Souza says he was confused as he continued to explore what he thought was the plaintiff’s website. However, this account similarly does not assist the plaintiff because Mr D’Souza’s confusion did not arise because of the similarity of the parties’ marks and signs and the similarity of the parties’ goods and services. When I asked Mr D’Souza why he was confused, he answered: In the website if you go down -- and I went down -- you know, training, et cetera, you look at people and assets, eventually I went down to the link called “location”. So when I went to “location”, if you see their website, it has been in Europe, and it does not have anything marked on Ireland. So when I looked at that -- it has Singapore also. So when I looked at that I knew that there’s a mix up... If you are an Irish company you should have a dot and Ireland at least so that let me know [sic]. It is clear from Mr D’Souza’s evidence that he was confused because of information about the parties’ operating locations in the world. Mr D’Souza was not confused as to the origin of the plaintiff’s goods and services, which is the type of confusion against which s 27(2)(b) of the Act seeks to protect, but was instead confused as to the origin of the proprietor of the website he was viewing . Even if Mr D’Souza’s confusion can be considered evidence of the likelihood of the similarity between the plaintiff’s Marks and the defendant’s Signs causing confusion as to the origin of the plaintiff’s goods, it is very slight evidence of such confusion. 85     Ms Doris Tan Mei Lan (“Ms Tan”), a client support executive of the plaintiff, gave evidence of an incident where there was confusion on the part of a DHL courier. Ms Tan said that on 25 March 2011, a DHL courier went to the plaintiff’s office with a package which was meant to be sent to the defendant’s office. Ms Tan also testified that she was told by the courier that the package was initially delivered to the defendant’s office but that the defendant had advised him to deliver the package to the address of the plaintiff’s local subsidiary instead. When Ms Tan contacted DHL to seek clarification over this confusion, she was told that a female employee of the defendant whose name the DHL customer service officer could not recall had advised them to direct the package to the plaintiff’s Singapore office. Ms Tan’s evidence was not helpful to the plaintiff. First, Ms Tan’s evidence suggests that the DHL courier delivered the package to the plaintiff’s local subsidiary not because he was confused as to the parties’ identities by virtue of the similarity of their marks and signs and goods but because an employee of the defendant instructed him to do so. Secondly, Ms Tan’s evidence does not assist the plaintiff’s case becauseeven ifthe DHL courier and the defendant’s employee in question confused the plaintiff and the defendant by reason of the similarity of their marks and signs and goods and services, both individuals do not fall within the relevant consumer group. 86     There is no, or at best only slight, evidence before me of actual confusion as to the origins of the parties’ goods by virtue of the similarity of the parties’ marks, signs and goods. This gives rise to the inference that any likelihood of confusion at the relevant dates is merely speculative, especially since Signs A to D have been used for about five years while Signs E to G have been used for about eleven years. 87     Quite apart from the fact that there is no evidence of actual confusion, it appears to me that there is no likelihood of confusion as to the origin of the parties’ goods based on the factors listed at [78] above. 88     First, the parties have marketed their goods and services quite differently on their respective websites. From the evidence, it appears that the plaintiff has marketed its services as “eLearning content – both custom and off-the-shelf products”, with afocuson their “extensive catalogue of off-the-shelf titles in the following areas: Financial Services eLearning; Medical and Healthcare; Business Skills; IT Skills”. The numerous marketing brochures adduced by the plaintiff further confirm that, for the most part, the plaintiff markets its pre-prepared materials and courses. In contrast, the defendant markets itself as a “global consulting and training company specializing in channel strategy and sales in high tech industries”, a far cry from the “off-the-shelf” titles emphasised by the plaintiff on its website. The defendant also emphasised that its services are “consulting services”, which suggest a higher degree of customisation and interaction with its clients than “eLearning” services and “off-the-shelf” products. While the defendant has a few similar “off-the-shelf” products, like “Business Finance 101”, such courses are not advertised at the forefront of the defendant’s website and are, in any case, not advertised to be the main type of services offered. However, the defendant admitted that it does not advertise or actively seek out customers, meaning that the defendant has not taken great pains to distinguish itself from the plaintiff. Further, the defendant’s website was only created on 19 May 2000. Thus, the foregoing discussion is not applicable in respect of Signs A to C. 89     Secondly, while the defendant’s Signs are similar to the plaintiff’s Marks, the goods and services of both parties are only fairly similar with little overlap. While the similarity of the defendant’s Signs could suggest that the parties are economically linked, the relevant consumers would probably not mistakenly think that the defendant is a subsidiary of, or was licensed by the plaintiff because they would probably know that the plaintiff also provides customised training programmes (as advertised on its website), albeit relatively less often, and would not think that the plaintiff has set up a subsidiary or licensed another firm to do the same. 90     Thirdly, the relatively higher level of sophistication associated with the relevant consumer group of well-educated training managers or associates means that the relevant consumer group is better able to distinguish the plaintiff’s goods and services from the defendant’s. In fact, the plaintiff conceded in its reply submissions that people who sign up for the training courses themselves (ie, the training managers and associates who form the relevant consumer group) would possibly have a greater impression as to the identity of the service provider. 91     Given these circumstances, in particular, the lack of evidence of actual confusion especially given that the plaintiff and defendant have been co-existing in Singapore for twelve years as of the date of trial, at least in respect of Signs E to G, the likelihood of confusion in this case is merely speculative.",
        "The claim under section 27(3) of the Act": "92     In order for a claim under s 27(3) of the Act to succeed, the plaintiff must prove the following elements: (a)     First, that its Marks are “well known in Singapore”; (b)     Second, that the defendant’s Signs are identical or similar to the its Marks; (c)     Third, that the similar or identical Signs are used in relation to goods or services which are not similar to those for which the plaintiff’s Marks are registered; (d)     Fourth, that the use of the defendant’s Signs in relation to the dissimilar goods or services would indicate a connection between those goods or services and the plaintiff; (e)     Fifth, that there exists a likelihood of confusion on the part of the public because of such use; and (f)     Sixth, that the plaintiff’s interests are likely to be damaged by such use. Whether the plaintiff’s Marks are well known in Singapore 93     The factors relevant to this inquiry are set out in ss 2(7), 2(8) and 2(9) of the Act which read: (7)    Subject to subsection (8), in deciding, for the purposes of this Act, whether a trade mark is well known in Singapore, it shall be relevant to take into account any matter from which it may be inferred that the trade mark is well known, including such of the following matters as may be relevant: (a)    the degree to which the trade mark is known to or recognised by any relevant sector of the public in Singapore; (b)    the duration, extent and geographical area of — (i)    any use of the trade mark; or (ii)   any promotion of the trade mark, including any advertising of, any publicity given to, or any presentation at any fair or exhibition of, the goods or services to which the trade mark is applied; (c)    any registration or application for the registration of the trade mark in any country or territory in which the trade mark is used or recognised, and the duration of such registration or application; (d)    any successful enforcement of any right in the trade mark in any country or territory, and the extent to which the trade mark was recognised as well known by the competent authorities of that country or territory; (e)    any value associated with the trade mark. (8)    Where it is determined that a trade mark is well known to any relevant sector of the public in Singapore, the trade mark shall be deemed to be well known in Singapore. (9)    In subsections (7) and (8), “relevant sector of the public in Singapore” includes any of the following: (a)    all actual consumers and potential consumers in Singapore of the goods or services to which the trade mark is applied; (b)    all persons in Singapore involved in the distribution of the goods or services to which the trade mark is applied; (c)    all businesses and companies in Singapore dealing in the goods or services to which the trade mark is applied. 94     The Court of Appeal inNovelty Pte Ltd v Amanresorts Ltd and another[2009] 3 SLR(R) 216 (“Amanresorts”) commented on the above factors (at [137]) as follows: The factors laid out in ss 2(7)(a)-2(7)(e) ... are not an exhaustive list in that the court is obliged to take into account “anymatter from which it may be inferred that the trade mark is well known”. [emphasis added] ... It appears that the court is ordinarily free to disregard any or all of the factors listed in s 2(7) as the case requires ... and to take additional factors into consideration. The list of factors in s 2(7) can thus be more accurately described as a set of guidelines. 95Amanresortsalso emphasised the importance of s 2(7)(a) because of the deeming provision in s 2(8) of the Act (at [140]): This deeming provision suggests that the court cannot disregard s 2(7)(a) (which looks at \"the degree to which the trade mark isknown to or recognised by any relevant sector of the public in Singapore\" [emphasis added]) in its deliberations. Indeed, it appears that all the other factors listed in s 2(7) are irrelevant once it is determined that the trade mark in question is well known to \"any relevant sector of the public in Singapore\"(pers 2(7)(a)). 96     As to the interpretation of s 2(9)(a) of the Act, the judgment noted that one considers actual consumers and potential consumers of, specifically, the plaintiff's goods or services only, and not all actual consumers and potential consumers in Singapore of thetypeof goods or services to which the plaintiff's trade mark is applied (Amanresortsat [142]). This is despite the court’s acknowledgement that this interpretation means that “any trade mark which is known to even the smallest and most exclusive of niche markets can become well known in Singapore”, and that “the miniscule size of the overall market in Singapore makes it very easy for even a small marketing campaign to establish awareness of a trade mark among ‘any relevant sector of the public’” (Amanresortsat [145]). Thus, the plaintiff will go a long way to showing that its Marks are well known in Singapore if it shows that its Marks are well known to or well-recognised by its own clients. 97     In this connection, the plaintiff said that its Marks are well known to the relevant sector of the public in Singapore because its invoices show that its clients consist of the major banks and financial institutions in Singapore. The plaintiff’s evidence showed a long-standing relationship between the plaintiff and most of its clients, as evidenced by repeat business. Hence, it is not difficult to infer that the plaintiff’s Marks are well-known to its clients. Further, the plaintiff has adduced evidence of registration of its marks in twenty-one countries and evidence of four instances where it has successfully enforced its trade mark rights abroad, factors which I have taken into consideration by virtue of s 2(7) of the Act. In these circumstances, I agree that the plaintiff’s Marks are well known in Singapore for the purposes of the Act. Whether the defendant’s Signs are identical or similar to the plaintiff’s Marks 98     Only Signs A and B are identical to the plaintiff’s word Marks, while all of the defendant’s Signs are similar to the word Marks and the word plus device Marks. Whether the similar or identical Signs are used in relation to goods or services which are not similar to those for which the plaintiff’s Marks are registered 99     It is noted that s 27(3) of the Act confers on well known trademarks more protection than ordinary trade marks (Amanresortsat [229]). Since the goods and services on which the defendant’s Signs are used are somewhat similar to the specifications of the plaintiff’s Marks, this element is satisfied. Whether the use of the defendant’s Signs in relation to the dissimilar goods or services would indicate a connection between those goods or services and the plaintiff 100    InMobil, the Court of Appeal discussed the element of “connection” under s 8(3) of the Act, which has the same elements as those under s 27(3) of the Act save that in the former those elements are considered in the context of resisting registration of a later mark rather than claiming infringement of an earlier mark. The court noted that “connection” here could be in the form of “connections closely indicating origin and/or quality” (at [45]), or connections “in the business sense”, which is potentially broad and includes: (a)     the impression that the owner of the well-known mark is involved in the production of those goods or the offering of those services, or exercises some control over the goods and services of the allegedly infringing mark or sign (at [39] and [53]); (b)     the impression that the production of goods or offering of services by the defendant was licensed or sponsored by the owner of the well-known mark (at [39]); (c)     the impression that the plaintiff and defendant are part of the same corporate group (at [51]-[52]); and (d)     the impression that the defendant’s undertaking is a merged or amalgamated entity of existing companies (at [54]). However, the court did not think that “indication of amere associationor that it would cause an ordinary individual on seeing the [later mark] to recall the [well known mark] would suffice to constitute a ‘connection’ for the purposes of s 8(3) as this would be casting the net too widely” (at [41]). 101    In the present case, I have held that the use of the defendant’s Signs in relation to the defendant’s goods or services would not indicate a connection as to origin or in a business sense. Whether there is a likelihood of confusion because of such use 102    I have held that the use of the defendant’s Signs in relation to the defendant’s goods or services is not likely to cause confusion between the defendant’s goods and the plaintiff’s goods. Whether the plaintiff’s interests are likely to be damaged by such use 103    As I have held that at least two of the necessary elements are not present, I do not need to deal in detail with the issue of whether the plaintiff’s interests are likely to be damaged by the use of the defendant’s Signs. I would state, however, that the plaintiff has not produced adequate evidence of damage. It has not shown that the defendant’s goods and services have an inferior image to those of the plaintiff’s such that the plaintiff’s goods and services would be tainted. Further, there is no evidence of the plaintiff suffering loss of any licensing or franchising opportunity. The plaintiff’s evidence in fact was that it had established its local subsidiary to act as its regional business hub for its Asian operations and this indicates that it does not wish to license or franchise its business. Although the plaintiff contended that it suffered damage because if the defendant was allowed to continue to use the Signs, there would be a restriction on its natural expansion into providing a greater range of training and consultancy services, there is no evidence of this. Further, the goods and services offered by the defendant fall within a narrower scope than those of the plaintiff. 104    The plaintiff also argued that there would be loss of exclusivity and the erosion of distinctiveness of the plaintiff’s Marks if the defendant were to be able to continue to use its Signs. Insofar as this head of damage is an allegation that the use of the defendant’s Signs would cause unfair dilution of the distinctive character of the plaintiff’s Marks, the plaintiff has not proven this because there is no real likelihood that the relevant group of consumers in the present case would be confused as to the origin of the plaintiff’s or defendant’s goods and services, and there is no real likelihood that the relevant group of consumers in the present case would think that the parties are economically related. Insofar as this head of damage is an allegation that the use of the defendant’s Signs would tarnish the distinctive character of the plaintiff’s Marks, that allegation has also not been made out. 105    As the plaintiff was not able to establish that it suffered damage by reason of the defendant’s Signs, even if there were a connection between the parties’ goods and services and confusion had resulted from the use of the defendant’s Signs, the plaintiff would still not be able to make out its claim under s 27(3).",
        "The defendant’s defences": "106    It is not necessary to consider the defendant’s defences to the breach of trade mark claim in view of the findings I have made in the preceding paragraphs of this judgment.",
        "Claim for the Tort of passing off": "107    The final claim to be considered is the plaintiff’s action for the tort of passing off. The principles for an action in the tort of passing off to succeed are well established. First, goodwill, misrepresentation and damage must be proved by the plaintiff. The goodwill concerned is that which subsists in a claimant’s get-up (ie, his mark, name, labellingetc). The court must properly define in each case what the plaintiff's goodwill consists of in order to determine the boundaries of the protection which the plaintiff can claim.",
        "Whether goodwill exists in the plaintiff’s trade marks": "108    First, I have to find whether goodwill subsists in the plaintiff’s Marks. Goodwill is an attractive force which brings in custom, and refers to the association of a good, service or business on which the plaintiff’s get-up has been applied with a particular source (Amanresortsat [39]). The relevant date at which the plaintiff must establish that goodwill existed in its Marks is the date on which the conduct complained of commenced (CDLat [34]). InCDL, the court noted that goodwill is normally generated from trading and hinges on the business of the claimant (at [50]–[52]). 109    The defendant was incorporated on 13 November 1999 and the evidence suggests that it commenced operation either immediately on incorporation or shortly after that. It follows that the plaintiff must show that, as at 13 November 1999 or shortly thereafter, goodwill existed in its Marks. 110    The plaintiff produced documentary evidence showing business transactions it had done in Singapore, but out of this evidence I could only find five transactions which the plaintiff had done prior to January 2000. It is also noted that none of the documents feature the plaintiff’s word Marks, and only four of the five documents feature the plaintiff’s word plus device Marks. Out of the five transactions done, four were done with the same client, Reuters Asia Pte Ltd. Whilst the evidence is slight, it is arguable that the plaintiff had shown, by virtue of its invoices pre-dating January 2000, that it had some “attractive force which brings in custom” in respect only of the plaintiff’s word plus device Marks as at 13 November 1999 or shortly thereafter. 111    While Mr Banks claimed that the plaintiff had started offering its services to various clients in Singapore in the early 1990s, no documentary evidence was adduced to support this assertion. This is important because the court needs to determine whether there is evidence that the plaintiff’s Marks were displayed on the materials or invoices sent to its clients prior to 2000, especially since the plaintiff only changed its name to “Intuition Publishing” in July 1998. Mr Banks said that the plaintiff was formerly known as “Financial Courseware” and had described its programmes as “INTUITION PLUS” from 1996 onwards. However, this fact does not assist the plaintiff because the plaintiff must prove that goodwill existed in its Marks, which means that it must show that its Marks, and not merely its products, had been exposed to a more than a negligible portion of the public. Without documentary evidence to show that the plaintiff’s Marks, rather than merely the “Financial Courseware” header and descriptions of its products, had been exposed to the public by trade, any goodwill which existed in the plaintiff’s word plus device Marks by virtue of trading would only be in respect of the four business transactions with Reuters Asia Pte Ltd in 1999. 112    The plaintiff could also prove its case by showing that there had been exposure of its Marks to the public in Singapore as of January 2000 in ways other than direct business transactions. Whilst the plaintiff had no physical office in Singapore until the year 2007, it could have exposed its get-up to the public here before then by various marketing methods. It is noted in this regard that Mr Banks claimed that the plaintiff’s Marks had been in extensive use, and, through extensive promotion, marketing, sales and usage, the plaintiff had acquired significant goodwill and reputation in Singapore and elsewhere. However, the plaintiff did not adduce much evidence of this alleged “extensive” use. The exhibits attached to Mr Banks’ affidavit, whilst including some promotional and marketing materials (brochures listing the courses available), mostly pertained to the goods on which the plaintiff’s Marks were applied. They did not show how extensively these materials had been disseminated to the public in Singapore. 113    The plaintiff also relied on its website which was created on 29 November 1994. However, there was no evidence of how much exposure the website had created for the plaintiff’s Marks. It was established inAmanresortsthat evidence of the existenceper seof domain names and websites featuring the plaintiff’s Marks will ordinarily be insufficient as proof of exposure of the Marks. That is a passive mode of exposure and the court in the same passage declared that the plaintiff must have taken “active step[s]… that [go] beyond providing facilities that enable others to bring the mark into the [geographical area in question]”. The court continued (Amanresortsat [54]): Such \"active step[s]\"… could take the form of \"direct encouragement or advertisement by the [trade mark] owner\"… which led consumers to the website featuring the trade mark in question. In the present case, the [plaintiff] must adduce evidence showing, among other matters, the following: (a)    How many \"hits\" have the [plaintiff’s] websites received? (b)    How many of these \"hits\" came from Internet users in Singapore? (c)    If someone does a search for relevant topics… using any of the major search engines, [is] the [plaintiff’s] website[] included among the top few search results? (d)    How many other major websites (particularly those frequented by consumers in Singapore) are linked to the [plaintiff’s] website[]? 114    The plaintiff did not give evidence of any active steps it had taken to direct traffic to its website nor did it give any evidence of the additional matters listed by the court inAmanresorts. Further, it did not show how extensively its marketing brochures were circulated in Singapore. 115    Finally, while the plaintiff has adduced evidence of its international reputation, possibly in an attempt to bolster the extent of the goodwill in its Marks, the reliance on such evidence is misconceived: (a)     The plaintiff relied on the fact that its Marks were first registered in 1984 and have since been registered in the following countries: Australia, Belgium, the Netherlands, Luxembourg, Canada, China, the EU, Denmark, Germany, Hong Kong, Italy Japan, New Zealand, Norway, Singapore, South Africa, Spain, Sweden, Switzerland, the UK and the USA. However, the plaintiff has not shown how these registrations had exposed the plaintiff’s Marks to the publicin Singaporeas at January 2000. (b)     The plaintiff also said that its trade name “Intuition” is well known in the education and training industry because it had recoded substantial sales turnover in recent years and now has eight offices around the world including Singapore. These sales figures did not help the plaintiff however because they were not provided for sales as at January 2000 and further, did not show what proportion of the sales was generated by customers basedin Singapore(seeAmanresortsat [56]). (c)     The plaintiff also produced evidence of numerous awards received. Unfortunately for the plaintiff, these awards were foreign awards and there is no evidence to show how customersin Singaporecould have been exposed to the plaintiff’s Marks by virtue of these awards as at January 2000. 116    It therefore appears that the only exposure of the plaintiff’s Marks which the plaintiff has established was that arising from its invoices to Reuters Asia Pte Ltd in 1999. Any goodwill arising from such exposure must be negligible. The courts do not protect negligible goodwill. 117    As the plaintiff has not been able to establish more than negligible goodwill, there is no need for me to consider whether the other elements of passing off are present in this case. I find that the plaintiff has not established its passing off claim.",
        "The defendant’s counterclaim for revocation of the plaintiff’s Marks": "118    The final issue to address is the defendant’s counterclaim against the plaintiff for the revocation of the plaintiff’s Marks. The plaintiff raised a preliminary objection in relation to this counterclaim. It argued that while the defendant’s pleading seeks declarations that the plaintiff’s Marks are invalid, the ground pleaded by the defendant was a ground for the revocation of the Marks, namely, that the Marks have not been put to genuine use for a period of five years or more. The defendant only clarified in the course of trial that it is seeking revocation, not invalidation, of the plaintiff’s Marks. The plaintiff argued that the defendant had not adequately framed its case for revocation and cannot now make such a counterclaim. 119    I do not accept this argument. The particulars pleaded by the defendant in its counterclaim sufficiently disclose the ground on which it is seeking revocation of the plaintiff’s Marks. There has been no prejudice to the plaintiff because the plaintiff was at all times aware that registration of its Marks was being attacked. Further, the mistake in the defendant’s counterclaim only pertains to the reliefs sought,ie, that the defendant wrongly sought invalidation instead of revocation of the plaintiff’s Marks even though it had pleaded non-use of the plaintiff’s Marks. While this is a breach of O 18 r 15 of theRules of Court(Cap 332, R 5, 2002 Rev), O 2 r 1 of those rules states that this is merely an irregularity which does not nullify proceedings. 120    Section 22(1) of the Act, which spells out the requirements for revocation of a mark for non-use, reads: 22.—(1) The registration of a trade mark may be revoked on any of the following grounds: (a)    that, within the period of 5 years following the date of completion of the registration procedure, it has not been put to genuine use in the course of trade in Singapore, by the proprietor or with his consent,in relation to the goods or services for which it is registered, and there are no proper reasons for non-use; (b)    that such use has been suspended for an uninterrupted period of 5 years, and there are no proper reasons for non-use... [emphasis added] It is also pertinent to note s 22(3) of the Act which reads: (3)    The registration of a trade mark shall not be revoked on the ground mentioned in paragraph (a) or (b) of subsection (1) if such use as is referred to in that paragraph is commenced or resumed after the expiry of the 5 year period and before the application for revocation is made. 121    Typically, the applicant seeking a remedy from the court has the burden of proof. However, for the purposes of showing that the plaintiff’s Marks have been used, s 105 of the Act shifts this burden of proof onto the plaintiff. It is the plaintiff who has to show that its Marks have,in relation to the goods or services for which they are registered, been put to use without any discontinuance for a period of five consecutive years or more. From the documentary evidence adduced by the plaintiff itself, it is clear that there is no consecutive period of five years during which Marks C, D and E had not been used since their registration on 14 September 1998. However, the plaintiff has not adduced evidence which unequivocally shows the same for Marks A and B. Bearing in mind the specifications for Marks A and B (see [2] above), the evidence shows no use of Marks A and Bin relation to the goods for which they are registered. From the evidence adduced, the only instances where the plaintiff has used Marks A and B are on its website, its training handouts, and its CDs. The website, training handouts and CDs do not fall within the specifications for which Marks A and B are registered. Therefore, the defendant’s counterclaim succeeds in relation to Marks A and B only.",
        "Conclusion": "122    For the reasons given above, the plaintiff’s claim fails and is dismissed. The defendant’s counterclaim succeeds to the extent that Marks A and B are hereby revoked. The defendant shall have the costs of the claim and the counterclaim."
    }
}