{
    "case_title": "Low Tuck Kwong\n      v\n      Sukamto Sia",
    "ncitation": "[2012] SGHC 233",
    "coram": "Philip Pillai J",
    "sections": {
        "Introduction": "1       The plaintiff is the President Commissioner and controlling shareholder of PT Bayan Resources Tbk (“Bayan Resources”), a coal mining company listed on the Indonesian Stock Exchange (“IDX”). The defendant is a businessman. They were close friends until 1997, after which they became bitter enemies. Although the principal events surrounding this defamation and malicious falsehood action occurred in Indonesia, the plaintiff has brought this action in Singapore, where both of them are resident and the defendant has filed his counterclaim.",
        "Facts": "2       In late 2007, Bayan Resources began preparing for its initial public offering (“IPO”) on the IDX. The IPO was structured to offer new shares and vendor shares, including some of the plaintiff’s shares. As the IPO was to be a global offering, PT Trimegah Securities Indonesia Tbk (“PT Trimegah”) was appointed as the domestic lead managing underwriter, Merrill Lynch (Singapore) Pte Ltd (“Merrill Lynch Singapore”), who was assisted by PT Merrill Lynch Indonesia, was appointed sole book runner and lead international selling agent, Macquarie Capital (Singapore) Pte Ltd (“Macquarie Singapore”) was appointed international selling agent and “Macquarie” was appointed the co-lead manager and international selling agent (see Bayan Resources’ Preliminary Offering Memorandum dated 4 July 2008) (collectively, the “IPO Advisors”).",
        "1stLetter of 10 July 2008": "3       On 10 July 2008, the defendant’s Indonesian lawyers, M/s Hotman Paris & Partners (“HPP”), sent a letter to the plaintiff and Bayan Resources (the “1stLetter”). This letter was written in Bahasa Indonesia. The defendant’s English translation reads as follows (where there are material differences highlighted by the parties between their translations, the defendant’s translation is underlined and the plaintiff’s translation follows in square brackets and italics): Law FirmHOTMAN PARIS & PARTNERS...10 July 2008ToPT BAYAN RESOURCESMr.Dato’ Low Tuck Kwong[address]                               [address]Subject: LEGAL NOTICEDear Sir,We are acting on behalf ofSUKAMTO SIAon the basis of aSpecial Power of Attorney dated the 9 (Ninth) of July 2008.We herewith wish toSTRONGLY WARN Mr. DATO’ LOW TUCK KWONGandPT BAYAN RESOURCES AND ITS COMPANY GROUPtoSURRENDER AND RETURNto our client the 50% (fifty percent) minimum of all the shares and interest in PT Bayan Resources and its company group.ThisLEGAL NOTICEis based on the followingLEGAL FACTS:1.    In 1995 and at the beginning of 1996 Mr. Dato’ Low Tuck Kwong was facing a financial crisis.2.    After his financial failure, Mr. Dato’ Low Tuck Kwong persuaded our client toinvest and facilitate[invest and provide facilities] in the business of Coal Mining in Indonesia.Mr. Dato’ Low Tuck Kwong convinced our client that if our clientinvests and facilitates the establishment of the coal mine[invested and provided the facilities for the coal mining establishment], Mr. Dato’ Low Tuck Kwong would guarantee that the investment would be worth a minimum of 500,000,000.00 USD (five hundred million US dollars) within 7 to 8 years, especially when the coal mining company was listed on the Indonesia Stock Exchange.On the basis of that proposal, our client was persuaded by Mr. Dato’ Low Tuck Kwong tofund and facilitate the investment of the coal mine[invest and provide facilities for the coal mining business] and Mr. Dato’ Low Tuck Kwong did receive the money from our client to fund and to get the concession rights to the coal mine. Mr. Dato’ Low Tuck Kwong promised that our client would get 50% (fifty percent) of all the shares in the coal mining company.In light of their friendship and seeing Mr. Dato’ Low Tuck Kwong’s grave financial condition at the time, our client funded and facilitated the establishment of the coal mining company for Mr. Dato’ Low Tuck Kwong, including acquiring the concession rights to the coal mine, which was then established under the name PT Bayan Resources.Therefore, in accordance with the above legal facts, weARE DEMANDING THE RIGHT TO 50% (FIFTY PERCENT) OF THE SHARES IN PT BAYAN RESOURCES AND ITS ENTIRE COMPANY GROUP WITH THE CONSEQUENCES THAT IF OUR CLIENT’S RIGHTS ARE NOT DELIVERED IN THE NEAR FUTURE, OUR CLIENT WILL BRING A CIVIL AND CRIMINAL SUIT AGAINST MR. DATO’ LOW TUCK KWONG, PT BAYAN RESOURCES AND ITS COMPANY GROUP.Thank you for your kind attention to this matter....[emphasis in bold in original; emphasis in underline and italics added]4       On 14 July 2008, Bayan Resources’ Indonesian lawyers, M/s Soernardi Richard Sekutu (“SRS”), sent a letter to HPP (“SRS Letter”) asking for a copy of the Special Power of Attorney dated 9 July 2008 referred to in the 1stLetter and received no reply. Apart from the SRS Letter, HPP did not receive any response, either from the plaintiff or Bayan Resources, to the 1stLetter.2ndLetter of 15 July 20085       On 15 July 2008, HPP sent a second letter to the plaintiff, Bayan Resources and SRS (the “2ndLetter”) which was, save in one immaterial way, identical to the 1stLetter.3rdLetter of 21 July 20086       On 21 July 2008, HPP sent a third letter to (a) the Chief of theIndonesian Capital Market and Financial Institutions Supervisory Agency (“BAPEPAM”), the Indonesian capital market regulator; (b) the Director in Chief of the IDX; (c) PT Trimegah; (d) Merrill Lynch at a Jakarta address; and (e) Macquarie Securities and Macquarie Consultants at an identical Jakarta address (the “3rdLetter”). The 3rdLetter enclosed the 1stLetter, the SRS Letter and the 2ndLetter. The defendant’s English translation of the 3rdLetter, which was written in Bahasa Indonesia, reads as follows (where there are material differences highlighted by the parties between their translations, the defendant’s translation is underlined and the plaintiff’s translation follows in square brackets and italics):Law FirmHOTMAN PARIS & PARTNERS...July 21, 2008ToCapital Market Executive         Indonesian Stock Exchange Agency (Bapepam)[address]                                     [address]Att: ...    Att: ...ChiefDirector in Chief[Head]    [Managing Director]Merrill LynchTrimegah SecuritiesStock Exchange BuildingIndonesia Ltd., TbkJakarta Tower I                            [address] 18thFloor Jenderal Sudirman St. Kav. 52-53 Jakarta 12190Macquarie SecuritiesStock Exchange Building Jakarta Tower I 8thFloor Jenderal Sudirman St. Kav. 52-53 Jakarta 12190Macquarie ConsultantsStock Exchange Building Jakarta Tower I 8thFloor Jenderal Sudirman St. Kav. 52-53 Jakarta 12190SUBJECT:Request to restrain Bayan Resources Ltd. from going public (Initial Public Offering IPO) due to the ongoing dispute over ownership of Bayan Resources Ltd. with our ClientDear Sirs,We are acting on behalf ofSUKAMTO SIAon the basis of aSpecial Power of Attorney dated 9 (Nine) July 2008.Through this letter, we are requesting that The Capital Market Executive Agency, the Indonesian Stock Exchange, Merrill Lynch Indonesia, Trimegah Securities Indonesia Ltd., Macquarie Securities, Macquarie ConsultantsSUSPEND THE PROCESS OF GOING PUBLIC (INITIAL PUBLIC OFFERING) OF BAYAN RESOURCES LTD. BECAUSE AT THE PRESENT TIME BAYAN RESOURCES LTD. AND ITS ENTIRE COMPANY GROUP AS WELL AS MR DATO’ LOW TUCK KWONG (THE OWNER OF BAYAN RESOURCES LTD.) ARE INVOLVED IN A LEGAL DISPUTE WITH OUR CLIENTon the following grounds:1. Whereas, for your information,OUR CLIENT IS THE PARTY THAT FUNDED AND FACILITATEDMr. Dato’ Low Tuck Kwong in establishing the coal mining company, including getting the concession rights to the coal, now called Bayan Resources Ltd..2. From the start, Mr. Dato’ Low Tuck Kwong tried to convince our client that if our client invests and facilitates in the establishment of the coal mine, Mr. Dato’ Low Tuck Kwong guarantees that the investment would be worth a minimum of USD 500,000,000.00 (five hundred million United States dollars) within 7 to 8 years, especially when the coal mining company is listed on the Indonesia Stock Exchange.3. Whereas, on the basis of that proposal, our client was persuaded by Mr. Dato’ Low Tuck Kwong tofund and facilitate the investment in[invest and provide facilities for] the coal mining company and Mr. Dato’ Low Tuck Kwong did receive the money from our client to fund and to get the concession rights to the coal mine. Mr. Dato’ Low Tuck Kwong promised that our client would get 50% (fifty percent) of all the shares in the coal mine.4. Finally, in light of their friendship and seeing Mr. Dato’ Low Tuck Kwong’s grave financial condition at that time, our clientfunded and provided facilities[invested and provided funds] for Mr. Dato’ Low Tuck Kwong to fund the development of the coal mining company, including to get the concession rights to the coal, which was then established under the name Bayan Resources Ltd. and its company group.However, it turned out that Mr. Dato’ Low Tuck KwongNEVER GAVEthe rights to 50% (fifty percent) of the shares in Bayan Resources Ltd. and its entire company group to our client, the investor and Mr. Dato’ Low Tuck KwongNEVER INFORMED NOR ASKED PERMISSIONfrom our client pertaining to a plan for Bayan Resources Ltd. to go public.Whereas our client has issued a warning to Mr. Dato’ Low Tuck Kwong through a Legal Notice No. 0175/0425.01/MA dated 10 July 2008, but as of now there has been no response from Bayan Resources Ltd. and Mr. Dato’ Low Tuck Kwong, and we have only received a letter from Bayan Resource’s Legal Counsel, whichDID NOT REPLYin any material way to our Legal Notice.On the basis of the above-mentioned facts, we wish to inform you thatIN THE NEAR FUTURE OUR CLIENT WILL SEEK ALL UNYIELDING LEGAL ACTIONS, IN CIVIL OR CRIMINAL LITIGATION VENUES AGAINST BAYAN RESOURCES LTD. AND ITS ENTIRE COMPANY GROUP, INCLUDING AGAINST MR DATO’ LOW TUCK KWONG PERSONALLY.AndTherefore we are requesting that the Capital Market Executive Agency, Indonesia Stock Exchange, Merrill Lynch Indonesia, Trimegah Securities Indonesia, Ltd., Macquarie Securities and Macquarie ConsultantsPROHIBIT BAYAN RESOURCES LTD. AND THE ENTIRE COMPANY GROUP FROM GOING PUBLIC (INITIAL PUBLIC OFFERING) SO AS NOT TO CAUSE ANY LOSSES TO A THIRD PARTY AND TO AVOID ANY LAWSUITS BY OUR CLIENT.Thank you for your kind attention to this matter....Attachment:-    Legal Notice dated July 10, 2008 No.0175/0435.01/MA-    Legal Notice dated July 15, 2008 No.0177/0425.01/MA-    Legal Notice dated July 14, 2008 No.SRS/20-34/111/VII/2008[emphasis in bold in original; emphasis in underline and italics added]7       On 24 July 2008, Bayan Resources informed BAPEPAM and IDX that the plaintiff would withdraw his shares from the IPO vendor shares sale, and that the other vendor shareholders of Bayan Resources would sell more shares to make up the shortfall resulting from his withdrawal. On 4 August 2008, BAPEPAM issued the Effective Statement which allowed the IPO to proceed. The IPO was launched on 12 August 2008, four days later than originally planned.8       On 3 October 2008, the plaintiff commenced this action against the defendant for defamation and malicious falsehood. The defendant counterclaimed in breach of contract, proprietary estoppel, constructive trust, breach of fiduciary duty and money had and received.9       As this action has been bifurcated, my decision deals solely with liability on the claims and counterclaims.Plaintiff’s case10     The plaintiff’s case is that the 1stLetter, the 2ndLetter and the 3rdLetter (collectively, the “Letters”) are defamatory of the plaintiff and that they were published by the defendant to the following persons in Indonesia:(a)     in respect of the 1stLetter and the 2ndLetter, to Bayan Resources.(b)     in respect of the 3rdLetter, to the Head of BAPEPAM, the Managing Director of the IDX, PT Trimegah, PT Merrill Lynch Indonesia, PT Macquarie Securities Indonesia and PT Macquarie Konsultan Indonesia.(a)     (collectively, the “Indonesian Publications”)It is apposite to note here that an examination of the 3rdLetter reveals that it was addressed not to PT Merrill Lynch Indonesia but to Merrill Lynch at a Jakarta address. Additionally, it was addressed not to PT Macquarie Securities Indonesia and PT Macquarie Konsultan Indonesia but to Macquarie Securities and Macquarie Consultants both at an identical Jakarta address.11     The plaintiff avers that the defendant’s publication of the Letters led to the following republications:(a)     In Indonesia:(i)       the 1st Letter and the 2ndLetter to BAPEPAM;(ii)       the 3rd Letter to Bayan Resources; and(iii)       the Letters or their summarised content in two Indonesian newspapers and Bayan Resources’ Indonesian Final Prospectus.(a)     (collectively, the “Indonesian Republications”)(b)     In Singapore:(i)       the Letters to Merrill Lynch Singapore; and(ii)       the Letters or their summarised content in Bayan Resources’ Pricing Supplement to the Preliminary Offering Memorandum and Bayan Resources’ International Final Offering Memorandum.(b)     (collectively, the “Singapore Republications”)12     The plaintiff further avers that as a result of the Indonesian Publications, Indonesian Republications and Singapore Republications:(a)     the plaintiff’s reputation was damaged and he suffered hurt, distress and embarrassment;(b)     the plaintiff was not able to sell 375,000,000 vendors shares in the IPO at the price of Indonesian Rupiah (“Rp”) 5,800 per share for a total sum of Rp 2.175 trillion; and(c)     the plaintiff lost the opportunity to use and invest Rp 2.175 trillion.13     The plaintiff is thus bringing this action against the defendant in defamation for the Indonesian Publications, Indonesian Republications and Singapore Republications. The plaintiff is also bringing this action against the defendant in malicious falsehood on the basis that the Letters are a malicious falsehood.Defendant’s case14     The essence of the defendant’s case is that he had a common understanding with the plaintiff, to whom he had given S$3 million to “invest and facilitate” the plaintiff’s establishment of an Indonesian coal mining business, on the basis that if the business was established, the defendant would have a 50% share in the business and if not, the plaintiff would return the S$3 million (the “Common Understanding”). On the basis of the Common Understanding, the defendant denies that he defamed the plaintiff and that the Letters are a malicious falsehood, and he counterclaims in breach of contract, proprietary estoppel, constructive trust, breach of fiduciary duty and money had and received.Defamation15     I turn first to the plaintiff’s claim in defamation. The place of commission of the tort of defamation is the place in which the defamatory statement is published (seeDicey, Morris and Collins on The Conflict of Laws(Sweet & Maxwell, 14th Ed, 2006) at 35-141). Thus, the Indonesian Publications and Indonesian Republications would be alleged torts committed in Indonesia whilst the Singapore Republications would be alleged torts committed in Singapore.16     For the Singapore Republications, the plaintiff need only show that they are actionable under Singapore law. For the Indonesian Publications and Indonesian Republications, however, the double actionability rule requires the plaintiff to show that they are actionable under both Singapore law and Indonesian law (seeBoys v Chaplin[1971] 1 AC 356 andJIO Minerals FZC and others v Mineral Enterprises Ltd[2011] 1 SLR 391 at [88]).17     If the plaintiff proves that the publications and republications are so actionable, the defendant must, in order to avoid liability, prove that he has a defence. For the Singapore Republications, the defendant must prove that he has a defence under Singapore law. However, for the Indonesian Publications and Indonesian Republications, it is sufficient for the defendant to prove that he has a defence under either Singapore law or Indonesian law (SeeCheshire and North’s Private International Law(11th ed, Butterworths 1987) at [532] cited with approval inLow Tuck Kwong v Sukamto Sia[2009] SGHC 147 at [14]).Whether the Indonesian Publications are actionable under Singapore and Indonesian lawSingapore law18     Under Singapore law, a statement is defamatory in nature if it tends to:(a)     lower the plaintiff in the estimation of right-thinking members of society generally;(b)     cause the plaintiff to be shunned or avoided; or(c)     expose the plaintiff to hatred, contempt or ridicule. (see Gary Chan Kok Yew & Lee Pey Woan,The Law of Torts in Singapore(Academy Publishing, 2011) (“The Law of Torts in Singapore”) at 12.014).19     The principles applicable to the construction of words based on their natural and ordinary meanings were summarised by the Court of Appeal inChan Cheng Wah Bernard and others v Koh Sin Chong Freddie and another appeal[2012] 1 SLR 506 (“Chan Cheng Wah Bernard”) at [18]:(a)    the natural and ordinary meaning of a word is that which is conveyed to an ordinary reasonable person;(b)    as the test is objective, the meaning which the defendant intended to convey is irrelevant;(c)    the ordinary reasonable reader is not avid for scandal but can read between the lines and draw inferences;(d)    where there are a number of possible interpretations, some of which may be non-defamatory, such a reader will not seize on only the defamatory one;(e)    the ordinary reasonable reader is treated as having read the publication as a whole in determining its meaning, thus “the bane and the antidote must be taken together”; and(f)    the ordinary reasonable reader will take note of the circumstances and manner of the publication.20     In this case, all three Indonesian Publications carried substantially the same content and meaning. I find their natural and ordinary meaning to be that (i) the plaintiff had persuaded the defendant to “invest and facilitate” the establishment of a coal mining business in Indonesia in return for 50% of the shares in the resulting coal mining company if it was established; (ii) the defendant did fund and facilitate the establishment of the coal mining company, which included the acquisition of coal mining concession rights, and the company was then established under the name of Bayan Resources; and (iii) the plaintiff never gave the defendant 50% of the shares in Bayan Resources and there was a legal dispute between them relating to these shares.21     In the 1stLetter and the 2ndLetter, the defendant demanded that the plaintiff surrender and return at least 50% of the total shares in Bayan Resources and its group, failing which he would proceed with civil and criminal suits against the plaintiff and Bayan Resources. The 3rdLetter, addressed to BAPEPAM, IDX and the IPO Advisors, asked that the IPO be suspended because of this legal dispute between the defendant and the plaintiff “so as not to cause any losses to a third party and to avoid any lawsuits by [the defendant].”22     The plaintiff submits that the Indonesian Publications are defamatory in nature as their natural and ordinary meaning is that the plaintiff, having induced the defendant to invest in a coal mining business, now known as Bayan Resources, in return for 50% of the shares of that business, has  on his part reneged on the bargain. The plaintiff further submits that the Indonesian Publications mean that the plaintiff was “seeking to mislead the public in relation to his shareholding in Bayan Resources” and that he has “therefore acted dishonourably and has committed a crime.”23     I find that to an ordinary reasonable person using his general knowledge and common sense, and in the context of an imminent IPO involving the shares of Bayan Resources which was reported to be the President Commissioner and controlling shareholder, the meaning of the Indonesian Publications would be that the defendant and the plaintiff had some private arrangement or understanding to account for and deliver 50% of Bayan Resources shares, which the plaintiff had not performed. This meaning is defamatory in nature and in the context of such an IPO, in that it would tend to lower the plaintiff in the estimation of right-thinking members of society generally or impute a lack of integrity. Thus, the Indonesian Publications are to this extent actionable under Singapore law.24     I am unable to accept the plaintiff’s extended meaning to the Indonesian Publications that the plaintiff was seeking to mislead the public in relation to his shareholding. First there is no language in the Letters suggesting this. Second, the 1stLetter and 2ndLetter are notices/”warnings” of the defendant’s claim as a prelude to his initiating civil and criminal proceedings. The 3rdLetter clearly expresses that the defendant’s claim was a “legal dispute” that he had with the plaintiff.Indonesian law25     The plaintiff’s Indonesian law expert, Dr Frans Hendra Winarta (“Dr Winarta”), is of the opinion that under Indonesian law, a person who has been defamed/”affronted” can bring a claim in the following ways:(a)     Claim for “defamation” or “libel” under article 1372 of the Indonesian Civil Code (“ICC”) read with article 310 of the Indonesian Penal Code (“IPC”) and article 1365 of the ICC; or(b)     Claim for an “unlawful act” under article 1365 of the ICC.26     The defendant’s Indonesian law expert, Dr Otto Hasibuan (“Dr Hasibuan”), is of the opinion that a claim for defamation/”affront” under Indonesian law can only be brought under article 1372 of the ICC read with article 310 of the IPC. It cannot be brought under article 1365 of the ICC, whether alone or read with article 1372 of the ICC.27     The parties and experts agreed on the following English language translations of the relevant provisions of the ICC and the IPC:(a)     Article 1365 of the ICC:Every unlawful act that brings damage to other person, obliges the person by whose fault causing such loss, to compensate such loss.(b)     Article 1372 of the ICC:The civil claim of affront (penghinaan) is aimed to get compensation of damage as well as / along with the recovery of honour and good name.In assessing / evaluating one and the other, the judge must consider the gravity of the affront (penghinaan), the rank, the position and the capacity of both parties and the circumstances.(c)     Article 310 of the IPC:(1)    Whosoever intentionally / wilfully harms someone’s honour or good name, by accusing him of certain act, with the obvious intention of spreading the allegation, is punishable, as guilty of defamation [“menista” / “smaad”], with imprisonment for a maximum of nine months or fine of maximum four thousand five hundred Rupiahs.(2)    If this is committed in written or pictorial form, spread, exhibited or posted in public, the doer is punishable, as guilty of libel [“menistadengantulisan” / “smaadschrift”], with imprisonment for a maximum of one year and four months or fine of maximum four thousand five hundred Rupiahs.28     Dr Winarta and Dr Hasibuan agree that the definition of the term “affront” in article 1372 of the ICC is found in article 310(1) of the IPC. The elements of “affront” are as follows:(a)     there must be an intentional or wilful attack on someone’s honour or good name;(b)     an accusation must be made of certain matters; and(c)     there must exist a purpose to make the defamatory attacks known to the public.29     Even if I accept the defendant’s argument that he made the Indonesian Publications with the predominant intention of protecting his interests and/or the public interest, I accept Dr Winarta’s opinion that element (a) does not speak of the predominant or sole intent of the defamatory attack, it only requires that the defendant intended that there be such an attack,ie, he did not make the attack negligently or innocently. In this case, I find that the Indonesian Publications were intentional attacks on the plaintiff’s “honour or good name”. As for the remaining elements, I find that the Indonesian Publications contained accusations against the plaintiff and that there was an intention to make the Indonesian Publications known to the public, where “public” means one or more third parties other than the plaintiff (see J. Satrio,Civil Lawsuit on the Basis of Affront as an Unlawful Act(plaintiff’s translation of the title) (“Satrio’s Opinion”) at 31-32). Thus, I find on a balance of probabilities that the Indonesian Publications are actionable under Indonesian law, and specifically under article 1372 of the ICC read with article 310 of the IPC.30     I turn next to consider Dr Winarta’s opinion that the plaintiff may alternatively elect to bring a claim under article 1365 of the ICC. Dr Hasibuan disagrees on the ground that “article 1365 is general (lexgeneralis), while article 1372 is specific (lexspecialis)”, and it is not permissible to frame a claim under a general provision when there is a clear specific provision for that purpose. To support his position, Dr Hasibuan refers to the Indonesian Supreme Court decision ofTime Inc Asia et al v H.M. Soeharto(No 273 PK/PDT/2008) (“Time Inc Asia”) where the court stated the following (at 87):That with the argument of the Plaintiff’s lawsuit [which was based on the Defendant’s picture and writing which contained insult and defamation], the Judge is not allowed to use the criteria of Article 1365 of the Civil Code but the one which should be used is Article 1372 of the Civil Code which is a special provision, because the two consequences of the provisions are very different.31     Given that this action is brought in Singapore on alleged torts committed in Indonesia, this common law precedent based court has to make findings of fact as to the law of Indonesia, a non-precedent based civil law jurisdiction, with the assistance of the Indonesian law experts. I would accordingly adopt a cautious approach and place much weight on the decision inTime Inc Asia, which is the only decision produced before this court which addresses the question of whether a defamation/”affront” claim may be brought under article 1365 of the ICC in light of article 1372 of the ICC which deals specifically  with defamation/”affront”. The Indonesian Supreme Court inTime Inc Asiaunequivocally ruled that in a defamation/”affront” action, the judge is not allowed to use the criteria of article 1365 of the ICC but only the special provision of article 1372 of the ICC. The plaintiff concedes thatTime Inc Asiadecided that a claim for defamation/”affront” should be brought under article 1372 of the ICC and not under or by reference to article 1365 of the ICC. I note Dr Winarta’s citation ofLauwJuandaLesmana v HasimSutionoSuryopratomo(No 1331K/PDT/2004) where the Indonesian Supreme Court upheld a lower court decision on an “affront” claim under article 1365 of the ICC read with article 1372 of the ICC andDendenSudarman v Yusuf Suparma(No 396K/PET/2001) where the Indonesian Supreme Court upheld a lower court decision on a defamation claim under article 1365 of the ICC. However, in neither of these cases was the question posed and addressed head on as it was in theTime Inc Asiacase. In light of this, I make a finding of fact that a claim in defamation/”affront” under current Indonesian law can only be brought under article 1372 of the ICC.32     This is not to say that Dr Winarta’s opinion that a person who has been “affronted” may alternatively bring an action under article 1365 of the ICC may not in the future find favour with the Indonesian courts, as the Indonesian courts are not bound by the doctrine of precedent. However in the absence of Indonesian Supreme Court or superior court decisions produced before me in which this question was raised and addressed head on in support of his opinion, I am unable to make a finding of fact that this is the current position under Indonesian law.Whether the Indonesian Republications are actionable under Singapore and Indonesian law33     On 18 July 2008, the plaintiff sent a letter to BAPEPAM enclosing the 1stLetter, and Bayan Resources sent a letter to BAPEPAM enclosing the 1stLetter and the 2ndLetter. Both republications had a cover letter in which Bayan Resources and the plaintiff denied the defendant’s allegations. Bayan Resources’ letter to BAPEPAM stated the following:5.    It is known that [Bayan Resources] was established in 2004 and hereby [Bayan Resources] clearly states of absence of legal relationship, in written and verbal manner, with [the defendant].6.    [Bayan Resources] hereby also clearly states that none of the companies under Bayan Resources group has any connection, in written and legal manner, with [the defendant].7.    The information / data provided by [Bayan Resources] based upon the Registration Statement for Initial Public Offering of [Bayan Resources]... is accurate and complete. Hence, [Bayan Resources] shall be fully and legally accountable for accuracy of the respective information / data as stated in the prevailing laws and regulation including but not limited to capital market regulations.In the plaintiff’s letter to BAPEPAM, the plaintiff stated:That I ... hereby deny the accuracy of the claim stated in the [1stLetter] and I would take legal responsibility for my statement in accordance with the prevailing laws and regulations including but not limited to capital market regulations.34     On 21 July 2008, Merrill Lynch Singapore sent an email to Bayan Resources attaching the 3rdLetter.35     The following passage was published: (i) on 5 August 2008 in theSuaraPembaruannewspaper at page 23; (ii) on 6 August 2008 in theBisnis Indonesianewspaper at page F3; and (iii) in Bayan Resources’ Indonesian Final Prospectus dated 6 August 2008 at page xx (English translation provided by the plaintiff):Legal process faced by company and subsidiary- Legal summons from Sukamto SiaOn 10thJuly 2008, Bayan Group together with the controlling shareholder, Dato’ Low Tuck Kwong, received a two-paged summons from the law offices of Hotman Paris & Partners stating that Mr Sukamto Sia has the right to 50% of all of the Company’s and subsidiaries’ shares, comprising Bayan Group. Through his lawyers, Mr Sia stated that the controlling shareholder of Bayan Group has agreed to give the shares to him in return for financial help of an unspecified amount and this was allegedly given by Mr Sia to the controlling shareholder in 1996.Bayan Group does not have any relations with Mr Sia and the controlling shareholder of Bayan Group has notified Bayan Group that Dato Low Tuck Kwong does not have any relations with Mr Sia besides the situation in which the Bayan Group is not involved.36     The Indonesian Final Prospectus additionally stated the following (at page 102) (English translation provided by the plaintiff):Latest DevelopmentOn 10thJuly 2008, Bayan Group together with the controlling shareholder, Dato’ Low Tuck Kwong, received a two-paged summons from the law offices of Hotman Paris & Partners stating that Mr Sukamto Sia has the right of 50% of all of the Company’ and subsidiary’s shares, comprising the Bayan Group. Through his lawyers, Mr Sia stated that the controlling shareholder of Bayan Group has agreed to give the shares to him in return for financial help of an unspecified amount and was allegedly given by Mr Sia to the controlling shareholder of Bayan Group in 1996.Bayan Group believes, and the controlling shareholder of Bayan Group has notified Bayan Group that he believes, that Sukamto Sia’s claim is baseless and careless, Bayan Group does not have any relations with Sukamto Sia and the controlling shareholder of Bayan Group has notified Bayan Group that he does not have any relations with Sukamto Sia besides the situation in which the Bayan Group is not involved, as described below.The controlling shareholder of Bayan Group has notified Bayan Group that he is the plaintiff in a trial process in Hong Kong which involved a company where Sukamto Sia owns 80% of the shares and where Mr Sia is also a Director. In the decision of the trial of 2001 the controlling shareholder of Bayan Group was awarded HK$ 108.4 million (US$ 13.9 million based on afternoon exchange rate on 22 July 2008 amounting US$ 1 = HK$ 7,7967) plus interest counted from 22 July 2000.The said company is under the process of liquidation because it was unable to satisfy the 2001 judgment. In addition, the said company’s provisional liquidator had commenced legal proceedings on Mr Sia in Hong Kong. In June 2008, the provisional liquidator obtained an interim court order on Mr Sia which is effective worldwide, to freeze his assets (and those of a co-defendant) amounting to HK$ 277.0 million (US$35.5 based on afternoon exchange rate on 22 July 2008 amounting US$1 = HK$ 7,7967) pending the resolution of the proceedings against him and the co-defendant.Bayan Group believes, and the controlling shareholder of Bayan Group has notified Bayan Group that he believes, that there is no basis for (Mr Sia’s) the claim on Bayan Group and him as stated in the summons. However, the investors should note that the resolution of legal claims involves uncertainties and judicial decisions cannot be predicted.Singapore law37     I begin by determining whether the Indonesian Republications are defamatory in nature. The defendant’s argument that the summaries of the Indonesian Publications in the Indonesian Republications bear a lesser (if any) defamatory meaning than the Indonesian Publications themselves because the summaries merely convey thefactthat the defendant has made a claim must fail because of what was termed the “repetition rule” inStern v Piper[1997] QB 123 (at 135):The repetition rule ... is a rule of law specifically designed to prevent a jury from deciding that a particular class of publication - a publication which conveys rumour, hearsay, allegation, repetition, call it what one will - is true or alternativelybears a lesser defamatory meaning than would attach to the original allegation itself.[emphasis added]38     In determining the natural and ordinary meaning of the Indonesian Republications, regard must be had to the republications as a whole (SeeChan Cheng Wah Bernardat [18(e)] (at [18] above). Unlike the Indonesian Publications, most of the Indonesian Republications contained the plaintiff’s denial of and response to the defendant’s claim which may be regarded as “the antidote” to “the bane” (seeLim Eng Hock Peter v Lin Jian Wei and another[2009] 2 SLR(R) 1004 at [92]). In this regard, I refer to the three levels of meaning set out inChase v News Group Newspapers Ltd[2003] EMLR 218 (“Chase”), where the Court held that:The sting of a libel may be capable of meaning that a claimant has in fact committed some serious act, such as murder. Alternatively, it may be suggested that the words mean that there are reasonable grounds to suspect that he/she has committed such an act. A third possibility is that they may mean that there are grounds for investigating whether he/she has been responsible for such an act.I find that the Indonesian Republications, save for the republication of the 3rdLetter by Merrill Lynch Singapore to Bayan Resources, carry only the third defamatory meaning referred to in the passage fromChasecited above,viz, there are grounds for investigating if the plaintiff had an agreement or understanding with the defendant which he had not performed, as alleged by the defendant and denied by the plaintiff. This finding will impact the quantum of damages payable by the defendant should liability be established. The republication of the 3rdLetter by Merrill Lynch Singapore to Bayan Resources, which contained the full text of the 3rdLetter and nothing more, carries the same defamatory meaning as the 3rdLetter.39     In my view, the defendant is responsible for the Indonesian Republications as they are the natural and probable result of the Indonesian Publications (seeGohChok Tong v Jeyaretnam Joshua Benjamin[1997] 3 SLR(R) 46 at [127]). The Indonesian Republications necessarily arose by reason of the disclosure requirements for public offerings of securities under articles 70, 78, 80 and 81 of the Law of the Republic of Indonesia Number 8 Year 1995 Concerning the Capital Market (“Indonesian Capital Market Law”) and other capital market requirements under Indonesian law. These extend to making such disclosures in the news media. This is supported by the opinions of Dr Winarta and the defendant’s Indonesian capital market law expert, Professor Dr Nindyo Pramono (“Professor Pramono”). Thus, the Indonesian Republications are actionable under Singapore law.Indonesian law40     Dr Winarta opined that according to theadequate veroorzakingtheory of causation under Indonesian law, a defendant who makes a defamatory statement which is republished is liable for the damage caused by the republications if such republications “reasonably can be expected to arise” from his original defamatory statement. Dr Hasibuan agreed that theadequate veroorzakingtheory is one of three theories of causation that could be used in Indonesia.41     Both Dr Winarta and Professor Pramono gave evidence that the Indonesian Republications can reasonably be expected to arise from the defendant’s Indonesian Publications owing to the disclosure requirements under Indonesia’s capital market laws (see [39] above). As such, I find on a balance of probabilities that the Indonesian Republications would be actionable under Indonesian law.Whether the Singapore Republications are actionable under Singapore law42     The plaintiff pleaded that the Letters were republished to Merrill Lynch Singapore in Singapore. There is evidence that the plaintiff personally handed the 1stLetter to Merrill Lynch Singapore in Singapore. However, as the plaintiff concedes that he does not have evidence that the 2ndLetter was received by the IPO team, including Merrill Lynch Singapore,in Singapore, and I find that there is also no evidence that the 3rdLetter was republished to Merrill Lynch Singaporein Singapore, the republication of the 2ndLetter and the 3rdLetter to Merrill Lynch Singapore will not be considered for the purposes of liability in this Suit.43     The following passage was published in the following documents: (i) at page 3 of Bayan Resources’ Pricing Supplement to the International Preliminary Offering Memorandum dated 24 July 2008 (the “Pricing Supplement”), hard copies and soft copies of which were sent to potential investors in Singapore; and (ii) at page 5 of Bayan Resources’ International Final Offering Memorandum dated 24 July 2008 (the “International Final Offering Memorandum”), which was distributed to potential investors in Singapore:Recent DevelopmentsOn July 10, 2008, we and our controlling shareholder, Dato’ Low Tuck Kwong, received a two-page notice from the law firm of Hotman Paris & Partners alleging that Mr Sukamto Sia is entitled to 50% of the shares in the Company and its subsidiaries comprising the Bayan Group. Through his attorney, Mr. Sia has alleged that our controlling shareholder agreed to provide these shares to him in return for an unspecified amount of financing allegedly provided by Mr. Sia to our controlling shareholder in 1996. Through his attorney, he has also threatened to initiate legal proceedings.On July 21, 2008, Hotman Paris & Partners, on behalf of their client Mr. Sia, sent a letter to various parties including the regulatory authorities in Indonesia, including BAPEPAM-LK, which repeated the allegations and requested cancellation of the Combined Offering.We believe, and our controlling shareholder has advised us that he believes, Mr. Sia’s claim is totally without merit and is frivolous. The Bayan Group has had no dealings whatsoever with Mr. Sia, and our controlling shareholder has advised us of the following matter in which the Bayan Group is not involved, as described below.Our controlling shareholder has advised us that he is a plaintiff to a litigation in Hong Kong involving a company in which Mr. Sia owned an 80% interest and of which Mr. Sia was a director. In the litigation, our controlling shareholder obtained a judgment in 2001 against the company for approximately HK$108.4 million (US$13.9 million based on the noon buying rate as of July 22, 2008) plus interest from July 22, 2000.The company is in the process of being liquidated because it was unable to satisfy the 2001 judgment. In addition, the provisional liquidator of the company has instituted proceedings against Mr. Sia in Hong Kong. In June 2008, the provisional liquidator of the company obtains an interim court order against Mr. Sia, which purports to be effective worldwide, to freeze his assets (and those of his co-defendant) up to a value of HK $277.0 million (US$35.5 million based on the noon buying rate as of July 22, 2008), pending the resolution of the proceedings against him and his co-defendant.We believe, and our controlling shareholder has advised us that he believes, that there is no basis whatsoever for the claim against us and him set out in the notice. Notwithstanding the foregoing, we and our controlling shareholder expect that litigation proceedings may be commenced against us and our controlling shareholder. We intend to vigorously defend Mr. Sia’s claims against us and our controlling shareholder has advised that he intends to vigorously defend Mr. Sia’s claims against him. However, investors should note that the resolution of legal claims in Indonesia involves uncertainties and judicial decisions in Indonesia may be unpredictable.44     Applying the principles of Singapore law set out above (at [37]-[39]), I find that the Singapore Republications are actionable under Singapore law. The republication of the 1stLetter by the plaintiff to Merrill Lynch Singapore, which contained the full text of the 1stLetter and nothing more, carries the same defamatory meaning as the 1stLetter. I find that the remaining Singapore Republications carry the third defamatory meaning referred to in the passage fromChasecited above at [38],ie, they tell an ordinary reasonable reader that there are grounds for investigating if the defendant’s claims are true. The defendant is responsible for the Singapore Republications, which were a natural and probable consequence of the Indonesian Publications because the IPO was a global offering.Whether there is a defence under Singapore law for the Indonesian Publications, Indonesian Republications and Singapore Republications45     The defendant relies on the following defences under Singapore law: justification, absolute privilege and qualified privilege. I will examine each in turn.Justification46     InArul Chandran v Chew Chin Aik Victor[2001] 1 SLR(R) 86 (“Arul Chandran”), the Court of Appeal explained (at [28]) that the defence of justification requires the defendant to prove the truth of the defamatory statements:[t]he law of defamation presumes that defamatory words are false and the plaintiff need do no more than prove that the defamatory words have been published by the defendant. The burden is then on the defendant, if he wishes to rely on the defence of justification, to prove that those words are true.47     The rationale for the defence of justification is set out inThe Law of Torts in Singaporeat [13.004] as follows:The rationale for the defence of justification is based on the presumption that by telling the truth about the plaintiff, his reputation “is not lowered beyond its proper level, but is merely brought down to it”. Further “the law does not protect the reputation that a man has, but only the reputation that he deserves”.48     I have found the natural and ordinary meaning of the Indonesian Publications to be that set out above at [20]. The defendant’s defence is that the content of the Indonesian Publications is true because of the Common Understanding between him and the plaintiff.49     As such, I now set out the evidence in this court on the Common Understanding. The defendant’s evidence is that in late 1995, the plaintiff, who was then in financial difficulty, asked the defendant for S$3 million to “invest and facilitate” the plaintiff’s establishment of an Indonesian coal mining business. The plaintiff promised the defendant in return, a 50% share in the coal mining business if it was established, and if it was not, that he would repay the S$3 million. The defendant then gave S$3 million cash to the plaintiff, who issued him a cheque dated 25 April 1996 for S$3 million (the “Cheque”) as an assurance that the defendant would get his money back if the coal mining business was not established. It was also the defendant’s evidence that he had, over the years of his close friendship with the plaintiff, made other large cash and undocumented loans to the plaintiff, although this S$3 million was the biggest amount “in one shot”.50     The plaintiff denies that he had received S$3 million from the defendant and denies that there was any Common Understanding. To refute the defendant’s claim that he needed S$3 million in 1995, the plaintiff produced some evidence of his assets at that time. The defendant points out that this evidence was not supported by any valuation nor was there any evidence produced of the plaintiff’s liabilities at that time. The plaintiff confirmed under cross-examination that in early 1996, he had “some problems with [his] cash flows” and was considering selling part of his art collection. The plaintiff also admitted that his two active Singapore bank accounts were overdrawn for every month between mid-1995 to mid-1996. The plaintiff’s explanation for the Cheque is that he issued it on 25 April 1996 (and not in late 1995) at the request of the defendant, who wanted to use it to raise funds from others in order to procure payment by the defendant’s company (“Dynasty”) which had not paid the plaintiff and six others vendors for shares for listed shares purchased by and delivered to Dynasty. This debt led to the Hong Kong court proceedings by the plaintiff and other vendors against Dynasty which led to the appointment of provisional liquidators of Dynasty. The provisional liquidators obtained a Hong Kong worldwide Mareva injunction against the defendant which was later discharged. The plaintiff gave evidence that he had told the defendant not to cash the Cheque as there were insufficient funds in his account. The defendant challenges the plaintiff’s explanation in light of the plaintiff’s evidence that Dynasty then owed the vendors about S$41 million, a much larger sum than S$3 million.51     The defendant draws support for the Common Understanding from the chronology of events in late 1995 (which he says were unknown to him until after he received Bayan Resources’ draft prospectus in July 2008). This chronology reveals that the plaintiff incorporated a Singapore company, International Coal Pte Ltd (“ICP”) on 4 October 1995. Under cross-examination, the plaintiff stated that the Indonesian government had granted a coal mining concession to an Indonesian company called PT Gunung Bayan Pratama Coal (“GBPC”), and that GBPC had sold 65% of its concession rights to a Hong Kong company, Kristle Trading Limited (“Kristle”). On 1 November 1995, Kristle sold these concession rights to ICP. The plaintiff gave evidence that he later discovered that the transfer of concession rights was not recognised under Indonesian law. As such, in November 1997, the plaintiff having become an Indonesian citizen together with his partners acquired GBPC itself and thereafter used GBPC to produce coal. On 7 October 2004, Bayan Resources was incorporated in Indonesia and it subsequently acquired a controlling interest in GBPC. When Bayan Resources was listed on the IDX on 12 August 2008, GBPC was one of many of its subsidiaries. The plaintiff argues that information about the history of his involvement in the coal mining business is publicly available and that the defendant has hitched this publicly available chronology of events to corroborate his alleged Common Understanding.52     The evidence in court of the Common Understanding turns entirely on the plaintiff’s and the defendant’s respective word, there being, apart from the Cheque, no other witnesses or documentary evidence. This is a case of one party’s evidence and recollection of events in 1995 pitted against the other party’s contrary evidence and recollection of the same events relating to whether there was and if so what was the Common Understanding. Throughout the trial, each party repeatedly and extensively challenged the other’s veracity and credibility. This was further done by referring this court to sworn statements which they had each filed in earlier Hong Kong and Singapore court proceedings between them or involving them. These earlier sworn statements reveal that each of them had given evidence or explanations before these courts which are diametrically contradictory to the evidence, explanations and accounts which they each now give in this court. The only objective documentary evidence produced in this court was the Cheque. Apart from the fact that it is for $3 million, when it was issued and why remains obscure in the light of the time lapse and that the parties had many personal and financial transactions between them before they fell out.53     In the light of the above, I am unable to find, on the evidence adduced in this court, one way or another that there was or there was no Common Understanding or the terms of such Common Understanding. As such, I find that the defendant has not discharged his burden to prove the truth of the Indonesian Publications and therefore of the Indonesian Republications and Singapore Republications, and the defence of justification accordingly has not been made out.Absolute privilege54     I next turn to the defence of absolute privilege. The rationale for this defence is explained inThe Law of Torts in Singaporein the following manner (at [13.040]):Free speech is so significant in certain situations such that complete immunity is afforded to defamatory statements even where they may be untrue and made maliciously. These include statements which attract Parliamentary privilege, statements made during the course of or related to judicial proceedings as well as Executive matters....55     InLincoln v Daniels[1962] 1 QB 237, Devlin L.J. explained that absolute privilege which covers proceedings in or before a court of justice can be divided into the following three categories (at 257-258):The first category covers all matters that are done coram judice. This extends to everything that is said in the course of proceedings by judges, parties, counsel and witnesses, and includes the contents of documents put in as evidence. The second covers everything that is done from the inception of the proceedings onwards and extends to all pleadings and other documents brought into existence for the purpose of the proceedings and starting with the writ or other document which institutes the proceedings. The third category is the most difficult of the three to define. It is based on the authority ofWatsonv.M’Ewan, in which the House of Lords held that the privilege attached to evidence which a witness gave coram judice extended to the precognition or proof of that evidence taken by a solicitor. It is immaterial whether the proof is or is not taken in the course of proceedings.This means that absolute privilege covers everything that is done before a judge (for example, during a trial), everything that is done in the course of court proceedings from its commencement (when the writ or an equivalent document is issued) to its conclusion (when a decision is rendered or a determination made), and things done before the commencement of court proceedings which are considered to be “a step towards” the conduct of proceedings (Watson v M’Ewan[1905] AC 480 at 487).56     The defendant submits that the Indonesian Publications are protected by absolute privilege on the grounds that:(a)     the 3rdLetter, insofar as it was sent to BAPEPAM, falls within Devlin L.J.’s second category as it was “the first step in a regulatory process of a quasi-judicial nature”; and(b)     all the Letters fall within Devlin L.J.’s third category as they were necessary to the commencement of proposed legal proceedings by the defendant against the plaintiff to enforce the Common Understanding.57     In respect of the first ground, I accept that absolute privilege may in limited occasions be extended beyond court proceedings to proceedings before tribunals which act in a manner similar to courts of law (seeD v Kong Sim Guan[2003] 3 SLR(R) 146 at [99]). InTrapp v Mackie[1979] 1 WLR 377 at 379, Lord Diplock set out the following factors to determine if sufficient similarity exists for absolute privilege to apply (at 379):(a)     the authority under which the tribunal acts;(b)     the nature of the question into which it has a duty to inquire;(c)     the procedure adopted by it in carrying out the inquiry; and(d)     the legal consequences of the conclusion reached by the tribunal as a result of the inquiry.58     I note the case ofMahon v Rahn(No. 2) [2000] 1 WLR 2150 in which the English Court of Appeal extended absolute privilege to a bank’s response to queries from a securities regulator. I further noteBuckley v Dalziel[2007] 1 WLR 2933 in which the English Court extended absolute privilege to a complaint made to the police.59     Article 4 of the Indonesian Capital Market Law provides that BAPEPAM shall develop and regulate capital market activities so as to create an orderly and efficient capital market and to protect the interests of investors and the public. Article 5 of the same law provides that BAPEPAM may conduct or procure inspections into suspected violations of the Indonesian Capital Market Law and suspend or cancel listings or stock exchange transactions. Both Dr Winarta and Professor Pamono agree that BAPEPAM is not a court of law and is not in a position to determine who is right or wrong on the matter at hand. They also agree that BAPEPAM only has an “interest as to whether the registration statement submitted by the companies which are going public contain the material information or not.” It is unclear from the expert evidence that the 3rdLetter to BAPEPAM whether BAPEPAM would have precipitated BAPEPAM to conduct a formal inquiry following the dispute described in this Letter and what legal consequences would follow in this pre-IPO context.60     In any event, it is significant to note what occurred on this occasion. The 3rdLetter to BAPEPAM was not a complaint for BAPEPAM to conduct an investigation. It was expressly for the purpose of requesting BAPEPAM to suspend the planned IPO because of the legal dispute between the defendant and the plaintiff relating to the Bayan Resources shares. The result of the 3rdLetter, according to the plaintiff, was that the IPO Advisors met with BAPEPAM and were told that they “would have to clear any disputes on the shares before the IPO could proceed”. According to the plaintiff, the matter was resolved when upon the advice of the IPO Advisors the plaintiff decided and informed BAPEPAM that he would withdraw his planned vendor shares offer which would be replaced by vendor shares offered by theother shareholders to make up the shortfall. In these circumstances and without greater clarity on Indonesian capital market law and practice, I am unable to conclude that absolute privilege would extend to the 3rdLetter to BAPEPAM.61     In respect of the second ground that all the Letters were necessary, under Indonesian law, before court proceedings could be commenced, the Indonesian law experts have different opinions as to whether the defendant had a legal obligation under articles 1238 and 1243 of the ICC to send a warning letter to the plaintiff before he commenced legal proceedings against the plaintiff. In any event, as Dr Winarta pointed out, the defendant was not required by Indonesian law to send the 1stLetter and the 2ndLetter to Bayan Resources, who was not an alleged contractual counterparty to the defendant. The defendant has also not shown that he had a legal obligation to send the 3rdLetter to BAPEPAM, IDX and the IPO Advisors prior to commencing a court action against the plaintiff and Bayan Resources in Indonesia.  Thus, it has not been established before this court that the requisite Singapore law elements for absolute privilege have been made out.Qualified privilege62     In respect of the defence of qualified privilege, the defendant argues that the Indonesian Publications, Indonesian Republications and Singapore Republications were published on privileged occasions because the “duty-interest” test is satisfied.  This test was explained by Lord Atkinson inAdam v Ward[1917] A.C. 309 at 334:A privileged occasion is ... an occasion where the person who makes a communication has an interest, or a duty, legal, social or moral, to make it to the person to whom it is made, and the person to whom it is so made has a corresponding interest or duty to receive it. This reciprocity is essential.InMallan v A M Bickford & Sons, Limited[1915] SALR 47), the court held that (at 84):[I]t may be accepted as a well-established rule that some duty or interest must exist in the party to whom the communication is made as well as in the party making it. The duty or interest may be common to both parties, but this is not essential. It is enough if there is a duty or interest on one side, and a duty or interest, or interest or duty (whether common or corresponding or not) on the other.63     The rationale for the defence of qualified privilege was stated by Lord Diplock inHorrocks v Lowe[1975] AC 135 (“Horrocks”) (at 149) to be as follows:The public interest that the law should provide an effective means whereby a man can vindicate his reputation against calumny has nevertheless to be accommodated to the competing public interest in permitting men to communicate frankly and freely with one another about matters in respect of which the law recognises that they have a duty to perform or an interest to protect in doing so. What is published in good faith on matters of these kinds is published on a privileged occasion. It is not actionable even though it be defamatory and turns out to be untrue.64     I turn now to the question of whether the defendant had an interest to make the Indonesian Publications. The scope of the “interest” that is required to establish the defence of qualified privilege is explained inGatley on Libel and Slander(Sweet & Maxwell, 11th ed, 2008) (“Gatley”) as follows (at 14.12):The law does not restrict the interests which the defendant may protect by asserting freely what he believes to be true. In the majority of the cases, the interests protected have been business interests; thus, the defendant may write freely to claim money he believes to be due to him, ...InBlackham v Pugh(1846) 15 L.J.C.P. 290, which is cited byGatleyimmediately after the above passage, Tindal CJ recognised and applied (at 620) (see also Coltman J at 621, Cresswell J at 623-624 and Erle J at 625-626):… that principle by which a communication made, by a person immediately concerned in interest, in the subject-matter to which it relates, for the purpose of protecting his own interest, in the full belief that the communication is true, and without any malicious motive, is held to be excused from responsibility in an action for a libel.65     In the present case, while the defendant has not been able to prove that his claims in the Indonesian Publications are true, it remains to be determined whether he believed them to be true and without any malicious motive in order to be excused from responsibility for the defamation.66     In my view, the defendant’s actions in instructing his Singapore and Indonesian lawyers and acting on the latter’s advice to make the Indonesian Publications show that he believed that he had a claim against the plaintiff and that his claims in the Indonesian Publications were true. The defendant issued his Indonesian lawyers a power of attorney which authorised them to take a broad range of legal steps to pursue his claim. Further, it is in evidence that on 29 June 2008, the defendant’s friend and an investment banker at Merrill Lynch Singapore, Mr Christopher Clower, mentioned to the defendant that he was working on an IPO of an Indonesian coal mining company. The defendant later overheard Mr Clower mentioning a “Dato Low” in a private telephone call. This would be consistent with the defendant’s account of what precipitated his actions that followed. It is his evidence that he then made further independent enquiries and obtained a copy of Bayan Resources’ draft prospectus dated 2 July 2008. Following this, he instructed his Indonesian lawyers to make the Indonesian Publications. These actions and timelines corroborate that he believed that he had a claim against the plaintiff. The defendant’s conduct and demeanour under cross examination in this court further reflected his continued belief. That being my finding, the Indonesian Publications were made in order to protect what the defendant believed to be his business interests.67     With respect to the recipients of the Indonesian Publications which contained information about the defendant’s claim, I find that Bayan Resources had an interest in receiving the 1stLetter and the 2ndLetter. Bayan Resources had a duty to disclose all the material facts in the global IPO and listing documents. The defendant’s claim for 50% of Bayan Resources’ shares is material and disclosable in the context of the global IPO in two critical respects: first with respect to the identities of the controlling shareholders of Bayan Resources and second the fact of the claim itself. The IPO Advisors had an interest in receiving the 3rdLetter as they would share responsibility for the accuracy and completeness of the global IPO documents. I find Macquarie Securities and Macquarie Consultants (both occupying the same Jakarta address) to be part of “Macquarie” which is described only by its logo in Bayan Resources’ Preliminary Offering Memorandum dated 4 July 2008 as the co-lead manager and international selling agent in the global IPO. IDX had an interest to receive the 3rdLetter as it is the stock exchange on which Bayan Resources was to be listed and traded. Finally, BAPEPAM had an interest to receive the 3rdLetter as it is the principal capital market regulator which will decide whether to issue the Effective Statement for the IPO. For the above reasons, the defence of qualified privilege extends to the Indonesian Publications.68     The defence of qualified privilege will be defeated if the plaintiff can show that there was malice on the part of the defendant. In this case, the plaintiff argues that malice is made out because (i) the defendant had a “deep-seated hatred” for the plaintiff after the plaintiff commenced legal actions against him and Dynasty in Hong Kong, resulting in a worldwide Mareva injunction being ordered against him; (ii) the defendant wanted to exact revenge by stopping the IPO or preventing the plaintiff from selling his shares in the IPO, outcomes which could not have been of any legitimate consequence to him; and (iii) the defendant made the Indonesian Publications despite knowing that they contained false claims.69     It is clear from the authorities that in order to defeat the defence of qualified privilege, it is not enough to show that the defendant disliked the plaintiff and knew that the defamatory statement would injure the plaintiff. In this regard, I refer to observations Lord Diplock’s observations inHorrocks, where he held (at 149):So the motive with which the defendant on a privileged occasion made a statement defamatory of the plaintiff becomes crucial. The protection might, however, be illusory if the onus lay on him to prove that he was actuated solely by a sense of the relevant duty or a desire to protect the relevant interest. So he is entitled to be protected by the privilege unless some other dominant and improper motive on his part is proved. “Express malice” is the term of act descriptive of such a motive. Broadly speaking it means malice in the popular sense of a desire to injure the person who is defamed and this is generally the motive which the plaintiff sets out to prove.But to destroy the privilege the desire to injure must be the dominant motive for the defamatory publication; knowledge that it will have that effect is not enough if the defendant is nevertheless acting in accordance with a sense of duty or in bona fide protection of his own legitimate interests.[emphasis added]Lord Diplock continued (at 150-151) to hold:Judges and juries should, however, be very slow to draw the inference that a defendant was so far actuated by improper motives as to deprive him of the protection of the privilege unless they are satisfied that he did not believe that what he said or wrote was true or that he was indifferent to its truth or falsity.The motives with which human beings act are mixed. They find it difficult to hate the sin but love the sinner. Qualified privilege would be illusory, and the public interest that it is meant to serve defeated, if the protection which it affords were lost merely because a person, although acting in compliance with a duty or in protection of a legitimate interest, disliked the person whom he defamed or was indignant at what he believed to be that person’s conduct and welcomed the opportunity of exposing it.It is only where his desire to comply with the relevant duty or to protect the relevant interest plays no significant part in his motives for publishing what he believes to be true that “express malice” can properly be found.[emphasis added]70     I have found that the defendant believed his claim was true at [66] above. I am unable to accept that stopping Bayan Resources’ IPO and preventing the plaintiff from selling his shares in the IPO are outcomes which could not have been of any legitimate consequence to the defendant. Since his claim is for 50% of Bayan Resources’ shares, he had every reason to want to preserve thestatus quountil his claims were resolved by agreement or by the courts. The text of the 3rdLetter was a request to BAPEPAM to suspend the IPO because of the legal dispute between the defendant and the plaintiff relating to the Bayan Resources shares. Further, while the defendant has not been able to adduce evidence in this court to prove the Common Understanding, this alone cannot warrant any adverse inference that he knew that the Indonesian Publications contained false claims. That the claims in the Indonesian Publications were false have to be independently provided in this court and they have not been proven. For the above reasons, I find that the plaintiff has been unable to prove malice that would defeat the defence of qualified privilege.71     Finally, I turn to the question of whether the defendant can raise the defence of qualified privilege in respect of the Indonesian Republications and Singapore Republications. The defendant argues that it can and relies on the following passage inGatleyat (para 6.43):If D, without malice, makes a statement to X on a privileged occasion and X repeats the statement to Y, again on a privileged occasion, D has a defence in respect of both the original publication and the republication. ... If the statement by D to X was not on a privileged occasion but the republication by X was, D is obviously liable in respect of the publication to X, but what is his position in respect of the republication by X? The difficulty is that if D is to be treated as a publisher on the occasion of the republication there is simply no wrong on that occasion.72     It is the plaintiff’s own case that the plaintiff, Bayan Resources and the IPO Advisors had a legal duty to disclose the defendant’s claim to BAPEPAM and to the investing public through the IPO documents as well as the news media. I would add that this is because BAPEPAM and the potential IPO share purchasers each had an interest to receive information about the claim. In terms of the republications between the plaintiff, Bayan Resources and the IPO Advisors, the duty-interest test is similarly satisfied: the republisher had an interest to make the republication and the recipient to whom the republication was made had an interest to receive it. For these reasons, I find the Indonesian Republications and Singapore Republications each to have been made on occasions of qualified privilege. The defence of qualified privilege therefore applies to the Indonesian Publications, Indonesian Republications and Singapore Republications.Whether there is a defence under Indonesian law for the Indonesian Publications and Indonesian Republications73     The defendant relies on the public interest defence and the necessary defence set out in article 1376 of the ICC. The agreed translation of this provision states as follows:The civil claim concerning affront cannot be granted if the intention to affront is not proven. The intention to affront is deemed not to exist if the doer/offender obviously did so for the sake of public interest or for his necessary defence.Public interest defence74     On the public interest defence, Dr Winarta refers to the following passage from Satrio’s Opinion at 91 (English translation provided by the plaintiff):What is certain is that public interest is not for the interest of the statement giver himself, but should always be related to other person’s interest, even though it may be also included within it (together with) the interest of the statement giver himself.75     During the trial, Dr Winarta and Dr Hasibuan agreed that where the statement in question was made for both the defendant’s personal interest and the public interest, the public interest element must have been greater than the private interest element in order for the defence to succeed. They also agreed that for the defence to succeed, the statement must be true. Since the defendant has not been able to prove in this court that the content of the Indonesian Publications, Indonesian Republications and Singapore Republications are true (see above at [52]), the public interest defence  under Indonesian law appears to be unavailable.Necessary defence76     For the necessary defence to be established, Dr Winarta is of the opinion that the statement in question must be (i) true; (ii) said in good faith; (iii) in proportion to the circumstances; and (iv) made in court proceedings. Although Dr Hasibuan opines that the necessary defence applies in this case, he gave evidence during trial that in his thirty years of experience, he did not know of any textbook or Supreme Court decision which says that the necessary defence applies outside of court proceedings. Since the Indonesian Publications, Indonesian Republications and Singapore Republications were made outside of court proceedings, and also because the defendant has been unable to prove the truth of the content of the Indonesian Publications, Indonesian Republications and Singapore Republications (see above at [52]), the necessary defence appears to be unavailable.Whether the reliefs claimed are available under Singapore law and Indonesian law77     Although I have found that the defence of qualified privilege has been made out in respect of the Indonesian Publications, Indonesian Republications and Singapore Republications, I will, for completeness, examine whether the reliefs claimed by the plaintiff are available under Singapore law and Indonesian law. The plaintiff is claiming the following reliefs:(a)     general damages, including damages for loss of opportunity and aggravated damages;(b)     special damages (with interest and damages for currency exchange loss); and(c)     an injunction to restrain the defendant, whether by himself, his servants, agents or otherwise howsoever, from publishing or causing to be published the same or similar words defamatory of the plaintiff in any manner whatsoever.78     The plaintiff must prove that the types of reliefs that he is seeking for the Indonesian Publications and Indonesian Republications are available under both Indonesian law and Singapore law. The plaintiff must also prove that the reliefs that he is seeking to claim for the Singapore Republications are available under Singapore law.Singapore law79     Under Singapore law, a person who has been defamed can claim general damages as compensation for the effects of the defamation. InArul Chandran, the Court of Appeal explained that (at [53]):General damages serve three functions. Firstly, they act as a consolation to the plaintiff for the distress he suffered from the publication of the statement. Secondly, they repair the harm to his reputation. Thirdly, they serve to vindicate his reputation ...InMcCarey v Associated Newspapers Ltd(No. 2) [1965] 2 Q.B. 86 at para 104, the Court held that “compensatory damages may include not only pecuniary loss and anticipated pecuniary loss or any social disadvantages which result, or may be thought likely to result, from the wrong which has been done”. It was noted inGatleyat para 9.2 that while actual financial loss which is not too remote is recoverable, it is “a comparatively rare case in which evidence of such loss is given, simply because it is not available”. Accordingly, a plaintiff in a defamation action may recover general damages for financial loss that he is able to prove flowed from the defamation.80     Under Singapore law, aggravated damages are a component of general compensatory damages (seeGohChok Tong v Jeyaretnam Joshua Benjamin[1998] 2 SLR(R) 971 at [51]) and are available as a remedy for defamation. The factors that the courts consider in determining damages, including whether aggravated damages are justified, are as follows (seeHalsbury’s Laws of Singapore(volume 18) (LexisNexis, 2012 Reissue) (“Halsbury’s Laws of Singapore”) at [240.194]):(1)the nature and gravity of the defamatory statement itself;(2)the conduct, position and standing of the plaintiff and the defendant;(3)the mode and extent of publication;(4)the natural indignation of the court at the injury caused to the plaintiff;(5)the conduct of the defendant from the time the libel is published to the very moment of the verdict;(6)whether the defendant has apologised for and retracted the defamatory statement; and(7)the motives of the defendant in making the defamatory  statement, in particular, whether the plaintiff acted with malice.In this case, even if liability for defamation were to have been made out, I find that no aggravated damages would be warranted. The Indonesian Publications were made to a limited audience of Bayan Resources, the necessary regulators and the IPO Advisors, and the republications were necessitated by applicable disclosure laws. Given that there remained a dispute between the parties relating to the Common Understanding, no natural indignation of the court at the injury caused to the plaintiff arises. Finally the conduct of the defendant from the time of the Indonesian Publications to this action is consistent with his belief that he has a claim though he has not been able to prove this claim on the basis of evidence adduced in this court. Whilst the parties are currently bitter enemies, the plaintiff has not proved that the defendant made the Indonesian Publications with malice devoid of any interest or that they contained false claims.81     Special damages may also be awarded in an action for defamation. Thus,Halsbury’s Laws of Singaporestates (at [240.205]):Special damages... may be awarded in respect of any material temporal injury proved to have been suffered as the natural, and not unduly remote, consequence of the defamatory publication complained of. It is the loss of some material temporal advantage, pecuniary or capable of being estimated in money, which flows directly and in the ordinary course of things from the act of the defendant or an act for which he is responsible....The defendant does not dispute that special damages are available under Singapore law. He argues, however, that he did not cause the loss for which the plaintiff claims special damages. This is an issue for the assessment of damages stage of the proceedings.82     Finally, under Singapore law, a court which has found a defendant liable for defamation has jurisdiction to grant an injunction restraining “any repetition of the slander or of similar imputations” (Lee Kuan Yew v Jeyaretnam Joshua Benjamin[1990] 1 SLR(R) 709 at [61];Arul Chandran v Chew Chin Aik Victor JP(Suit No 1896 of 1998) at [331]). The court will grant such an injunction if it is satisfied that the words are injurious to the plaintiff and there is reason to apprehend further publication by the defendant (Gatleyat [9.28]). The defendant does not dispute that an injunction is a relief that the plaintiff may claim under Singapore law. In this case, I see no grounds for the issue of an injunction as there is no evidence before me as would give rise to an apprehension of further publication of the claims in the Indonesian Publications by the defendant.Indonesian law83     According to Dr Winarta, a plaintiff in an article 1372 of the ICC action can claim for (i) compensation of damages and (ii) payment of money to reinstate his honour and good name. In his opinion, “compensation of damages” in article 1372 of the ICC is the equivalent of the material damages that are recoverable under article 1365 of the ICC whereas “recovery of honour and good name” in article 1372 of the ICC is the equivalent of the immaterial damages that are recoverable under article 1365 of the ICC. In respect of material damages, a plaintiff may recover actual loss suffered and expected loss of income or profit. A plaintiff may also recover “cost, loss and interest” under articles 1243-1252 of the ICC (which deal with breach of contract claims but which, in his opinion can be applied by analogy to claims under article 1365 of the ICC). In respect of damages of a non-material nature, a plaintiff may recover damages for,eg, pain, shame, stress, and having his good name ruined.84     Dr Hasibuan’s disagrees, and opines that a plaintiff in an article 1372 of the ICC action may make the following claims:(a)     a claim for material lossdue to the damage to his reputation and honour;(b)     a claim for his honour and reputation to be restored; and(c)     a claim for it to be mentioned in the judge’s decision that the action complained of is an insult.Dr Hasibuan explains that the reason for the limitation in limb (a) above is because of the second sentence in article 1372 of the ICC which directs the judge to “consider the gravity of the affront, the rank, the position and the capacity of both parties and the circumstances”.85     As I have made a finding of fact that under current Indonesian law, a claim in defamation/”affront” can only be brought under article 1372 of the ICC (see above at [31]), the plaintiff can only claim, in respect of the Indonesian Publications and Indonesian Republications, the remedies available in an article 1372 action. I am unable to conclude that the remedies available in an article 1372 action extend to those available under article 1365 of the ICC and articles 1243-1352 of the ICC, as proposed by Dr Winarta. I accept Dr Hasibuan’s opinion that in an article 1372 action, damages are claimable for material loss only to the extent that such loss is due to the damage to the plaintiff’s reputation and honour.86     I accept Dr Winarta’s opinion that a judge hearing an article 1372 of the ICC action may take into account the relevant circumstances set out in article 1372, including the aggravating and mitigating circumstances. Thus, what is termed “aggravated damages” under Singapore law is available under Indonesian law in an article 1372 action. Dr Winarta further opines that under Indonesian law, the Indonesian courts can grant an injunction to compel a defendant to do an act. The defendant does not dispute this. I therefore accept that an injunction is an available remedy under Indonesian law.87     In summary, damages for loss of opportunity may be recoverable under Singapore law and under Indonesian law but only to the extent that it is due to the damage to the plaintiff’s reputation and honour. While aggravated damages and injunctions are available remedies under Singapore law and Indonesian law, they are not warranted in this case under Singapore law.Malicious falsehood88     I turn next to the plaintiff’s claim in malicious falsehood. The plaintiff’s case is that the Indonesian Publications are a malicious falsehood. The plaintiff must thus prove that there was a malicious falsehood under Singapore law and that the acts complained of are also actionable under Indonesian law.Singapore law89     The elements of the tort of malicious falsehood are as follows (seeWBG Network (Singapore) Pte Ltd v Meridian Life International Pte Ltd and others[2008] SGHC 114):(a)     the defendant published to third parties words which are false;(b)     the words refer to the claimant or his property or his business;(c)     the words were published maliciously; and(d)     special damage has followed as a direct and natural result of their publication.90     InThe Law of Torts in Singapore, the learned authors explain the meaning of “malice” in the following way (at 14.041):The meaning of malice in the context of malicious falsehood is similar to that for malice sufficient to defeat the defence of qualified privilege in defamation... That is, the defendant would be regarded as having acted with malice if he or she:(a)    was actuated by an improper or ulterior motive; or(b)    did not honestly believe that the statement was trueorwas reckless as to the truth of the statements.91     The element of “malice” is explained byGatleyat para 21.7 as follows:There is no liability in malicious falsehood for a statement published in good faith. ... Mere negligence is not malice .... A statement false in fact and calculated to produce actual damage will therefore not support [an action in malicious falsehood] if it was made in the belief, even a careless belief, that it was true. The defendant may have acted stupidly in asserting a right, yet if he bona fide believed such right to exist, no action lies.92     In this case, the plaintiff has not proven on the evidence that the claims in the Indonesian Publications are false, just as the defendant has not proven on the evidence that they are true (see above at [52]). I have also found, in respect of the plaintiff’s claim in defamation, that the defence of qualified privilege has been made out and not defeated by reason of malice (see above at [68]–[70]). Accordingly, the plaintiff’s claim in malicious falsehood has not been made out.Indonesian law93     Since I have found that the plaintiff’s claim in malicious falsehood has not been made out under Singapore law, it is not necessary to consider if the acts complained of are actionable under Indonesian law.Counterclaims: breach of contract, proprietary estoppel, constructive trust, breach of fiduciary duty and money had and received94     As the defendant has acknowledged, all of his counterclaims turn on the existence of the Common Understanding. Since he has not, on the evidence before me, been able to prove the Common Understanding (see above at [52]), his counterclaims in breach of contract, proprietary estoppel, constructive trust, breach of fiduciary duty and money had and received have not be made out.Conclusion95     In summary, the plaintiff’s claim in defamation cannot succeed because the defence of qualified privilege extends to the Indonesian Publications, Indonesian Republications and Singapore Republications. The plaintiff has not been able to prove the malice and falsehood required to establish a claim in malicious falsehood. The defendant, by not being able to prove the Common Understanding, is unable to establish his counterclaims in breach of contract, proprietary estoppel, constructive trust, breach of fiduciary duty and money had and received.96     I would place on record my appreciation to the Indonesian law experts, Dr Winarta, Dr Hasibuan and Professor Pramono for their patient and painstaking clarification and explanations of their opinions on Indonesian law.97     Costs are to follow the event. They are to be agreed or taxed.",
        "2ndLetter of 15 July 2008": "5       On 15 July 2008, HPP sent a second letter to the plaintiff, Bayan Resources and SRS (the “2ndLetter”) which was, save in one immaterial way, identical to the 1stLetter.",
        "3rdLetter of 21 July 2008": "6       On 21 July 2008, HPP sent a third letter to (a) the Chief of theIndonesian Capital Market and Financial Institutions Supervisory Agency (“BAPEPAM”), the Indonesian capital market regulator; (b) the Director in Chief of the IDX; (c) PT Trimegah; (d) Merrill Lynch at a Jakarta address; and (e) Macquarie Securities and Macquarie Consultants at an identical Jakarta address (the “3rdLetter”). The 3rdLetter enclosed the 1stLetter, the SRS Letter and the 2ndLetter. The defendant’s English translation of the 3rdLetter, which was written in Bahasa Indonesia, reads as follows (where there are material differences highlighted by the parties between their translations, the defendant’s translation is underlined and the plaintiff’s translation follows in square brackets and italics): Law FirmHOTMAN PARIS & PARTNERS...July 21, 2008ToCapital Market Executive         Indonesian Stock Exchange Agency (Bapepam)[address]                                     [address]Att: ...    Att: ...ChiefDirector in Chief[Head]    [Managing Director]Merrill LynchTrimegah SecuritiesStock Exchange BuildingIndonesia Ltd., TbkJakarta Tower I                            [address] 18thFloor Jenderal Sudirman St. Kav. 52-53 Jakarta 12190Macquarie SecuritiesStock Exchange Building Jakarta Tower I 8thFloor Jenderal Sudirman St. Kav. 52-53 Jakarta 12190Macquarie ConsultantsStock Exchange Building Jakarta Tower I 8thFloor Jenderal Sudirman St. Kav. 52-53 Jakarta 12190SUBJECT:Request to restrain Bayan Resources Ltd. from going public (Initial Public Offering IPO) due to the ongoing dispute over ownership of Bayan Resources Ltd. with our ClientDear Sirs,We are acting on behalf ofSUKAMTO SIAon the basis of aSpecial Power of Attorney dated 9 (Nine) July 2008.Through this letter, we are requesting that The Capital Market Executive Agency, the Indonesian Stock Exchange, Merrill Lynch Indonesia, Trimegah Securities Indonesia Ltd., Macquarie Securities, Macquarie ConsultantsSUSPEND THE PROCESS OF GOING PUBLIC (INITIAL PUBLIC OFFERING) OF BAYAN RESOURCES LTD. BECAUSE AT THE PRESENT TIME BAYAN RESOURCES LTD. AND ITS ENTIRE COMPANY GROUP AS WELL AS MR DATO’ LOW TUCK KWONG (THE OWNER OF BAYAN RESOURCES LTD.) ARE INVOLVED IN A LEGAL DISPUTE WITH OUR CLIENTon the following grounds:1. Whereas, for your information,OUR CLIENT IS THE PARTY THAT FUNDED AND FACILITATEDMr. Dato’ Low Tuck Kwong in establishing the coal mining company, including getting the concession rights to the coal, now called Bayan Resources Ltd..2. From the start, Mr. Dato’ Low Tuck Kwong tried to convince our client that if our client invests and facilitates in the establishment of the coal mine, Mr. Dato’ Low Tuck Kwong guarantees that the investment would be worth a minimum of USD 500,000,000.00 (five hundred million United States dollars) within 7 to 8 years, especially when the coal mining company is listed on the Indonesia Stock Exchange.3. Whereas, on the basis of that proposal, our client was persuaded by Mr. Dato’ Low Tuck Kwong tofund and facilitate the investment in[invest and provide facilities for] the coal mining company and Mr. Dato’ Low Tuck Kwong did receive the money from our client to fund and to get the concession rights to the coal mine. Mr. Dato’ Low Tuck Kwong promised that our client would get 50% (fifty percent) of all the shares in the coal mine.4. Finally, in light of their friendship and seeing Mr. Dato’ Low Tuck Kwong’s grave financial condition at that time, our clientfunded and provided facilities[invested and provided funds] for Mr. Dato’ Low Tuck Kwong to fund the development of the coal mining company, including to get the concession rights to the coal, which was then established under the name Bayan Resources Ltd. and its company group.However, it turned out that Mr. Dato’ Low Tuck KwongNEVER GAVEthe rights to 50% (fifty percent) of the shares in Bayan Resources Ltd. and its entire company group to our client, the investor and Mr. Dato’ Low Tuck KwongNEVER INFORMED NOR ASKED PERMISSIONfrom our client pertaining to a plan for Bayan Resources Ltd. to go public.Whereas our client has issued a warning to Mr. Dato’ Low Tuck Kwong through a Legal Notice No. 0175/0425.01/MA dated 10 July 2008, but as of now there has been no response from Bayan Resources Ltd. and Mr. Dato’ Low Tuck Kwong, and we have only received a letter from Bayan Resource’s Legal Counsel, whichDID NOT REPLYin any material way to our Legal Notice.On the basis of the above-mentioned facts, we wish to inform you thatIN THE NEAR FUTURE OUR CLIENT WILL SEEK ALL UNYIELDING LEGAL ACTIONS, IN CIVIL OR CRIMINAL LITIGATION VENUES AGAINST BAYAN RESOURCES LTD. AND ITS ENTIRE COMPANY GROUP, INCLUDING AGAINST MR DATO’ LOW TUCK KWONG PERSONALLY.AndTherefore we are requesting that the Capital Market Executive Agency, Indonesia Stock Exchange, Merrill Lynch Indonesia, Trimegah Securities Indonesia, Ltd., Macquarie Securities and Macquarie ConsultantsPROHIBIT BAYAN RESOURCES LTD. AND THE ENTIRE COMPANY GROUP FROM GOING PUBLIC (INITIAL PUBLIC OFFERING) SO AS NOT TO CAUSE ANY LOSSES TO A THIRD PARTY AND TO AVOID ANY LAWSUITS BY OUR CLIENT.Thank you for your kind attention to this matter....Attachment:-    Legal Notice dated July 10, 2008 No.0175/0435.01/MA-    Legal Notice dated July 15, 2008 No.0177/0425.01/MA-    Legal Notice dated July 14, 2008 No.SRS/20-34/111/VII/2008[emphasis in bold in original; emphasis in underline and italics added]7       On 24 July 2008, Bayan Resources informed BAPEPAM and IDX that the plaintiff would withdraw his shares from the IPO vendor shares sale, and that the other vendor shareholders of Bayan Resources would sell more shares to make up the shortfall resulting from his withdrawal. On 4 August 2008, BAPEPAM issued the Effective Statement which allowed the IPO to proceed. The IPO was launched on 12 August 2008, four days later than originally planned.8       On 3 October 2008, the plaintiff commenced this action against the defendant for defamation and malicious falsehood. The defendant counterclaimed in breach of contract, proprietary estoppel, constructive trust, breach of fiduciary duty and money had and received.9       As this action has been bifurcated, my decision deals solely with liability on the claims and counterclaims.Plaintiff’s case10     The plaintiff’s case is that the 1stLetter, the 2ndLetter and the 3rdLetter (collectively, the “Letters”) are defamatory of the plaintiff and that they were published by the defendant to the following persons in Indonesia:(a)     in respect of the 1stLetter and the 2ndLetter, to Bayan Resources.(b)     in respect of the 3rdLetter, to the Head of BAPEPAM, the Managing Director of the IDX, PT Trimegah, PT Merrill Lynch Indonesia, PT Macquarie Securities Indonesia and PT Macquarie Konsultan Indonesia.(a)     (collectively, the “Indonesian Publications”)It is apposite to note here that an examination of the 3rdLetter reveals that it was addressed not to PT Merrill Lynch Indonesia but to Merrill Lynch at a Jakarta address. Additionally, it was addressed not to PT Macquarie Securities Indonesia and PT Macquarie Konsultan Indonesia but to Macquarie Securities and Macquarie Consultants both at an identical Jakarta address.11     The plaintiff avers that the defendant’s publication of the Letters led to the following republications:(a)     In Indonesia:(i)       the 1st Letter and the 2ndLetter to BAPEPAM;(ii)       the 3rd Letter to Bayan Resources; and(iii)       the Letters or their summarised content in two Indonesian newspapers and Bayan Resources’ Indonesian Final Prospectus.(a)     (collectively, the “Indonesian Republications”)(b)     In Singapore:(i)       the Letters to Merrill Lynch Singapore; and(ii)       the Letters or their summarised content in Bayan Resources’ Pricing Supplement to the Preliminary Offering Memorandum and Bayan Resources’ International Final Offering Memorandum.(b)     (collectively, the “Singapore Republications”)12     The plaintiff further avers that as a result of the Indonesian Publications, Indonesian Republications and Singapore Republications:(a)     the plaintiff’s reputation was damaged and he suffered hurt, distress and embarrassment;(b)     the plaintiff was not able to sell 375,000,000 vendors shares in the IPO at the price of Indonesian Rupiah (“Rp”) 5,800 per share for a total sum of Rp 2.175 trillion; and(c)     the plaintiff lost the opportunity to use and invest Rp 2.175 trillion.13     The plaintiff is thus bringing this action against the defendant in defamation for the Indonesian Publications, Indonesian Republications and Singapore Republications. The plaintiff is also bringing this action against the defendant in malicious falsehood on the basis that the Letters are a malicious falsehood.Defendant’s case14     The essence of the defendant’s case is that he had a common understanding with the plaintiff, to whom he had given S$3 million to “invest and facilitate” the plaintiff’s establishment of an Indonesian coal mining business, on the basis that if the business was established, the defendant would have a 50% share in the business and if not, the plaintiff would return the S$3 million (the “Common Understanding”). On the basis of the Common Understanding, the defendant denies that he defamed the plaintiff and that the Letters are a malicious falsehood, and he counterclaims in breach of contract, proprietary estoppel, constructive trust, breach of fiduciary duty and money had and received.Defamation15     I turn first to the plaintiff’s claim in defamation. The place of commission of the tort of defamation is the place in which the defamatory statement is published (seeDicey, Morris and Collins on The Conflict of Laws(Sweet & Maxwell, 14th Ed, 2006) at 35-141). Thus, the Indonesian Publications and Indonesian Republications would be alleged torts committed in Indonesia whilst the Singapore Republications would be alleged torts committed in Singapore.16     For the Singapore Republications, the plaintiff need only show that they are actionable under Singapore law. For the Indonesian Publications and Indonesian Republications, however, the double actionability rule requires the plaintiff to show that they are actionable under both Singapore law and Indonesian law (seeBoys v Chaplin[1971] 1 AC 356 andJIO Minerals FZC and others v Mineral Enterprises Ltd[2011] 1 SLR 391 at [88]).17     If the plaintiff proves that the publications and republications are so actionable, the defendant must, in order to avoid liability, prove that he has a defence. For the Singapore Republications, the defendant must prove that he has a defence under Singapore law. However, for the Indonesian Publications and Indonesian Republications, it is sufficient for the defendant to prove that he has a defence under either Singapore law or Indonesian law (SeeCheshire and North’s Private International Law(11th ed, Butterworths 1987) at [532] cited with approval inLow Tuck Kwong v Sukamto Sia[2009] SGHC 147 at [14]).Whether the Indonesian Publications are actionable under Singapore and Indonesian lawSingapore law18     Under Singapore law, a statement is defamatory in nature if it tends to:(a)     lower the plaintiff in the estimation of right-thinking members of society generally;(b)     cause the plaintiff to be shunned or avoided; or(c)     expose the plaintiff to hatred, contempt or ridicule. (see Gary Chan Kok Yew & Lee Pey Woan,The Law of Torts in Singapore(Academy Publishing, 2011) (“The Law of Torts in Singapore”) at 12.014).19     The principles applicable to the construction of words based on their natural and ordinary meanings were summarised by the Court of Appeal inChan Cheng Wah Bernard and others v Koh Sin Chong Freddie and another appeal[2012] 1 SLR 506 (“Chan Cheng Wah Bernard”) at [18]:(a)    the natural and ordinary meaning of a word is that which is conveyed to an ordinary reasonable person;(b)    as the test is objective, the meaning which the defendant intended to convey is irrelevant;(c)    the ordinary reasonable reader is not avid for scandal but can read between the lines and draw inferences;(d)    where there are a number of possible interpretations, some of which may be non-defamatory, such a reader will not seize on only the defamatory one;(e)    the ordinary reasonable reader is treated as having read the publication as a whole in determining its meaning, thus “the bane and the antidote must be taken together”; and(f)    the ordinary reasonable reader will take note of the circumstances and manner of the publication.20     In this case, all three Indonesian Publications carried substantially the same content and meaning. I find their natural and ordinary meaning to be that (i) the plaintiff had persuaded the defendant to “invest and facilitate” the establishment of a coal mining business in Indonesia in return for 50% of the shares in the resulting coal mining company if it was established; (ii) the defendant did fund and facilitate the establishment of the coal mining company, which included the acquisition of coal mining concession rights, and the company was then established under the name of Bayan Resources; and (iii) the plaintiff never gave the defendant 50% of the shares in Bayan Resources and there was a legal dispute between them relating to these shares.21     In the 1stLetter and the 2ndLetter, the defendant demanded that the plaintiff surrender and return at least 50% of the total shares in Bayan Resources and its group, failing which he would proceed with civil and criminal suits against the plaintiff and Bayan Resources. The 3rdLetter, addressed to BAPEPAM, IDX and the IPO Advisors, asked that the IPO be suspended because of this legal dispute between the defendant and the plaintiff “so as not to cause any losses to a third party and to avoid any lawsuits by [the defendant].”22     The plaintiff submits that the Indonesian Publications are defamatory in nature as their natural and ordinary meaning is that the plaintiff, having induced the defendant to invest in a coal mining business, now known as Bayan Resources, in return for 50% of the shares of that business, has  on his part reneged on the bargain. The plaintiff further submits that the Indonesian Publications mean that the plaintiff was “seeking to mislead the public in relation to his shareholding in Bayan Resources” and that he has “therefore acted dishonourably and has committed a crime.”23     I find that to an ordinary reasonable person using his general knowledge and common sense, and in the context of an imminent IPO involving the shares of Bayan Resources which was reported to be the President Commissioner and controlling shareholder, the meaning of the Indonesian Publications would be that the defendant and the plaintiff had some private arrangement or understanding to account for and deliver 50% of Bayan Resources shares, which the plaintiff had not performed. This meaning is defamatory in nature and in the context of such an IPO, in that it would tend to lower the plaintiff in the estimation of right-thinking members of society generally or impute a lack of integrity. Thus, the Indonesian Publications are to this extent actionable under Singapore law.24     I am unable to accept the plaintiff’s extended meaning to the Indonesian Publications that the plaintiff was seeking to mislead the public in relation to his shareholding. First there is no language in the Letters suggesting this. Second, the 1stLetter and 2ndLetter are notices/”warnings” of the defendant’s claim as a prelude to his initiating civil and criminal proceedings. The 3rdLetter clearly expresses that the defendant’s claim was a “legal dispute” that he had with the plaintiff.Indonesian law25     The plaintiff’s Indonesian law expert, Dr Frans Hendra Winarta (“Dr Winarta”), is of the opinion that under Indonesian law, a person who has been defamed/”affronted” can bring a claim in the following ways:(a)     Claim for “defamation” or “libel” under article 1372 of the Indonesian Civil Code (“ICC”) read with article 310 of the Indonesian Penal Code (“IPC”) and article 1365 of the ICC; or(b)     Claim for an “unlawful act” under article 1365 of the ICC.26     The defendant’s Indonesian law expert, Dr Otto Hasibuan (“Dr Hasibuan”), is of the opinion that a claim for defamation/”affront” under Indonesian law can only be brought under article 1372 of the ICC read with article 310 of the IPC. It cannot be brought under article 1365 of the ICC, whether alone or read with article 1372 of the ICC.27     The parties and experts agreed on the following English language translations of the relevant provisions of the ICC and the IPC:(a)     Article 1365 of the ICC:Every unlawful act that brings damage to other person, obliges the person by whose fault causing such loss, to compensate such loss.(b)     Article 1372 of the ICC:The civil claim of affront (penghinaan) is aimed to get compensation of damage as well as / along with the recovery of honour and good name.In assessing / evaluating one and the other, the judge must consider the gravity of the affront (penghinaan), the rank, the position and the capacity of both parties and the circumstances.(c)     Article 310 of the IPC:(1)    Whosoever intentionally / wilfully harms someone’s honour or good name, by accusing him of certain act, with the obvious intention of spreading the allegation, is punishable, as guilty of defamation [“menista” / “smaad”], with imprisonment for a maximum of nine months or fine of maximum four thousand five hundred Rupiahs.(2)    If this is committed in written or pictorial form, spread, exhibited or posted in public, the doer is punishable, as guilty of libel [“menistadengantulisan” / “smaadschrift”], with imprisonment for a maximum of one year and four months or fine of maximum four thousand five hundred Rupiahs.28     Dr Winarta and Dr Hasibuan agree that the definition of the term “affront” in article 1372 of the ICC is found in article 310(1) of the IPC. The elements of “affront” are as follows:(a)     there must be an intentional or wilful attack on someone’s honour or good name;(b)     an accusation must be made of certain matters; and(c)     there must exist a purpose to make the defamatory attacks known to the public.29     Even if I accept the defendant’s argument that he made the Indonesian Publications with the predominant intention of protecting his interests and/or the public interest, I accept Dr Winarta’s opinion that element (a) does not speak of the predominant or sole intent of the defamatory attack, it only requires that the defendant intended that there be such an attack,ie, he did not make the attack negligently or innocently. In this case, I find that the Indonesian Publications were intentional attacks on the plaintiff’s “honour or good name”. As for the remaining elements, I find that the Indonesian Publications contained accusations against the plaintiff and that there was an intention to make the Indonesian Publications known to the public, where “public” means one or more third parties other than the plaintiff (see J. Satrio,Civil Lawsuit on the Basis of Affront as an Unlawful Act(plaintiff’s translation of the title) (“Satrio’s Opinion”) at 31-32). Thus, I find on a balance of probabilities that the Indonesian Publications are actionable under Indonesian law, and specifically under article 1372 of the ICC read with article 310 of the IPC.30     I turn next to consider Dr Winarta’s opinion that the plaintiff may alternatively elect to bring a claim under article 1365 of the ICC. Dr Hasibuan disagrees on the ground that “article 1365 is general (lexgeneralis), while article 1372 is specific (lexspecialis)”, and it is not permissible to frame a claim under a general provision when there is a clear specific provision for that purpose. To support his position, Dr Hasibuan refers to the Indonesian Supreme Court decision ofTime Inc Asia et al v H.M. Soeharto(No 273 PK/PDT/2008) (“Time Inc Asia”) where the court stated the following (at 87):That with the argument of the Plaintiff’s lawsuit [which was based on the Defendant’s picture and writing which contained insult and defamation], the Judge is not allowed to use the criteria of Article 1365 of the Civil Code but the one which should be used is Article 1372 of the Civil Code which is a special provision, because the two consequences of the provisions are very different.31     Given that this action is brought in Singapore on alleged torts committed in Indonesia, this common law precedent based court has to make findings of fact as to the law of Indonesia, a non-precedent based civil law jurisdiction, with the assistance of the Indonesian law experts. I would accordingly adopt a cautious approach and place much weight on the decision inTime Inc Asia, which is the only decision produced before this court which addresses the question of whether a defamation/”affront” claim may be brought under article 1365 of the ICC in light of article 1372 of the ICC which deals specifically  with defamation/”affront”. The Indonesian Supreme Court inTime Inc Asiaunequivocally ruled that in a defamation/”affront” action, the judge is not allowed to use the criteria of article 1365 of the ICC but only the special provision of article 1372 of the ICC. The plaintiff concedes thatTime Inc Asiadecided that a claim for defamation/”affront” should be brought under article 1372 of the ICC and not under or by reference to article 1365 of the ICC. I note Dr Winarta’s citation ofLauwJuandaLesmana v HasimSutionoSuryopratomo(No 1331K/PDT/2004) where the Indonesian Supreme Court upheld a lower court decision on an “affront” claim under article 1365 of the ICC read with article 1372 of the ICC andDendenSudarman v Yusuf Suparma(No 396K/PET/2001) where the Indonesian Supreme Court upheld a lower court decision on a defamation claim under article 1365 of the ICC. However, in neither of these cases was the question posed and addressed head on as it was in theTime Inc Asiacase. In light of this, I make a finding of fact that a claim in defamation/”affront” under current Indonesian law can only be brought under article 1372 of the ICC.32     This is not to say that Dr Winarta’s opinion that a person who has been “affronted” may alternatively bring an action under article 1365 of the ICC may not in the future find favour with the Indonesian courts, as the Indonesian courts are not bound by the doctrine of precedent. However in the absence of Indonesian Supreme Court or superior court decisions produced before me in which this question was raised and addressed head on in support of his opinion, I am unable to make a finding of fact that this is the current position under Indonesian law.Whether the Indonesian Republications are actionable under Singapore and Indonesian law33     On 18 July 2008, the plaintiff sent a letter to BAPEPAM enclosing the 1stLetter, and Bayan Resources sent a letter to BAPEPAM enclosing the 1stLetter and the 2ndLetter. Both republications had a cover letter in which Bayan Resources and the plaintiff denied the defendant’s allegations. Bayan Resources’ letter to BAPEPAM stated the following:5.    It is known that [Bayan Resources] was established in 2004 and hereby [Bayan Resources] clearly states of absence of legal relationship, in written and verbal manner, with [the defendant].6.    [Bayan Resources] hereby also clearly states that none of the companies under Bayan Resources group has any connection, in written and legal manner, with [the defendant].7.    The information / data provided by [Bayan Resources] based upon the Registration Statement for Initial Public Offering of [Bayan Resources]... is accurate and complete. Hence, [Bayan Resources] shall be fully and legally accountable for accuracy of the respective information / data as stated in the prevailing laws and regulation including but not limited to capital market regulations.In the plaintiff’s letter to BAPEPAM, the plaintiff stated:That I ... hereby deny the accuracy of the claim stated in the [1stLetter] and I would take legal responsibility for my statement in accordance with the prevailing laws and regulations including but not limited to capital market regulations.34     On 21 July 2008, Merrill Lynch Singapore sent an email to Bayan Resources attaching the 3rdLetter.35     The following passage was published: (i) on 5 August 2008 in theSuaraPembaruannewspaper at page 23; (ii) on 6 August 2008 in theBisnis Indonesianewspaper at page F3; and (iii) in Bayan Resources’ Indonesian Final Prospectus dated 6 August 2008 at page xx (English translation provided by the plaintiff):Legal process faced by company and subsidiary- Legal summons from Sukamto SiaOn 10thJuly 2008, Bayan Group together with the controlling shareholder, Dato’ Low Tuck Kwong, received a two-paged summons from the law offices of Hotman Paris & Partners stating that Mr Sukamto Sia has the right to 50% of all of the Company’s and subsidiaries’ shares, comprising Bayan Group. Through his lawyers, Mr Sia stated that the controlling shareholder of Bayan Group has agreed to give the shares to him in return for financial help of an unspecified amount and this was allegedly given by Mr Sia to the controlling shareholder in 1996.Bayan Group does not have any relations with Mr Sia and the controlling shareholder of Bayan Group has notified Bayan Group that Dato Low Tuck Kwong does not have any relations with Mr Sia besides the situation in which the Bayan Group is not involved.36     The Indonesian Final Prospectus additionally stated the following (at page 102) (English translation provided by the plaintiff):Latest DevelopmentOn 10thJuly 2008, Bayan Group together with the controlling shareholder, Dato’ Low Tuck Kwong, received a two-paged summons from the law offices of Hotman Paris & Partners stating that Mr Sukamto Sia has the right of 50% of all of the Company’ and subsidiary’s shares, comprising the Bayan Group. Through his lawyers, Mr Sia stated that the controlling shareholder of Bayan Group has agreed to give the shares to him in return for financial help of an unspecified amount and was allegedly given by Mr Sia to the controlling shareholder of Bayan Group in 1996.Bayan Group believes, and the controlling shareholder of Bayan Group has notified Bayan Group that he believes, that Sukamto Sia’s claim is baseless and careless, Bayan Group does not have any relations with Sukamto Sia and the controlling shareholder of Bayan Group has notified Bayan Group that he does not have any relations with Sukamto Sia besides the situation in which the Bayan Group is not involved, as described below.The controlling shareholder of Bayan Group has notified Bayan Group that he is the plaintiff in a trial process in Hong Kong which involved a company where Sukamto Sia owns 80% of the shares and where Mr Sia is also a Director. In the decision of the trial of 2001 the controlling shareholder of Bayan Group was awarded HK$ 108.4 million (US$ 13.9 million based on afternoon exchange rate on 22 July 2008 amounting US$ 1 = HK$ 7,7967) plus interest counted from 22 July 2000.The said company is under the process of liquidation because it was unable to satisfy the 2001 judgment. In addition, the said company’s provisional liquidator had commenced legal proceedings on Mr Sia in Hong Kong. In June 2008, the provisional liquidator obtained an interim court order on Mr Sia which is effective worldwide, to freeze his assets (and those of a co-defendant) amounting to HK$ 277.0 million (US$35.5 based on afternoon exchange rate on 22 July 2008 amounting US$1 = HK$ 7,7967) pending the resolution of the proceedings against him and the co-defendant.Bayan Group believes, and the controlling shareholder of Bayan Group has notified Bayan Group that he believes, that there is no basis for (Mr Sia’s) the claim on Bayan Group and him as stated in the summons. However, the investors should note that the resolution of legal claims involves uncertainties and judicial decisions cannot be predicted.Singapore law37     I begin by determining whether the Indonesian Republications are defamatory in nature. The defendant’s argument that the summaries of the Indonesian Publications in the Indonesian Republications bear a lesser (if any) defamatory meaning than the Indonesian Publications themselves because the summaries merely convey thefactthat the defendant has made a claim must fail because of what was termed the “repetition rule” inStern v Piper[1997] QB 123 (at 135):The repetition rule ... is a rule of law specifically designed to prevent a jury from deciding that a particular class of publication - a publication which conveys rumour, hearsay, allegation, repetition, call it what one will - is true or alternativelybears a lesser defamatory meaning than would attach to the original allegation itself.[emphasis added]38     In determining the natural and ordinary meaning of the Indonesian Republications, regard must be had to the republications as a whole (SeeChan Cheng Wah Bernardat [18(e)] (at [18] above). Unlike the Indonesian Publications, most of the Indonesian Republications contained the plaintiff’s denial of and response to the defendant’s claim which may be regarded as “the antidote” to “the bane” (seeLim Eng Hock Peter v Lin Jian Wei and another[2009] 2 SLR(R) 1004 at [92]). In this regard, I refer to the three levels of meaning set out inChase v News Group Newspapers Ltd[2003] EMLR 218 (“Chase”), where the Court held that:The sting of a libel may be capable of meaning that a claimant has in fact committed some serious act, such as murder. Alternatively, it may be suggested that the words mean that there are reasonable grounds to suspect that he/she has committed such an act. A third possibility is that they may mean that there are grounds for investigating whether he/she has been responsible for such an act.I find that the Indonesian Republications, save for the republication of the 3rdLetter by Merrill Lynch Singapore to Bayan Resources, carry only the third defamatory meaning referred to in the passage fromChasecited above,viz, there are grounds for investigating if the plaintiff had an agreement or understanding with the defendant which he had not performed, as alleged by the defendant and denied by the plaintiff. This finding will impact the quantum of damages payable by the defendant should liability be established. The republication of the 3rdLetter by Merrill Lynch Singapore to Bayan Resources, which contained the full text of the 3rdLetter and nothing more, carries the same defamatory meaning as the 3rdLetter.39     In my view, the defendant is responsible for the Indonesian Republications as they are the natural and probable result of the Indonesian Publications (seeGohChok Tong v Jeyaretnam Joshua Benjamin[1997] 3 SLR(R) 46 at [127]). The Indonesian Republications necessarily arose by reason of the disclosure requirements for public offerings of securities under articles 70, 78, 80 and 81 of the Law of the Republic of Indonesia Number 8 Year 1995 Concerning the Capital Market (“Indonesian Capital Market Law”) and other capital market requirements under Indonesian law. These extend to making such disclosures in the news media. This is supported by the opinions of Dr Winarta and the defendant’s Indonesian capital market law expert, Professor Dr Nindyo Pramono (“Professor Pramono”). Thus, the Indonesian Republications are actionable under Singapore law.Indonesian law40     Dr Winarta opined that according to theadequate veroorzakingtheory of causation under Indonesian law, a defendant who makes a defamatory statement which is republished is liable for the damage caused by the republications if such republications “reasonably can be expected to arise” from his original defamatory statement. Dr Hasibuan agreed that theadequate veroorzakingtheory is one of three theories of causation that could be used in Indonesia.41     Both Dr Winarta and Professor Pramono gave evidence that the Indonesian Republications can reasonably be expected to arise from the defendant’s Indonesian Publications owing to the disclosure requirements under Indonesia’s capital market laws (see [39] above). As such, I find on a balance of probabilities that the Indonesian Republications would be actionable under Indonesian law.Whether the Singapore Republications are actionable under Singapore law42     The plaintiff pleaded that the Letters were republished to Merrill Lynch Singapore in Singapore. There is evidence that the plaintiff personally handed the 1stLetter to Merrill Lynch Singapore in Singapore. However, as the plaintiff concedes that he does not have evidence that the 2ndLetter was received by the IPO team, including Merrill Lynch Singapore,in Singapore, and I find that there is also no evidence that the 3rdLetter was republished to Merrill Lynch Singaporein Singapore, the republication of the 2ndLetter and the 3rdLetter to Merrill Lynch Singapore will not be considered for the purposes of liability in this Suit.43     The following passage was published in the following documents: (i) at page 3 of Bayan Resources’ Pricing Supplement to the International Preliminary Offering Memorandum dated 24 July 2008 (the “Pricing Supplement”), hard copies and soft copies of which were sent to potential investors in Singapore; and (ii) at page 5 of Bayan Resources’ International Final Offering Memorandum dated 24 July 2008 (the “International Final Offering Memorandum”), which was distributed to potential investors in Singapore:Recent DevelopmentsOn July 10, 2008, we and our controlling shareholder, Dato’ Low Tuck Kwong, received a two-page notice from the law firm of Hotman Paris & Partners alleging that Mr Sukamto Sia is entitled to 50% of the shares in the Company and its subsidiaries comprising the Bayan Group. Through his attorney, Mr. Sia has alleged that our controlling shareholder agreed to provide these shares to him in return for an unspecified amount of financing allegedly provided by Mr. Sia to our controlling shareholder in 1996. Through his attorney, he has also threatened to initiate legal proceedings.On July 21, 2008, Hotman Paris & Partners, on behalf of their client Mr. Sia, sent a letter to various parties including the regulatory authorities in Indonesia, including BAPEPAM-LK, which repeated the allegations and requested cancellation of the Combined Offering.We believe, and our controlling shareholder has advised us that he believes, Mr. Sia’s claim is totally without merit and is frivolous. The Bayan Group has had no dealings whatsoever with Mr. Sia, and our controlling shareholder has advised us of the following matter in which the Bayan Group is not involved, as described below.Our controlling shareholder has advised us that he is a plaintiff to a litigation in Hong Kong involving a company in which Mr. Sia owned an 80% interest and of which Mr. Sia was a director. In the litigation, our controlling shareholder obtained a judgment in 2001 against the company for approximately HK$108.4 million (US$13.9 million based on the noon buying rate as of July 22, 2008) plus interest from July 22, 2000.The company is in the process of being liquidated because it was unable to satisfy the 2001 judgment. In addition, the provisional liquidator of the company has instituted proceedings against Mr. Sia in Hong Kong. In June 2008, the provisional liquidator of the company obtains an interim court order against Mr. Sia, which purports to be effective worldwide, to freeze his assets (and those of his co-defendant) up to a value of HK $277.0 million (US$35.5 million based on the noon buying rate as of July 22, 2008), pending the resolution of the proceedings against him and his co-defendant.We believe, and our controlling shareholder has advised us that he believes, that there is no basis whatsoever for the claim against us and him set out in the notice. Notwithstanding the foregoing, we and our controlling shareholder expect that litigation proceedings may be commenced against us and our controlling shareholder. We intend to vigorously defend Mr. Sia’s claims against us and our controlling shareholder has advised that he intends to vigorously defend Mr. Sia’s claims against him. However, investors should note that the resolution of legal claims in Indonesia involves uncertainties and judicial decisions in Indonesia may be unpredictable.44     Applying the principles of Singapore law set out above (at [37]-[39]), I find that the Singapore Republications are actionable under Singapore law. The republication of the 1stLetter by the plaintiff to Merrill Lynch Singapore, which contained the full text of the 1stLetter and nothing more, carries the same defamatory meaning as the 1stLetter. I find that the remaining Singapore Republications carry the third defamatory meaning referred to in the passage fromChasecited above at [38],ie, they tell an ordinary reasonable reader that there are grounds for investigating if the defendant’s claims are true. The defendant is responsible for the Singapore Republications, which were a natural and probable consequence of the Indonesian Publications because the IPO was a global offering.Whether there is a defence under Singapore law for the Indonesian Publications, Indonesian Republications and Singapore Republications45     The defendant relies on the following defences under Singapore law: justification, absolute privilege and qualified privilege. I will examine each in turn.Justification46     InArul Chandran v Chew Chin Aik Victor[2001] 1 SLR(R) 86 (“Arul Chandran”), the Court of Appeal explained (at [28]) that the defence of justification requires the defendant to prove the truth of the defamatory statements:[t]he law of defamation presumes that defamatory words are false and the plaintiff need do no more than prove that the defamatory words have been published by the defendant. The burden is then on the defendant, if he wishes to rely on the defence of justification, to prove that those words are true.47     The rationale for the defence of justification is set out inThe Law of Torts in Singaporeat [13.004] as follows:The rationale for the defence of justification is based on the presumption that by telling the truth about the plaintiff, his reputation “is not lowered beyond its proper level, but is merely brought down to it”. Further “the law does not protect the reputation that a man has, but only the reputation that he deserves”.48     I have found the natural and ordinary meaning of the Indonesian Publications to be that set out above at [20]. The defendant’s defence is that the content of the Indonesian Publications is true because of the Common Understanding between him and the plaintiff.49     As such, I now set out the evidence in this court on the Common Understanding. The defendant’s evidence is that in late 1995, the plaintiff, who was then in financial difficulty, asked the defendant for S$3 million to “invest and facilitate” the plaintiff’s establishment of an Indonesian coal mining business. The plaintiff promised the defendant in return, a 50% share in the coal mining business if it was established, and if it was not, that he would repay the S$3 million. The defendant then gave S$3 million cash to the plaintiff, who issued him a cheque dated 25 April 1996 for S$3 million (the “Cheque”) as an assurance that the defendant would get his money back if the coal mining business was not established. It was also the defendant’s evidence that he had, over the years of his close friendship with the plaintiff, made other large cash and undocumented loans to the plaintiff, although this S$3 million was the biggest amount “in one shot”.50     The plaintiff denies that he had received S$3 million from the defendant and denies that there was any Common Understanding. To refute the defendant’s claim that he needed S$3 million in 1995, the plaintiff produced some evidence of his assets at that time. The defendant points out that this evidence was not supported by any valuation nor was there any evidence produced of the plaintiff’s liabilities at that time. The plaintiff confirmed under cross-examination that in early 1996, he had “some problems with [his] cash flows” and was considering selling part of his art collection. The plaintiff also admitted that his two active Singapore bank accounts were overdrawn for every month between mid-1995 to mid-1996. The plaintiff’s explanation for the Cheque is that he issued it on 25 April 1996 (and not in late 1995) at the request of the defendant, who wanted to use it to raise funds from others in order to procure payment by the defendant’s company (“Dynasty”) which had not paid the plaintiff and six others vendors for shares for listed shares purchased by and delivered to Dynasty. This debt led to the Hong Kong court proceedings by the plaintiff and other vendors against Dynasty which led to the appointment of provisional liquidators of Dynasty. The provisional liquidators obtained a Hong Kong worldwide Mareva injunction against the defendant which was later discharged. The plaintiff gave evidence that he had told the defendant not to cash the Cheque as there were insufficient funds in his account. The defendant challenges the plaintiff’s explanation in light of the plaintiff’s evidence that Dynasty then owed the vendors about S$41 million, a much larger sum than S$3 million.51     The defendant draws support for the Common Understanding from the chronology of events in late 1995 (which he says were unknown to him until after he received Bayan Resources’ draft prospectus in July 2008). This chronology reveals that the plaintiff incorporated a Singapore company, International Coal Pte Ltd (“ICP”) on 4 October 1995. Under cross-examination, the plaintiff stated that the Indonesian government had granted a coal mining concession to an Indonesian company called PT Gunung Bayan Pratama Coal (“GBPC”), and that GBPC had sold 65% of its concession rights to a Hong Kong company, Kristle Trading Limited (“Kristle”). On 1 November 1995, Kristle sold these concession rights to ICP. The plaintiff gave evidence that he later discovered that the transfer of concession rights was not recognised under Indonesian law. As such, in November 1997, the plaintiff having become an Indonesian citizen together with his partners acquired GBPC itself and thereafter used GBPC to produce coal. On 7 October 2004, Bayan Resources was incorporated in Indonesia and it subsequently acquired a controlling interest in GBPC. When Bayan Resources was listed on the IDX on 12 August 2008, GBPC was one of many of its subsidiaries. The plaintiff argues that information about the history of his involvement in the coal mining business is publicly available and that the defendant has hitched this publicly available chronology of events to corroborate his alleged Common Understanding.52     The evidence in court of the Common Understanding turns entirely on the plaintiff’s and the defendant’s respective word, there being, apart from the Cheque, no other witnesses or documentary evidence. This is a case of one party’s evidence and recollection of events in 1995 pitted against the other party’s contrary evidence and recollection of the same events relating to whether there was and if so what was the Common Understanding. Throughout the trial, each party repeatedly and extensively challenged the other’s veracity and credibility. This was further done by referring this court to sworn statements which they had each filed in earlier Hong Kong and Singapore court proceedings between them or involving them. These earlier sworn statements reveal that each of them had given evidence or explanations before these courts which are diametrically contradictory to the evidence, explanations and accounts which they each now give in this court. The only objective documentary evidence produced in this court was the Cheque. Apart from the fact that it is for $3 million, when it was issued and why remains obscure in the light of the time lapse and that the parties had many personal and financial transactions between them before they fell out.53     In the light of the above, I am unable to find, on the evidence adduced in this court, one way or another that there was or there was no Common Understanding or the terms of such Common Understanding. As such, I find that the defendant has not discharged his burden to prove the truth of the Indonesian Publications and therefore of the Indonesian Republications and Singapore Republications, and the defence of justification accordingly has not been made out.Absolute privilege54     I next turn to the defence of absolute privilege. The rationale for this defence is explained inThe Law of Torts in Singaporein the following manner (at [13.040]):Free speech is so significant in certain situations such that complete immunity is afforded to defamatory statements even where they may be untrue and made maliciously. These include statements which attract Parliamentary privilege, statements made during the course of or related to judicial proceedings as well as Executive matters....55     InLincoln v Daniels[1962] 1 QB 237, Devlin L.J. explained that absolute privilege which covers proceedings in or before a court of justice can be divided into the following three categories (at 257-258):The first category covers all matters that are done coram judice. This extends to everything that is said in the course of proceedings by judges, parties, counsel and witnesses, and includes the contents of documents put in as evidence. The second covers everything that is done from the inception of the proceedings onwards and extends to all pleadings and other documents brought into existence for the purpose of the proceedings and starting with the writ or other document which institutes the proceedings. The third category is the most difficult of the three to define. It is based on the authority ofWatsonv.M’Ewan, in which the House of Lords held that the privilege attached to evidence which a witness gave coram judice extended to the precognition or proof of that evidence taken by a solicitor. It is immaterial whether the proof is or is not taken in the course of proceedings.This means that absolute privilege covers everything that is done before a judge (for example, during a trial), everything that is done in the course of court proceedings from its commencement (when the writ or an equivalent document is issued) to its conclusion (when a decision is rendered or a determination made), and things done before the commencement of court proceedings which are considered to be “a step towards” the conduct of proceedings (Watson v M’Ewan[1905] AC 480 at 487).56     The defendant submits that the Indonesian Publications are protected by absolute privilege on the grounds that:(a)     the 3rdLetter, insofar as it was sent to BAPEPAM, falls within Devlin L.J.’s second category as it was “the first step in a regulatory process of a quasi-judicial nature”; and(b)     all the Letters fall within Devlin L.J.’s third category as they were necessary to the commencement of proposed legal proceedings by the defendant against the plaintiff to enforce the Common Understanding.57     In respect of the first ground, I accept that absolute privilege may in limited occasions be extended beyond court proceedings to proceedings before tribunals which act in a manner similar to courts of law (seeD v Kong Sim Guan[2003] 3 SLR(R) 146 at [99]). InTrapp v Mackie[1979] 1 WLR 377 at 379, Lord Diplock set out the following factors to determine if sufficient similarity exists for absolute privilege to apply (at 379):(a)     the authority under which the tribunal acts;(b)     the nature of the question into which it has a duty to inquire;(c)     the procedure adopted by it in carrying out the inquiry; and(d)     the legal consequences of the conclusion reached by the tribunal as a result of the inquiry.58     I note the case ofMahon v Rahn(No. 2) [2000] 1 WLR 2150 in which the English Court of Appeal extended absolute privilege to a bank’s response to queries from a securities regulator. I further noteBuckley v Dalziel[2007] 1 WLR 2933 in which the English Court extended absolute privilege to a complaint made to the police.59     Article 4 of the Indonesian Capital Market Law provides that BAPEPAM shall develop and regulate capital market activities so as to create an orderly and efficient capital market and to protect the interests of investors and the public. Article 5 of the same law provides that BAPEPAM may conduct or procure inspections into suspected violations of the Indonesian Capital Market Law and suspend or cancel listings or stock exchange transactions. Both Dr Winarta and Professor Pamono agree that BAPEPAM is not a court of law and is not in a position to determine who is right or wrong on the matter at hand. They also agree that BAPEPAM only has an “interest as to whether the registration statement submitted by the companies which are going public contain the material information or not.” It is unclear from the expert evidence that the 3rdLetter to BAPEPAM whether BAPEPAM would have precipitated BAPEPAM to conduct a formal inquiry following the dispute described in this Letter and what legal consequences would follow in this pre-IPO context.60     In any event, it is significant to note what occurred on this occasion. The 3rdLetter to BAPEPAM was not a complaint for BAPEPAM to conduct an investigation. It was expressly for the purpose of requesting BAPEPAM to suspend the planned IPO because of the legal dispute between the defendant and the plaintiff relating to the Bayan Resources shares. The result of the 3rdLetter, according to the plaintiff, was that the IPO Advisors met with BAPEPAM and were told that they “would have to clear any disputes on the shares before the IPO could proceed”. According to the plaintiff, the matter was resolved when upon the advice of the IPO Advisors the plaintiff decided and informed BAPEPAM that he would withdraw his planned vendor shares offer which would be replaced by vendor shares offered by theother shareholders to make up the shortfall. In these circumstances and without greater clarity on Indonesian capital market law and practice, I am unable to conclude that absolute privilege would extend to the 3rdLetter to BAPEPAM.61     In respect of the second ground that all the Letters were necessary, under Indonesian law, before court proceedings could be commenced, the Indonesian law experts have different opinions as to whether the defendant had a legal obligation under articles 1238 and 1243 of the ICC to send a warning letter to the plaintiff before he commenced legal proceedings against the plaintiff. In any event, as Dr Winarta pointed out, the defendant was not required by Indonesian law to send the 1stLetter and the 2ndLetter to Bayan Resources, who was not an alleged contractual counterparty to the defendant. The defendant has also not shown that he had a legal obligation to send the 3rdLetter to BAPEPAM, IDX and the IPO Advisors prior to commencing a court action against the plaintiff and Bayan Resources in Indonesia.  Thus, it has not been established before this court that the requisite Singapore law elements for absolute privilege have been made out.Qualified privilege62     In respect of the defence of qualified privilege, the defendant argues that the Indonesian Publications, Indonesian Republications and Singapore Republications were published on privileged occasions because the “duty-interest” test is satisfied.  This test was explained by Lord Atkinson inAdam v Ward[1917] A.C. 309 at 334:A privileged occasion is ... an occasion where the person who makes a communication has an interest, or a duty, legal, social or moral, to make it to the person to whom it is made, and the person to whom it is so made has a corresponding interest or duty to receive it. This reciprocity is essential.InMallan v A M Bickford & Sons, Limited[1915] SALR 47), the court held that (at 84):[I]t may be accepted as a well-established rule that some duty or interest must exist in the party to whom the communication is made as well as in the party making it. The duty or interest may be common to both parties, but this is not essential. It is enough if there is a duty or interest on one side, and a duty or interest, or interest or duty (whether common or corresponding or not) on the other.63     The rationale for the defence of qualified privilege was stated by Lord Diplock inHorrocks v Lowe[1975] AC 135 (“Horrocks”) (at 149) to be as follows:The public interest that the law should provide an effective means whereby a man can vindicate his reputation against calumny has nevertheless to be accommodated to the competing public interest in permitting men to communicate frankly and freely with one another about matters in respect of which the law recognises that they have a duty to perform or an interest to protect in doing so. What is published in good faith on matters of these kinds is published on a privileged occasion. It is not actionable even though it be defamatory and turns out to be untrue.64     I turn now to the question of whether the defendant had an interest to make the Indonesian Publications. The scope of the “interest” that is required to establish the defence of qualified privilege is explained inGatley on Libel and Slander(Sweet & Maxwell, 11th ed, 2008) (“Gatley”) as follows (at 14.12):The law does not restrict the interests which the defendant may protect by asserting freely what he believes to be true. In the majority of the cases, the interests protected have been business interests; thus, the defendant may write freely to claim money he believes to be due to him, ...InBlackham v Pugh(1846) 15 L.J.C.P. 290, which is cited byGatleyimmediately after the above passage, Tindal CJ recognised and applied (at 620) (see also Coltman J at 621, Cresswell J at 623-624 and Erle J at 625-626):… that principle by which a communication made, by a person immediately concerned in interest, in the subject-matter to which it relates, for the purpose of protecting his own interest, in the full belief that the communication is true, and without any malicious motive, is held to be excused from responsibility in an action for a libel.65     In the present case, while the defendant has not been able to prove that his claims in the Indonesian Publications are true, it remains to be determined whether he believed them to be true and without any malicious motive in order to be excused from responsibility for the defamation.66     In my view, the defendant’s actions in instructing his Singapore and Indonesian lawyers and acting on the latter’s advice to make the Indonesian Publications show that he believed that he had a claim against the plaintiff and that his claims in the Indonesian Publications were true. The defendant issued his Indonesian lawyers a power of attorney which authorised them to take a broad range of legal steps to pursue his claim. Further, it is in evidence that on 29 June 2008, the defendant’s friend and an investment banker at Merrill Lynch Singapore, Mr Christopher Clower, mentioned to the defendant that he was working on an IPO of an Indonesian coal mining company. The defendant later overheard Mr Clower mentioning a “Dato Low” in a private telephone call. This would be consistent with the defendant’s account of what precipitated his actions that followed. It is his evidence that he then made further independent enquiries and obtained a copy of Bayan Resources’ draft prospectus dated 2 July 2008. Following this, he instructed his Indonesian lawyers to make the Indonesian Publications. These actions and timelines corroborate that he believed that he had a claim against the plaintiff. The defendant’s conduct and demeanour under cross examination in this court further reflected his continued belief. That being my finding, the Indonesian Publications were made in order to protect what the defendant believed to be his business interests.67     With respect to the recipients of the Indonesian Publications which contained information about the defendant’s claim, I find that Bayan Resources had an interest in receiving the 1stLetter and the 2ndLetter. Bayan Resources had a duty to disclose all the material facts in the global IPO and listing documents. The defendant’s claim for 50% of Bayan Resources’ shares is material and disclosable in the context of the global IPO in two critical respects: first with respect to the identities of the controlling shareholders of Bayan Resources and second the fact of the claim itself. The IPO Advisors had an interest in receiving the 3rdLetter as they would share responsibility for the accuracy and completeness of the global IPO documents. I find Macquarie Securities and Macquarie Consultants (both occupying the same Jakarta address) to be part of “Macquarie” which is described only by its logo in Bayan Resources’ Preliminary Offering Memorandum dated 4 July 2008 as the co-lead manager and international selling agent in the global IPO. IDX had an interest to receive the 3rdLetter as it is the stock exchange on which Bayan Resources was to be listed and traded. Finally, BAPEPAM had an interest to receive the 3rdLetter as it is the principal capital market regulator which will decide whether to issue the Effective Statement for the IPO. For the above reasons, the defence of qualified privilege extends to the Indonesian Publications.68     The defence of qualified privilege will be defeated if the plaintiff can show that there was malice on the part of the defendant. In this case, the plaintiff argues that malice is made out because (i) the defendant had a “deep-seated hatred” for the plaintiff after the plaintiff commenced legal actions against him and Dynasty in Hong Kong, resulting in a worldwide Mareva injunction being ordered against him; (ii) the defendant wanted to exact revenge by stopping the IPO or preventing the plaintiff from selling his shares in the IPO, outcomes which could not have been of any legitimate consequence to him; and (iii) the defendant made the Indonesian Publications despite knowing that they contained false claims.69     It is clear from the authorities that in order to defeat the defence of qualified privilege, it is not enough to show that the defendant disliked the plaintiff and knew that the defamatory statement would injure the plaintiff. In this regard, I refer to observations Lord Diplock’s observations inHorrocks, where he held (at 149):So the motive with which the defendant on a privileged occasion made a statement defamatory of the plaintiff becomes crucial. The protection might, however, be illusory if the onus lay on him to prove that he was actuated solely by a sense of the relevant duty or a desire to protect the relevant interest. So he is entitled to be protected by the privilege unless some other dominant and improper motive on his part is proved. “Express malice” is the term of act descriptive of such a motive. Broadly speaking it means malice in the popular sense of a desire to injure the person who is defamed and this is generally the motive which the plaintiff sets out to prove.But to destroy the privilege the desire to injure must be the dominant motive for the defamatory publication; knowledge that it will have that effect is not enough if the defendant is nevertheless acting in accordance with a sense of duty or in bona fide protection of his own legitimate interests.[emphasis added]Lord Diplock continued (at 150-151) to hold:Judges and juries should, however, be very slow to draw the inference that a defendant was so far actuated by improper motives as to deprive him of the protection of the privilege unless they are satisfied that he did not believe that what he said or wrote was true or that he was indifferent to its truth or falsity.The motives with which human beings act are mixed. They find it difficult to hate the sin but love the sinner. Qualified privilege would be illusory, and the public interest that it is meant to serve defeated, if the protection which it affords were lost merely because a person, although acting in compliance with a duty or in protection of a legitimate interest, disliked the person whom he defamed or was indignant at what he believed to be that person’s conduct and welcomed the opportunity of exposing it.It is only where his desire to comply with the relevant duty or to protect the relevant interest plays no significant part in his motives for publishing what he believes to be true that “express malice” can properly be found.[emphasis added]70     I have found that the defendant believed his claim was true at [66] above. I am unable to accept that stopping Bayan Resources’ IPO and preventing the plaintiff from selling his shares in the IPO are outcomes which could not have been of any legitimate consequence to the defendant. Since his claim is for 50% of Bayan Resources’ shares, he had every reason to want to preserve thestatus quountil his claims were resolved by agreement or by the courts. The text of the 3rdLetter was a request to BAPEPAM to suspend the IPO because of the legal dispute between the defendant and the plaintiff relating to the Bayan Resources shares. Further, while the defendant has not been able to adduce evidence in this court to prove the Common Understanding, this alone cannot warrant any adverse inference that he knew that the Indonesian Publications contained false claims. That the claims in the Indonesian Publications were false have to be independently provided in this court and they have not been proven. For the above reasons, I find that the plaintiff has been unable to prove malice that would defeat the defence of qualified privilege.71     Finally, I turn to the question of whether the defendant can raise the defence of qualified privilege in respect of the Indonesian Republications and Singapore Republications. The defendant argues that it can and relies on the following passage inGatleyat (para 6.43):If D, without malice, makes a statement to X on a privileged occasion and X repeats the statement to Y, again on a privileged occasion, D has a defence in respect of both the original publication and the republication. ... If the statement by D to X was not on a privileged occasion but the republication by X was, D is obviously liable in respect of the publication to X, but what is his position in respect of the republication by X? The difficulty is that if D is to be treated as a publisher on the occasion of the republication there is simply no wrong on that occasion.72     It is the plaintiff’s own case that the plaintiff, Bayan Resources and the IPO Advisors had a legal duty to disclose the defendant’s claim to BAPEPAM and to the investing public through the IPO documents as well as the news media. I would add that this is because BAPEPAM and the potential IPO share purchasers each had an interest to receive information about the claim. In terms of the republications between the plaintiff, Bayan Resources and the IPO Advisors, the duty-interest test is similarly satisfied: the republisher had an interest to make the republication and the recipient to whom the republication was made had an interest to receive it. For these reasons, I find the Indonesian Republications and Singapore Republications each to have been made on occasions of qualified privilege. The defence of qualified privilege therefore applies to the Indonesian Publications, Indonesian Republications and Singapore Republications.Whether there is a defence under Indonesian law for the Indonesian Publications and Indonesian Republications73     The defendant relies on the public interest defence and the necessary defence set out in article 1376 of the ICC. The agreed translation of this provision states as follows:The civil claim concerning affront cannot be granted if the intention to affront is not proven. The intention to affront is deemed not to exist if the doer/offender obviously did so for the sake of public interest or for his necessary defence.Public interest defence74     On the public interest defence, Dr Winarta refers to the following passage from Satrio’s Opinion at 91 (English translation provided by the plaintiff):What is certain is that public interest is not for the interest of the statement giver himself, but should always be related to other person’s interest, even though it may be also included within it (together with) the interest of the statement giver himself.75     During the trial, Dr Winarta and Dr Hasibuan agreed that where the statement in question was made for both the defendant’s personal interest and the public interest, the public interest element must have been greater than the private interest element in order for the defence to succeed. They also agreed that for the defence to succeed, the statement must be true. Since the defendant has not been able to prove in this court that the content of the Indonesian Publications, Indonesian Republications and Singapore Republications are true (see above at [52]), the public interest defence  under Indonesian law appears to be unavailable.Necessary defence76     For the necessary defence to be established, Dr Winarta is of the opinion that the statement in question must be (i) true; (ii) said in good faith; (iii) in proportion to the circumstances; and (iv) made in court proceedings. Although Dr Hasibuan opines that the necessary defence applies in this case, he gave evidence during trial that in his thirty years of experience, he did not know of any textbook or Supreme Court decision which says that the necessary defence applies outside of court proceedings. Since the Indonesian Publications, Indonesian Republications and Singapore Republications were made outside of court proceedings, and also because the defendant has been unable to prove the truth of the content of the Indonesian Publications, Indonesian Republications and Singapore Republications (see above at [52]), the necessary defence appears to be unavailable.Whether the reliefs claimed are available under Singapore law and Indonesian law77     Although I have found that the defence of qualified privilege has been made out in respect of the Indonesian Publications, Indonesian Republications and Singapore Republications, I will, for completeness, examine whether the reliefs claimed by the plaintiff are available under Singapore law and Indonesian law. The plaintiff is claiming the following reliefs:(a)     general damages, including damages for loss of opportunity and aggravated damages;(b)     special damages (with interest and damages for currency exchange loss); and(c)     an injunction to restrain the defendant, whether by himself, his servants, agents or otherwise howsoever, from publishing or causing to be published the same or similar words defamatory of the plaintiff in any manner whatsoever.78     The plaintiff must prove that the types of reliefs that he is seeking for the Indonesian Publications and Indonesian Republications are available under both Indonesian law and Singapore law. The plaintiff must also prove that the reliefs that he is seeking to claim for the Singapore Republications are available under Singapore law.Singapore law79     Under Singapore law, a person who has been defamed can claim general damages as compensation for the effects of the defamation. InArul Chandran, the Court of Appeal explained that (at [53]):General damages serve three functions. Firstly, they act as a consolation to the plaintiff for the distress he suffered from the publication of the statement. Secondly, they repair the harm to his reputation. Thirdly, they serve to vindicate his reputation ...InMcCarey v Associated Newspapers Ltd(No. 2) [1965] 2 Q.B. 86 at para 104, the Court held that “compensatory damages may include not only pecuniary loss and anticipated pecuniary loss or any social disadvantages which result, or may be thought likely to result, from the wrong which has been done”. It was noted inGatleyat para 9.2 that while actual financial loss which is not too remote is recoverable, it is “a comparatively rare case in which evidence of such loss is given, simply because it is not available”. Accordingly, a plaintiff in a defamation action may recover general damages for financial loss that he is able to prove flowed from the defamation.80     Under Singapore law, aggravated damages are a component of general compensatory damages (seeGohChok Tong v Jeyaretnam Joshua Benjamin[1998] 2 SLR(R) 971 at [51]) and are available as a remedy for defamation. The factors that the courts consider in determining damages, including whether aggravated damages are justified, are as follows (seeHalsbury’s Laws of Singapore(volume 18) (LexisNexis, 2012 Reissue) (“Halsbury’s Laws of Singapore”) at [240.194]):(1)the nature and gravity of the defamatory statement itself;(2)the conduct, position and standing of the plaintiff and the defendant;(3)the mode and extent of publication;(4)the natural indignation of the court at the injury caused to the plaintiff;(5)the conduct of the defendant from the time the libel is published to the very moment of the verdict;(6)whether the defendant has apologised for and retracted the defamatory statement; and(7)the motives of the defendant in making the defamatory  statement, in particular, whether the plaintiff acted with malice.In this case, even if liability for defamation were to have been made out, I find that no aggravated damages would be warranted. The Indonesian Publications were made to a limited audience of Bayan Resources, the necessary regulators and the IPO Advisors, and the republications were necessitated by applicable disclosure laws. Given that there remained a dispute between the parties relating to the Common Understanding, no natural indignation of the court at the injury caused to the plaintiff arises. Finally the conduct of the defendant from the time of the Indonesian Publications to this action is consistent with his belief that he has a claim though he has not been able to prove this claim on the basis of evidence adduced in this court. Whilst the parties are currently bitter enemies, the plaintiff has not proved that the defendant made the Indonesian Publications with malice devoid of any interest or that they contained false claims.81     Special damages may also be awarded in an action for defamation. Thus,Halsbury’s Laws of Singaporestates (at [240.205]):Special damages... may be awarded in respect of any material temporal injury proved to have been suffered as the natural, and not unduly remote, consequence of the defamatory publication complained of. It is the loss of some material temporal advantage, pecuniary or capable of being estimated in money, which flows directly and in the ordinary course of things from the act of the defendant or an act for which he is responsible....The defendant does not dispute that special damages are available under Singapore law. He argues, however, that he did not cause the loss for which the plaintiff claims special damages. This is an issue for the assessment of damages stage of the proceedings.82     Finally, under Singapore law, a court which has found a defendant liable for defamation has jurisdiction to grant an injunction restraining “any repetition of the slander or of similar imputations” (Lee Kuan Yew v Jeyaretnam Joshua Benjamin[1990] 1 SLR(R) 709 at [61];Arul Chandran v Chew Chin Aik Victor JP(Suit No 1896 of 1998) at [331]). The court will grant such an injunction if it is satisfied that the words are injurious to the plaintiff and there is reason to apprehend further publication by the defendant (Gatleyat [9.28]). The defendant does not dispute that an injunction is a relief that the plaintiff may claim under Singapore law. In this case, I see no grounds for the issue of an injunction as there is no evidence before me as would give rise to an apprehension of further publication of the claims in the Indonesian Publications by the defendant.Indonesian law83     According to Dr Winarta, a plaintiff in an article 1372 of the ICC action can claim for (i) compensation of damages and (ii) payment of money to reinstate his honour and good name. In his opinion, “compensation of damages” in article 1372 of the ICC is the equivalent of the material damages that are recoverable under article 1365 of the ICC whereas “recovery of honour and good name” in article 1372 of the ICC is the equivalent of the immaterial damages that are recoverable under article 1365 of the ICC. In respect of material damages, a plaintiff may recover actual loss suffered and expected loss of income or profit. A plaintiff may also recover “cost, loss and interest” under articles 1243-1252 of the ICC (which deal with breach of contract claims but which, in his opinion can be applied by analogy to claims under article 1365 of the ICC). In respect of damages of a non-material nature, a plaintiff may recover damages for,eg, pain, shame, stress, and having his good name ruined.84     Dr Hasibuan’s disagrees, and opines that a plaintiff in an article 1372 of the ICC action may make the following claims:(a)     a claim for material lossdue to the damage to his reputation and honour;(b)     a claim for his honour and reputation to be restored; and(c)     a claim for it to be mentioned in the judge’s decision that the action complained of is an insult.Dr Hasibuan explains that the reason for the limitation in limb (a) above is because of the second sentence in article 1372 of the ICC which directs the judge to “consider the gravity of the affront, the rank, the position and the capacity of both parties and the circumstances”.85     As I have made a finding of fact that under current Indonesian law, a claim in defamation/”affront” can only be brought under article 1372 of the ICC (see above at [31]), the plaintiff can only claim, in respect of the Indonesian Publications and Indonesian Republications, the remedies available in an article 1372 action. I am unable to conclude that the remedies available in an article 1372 action extend to those available under article 1365 of the ICC and articles 1243-1352 of the ICC, as proposed by Dr Winarta. I accept Dr Hasibuan’s opinion that in an article 1372 action, damages are claimable for material loss only to the extent that such loss is due to the damage to the plaintiff’s reputation and honour.86     I accept Dr Winarta’s opinion that a judge hearing an article 1372 of the ICC action may take into account the relevant circumstances set out in article 1372, including the aggravating and mitigating circumstances. Thus, what is termed “aggravated damages” under Singapore law is available under Indonesian law in an article 1372 action. Dr Winarta further opines that under Indonesian law, the Indonesian courts can grant an injunction to compel a defendant to do an act. The defendant does not dispute this. I therefore accept that an injunction is an available remedy under Indonesian law.87     In summary, damages for loss of opportunity may be recoverable under Singapore law and under Indonesian law but only to the extent that it is due to the damage to the plaintiff’s reputation and honour. While aggravated damages and injunctions are available remedies under Singapore law and Indonesian law, they are not warranted in this case under Singapore law.Malicious falsehood88     I turn next to the plaintiff’s claim in malicious falsehood. The plaintiff’s case is that the Indonesian Publications are a malicious falsehood. The plaintiff must thus prove that there was a malicious falsehood under Singapore law and that the acts complained of are also actionable under Indonesian law.Singapore law89     The elements of the tort of malicious falsehood are as follows (seeWBG Network (Singapore) Pte Ltd v Meridian Life International Pte Ltd and others[2008] SGHC 114):(a)     the defendant published to third parties words which are false;(b)     the words refer to the claimant or his property or his business;(c)     the words were published maliciously; and(d)     special damage has followed as a direct and natural result of their publication.90     InThe Law of Torts in Singapore, the learned authors explain the meaning of “malice” in the following way (at 14.041):The meaning of malice in the context of malicious falsehood is similar to that for malice sufficient to defeat the defence of qualified privilege in defamation... That is, the defendant would be regarded as having acted with malice if he or she:(a)    was actuated by an improper or ulterior motive; or(b)    did not honestly believe that the statement was trueorwas reckless as to the truth of the statements.91     The element of “malice” is explained byGatleyat para 21.7 as follows:There is no liability in malicious falsehood for a statement published in good faith. ... Mere negligence is not malice .... A statement false in fact and calculated to produce actual damage will therefore not support [an action in malicious falsehood] if it was made in the belief, even a careless belief, that it was true. The defendant may have acted stupidly in asserting a right, yet if he bona fide believed such right to exist, no action lies.92     In this case, the plaintiff has not proven on the evidence that the claims in the Indonesian Publications are false, just as the defendant has not proven on the evidence that they are true (see above at [52]). I have also found, in respect of the plaintiff’s claim in defamation, that the defence of qualified privilege has been made out and not defeated by reason of malice (see above at [68]–[70]). Accordingly, the plaintiff’s claim in malicious falsehood has not been made out.Indonesian law93     Since I have found that the plaintiff’s claim in malicious falsehood has not been made out under Singapore law, it is not necessary to consider if the acts complained of are actionable under Indonesian law.Counterclaims: breach of contract, proprietary estoppel, constructive trust, breach of fiduciary duty and money had and received94     As the defendant has acknowledged, all of his counterclaims turn on the existence of the Common Understanding. Since he has not, on the evidence before me, been able to prove the Common Understanding (see above at [52]), his counterclaims in breach of contract, proprietary estoppel, constructive trust, breach of fiduciary duty and money had and received have not be made out.Conclusion95     In summary, the plaintiff’s claim in defamation cannot succeed because the defence of qualified privilege extends to the Indonesian Publications, Indonesian Republications and Singapore Republications. The plaintiff has not been able to prove the malice and falsehood required to establish a claim in malicious falsehood. The defendant, by not being able to prove the Common Understanding, is unable to establish his counterclaims in breach of contract, proprietary estoppel, constructive trust, breach of fiduciary duty and money had and received.96     I would place on record my appreciation to the Indonesian law experts, Dr Winarta, Dr Hasibuan and Professor Pramono for their patient and painstaking clarification and explanations of their opinions on Indonesian law.97     Costs are to follow the event. They are to be agreed or taxed.",
        "Plaintiff’s case": "10     The plaintiff’s case is that the 1stLetter, the 2ndLetter and the 3rdLetter (collectively, the “Letters”) are defamatory of the plaintiff and that they were published by the defendant to the following persons in Indonesia: (a)     in respect of the 1stLetter and the 2ndLetter, to Bayan Resources. (b)     in respect of the 3rdLetter, to the Head of BAPEPAM, the Managing Director of the IDX, PT Trimegah, PT Merrill Lynch Indonesia, PT Macquarie Securities Indonesia and PT Macquarie Konsultan Indonesia. (a)     (collectively, the “Indonesian Publications”) It is apposite to note here that an examination of the 3rdLetter reveals that it was addressed not to PT Merrill Lynch Indonesia but to Merrill Lynch at a Jakarta address. Additionally, it was addressed not to PT Macquarie Securities Indonesia and PT Macquarie Konsultan Indonesia but to Macquarie Securities and Macquarie Consultants both at an identical Jakarta address. 11     The plaintiff avers that the defendant’s publication of the Letters led to the following republications: (a)     In Indonesia: (i)       the 1st Letter and the 2ndLetter to BAPEPAM; (ii)       the 3rd Letter to Bayan Resources; and (iii)       the Letters or their summarised content in two Indonesian newspapers and Bayan Resources’ Indonesian Final Prospectus. (a)     (collectively, the “Indonesian Republications”) (b)     In Singapore: (i)       the Letters to Merrill Lynch Singapore; and (ii)       the Letters or their summarised content in Bayan Resources’ Pricing Supplement to the Preliminary Offering Memorandum and Bayan Resources’ International Final Offering Memorandum. (b)     (collectively, the “Singapore Republications”) 12     The plaintiff further avers that as a result of the Indonesian Publications, Indonesian Republications and Singapore Republications: (a)     the plaintiff’s reputation was damaged and he suffered hurt, distress and embarrassment; (b)     the plaintiff was not able to sell 375,000,000 vendors shares in the IPO at the price of Indonesian Rupiah (“Rp”) 5,800 per share for a total sum of Rp 2.175 trillion; and (c)     the plaintiff lost the opportunity to use and invest Rp 2.175 trillion. 13     The plaintiff is thus bringing this action against the defendant in defamation for the Indonesian Publications, Indonesian Republications and Singapore Republications. The plaintiff is also bringing this action against the defendant in malicious falsehood on the basis that the Letters are a malicious falsehood.",
        "Defendant’s case": "14     The essence of the defendant’s case is that he had a common understanding with the plaintiff, to whom he had given S$3 million to “invest and facilitate” the plaintiff’s establishment of an Indonesian coal mining business, on the basis that if the business was established, the defendant would have a 50% share in the business and if not, the plaintiff would return the S$3 million (the “Common Understanding”). On the basis of the Common Understanding, the defendant denies that he defamed the plaintiff and that the Letters are a malicious falsehood, and he counterclaims in breach of contract, proprietary estoppel, constructive trust, breach of fiduciary duty and money had and received.",
        "Defamation": "15     I turn first to the plaintiff’s claim in defamation. The place of commission of the tort of defamation is the place in which the defamatory statement is published (seeDicey, Morris and Collins on The Conflict of Laws(Sweet & Maxwell, 14th Ed, 2006) at 35-141). Thus, the Indonesian Publications and Indonesian Republications would be alleged torts committed in Indonesia whilst the Singapore Republications would be alleged torts committed in Singapore. 16     For the Singapore Republications, the plaintiff need only show that they are actionable under Singapore law. For the Indonesian Publications and Indonesian Republications, however, the double actionability rule requires the plaintiff to show that they are actionable under both Singapore law and Indonesian law (seeBoys v Chaplin[1971] 1 AC 356 andJIO Minerals FZC and others v Mineral Enterprises Ltd[2011] 1 SLR 391 at [88]). 17     If the plaintiff proves that the publications and republications are so actionable, the defendant must, in order to avoid liability, prove that he has a defence. For the Singapore Republications, the defendant must prove that he has a defence under Singapore law. However, for the Indonesian Publications and Indonesian Republications, it is sufficient for the defendant to prove that he has a defence under either Singapore law or Indonesian law (SeeCheshire and North’s Private International Law(11th ed, Butterworths 1987) at [532] cited with approval inLow Tuck Kwong v Sukamto Sia[2009] SGHC 147 at [14]).",
        "Whether the Indonesian Publications are actionable under Singapore and Indonesian law": "Singapore law 18     Under Singapore law, a statement is defamatory in nature if it tends to: (a)     lower the plaintiff in the estimation of right-thinking members of society generally; (b)     cause the plaintiff to be shunned or avoided; or (c)     expose the plaintiff to hatred, contempt or ridicule. (see Gary Chan Kok Yew & Lee Pey Woan,The Law of Torts in Singapore(Academy Publishing, 2011) (“The Law of Torts in Singapore”) at 12.014). 19     The principles applicable to the construction of words based on their natural and ordinary meanings were summarised by the Court of Appeal inChan Cheng Wah Bernard and others v Koh Sin Chong Freddie and another appeal[2012] 1 SLR 506 (“Chan Cheng Wah Bernard”) at [18]: (a)    the natural and ordinary meaning of a word is that which is conveyed to an ordinary reasonable person; (b)    as the test is objective, the meaning which the defendant intended to convey is irrelevant; (c)    the ordinary reasonable reader is not avid for scandal but can read between the lines and draw inferences; (d)    where there are a number of possible interpretations, some of which may be non-defamatory, such a reader will not seize on only the defamatory one; (e)    the ordinary reasonable reader is treated as having read the publication as a whole in determining its meaning, thus “the bane and the antidote must be taken together”; and (f)    the ordinary reasonable reader will take note of the circumstances and manner of the publication. 20     In this case, all three Indonesian Publications carried substantially the same content and meaning. I find their natural and ordinary meaning to be that (i) the plaintiff had persuaded the defendant to “invest and facilitate” the establishment of a coal mining business in Indonesia in return for 50% of the shares in the resulting coal mining company if it was established; (ii) the defendant did fund and facilitate the establishment of the coal mining company, which included the acquisition of coal mining concession rights, and the company was then established under the name of Bayan Resources; and (iii) the plaintiff never gave the defendant 50% of the shares in Bayan Resources and there was a legal dispute between them relating to these shares. 21     In the 1stLetter and the 2ndLetter, the defendant demanded that the plaintiff surrender and return at least 50% of the total shares in Bayan Resources and its group, failing which he would proceed with civil and criminal suits against the plaintiff and Bayan Resources. The 3rdLetter, addressed to BAPEPAM, IDX and the IPO Advisors, asked that the IPO be suspended because of this legal dispute between the defendant and the plaintiff “so as not to cause any losses to a third party and to avoid any lawsuits by [the defendant].” 22     The plaintiff submits that the Indonesian Publications are defamatory in nature as their natural and ordinary meaning is that the plaintiff, having induced the defendant to invest in a coal mining business, now known as Bayan Resources, in return for 50% of the shares of that business, has  on his part reneged on the bargain. The plaintiff further submits that the Indonesian Publications mean that the plaintiff was “seeking to mislead the public in relation to his shareholding in Bayan Resources” and that he has “therefore acted dishonourably and has committed a crime.” 23     I find that to an ordinary reasonable person using his general knowledge and common sense, and in the context of an imminent IPO involving the shares of Bayan Resources which was reported to be the President Commissioner and controlling shareholder, the meaning of the Indonesian Publications would be that the defendant and the plaintiff had some private arrangement or understanding to account for and deliver 50% of Bayan Resources shares, which the plaintiff had not performed. This meaning is defamatory in nature and in the context of such an IPO, in that it would tend to lower the plaintiff in the estimation of right-thinking members of society generally or impute a lack of integrity. Thus, the Indonesian Publications are to this extent actionable under Singapore law. 24     I am unable to accept the plaintiff’s extended meaning to the Indonesian Publications that the plaintiff was seeking to mislead the public in relation to his shareholding. First there is no language in the Letters suggesting this. Second, the 1stLetter and 2ndLetter are notices/”warnings” of the defendant’s claim as a prelude to his initiating civil and criminal proceedings. The 3rdLetter clearly expresses that the defendant’s claim was a “legal dispute” that he had with the plaintiff. Indonesian law 25     The plaintiff’s Indonesian law expert, Dr Frans Hendra Winarta (“Dr Winarta”), is of the opinion that under Indonesian law, a person who has been defamed/”affronted” can bring a claim in the following ways: (a)     Claim for “defamation” or “libel” under article 1372 of the Indonesian Civil Code (“ICC”) read with article 310 of the Indonesian Penal Code (“IPC”) and article 1365 of the ICC; or (b)     Claim for an “unlawful act” under article 1365 of the ICC. 26     The defendant’s Indonesian law expert, Dr Otto Hasibuan (“Dr Hasibuan”), is of the opinion that a claim for defamation/”affront” under Indonesian law can only be brought under article 1372 of the ICC read with article 310 of the IPC. It cannot be brought under article 1365 of the ICC, whether alone or read with article 1372 of the ICC. 27     The parties and experts agreed on the following English language translations of the relevant provisions of the ICC and the IPC: (a)     Article 1365 of the ICC: Every unlawful act that brings damage to other person, obliges the person by whose fault causing such loss, to compensate such loss. (b)     Article 1372 of the ICC: The civil claim of affront (penghinaan) is aimed to get compensation of damage as well as / along with the recovery of honour and good name. In assessing / evaluating one and the other, the judge must consider the gravity of the affront (penghinaan), the rank, the position and the capacity of both parties and the circumstances. (c)     Article 310 of the IPC: (1)    Whosoever intentionally / wilfully harms someone’s honour or good name, by accusing him of certain act, with the obvious intention of spreading the allegation, is punishable, as guilty of defamation [“menista” / “smaad”], with imprisonment for a maximum of nine months or fine of maximum four thousand five hundred Rupiahs. (2)    If this is committed in written or pictorial form, spread, exhibited or posted in public, the doer is punishable, as guilty of libel [“menistadengantulisan” / “smaadschrift”], with imprisonment for a maximum of one year and four months or fine of maximum four thousand five hundred Rupiahs. 28     Dr Winarta and Dr Hasibuan agree that the definition of the term “affront” in article 1372 of the ICC is found in article 310(1) of the IPC. The elements of “affront” are as follows: (a)     there must be an intentional or wilful attack on someone’s honour or good name; (b)     an accusation must be made of certain matters; and (c)     there must exist a purpose to make the defamatory attacks known to the public. 29     Even if I accept the defendant’s argument that he made the Indonesian Publications with the predominant intention of protecting his interests and/or the public interest, I accept Dr Winarta’s opinion that element (a) does not speak of the predominant or sole intent of the defamatory attack, it only requires that the defendant intended that there be such an attack,ie, he did not make the attack negligently or innocently. In this case, I find that the Indonesian Publications were intentional attacks on the plaintiff’s “honour or good name”. As for the remaining elements, I find that the Indonesian Publications contained accusations against the plaintiff and that there was an intention to make the Indonesian Publications known to the public, where “public” means one or more third parties other than the plaintiff (see J. Satrio,Civil Lawsuit on the Basis of Affront as an Unlawful Act(plaintiff’s translation of the title) (“Satrio’s Opinion”) at 31-32). Thus, I find on a balance of probabilities that the Indonesian Publications are actionable under Indonesian law, and specifically under article 1372 of the ICC read with article 310 of the IPC. 30     I turn next to consider Dr Winarta’s opinion that the plaintiff may alternatively elect to bring a claim under article 1365 of the ICC. Dr Hasibuan disagrees on the ground that “article 1365 is general (lexgeneralis), while article 1372 is specific (lexspecialis)”, and it is not permissible to frame a claim under a general provision when there is a clear specific provision for that purpose. To support his position, Dr Hasibuan refers to the Indonesian Supreme Court decision ofTime Inc Asia et al v H.M. Soeharto(No 273 PK/PDT/2008) (“Time Inc Asia”) where the court stated the following (at 87): That with the argument of the Plaintiff’s lawsuit [which was based on the Defendant’s picture and writing which contained insult and defamation], the Judge is not allowed to use the criteria of Article 1365 of the Civil Code but the one which should be used is Article 1372 of the Civil Code which is a special provision, because the two consequences of the provisions are very different. 31     Given that this action is brought in Singapore on alleged torts committed in Indonesia, this common law precedent based court has to make findings of fact as to the law of Indonesia, a non-precedent based civil law jurisdiction, with the assistance of the Indonesian law experts. I would accordingly adopt a cautious approach and place much weight on the decision inTime Inc Asia, which is the only decision produced before this court which addresses the question of whether a defamation/”affront” claim may be brought under article 1365 of the ICC in light of article 1372 of the ICC which deals specifically  with defamation/”affront”. The Indonesian Supreme Court inTime Inc Asiaunequivocally ruled that in a defamation/”affront” action, the judge is not allowed to use the criteria of article 1365 of the ICC but only the special provision of article 1372 of the ICC. The plaintiff concedes thatTime Inc Asiadecided that a claim for defamation/”affront” should be brought under article 1372 of the ICC and not under or by reference to article 1365 of the ICC. I note Dr Winarta’s citation ofLauwJuandaLesmana v HasimSutionoSuryopratomo(No 1331K/PDT/2004) where the Indonesian Supreme Court upheld a lower court decision on an “affront” claim under article 1365 of the ICC read with article 1372 of the ICC andDendenSudarman v Yusuf Suparma(No 396K/PET/2001) where the Indonesian Supreme Court upheld a lower court decision on a defamation claim under article 1365 of the ICC. However, in neither of these cases was the question posed and addressed head on as it was in theTime Inc Asiacase. In light of this, I make a finding of fact that a claim in defamation/”affront” under current Indonesian law can only be brought under article 1372 of the ICC. 32     This is not to say that Dr Winarta’s opinion that a person who has been “affronted” may alternatively bring an action under article 1365 of the ICC may not in the future find favour with the Indonesian courts, as the Indonesian courts are not bound by the doctrine of precedent. However in the absence of Indonesian Supreme Court or superior court decisions produced before me in which this question was raised and addressed head on in support of his opinion, I am unable to make a finding of fact that this is the current position under Indonesian law.",
        "Whether the Indonesian Republications are actionable under Singapore and Indonesian law": "33     On 18 July 2008, the plaintiff sent a letter to BAPEPAM enclosing the 1stLetter, and Bayan Resources sent a letter to BAPEPAM enclosing the 1stLetter and the 2ndLetter. Both republications had a cover letter in which Bayan Resources and the plaintiff denied the defendant’s allegations. Bayan Resources’ letter to BAPEPAM stated the following: 5.    It is known that [Bayan Resources] was established in 2004 and hereby [Bayan Resources] clearly states of absence of legal relationship, in written and verbal manner, with [the defendant]. 6.    [Bayan Resources] hereby also clearly states that none of the companies under Bayan Resources group has any connection, in written and legal manner, with [the defendant]. 7.    The information / data provided by [Bayan Resources] based upon the Registration Statement for Initial Public Offering of [Bayan Resources]... is accurate and complete. Hence, [Bayan Resources] shall be fully and legally accountable for accuracy of the respective information / data as stated in the prevailing laws and regulation including but not limited to capital market regulations. In the plaintiff’s letter to BAPEPAM, the plaintiff stated: That I ... hereby deny the accuracy of the claim stated in the [1stLetter] and I would take legal responsibility for my statement in accordance with the prevailing laws and regulations including but not limited to capital market regulations. 34     On 21 July 2008, Merrill Lynch Singapore sent an email to Bayan Resources attaching the 3rdLetter. 35     The following passage was published: (i) on 5 August 2008 in theSuaraPembaruannewspaper at page 23; (ii) on 6 August 2008 in theBisnis Indonesianewspaper at page F3; and (iii) in Bayan Resources’ Indonesian Final Prospectus dated 6 August 2008 at page xx (English translation provided by the plaintiff): Legal process faced by company and subsidiary - Legal summons from Sukamto Sia On 10thJuly 2008, Bayan Group together with the controlling shareholder, Dato’ Low Tuck Kwong, received a two-paged summons from the law offices of Hotman Paris & Partners stating that Mr Sukamto Sia has the right to 50% of all of the Company’s and subsidiaries’ shares, comprising Bayan Group. Through his lawyers, Mr Sia stated that the controlling shareholder of Bayan Group has agreed to give the shares to him in return for financial help of an unspecified amount and this was allegedly given by Mr Sia to the controlling shareholder in 1996. Bayan Group does not have any relations with Mr Sia and the controlling shareholder of Bayan Group has notified Bayan Group that Dato Low Tuck Kwong does not have any relations with Mr Sia besides the situation in which the Bayan Group is not involved. 36     The Indonesian Final Prospectus additionally stated the following (at page 102) (English translation provided by the plaintiff): Latest Development On 10thJuly 2008, Bayan Group together with the controlling shareholder, Dato’ Low Tuck Kwong, received a two-paged summons from the law offices of Hotman Paris & Partners stating that Mr Sukamto Sia has the right of 50% of all of the Company’ and subsidiary’s shares, comprising the Bayan Group. Through his lawyers, Mr Sia stated that the controlling shareholder of Bayan Group has agreed to give the shares to him in return for financial help of an unspecified amount and was allegedly given by Mr Sia to the controlling shareholder of Bayan Group in 1996. Bayan Group believes, and the controlling shareholder of Bayan Group has notified Bayan Group that he believes, that Sukamto Sia’s claim is baseless and careless, Bayan Group does not have any relations with Sukamto Sia and the controlling shareholder of Bayan Group has notified Bayan Group that he does not have any relations with Sukamto Sia besides the situation in which the Bayan Group is not involved, as described below. The controlling shareholder of Bayan Group has notified Bayan Group that he is the plaintiff in a trial process in Hong Kong which involved a company where Sukamto Sia owns 80% of the shares and where Mr Sia is also a Director. In the decision of the trial of 2001 the controlling shareholder of Bayan Group was awarded HK$ 108.4 million (US$ 13.9 million based on afternoon exchange rate on 22 July 2008 amounting US$ 1 = HK$ 7,7967) plus interest counted from 22 July 2000. The said company is under the process of liquidation because it was unable to satisfy the 2001 judgment. In addition, the said company’s provisional liquidator had commenced legal proceedings on Mr Sia in Hong Kong. In June 2008, the provisional liquidator obtained an interim court order on Mr Sia which is effective worldwide, to freeze his assets (and those of a co-defendant) amounting to HK$ 277.0 million (US$35.5 based on afternoon exchange rate on 22 July 2008 amounting US$1 = HK$ 7,7967) pending the resolution of the proceedings against him and the co-defendant. Bayan Group believes, and the controlling shareholder of Bayan Group has notified Bayan Group that he believes, that there is no basis for (Mr Sia’s) the claim on Bayan Group and him as stated in the summons. However, the investors should note that the resolution of legal claims involves uncertainties and judicial decisions cannot be predicted. Singapore law 37     I begin by determining whether the Indonesian Republications are defamatory in nature. The defendant’s argument that the summaries of the Indonesian Publications in the Indonesian Republications bear a lesser (if any) defamatory meaning than the Indonesian Publications themselves because the summaries merely convey thefactthat the defendant has made a claim must fail because of what was termed the “repetition rule” inStern v Piper[1997] QB 123 (at 135): The repetition rule ... is a rule of law specifically designed to prevent a jury from deciding that a particular class of publication - a publication which conveys rumour, hearsay, allegation, repetition, call it what one will - is true or alternativelybears a lesser defamatory meaning than would attach to the original allegation itself. [emphasis added] 38     In determining the natural and ordinary meaning of the Indonesian Republications, regard must be had to the republications as a whole (SeeChan Cheng Wah Bernardat [18(e)] (at [18] above). Unlike the Indonesian Publications, most of the Indonesian Republications contained the plaintiff’s denial of and response to the defendant’s claim which may be regarded as “the antidote” to “the bane” (seeLim Eng Hock Peter v Lin Jian Wei and another[2009] 2 SLR(R) 1004 at [92]). In this regard, I refer to the three levels of meaning set out inChase v News Group Newspapers Ltd[2003] EMLR 218 (“Chase”), where the Court held that: The sting of a libel may be capable of meaning that a claimant has in fact committed some serious act, such as murder. Alternatively, it may be suggested that the words mean that there are reasonable grounds to suspect that he/she has committed such an act. A third possibility is that they may mean that there are grounds for investigating whether he/she has been responsible for such an act. I find that the Indonesian Republications, save for the republication of the 3rdLetter by Merrill Lynch Singapore to Bayan Resources, carry only the third defamatory meaning referred to in the passage fromChasecited above,viz, there are grounds for investigating if the plaintiff had an agreement or understanding with the defendant which he had not performed, as alleged by the defendant and denied by the plaintiff. This finding will impact the quantum of damages payable by the defendant should liability be established. The republication of the 3rdLetter by Merrill Lynch Singapore to Bayan Resources, which contained the full text of the 3rdLetter and nothing more, carries the same defamatory meaning as the 3rdLetter. 39     In my view, the defendant is responsible for the Indonesian Republications as they are the natural and probable result of the Indonesian Publications (seeGohChok Tong v Jeyaretnam Joshua Benjamin[1997] 3 SLR(R) 46 at [127]). The Indonesian Republications necessarily arose by reason of the disclosure requirements for public offerings of securities under articles 70, 78, 80 and 81 of the Law of the Republic of Indonesia Number 8 Year 1995 Concerning the Capital Market (“Indonesian Capital Market Law”) and other capital market requirements under Indonesian law. These extend to making such disclosures in the news media. This is supported by the opinions of Dr Winarta and the defendant’s Indonesian capital market law expert, Professor Dr Nindyo Pramono (“Professor Pramono”). Thus, the Indonesian Republications are actionable under Singapore law. Indonesian law 40     Dr Winarta opined that according to theadequate veroorzakingtheory of causation under Indonesian law, a defendant who makes a defamatory statement which is republished is liable for the damage caused by the republications if such republications “reasonably can be expected to arise” from his original defamatory statement. Dr Hasibuan agreed that theadequate veroorzakingtheory is one of three theories of causation that could be used in Indonesia. 41     Both Dr Winarta and Professor Pramono gave evidence that the Indonesian Republications can reasonably be expected to arise from the defendant’s Indonesian Publications owing to the disclosure requirements under Indonesia’s capital market laws (see [39] above). As such, I find on a balance of probabilities that the Indonesian Republications would be actionable under Indonesian law.",
        "Whether the Singapore Republications are actionable under Singapore law": "42     The plaintiff pleaded that the Letters were republished to Merrill Lynch Singapore in Singapore. There is evidence that the plaintiff personally handed the 1stLetter to Merrill Lynch Singapore in Singapore. However, as the plaintiff concedes that he does not have evidence that the 2ndLetter was received by the IPO team, including Merrill Lynch Singapore,in Singapore, and I find that there is also no evidence that the 3rdLetter was republished to Merrill Lynch Singaporein Singapore, the republication of the 2ndLetter and the 3rdLetter to Merrill Lynch Singapore will not be considered for the purposes of liability in this Suit. 43     The following passage was published in the following documents: (i) at page 3 of Bayan Resources’ Pricing Supplement to the International Preliminary Offering Memorandum dated 24 July 2008 (the “Pricing Supplement”), hard copies and soft copies of which were sent to potential investors in Singapore; and (ii) at page 5 of Bayan Resources’ International Final Offering Memorandum dated 24 July 2008 (the “International Final Offering Memorandum”), which was distributed to potential investors in Singapore: Recent Developments On July 10, 2008, we and our controlling shareholder, Dato’ Low Tuck Kwong, received a two-page notice from the law firm of Hotman Paris & Partners alleging that Mr Sukamto Sia is entitled to 50% of the shares in the Company and its subsidiaries comprising the Bayan Group. Through his attorney, Mr. Sia has alleged that our controlling shareholder agreed to provide these shares to him in return for an unspecified amount of financing allegedly provided by Mr. Sia to our controlling shareholder in 1996. Through his attorney, he has also threatened to initiate legal proceedings. On July 21, 2008, Hotman Paris & Partners, on behalf of their client Mr. Sia, sent a letter to various parties including the regulatory authorities in Indonesia, including BAPEPAM-LK, which repeated the allegations and requested cancellation of the Combined Offering. We believe, and our controlling shareholder has advised us that he believes, Mr. Sia’s claim is totally without merit and is frivolous. The Bayan Group has had no dealings whatsoever with Mr. Sia, and our controlling shareholder has advised us of the following matter in which the Bayan Group is not involved, as described below. Our controlling shareholder has advised us that he is a plaintiff to a litigation in Hong Kong involving a company in which Mr. Sia owned an 80% interest and of which Mr. Sia was a director. In the litigation, our controlling shareholder obtained a judgment in 2001 against the company for approximately HK$108.4 million (US$13.9 million based on the noon buying rate as of July 22, 2008) plus interest from July 22, 2000. The company is in the process of being liquidated because it was unable to satisfy the 2001 judgment. In addition, the provisional liquidator of the company has instituted proceedings against Mr. Sia in Hong Kong. In June 2008, the provisional liquidator of the company obtains an interim court order against Mr. Sia, which purports to be effective worldwide, to freeze his assets (and those of his co-defendant) up to a value of HK $277.0 million (US$35.5 million based on the noon buying rate as of July 22, 2008), pending the resolution of the proceedings against him and his co-defendant. We believe, and our controlling shareholder has advised us that he believes, that there is no basis whatsoever for the claim against us and him set out in the notice. Notwithstanding the foregoing, we and our controlling shareholder expect that litigation proceedings may be commenced against us and our controlling shareholder. We intend to vigorously defend Mr. Sia’s claims against us and our controlling shareholder has advised that he intends to vigorously defend Mr. Sia’s claims against him. However, investors should note that the resolution of legal claims in Indonesia involves uncertainties and judicial decisions in Indonesia may be unpredictable. 44     Applying the principles of Singapore law set out above (at [37]-[39]), I find that the Singapore Republications are actionable under Singapore law. The republication of the 1stLetter by the plaintiff to Merrill Lynch Singapore, which contained the full text of the 1stLetter and nothing more, carries the same defamatory meaning as the 1stLetter. I find that the remaining Singapore Republications carry the third defamatory meaning referred to in the passage fromChasecited above at [38],ie, they tell an ordinary reasonable reader that there are grounds for investigating if the defendant’s claims are true. The defendant is responsible for the Singapore Republications, which were a natural and probable consequence of the Indonesian Publications because the IPO was a global offering.",
        "Whether there is a defence under Singapore law for the Indonesian Publications, Indonesian Republications and Singapore Republications": "45     The defendant relies on the following defences under Singapore law: justification, absolute privilege and qualified privilege. I will examine each in turn. Justification 46     InArul Chandran v Chew Chin Aik Victor[2001] 1 SLR(R) 86 (“Arul Chandran”), the Court of Appeal explained (at [28]) that the defence of justification requires the defendant to prove the truth of the defamatory statements: [t]he law of defamation presumes that defamatory words are false and the plaintiff need do no more than prove that the defamatory words have been published by the defendant. The burden is then on the defendant, if he wishes to rely on the defence of justification, to prove that those words are true. 47     The rationale for the defence of justification is set out inThe Law of Torts in Singaporeat [13.004] as follows: The rationale for the defence of justification is based on the presumption that by telling the truth about the plaintiff, his reputation “is not lowered beyond its proper level, but is merely brought down to it”. Further “the law does not protect the reputation that a man has, but only the reputation that he deserves”. 48     I have found the natural and ordinary meaning of the Indonesian Publications to be that set out above at [20]. The defendant’s defence is that the content of the Indonesian Publications is true because of the Common Understanding between him and the plaintiff. 49     As such, I now set out the evidence in this court on the Common Understanding. The defendant’s evidence is that in late 1995, the plaintiff, who was then in financial difficulty, asked the defendant for S$3 million to “invest and facilitate” the plaintiff’s establishment of an Indonesian coal mining business. The plaintiff promised the defendant in return, a 50% share in the coal mining business if it was established, and if it was not, that he would repay the S$3 million. The defendant then gave S$3 million cash to the plaintiff, who issued him a cheque dated 25 April 1996 for S$3 million (the “Cheque”) as an assurance that the defendant would get his money back if the coal mining business was not established. It was also the defendant’s evidence that he had, over the years of his close friendship with the plaintiff, made other large cash and undocumented loans to the plaintiff, although this S$3 million was the biggest amount “in one shot”. 50     The plaintiff denies that he had received S$3 million from the defendant and denies that there was any Common Understanding. To refute the defendant’s claim that he needed S$3 million in 1995, the plaintiff produced some evidence of his assets at that time. The defendant points out that this evidence was not supported by any valuation nor was there any evidence produced of the plaintiff’s liabilities at that time. The plaintiff confirmed under cross-examination that in early 1996, he had “some problems with [his] cash flows” and was considering selling part of his art collection. The plaintiff also admitted that his two active Singapore bank accounts were overdrawn for every month between mid-1995 to mid-1996. The plaintiff’s explanation for the Cheque is that he issued it on 25 April 1996 (and not in late 1995) at the request of the defendant, who wanted to use it to raise funds from others in order to procure payment by the defendant’s company (“Dynasty”) which had not paid the plaintiff and six others vendors for shares for listed shares purchased by and delivered to Dynasty. This debt led to the Hong Kong court proceedings by the plaintiff and other vendors against Dynasty which led to the appointment of provisional liquidators of Dynasty. The provisional liquidators obtained a Hong Kong worldwide Mareva injunction against the defendant which was later discharged. The plaintiff gave evidence that he had told the defendant not to cash the Cheque as there were insufficient funds in his account. The defendant challenges the plaintiff’s explanation in light of the plaintiff’s evidence that Dynasty then owed the vendors about S$41 million, a much larger sum than S$3 million. 51     The defendant draws support for the Common Understanding from the chronology of events in late 1995 (which he says were unknown to him until after he received Bayan Resources’ draft prospectus in July 2008). This chronology reveals that the plaintiff incorporated a Singapore company, International Coal Pte Ltd (“ICP”) on 4 October 1995. Under cross-examination, the plaintiff stated that the Indonesian government had granted a coal mining concession to an Indonesian company called PT Gunung Bayan Pratama Coal (“GBPC”), and that GBPC had sold 65% of its concession rights to a Hong Kong company, Kristle Trading Limited (“Kristle”). On 1 November 1995, Kristle sold these concession rights to ICP. The plaintiff gave evidence that he later discovered that the transfer of concession rights was not recognised under Indonesian law. As such, in November 1997, the plaintiff having become an Indonesian citizen together with his partners acquired GBPC itself and thereafter used GBPC to produce coal. On 7 October 2004, Bayan Resources was incorporated in Indonesia and it subsequently acquired a controlling interest in GBPC. When Bayan Resources was listed on the IDX on 12 August 2008, GBPC was one of many of its subsidiaries. The plaintiff argues that information about the history of his involvement in the coal mining business is publicly available and that the defendant has hitched this publicly available chronology of events to corroborate his alleged Common Understanding. 52     The evidence in court of the Common Understanding turns entirely on the plaintiff’s and the defendant’s respective word, there being, apart from the Cheque, no other witnesses or documentary evidence. This is a case of one party’s evidence and recollection of events in 1995 pitted against the other party’s contrary evidence and recollection of the same events relating to whether there was and if so what was the Common Understanding. Throughout the trial, each party repeatedly and extensively challenged the other’s veracity and credibility. This was further done by referring this court to sworn statements which they had each filed in earlier Hong Kong and Singapore court proceedings between them or involving them. These earlier sworn statements reveal that each of them had given evidence or explanations before these courts which are diametrically contradictory to the evidence, explanations and accounts which they each now give in this court. The only objective documentary evidence produced in this court was the Cheque. Apart from the fact that it is for $3 million, when it was issued and why remains obscure in the light of the time lapse and that the parties had many personal and financial transactions between them before they fell out. 53     In the light of the above, I am unable to find, on the evidence adduced in this court, one way or another that there was or there was no Common Understanding or the terms of such Common Understanding. As such, I find that the defendant has not discharged his burden to prove the truth of the Indonesian Publications and therefore of the Indonesian Republications and Singapore Republications, and the defence of justification accordingly has not been made out. Absolute privilege 54     I next turn to the defence of absolute privilege. The rationale for this defence is explained inThe Law of Torts in Singaporein the following manner (at [13.040]): Free speech is so significant in certain situations such that complete immunity is afforded to defamatory statements even where they may be untrue and made maliciously. These include statements which attract Parliamentary privilege, statements made during the course of or related to judicial proceedings as well as Executive matters.... 55     InLincoln v Daniels[1962] 1 QB 237, Devlin L.J. explained that absolute privilege which covers proceedings in or before a court of justice can be divided into the following three categories (at 257-258): The first category covers all matters that are done coram judice. This extends to everything that is said in the course of proceedings by judges, parties, counsel and witnesses, and includes the contents of documents put in as evidence. The second covers everything that is done from the inception of the proceedings onwards and extends to all pleadings and other documents brought into existence for the purpose of the proceedings and starting with the writ or other document which institutes the proceedings. The third category is the most difficult of the three to define. It is based on the authority ofWatsonv.M’Ewan, in which the House of Lords held that the privilege attached to evidence which a witness gave coram judice extended to the precognition or proof of that evidence taken by a solicitor. It is immaterial whether the proof is or is not taken in the course of proceedings. This means that absolute privilege covers everything that is done before a judge (for example, during a trial), everything that is done in the course of court proceedings from its commencement (when the writ or an equivalent document is issued) to its conclusion (when a decision is rendered or a determination made), and things done before the commencement of court proceedings which are considered to be “a step towards” the conduct of proceedings (Watson v M’Ewan[1905] AC 480 at 487). 56     The defendant submits that the Indonesian Publications are protected by absolute privilege on the grounds that: (a)     the 3rdLetter, insofar as it was sent to BAPEPAM, falls within Devlin L.J.’s second category as it was “the first step in a regulatory process of a quasi-judicial nature”; and (b)     all the Letters fall within Devlin L.J.’s third category as they were necessary to the commencement of proposed legal proceedings by the defendant against the plaintiff to enforce the Common Understanding. 57     In respect of the first ground, I accept that absolute privilege may in limited occasions be extended beyond court proceedings to proceedings before tribunals which act in a manner similar to courts of law (seeD v Kong Sim Guan[2003] 3 SLR(R) 146 at [99]). InTrapp v Mackie[1979] 1 WLR 377 at 379, Lord Diplock set out the following factors to determine if sufficient similarity exists for absolute privilege to apply (at 379): (a)     the authority under which the tribunal acts; (b)     the nature of the question into which it has a duty to inquire; (c)     the procedure adopted by it in carrying out the inquiry; and (d)     the legal consequences of the conclusion reached by the tribunal as a result of the inquiry. 58     I note the case ofMahon v Rahn(No. 2) [2000] 1 WLR 2150 in which the English Court of Appeal extended absolute privilege to a bank’s response to queries from a securities regulator. I further noteBuckley v Dalziel[2007] 1 WLR 2933 in which the English Court extended absolute privilege to a complaint made to the police. 59     Article 4 of the Indonesian Capital Market Law provides that BAPEPAM shall develop and regulate capital market activities so as to create an orderly and efficient capital market and to protect the interests of investors and the public. Article 5 of the same law provides that BAPEPAM may conduct or procure inspections into suspected violations of the Indonesian Capital Market Law and suspend or cancel listings or stock exchange transactions. Both Dr Winarta and Professor Pamono agree that BAPEPAM is not a court of law and is not in a position to determine who is right or wrong on the matter at hand. They also agree that BAPEPAM only has an “interest as to whether the registration statement submitted by the companies which are going public contain the material information or not.” It is unclear from the expert evidence that the 3rdLetter to BAPEPAM whether BAPEPAM would have precipitated BAPEPAM to conduct a formal inquiry following the dispute described in this Letter and what legal consequences would follow in this pre-IPO context. 60     In any event, it is significant to note what occurred on this occasion. The 3rdLetter to BAPEPAM was not a complaint for BAPEPAM to conduct an investigation. It was expressly for the purpose of requesting BAPEPAM to suspend the planned IPO because of the legal dispute between the defendant and the plaintiff relating to the Bayan Resources shares. The result of the 3rdLetter, according to the plaintiff, was that the IPO Advisors met with BAPEPAM and were told that they “would have to clear any disputes on the shares before the IPO could proceed”. According to the plaintiff, the matter was resolved when upon the advice of the IPO Advisors the plaintiff decided and informed BAPEPAM that he would withdraw his planned vendor shares offer which would be replaced by vendor shares offered by theother shareholders to make up the shortfall. In these circumstances and without greater clarity on Indonesian capital market law and practice, I am unable to conclude that absolute privilege would extend to the 3rdLetter to BAPEPAM. 61     In respect of the second ground that all the Letters were necessary, under Indonesian law, before court proceedings could be commenced, the Indonesian law experts have different opinions as to whether the defendant had a legal obligation under articles 1238 and 1243 of the ICC to send a warning letter to the plaintiff before he commenced legal proceedings against the plaintiff. In any event, as Dr Winarta pointed out, the defendant was not required by Indonesian law to send the 1stLetter and the 2ndLetter to Bayan Resources, who was not an alleged contractual counterparty to the defendant. The defendant has also not shown that he had a legal obligation to send the 3rdLetter to BAPEPAM, IDX and the IPO Advisors prior to commencing a court action against the plaintiff and Bayan Resources in Indonesia.  Thus, it has not been established before this court that the requisite Singapore law elements for absolute privilege have been made out. Qualified privilege 62     In respect of the defence of qualified privilege, the defendant argues that the Indonesian Publications, Indonesian Republications and Singapore Republications were published on privileged occasions because the “duty-interest” test is satisfied.  This test was explained by Lord Atkinson inAdam v Ward[1917] A.C. 309 at 334: A privileged occasion is ... an occasion where the person who makes a communication has an interest, or a duty, legal, social or moral, to make it to the person to whom it is made, and the person to whom it is so made has a corresponding interest or duty to receive it. This reciprocity is essential. InMallan v A M Bickford & Sons, Limited[1915] SALR 47), the court held that (at 84): [I]t may be accepted as a well-established rule that some duty or interest must exist in the party to whom the communication is made as well as in the party making it. The duty or interest may be common to both parties, but this is not essential. It is enough if there is a duty or interest on one side, and a duty or interest, or interest or duty (whether common or corresponding or not) on the other. 63     The rationale for the defence of qualified privilege was stated by Lord Diplock inHorrocks v Lowe[1975] AC 135 (“Horrocks”) (at 149) to be as follows: The public interest that the law should provide an effective means whereby a man can vindicate his reputation against calumny has nevertheless to be accommodated to the competing public interest in permitting men to communicate frankly and freely with one another about matters in respect of which the law recognises that they have a duty to perform or an interest to protect in doing so. What is published in good faith on matters of these kinds is published on a privileged occasion. It is not actionable even though it be defamatory and turns out to be untrue. 64     I turn now to the question of whether the defendant had an interest to make the Indonesian Publications. The scope of the “interest” that is required to establish the defence of qualified privilege is explained inGatley on Libel and Slander(Sweet & Maxwell, 11th ed, 2008) (“Gatley”) as follows (at 14.12): The law does not restrict the interests which the defendant may protect by asserting freely what he believes to be true. In the majority of the cases, the interests protected have been business interests; thus, the defendant may write freely to claim money he believes to be due to him, ... InBlackham v Pugh(1846) 15 L.J.C.P. 290, which is cited byGatleyimmediately after the above passage, Tindal CJ recognised and applied (at 620) (see also Coltman J at 621, Cresswell J at 623-624 and Erle J at 625-626): … that principle by which a communication made, by a person immediately concerned in interest, in the subject-matter to which it relates, for the purpose of protecting his own interest, in the full belief that the communication is true, and without any malicious motive, is held to be excused from responsibility in an action for a libel. 65     In the present case, while the defendant has not been able to prove that his claims in the Indonesian Publications are true, it remains to be determined whether he believed them to be true and without any malicious motive in order to be excused from responsibility for the defamation. 66     In my view, the defendant’s actions in instructing his Singapore and Indonesian lawyers and acting on the latter’s advice to make the Indonesian Publications show that he believed that he had a claim against the plaintiff and that his claims in the Indonesian Publications were true. The defendant issued his Indonesian lawyers a power of attorney which authorised them to take a broad range of legal steps to pursue his claim. Further, it is in evidence that on 29 June 2008, the defendant’s friend and an investment banker at Merrill Lynch Singapore, Mr Christopher Clower, mentioned to the defendant that he was working on an IPO of an Indonesian coal mining company. The defendant later overheard Mr Clower mentioning a “Dato Low” in a private telephone call. This would be consistent with the defendant’s account of what precipitated his actions that followed. It is his evidence that he then made further independent enquiries and obtained a copy of Bayan Resources’ draft prospectus dated 2 July 2008. Following this, he instructed his Indonesian lawyers to make the Indonesian Publications. These actions and timelines corroborate that he believed that he had a claim against the plaintiff. The defendant’s conduct and demeanour under cross examination in this court further reflected his continued belief. That being my finding, the Indonesian Publications were made in order to protect what the defendant believed to be his business interests. 67     With respect to the recipients of the Indonesian Publications which contained information about the defendant’s claim, I find that Bayan Resources had an interest in receiving the 1stLetter and the 2ndLetter. Bayan Resources had a duty to disclose all the material facts in the global IPO and listing documents. The defendant’s claim for 50% of Bayan Resources’ shares is material and disclosable in the context of the global IPO in two critical respects: first with respect to the identities of the controlling shareholders of Bayan Resources and second the fact of the claim itself. The IPO Advisors had an interest in receiving the 3rdLetter as they would share responsibility for the accuracy and completeness of the global IPO documents. I find Macquarie Securities and Macquarie Consultants (both occupying the same Jakarta address) to be part of “Macquarie” which is described only by its logo in Bayan Resources’ Preliminary Offering Memorandum dated 4 July 2008 as the co-lead manager and international selling agent in the global IPO. IDX had an interest to receive the 3rdLetter as it is the stock exchange on which Bayan Resources was to be listed and traded. Finally, BAPEPAM had an interest to receive the 3rdLetter as it is the principal capital market regulator which will decide whether to issue the Effective Statement for the IPO. For the above reasons, the defence of qualified privilege extends to the Indonesian Publications. 68     The defence of qualified privilege will be defeated if the plaintiff can show that there was malice on the part of the defendant. In this case, the plaintiff argues that malice is made out because (i) the defendant had a “deep-seated hatred” for the plaintiff after the plaintiff commenced legal actions against him and Dynasty in Hong Kong, resulting in a worldwide Mareva injunction being ordered against him; (ii) the defendant wanted to exact revenge by stopping the IPO or preventing the plaintiff from selling his shares in the IPO, outcomes which could not have been of any legitimate consequence to him; and (iii) the defendant made the Indonesian Publications despite knowing that they contained false claims. 69     It is clear from the authorities that in order to defeat the defence of qualified privilege, it is not enough to show that the defendant disliked the plaintiff and knew that the defamatory statement would injure the plaintiff. In this regard, I refer to observations Lord Diplock’s observations inHorrocks, where he held (at 149): So the motive with which the defendant on a privileged occasion made a statement defamatory of the plaintiff becomes crucial. The protection might, however, be illusory if the onus lay on him to prove that he was actuated solely by a sense of the relevant duty or a desire to protect the relevant interest. So he is entitled to be protected by the privilege unless some other dominant and improper motive on his part is proved. “Express malice” is the term of act descriptive of such a motive. Broadly speaking it means malice in the popular sense of a desire to injure the person who is defamed and this is generally the motive which the plaintiff sets out to prove.But to destroy the privilege the desire to injure must be the dominant motive for the defamatory publication; knowledge that it will have that effect is not enough if the defendant is nevertheless acting in accordance with a sense of duty or in bona fide protection of his own legitimate interests. [emphasis added] Lord Diplock continued (at 150-151) to hold: Judges and juries should, however, be very slow to draw the inference that a defendant was so far actuated by improper motives as to deprive him of the protection of the privilege unless they are satisfied that he did not believe that what he said or wrote was true or that he was indifferent to its truth or falsity.The motives with which human beings act are mixed. They find it difficult to hate the sin but love the sinner. Qualified privilege would be illusory, and the public interest that it is meant to serve defeated, if the protection which it affords were lost merely because a person, although acting in compliance with a duty or in protection of a legitimate interest, disliked the person whom he defamed or was indignant at what he believed to be that person’s conduct and welcomed the opportunity of exposing it.It is only where his desire to comply with the relevant duty or to protect the relevant interest plays no significant part in his motives for publishing what he believes to be true that “express malice” can properly be found. [emphasis added] 70     I have found that the defendant believed his claim was true at [66] above. I am unable to accept that stopping Bayan Resources’ IPO and preventing the plaintiff from selling his shares in the IPO are outcomes which could not have been of any legitimate consequence to the defendant. Since his claim is for 50% of Bayan Resources’ shares, he had every reason to want to preserve thestatus quountil his claims were resolved by agreement or by the courts. The text of the 3rdLetter was a request to BAPEPAM to suspend the IPO because of the legal dispute between the defendant and the plaintiff relating to the Bayan Resources shares. Further, while the defendant has not been able to adduce evidence in this court to prove the Common Understanding, this alone cannot warrant any adverse inference that he knew that the Indonesian Publications contained false claims. That the claims in the Indonesian Publications were false have to be independently provided in this court and they have not been proven. For the above reasons, I find that the plaintiff has been unable to prove malice that would defeat the defence of qualified privilege. 71     Finally, I turn to the question of whether the defendant can raise the defence of qualified privilege in respect of the Indonesian Republications and Singapore Republications. The defendant argues that it can and relies on the following passage inGatleyat (para 6.43): If D, without malice, makes a statement to X on a privileged occasion and X repeats the statement to Y, again on a privileged occasion, D has a defence in respect of both the original publication and the republication. ... If the statement by D to X was not on a privileged occasion but the republication by X was, D is obviously liable in respect of the publication to X, but what is his position in respect of the republication by X? The difficulty is that if D is to be treated as a publisher on the occasion of the republication there is simply no wrong on that occasion. 72     It is the plaintiff’s own case that the plaintiff, Bayan Resources and the IPO Advisors had a legal duty to disclose the defendant’s claim to BAPEPAM and to the investing public through the IPO documents as well as the news media. I would add that this is because BAPEPAM and the potential IPO share purchasers each had an interest to receive information about the claim. In terms of the republications between the plaintiff, Bayan Resources and the IPO Advisors, the duty-interest test is similarly satisfied: the republisher had an interest to make the republication and the recipient to whom the republication was made had an interest to receive it. For these reasons, I find the Indonesian Republications and Singapore Republications each to have been made on occasions of qualified privilege. The defence of qualified privilege therefore applies to the Indonesian Publications, Indonesian Republications and Singapore Republications.",
        "Whether there is a defence under Indonesian law for the Indonesian Publications and Indonesian Republications": "73     The defendant relies on the public interest defence and the necessary defence set out in article 1376 of the ICC. The agreed translation of this provision states as follows: The civil claim concerning affront cannot be granted if the intention to affront is not proven. The intention to affront is deemed not to exist if the doer/offender obviously did so for the sake of public interest or for his necessary defence. Public interest defence 74     On the public interest defence, Dr Winarta refers to the following passage from Satrio’s Opinion at 91 (English translation provided by the plaintiff): What is certain is that public interest is not for the interest of the statement giver himself, but should always be related to other person’s interest, even though it may be also included within it (together with) the interest of the statement giver himself. 75     During the trial, Dr Winarta and Dr Hasibuan agreed that where the statement in question was made for both the defendant’s personal interest and the public interest, the public interest element must have been greater than the private interest element in order for the defence to succeed. They also agreed that for the defence to succeed, the statement must be true. Since the defendant has not been able to prove in this court that the content of the Indonesian Publications, Indonesian Republications and Singapore Republications are true (see above at [52]), the public interest defence  under Indonesian law appears to be unavailable. Necessary defence 76     For the necessary defence to be established, Dr Winarta is of the opinion that the statement in question must be (i) true; (ii) said in good faith; (iii) in proportion to the circumstances; and (iv) made in court proceedings. Although Dr Hasibuan opines that the necessary defence applies in this case, he gave evidence during trial that in his thirty years of experience, he did not know of any textbook or Supreme Court decision which says that the necessary defence applies outside of court proceedings. Since the Indonesian Publications, Indonesian Republications and Singapore Republications were made outside of court proceedings, and also because the defendant has been unable to prove the truth of the content of the Indonesian Publications, Indonesian Republications and Singapore Republications (see above at [52]), the necessary defence appears to be unavailable.",
        "Whether the reliefs claimed are available under Singapore law and Indonesian law": "77     Although I have found that the defence of qualified privilege has been made out in respect of the Indonesian Publications, Indonesian Republications and Singapore Republications, I will, for completeness, examine whether the reliefs claimed by the plaintiff are available under Singapore law and Indonesian law. The plaintiff is claiming the following reliefs: (a)     general damages, including damages for loss of opportunity and aggravated damages; (b)     special damages (with interest and damages for currency exchange loss); and (c)     an injunction to restrain the defendant, whether by himself, his servants, agents or otherwise howsoever, from publishing or causing to be published the same or similar words defamatory of the plaintiff in any manner whatsoever. 78     The plaintiff must prove that the types of reliefs that he is seeking for the Indonesian Publications and Indonesian Republications are available under both Indonesian law and Singapore law. The plaintiff must also prove that the reliefs that he is seeking to claim for the Singapore Republications are available under Singapore law. Singapore law 79     Under Singapore law, a person who has been defamed can claim general damages as compensation for the effects of the defamation. InArul Chandran, the Court of Appeal explained that (at [53]): General damages serve three functions. Firstly, they act as a consolation to the plaintiff for the distress he suffered from the publication of the statement. Secondly, they repair the harm to his reputation. Thirdly, they serve to vindicate his reputation ... InMcCarey v Associated Newspapers Ltd(No. 2) [1965] 2 Q.B. 86 at para 104, the Court held that “compensatory damages may include not only pecuniary loss and anticipated pecuniary loss or any social disadvantages which result, or may be thought likely to result, from the wrong which has been done”. It was noted inGatleyat para 9.2 that while actual financial loss which is not too remote is recoverable, it is “a comparatively rare case in which evidence of such loss is given, simply because it is not available”. Accordingly, a plaintiff in a defamation action may recover general damages for financial loss that he is able to prove flowed from the defamation. 80     Under Singapore law, aggravated damages are a component of general compensatory damages (seeGohChok Tong v Jeyaretnam Joshua Benjamin[1998] 2 SLR(R) 971 at [51]) and are available as a remedy for defamation. The factors that the courts consider in determining damages, including whether aggravated damages are justified, are as follows (seeHalsbury’s Laws of Singapore(volume 18) (LexisNexis, 2012 Reissue) (“Halsbury’s Laws of Singapore”) at [240.194]): (1)the nature and gravity of the defamatory statement itself; (2)the conduct, position and standing of the plaintiff and the defendant; (3)the mode and extent of publication; (4)the natural indignation of the court at the injury caused to the plaintiff; (5)the conduct of the defendant from the time the libel is published to the very moment of the verdict; (6)whether the defendant has apologised for and retracted the defamatory statement; and (7)the motives of the defendant in making the defamatory  statement, in particular, whether the plaintiff acted with malice. In this case, even if liability for defamation were to have been made out, I find that no aggravated damages would be warranted. The Indonesian Publications were made to a limited audience of Bayan Resources, the necessary regulators and the IPO Advisors, and the republications were necessitated by applicable disclosure laws. Given that there remained a dispute between the parties relating to the Common Understanding, no natural indignation of the court at the injury caused to the plaintiff arises. Finally the conduct of the defendant from the time of the Indonesian Publications to this action is consistent with his belief that he has a claim though he has not been able to prove this claim on the basis of evidence adduced in this court. Whilst the parties are currently bitter enemies, the plaintiff has not proved that the defendant made the Indonesian Publications with malice devoid of any interest or that they contained false claims. 81     Special damages may also be awarded in an action for defamation. Thus,Halsbury’s Laws of Singaporestates (at [240.205]): Special damages... may be awarded in respect of any material temporal injury proved to have been suffered as the natural, and not unduly remote, consequence of the defamatory publication complained of. It is the loss of some material temporal advantage, pecuniary or capable of being estimated in money, which flows directly and in the ordinary course of things from the act of the defendant or an act for which he is responsible.... The defendant does not dispute that special damages are available under Singapore law. He argues, however, that he did not cause the loss for which the plaintiff claims special damages. This is an issue for the assessment of damages stage of the proceedings. 82     Finally, under Singapore law, a court which has found a defendant liable for defamation has jurisdiction to grant an injunction restraining “any repetition of the slander or of similar imputations” (Lee Kuan Yew v Jeyaretnam Joshua Benjamin[1990] 1 SLR(R) 709 at [61];Arul Chandran v Chew Chin Aik Victor JP(Suit No 1896 of 1998) at [331]). The court will grant such an injunction if it is satisfied that the words are injurious to the plaintiff and there is reason to apprehend further publication by the defendant (Gatleyat [9.28]). The defendant does not dispute that an injunction is a relief that the plaintiff may claim under Singapore law. In this case, I see no grounds for the issue of an injunction as there is no evidence before me as would give rise to an apprehension of further publication of the claims in the Indonesian Publications by the defendant. Indonesian law 83     According to Dr Winarta, a plaintiff in an article 1372 of the ICC action can claim for (i) compensation of damages and (ii) payment of money to reinstate his honour and good name. In his opinion, “compensation of damages” in article 1372 of the ICC is the equivalent of the material damages that are recoverable under article 1365 of the ICC whereas “recovery of honour and good name” in article 1372 of the ICC is the equivalent of the immaterial damages that are recoverable under article 1365 of the ICC. In respect of material damages, a plaintiff may recover actual loss suffered and expected loss of income or profit. A plaintiff may also recover “cost, loss and interest” under articles 1243-1252 of the ICC (which deal with breach of contract claims but which, in his opinion can be applied by analogy to claims under article 1365 of the ICC). In respect of damages of a non-material nature, a plaintiff may recover damages for,eg, pain, shame, stress, and having his good name ruined. 84     Dr Hasibuan’s disagrees, and opines that a plaintiff in an article 1372 of the ICC action may make the following claims: (a)     a claim for material lossdue to the damage to his reputation and honour; (b)     a claim for his honour and reputation to be restored; and (c)     a claim for it to be mentioned in the judge’s decision that the action complained of is an insult. Dr Hasibuan explains that the reason for the limitation in limb (a) above is because of the second sentence in article 1372 of the ICC which directs the judge to “consider the gravity of the affront, the rank, the position and the capacity of both parties and the circumstances”. 85     As I have made a finding of fact that under current Indonesian law, a claim in defamation/”affront” can only be brought under article 1372 of the ICC (see above at [31]), the plaintiff can only claim, in respect of the Indonesian Publications and Indonesian Republications, the remedies available in an article 1372 action. I am unable to conclude that the remedies available in an article 1372 action extend to those available under article 1365 of the ICC and articles 1243-1352 of the ICC, as proposed by Dr Winarta. I accept Dr Hasibuan’s opinion that in an article 1372 action, damages are claimable for material loss only to the extent that such loss is due to the damage to the plaintiff’s reputation and honour. 86     I accept Dr Winarta’s opinion that a judge hearing an article 1372 of the ICC action may take into account the relevant circumstances set out in article 1372, including the aggravating and mitigating circumstances. Thus, what is termed “aggravated damages” under Singapore law is available under Indonesian law in an article 1372 action. Dr Winarta further opines that under Indonesian law, the Indonesian courts can grant an injunction to compel a defendant to do an act. The defendant does not dispute this. I therefore accept that an injunction is an available remedy under Indonesian law. 87     In summary, damages for loss of opportunity may be recoverable under Singapore law and under Indonesian law but only to the extent that it is due to the damage to the plaintiff’s reputation and honour. While aggravated damages and injunctions are available remedies under Singapore law and Indonesian law, they are not warranted in this case under Singapore law.",
        "Malicious falsehood": "88     I turn next to the plaintiff’s claim in malicious falsehood. The plaintiff’s case is that the Indonesian Publications are a malicious falsehood. The plaintiff must thus prove that there was a malicious falsehood under Singapore law and that the acts complained of are also actionable under Indonesian law.",
        "Singapore law": "89     The elements of the tort of malicious falsehood are as follows (seeWBG Network (Singapore) Pte Ltd v Meridian Life International Pte Ltd and others[2008] SGHC 114): (a)     the defendant published to third parties words which are false; (b)     the words refer to the claimant or his property or his business; (c)     the words were published maliciously; and (d)     special damage has followed as a direct and natural result of their publication. 90     InThe Law of Torts in Singapore, the learned authors explain the meaning of “malice” in the following way (at 14.041): The meaning of malice in the context of malicious falsehood is similar to that for malice sufficient to defeat the defence of qualified privilege in defamation... That is, the defendant would be regarded as having acted with malice if he or she: (a)    was actuated by an improper or ulterior motive; or (b)    did not honestly believe that the statement was trueorwas reckless as to the truth of the statements. 91     The element of “malice” is explained byGatleyat para 21.7 as follows: There is no liability in malicious falsehood for a statement published in good faith. ... Mere negligence is not malice .... A statement false in fact and calculated to produce actual damage will therefore not support [an action in malicious falsehood] if it was made in the belief, even a careless belief, that it was true. The defendant may have acted stupidly in asserting a right, yet if he bona fide believed such right to exist, no action lies. 92     In this case, the plaintiff has not proven on the evidence that the claims in the Indonesian Publications are false, just as the defendant has not proven on the evidence that they are true (see above at [52]). I have also found, in respect of the plaintiff’s claim in defamation, that the defence of qualified privilege has been made out and not defeated by reason of malice (see above at [68]–[70]). Accordingly, the plaintiff’s claim in malicious falsehood has not been made out.",
        "Indonesian law": "93     Since I have found that the plaintiff’s claim in malicious falsehood has not been made out under Singapore law, it is not necessary to consider if the acts complained of are actionable under Indonesian law.",
        "Counterclaims: breach of contract, proprietary estoppel, constructive trust, breach of fiduciary duty and money had and received": "94     As the defendant has acknowledged, all of his counterclaims turn on the existence of the Common Understanding. Since he has not, on the evidence before me, been able to prove the Common Understanding (see above at [52]), his counterclaims in breach of contract, proprietary estoppel, constructive trust, breach of fiduciary duty and money had and received have not be made out.",
        "Conclusion": "95     In summary, the plaintiff’s claim in defamation cannot succeed because the defence of qualified privilege extends to the Indonesian Publications, Indonesian Republications and Singapore Republications. The plaintiff has not been able to prove the malice and falsehood required to establish a claim in malicious falsehood. The defendant, by not being able to prove the Common Understanding, is unable to establish his counterclaims in breach of contract, proprietary estoppel, constructive trust, breach of fiduciary duty and money had and received. 96     I would place on record my appreciation to the Indonesian law experts, Dr Winarta, Dr Hasibuan and Professor Pramono for their patient and painstaking clarification and explanations of their opinions on Indonesian law. 97     Costs are to follow the event. They are to be agreed or taxed."
    }
}