{
    "case_title": "Khoh Chen Yeh Shane (administrator of the estate of Ching Kwong Kuen,\n                deceased)\n      v\n      Seng Realty & Development Pte Ltd and another",
    "ncitation": "[2012] SGHC 79",
    "coram": "Judith Prakash J",
    "sections": {
        "Introduction": "1       The plaintiff is the sole administrator of the\n                    estate of Ching Kwong Kuen, deceased (“KK Ching”). He\n                    brought this originating summons against two companies, the first defendant,\n                    Seng Realty & Development Pte Ltd (“Seng Realty”) and the\n                    second defendant, National Aerated Water Company Pte Ltd (“National\n                    Aerated”), to obtain orders to compel the directors of both defendants to\n                    register certain share transfers that had been executed in his favour. I heard\n                    the application and on 14 March 2011, I dismissed the application in respect of\n                    National Aerated. Subsequently, I acceded to the plaintiff’s request for\n                    further arguments. The further arguments were heard in April 2011. After taking\n                    time for consideration, on 12 September 2011, I decided that the original\n                    decision was correct and should be maintained. The plaintiff has\n                    appealed.",
        "Facts": "2       This case arose as a consequence of the decision\n                    inChing Chew Weng Paul v Ching Pui Sim and others[2010] 2 SLR 76 (“Ching v Ching”).\n                    The background facts are clearly set out in the judgment of Steven Chong JC\n                    from [5] to [14]. 3       In brief, KK Ching had created trusts of certain\n                    shares and assets. His youngest son, Paul Ching Chew Weng (“Paul\n                    Ching”) claimed to be either the beneficiary of those trusts or the\n                    beneficiary of KK Ching’s estate (“the estate”) and in those\n                    capacities, commencedChing v Chingto recover the\n                    shares and assets. One of the defendants in that action, Ching Pui Sim\n                    (“Ms Ching”), held 765,000 shares in Seng Realty (“the\n                    Seng Shares”) and 72,270 shares in National Aerated (“the National\n                    Shares”). 4       Paul Ching was successful in his action in his\n                    capacity of beneficiary of his father’s estate and Steven Chong JC\n                    ordered,inter alia, that Ms Ching should\n                    transfer the Seng Shares and the National Shares to the estate. Pursuant to the\n                    judgment, Ms Ching executed the transfer of the Seng Shares on 3 March 2010\n                    and that of the National Shares on 30 June 2010. Both transfers were in favour\n                    of the plaintiff as the executor of the estate. 5       Subsequently, the plaintiff’s solicitors\n                    wrote to the first and second defendants requesting them to register the\n                    transfers of the Seng Shares and National Shares respectively and deliver the\n                    new share certificates to the plaintiff as executor of the estate, as required\n                    under s 130 of the Companies Act (Cap. 50, 2006 Rev Ed) (“the\n                    Act”). The first and second defendants refused to do as\n                requested. 6       The plaintiff then brought this action to compel\n                    the defendants to register the said transfers and deliver the said share\n                    certificates. In my judgment on 14 March 2010, I granted the plaintiff’s\n                    first prayer,iethat Seng Realty be ordered\n                    to register the transfer of the Seng Shares and deliver the new share\n                    certificates to the plaintiff. 7       However, I dismissed the plaintiff’s\n                    second prayer,iethat National Aerated be ordered\n                    to register the transfer of the National Shares and deliver the new share\n                    certificates to the plaintiff. I so decided on the basis that the pre-emption\n                    clauses in Arts 30 to 33 of National Aerated’s articles of association\n                    (“the National pre-emption clauses”) were applicable and\n                    Ms Ching had to offer the National Shares to the existing members of\n                    National Aerated before she could transfer them to the estate.",
        "Issues": "8       The essential question before me was whether or\n                    not the National pre-emption clauses applied such that Ms Ching was obliged\n                    to offer the National Shares to the existing members of National Aerated before\n                    she could transfer the National Shares to the estate. The National pre-emption\n                    clauses are set out in full below: 30.    A share may be transferred by a member or other\n                            person entitled to transfer to any member, but save as aforesaid and\n                            save as provided by articles 33 and 34 hereof, no share shall be\n                            transferred to a person, who is not a member, so long as any member is\n                            willing to purchase the same at fair value. 31.    Except where the transfer is made to a member or\n                            pursuant to articles 33 and 34 hereof, the persons proposing to transfer\n                            any share (hereinafter called the proposing transferor) shall give\n                            notice in writing (hereinafter called the transfer notice) to the\n                            Company that he desires to transfer the same. Such notice shall specify\n                            the sum he fixes as the fair value, and shall constitute the Company his\n                            agent for the sale of the share to any member of the Company at the\n                            price so fixed, or at the option of the purchaser, at the fair value to\n                            be fixed by two arbitrators, both of whom shall be members of the\n                            Company, one to be appointed by each of the parties in\n                            difference. The transfer notice shall not be revocable except with the sanction of the\n                        Directors. 32.    If the Company shall within the space of 14 days\n                            after being served with such notice find a member (hereinafter called\n                            the purchasing member) willing to purchase the share and shall give\n                            notice to the proposing transferor, he shall be bound upon payment of\n                            fair value, to transfer to the purchasing member. 33.    If the Company shall not within the space of 14\n                            days aforesaid find a member willing to purchase the share and give\n                            notice in manner aforesaid, the proposing transferor shall at any time\n                            within 2 months afterwards be at liberty to sell and transfer the share\n                            to any person at any price. 9       Art 8 of National Aerated’s articles of\n                    association (“the Non-Recognition of Trusts Clause”) reads as\n                    follows: Subject to the provisions of these presents the Company shall not be bound\n                        by or recognise any contingent, future, partial or equitable interest in the\n                        nature of a trust or otherwise in any share or any interest in any\n                        fractional part of a share, or any other right in respect of any share,\n                        except an absolute right thereto in the person for the time being registered\n                        as the owners [sic] thereof.",
        "Parties’ submissions": "10     The plaintiff argued that the National\n                    pre-emption clauses did not apply because: (a)     The term “any transfer of\n                        shares” as used in the National pre-emption clauses refers to a\n                        transfer ofbothlegal and beneficial\n                        interests (and the transfer here was a transfer of legal title only);\n                        and (b)     The\n                        National pre-emption clauses were not intended to apply to the situation\n                        where a bare trustee was returning shares to the beneficial owner of the\n                        same. 11     I rejected both arguments and my reasons for\n                    doing so are set out below.",
        "Analysis": "",
        "Applicability of pre-emption clauses to transfers of legal\n                title": "12     The Court of Appeal case ofSing Eng (Pte) Ltd v PIC Property Ltd[1990] 1 SLR(R) 792\n                        (“Sing Eng”), is one of the few\n                    Singapore cases that deal with pre-emption rights with regard to share\n                    transfers. InSing Eng, MM and MK, shareholders in\n                    the appellant company, Sing Eng, had charged all their shares to the Xiamen\n                    International Bank (“XIB”) under an equitable mortgage. When MM\n                    and MK defaulted on their obligations, XIB entered into an agreement to sell the\n                    mortgaged shares to the respondent. The question was whether or not the\n                    attempted sale and transfer was caught by the pre-emption clauses in Sing\n                    Eng’s articles of association. The pre-emption clauses in that case, Arts\n                    33 and 34, read (Sing Engat[20]): 33    A share may be transferred by a member or other\n                            person entitled to transfer (hereinafter called ‘the\n                            transferor’) to any member selected by the transferor; but no\n                            share shall be transferred to a person who is not a member so long as\n                            any member (or any person selected by the directors as one whom it is\n                            desirable in the interests of the company to admit to membership) is\n                            willing to purchase the same at the fair value. 34    Except where the transfer is made pursuant to arts\n                            33, 36 and 43 hereof, a person proposing to transfer any share\n                            (hereinafter called the proposing transferor) shall give notice in\n                            writing (hereinafter called the transfer notice) to the company that he\n                            desires to transfer the same. Such notice shall specify the sum he fixes\n                            as the fair value, and shall constitute the company his agent for the\n                            sale of the share to any member of the company at the price so fixed or\n                            at the option of the purchaser, at the fair value to be fixed by the\n                            auditors of the company. The transfer notice shall not be revocable\n                            except with the sanction of the directors. The pre-emption clauses in Sing Eng’s articles of\n                    association are almost identical to National’s pre-emption\n                clauses. 13     The Court of Appeal inSing\n                        Engheld that the transfer of shares was ineffectual because XIB\n                    was not even a “person entitled to transfer” the shares under Art\n                    33 of Sing Eng’s articles of association. The Court held, at [25] and [27], that: The word “transfer” in Art 33, in our\n                            opinion, means a transfer of a share or shares and a transfer of [a]\n                            share or shares means a transfer of the legal title to the share or\n                            shares… It is common ground that XIB is an equitable mortgagee of the shares in\n                        question, and as such it does not have any legal title to the shares; the\n                        legal titles to the shares remain vested in [MM] and [MK] respectively. This\n                        being the position, clearly XIB is not a person entitled to transfer the\n                        shares. [emphasis added] 14     In reaching its conclusion, the Court found\n                    support in the case ofSafeguard Industrial Investments Ltd v\n                        National Westminster Bank[1981] 1 WLR 286 (“Safeguard (HC)”), a decision of Vinelott J in the\n                    English High Court, as well as in the Court of Appeal decision (affirming the\n                    trial judge’s decision) inSafeguard Industrial\n                        Investments Ltd v National Westminster Bank[1982] 1 WLR 589\n                        (“Safeguard (CA)”) (together,\n                    “theSafeguardcases”). 15     In theSafeguardcases, the original holder (“P”) of a block of shares in a company\n                    passed away. Upon his death, title to the shares vested in the executors of his\n                    will, National Westminster Bank (“the defendant bank”). By his\n                    will, P had left the beneficial interest in his shares to two beneficiaries. The\n                    pre-emption clauses in the company’s articles of association,\n                    Arts 7(B)(a) and (b), read as follows (Safeguard\n                        (HC)at 290 - 291): (a)    An ordinary share may be transferred by a member\n                            or other person entitled to transfer to the other members in the\n                            proportions between them (if more than one) as nearly as may be to the\n                            number of ordinary shares held by them respectively, but no ordinary\n                            share shall be transferred to a person who is not a member as long as\n                            any member is willing to purchase the same at the fair\n                        value. (b)    Except where the transfer is made pursuant to\n                            article 8 hereof, in order to ascertain whether any member is willing to\n                            purchase any ordinary share, the proposing transferor shall give notice\n                            in writing (hereinafter called the transfer notice) to the company that\n                            he desires to transfer the same. Such notice shall specify the sum he\n                            fixes as the fair value, and shall constitute the company his agent for\n                            the sale of the share to any member of the company at the price so fixed\n                            or at the option of the purchaser, at the fair value to be fixed by the\n                            auditors of the company. The transfer notice shall not be revocable\n                            except with the sanction of the directors. 16     The question before the court was whether or\n                    not Arts 7B(a) and (b) applied to the transfer of the beneficial interest by P\n                    to his beneficiaries. Vinelott J held that they did not, since the word\n                    “transfer” in Arts 7B(a) and (b) referred to a transfer of the\n                    legal interest in the shares and not a transfer of the beneficial interest. At\n                    297 – 298, the judge stated: Although it may seem at first sight unduly restrictive to read the word\n                        ‘transfer’ as referring only to a transfer of the legal interest\n                        in a share leaving, as Lord Sorn put it, the ‘obvious manoeuvre’\n                        of a sale of the beneficial interest unprohibited, Art 7 seems to me wholly\n                        inapt to ‘catch’ transfers of beneficial interests.A ‘transfer of a share’ in the ordinary sense of\n                            that expression is a transfer of the legal title to the share with the\n                            rights and liabilities attaching to it; on registration of the transfer\n                            the transferor ceases to be, and the transferee becomes, a member of the\n                            company in right of that share.A member who desires to\n                        transfer a share will carry his intention into effect by executing a\n                        transfer and lodging it for registration. At that stage the restrictions in\n                        the pre-emption provisions come into operation.To treat\n                            the references to the transfer of a share as comprehending a transfer or\n                            disposition of a beneficial interest in a share is to give the\n                            expression ‘transfer of a share’ a meaning wider than it\n                            would ordinarily bear. [emphasis added] 17     In the Court of Appeal, Oliver LJ (with whom\n                    the other Lord Justices agreed unreservedly) endorsed Vinelott J’s\n                    analysis of this issue (Safeguard (CA)at\n                    599). 18     Considering the near-identical phraseology of\n                    the pre-emption clauses inSing Eng, theSafeguardcases and the National pre-emption clauses, I\n                    could not find any reason for construing the National pre-emption clauses in a\n                    different manner. I found that the word “transfer” in the National\n                    pre-emption clauses referred to transfers of legal title in the National Shares.\n                    I was fortified in my decision by the existence of the Non-Recognition of Trusts\n                    Clause, which provides that National Aerated “shall not be bound by or\n                    recognise any ... interest in the nature of a trust ... in any share ... except\n                    an absolute right thereto in the person for the time being registered as the\n                    owners thereof”. National Aerated was not concerned as to whether or not\n                    the beneficial interest in the National Shares was being transferred (and,\n                    consequently, whether or not the transfer was ofboth legal\n                        and beneficial interest). Indeed, it was obliged to take notice\n                    only of persons “registered” as having legal title to the National\n                    Shares. Therefore, once there was a transfer or intended transfer of legal title\n                    in the National Shares, the National pre-emption clauses would\n                apply. 19     The plaintiff, however, citing two New Zealand\n                    cases,Ord v Calan Healthcare Properties Ltd[2005] 2 NZLR 96 (“Ord”) andParkinson & Parkinson v James Products Ltd and\n                        another(HC AK CIV 2008-404-0033098) [3 September 2008]\n                        (“Parkinson”), suggested that\n                    the word “transfer” should refer only to a transfer ofboththe legal and beneficial interests in\n                    shares. 20     InOrd, the\n                    appellant held the beneficial interest in shares in the respondent company, and\n                    the said shares were held on trust for the appellant by one Mr Akehurst.\n                    The appellant sought to replace Mr Akehurst with a new trustee,iehe sought to transfer the legal title in the shares\n                    from Mr Akehurst to the new trustee. The question was whether or not the\n                    pre-emption clauses applied. The New Zealand Court of Appeal held that they did\n                    not, because the pre-emption clauses were “not a good fit for the changes\n                    of trustee which have occurred in relation to the [trust vehicle]” (at\n                    [40]). This decision was based on an interpretation of the pre-emption clause in\n                    question. The clause read as follows (at [14]): '8.4 A shareholder intending to transfer any shares (‘the\n                        Transferor’) must give a transfer notice in writing to the Board. The\n                        transfer notice shall state the number, class andasking\n                            price of the shares to be offered for sale. The transfer\n                        notice shall constitute the Board the Transferor's agent (to the exclusion\n                        of the Transferor)for the sale of the\n                            shares. [emphasis added] 21     The pre-emption clause inOrdwas phrased very differently from the National pre-emption\n                    clauses. The former required the transfer notice to provide for the number,\n                    class and asking price of the shares “to be offered\n                        for sale”. Clearly, as a matter of contractual\n                    interpretation, the clause was meant to apply in the context ofsalesof the shares only. Indeed, the New Zealand Court\n                    of Appeal recognized this when it held at [39]: The paradigm case envisaged by cl 8.4 involves a sale. Clause 8.4 makes\n                        this clear by reference to the words '”asking price of the shares to\n                        be offered for sale” and the constitution of the board as the\n                        transferor's agent “for the sale of the shares'”. The\n                        stipulation of an asking price is very significant. 22     The facts ofOrdwere also quite different from that of the case before me in that it was clear\n                    that the pre-emption provisions there were tailored to meet the specific needs\n                    of the parties. At the time the company’s articles were adopted, the\n                    appellant’s shares were already held by a trust and the pre-emption\n                    clauses were drafted with these in mind. Cl 8.5 specifically exempted the\n                    pre-emption clauses from transfers associated with the death or bankruptcy of\n                    the appellant or any person with whom the appellant was registered as a joint\n                    holder. The court found that if the appellant had realised that a change in\n                    trustee would have triggered pre-emption rights, the parties would have agreed\n                    to a carve-out in respect of changes of trustee. This indicated to the court\n                    that “it was regarded on all sides as so obvious that the [pre-emption\n                    clause] did not apply to mere changes of trustee that no such carve-out was\n                    required” (at [44]). 23     There is no overt reference to a\n                    “sale” of shares in the National pre-emption clauses and there is\n                    nothing to suggest that they should be interpreted as applying only in the\n                    context of a sale of shares. Unlike inOrd, there\n                    was no evidence that the articles were adopted to cater for the needs of\n                    shareholders who were holding their shares through trustees. I therefore found\n                    thatOrdwas distinguishable from the case at hand\n                    and did not assist the plaintiff. 24     The next case,Parkinson, had a pre-emption clause that provided (at [12]): 12.    No share in the capital of the company shall be\n                            sold or transferred by any shareholder unless and until the rights of\n                            pre-emption hereinafter conferred have been exhausted. 25     Like the court inOrd, the New Zealand High Court inParkinsonheld that the pre-emption clause applied only in the\n                    context of sales of shares. The reasoning of the Court from [47] to [48] also\n                    reveals the language of the pre-emption clauses: That conclusion is reinforced by the wording of subclauses 12.3 to 12.5.\n                        Notwithstanding that clause 12.3 requires a shareholder wanting to\n                        “sell or transfer” shares to give notice of the desire to do\n                        so,the subclause goes on to refer only to the“sale” of shares, “at\n                            a price to be agreed upon” or “at a fair price to be\n                            determined.” Subclause 12.4 sets out the procedure to be followed once the\n                        “price” has been agreed to determined. The procedure includes\n                        giving shareholders the opportunity of giving notice of a desire to\n                        “purchase” shares, the apportionment of shares to be\n                        “sold”, and the payment of the purchase money. Subclause 12.5\n                        sets out what is to occur if shares are not “sold” pursuant to\n                        subclause 12.4. [emphasis added] 26     Thus, the pre-emption clause inParkinsonalso made almost exclusive references to\n                    “sales”, phraseology that was significantly different from the\n                    National pre-emption clauses.Parkinsonwas, likeOrd, distinguishable from the case at hand. It\n                    was another case where there was a trustee from the inception, the difference\n                    between it andOrdbeing that inParkinson, the beneficial owners wanted the shares\n                    transferred to themselves by the trustee rather than to a different trustee. The\n                    facts here are quite different. KK Ching had ceased to be a shareholder in\n                    National Aerated decades ago and by the time the order for the shares to be\n                    transferred to his estate was made, as a result of the deaths of KK Ching\n                    and Paul Ching himself, the ultimate beneficial interest in the shares was\n                    vested in a third party who had nothing to do with National Aerated at all. This\n                    was not a situation of a bare trustee stepping aside in favour of the person who\n                    had been the beneficial shareholder all along to the knowledge of the\n                    company. 27     As to any suggestion thatOrdandParkinsonstand for a\n                    general proposition that pre-emption clauses must apply only to transfers of\n                    both legal and beneficial interest, I disagree and would defer to the position\n                    stated inSing Eng(which, in any event, is\n                    binding on me) and theSafeguardcases.",
        "Applicability of pre-emption clauses to return of shares from trustee\n                to beneficiary": "28     The other limb of the plaintiff’s\n                    argument was that the National pre-emption clauses were not meant to apply to\n                    the return of shares from bare trustees to beneficiaries, which was the\n                    relationship between Ms Ching and the plaintiff. The plaintiff suggested\n                    that there was a distinction between cases where “a party is voluntarily\n                    purporting to transfer shares (egpursuant to a\n                    sale or gift), and when a party involuntarily comes under an obligation”\n                    to transfer shares. The plaintiff sought to rely onSafeguard\n                        (CA)as authority for that argument. 29     The facts of theSafeguardcases have been set out above at[15]. The appellants before the Court of Appeal\n                    canvassed the alternative argument that the defendant bank (holder of the legal\n                    title to the shares) was bound to serve a transfer notice to the existing\n                    members because it was a “proposing transferor” under Art 7B(b),\n                    the pre-emption clause in that case. The court was requested to find that the\n                    defendant bank was a “proposing transferor” even though\n                    “the beneficiaries disclaim any desire to exercise their right to compel\n                    a transfer to them” (Safeguard (CA)at\n                    596). The English Court of Appeal rejected that argument. Oliver LJ\n                    distinguished the case ofLyle & Scott Ltd v\n                        Scott’s Trustees[1959] AC 763 (“Lyle”), where members of the company had voluntarily\n                    entered into contracts with a stranger for the sale to him of their shares.\n                    Viscount Simonds inLylestated at 774 that\n                    “it is not open to a shareholder, who has agreed to do a certain thing\n                    and is bound to do it, to deny that he is desirous of doing it”. Oliver\n                    LJ inSafeguard (CA)found that the principle inLylewas not applicable to the case before\n                    him, where the trustees had an involuntary obligation to transfer the legal\n                    title in their shares, because that would mean that “duty equals\n                    desire” (Safeguard (CA)at 597). Oliver LJ\n                    concluded at 599: I find myself quite unable to construe the article in the instant case in\n                        a way which would make a person who involuntarily comes under an obligation\n                        to transfer, if called upon, a “proposing transferor.” 30     The plaintiff sought to rely on Oliver\n                    LJ’s judgment to suggest that Ms Ching was similarly not a\n                    “proposing transferor” under Art 31 of the National pre-emption\n                    clauses. I was not persuaded by that argument. Clearly, the facts ofSafeguard (CA)were distinguishable from those presented\n                    before me. InSafeguard (CA), the beneficiaries\n                    had disclaimed any desire to exercise their right to compel any transfer of the\n                    legal title to them. This was clearly the premise upon which Oliver LJ founded\n                    his decision – the trustees had alatent\n                        obligationto transfer shares if called upon, but they could not\n                    be considered “proposing transferors” so long as the beneficiaries\n                    did not exercise their right to compel a transfer of the shares. In the case\n                    before me, the plaintiff had clearly sought to compel a transfer of the National\n                    Shares from Ms Ching to the estate, pursuant to Chong JC’s decision\n                    inChing v Ching. The latent obligation was\n                    triggered and Ms Ching, by executing the transfers of the National Shares,\n                    was clearly a “proposing transferor” under Art 31 of the National\n                    pre-emption clauses. 31     The plaintiff also canvassed an argument to\n                    the effect that the fundamental objective of the National pre-emption clauses\n                    was to keep the ownership of the shares with members of the same family or of\n                    the families who originally agreed to associate themselves in that way. The\n                    plaintiff relied onGuan Soon Development Pte Ltd v Yeo Gek\n                        Lang Susie (administratrix of the estate of Teo Lay Swee, deceased) and\n                        others[2006] 3 SLR(R) 387 (“Guan\n                        Soon”). This case did not help the plaintiff, however,\n                    because the Court of Appeal inGuan Soonwas\n                    interpreting a wholly different clause. That clause provided that pre-emption\n                    clauses would not apply in respect of share transfers from a deceased member to\n                    “such person(s) who shall become entitled to a share in consequence of\n                    the death of the member in accordance with the applicable laws of\n                    intestacy” (at [7]). Further, the\n                    court was seeking to make the quite different point that distribution of shares\n                    to a beneficiary would accord with the applicable laws on intestacy even though\n                    the number of shares distributed did not correspond to the number of shares\n                    receivable had they been distributedin specie(at\n                        [20] and [21]). The court was not making an immutable\n                    statement of the law on the interpretation of pre-emption clauses.",
        "Conclusion": "32     In conclusion, I found that the National\n                    pre-emption clauses applied to a transfer of legal title in the National Shares\n                    from Ms Ching, a registered shareholder, to the estate. Ms Ching was\n                    bound to offer the National Shares to the existing members of National Aerated\n                    under Art 31 of the National pre-emption clauses, and could only transfer the\n                    same to the estate if no existing members were willing to purchase the National\n                    Shares, pursuant to Art 33 of the National pre-emption clauses. 33     I therefore dismissed the plaintiff’s\n                    prayer to compel National Aerated to register the share transfer and deliver to\n                    the plaintiff new share certificates in respect of the National\n                Shares."
    }
}