{
    "case_title": "Ho Pak Kim Realty Co Pte Ltd\n      v\n      Revitech Pte Ltd",
    "ncitation": "[2013] SGHC 41",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "The plaintiff’s appeal": "26     It will be easier to dispose of the plaintiff’s appeal first. Mr See contended that as the defendant had failed to prove it owed a duty of care to the MCST, there should not be a second tranche of hearing to assess damages for the 8 defective items. I reject this submission as premature and also for the reasons set out in the AR’s grounds of decision at [12] to [17], which I accept and adopt. The issue of liability to the MCST cannot be revived at the assessment stage as it had already been dealt with in the 2010 judgment when this court held (at [116]): As for the plaintiff’s submission that the defendant no longer retained any interest in the project as to be entitled to make this claim (having sold off the units),Prosperland Pte Ltd v Civic Construction Pte Ltd[2004] 4 SLR(R) 129 (affirmed on appeal inChia Kok Leong & Anor v Prosperland Pte Ltd[2005] 2 SLR(R) 484) is the authority that says the defendant retains an interest as it remains liable to the management corporation and in turn to the subsidiary proprietors for the plaintiff’s defective works. The plaintiff is precluded from raising this issue again, particularly when its appeal on the 2010 judgment was dismissed by the Court of Appeal. It is for the AR to determine at another hearing, pursuant to the appellate court’s direction in [3] above, whether there was a legal obligation on the part of the defendant to rectify the 8 defective items. In any case, why would Ho (whose credibility was found to be wanting by this court in both the 2007 judgment and the 2010 judgment), after the plaintiff’s appeal in Civil Appeal No 74 of 2010 was dismissed, offer to pay $35,000 to the MCST for defects if the plaintiff was not liable for the same? Finally, in the 2010 judgment (at [118]), I had observed that the plaintiff’s closing submissions (para 43) had tacitly admitted liability for the 8 defective items, which liability it now disputes. As for the plaintiff’s objection against HASM as an expert (which the AR upheld), I am of the view that it was not necessary for the defendant to rely on her testimony in view of the 2010 judgment. 27     The plaintiff’s second ground of appeal (apropos the costs awarded to the defendant by the AR) was even more unmeritorious. Costs normally follow the event – as the defendant had succeeded in obtaining damages for four items at the assessment hearing, albeit at lesser amounts than what it had claimed, it was rightfully entitled to the costs awarded by the AR. As for the quantum of the costs awarded, that was an exercise of the discretion of the AR which this court will not interfere with. The assessment took a day only because counsel for the plaintiff informed the AR at the eleventh hour (after Riddett’s testimony had concluded) that no witness would be called by the plaintiff. Mr See’s argument that the quantum of costs was excessive overlooked the fact that counsel for the defendant would have prepared for Ho’s cross-examination and had filed four AEICs for the defendant’s case. The fact that no cross-examination of Ho took place did not mean that the time spent in preparation by counsel was not chargeable. I note too that both parties filed lengthy submissions and reply submissions for their respective cases in November 2011 and the AR only dealt with the issue of costs on 21 December 2012 after he had given his awards on 10 February 2012, so his costs order could not have been a hasty decision.",
        "The defendant’s appeal": "Back-charges 28     I turn next to the defendant’s appeal. It appears that the AR clearly misunderstood/misread the evidence of Riddett both in his AEICs as well as in his oral testimony. This is clear from [18] and [19] above and need not be repeated. It appears to have been overlooked by the AR that as the plaintiff chose not to call Ho or any other witness to testify and as Ho’s table was disallowed, there was no evidence from the plaintiff to rebut Riddett’s testimony. 29     The revision by Riddett of $189,348.78 to $136,242.62 for back-charges was not an inconsistency as the plaintiff alleged, neither did it prove Riddett did not discharge his duties as an expert independently – it was due to the fact that the defendant could not substantiate three invoice sums with supporting documentation. As for the sum of $47,343.74 in interim certificate No 22, this had beenexcludedfrom Riddett’s revised figure of $136,242.62. The amounts in the four interim certificates were not deducted by Riddett from the plaintiff’s claim in his quantification of the plaintiff’s works. Hence, there was no question of double-deduction or double-counting. Any double-counting/double-recovery was on the part of Ho, as was found by this court at [92] of the 2010 judgment. Consequently, the AR should not have deducted $4,043.61 from interim certificate No 12 for utilities back-charged to the plaintiff. It bears repeating that double-counting was never raised by the plaintiff before this court at the trial. It is now too late for the plaintiff to do so. The plaintiff is certainly not entitled to repayment of the sum of $47,343.74 (for purchase of tiles from Sinbor) as the amount had been excluded from Riddett’s computation and had effectively been credited back to the plaintiff. Rectification costs already incurred of $124,417.04 30     As with back-charges, this court made the following finding at [117] of the 2010 judgment in respect of rectification costs already incurred: Harico’s director Chong (DW8) had confirmed (at N/E 1592) that his company carried out rectification worksvis a visair-conditioning, tiling, windows etc. Harico’s invoices set out in the bundle marked 3AB totalled $123,738.52. This figure was not disputed by the plaintiff during cross-examination of either Chong or Riddett, who adopted the figure in his report. However, the figure is not fully substantiated by Harico’s documents. 31     This court could have awarded final judgment to the defendant in the sum of $123,738.52 in view of the plaintiff’s admission of the claim by its own expert, Chin. However, because Harico’s documents did not tally with the figure of $123,738.52 notwithstanding the plaintiff’s admission, this court directed that the rectification costs already incurred by the defendant should be assessed. If the defendant was able to substantiate a higher figure of $124,417.04 (which it has), it should be awarded that sum as liability on the part of the plaintiff for this claim was no longer in issue. 32     The AR deducted a sum of $13,226 from the defendant’s claim when he awarded $111,191.04 (which was the plaintiff’s proposal) for rectification costs already incurred. The deducted sum comprised: (i) $3,333.30 for sanitary and plumbing works; (ii) $2,400 for electrical works; (iii) $12,240 for air-conditioning and mechanical ventilation works; and (iv) $12,826.90 and $4,780 (total of $17,606.90) for light fittings that had been omitted. In so doing, the AR accepted the plaintiff’s contention that these amounts had already been accounted for in the M&E final accounts. This conclusion was incorrect. The AR conflated the issues of rectification costs with the plaintiff’s omissions of M&E contractual works as pointed out earlier in [22] above. The DLP 33     The DLP of twelve months subsequent to completion was agreed between the parties pursuant to cl 27 of the contract. The clause states: Subject to clause 26 of these Conditions in the case of an Occupied Part of the Works, the Maintenance Period stated in the Appendix hereto shall commence upon the issue of a Completion Certificate under clause 24(4) or 25 of these Coniditions. During such period: (a)    the Contractor shall complete the outstanding work (if any) listed in and in accordance with the terms recorded in the Completion Certificate; (b)    the Architect may at any time following the Completion Certificate give directions or instructions for the making good by the Contractor of defects, omissions or other faults which may be due to any breach by the Contractor of any of his obligations … Clause 27 above is to be read with item 71.02 in Bill No 1 of the Preliminaries in the bills of quantities of the plaintiff submitted for the project. The item states: The Contractor shall maintain a maintenance crew during the Maintenance Period to receive instructions from the Architect and carry out urgent repairs, maintenance, making good defects and rectification works expeditiously. 34     Consequently, the claim for reimbursement of rectification costs had nothing to do with the DLP. Therefore, awards for both heads of claim would not amount to double-recovery. The plaintiff incorrectly contended before the AR that Riddett had made deductions for works carried out during the DLP. As can be seen from [33] above, the DLP was a contractual obligation that the plaintiff failed to honour. I note that the AR awarded $27,768.67 to the defendant as compensation in lieu of warranties. The sum should be compensation to the defendant for the maintenance team which the defendant, and not the plaintiff, provided during the DLP under cl 27 of the contract. The award should have been for the omission of a DLP. 35     Counsel for the plaintiff (Mr Thrumurgam, assisted by Mr See) had repeatedly submitted before the AR that the defendant would be given double-recovery should there be awards for both costs of rectification and damages for the plaintiff’s failure to honor the DLP. That contention is misconceived. As can be seen from [33] above, provision of a DLP was a requirement of the contract in particular and is a standard requirement of the construction industry in general. The plaintiff’s tender for the contract for the project had obviously factored in the cost of providing a DLP. Effectively, that meant that the defendant, and not the plaintiff, paid for the DLP. Therefore, in not honouring the DLP, the plaintiff, and Ho in particular, had short-changed the defendant. The plaintiff’s failure to honour the DLP was therefore a separate breach of contract from its failure to rectify defects. Failure to provide warranties 36     As with the failure to honour the DLP, the plaintiff’s failure to provided warranties is another head of claim for breach of contract that the AR should have awarded over and above the costs of rectification. As pointed out in [34] above, the $27,768.67 awarded by the AR should have been compensation for the failure to honour the DLP, and not for failure to provide warranties. Provision of warranties was also part of the Preliminaries in Bill No 1 of the plaintiff’s bills of quantities for the project under item 61, which states: Prior to the issue of the Completion Certificate the Contractor shall submit to the Architect all guaranties, warranties, test and performance certificates etc called for in the Contract Documents and joint-warranties in the case of nominated sub-contracts including manufacturer’s operating instructions. All warranties and guarantees shall commence from the main contract completion certificate date unless otherwise specified. 61.02  The list of Warranties required for this contract is reflected in the Appendices to Specification. 37     The argument by Mr See that making separate awards for failure to provide warranties and for rectification costs would be tantamount to double- recovery is again misconceived for the reason set out in [35] above. How does one price a negative – the non-provision of a service? Riddett did his best by assessing what it would have cost the plaintiff had it given warranties for such items as air-conditioning. A parallel can be drawn with consumer items such as a refrigerator or even a handphone. The consumer will call upon the warranty when the product for which the warranty was given is defective or breaks down within the period covered by the warranty. If the manufacturer or local agent of the product is unable to make good/resolve the customer’s complaint and the latter finds his own repairer at a certain cost, I think the customer should be able entitled to recover his cost of repair from the manufacturer/agent. Further, it cannot be right that thereafter, the customer is not entitled to the protection afforded by the warranty for its duration because he has already made a claim. I note that there was no challenge to Riddett’s figure of $53,720 at the assessment hearing. Counsel for the plaintiff, Mr Thrumurgam, only asked Riddett the following question: PC:Moving on to the warranties, you confirm that you have not obtained any quotations with regard to provision of warranties. Riddett (PW4): No. 38     There was one concession made by Mr See for the defendant’s appeal. The AR had in his judgment (at [7(d)]) wrongly deducted a sum of $12,826.90 for omission of air-conditioning works; he had relied on HY M&E’s accounts dated 3 May 2006 when the final and operative accounts were those dated 13 September 2006, where the figure for the item was $8,160. Consequently, the total deductions should only have been $31,500.20. The AR’s adverse findings on Riddett’s testimony 39     The AR referred to extracts from the notes of evidence of the assessment hearing for his rejection of the testimony of Riddett whom he described as evasive and/or inconsistent. The AR’s assessment of Riddett vastly differed from this court’s assessment,viz, that Riddett was a fair and objective expert who produced a comprehensive report/supplemental reports in his role as the defendant’s quantity surveyor. Based on the plaintiff’s authority (Poh Soon Kiat v Desert Palace Inc[2010] 1 SLR 1129), it cannot be said that Riddett’s reports were not based on the correct premise and sound reasoning. 40     It would be appropriate at this juncture to make several observations. First, Riddett testified before the AR on 12 October 2011, approximately three years after he filed his first AEIC on 18 September 2008. Riddett’s second affidavit followed on 12 December 2008, while his third AEIC for the assessment was filed on 5 September 2011. For the purpose of the assessment, Riddett updated his figures in his third AEIC by his second supplemental report to take into account current prices for the defendant’s four heads of claim. 41     What came across from Riddett’s cross-examination was that he addressed squarely the plaintiff’s allegation that there had been double-deductions by the defendant. I do not agree with the AR’s finding that Riddett conceded that there was double-counting in the course of his cross-examination. That was a misreading of his evidence. As an example, I refer to N/E 13, where the following exchange took place between counsel for the plaintiff and Riddett: PC:Would you agree with me the sum of around $443,000 has already been back charged. PW4:It has been accounted for the in interim payment, yes. PC:The sum of $443,000 has already been deducted from what is due from the contractor, correct? PW4:Yes, but you have to be careful with how you assess the deductions. Refer to page 24 of my second affidavit, that was my attempt to balance all these things up, having taken into account the possible chance of double deductions. I agree that this is an issue that has to be carefully examined, as there may be an incidence of double deductions. But to my knowledge, the calculations have already taken that possibility of double deductions into account. Still on page 24 of my second affidavit, the last line that says “less amount paid”, that is the crucial figure. That figure took into account the fact that previous deductions have already been made. PC:The amount that was paid to the contractor already had back charges deducted? Agree? PW4:Yes. I agree. When we add up everything that contractor is entitled to, and deduct the amount that he is being paid, we have already compensated for that back charge. PC:The sum of $443,000.61 has already been deducted? PW4:Yes. PC:So right now, there should not be a double deduction of that amount, and hence should not be back charged? PW4:Yes, I agree. 42     The above extracts showed that Riddett said that he ensured there was no double-counting because he was fully conscious and aware of the danger of double-counting. I do not read the passages to mean Riddett agreed there was double-counting. To my mind, Riddett’s answers in cross-examination were taken out of context. This is clear from Riddett’s re-examination, as can be seen from the following questions and answers (N/E 22-23): DCYou were referred to APED at page 3121, and page 103 of your AEIC. It was asked of you, why, when these back charges appear to be already deducted, why you still included them at the table at page 103 of your AEIC. Can you tell us why is it that you said that there was no double counting? PW4:With regard to the items included under “back charges” in my table, we have taken steps to ensure that there was no double counting. In my calculations, I have made sure that there was no double counting. DC:Can you explain on the final account. PW4:When the first affidavit was made, I had intended to show all the amounts due by the contractor. The final accounts statement had to be revised accordance [sic] to the assessment of the back charges. DC:You were asked whether you have obtained any quotations with regard to warranties, or the price of warranties, and you said you have not, can you then explain how you have arrived at the figures relating to the warranties then. PW4:I looked at the list of warranties that needed to be provided under the main contract. I considered what it would cost if you were to get an outsider to “insure”, so to speak, some of the items which commonly cause problems. That would in my view, add on to the sum of $50,000. I also took into consideration the contract price, which in my view, was a reasonable amount. DC:It was asked of you, in reference to Harico Construction, it was suggested that that entity stepped into the shoes of the contractor and performed rectification works as if it was the main contractor. It was suggested that there was no basis for you to on one hand price for these defects, and also at the same time price for the omission of the DLP. Can you explain to the court why there was no double recovery. PW4:The first reason is that the main contractor in pricing for the work would have included the amount in his price, to cover his obligations under the contract.  What I have done is to assess a reasonable sum for what would be his liability. I am guided to a certain extent by the retention that is held during the relevant period under the SIA contract, which is 2.5%, it seems to be that that figures would be a cap. I assessed it at 1% which is approx $42k, that has to cover a period a period of 12 months. That is in my view a reasonable amount per month. I have assessed what I believe a main contractor would allow in his price. We have also deducted the direct costs. 43     The figure of $443,000.61 as recorded in the notes of evidence set out at [41] is incorrect; it should be $4,044.35. I had at [127] of the 2010 judgment held that the sum of $4,044.35 was due to the defendant after netting off what was owed the plaintiff; I had said: Ho had admitted that he omitted to do landscaping for the project, which item was priced at $65,000 in the contract. This figure was referred to and included in the calculations in Riddett’s report at Appendix B relating to variations (supported and not supported by Architect’s Instructions). The result of Riddett’s calculations was a deduction of $14,067.84 in favour of the defendant which, set off against the $10,023.49 in [87] due to the plaintiff for variations supported by Architect’s Instructions, leaves a credit balance of $4,044.35 in favour of the defendant. Consequently, the sum of $443,000.61 should be substituted by $4,044.35 and, based on the 2010 judgment, it can no longer be challenged or disputed by the plaintiff. It is yet another measure of Ho’s dishonesty that the plaintiff is again attempting to circumvent the finality of the judgment sums I had awarded. Ho continued to attack the defendant’s claim for back-charges and rectification costs on which final judgment had been awarded by this court without presenting any countervailing evidence. This included challenging the sum of $23,548.75 back-charged by the defendant resulting from garnishee proceedings taken out against the defendant by Presscrete Engineering Pte Ltd (“Presscrete”), pursuant to which the defendant paid the sum under the order of court dated 24 December 2003 obtained by Presscrete in MC Suit 7304 of 2000. Yet, Ho declined to testify, although he filed his AEIC for the assessment hearing. It speaks volumes about Ho’s character and reaffirms the poor opinion of his credibility that this court formed at the trials that culminated in the 2007 judgment and the 2010 judgment. 44     I should also add that the sums of $14,067.84 and $10,023.49 referred to at [43] above (from [127] of the 2010 judgment) were arrived at after discussions between Ho and Riddett pursuant to this court’s direction (see [6] of the 2010 judgment) that the parties should, as far as possible, focus on disputed items exceeding $10,000 in value for the trial and leave out items of lesser value. Ho and Riddett subsequently resolved a number of disputed variation items in Ho’s exhibit HSF-38 (supra[22]). Consequently, the two figures cannot now be challenged by the plaintiff. 45     A cursory glance of the submissions filed below on the plaintiff’s behalf showed that its counsel repeatedly disregarded this court’s findings on issues of liability in the 2010 judgment, not to mention counsel’s attempts to put his own interpretation of this court’s judgment on the issue of back-charges (see paras 28-29 of the plaintiff’s reply submissions filed 16 November 2011).",
        "The duty of care": "15     Mr Isaac submitted that the duty of care at law relating to the construction industry had been extended to non-contractual parties. He pointed out that inProsperland Pte Ltd v Civic Construction Pte Ltd[2004] 4 SLR(R) 129 (“Prosperland”), which was affirmed on appeal, the developer was held to be entitled to sue the main contractor even though ownership of the common property and the individual units in the developer’s project had passed on to, respectively, the management corporation and the subsidiary proprietors. The right to sue inProsperlandwas extended to the management council for the relevant development inRSP Architects Planners & Engineers v Ocean Front Pte Ltd[1995] 3 SLR(R) 653 (“Ocean Front”). Mr Isaac pointed out that the only reason the MCST had not sued the defendant in the present case was due to the fact that the defendant had placated and provided full cooperation to the MCST in exchange for the MCST holding its hand. Consequently, the defendant was still legally obliged to rectify the plaintiff’s defects, notwithstanding the transfer of ownership by the defendant of the common property and the individual units in the project to the MCST and the subsidiary proprietors respectively. Without the sanction of a court order, it would not have been prudent for the defendant to proceed with rectification works. The plaintiff, on the other hand, should not be allowed to escape scot-free from its contractual obligations. If the defendant was not obliged to rectify the defects, there would be a vacuum as the MCST and the subsidiary proprietors would have no recourse.",
        "Back-charges": "16     The defendant’s counsel contended that the AR failed to appreciate the evidence that had been given by Riddett on the four items on which the defendant was appealing, in particular, on the issue of back-charges. First, there was no basis for the AR to reduce the defendant’s claim for back-charges from $136,242.62 to $16,801.15 as there was no double-counting, contrary to what the plaintiff alleged. Although Ho failed to testify at the assessment hearing, counsel for the plaintiff had introduced (in the course of Riddett’s cross-examination) a table prepared by Ho (“Ho’s table”) setting out the plaintiff’s position on back-charges and had attempted to treat the table as evidence before the court. Mr Chan pointed out that at [14(b)] of the 2010 judgment, this court had stated that Riddett had assessed back-charges as $189,348.78, but because some of those charges were not substantiated by documentation, the assessment exercise was to enable the defendant to find missing supporting documents. It was also to allow the plaintiff to challenge items of back-charges that were unsubstantiated. At the assessment, however, counsel for the plaintiff attempted to use Ho’s table as evidence even though Ho did not testify. The plaintiff tried to revisit the issue of liability on the back-charges, with its counsel using Ho’s table to attack the testimony of Riddett and contending that Riddett: (a)had not been provided with copies of material documents;(b)had been inconsistent in his calculations; and(c)had not taken steps to satisfy himself on the accuracy and veracity of his calculations.17     Mr Chan contended that the AR did not fully appreciate Riddett’s evidence on the issue of back-charges and there was in fact no double-counting at all, contrary to what the AR believed.18     As for the plaintiff’s criticisms in [16(a)] above, Mr Chan said it was in relation to four interim certificates of payment,viz, Nos 12 ($24,776.63), 14 ($32,381.37), 17 ($38,241.24) and 22 ($47,343.74). In Riddett’s third AEIC filed on 5 September 2011, Riddett had in Appendix D tabulated and itemised the back-charges. Included therein were the back-charges in the four certificates complained of – for certificate No 12, they were incorporated into items 1 and 10; for certificate No 14, they were items 4 and 5; and for certificate No 17, they were items 6 and 7. At the trial, Riddett had admitted that the sum of $47,343.74 in interim certificate No 22 was not a back-charge. In his first AEIC filed on 18 September 2006 (at pp 228-229) for the main trial, Riddett had taken into account the plaintiff’s entire claim for work done amounting to $3,903,803.65; that figure included the sums in the aforementioned interim certificates. The sum of $47,343.74 in interim certificate No 22 wasomittedfrom Riddett’s figure of $136,242.62 for back-charges presented at the assessment hearing. Consequently, it was incorrect of the plaintiff to contend and for the AR to find that Riddett had deducted the four certified amounts from the plaintiff’s claim and again for the assessment hearing. The AR should not have given any credence to the plaintiff’s submission and should therefore not have deducted $119,441.47 from Riddett’s figure of $136,242.62. It was also pointed out (correctly, I would add) that the plaintiff had not at the trial raised the issue of double-counting by the defendant.19     The plaintiff’s second complaint set out in [16(b)] referred to Riddett’s revision of back-charges from $189,348.78 at the trial to $136,242.62 for the assessment hearing. Counsel explained that this discrepancy was due to the fact that the defendant could not find supporting documentation for three items included in the higher figure. Consequently, the defendant reduced its claim. Yet, the plaintiff wanted to capitalize on its honesty.Rectification costs already incurred20     In awarding only $111,191.04 for the cost of rectification works already incurred (which figure came from the plaintiff), the AR dismissed the defendant’s claim for various items amounting to $35,580.20, again on the ground of double-counting. This figure was for mechanical and electrical (“M&E”) works comprising:(a)     $3,333.30 for sanitary and plumbing installation;(b)     $2,400 for electrical works;(c)     $12,240 for air-conditioning and mechanical ventilation works; and(d)     $12,826.90 and $4,780 for the omission to supply and installation of light fittings.However, in the 2010 judgment (at [117]), this court had directed the defendant to fully substantiate the repair charges of $123,738.52 carried out by Harico Construction Pte Ltd (“Harico”). Again, it was only an issue of substantiation, and not liability, that had to be decided by the AR. It was therefore not open to the plaintiff, let alone Ho, to revisit the issue of liability for rectification works.21     The deducted sum of $13,226 was for M&E works, not rectification works. Mr Chan pointed out that the plaintiff had omitted two items in the M&E works from its scope of works. These omitted items (according to the AEIC of Neo Bee Keaw from the M&E consultants, HY M&E Consultancy Services Pte Ltd (“HY M&E”)), were: (i) lighting fixtures for some common areas; and (ii) a 150 KVA standby generator.22     The plaintiff’s counsel and/or Ho failed to inform the AR that this court had awarded final judgment for M&E works that had been either omitted and/or varied. Further, in Ho’s supplemental AEIC (filed on 24 December 2008) at exhibit HSF-38, Ho had himself set out the deductions for M&E omissions made by Riddett (see Riddett’s first AEIC, Appendix B, p 63). In Ho’s exhibit HSF-38, the plaintiff had agreed to a deduction of $22,000 for failing to provide a 150 KVA generator. The light fittings omitted were assessed at $17,606.90 ($12,826.90 and $4,780 respectively for garden lights and bollards). Additionally, this court had found (at [127] of the 2010 judgment) that the plaintiff had omitted landscaping works priced at $65,000. After setting off the plaintiff’s legitimate claim for variations, this court then found that a sum of $4,044.35 was owed to the defendant. It therefore did not lie in the plaintiff’s mouth to allege at the assessment hearing that there was double-deduction of M&E omissions. M&E works did not involve double-counting, only a question of variations or omissions.The plaintiff’s failure to provide warranties23     The AR dismissed the defendant’s claim of $53,720 for damages for this item, and awarded $30,000 instead as compensation for the defendant’s hiring of a maintenance team. The AR opined that there was no evidence to show that any warranties were required to be called upon by the MCST. In so holding, the AR overlooked the fact that the plaintiff had failed to provide any warranties at all and had thereby deprived the defendant and the MCST of any recourse. In his AEIC, KCS deposed that the MCST had looked to the defendant to make good the defects in the plaintiff’s works, one reason being that the MCST did not trust Ho, whose offer to pay $35,000 to the MCST for all the defects had been rejected. Had warranties been provided, the defendant would have looked to the plaintiff if and when the MCST lodged claims.24     In the 2010 judgment, this court had at [130] pointed to a flaw in the testimony of the plaintiff’s expert, Chin Cheong (“Chin”):Chin’s many recommendations of rectification in lieu of replacements of items constructed by the plaintiff may well have been premised on the belief that the plaintiff provided warranties. However, a major omission of the plaintiff was its failure to provide warranties. Riddett’s report assessed $50,000 for this omission and $30,000 for the plaintiff’s failure to provide “as built” drawings. While the defendant is certainly entitled to recover the cost of these omissions, I shall leave it to the assessing registrar to determine whether the figures requested are reasonable.The DLP25     Counsel for the defendant also made reference to the 2010 judgment (at [131]), where this court said:It cannot be disputed that the plaintiff totally failed to honour the defects liability period of twelve months after completion. The cost of this omission should be deducted from the plaintiff’s claim of $771,630.97 which quantum is best left to the assessing registrar.The AR deducted $17,973.33 from various items in the defendant’s claim relating to the plaintiff’s failure to honour the DLP in the mistaken belief that Riddett had admitted that those costs had already been deducted from the contract sums. As with the claim for back-charges, there was in fact no double-recovery. The issue of double-counting could not in any event be raised as the figures were the subject of a final judgment by this court at [117] of the 2010 judgment.The decisionThe plaintiff’s appeal26     It will be easier to dispose of the plaintiff’s appeal first. Mr See contended that as the defendant had failed to prove it owed a duty of care to the MCST, there should not be a second tranche of hearing to assess damages for the 8 defective items. I reject this submission as premature and also for the reasons set out in the AR’s grounds of decision at [12] to [17], which I accept and adopt. The issue of liability to the MCST cannot be revived at the assessment stage as it had already been dealt with in the 2010 judgment when this court held (at [116]):As for the plaintiff’s submission that the defendant no longer retained any interest in the project as to be entitled to make this claim (having sold off the units),Prosperland Pte Ltd v Civic Construction Pte Ltd[2004] 4 SLR(R) 129 (affirmed on appeal inChia Kok Leong & Anor v Prosperland Pte Ltd[2005] 2 SLR(R) 484) is the authority that says the defendant retains an interest as it remains liable to the management corporation and in turn to the subsidiary proprietors for the plaintiff’s defective works.The plaintiff is precluded from raising this issue again, particularly when its appeal on the 2010 judgment was dismissed by the Court of Appeal. It is for the AR to determine at another hearing, pursuant to the appellate court’s direction in [3] above, whether there was a legal obligation on the part of the defendant to rectify the 8 defective items. In any case, why would Ho (whose credibility was found to be wanting by this court in both the 2007 judgment and the 2010 judgment), after the plaintiff’s appeal in Civil Appeal No 74 of 2010 was dismissed, offer to pay $35,000 to the MCST for defects if the plaintiff was not liable for the same? Finally, in the 2010 judgment (at [118]), I had observed that the plaintiff’s closing submissions (para 43) had tacitly admitted liability for the 8 defective items, which liability it now disputes. As for the plaintiff’s objection against HASM as an expert (which the AR upheld), I am of the view that it was not necessary for the defendant to rely on her testimony in view of the 2010 judgment.27     The plaintiff’s second ground of appeal (apropos the costs awarded to the defendant by the AR) was even more unmeritorious. Costs normally follow the event – as the defendant had succeeded in obtaining damages for four items at the assessment hearing, albeit at lesser amounts than what it had claimed, it was rightfully entitled to the costs awarded by the AR. As for the quantum of the costs awarded, that was an exercise of the discretion of the AR which this court will not interfere with. The assessment took a day only because counsel for the plaintiff informed the AR at the eleventh hour (after Riddett’s testimony had concluded) that no witness would be called by the plaintiff. Mr See’s argument that the quantum of costs was excessive overlooked the fact that counsel for the defendant would have prepared for Ho’s cross-examination and had filed four AEICs for the defendant’s case. The fact that no cross-examination of Ho took place did not mean that the time spent in preparation by counsel was not chargeable. I note too that both parties filed lengthy submissions and reply submissions for their respective cases in November 2011 and the AR only dealt with the issue of costs on 21 December 2012 after he had given his awards on 10 February 2012, so his costs order could not have been a hasty decision.The defendant’s appealBack-charges28     I turn next to the defendant’s appeal. It appears that the AR clearly misunderstood/misread the evidence of Riddett both in his AEICs as well as in his oral testimony. This is clear from [18] and [19] above and need not be repeated. It appears to have been overlooked by the AR that as the plaintiff chose not to call Ho or any other witness to testify and as Ho’s table was disallowed, there was no evidence from the plaintiff to rebut Riddett’s testimony.29     The revision by Riddett of $189,348.78 to $136,242.62 for back-charges was not an inconsistency as the plaintiff alleged, neither did it prove Riddett did not discharge his duties as an expert independently – it was due to the fact that the defendant could not substantiate three invoice sums with supporting documentation. As for the sum of $47,343.74 in interim certificate No 22, this had beenexcludedfrom Riddett’s revised figure of $136,242.62. The amounts in the four interim certificates were not deducted by Riddett from the plaintiff’s claim in his quantification of the plaintiff’s works. Hence, there was no question of double-deduction or double-counting. Any double-counting/double-recovery was on the part of Ho, as was found by this court at [92] of the 2010 judgment. Consequently, the AR should not have deducted $4,043.61 from interim certificate No 12 for utilities back-charged to the plaintiff. It bears repeating that double-counting was never raised by the plaintiff before this court at the trial. It is now too late for the plaintiff to do so. The plaintiff is certainly not entitled to repayment of the sum of $47,343.74 (for purchase of tiles from Sinbor) as the amount had been excluded from Riddett’s computation and had effectively been credited back to the plaintiff.Rectification costs already incurred of $124,417.0430     As with back-charges, this court made the following finding at [117] of the 2010 judgment in respect of rectification costs already incurred:Harico’s director Chong (DW8) had confirmed (at N/E 1592) that his company carried out rectification worksvis a visair-conditioning, tiling, windows etc. Harico’s invoices set out in the bundle marked 3AB totalled $123,738.52. This figure was not disputed by the plaintiff during cross-examination of either Chong or Riddett, who adopted the figure in his report. However, the figure is not fully substantiated by Harico’s documents.31     This court could have awarded final judgment to the defendant in the sum of $123,738.52 in view of the plaintiff’s admission of the claim by its own expert, Chin. However, because Harico’s documents did not tally with the figure of $123,738.52 notwithstanding the plaintiff’s admission, this court directed that the rectification costs already incurred by the defendant should be assessed. If the defendant was able to substantiate a higher figure of $124,417.04 (which it has), it should be awarded that sum as liability on the part of the plaintiff for this claim was no longer in issue.32     The AR deducted a sum of $13,226 from the defendant’s claim when he awarded $111,191.04 (which was the plaintiff’s proposal) for rectification costs already incurred. The deducted sum comprised: (i) $3,333.30 for sanitary and plumbing works; (ii) $2,400 for electrical works; (iii) $12,240 for air-conditioning and mechanical ventilation works; and (iv) $12,826.90 and $4,780 (total of $17,606.90) for light fittings that had been omitted. In so doing, the AR accepted the plaintiff’s contention that these amounts had already been accounted for in the M&E final accounts. This conclusion was incorrect. The AR conflated the issues of rectification costs with the plaintiff’s omissions of M&E contractual works as pointed out earlier in [22] above.The DLP33     The DLP of twelve months subsequent to completion was agreed between the parties pursuant to cl 27 of the contract. The clause states:Subject to clause 26 of these Conditions in the case of an Occupied Part of the Works, the Maintenance Period stated in the Appendix hereto shall commence upon the issue of a Completion Certificate under clause 24(4) or 25 of these Coniditions. During such period:(a)    the Contractor shall complete the outstanding work (if any) listed in and in accordance with the terms recorded in the Completion Certificate;(b)    the Architect may at any time following the Completion Certificate give directions or instructions for the making good by the Contractor of defects, omissions or other faults which may be due to any breach by the Contractor of any of his obligations …Clause 27 above is to be read with item 71.02 in Bill No 1 of the Preliminaries in the bills of quantities of the plaintiff submitted for the project. The item states:The Contractor shall maintain a maintenance crew during the Maintenance Period to receive instructions from the Architect and carry out urgent repairs, maintenance, making good defects and rectification works expeditiously.34     Consequently, the claim for reimbursement of rectification costs had nothing to do with the DLP. Therefore, awards for both heads of claim would not amount to double-recovery. The plaintiff incorrectly contended before the AR that Riddett had made deductions for works carried out during the DLP. As can be seen from [33] above, the DLP was a contractual obligation that the plaintiff failed to honour. I note that the AR awarded $27,768.67 to the defendant as compensation in lieu of warranties. The sum should be compensation to the defendant for the maintenance team which the defendant, and not the plaintiff, provided during the DLP under cl 27 of the contract. The award should have been for the omission of a DLP.35     Counsel for the plaintiff (Mr Thrumurgam, assisted by Mr See) had repeatedly submitted before the AR that the defendant would be given double-recovery should there be awards for both costs of rectification and damages for the plaintiff’s failure to honor the DLP. That contention is misconceived. As can be seen from [33] above, provision of a DLP was a requirement of the contract in particular and is a standard requirement of the construction industry in general. The plaintiff’s tender for the contract for the project had obviously factored in the cost of providing a DLP. Effectively, that meant that the defendant, and not the plaintiff, paid for the DLP. Therefore, in not honouring the DLP, the plaintiff, and Ho in particular, had short-changed the defendant. The plaintiff’s failure to honour the DLP was therefore a separate breach of contract from its failure to rectify defects.Failure to provide warranties36     As with the failure to honour the DLP, the plaintiff’s failure to provided warranties is another head of claim for breach of contract that the AR should have awarded over and above the costs of rectification. As pointed out in [34] above, the $27,768.67 awarded by the AR should have been compensation for the failure to honour the DLP, and not for failure to provide warranties. Provision of warranties was also part of the Preliminaries in Bill No 1 of the plaintiff’s bills of quantities for the project under item 61, which states:Prior to the issue of the Completion Certificate the Contractor shall submit to the Architect all guaranties, warranties, test and performance certificates etc called for in the Contract Documents and joint-warranties in the case of nominated sub-contracts including manufacturer’s operating instructions. All warranties and guarantees shall commence from the main contract completion certificate date unless otherwise specified.61.02  The list of Warranties required for this contract is reflected in the Appendices to Specification.37     The argument by Mr See that making separate awards for failure to provide warranties and for rectification costs would be tantamount to double- recovery is again misconceived for the reason set out in [35] above. How does one price a negative – the non-provision of a service? Riddett did his best by assessing what it would have cost the plaintiff had it given warranties for such items as air-conditioning. A parallel can be drawn with consumer items such as a refrigerator or even a handphone. The consumer will call upon the warranty when the product for which the warranty was given is defective or breaks down within the period covered by the warranty. If the manufacturer or local agent of the product is unable to make good/resolve the customer’s complaint and the latter finds his own repairer at a certain cost, I think the customer should be able entitled to recover his cost of repair from the manufacturer/agent. Further, it cannot be right that thereafter, the customer is not entitled to the protection afforded by the warranty for its duration because he has already made a claim. I note that there was no challenge to Riddett’s figure of $53,720 at the assessment hearing. Counsel for the plaintiff, Mr Thrumurgam, only asked Riddett the following question:PC:Moving on to the warranties, you confirm that you have not obtained any quotations with regard to provision of warranties.Riddett (PW4): No.38     There was one concession made by Mr See for the defendant’s appeal. The AR had in his judgment (at [7(d)]) wrongly deducted a sum of $12,826.90 for omission of air-conditioning works; he had relied on HY M&E’s accounts dated 3 May 2006 when the final and operative accounts were those dated 13 September 2006, where the figure for the item was $8,160. Consequently, the total deductions should only have been $31,500.20.The AR’s adverse findings on Riddett’s testimony39     The AR referred to extracts from the notes of evidence of the assessment hearing for his rejection of the testimony of Riddett whom he described as evasive and/or inconsistent. The AR’s assessment of Riddett vastly differed from this court’s assessment,viz, that Riddett was a fair and objective expert who produced a comprehensive report/supplemental reports in his role as the defendant’s quantity surveyor. Based on the plaintiff’s authority (Poh Soon Kiat v Desert Palace Inc[2010] 1 SLR 1129), it cannot be said that Riddett’s reports were not based on the correct premise and sound reasoning.40     It would be appropriate at this juncture to make several observations. First, Riddett testified before the AR on 12 October 2011, approximately three years after he filed his first AEIC on 18 September 2008. Riddett’s second affidavit followed on 12 December 2008, while his third AEIC for the assessment was filed on 5 September 2011. For the purpose of the assessment, Riddett updated his figures in his third AEIC by his second supplemental report to take into account current prices for the defendant’s four heads of claim.41     What came across from Riddett’s cross-examination was that he addressed squarely the plaintiff’s allegation that there had been double-deductions by the defendant. I do not agree with the AR’s finding that Riddett conceded that there was double-counting in the course of his cross-examination. That was a misreading of his evidence. As an example, I refer to N/E 13, where the following exchange took place between counsel for the plaintiff and Riddett:PC:Would you agree with me the sum of around $443,000 has already been back charged.PW4:It has been accounted for the in interim payment, yes.PC:The sum of $443,000 has already been deducted from what is due from the contractor, correct?PW4:Yes, but you have to be careful with how you assess the deductions. Refer to page 24 of my second affidavit, that was my attempt to balance all these things up, having taken into account the possible chance of double deductions. I agree that this is an issue that has to be carefully examined, as there may be an incidence of double deductions. But to my knowledge, the calculations have already taken that possibility of double deductions into account. Still on page 24 of my second affidavit, the last line that says “less amount paid”, that is the crucial figure. That figure took into account the fact that previous deductions have already been made.PC:The amount that was paid to the contractor already had back charges deducted? Agree?PW4:Yes. I agree. When we add up everything that contractor is entitled to, and deduct the amount that he is being paid, we have already compensated for that back charge.PC:The sum of $443,000.61 has already been deducted?PW4:Yes.PC:So right now, there should not be a double deduction of that amount, and hence should not be back charged?PW4:Yes, I agree.42     The above extracts showed that Riddett said that he ensured there was no double-counting because he was fully conscious and aware of the danger of double-counting. I do not read the passages to mean Riddett agreed there was double-counting. To my mind, Riddett’s answers in cross-examination were taken out of context. This is clear from Riddett’s re-examination, as can be seen from the following questions and answers (N/E 22-23):DCYou were referred to APED at page 3121, and page 103 of your AEIC. It was asked of you, why, when these back charges appear to be already deducted, why you still included them at the table at page 103 of your AEIC. Can you tell us why is it that you said that there was no double counting?PW4:With regard to the items included under “back charges” in my table, we have taken steps to ensure that there was no double counting. In my calculations, I have made sure that there was no double counting.DC:Can you explain on the final account.PW4:When the first affidavit was made, I had intended to show all the amounts due by the contractor. The final accounts statement had to be revised accordance [sic] to the assessment of the back charges.DC:You were asked whether you have obtained any quotations with regard to warranties, or the price of warranties, and you said you have not, can you then explain how you have arrived at the figures relating to the warranties then.PW4:I looked at the list of warranties that needed to be provided under the main contract. I considered what it would cost if you were to get an outsider to “insure”, so to speak, some of the items which commonly cause problems. That would in my view, add on to the sum of $50,000. I also took into consideration the contract price, which in my view, was a reasonable amount.DC:It was asked of you, in reference to Harico Construction, it was suggested that that entity stepped into the shoes of the contractor and performed rectification works as if it was the main contractor. It was suggested that there was no basis for you to on one hand price for these defects, and also at the same time price for the omission of the DLP. Can you explain to the court why there was no double recovery.PW4:The first reason is that the main contractor in pricing for the work would have included the amount in his price, to cover his obligations under the contract.  What I have done is to assess a reasonable sum for what would be his liability. I am guided to a certain extent by the retention that is held during the relevant period under the SIA contract, which is 2.5%, it seems to be that that figures would be a cap. I assessed it at 1% which is approx $42k, that has to cover a period a period of 12 months. That is in my view a reasonable amount per month. I have assessed what I believe a main contractor would allow in his price. We have also deducted the direct costs.43     The figure of $443,000.61 as recorded in the notes of evidence set out at [41] is incorrect; it should be $4,044.35. I had at [127] of the 2010 judgment held that the sum of $4,044.35 was due to the defendant after netting off what was owed the plaintiff; I had said:Ho had admitted that he omitted to do landscaping for the project, which item was priced at $65,000 in the contract. This figure was referred to and included in the calculations in Riddett’s report at Appendix B relating to variations (supported and not supported by Architect’s Instructions). The result of Riddett’s calculations was a deduction of $14,067.84 in favour of the defendant which, set off against the $10,023.49 in [87] due to the plaintiff for variations supported by Architect’s Instructions, leaves a credit balance of $4,044.35 in favour of the defendant.Consequently, the sum of $443,000.61 should be substituted by $4,044.35 and, based on the 2010 judgment, it can no longer be challenged or disputed by the plaintiff. It is yet another measure of Ho’s dishonesty that the plaintiff is again attempting to circumvent the finality of the judgment sums I had awarded. Ho continued to attack the defendant’s claim for back-charges and rectification costs on which final judgment had been awarded by this court without presenting any countervailing evidence. This included challenging the sum of $23,548.75 back-charged by the defendant resulting from garnishee proceedings taken out against the defendant by Presscrete Engineering Pte Ltd (“Presscrete”), pursuant to which the defendant paid the sum under the order of court dated 24 December 2003 obtained by Presscrete in MC Suit 7304 of 2000. Yet, Ho declined to testify, although he filed his AEIC for the assessment hearing. It speaks volumes about Ho’s character and reaffirms the poor opinion of his credibility that this court formed at the trials that culminated in the 2007 judgment and the 2010 judgment.44     I should also add that the sums of $14,067.84 and $10,023.49 referred to at [43] above (from [127] of the 2010 judgment) were arrived at after discussions between Ho and Riddett pursuant to this court’s direction (see [6] of the 2010 judgment) that the parties should, as far as possible, focus on disputed items exceeding $10,000 in value for the trial and leave out items of lesser value. Ho and Riddett subsequently resolved a number of disputed variation items in Ho’s exhibit HSF-38 (supra[22]). Consequently, the two figures cannot now be challenged by the plaintiff.45     A cursory glance of the submissions filed below on the plaintiff’s behalf showed that its counsel repeatedly disregarded this court’s findings on issues of liability in the 2010 judgment, not to mention counsel’s attempts to put his own interpretation of this court’s judgment on the issue of back-charges (see paras 28-29 of the plaintiff’s reply submissions filed 16 November 2011).Conclusion46     Consequently, I allow the defendant’s appeal with costs for three items of assessment and replace the AR’s awards (in parentheses) with the following:-(a)     $136,242.62 for back-charges ($16,801.15);(b)     $124,417.04 for the cost of rectification works already incurred ($111,191.04); and(c)     $53,720 for the plaintiff’s failure to furnish warranties ($30,000).Total = $314,379.66I affirm the AR’s award of $27,768.67 for the plaintiff’s failure to honour the DLP (not for failing to provide warranties) and disallow the defendant’s claim for $45,742 for this item.  Based on the contractual provisions set out at [33] above, the plaintiff’s responsibility during the DLP was to provide a maintenance crew to attend to defects,etc. The defendant is therefore only entitled to be reimbursed its costs of providing such a maintenance crew and the expenses of repairs occasioned thereby (on which there was no evidence) and nothing more.47     It follows from my decision that the plaintiff’s appeal is dismissed with costs to the defendant. Both sets of costs are to be taxed on a standard basis unless otherwise agreed.",
        "Rectification costs already incurred": "20     In awarding only $111,191.04 for the cost of rectification works already incurred (which figure came from the plaintiff), the AR dismissed the defendant’s claim for various items amounting to $35,580.20, again on the ground of double-counting. This figure was for mechanical and electrical (“M&E”) works comprising: (a)     $3,333.30 for sanitary and plumbing installation; (b)     $2,400 for electrical works; (c)     $12,240 for air-conditioning and mechanical ventilation works; and (d)     $12,826.90 and $4,780 for the omission to supply and installation of light fittings. However, in the 2010 judgment (at [117]), this court had directed the defendant to fully substantiate the repair charges of $123,738.52 carried out by Harico Construction Pte Ltd (“Harico”). Again, it was only an issue of substantiation, and not liability, that had to be decided by the AR. It was therefore not open to the plaintiff, let alone Ho, to revisit the issue of liability for rectification works. 21     The deducted sum of $13,226 was for M&E works, not rectification works. Mr Chan pointed out that the plaintiff had omitted two items in the M&E works from its scope of works. These omitted items (according to the AEIC of Neo Bee Keaw from the M&E consultants, HY M&E Consultancy Services Pte Ltd (“HY M&E”)), were: (i) lighting fixtures for some common areas; and (ii) a 150 KVA standby generator. 22     The plaintiff’s counsel and/or Ho failed to inform the AR that this court had awarded final judgment for M&E works that had been either omitted and/or varied. Further, in Ho’s supplemental AEIC (filed on 24 December 2008) at exhibit HSF-38, Ho had himself set out the deductions for M&E omissions made by Riddett (see Riddett’s first AEIC, Appendix B, p 63). In Ho’s exhibit HSF-38, the plaintiff had agreed to a deduction of $22,000 for failing to provide a 150 KVA generator. The light fittings omitted were assessed at $17,606.90 ($12,826.90 and $4,780 respectively for garden lights and bollards). Additionally, this court had found (at [127] of the 2010 judgment) that the plaintiff had omitted landscaping works priced at $65,000. After setting off the plaintiff’s legitimate claim for variations, this court then found that a sum of $4,044.35 was owed to the defendant. It therefore did not lie in the plaintiff’s mouth to allege at the assessment hearing that there was double-deduction of M&E omissions. M&E works did not involve double-counting, only a question of variations or omissions.",
        "The plaintiff’s failure to provide warranties": "23     The AR dismissed the defendant’s claim of $53,720 for damages for this item, and awarded $30,000 instead as compensation for the defendant’s hiring of a maintenance team. The AR opined that there was no evidence to show that any warranties were required to be called upon by the MCST. In so holding, the AR overlooked the fact that the plaintiff had failed to provide any warranties at all and had thereby deprived the defendant and the MCST of any recourse. In his AEIC, KCS deposed that the MCST had looked to the defendant to make good the defects in the plaintiff’s works, one reason being that the MCST did not trust Ho, whose offer to pay $35,000 to the MCST for all the defects had been rejected. Had warranties been provided, the defendant would have looked to the plaintiff if and when the MCST lodged claims. 24     In the 2010 judgment, this court had at [130] pointed to a flaw in the testimony of the plaintiff’s expert, Chin Cheong (“Chin”): Chin’s many recommendations of rectification in lieu of replacements of items constructed by the plaintiff may well have been premised on the belief that the plaintiff provided warranties. However, a major omission of the plaintiff was its failure to provide warranties. Riddett’s report assessed $50,000 for this omission and $30,000 for the plaintiff’s failure to provide “as built” drawings. While the defendant is certainly entitled to recover the cost of these omissions, I shall leave it to the assessing registrar to determine whether the figures requested are reasonable.",
        "The DLP": "25     Counsel for the defendant also made reference to the 2010 judgment (at [131]), where this court said: It cannot be disputed that the plaintiff totally failed to honour the defects liability period of twelve months after completion. The cost of this omission should be deducted from the plaintiff’s claim of $771,630.97 which quantum is best left to the assessing registrar. The AR deducted $17,973.33 from various items in the defendant’s claim relating to the plaintiff’s failure to honour the DLP in the mistaken belief that Riddett had admitted that those costs had already been deducted from the contract sums. As with the claim for back-charges, there was in fact no double-recovery. The issue of double-counting could not in any event be raised as the figures were the subject of a final judgment by this court at [117] of the 2010 judgment.",
        "The decision": "",
        "Conclusion": "46     Consequently, I allow the defendant’s appeal with costs for three items of assessment and replace the AR’s awards (in parentheses) with the following:- (a)     $136,242.62 for back-charges ($16,801.15); (b)     $124,417.04 for the cost of rectification works already incurred ($111,191.04); and (c)     $53,720 for the plaintiff’s failure to furnish warranties ($30,000). Total = $314,379.66 I affirm the AR’s award of $27,768.67 for the plaintiff’s failure to honour the DLP (not for failing to provide warranties) and disallow the defendant’s claim for $45,742 for this item.  Based on the contractual provisions set out at [33] above, the plaintiff’s responsibility during the DLP was to provide a maintenance crew to attend to defects,etc. The defendant is therefore only entitled to be reimbursed its costs of providing such a maintenance crew and the expenses of repairs occasioned thereby (on which there was no evidence) and nothing more. 47     It follows from my decision that the plaintiff’s appeal is dismissed with costs to the defendant. Both sets of costs are to be taxed on a standard basis unless otherwise agreed."
    }
}