{
    "case_title": "Amoe Pte Ltd\n      v\n      Otto Marine Ltd",
    "ncitation": "[2013] SGHC 240",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "Background": "2       Otto Marine engaged the plaintiff (“Amoe”) pursuant to a subcontractor work order dated 6 August 2010 (“the Work Order”) to provide general management support, commissioning, testing and inspections of a vessel that was being built in a shipyard in Batam, Indonesia. On 20 March 2013, Amoe sued Otto Marine in suit no 224 of 2013 to recover moneys allegedly due under the Work Order. On 25 March 2013, Otto Marine entered appearance in the action. It did not subsequently enter its defence or file any other pleadings. Instead, on 3 April 2013 it filed in court and served on Amoe a document entitled “Notice to Produce Documents Referred to in Pleadings” (“the Notice to Produce”). The Notice to Produce ran to four pages and requested the production of 18 items of documents referred to in various paragraphs of the statement of claim (“SOC”). This included the front and reverse sides of the Work Order. 3       On 8 April 2013, Amoe responded by filing a document entitled “Notice Where Documents May Be Inspected” to the effect that the documents listed in the Notice to Produce could be inspected at the offices of its solicitors on 15 April 2013 by prior appointment. On 22 April 2013, Otto Marine filed the present application for an order that Amoe’s suit be stayed either under the inherent jurisdiction of the court or under s 6(1) of the Act on the grounds that the Work Order had a valid and binding arbitration clause. It also prayed for an extension of time to file its defence until 14 days after the final determination of this application. 4       The matter was heard by the assistant registrar on 12 June 2013. It was not disputed that the Work Order contained the terms of the contract between the parties and that cl 13 thereof was an arbitration clause that applied to their dispute. The sole question was whether, by filing and serving the Notice to Produce, Otto Marine had taken a step in the proceedings within the meaning of s 6(1) of the Act. Otto Marine said that it had only done this in order to ascertain if there was an arbitration clause that applied to the dispute with Amoe. However it was not disputed that the Work Order had been prepared on Otto Marine’s standard form. 5       The assistant registrar held that Otto Marine by issuing the Notice to Produce had taken a step in the proceedings within the meaning of s 6(1) of the Act. In his view, the Notice to Produce was akin to an application for discovery of documents which the courts have accepted would amount to a step in the proceedings on the basis that this was an act that invoked and therefore signified submission to the court’s jurisdiction. The assistant registrar found unconvincing Otto Marine’s claim that it did not know if the Work Order had an applicable arbitration clause. Otto Marine should have known the content of its standard forms; moreover it was a public listed company that should be expected to be able to keep track of its contractual obligations. In the event, the application was dismissed. Otto Marine appealed and was ordered to file its defence within seven days if the appeal was dismissed.",
        "My decision": "6       Section 6(1) of the Act reads: 6.—(1)  Where any party to an arbitration agreement institutes any proceedings in any court against any other party to the agreement in respect of any matter which is the subject of the agreement, any party to the agreement may, at any time after appearance and before delivering any pleading or taking any other step in the proceedings, apply to that court to stay the proceedings so far as the proceedings relate to that matter. 7       A party takes a “step in the proceedings” under s 6(1) of the Act if by its conduct it evinces an intention to submit to the court’s jurisdiction rather than seek recourse by way of arbitration and so advances the hearing of the matter in court:Carona Holdings Pte Ltd and others v Go Go Delicacy Pte Ltd[2008] 4 SLR(R) 460 (“Carona Holdings”). Whether an act should be regarded as a step in the proceedings should be decided in a practical and commonsensical way (Carona Holdingsat [52]) and this should be seen in light of the circumstances surrounding the act (Carona Holdingsat [93]). 8       Before me, Otto Marine said that when the SOC was first served on it, it was unable immediately to lay its hands on its copy of the Work Order, as well as other associated documents. This was because the relevant documents had been filed in an offsite warehouse and could not be accessed within a reasonable period of time.  The terms and conditions of the Work Order were printed on its reverse side.  Moreover, five key personnel that had handled the project with Amoe had left Otto Marine and this had put its affairs in relation to this matter in some disarray. Furthermore, although the Work Order was on its standard form, not all of its standard forms had arbitration clauses. For these reasons, it had sought the reverse side of the Work Order and the other documents named in the Notice to Produce to ascertain if there was an arbitration clause and whether there was indeed a dispute falling within that clause.[note: 1] 9       Amoe, on the other hand, argued that requiring disclosure of documents was a significant act amounting to a step in the proceedings. It relied on the case ofParker, Gaines & Co., Limited v Turpin[1918] 1 KB 358 (“Turpin”). Amoe said thatTurpinstands for the proposition that requiring disclosure of documents indicates submission to a court’s jurisdiction and is an act that advances court proceedings. Amoe further argued that Otto Marine’s alleged ignorance of the arbitration clause in the Work Order did not entitle it to continue taking steps in the matter as long as it stood in ignorance and then apply to stay proceedings once it became (or claimed to become) aware of its option to arbitrate. Otto Marine had never, Amoe said, made any specific reservation of its right to proceed to arbitrate as was the case inCapital Trust Investments Ltd v Radio Design TJ AB and others[2002] 2 All ER 159. 10     I turn first to consider the nature of the Notice to Produce. This was a request by Otto Marine for Amoe to produce for inspection certain documents referred to in the SOC. Were it in the form of a letter, it would be considered mere correspondence between the parties and, without more, would not be viewed as constituting a step in the proceedings. However the Notice to Produce was filed in court. It was headed “In the High Court of the Republic of Singapore”. Although it did not state on its face the rule of court under which it was filed, it appears similar in form and wording to Form 40, which is the form prescribed under O 24 r 10(1) of the Rules of Court (Cap 322, R 5, 2006 Rev Ed) (“ROC”). O 24 r 10 states: (1)    Any party to a cause or matter shall be entitled at any time to serve a notice in Form 40 on any other party in whose pleadings or affidavits reference is made to any document requiring him to produce that document for the inspection of the party giving the notice and to permit him to take copies thereof. (2)    The party on whom a notice is served under paragraph (1) must, within 4 days after service of the notice, serve on the party giving the notice a notice in Form 41 stating a time within 7 days after the service thereof at which the documents, or such of them as he does not object to produce, may be inspected at a place specified in the notice, and stating which (if any) of the documents he objects to produce and on what grounds. 11     I am therefore satisfied that the Notice to Produce was a notice under O 24 r 10(1) of the ROC. A party (Party A) who is served with such a notice is required by O 24 r 10(2) to serve a notice on the party giving notice (Party B) in Form 41 stating the time and place for inspection of such documents as he does not object to produce, and the grounds of objection of the other documents. Party B is entitled to apply to the court for an order that the documents requested be produced under O 24 r 11(1) which provides as follows: If a party who is required by Rule 9 to serve such a notice as is therein mentioned or who is served with a notice under Rule 10(1) — (a)    fails to serve a notice under Rule 9 or, as the case may be, Rule 10 (2); (b)    objects to produce any document for inspection; or (c)    offers inspection at a time or place such that, in the opinion of the Court, it is unreasonable to offer inspection then or, as the case may be, there, then, subject to Rule 13(1), the Court may, on the application of the party entitled to inspection, make an order in Form 42 for the production of the documents in question for inspection at such time and place, and in such manner, as it thinks fit. 12     It is not helpful to characterise this Notice to Produce, as the assistant registrar had done below, as akin to an application for discovery of documents. The use of the term “discovery” imports the notion that pleadings have closed. An application under O 24 r 10 of the ROC may be made at any time in the proceedings. This could be done as early as immediately after service of a SOC, or even earlier as it may relate to an affidavit filed after an endorsed writ is served. What is relevant  is whether the filing of the Notice to Produce is, in the circumstances of the present case, deemed to be a step in the proceedings. In my viewTurpinillustrates this very point. The defendant there was sued for breach of a written contract which contained an arbitration clause. The defendant took out a summons to obtain particulars of the contract, the breaches alleged and the amount claimed. This was heard together with the plaintiffs’ summons for discovery at which hearing the defendant asked for discovery of the plaintiffs’ documents as well. The registrar then made an order for mutual discovery. Having obtained an order for discovery, the defendant applied to stay all further proceedings under s 4 of the Arbitration Act 1889 on the ground that he had not been aware that the contract had an arbitration clause until he obtained a copy of it from the plaintiffs in the course of discovery. The court held that an application for discovery constituted a step in the proceedings and the defendant was therefore not entitled to a stay. A.T. Lawrence J, at p 361, added as follows: I should have been disposed to look leniently upon the respondent’s application for particulars, if that had been the only step alleged, because the particulars were not very ample. But an application for discovery is a very different matter. 13     In the present case, Otto Marine filed the Notice to Produce nine days after entering appearance. The correct approach would be to consider whether such an application was a step in the proceedings, that is, whether it evinces an intention on the part of Otto Marine to submit to the court’s jurisdiction. 14     In my view, if a party files and serves a notice to produce under O 24 r 10 of the ROC for inspection of documents referenced in pleadings, and had done so to ascertain the nature of the claim before it to see if arbitration was an option, this act by itself is not a step in the proceedings, even without an express reservation of the right to seek a stay. InThe Londonderry Port and Harbour Commissioners v W S Atkins Consultants Limited and Charles Brand Limited[2011] NIQB 74 (“Londonderry”), the first defendant there had been served with a writ of summons but did not file a defence. Instead it made requests for discovery under O 24 R 11 of their rules of court, which requests it claimed were for the purpose of ascertaining the nature of the agreement between the parties that was the subject of the claim. The plaintiff complied with the requests and when the first defendant subsequently sought a stay in favour of arbitration, protested that the requests for discovery had constituted a step in the proceedings and that furthermore, the first defendant had written letters to the plaintiff in relation to a timetable for the service of its defence. Weatherup J granted the stay sought and held, at [25]: Similarly in the present case I am satisfied that the first defendant was investigating the nature and terms of the contractual arrangement between the parties. The request for discovery related to matters referred to in the Statement of Claim and included the contractual documents relied on by the plaintiff. The discussion of a timetable for delivery of the first defendant's defence was in the course of the ongoing exchange about the contractual documents. There was no unequivocal representation that the matter would proceed in Court and no election to waive any right to proceed by way of arbitration. The first defendant’s actions were consistent with the investigative measures being undertaking to ascertain the terms of engagement between the plaintiff and the first defendant. While it would have been desirable if the first defendant had stated expressly in correspondence that the right to apply for a stay was reserved while the contractual arrangements were being investigated, that was not essential in order to maintain the right to make the application for the dispute to be determined by arbitration. 15     I thinkLondonderryis on all fours with the present case. I admit to some difficulty with Otto Marine’s claim that it was in ignorance of its rights because of what can only be described as its own lamentably poor system of record keeping and the curious concatenation of events that it said made it difficult for it to discover the terms of the contract at dispute. However I am satisfied, on the balance of probability, that in the circumstances of this case and taking into account the contents of the Notice to Produce and the correspondences between the parties that were exhibited to me, Otto Marine was genuinely seeking to investigate the nature of the contractual arrangements under which Amoe was making its claim in court. I note that the Notice to Produce asked for the Work Order containing the possible arbitration clause and also for variation orders, statements of accounts and invoices. I am satisfied that these other documents are relevant for the purposes of considering whether the dispute falls within the arbitration clause. 16     The evidence before me was that on 12 April 2013, solicitors for Otto Marine wrote to ask for an extension of time to serve a defence on the basis that inspection had been set for 15 April 2013 and that was also the deadline for filing and service of its defence. Amoe agreed to extend the deadline to 22 April 2013. On 15 April 2013, Otto Marine’s solicitors collected copies of the documents requested in the Notice to Produce. It was found that the reverse side of the Work Order containing its terms and conditions had not been produced by Amoe. On 16 April 2013, Otto Marine’s solicitors again wrote to Amoe’s solicitors, an extract of which was in the following terms: … Further, we are instructed that the bulk of the original documents pertaining to the facts in the suit were retained by your clients. Our clients therefore require sight of the documents to understand your clients’ allegations. In any event, our clients agree to serve their defence,if anybyMonday, 22 April 2013 at 4pm. For the avoidance of doubt, our clients reserve the right to request or apply for further extensions of time to file their defence. While reviewing the documents provided to us by way of your letter dated 15 April 2013, we note that you have omitted to provide us with the reverse side and/or page 2 of the item enumerated at no. 1 of our Notice to Produce Documents referred to in Pleadings dated 1 April 2013. We trust your omission is not deliberate. Kindly provide us with a copy of the reverse side of the [Work Order] dated 6 August 2010 soonest possible. [emphasis in original] 17     Amoe’s solicitors replied on 17 April 2013, the next day, saying: We note your clients’ agreement to serve their defence, if any, by Monday, 22 April 2013, 4pm. Please take notice that our client reserves its right to apply for a judgment in default of defence if your clients fail to serve their defence by the Agreed Deadline. The letter also attached the omitted copy of the reverse side of the Work Order which had only just been found by Amoe. 18     I note that the first letter of 12 April 2013 seeking an extension of deadline to file a defence did not expressly say that a defence would be filed and I have no difficulty in accepting that this request was made in abundance of caution and was not a representation that Otto Marine would be abandoning any right to a stay. I further note that the letter of 16 April 2013 from Otto Marine to Amoe stated that their defence,if any, would be filed by 22 April 2013. I do not think that by those words “if any” Otto Marine had meant expressly to reserve its rights to seek a stay in favour of arbitration. I think any such reservation should be in the clearest possible terms. Nevertheless, it is also not the case that Otto Marine had in that letter expressly represented that it would be filing a defence and therefore waiving its right to seek a stay of proceedings. Otto Marine was saying only thatifit was going to file a defence, it would do so by 22 April 2013. I note too that Amoe had acknowledged the possibility that Otto Marine would not be filing a defence. I accept that at that point Otto Marine did not know of the terms of the Work Order and it therefore did not know of the arbitration clause. 19     In my view, Otto Marine, like the first defendant inLondonderry, was in issuing the Notice to Produce, only seeking to ascertain the nature of the agreement under which the plaintiff was making its claim. Its subsequent conduct, as the correspondence between the solicitors makes clear, was also consistent with this intention. Until it was made fully aware of the terms of the Work Order on 17 August 2013, none of its actions could be said to have been an unequivocal election to pursue one course or another. None of these actions was made in full awareness of the facts and in particular that there was an applicable arbitration clause. The evidence showed that once it obtained the reverse side of the Work Order, and was made cognisant of the terms and conditions inscribed thereon, it sought with due and reasonable speed to assert its right to seek a stay. On 19 April 2013, Otto Marine through its solicitors wrote to Amoe referring to cl 13 of the Work Order and said that the clause entitled it to seek a stay of proceedings. It invited Amoe to withdraw the suit but the request was rejected by way of a letter dated 22 April 2013. 20     I find that Otto Marine’s act of issuing the Notice to Produce was not a submission to jurisdiction. It was therefore not a step in the proceedings within the meaning of s 6(1) of the Act. I also find that the correspondence between solicitors did not amount to a waiver of the right to arbitration. I thus allow the appeal and order the proceedings stayed for arbitration pursuant to cl 13 of the terms of the Work Order.",
        "Costs and conclusion": "21     The assistant registrar below awarded costs fixed at $9,000 to Amoe which was also the subject of appeal by Otto Marine. There were six affidavits filed in this matter which also had to do with a somewhat novel point of law. I set aside the costs ordered below and award costs of $6,000 to Otto Marine for the hearing below and $8,000 for the costs of this appeal.  [note: 1]Mok’s second affidavit of 14 May 2013, paras 16–21"
    }
}