{
    "case_title": "Associate Dynamic Builder Pte Ltd\n      v\n      Tactic Foundation Pte Ltd",
    "ncitation": "[2013] SGHCR 16",
    "coram": "Chong Chin Chin AR",
    "sections": {
        "Background": "2       The Plaintiff is a company that carries on the business of a general contractor, including the provision of foundation works and major upgrading works. The Defendant specialises in the field of foundation works, in particular temporary earth retaining system works. 3       The dispute concerns the payment due for temporary earth retaining works that were carried out by the Defendant in relation to a project along Greenleaf Road for the erection of 8 units of 2 storey detached houses (the “Project”). 4       The developer for the Project is Link (THM) Prestige Homes Pte Ltd (“Link”) and the main contractor is Labcon Contractor Pte Ltd (“Labcon”). The Plaintiff was awarded the temporary earth retaining structure works for the Project by Labcon as a nominated sub-contractor for a sum of S$2,179,922.50. 5       The Plaintiff then sub-contracted the entire works to the Defendant and the terms and conditions are set out in a letter of award dated 4 August 2011 (the “Agreement”). The terms of the contract between the Plaintiff and Labcon (which as described as a “nominated sub-contract”) are expressly incorporated pursuant to clause 7 of the Agreement. It is also stated that the Defendant had agreed to “undertake the construction and delivery of all works stated in the nominated sub-contract on behalf of [the Plaintiff] for a lump sum amount of S$2,179,922.50 less a discount at the rate of 30%” or S$1,525,945.75. 6       In the course of the works, the Defendant would submit various progress claims to the Plaintiff which would in turn make back-to-back claims to Labcon. It is not in dispute that the Plaintiff would reproduce the exact information set out in the Defendant’s progress claims on its letterhead for onward transmission to Labcon. Upon receipt of payment from Labcon, the Plaintiff would deduct 30% and forward the balance payment to the Defendant. 7       According to the Plaintiff, in or around January 2012, the Defendant’s works caused some movement in the earth structure, thereby resulting in damage to three neighbouring properties. Consequently, on 2 March 2012, the Building and Construction Authority (“BCA”) revoked Link’s permit to carry out building works with immediate effect (the “stop work order”). The owners of the affected properties commenced legal suits against Link, Labcon and the Defendant for the damage caused to their properties. Link, Labcon and the Plaintiff entered into a tripartite agreement dated 5 June 2012 where each party agreed to bear one-third of the costs, fees and damages payable to the plaintiffs in those suits. The Plaintiff alleged that the Defendant was not a party to the tripartite agreement because the latter had refused to be accountable for the damage caused to these properties. The Plaintiff intimated that it would be seeking an indemnity from the Defendant for all the losses and damages arising from the defective works. It is a common position of both parties that this tripartite agreement is not directly relevant to the dispute at hand. 8       There is disagreement between the parties as to when the Defendant stopped work for the Project. Even though the stop work order was lifted on or about end May, the Plaintiff maintained that the Defendant had ceased all works under the Agreement in or around March 2012. In spite of various reminders by the Plaintiff and Labcon for the Defendant to complete the works, the Defendant failed to do so even as late as December 2012. The Defendant denied the allegation that it had not done any further work after March 2012. However, it is not entirely clear from the affidavit evidence when the Defendant actually resumed work for the Project. In this connection, there are some inconsistencies in the Defendant’s affidavit evidence. In the first affidavit dated 4 April 2013, Mr Su Chun Hsu, the director and sole shareholder of the Defendant averred that works resumed at the Project at around September 2012 and the Defendants duly completed its scope of works under the Agreement around October 2012. In the second affidavit dated 7 May 2013, Mr Su exhibited copies of Labcon’s sub-contractors’ daily report as well as tax invoices from the transport companies to refute the Plaintiff’s allegations that the Defendant had not done any work since March 2012. These daily reports and tax invoices are dated between June and October 2012, thereby suggesting that work had resumed before September 2012. At the hearing, counsel for the Defendant submitted that the date given in the first affidavit could have been erroneous. 9       On 21 March 2012, the Defendant submitted progress claim no. 7. The claim was not certified in full by the project consultants and therefore was not fully paid. The Defendant went on to submit similar (though not exactly identical) progress claims for the months of April 2012, June 2012 and October 2012 in relation to progress claims no. 8, no. 9 and no. 10. 10     On or about 23 November 2012, the Defendant submitted its progress claim no. 11 for the sum of $193,632.63 (before GST) to the Plaintiff for work done from 4 August 2011 to 23 November 2012 (the “Payment Claim”). There was no payment response from the Defendant. On 11 December 2012, the Plaintiff sent an email to the Defendant to request for a breakdown for every strut serial number claimed for assessment by the project architect. Later in the same afternoon, the Defendant informed the Plaintiff that it intends to apply for adjudication on the Payment Claim. On 14 December 2012, the Defendant lodged an application for adjudication under the Building and Construction Industry Security of Payment Act (the “Act”) in relation to the Payment Claim. The Plaintiff also did not lodge an adjudication response. 11     The Plaintiff averred that it was not aware of the legal significance of not serving a payment response or adjudication response. The Plaintiff also did not seek formal legal advice on the adjudication. 12     No adjudication conference was called because there was no payment response or adjudication response. On 28 December 2012, the Defendant obtained an adjudication determination in its favour for the full amount as claimed in the Payment Claim. The Defendant then obtained leave of court on 1 February 2013 to enforce the adjudication determination in the same manner as a judgment or order to the same effect in accordance with Order 95 r 2 of the Rules of Court and entered judgment accordingly.",
        "The Plaintiff’s Contentions": "13     On 1 March 2013, the Plaintiff applied to set aside the adjudication determination. The Plaintiff relied on the following alternative grounds for the application: (a)     The Payment Claim does not fall within the scope of the Act because: (i)       The Agreement between the parties is not a construction contract within the ambit of the Act; and (ii)       The Plaintiff only has an obligation to take steps to obtain and facilitate payment from Labcon for the purposes of disbursement to the Defendant and the Plaintiff is not contractually liable to make progress payments to the Defendant; (b)     The Payment Claim is a repeat claim which is prohibited under the Act; and (c)     The Payment Claim does not contain sufficient details of the claimed amount for the purposes of the Act and the Building and Construction Industry Security of Payment Regulations (the “Regulations”).",
        "The Defendant’s Contentions": "14     In response, the Defendant submitted: (a)     The Act is applicable to the progress claims made under the Agreement between the parties. To hold otherwise would mean that a particular class of construction contracts (whereby the construction works are completely subcontracted to another party) would be carved out from the statutory scheme. (b)     The Payment Claim is not a repeat claim. Even if it is, such a claim is not prohibited under the Act. (c)     Sufficient details are provided in the Payment Claim. Even if there are deficiencies, it is not fatal and the Payment Claim is still valid.",
        "The role of the court in a setting aside application": "15     The Court of Appeal inLee Wee Lick Terence (alias Li Weili Terence) v Chua Say Eng (formerly trading as Weng Fatt Construction Engineering) and another appeal[2013] 1 SLR 401 (“Terence Lee”) examined the role of the court in a setting aside application and opined: 66    ... the court should not review the merits of an adjudicator's decision. The court does, however, have the power to decide whether the adjudicator was validly appointed. If there is no payment claim or service of a payment claim, the appointment of an adjudicator will be invalid, and the resulting adjudication determination would be null and void. 67    Even if there is a payment claim and service of that payment claim, the court may still set aside the adjudication determination on the ground that the claimant, in the course of making an adjudication application, has not complied with one (or more) of the provisions under the Act which is so important thatit is the legislative purpose that an act done in breach of the provision should be invalid, whether it is labelled as an essential condition or a mandatory condition. A breach of such a provision would result in the adjudication determination being invalid.",
        "Whether the Act is applicable to the Payment Claim": "16     The Plaintiff argued that the Act is not applicable on the facts because the Agreement between the parties is not a “construction contract” for the purposes of the Act. The Plaintiff also contended that it is not liable to make payment to the Defendant under the Agreement.  Hence, the Plaintiff cannot be considered to be a “respondent” as defined in s 2 of the Act since it is not a “person who is or may be liable to make a progress payment under a contract to a claimant”. The Plaintiff stressed that it is only an intermediary for the Defendant which had taken over the entire works from the Plaintiff under the latter’s contract with Labcon and the Plaintiff's only role is to “take steps to obtain and facilitate payment from Labcon”. In return, the Plaintiff earns a “referral fee” of 30% of the contract sum paid by Labcon to the Plaintiff before transmitting the balance of 70% to the Defendant. Thus, it is not a typical construction sub-contract within the ambit of the Act as the Plaintiff does not have a primary obligation to make payment on the progress claims submitted by the Defendant. 17     In support of the arguments, the Plaintiff primarily relied on the following terms of the Agreement: (a)Clause 7 Tactic shall function as the nominated sub-contractor and shall carry out all works and all duties accept all liabilities of the nominated sub-contractor as stated in the nominated sub-contract between Labcon and ADB. For the avoidance of doubt, ADB’s role is only to act as an intermediary for Tactic to obtain the sub-contract work. (b)Clause 9 All progress claims shall be furnished to ADB on the 23rdday of each month for processing ADB shall procure monthly progress payment diligently from Labcon in accordance with the nominated sub-contract and shall make disbursement within seven (7) days of receipt of payment monies from Labcon. The Plaintiff also pointed to other clauses in the Agreement whereby the Defendant agreed to liaise with the developer and its consultant (clause 4) as well as to represent the Plaintiff in any disputes arising from the works (clause 10). 18     It is not in dispute that the Act only applies to a construction contract or a supply contract: see s 4 read with s 2 of the Act. The term “construction contract” is defined in s 2 to mean an agreement under which “one party undertakes to carry out construction work, whether including the supply of goods or services or otherwise, for one or more other parties”. At the hearing, the Plaintiff understandably did not strenuously contend that the work done by the Defendant falls outside the statutory definition of “construction work”. In my view, it is clear that the Agreement between the parties is a construction contract because the Defendant has undertaken construction work for the Plaintiff which is in turn contractually bound to complete those works under its contract with Labcon. 19     I now turn to the Plaintiff’s contention that the Act is not meant to apply to the Agreement because the Plaintiff has never undertaken an obligation to pay the Defendant and that the Plaintiff is only obliged to “procure” monthly progress payments from Labcon by acting as an intermediary to facilitate the submission of the progress claims from the Defendant to Labcon through the Plaintiff. 20     Clause 9 of the Agreement states that the Plaintiff shall “procure” monthly progress payment from Labcon. The meaning of the word “procure” was judicially considered inTan Hock Keng v L & M Group Investments Ltd[2002] 1 SLR(R) 672 at [28]: 28    We note that one of the meanings given to the word \"procure\" in theShorter Oxford English Dictionary(3rd Ed) vol II is \"to induce, persuade\". But the other meanings given are \"to bring about\", \"to cause\", \"to obtain\" and \"to acquire\". What is the correct meaning to give to the word \"procure\" in cl 15.1 must depend not only on its context but also the context of the entire document. We are unable to accept Tan's contention that in the context of cl 15.1 the word \"procure\" means only to \"persuade or take steps\". If that was the intention, then the parties would have easily used the clearer word \"endeavour\", or the expression \"use his best endeavour\". If the parties had intended that there should be some flexibility in relation to the obligation, they would have adopted a modified form of words as they had done in cl 2.3: \"the parties shall use their respectivebest endeavours to procurethe fulfilment ...\". In our judgment, the word \"shall procure\" in cl 15.1 means \"shall cause a thing to be done\", \"shall ensure\" or \"shall bring about\". It is a definite obligation which is being assumed. While we agree that \"procure\" in cl 15.1 does not mean that Tan undertakes to pay the loans himself but it does mean that Tan undertakes to ensure that KWF would repay and when KWF does not repay, Tan would have breached his obligation of \"ensuring\" or \"seeing to it\" that KWF repay. 21     As observed above, the word “procure” can be interpreted in at least two different ways. The question then is which interpretation the court should adopt for the purposes of the Agreement. When interpreting the Agreement, the court has to ascertain the meaning which the Agreement would convey to a reasonable business person: seeZurich Insurance (Singapore) Pte Ltd v B-Gold Interior Design & Construction Pte Ltd[2008] 3 SLR 1029 at [131]. Looking at the context of the Agreement, I am of the view that the word “procure” means a definite obligation on the Plaintiff’s part to ensure that Labcon makes the monthly progress payments. If the Plaintiff’s submission is correct, i.e. the Plaintiff is only obliged to persuade Labcon to make payment and nothing more, the following consequences will follow: (a)     the Defendant would be left without any recourse against the Plaintiff if Labcon for any reason fails to make payment to the Plaintiff after receiving the Defendant’s progress claims that are submitted through the Plaintiff; (b)     the Defendant would also not have any contractual remedies against Labcon for the work done given that there is no direct contractual relationship between them; and (c)     at the same time, the Plaintiff would enjoy a substantial 30% cut of the progress payments without incurring any risk of non-payment on the part of Labcon as long as the Plaintiff fulfils the administrative role of forwarding the Defendant’s progress claims to Labcon. 22     Having regard to the circumstances and the context of the Agreement, I am of the view that the Plaintiff’s interpretation does not reflect the mutual intentions of the parties. The Plaintiff sought to convey the impression that it is nothing more than an intermediary to help the Defendant secure the sub-contract works. The reality is that the Plaintiff does not drop out of the picture. It remains contractually bound to complete the works under its contract with Labcon and such an obligation is being fulfilled by the Defendant in a back-to-back arrangement. The Plaintiff is the only person who is contractually entitled to demand for payment from Labcon. It is inconceivable that the Defendant would have agreed to undertake the works without any corresponding obligation on the part of Plaintiff to ensure that payment is made upon completion of the works by the Defendant. 23     In my opinion, the Plaintiff’s argument that it has no obligation to pay the Defendant must also fail on the face of clause 9 of the Agreement. Clause 9 states that the Plaintiff has to pay the Defendant within seven days of receipt of payment from Labcon. In other words, there is an obligation to pay but this obligation is contingent upon the receipt of monies from Labcon. I agree with the adjudicator that such a clause falls within the description of a “pay when paid” provision as described in s 9(2)(a) of the Act and is unenforceable by virtue of s 9(1) of the Act. Thus, the Plaintiff cannot rely on the non-receipt of monies from Labcon as a basis not to pay the Defendant. Nevertheless, the obligation to pay remains and the payment date would be governed by s 8(2) of the Act since that the construction contract does not provide for a date on which a progress payment becomes due and payable. 24     Accordingly, I find that the Act is applicable to the Agreement and the Payment Claim.",
        "Whether the Payment Claim is invalid as a repeat claim": "25     The Plaintiff’s key submissions that the Payment Claim is invalid for being a repeat claim can be summarised as follows: (a)     The Plaintiff relied on the following to show that the Payment Claim is a repeat claim: (i)       The Defendant had ceased all works for the Project around March 2012. Yet, the Defendant issued four further progress claims (including the Payment Claim in question) from April 2012 to November 2012 for alleged work done during that time. These claims are in truth repeat claims for work done previously; (ii)       Even though there are fluctuations in the figures for some of the individual items in the various progress claims, the Plaintiff submitted that these are artificial adjustments to create the impression that the claims are different since no work was actually done by the Defendant. The Plaintiff pointed out that most of the claims found in the Payment Claim are in fact present in progress claim no. 9 dated 18 June 2012. The figures increased substantially for many items in progress claim no. 10 dated 8 October 2012 only to revert to lower figures again in the Payment Claim dated 23 November 2012. If work was really done by the Defendant, the figures claimed should increase; and (iii)       Even if the Defendant had done some work for the Project from June to October 2012, by the Defendant’s own admission in its letter dated 27 December 2012, it had completed the work for the Project on 4 October 2012. In other words, no work was done between progress claim no. 10 and the Payment Claim. Hence, the Payment Claim is a repeat of progress claim no. 10. (b)     Under s 10(1) of the Act, a claimant may only serve one payment claim in respect of a progress payment. The Plaintiff submitted that I am bound by the ruling inJFC Builders Pte Ltd v LionCity Construction Co Pte Ltd[2013] 1 SLR 1157 (“JFCBuilders”) that repeat claims are prohibited under the Act; (c)     The observations made by the Court of Appeal inTerence Leeand by the High Court inAdmin Construction Pte Ltd v Vivaldi (S) Pte Ltd[2013] SGHC 95 (“Vivaldi”) that repeat claims are not prohibited under the Act areobiter dicta; 26     In response, the Defendant submitted that: (a)     The Payment Claim is not a repeat claim as additional works were done by the Defendant; (b)     Even if the Payment Claim contains items which constitute a restatement of items in previous progress claims, such a claim is not prohibited under the Act. As long as there is no repeat adjudication over the same claim, there is no abuse of process. The Defendant relied on theobiter dictainTerence LeeandVivaldi. (c)     There is no prejudice caused to the Plaintiff as the Plaintiff can raise its disputes in the payment response or adjudication response. 27     The question of whether a repeat claim is an invalid claim under the Act was recently considered inVivaldi. In that case, one of the grounds for the setting aside of an adjudication determination under the Act was that the payment claim in question (“third payment claim”) was identical to the preceding payment claim, in terms of the claimed amount, the particulars of claim as well as enclosures. The third payment claim was dated 24 November 2011 and it contained claims for work done and completed as early as January 2011. Loh J was of the view that the repeat claim was not invalid. Having considered the Court of Appeal’s decision inTerence Lee, Loh J succinctly distilled the applicable legal principles at [52]: 52Terence Leemade clear the following in relation to “repeat claims”: (a)    First, a subsequent payment claim can include a sum which has been previously claimed (and therefore in one sense a “repeat” claim), but has not been paid. S 10(4) of the Act specifically deals with this.A fortiori, I would imagine that if a piece of work was done within the relevant month but not included for any reason in the relevant payment claim, there cannot be a bar against it being included in a later payment claim. (b)    Secondly, where a payment claim has been made, but has not been adjudicated upon,eg, because no adjudication application was made, it still remains an “unpaid” claim and could be the subject matter of a later payment claim and adjudication; seeTerence Leeat [92]. For example, a claimant may choose not to lodge an adjudication application as he is too tied up trying to carry out his works or the requirements in s 12 of the Act were not or not yet satisfied; therefore the subsequent payment claim may include (“repeat”) items in common and they nonetheless remain unpaid claims for the purposes of s 10(4) of the Act. (c)    Thirdly, a payment claim that has been dismissed by an adjudicator for being served prematurely or as an untimely claim under reg 5(1) or a premature adjudication application may be the valid subject of a subsequent adjudication provided it was not adjudicated upon and dismissed on its merits; it does not provide any ground for an estoppel. (d)    Fourthly, a payment claim or any part thereof which has been validly brought to adjudication and dismissed on its merits cannot be the subject of a subsequent payment claim or subsequent adjudication. He concluded that there is no prohibition against a “repeat” claim unless it falls within [52(d)] as set out above. 28     The above observations areobiterbecause the case was disposed of on a different ground. Loh J held that the adjudicator had no authority or jurisdiction to deal with the adjudication application because the parties had entered into a settlement agreement that had extinguished all the rights under the construction contract. Thus, the claimant no longer has a right to apply for adjudication for any payment claims purportedly issued under the construction contract. 29     Likewise, the observations made by the Court of Appeal inTerence Leeconcerning repeat claims are alsoobiter dicta. The dispute before the court did not relate to a repeat claim. Instead, the specific issue for determination before the court inTerence Leewas whether the payment claim was served out of time. The court ruled that there is nothing in the language of reg 5(1) of the Regulations to compel a claimant to make monthly payment claims for work done in the previous month. The mandatory language of reg 5(1) of the Regulations and s 10(1) of the Act only serves to impose a maximum frequency of one payment claim per month: seeTerence Leeat [90]. 30     I now turn to the case ofJFC Builderswhich also considered the validity of repeat claims. InJFC Builders, the payment claim was considered to be a repeat claim because it merely repeats the earlier claim without any additional item of claim apart from the giving of credit for part payment received on the previous claim. I note on the facts ofJFC Buildersthat the payment claim would have been identical in quantum to the previous claim but for a deduction of $125,000 as part payment: seeJFC Buildersat [8] and [47]. 31     Woo J held that such a repeat claim is invalid under the Act. The detailed reasoning is extracted below: 67    In my view, s 10(1) does impliedly preclude a claimant from making a repeat claim. Otherwise there would be no purpose in having s 10(1). Furthermore, it is because s 10(1) contains this implied prohibition that s 10(4) starts off by stating \"Nothing in subsection (1) shall prevent ...\". If there is no prohibition in s 10(1) in the first place, then the starting words in s 10(4) are unnecessary. Furthermore, Mr Lam did not suggest that s 10(1) imposed a prohibition other than the one contended by Mr Chan. Indeed, as mentioned above, he appeared to accept Mr Chan's position on s 10(1) but not on s 10(4). 68    It also seemed to me that it is an abuse to allow a claimant to make repeat claims which he will do if, for example, he has missed the deadline under SOPA to serve his earlier payment claim. Indeed, the deadline to do so would also be rendered largely nugatory if he can resurrect a new deadline by merely issuing and serving a repeat claim. 32     As to the observations made by the Court of Appeal inTerence Leedisapproving the finding inDoo Ree Engineering & Trading Pte Ltd v Taisei Corporation[2009] SGHC 218 that s 10(1) of the Act prohibits all repeat claims, Woo J opined: 78    It is not clear to me whether the Court of Appeal was referring to a repeat claim as I have described it at [48] [sic] above or not. Moreover, no reasons were given for its view. Accordingly, I will say no more about it for the time being. 33     The above observations were highlighted by Loh J inVivaldibut he did not share the same reservations. He opined that the decision ofTerencehas put the matter concerning validity of repeat claims beyond doubt and he added the following observations at [53] on repeat claims where no new work was done: 53    I accept that the Court of Appeal inTerence Leedid not expressly say that claimants could incorporate an unpaid payment claim into a subsequent payment claim which isemptyin content (ie, with no claim for new work done). However, I think it follows from the foregoing that there is no prohibition against a “repeat” claim unless it falls within [52(d)]: see also the extra judicial comments by Chan Sek Keong, former Chief Justice who delivered the judgment inTerence Lee, in the Foreword to Chow Kok Fong,Security of Payments and Construction Adjudication, (Lexis-Nexis, 2ndEd, 2013). In principle this must be correct,viz, that any payment claim or claims, even if “repeated” in more than one payment claim, can only be the subject, on the merits, of one adjudication. 34     The same view was expressed by former Chief Justice Chan Sek Keong in his foreword to Chow Kok Fong,Security of Payments and Construction Adjudication, (Lexis-Nexis, 2013, 2ndEd) after noting thatJFC Buildershad sought to distinguish the decision ofTerence Lee: 12.    In fact, the Court of Appeal did explain its holding (ie, the Act does not bar a claim that has not been adjudicated on the merits, eg, where it has been rejected on technical grounds of prematurity). Moreover, as noted by the Assistant Registrar inJFC Builders, Progress Claim 7 was never adjudicated on the merits. Hence, the type of case discussed by the Court of Appeal was the same type of case dealt with inJFC Builders. ... having regard to its substantive decision in that case that reg 5(1) of the SOP Regulations does not prescribe a limitation period for the making of payment claims (unless one is imposed by the contract), it would be inconsistent with principle and the scheme of the Act to bar the claimant from making the claim subsequently. 35     I note thatJFC Buildersdealt with an appeal against the assistant registrar’s decision and the appeal was disposed of on 11 October 2012. The written grounds were released on 30 November 2012. The judgment inTerence Leewas reserved and the written grounds were only released on 2 November 2012. In other words, the decision inJFC Builderswas made without the benefit of the written grounds from the Court of Appeal inTerence Lee. This is unlike the case ofVivaldiwhere the parties had agreed that Loh J should await the outcome of the appeal inTerence Leebefore making his decision. 36     I have reservations as to whether the decision ofJFC Builderson the validity of a repeat claim is compatible with the reasoning inTerence Lee.The same view was expressed by Loh J inVivaldiafter considering the Court of Appeal judgment. This is especially so where one of the reasons for rejecting repeat claims inJFC Buildersis that it is an abuse to allow a claimant to circumvent the deadlines for service of payment claims found in the legislation: seeJFC Buildersat [68]. This is in direct conflict with the Court of Appeal observations that the legislation does not impose such a deadline for the submission of payment claims. To hold that a repeat claim is prohibited under the Act would also be contrary to the Court of Appeal’s observation that s 10(4) of the Act was intended to widen the scope of s 10(1) of the Act by providing an added option of including in a payment claim unpaid amounts made in earlier claims: seeTerence Leeat [91]. As long as a previous payment claim has not been paid or partially paid and has not been the subject of an adjudication determination, it is an unpaid claim and can be rolled up pursuant to s 10(4) in subsequent payment claims. 37     I am of the view that I am not bound to follow the case ofJFC Buildersas it is distinguishable on the facts.In JFC Builders, the payment claim which formed the subject matter of the adjudication determination is identical to the previous payment claim (save for some deductions for part payment) and no further work was done. I note that Woo J had carefully confined his decision to this type of repeat claims: seeJFC Buildersat [78]. In this case, the amounts claimed in the different payment claims for particular items of work are not identical and there is a dispute between the parties as to whether additional works were undertaken by the Defendant. 38     Turning to the facts of the present case, it is clear that the Payment Claim consists of items of work which are found in previous progress claims. After all, the Payment Claim is for work done from 4 August 2011 to 23 November 2013 and it would overlap with the previous progress claims. In relation to the components of the Payment Claim that consist of repeated claims found in previous progress claims, these would constitute “repeat” claims as described in [52(a)] ofTerence Lee.Such claims are permissible under s 10(4) of the Act. 39     In relation to other components whereby the quantum claimed are different, there is a question as to whether the Defendant had undertaken further work on the Project after March 2012. The Plaintiff’s position is that all work had ceased by then. To refute the Plaintiff’s assertion, the Defendant exhibited copies of Labcon’s sub-contractor’s daily reports as well tax invoices from transport companies to the Defendant in relation to the Project between June and October 2012. The Plaintiff disputed the cogency of the documentary evidence and suggested that the evidence did not show conclusively that the work was carried out by the Defendant and not someone else. At the same time, the Plaintiff did not produce any evidence to show that another contractor had been instructed to undertake the works of the Defendant. In my view, the Plaintiff has not established conclusively on the affidavit evidence that no further work was undertaken by the Defendant after the lifting of the stop work order and I decline to make that finding. 40     The Plaintiff also argued in the alternative that the Defendant had, by its own admission, stated that no further work was done for the Project after 4 October 2012. If so, all the claims for work done should have been captured in progress claim no. 10 dated 8 October 2012. Therefore, the Payment Claim dated 23 November 2012 has to be regarded as a repeat claim of progress claim no. 10. Having regard to the authorities ofTerence LeeandVivaldi, this argument must fail. The Defendant is not precluded as a matter of law from making the Payment Claim in November 2012 in respect of the items which remained unpaid by the Plaintiff in previous progress claims. 41     The Plaintiff emphasised repeatedly during the hearing that the Defendant had not provided a satisfactory explanation as to why: (a) the quantum of the claims fluctuated between the last 3 progress claims; and (b) some of the figures in the various progress claims remain constant even though the Defendant allegedly had done work on the Project. The Plaintiff argued that thebona fidesof the Defendant’s claim is put in question. At a setting aside application, I am of the view that it would not be appropriate for the court to make a summary determination on such matters. Whether the claim is sustainable on the merits should be dealt with by the adjudicator or at subsequent dispute resolution proceedings commenced for the purpose of determining the rights of each party conclusively. To do otherwise could undermine the efficacy of the legislative scheme which is aimed at ensuring that payment claims are expeditiously dealt with by the adjudicator and enforced in the courts until such time when the parties decide to have the substantive issues dealt with at the chosen dispute resolution forum (whether in the courts or by way of arbitration). 42     The practical course for the Plaintiff to take is to put in a payment response and adjudication response if it wishes to challenge the basis of the claim before the adjudicator. By failing to do so, the Plaintiff can only challenge the quantum claimed in subsequent court proceedings. Such a challenge on the merits of the Defendant’s claim should not constitute a ground to set aside the adjudication determination.",
        "Whether there are insufficient particulars in the Payment Claim": "43     The Plaintiff argued that the Payment Claim is invalid because of lack of particulars and this is in breach of s 10(3) of the Act and reg 5(2)(c) of the Regulations. 44     Section 10(3) of the Act states: (3)    A payment claim — (a)    shall state the claimed amount, calculated by reference to the period to which the payment claim relates; and (b)    shall be made in such form and manner, and contain such other information or be accompanied by such documents, as may be prescribed. 45     Regulation 5(2)(c) states: (2)    Every payment claim shall — (a)    be in writing; (b)    identify the contract to which the progress payment that is the subject of the payment claim relates; and (c)    contain details of the claimed amount, including — (i)    a breakdown of the items constituting the claimed amount; (ii)  a description of these items; (iii)  the quantity or quantum of each item; and (iv)  the calculations which show how the claimed amount is derived. 46     The Plaintiff argued that insufficient particulars were given by the Defendant in relation to the claims for certain strutting system found in Part D of the Payment Claim. As a result, the project quantity surveyor could not certify the amount due. The project quantity surveyor had requested for a breakdown in tabulation format for every strut serial number on 11 December 2012 but the Defendant did not provide any further information. The Plaintiff further alleged that the Defendant’s handwritten calculations of the sum payable for the strutting system found in the 2ndlayer strutting layout plan which did not tally with the figures found in the Payment Claim. On 24 January 2013, the project quantity surveyor also informed the Plaintiff had made an “over claim” for the sums at Part D of the Payment Claim. 47     At the hearing, the Defendant contended that there were sufficient particulars. However, it did not seek to defend the accuracy of the handwritten calculations provided by the Defendant. Instead, it was submitted that the court should not delve into the merits of the claim and that the Plaintiff should commence separate legal proceedings against the Defendant if it challenges the quantum of the claim. If the court were to find that the particulars were lacking, such insufficiency of particulars is not fatal to the claim based on the case ofAustralian Timber Products Pte Ltd v A Pacific Construction & Development Pte Ltd[2013] SGHC 56 (“Australian Timber Products”). 48     InAustralian Timber Products, the court had to consider if a payment claim which did not comply with reg 5(2)(c)(iii) and (iv) would be rendered invalid. The payment claim in question did not contain any information about quantity and rate for the work done and there were no calculations provided in support of the claim. After considering the purpose of the Act which is to facilitate the smooth and prompt cash flow of contractors in the construction industry, the court held it was not the legislative purpose that a failure to provide those particulars would invalidate the payment claim. The relevant extracts of the judgment of Woo J are set out below: 78    Progress Claim No 9 was found wanting in detail with respect to regs 5(2)(c)(iii)–5(2)(c)(iv) of the SOPR. But this claimdidfulfil the requirements in s 10(3)(a) of the Act and regs 5(2)(a), 5(2)(b) and 5(2)(c)(i)–5(2)(c)(ii) of the SOPR. Ordinarily, a respondent receiving a payment claim with some, but not all, of the details required under reg 5(2)(c) of the SOPR will have enough information at his disposal to decide on his next course of action. In this case, APCD could have issued a payment response denying that the Variation Works were done and/or stating that there was insufficient information relating to the Variation Works. Put in another way, the lack of detail here did not in itself prejudice APCD in that it did not preclude a response from APCD. It was under these circumstances that I did not think that it was the legislative purpose to invalidate Progress Claim No 9 for failing to comply with regs 5(2)(c)(iii)–5(2)(c)(iv) of the SOPR. ... 80    To hold Progress Claim No 9 invalid for breaching regs 5(2)(c)(iii)–5(2)(c)(iv) of the SOPR would not appear to be consonant with the ideals and purpose of the Act. It would be all too easy to invalidate a payment claim for a lack of detail. In my view, the requirement to provide details in a payment claim is to facilitate the implementation of the adjudication scheme in the Act, but not to trip up claimants. It seems to me that the requirements to state the quantity of each item claimed and the calculations showing how the claimed amount is derived are only a guide for the claimant, since there are conceivablyotherimportant details to be submitted in a payment claim which are not expressly stated in reg 5(2)(c) of the SOPR. One example would be the location of the work done. It is pertinent to note here that reg 5(2)(c) of the SOPR states that details “including” [emphasis added] the ones stipulated therein should be set out in a payment claim. The details to be provided are therefore in no way exhaustively set out in reg 5(2)(c) of the SOPR. In view of this, it would seem incongruous that an omission to state, say, the quantity of the items claimed is fatal to the validity of a payment claim, whereas an omission to state the location where the work was done would not be fatal. ... I was not convinced, having regard to the important fact that the Legislature made the list set out in that provision only aninclusivelist, that a failure to state the details in regs 5(2)(c)(iii)–5(2)(c)(iv) of the SOPR would invalidate a payment claim. Accordingly, ATP’s omission to provide some of the statutorily-required details in the case before me did not invalidate Progress Claim No 9. 81    In the circumstances of this case, therefore, I found regs 5(2)(c)(iii)–5(2)(c)(iv) of the SOPR not to be so important that it was the legislative purpose that an act done in breach of these provisions should be invalid. Progress Claim No 9 was therefore not an invalid payment claim, and the Adjudication Determination could not be set aside on this ground. 49     On the facts of the case, I note that Part D of the Payment Claim sets out various details such as the description of the work done, the quantity, the contract rate and the contract amount. Based on the actual work done, the Payment Claim also computed the amount payable for actual work done based on the contract rate. Thus, this is quite different fromAustralian Timber Productswhere no particulars or calculations were provided at all: see [66]. I am of the view that the requirements under reg 10(2)(c) are met. Even if I am wrong on this issue and the particulars are found to be insufficient, the Payment Claim is not invalidated based on the authority ofAustralian Timber Products. 50     I would add that the apparent inaccuracy in the calculations for the sum payable for the strutting system is not material for the purposes of this application. If a total lack of calculations inAustralian Timber Productsdoes not invalidate the payment claim,a fortiori, any erroneous calculations should also not invalidate the payment claim. 51     Moreover, it would not be appropriate for the court to review any quantification error at a setting aside application because such an error would go to the merits of the adjudication determination: seeTerence Leeat [66]. If there are errors in the quantification of the claim on the part of the adjudicator, such errors can be rectified in subsequent court proceedings which would be determinative of the dispute between the parties: seeTerence Leeat [4] andSEF Construction Pte Ltd v Skoy Connected Pte Ltd[2010] 1 SLR 733 at [42]. 52     The Plaintiff sought to distinguishAustralian Timber Productson the basis that clarification on the Payment Claim was sought from the Defendant and the Defendant did not respond, unlike in the case ofAustralian Timber Productswhere no clarification was asked for. I do not see how this would be a relevant distinguishing factor. Nothing in that decision turns on this point.",
        "Conclusion": "53     For the foregoing reasons, I dismissed the application to set aside the adjudication determination."
    }
}