{
    "case_title": "Diamond Exchange of Singapore \n      v\n      Singapore Diamond Exchange Pte Ltd",
    "ncitation": "[2013] SGHCR 10",
    "coram": "Eunice Chua AR",
    "sections": {
        "Facts": "2       The plaintiff, Diamond Exchange of Singapore, is a trade association registered as a society in Singapore since 20 August 1976. It seeks to,inter alia: promote and foster all aspects of the trade, commerce and business of wholesale importers and exporters of diamonds and other precious and semi-precious stones, pearls and jewellery and any allied business in Singapore and to consider all matters affected or concerning such trade, commerce and business and generally to watch over and protect the interest of its members engaged in the business.[note: 1] 3       The plaintiff’s members are manufacturers, dealers, wholesalers, retailers and individuals in the trade of diamonds, other precious and semi-precious stones, pearls and jewellery. 4       On 21 November 2012, the plaintiff commenced suit against the defendant, Singapore Diamond Exchange Pte Ltd, for passing off and on the ground that the defendant’s name is a colourable imitation of the plaintiff’s name under s 55 of the Trade Marks Act (Cap 332, 2005 Rev Ed). On 11 March 2013, the defendant filed an application to seek security in the sum of $35,000 against the plaintiff for costs up to completion of discovery. 5       The defendant relied on the following pieces of circumstantial evidence to justify invoking the court’s discretion to order security for costs: (a) the plaintiff is a not-for-profit organisation; (b) the plaintiff’s membership has since 1987 declined from 73 members to 43 in 2011; (c) the amount of fees payable by the plaintiff’s members for subscriptions each year has not been disclosed by the defendant; (d) the plaintiff’s income is primarily from member’s subscriptions; and (e) the plaintiff’s latest annual return available from the Registry of Societies was from 2010. 6       The president of the plaintiff, on behalf of the plaintiff, responded on affidavit to emphasise the strengths of the plaintiff’s claim against the defendant and to state that the factors relied on by the plaintiff were “neither here nor there”, did not set out a complete picture, or were non-issues. The president of the plaintiff did not produce the plaintiff’s accounts or say that the plaintiff held sufficient assets to pay the costs of the defendant if the defendant were successful in its defence. Rather, he stated that the plaintiff was a trade association whose members were involved in the trade ofdiamonds, and that he had “every confidence that the [plaintiff] will remain solvent and will continue to fully function regardless of the outcome of [the] action”.[note: 2]He also stated that each of the members of the plaintiff was a “quality member with many years of reputable trading history” and that collectively they were “well able to fund the activities of the [plaintiff], including the present action”.[note: 3]He admitted that the plaintiff had been late in filing its annual returns with the Registry of Societies but that it had since done so.",
        "Background to s 36(1) of the Societies Act": "7       Section 36(1) of the Societies Act states: Where a registered society or any of its officers purporting to act on its behalf is plaintiff in any action or other legal proceeding, the court having jurisdiction in the matter may, if it appears by credible testimony that there is reason to believe that the society or the officer will be unable to pay the costs of the defendant if successful in his defence, require sufficient security to be given for those costs and stay all proceedings until the security is given. 8       This section was introduced by the Societies (Amendment) Bill 1982 (Act 16 of 1982) (“the Amendment Bill”). During the second reading speech of the Amendment Bill in Parliament, the purpose of s 36(1) was described as follows (Singapore Parliamentary Debates,Official Report(27 July 1982) vol 42 cols 56–58): The purpose of this Bill is to amend the Societies Act so as to empower the court, where proceedings are instituted by a registered society, to require it to furnish sufficient security for costs that might be incurred by the defendant in such proceedings. … Mr Speaker, Sir, it is common knowledge that costs will have to be paid in any civil litigation. The party that loses his case in court will normally have to pay the costs of not only his, but that of the other party.If the court's order is not observed then, as the law stands at present, any judgment against a registered society can only be enforced by writs of execution against the assets of the society. However, there are instances where the successful party has not been able to recover the costs from the plaintiff. This means that if a society institutes legal proceedings but it does not have the assets or funds to meet the costs of such proceedings, a defendant who successfully defends an action brought against him by a society would be unable to recover his costs from the society. This is not an academic issue. We have the recent example of a political party, the Workers Party, which instituted defamation proceedings against an individual, Mr Tay Boon Too, a former Member of Parliament, and the Attorney-General (representing the former Department of Broadcasting). The plaintiff lost its defamation case against the defendants but did not fully pay the costs awarded to the defendants. Execution and garnishee proceedings taken by one of the defendants to realize a sum of about $25,000 as costs due to him showed that the plaintiff society had only $18.47 in its bank account. I think we are all familiar with the fact that an Order of Court was applied for and obtained for the appointment of an Official Receiver, in whose hands will be placed the assets of the party and who will be charged with the responsibility of getting the assets of the party and paying out its just and lawful debts. In spite of having such a paltry sum in its bank account and still being deeply in debt, that society nevertheless had again brought another defamation suit, as we know, against the Second Deputy Prime Minister, which, if it were to lose, would render it liable to pay another large sum of money in costs. The citizens of Singapore must be protected from such acts of irresponsibility on the part of the societies or any of its officials acting on its behalf. Rights must be accompanied by responsibilities. The right to seek redress in our courts is open to all; but it must be accompanied by a responsibility to comply with the awards and orders of the court. This amending Bill does not shut off or preclude any party from resorting to justice in accordance with the law. Although access to the courts must always be made available to all to pursue their just claims and grievances, we mustensure at the same time that defendants who have been successful in warding off unjustifiable and unreasonable claims and who have been unjustifiably dragged to court, should not be left without a hope of recovering the costs that they have been made to incur.The present Bill seeks toprevent such abuse of our legal process by a registered society instituting legal proceedings without a care as to whether it has the means to meet the costs of the legal action. [emphasis added] 9       In short, the Amendment Bill was directed at giving defendants in actions brought by societies an avenue to ensure that their costs, if their defence was successful, would be recoverable. This is particularly where a society has demonstrated that it does not have sufficient means to meet orders for costs yet commences subsequent proceedings. 10     It is also important to note the context in which s 36(1) of the Societies Act operates. Under s 35(d) of the Societies Act, “no judgment in any suit against a registered society shall be put into force against the person or property of any officer or member of the society butonly against the property of the society[emphasis added]” except as otherwise provided in s  36 of the Societies Act. In the event that the court orders security for costs under s 36(1) of the Societies Act, s 36(2) provides that where the amount of the security is not sufficient to pay the costs of the defendant, a defendant may then hold the “officers of the society who approved the institution of the action or legal proceeding” and “any person who, on subsequently becoming an officer of the society, does not take any reasonable measure for the purpose of seeking the discontinuance of the action or legal proceeding” jointly and severally liable. 11     In other words, s 36 of the Societies Act not only allows a defendant to apply to court to obtain security for its costs against a society, it permits the successful defendant to enforce its entitlement to costs against officers of the society who had approved the action or legal proceeding or new officers who do not take reasonable measures to discontinue the action or legal proceeding.",
        "Principles governing the application of s 36(1) of the Societies Act": "12     Both parties agreed that the discretion of the court to order security for costs against a society is similar to the manner the discretion is applied in the context of a company pursuant to s 388(1) of the Companies Act (Cap 50, 2006 Rev Ed) because that provision isin pari materiawith s 36(1) of the Societies Act. 13     Section 388(1) of the Companies Act states: Where a corporation is plaintiff in any action or other legal proceeding the court having jurisdiction in the matter may,if it appears by credible testimony that there is reason to believe that the corporation will be unable to pay the costs of the defendant if successful in his defence, require sufficient security to be given for those costs and stay all proceedings until the security is given. [emphasis added] 14     Analogising fromCreative Elegance Sdn Bhd v Puay Kim Seng and Anor[1999] 1 SLR(R) 112 at [13], once the condition in s 36(1) of the Societies Act is satisfied (ie, it appears by credible testimony that there is reason to believe that the society will be unable to pay the costs of the defendant if successful in his defence), the court’s discretion is invoked and the court will consider all the circumstances to decide whether it is just to order the plaintiff to provide security for costs and the extent of such security.",
        "Whether the condition for invocation of the court’s discretion to order security for costs is satisfied": "15     Where the parties disagreed was whether the same considerations for determining that the condition for invoking the court’s discretion to order security for costs applied to a company and a society.",
        "The parties’ arguments": "28     The defendant argued that the court should exercise its discretion to order security for costs under s 36 of the Societies Act given that the plaintiff had failed to offer any evidence to demonstrate its ability to pay the defendant’s costs. 29     The plaintiff argued that it was not necessary for it to offer such evidence given that the defendant had not satisfied the condition to adduce credible testimony. Nevertheless, the plaintiff urged the court to consider that its claim had a good prospect of success and that the defendant had failed to place any material before the court to enable the court to come to a view on an appropriate quantum to be ordered as security.",
        "My decision": "30     Given my finding on the first issue, it was strictly not necessary to decide the second issue of whether the court should exercise its discretion to grant security for costs. However, for the sake of completeness, I note that even if the first issue had been answered affirmatively, I would not have exercised my discretion to grant security for costs against the plaintiff. 31     The fact that there was credible testimony that a plaintiff may not be able to pay a successful defendant’s costs did not mean that an order for the payment of security of costs should naturally follow barring exceptional circumstances. Although this principle has been applied inFrantonios Marine Servicesto companies, it would set the bar too low for societies. The practical effect of such a principle would be to require all societies, which generally were not profit-making or holders of substantial property, to provide security for costs in order to bring a claim. This would also be inconsistent with the illustrative example used in and the tenor of the second reading speech of the Amendment Bill, where the focus had been placed, as argued by the plaintiff, on situations where there was some history of non-payment of costs, where the society is insolvent, and where there was evidence of some abuse of the court’s process by the society. 32     In considering whether security for costs ought to be ordered against a society, the court had to consider the totality of the circumstances and balance the risk to the defendant that it may not be able to recover its costs from the plaintiff society, against allowing the plaintiff society to proceed with its claim and have its day in court without having to be put through the process of raising funds to meet an order for security for costs. In striking this balance, the court would take into account the established factors relevant to the court’s exercise of discretion, such as whether the plaintiff’s claim wasbona fideand not a sham, whether the plaintiff has a reasonably good prospect of success, whether the application for security was being used oppressively, whether the application for security is made at a late stage of the proceedings,etc(seeSingapore Civil Procedure 2013, vol 1 (Sweet & Maxwell Asia, 2013) at paras 23/3/5 and 23/3/19). 33     On the facts, taking into account the expressed willingness of the plaintiff to raise funds from its members who were persons of substance, that it was not disputed that the plaintiff’s claim wasbona fideand not a sham, that on a perusal of the pleadings and the evidence before me the plaintiff had a reasonably good prospect of success, and that the defendant had not offered any other reasons to justify an order for security or costs or the quantum sought apart from reiterating its arguments in respect of the fulfilment of the condition in s 36(1) of the Societies Act, I would not have exercised my discretion to order security for costs.",
        "Whether the court should exercise its discretion to order security for costs": "27     In respect of the second stage of the enquiry as to when the court would exercise its discretion to order security for costs, the parties were largely in agreement that the principles applicable to ordering security for costs under O 23 of the Rules of Court and s 388(1) of the Companies Act would similarly apply,ie, the court would have regard to all the circumstances of the case to determine if it was just to make the order.",
        "Conclusion": "34     For the above reasons, I dismissed the application for security for costs.  [note: 1]Statement of Claim at paragraph 2. [note: 2]Affidavit of Hathiramani Suresh Mulchand filed on 22 March 2103 at paragraph 24. [note: 3]Affidavit of Hathiramani Suresh Mulchand filed on 22 March 2103 at paragraphs 25–26."
    }
}