{
    "case_title": "Public Prosecutor\n      v\n      Lee Pit Chin",
    "ncitation": "[2013] SGHC 157",
    "coram": "Chan Seng Onn J",
    "sections": {
        "Introduction": "1       This was an appeal by the Prosecution against the sentence of three months’ imprisonment and a fine of $80,000 (in default, 12 weeks’ imprisonment) imposed on the Respondent for each of the two charges (“DAC 40848/2012” and “DAC 40849/2012”) of carrying on the business of unlicensed moneylending under the Moneylenders Act (Cap 188, 2010 Rev Ed) (“the MLA”). 2       At the conclusion of the hearing, I allowed the Prosecution’s appeal and increased the Respondent’s imprisonment term to nine months for each of the above two charges (collectively, “the ULM Charges”). The fine for each charge was not disturbed. I now give my reasons.",
        "The charges": "3       The Respondent pleaded guilty to the following charges in the District Court: (a)     the ULM Charges of carrying on the business of unlicensed moneylending in contravention of s 5(1) of the MLA, punishable under s 14(1)(b)(i) read with s 14(1A)(a), with two other similar charges taken into consideration for the purposes of sentencing; (b)     seven charges of granting an unsecured loan exceeding $3,000 to a Singapore borrower with an annual income below $20,000, in contravention of r 19(1) of the Moneylenders Rules 2009 (S 72/2009) (“the Rules”) and punishable under r 19(3)(a) of the Rules, with 15 other similar charges taken into consideration for the purposes of sentencing; (c)     three charges of granting an unsecured loan exceeding four months’ income to a Singapore borrower with an annual income of at least $30,000, in contravention of r 20(1)(a) of the Rules and punishable under r 20(4)(a) of the Rules, with four other similar charges taken into consideration for the purposes of sentencing; (d)     four charges of granting an unsecured loan exceeding two months’ income to a Singapore borrower with an annual income of between $20,000 and $30,000, in contravention of r 20(1)(b) of the Rules and punishable under r 20(4)(a) of the Rules, with seven other similar charges taken into consideration for the purposes of sentencing; and (e)     16 charges of recklessly furnishing false or misleading information to the Registrar of Moneylenders in contravention of s 24(7) of the MLA, with 34 other similar charges taken into consideration for the purposes of sentencing.",
        "The facts": "4       The following facts are taken from the Statement of Facts, which the Respondent admitted to without qualification.",
        "Background": "5       The Respondent, a 44-year-old male, was a director of James Lee Realty Pte Ltd (“JLR”), an estate agency firm. Between 1 July 2009 and 30 June 2010, he was granted a licence to carry on a moneylending business under the name and style of James Lee Credit. During this period, he committed the various offences listed above at [3]. The present appeal concerns only the two offences which were the subject matter of the ULM Charges (ie, the offences listed at [3(a)] above). 6       On 30 June 2010, the Respondent’s moneylending licence expired and was not renewed. New rules to prohibit estate agents from carrying out moneylending activities were also impending. Consequently, the Respondent shut down James Lee Credit. 7       Sometime in mid-2011, an office worker at JLR, one Yan Hwee Onn (“Yan”), came up with the idea of issuing loans to potential sellers of Housing and Development Board (“HDB”) flats who requested for loans upfront before the sale of their flats and suggested that the Respondent venture into this business. Yan told the Respondent that he (Yan) would act as the middleman between the Respondent and the sellers. He would seek out the sellers, offer and issue them loans and cash out the repayments, while the Respondent would provide the funds necessary to issue the loans. Yan further suggested that they charge a monthly interest rate of 10% on the loans, with the interest to be split 90:10 in the Respondent’s favour. The Respondent agreed to Yan’s proposal, but told Yan specifically that he would only be responsible for coming up with the funds while Yan would be the one to liaise with the sellers. 8       The arrangement was that Yan would assess the amount of loan to be issued to a seller after the valuation of the seller’s flat. After the seller granted to one of JLR’s property agents the exclusive right to sell his flat, Yan would issue the seller a small loan first. Once a buyer was secured for the flat, Yan would issue the seller a bigger loan based on his assessment of the seller’s creditworthiness and the amount of money the seller would obtain from the sale of the flat. Before issuing any loans, Yan would brief the Respondent on the details of the seller and seek his approval. Yan would also arrange for the loan documentation to be signed at a law firm. Once the seller’s flat was sold, the loan amount and interest would be deducted from the sale proceeds and given to Yan by way of a cheque issued to him. Yan would then deposit the cheque, withdraw the money and hand the Respondent the loan amount and his 90% share of the interest.",
        "The facts pertaining to DAC 40848/2012": "9       Sometime in mid-2011, one Ho Boon Siong (“Ho”) met with financial difficulties and decided to sell his flat. He met with a property agent at JLR, Patrick Tan (“Tan”), to discuss the sale of his flat. Yan attended the meeting and heard Ho saying that he was in need of money upfront before the sale of his flat. Yan then introduced himself as an agent in the moneylending business, explained the loan conditions to Ho and offered him a loan. Ho agreed to take up the loan. 10     Prior to issuing the loans to Ho, Yan consulted the Respondent and obtained his approval to issue the loans. The Respondent handed Yan the loan amounts in cash on each occasion. Yan issued several loans to Ho between October and December 2011, amounting to a total of $28,500 charged at a 10% monthly interest rate. Each time, Ho would meet Yan at a law firm and would be asked to sign the loan documentation evidencing the loans before the loans were given to him in cash. Ho was given only 90% of the agreed loan amount each time as 10% was deducted upfront as the interest payment for the first month. On 29 December 2011, upon completion of the sale of his flat, Ho repaid Yan a sum of $30,500, which was the total loan amount plus interest. The total amount of interest earned by Yan and the Respondent was $4,850, of which the Respondent’s share was $4,365.",
        "The facts pertaining to DAC 40849/2012": "11     The borrower, one Sim Boo Kwee (“Sim”), contacted Tan and appointed him as the agent for selling his flat. Sim told Tan that he needed some cash upfront before he sold his flat. Yan overheard the Respondent and Tan discussing Sim’s case. Yan then looked for Sim’s contact information in the company records, contacted Sim and offered him a loan. Thereafter, the modus operandi was the same as that in Ho’s case. 12     Between September and November 2011, Yan issued loans totalling $15,000 to Sim, charged at a 10% monthly interest rate. On 16 November 2011, upon completion of the sale of Sim’s flat, Sim repaid Yan a sum of $20,700, which was the total loan amount plus interest. The total amount of interest earned by Yan and the Respondent was $4,770, of which the Respondent took $4,293.",
        "The decision below": "13     The district judge noted the Respondent’s early plea of guilt, his co-operation with the police and his remorse (seePublic Prosecutor v Lee Pit Chin[2013] SGDC 188). She was of the view that this was not a typical loan shark case as there was no harassment of the borrowers, no unscrupulous acts on the Respondent’s part and no exorbitant interest rates charged. She also gave weight to the fact that it was Yan who played the active role in the moneylending scheme, with the Respondent’s role being limited to providing funds and approving loans which had already been assessed and recommended by Yan. Taking into account these considerations, the district judge considered that applying the “clang of the prison gates” principle would be sufficient deterrence and punishment for the Respondent. She therefore sentenced the Respondent as follows: (a)     three months’ imprisonment and a fine of $80,000 (12 weeks’ imprisonment in default) for each of the ULM Charges; (b)     a fine of $3,000 (one week’s imprisonment in default) for each of the charges under r 19(1) of the Rules; (c)     a fine of $3,000 (one week’s imprisonment in default) for each of the charges under r 20(1)(a) of the Rules; (d)     a fine of $3,000 (one week’s imprisonment in default) for each of the charges under r 20(1)(b) of the Rules; and (e)     a fine of $17,000 (two weeks’ imprisonment in default) for each of the charges under s 24(7) of the MLA. 14     The district judge ordered the imprisonment terms with respect to the ULM Charges to run concurrently. The Respondent’s total sentence was therefore three months’ imprisonment and a fine of $474,000 (70 weeks’ imprisonment in default). 15     As for Yan, he pleaded guilty to two parallel charges of assisting the Respondent in carrying on his unlicensed moneylending business. The district judge sentenced him to three months’ imprisonment and a fine of $40,000 (six weeks’ imprisonment in default) for each charge, with the imprisonment terms to run concurrently. The Prosecution did not appeal against Yan’s sentence.",
        "The Prosecution’s case": "16     The Prosecution submitted that the sentence imposed on the Respondent for the ULM Charges was manifestly inadequate for the following reasons: (a)     The district judge failed to give sufficient weight to the need for general deterrence in respect of offences involving estate agencies issuing loans to HDB flat sellers. (b)     The district judge failed to accord sufficient weight to the following aggravating factors: (i)       the Respondent made profits at the expense of vulnerable homeowners who were in desperate need of cash and had resorted to selling their flats to raise funds; (ii)       the Respondent had exploited the professional relationship between a property agent and his client; (iii)       the acts of the Respondent brought disrepute to the real estate industry; and (iv)       the Respondent had knowingly carried on the business of unlicensed moneylending in blatant disregard of the law. (c)     The district judge erred in according undue weight to the following factors: (i)       the Respondent had not committed any acts of harassment against the borrowers; (ii)       the interest rates charged by the Respondent were not exorbitant; (iii)       there was no indication that any of the borrowers had complained that they felt exploited; (iv)       the Respondent had only given loans to four borrowers; and (v)       the Respondent had made meagre profits. (d)     The district judge further erred in: (i)       imposing on the Respondent an imprisonment term of a similar length to that of Yan when the latter was convicted ofassistingthe Respondent in carrying on an unlicensed moneylending business, which is generally considered a less serious offence than actually carrying on the business of unlicensed moneylending; (ii)       unjustifiably departing from the sentencing precedents for similar offences; and (iii)       applying the “clang of the prison gates” principle when it was inapplicable to the Respondent. 17     Consequently, the Prosecution submitted that the imprisonment term imposed on the Respondent should be enhanced. It did not recommend a specific length of imprisonment, but left it to the court.",
        "The Respondent’s case": "18     Counsel for the Respondent highlighted the following mitigating factors: (a)     it was Yan who hatched the scheme of issuing loans to property sellers; (b)     the Respondent did not possess any dishonest intent and did not set out to defraud or deceive the borrowers; (c)     the Respondent did not harass the borrowers or carry out any of the unscrupulous acts typical of loan sharks; (d)     the 10% monthly interest rate charged by the Respondent was not exorbitant compared to the 20% interest rate typically charged by loan sharks; (e)     the profits made by the Respondent (totalling $8,658 in respect of the ULM Charges) were meagre; and (f)     no borrowers or any other person had complained that the Respondent had exploited them.",
        "The relevant statutory framework": "19     The relevant sections of the MLA are as follows: No moneylending except under licence, etc. 5.—(1) No person shall carry on or hold himself out in any way as carrying on the business of moneylending in Singapore, whether as principal or as agent, unless — (a)    he is authorised to do so by a licence; (b)    he is an excluded moneylender; or (c)    he is an exempt moneylender. … Unlicensed moneylending 14.—(1) Subject to subsection (1A), any person who contravenes, or who assists in the contravention of, section 5(1) shall be guilty of an offence and — (a)    in the case where the person is a body corporate, shall on conviction be punished with a fine of not less than $50,000 and not more than $500,000; or (b)    in any other case — (i)    shall on conviction be punished with a fine of not less than $30,000 and not more than $300,000 and with imprisonment for a term not exceeding 4 years; and (ii)   in the case of a second or subsequent offence, shall on conviction be punished with a fine of not less than $30,000 and not more than $300,000 and with imprisonment for a term not exceeding 7 years. (1A)  Subject to sections 325(1) and 330(1) of the Criminal Procedure Code 2010 — (a)    a person who is convicted for the first time of an offence under subsection (1) shall also be liable to be punished with caning with not more than 6 strokes; or (b)    a person who is convicted of a second or subsequent offence under subsection (1) shall also be liable to be punished with caning with not more than 12 strokes. …",
        "The sentencing precedents": "20     The Prosecution cited three cases to demonstrate that the benchmark imprisonment sentence for a moneylender who did not commit any act of harassment was nine to 12 months’ imprisonment for each charge of unlicensed moneylending. 21     InPP v Koh Suat Lay[2012] SGDC 398, the accused, with the assistance of her Filipina domestic worker, extended loans ranging from $300 to $500 to other Filipina domestic workers at interest rates of between 10% and 60% per month. She was convicted after claiming trial to seven charges of unlicensed moneylending, with four charges coming under the MLA and three charges coming under older versions of the MLA. The district judge took into account the fact that although the Prosecution had only proceeded on seven charges involving five borrowers, the evidence showed that there were ten to 15 borrowers and that the accused’s operation was a large-scale one lasting nearly three years. The accused had also exploited vulnerable victims by charging them exorbitant interest rates and had manipulated her domestic helper into helping her with the illegal moneylending business. In the light of these aggravating factors, the district judge sentenced the accused to 12 months’ imprisonment and a fine of $40,000 (two months’ imprisonment in default) for each charge under the MLA, and nine months’ imprisonment for each charge under the older versions of the MLA, with three of the imprisonment terms to run consecutively. The accused’s cumulative sentence was 33 months’ imprisonment and a fine of $160,000 (eight months’ imprisonment in default). The sentence was upheld by the High Court on appeal. 22     InPP v Tan Meng Teck(DAC 28754/2012 and others), the accused pleaded guilty to four charges of unlicensed moneylending by issuing loans ranging from $1,000 to $2,000 to various persons whom he had gotten to know at coffee shops and hawker centres which he frequented. He charged a monthly interest rate of 20%. He was sentenced to nine months’ imprisonment and a fine of $40,000 (ten weeks’ imprisonment in default) per charge, with two of the imprisonment terms to run consecutively. His total sentence was thus 18 months’ imprisonment and a fine of $160,000 (40 weeks’ imprisonment in default). 23     InPP v Leaw Kim Onn(DAC 9198/2012 and others), the accused pleaded guilty to three charges of unlicensed moneylending and one charge under the Passports Act (Cap 220, 2008 Rev Ed) for retaining a debtor’s passport as security. The accused had given loans ranging from $80 to $500 to various persons, and had charged an interest rate of between 20% and 25% for every ten days or per month. He was sentenced to ten months’ imprisonment and a fine of $30,000 (two months’ imprisonment in default) for each moneylending charge, and nine months’ imprisonment for the charge under the Passports Act. Two of the imprisonment terms for the moneylending charges were ordered to run consecutively. His total sentence was thus 20 months’ imprisonment and a fine of $90,000 (six months’ imprisonment in default).",
        "My decision": "24     Having regard to the sentencing precedents, the Respondent’s imprisonment term of three months for each of the ULM Charges was a clear departure from the norm. The question was whether the alleged mitigating factors justified such a departure. I was of the view that they did not. 25     First, although the Respondent’s monthly interest rate of 10% was lower than the interest rates charged in the cases cited by the Prosecution, it does not mean that such an interest rate was not exorbitant. The moneylending regulations provide a useful reference point in this regard. Under s 23(1) of the MLA, the court shall re-open a loan transaction and take an account between the moneylender and the debtor if it is satisfied that the interest charged is excessive and that the transaction is unconscionable or substantially unfair. Section 23(6) creates a presumption that the interest charged is excessive and the transaction is unconscionable or substantially unfair where the interest rate exceeds the maximum rate of interest prescribed. The maximum rate of interest is prescribed in r 11(2) of the Rules as follows: Interest 11.— … (2)    The maximum rate of interest referred to in section 23(6) of the [MLA] shall be — (a)    in the case of a secured loan granted to an individual whose annual income on the date of the grant for the loan is less than $30,000, the effective interest rate of 13% per annum; and (b)    in the case of an unsecured loan granted to an individual whose annual income on the date of the grant for the loan is less than $30,000, the effective interest rate of 20% per annum. … Given that the maximum interest rate prescribed under the MLA read with r 11(2) of the Rules for unsecured loans (to individuals with an annual income below $30,000) is 20%per annum, the Respondent’s interest rate of 10%per month– effectively 120%per annum– cannot be described as anything but exorbitant. This was especially so considering that the loans were granted to individuals who were selling their flats and would soon receive the sale proceeds: the likelihood of their not repaying their loans was quite low. This was unlike the cases cited above, where there was a greater risk that the borrowers would default. The Respondent ensured that the loan documentation signed at the lawyer’s office provided that the amount due to the Respondent would be paid out of the sale proceeds first before the balance of the proceeds was paid out to the borrower. In the case of secured loans, I noted that the maximum interest rate prescribed under the MLA read with r 11(2) of the Rules (to individuals with an annual income below $30,000) was even lower at 13% per annum, or 1.08% per month. Therefore, the fact that the Respondent had charged an interest rate of “only” 10%per monthwas more an aggravating factor rather than one which had mitigating value. 26     Second, no mitigating weight should be attributed to the fact that the Respondent did not commit any acts of harassment. This is because such acts of harassment are separate offences under s 28 of the MLA carrying harsh penalties of their own: Harassing borrower, besetting his residence, etc. 28.—(1) Subject to subsection (3), where an unlicensed moneylender — (a)    displays or uses any threatening, abusive or insulting words, behaviour, writing, sign or visible representation; or (b)    commits any act likely to cause alarm or annoyance to his borrower or surety, any member of the family of the borrower or surety, or any other person, in connection with the loan to the borrower, whether or not the unlicensed moneylender does the act personally or by any person acting on his behalf, the unlicensed moneylender shall be guilty of an offence and — (i)    in the case where the unlicensed moneylender is a body corporate, shall be liable on conviction to a fine of not less than $10,000 and not more than $100,000; or (ii)   in any other case — (A)    shall on conviction be punished with imprisonment for a term not exceeding 5 years and shall also be liable to a fine of not less than $5,000 and not more than $50,000; and (B)    in the case of a second or subsequent offence, shall on conviction be punished with imprisonment for a term of not less than 2 years and not more than 9 years and shall also be liable to a fine of not less than $6,000 and not more than $60,000. … Thus, the fact that the Respondent did not harass his borrowers is already reflected in the absence of any charge under s 28 against him. It should not be taken as a mitigating factor in deciding the appropriate punishment for the ULM Charges. Furthermore, since there is no evidence that the moneylenders in the cases cited by the Prosecution had committed any acts of harassment, the Respondent’s lack of harassment cannot be a reason for departing from those sentencing precedents. 27     Third, although Yan was the one who proposed the illegal moneylending scheme and did all of the legwork, the fact remains that it wasthe Respondentwho provided all the funds and reaped the lion’s share (90%) of the profits. He also reviewed and approved each loan before it was issued by Yan. In my view, this was not a case where Yan was the criminal mastermind and the Respondent, a naïve follower. In fact, having previously owned and operated a licensed moneylending business, the Respondent was well aware that he was committing an offence by agreeing to Yan’s scheme, and he sought to insulate himself by specifying that he would have no direct contact with the borrowers (see [7] above). There can no mitigating value in the fact that an unlicensed moneylender made or allowed an employee to do the dirty work for him while he sat back and enjoyed the profits from his illegal enterprise. On the contrary, it was clear to me that the Respondent was more culpable than Yan and should receive a heavier sentence. 28     Finally, the Respondent was not a small-time moneylender, but ran a sophisticated operation that granted loans of large amounts. He found customers through his estate agency firm and enlisted the help of law firms to document the loans, thereby giving his loans a facade of legality and respectability while ensuring, at the same time, that he had sufficient safeguards against any default in repayment of his exploitatively high interest rate loans to borrowers who were desperately in need of money. The loans disbursed by the Respondent – $28,500 and $15,000 in DAC 40848/2012 and DAC 40849/2012 respectively – were also far larger than those given by the moneylenders in the three cases cited by the Prosecution. Where the loan amounts are large, the imposition of an exorbitant interest rate would be all the more financially crippling for the borrower should the duration of the loan be stretched due to any unforeseen circumstances. These were aggravating factors that the district judge did not appear to have taken into account when sentencing the Respondent. 29     For these reasons, I found that the sentence imposed on the Respondent was manifestly inadequate. Taking into account his early plea of guilt, his lack of antecedents and the heavy fines already imposed on him, I considered it appropriate to enhance the Respondent’s sentence to nine months’ imprisonment for each of the ULM Charges, with the terms to run concurrently. The fine of $80,000 (12 weeks’ imprisonment in default) for each charge remains. The Respondent’s total sentence for the ULM Charges was therefore nine months’ imprisonment and a fine of $160,000 (24 weeks’ imprisonment in default)."
    }
}