{
    "case_title": "Thomas Teddy and another\n      v\n      Kuiper International Pte Ltd",
    "ncitation": "[2013] SGHC 7",
    "coram": "Quentin Loh J",
    "sections": {
        "Facts": "3       The appellants are husband and wife. The second appellant was employed by the respondent around February or 1 March 2010. The second appellant helped set up the respondent, hiring employees and setting up contracts with third parties. The respondent alleges, and it is not denied, that when the second appellant was first employed by the respondent, her husband’s company had been wound up and she offered to let the respondent use the first appellant’s computer file server, (“the File Server”).  The second appellant was employed as an Operations Manager when her employment was terminated on 7 March 2012. 4       The respondent alleges the termination was for cause. This is disputed by the second appellant and the circumstances of the termination of the second appellant’s employment are the subject of a separate dispute in DC Suit No. 3086 of 2012 and are not at issue in the present case. 5       After the termination of the second appellant’s employment, the appellants, through their solicitors, sent a letter dated 27 April 2012 to the respondent demanding,inter alia, the return of the File Server by 2 May 2012.[note: 2]The solicitors for the respondent replied on 11 May 2012 stating,inter alia, that the respondent stood ready to return the file server and asked for 3 days’ notice prior to the second appellant sending her contractors to dismantle and remove the File Server. 6       The second appellant did nothing. Three months passed. The respondent then asked their solicitors to send a reminder. On 13 August 2012 the respondent’s solicitor wrote to the appellants’ solicitor asking them to collect the File Server on or before 20 August 2012. 7       The second appellant’s solicitors replied on 21 August 2012 stating that they would need the respondent to give them the password to check the File Server before they dismantled and removed the same. They put forward a collection date of 25 August 2012 at 11 am. The second appellant’s solicitors subsequently sent a facsimile on 27 August 2012,[note: 3]asking for a change of the collection date to 29 August 2012 at 10 am but also stated: As the servers were up and running in good condition when our client left your client’s company, our client would be performing checks after re-assembling the server and reserves the right to claim against your client for any damages to the server. 8       The respondent’s solicitors replied on 28 August 2012,[note: 4]agreeing to the change but replied: However, our client disclaims all responsibility for the condition of the server. Our client has no knowledge of the state or condition the server was in from the time your client was in the company to date. Further, the server was donated by your client to our client in 2010 and therefore the return of the server to your client now is a gesture of goodwill on our client’s part. 9       It appears that the respondent was concerned about claims being made for damage to the File Server and had second thoughts about a handover without some form of agreed procedure for checking for damage. By then the respondent had already dismantled the File Server. The respondent’s solicitors subsequently sent an e-mail on 28 August 2012 at 8.21pm (“the 28 August e-mail”) to the appellants’ solicitors stating:[note: 5] Given that our clients have not reached an agreement with regard to the issue of assumption of liability for any damage that may have been caused to the file servers, it may be best for us to postpone the collection of the server to a later date. We will take our clients’ instructions and revert to you shortly. 10     The second appellant complains that the email was sent after office hours and that she had by then already made arrangements for the collection of the File Server. On the following day, 29 August 2012, the appellants’ contractor and workers were turned away when they arrived at the respondent’s premises to collect the File Server. 11     There was no communication between the parties thereafter. Seven days later, on 5 September 2012, the appellants’ solicitors filed the originating summons[note: 6]and sent a letter dated 6 September 2012 to the respondent’s solicitors asking if the latter had instructions to accept service of process.[note: 7] 12     The respondent’s solicitors replied by letter on 7 September 2012[note: 8]stating that the respondent “has always stood ready to deliver the file server” to the appellants and reiterated the offer for the appellants to collect the file server from the respondent’s premises at a time that was convenient for both parties. The respondent’s solicitors also state that the originating summons was unnecessary and that their client would look to the appellants for costs occasioned by the application. 13     There was another offer from the respondent’s solicitor dated 13 September 2012 for the appellants to collect the File Server any time from 17 to 19 September 2012 between 10 am and 5 pm but reserving their rights. The appellants did not take up the offer. The respondent’s solicitors wrote again on 24 September 2012, noting that they had not heard from the appellants’ solicitors and gave the appellants another opportunity to collect their File Server at any time from 25 to 28 September 2012 between 10 am and 5 pm. 14     The File Server has since been collected. I was told by Mr Hanam, counsel for the appellants, that prayer 1 of the originating summons, which called for the return of the File Server, has been “superceded”. Mr Hanam also told me there was no claim in respect of the return of the File Server in “good working condition”.",
        "The Decision Below": "15     The parties proceeded to the hearing below on a claim for unlawful detention of the File Server from 29 August 2012 to 7 September 2012, and the appellants claimed substantial damages. 16     The learned District Judge dismissed the application, citing the cases ofTat Seng Machine Movers Pte Ltd v Orix Leasing Singapore Ltd[2009] 4 SLR(R) 1101 (“Orix Leasing”);Chartered Electronics Industries Pte Ltd v Comtech IT Pte Ltd[1998] 2 SLR(R) 1010 (“Comtech (CA)”) andComtech IT Pte Ltd v Chartered Electronics Industries Pte Ltd[1997] SGHC 277 (“Comtech (HC)”) (collectively, “theComtechcases”). The appellants being dissatisfied with the decision filed this appeal.",
        "Liability for Conversion": "17     The crux of the appellants’ submission on liability is that the respondent had unjustifiably refused to return the File Server notwithstanding the appellant’s demand for the same. I turn now to the leading Singapore case on the tort of conversion,Orix Leasing, where the Court of Appeal laid out certain propositions of law at [45]-[46]: 45 ... The following propositions are nevertheless now regarded as established. Generally, an act of conversion occurs when there is unauthorised dealing with the claimant's chattel so as to question or deny his title to it (Clerk & Lindsellat para 17-06). Sometimes, this is expressed in the terms of a person taking a chattel out of the possession of someone else with the “intention of exercising a permanent or temporary dominion over it” (R F V Heuston and R A Buckley,Salmond & Heuston on the Law of Torts(Sweet & Maxwell, 21st ed, 1996) (“Salmond & Heuston on Torts”) at p 99). For example, it has been held in New Zealand that the unlawful taking of a car for a joy-ride was an intentional assertion of a right inconsistent with the rights of the owner and therefore constituted conversion (seeAitken Agencies Limited v Richardson[1967] NZLR 65 at 66).Inconsistency is the gist of the action, and thus there is no need for the defendant to know that the goods belonged to someone else or for the defendant to have a positive intention to challenge the true owner's rights(Halsbury's Laws of Englandvol 45(2) (Butterworths, 4th Ed Reissue, 1999) at para 548). 46Where the defendant takes or uses the goods as his own, or sells goods not belonging to the person who transferred possession of the goods to him, the intention to do an act inconsistent with the owner's right is necessarily present, even if the defendant does not know or intend to challenge the property or possession of the owner(Salmond & Heuston on Tortsat p 98 andR H Willis and Son v British Car Auctions Ltd[1978] 1 WLR 438 (“R H Willis”) at 442 (per Lord Denning MR). [emphasis in bold italics added] 18     The Court went on to say at [69]: The mere retention of another's property on its own is not conversion, unless the defendant has shown an intention to keep the thing in defiance of the true owner(Clayton v Le Roy[1911] 2 KB 1031 at 1052; see also [64] above). Neither is possession of a chattel without title considered to be either conversion or a tort (seeSalmond & Heuston on Torts([45] supra) at p 99 andCaxton Publishing Company Limited v Sutherland Publishing Company[1939] AC 178 at 202).Where detention of goods is concerned, the plaintiff suing in conversion will usually prove that the defendant's detention of the chattel is adverse to its interests by showing that the defendant had refused or neglected to comply with the demand made by it for the delivery of the chattel, though the making of such a demand is not a prerequisite in every case(Salmond & Heuston on Tortsat p 100,Clerk & Lindsell([44] supra) at para 17-22 andLondon Jewellers Limited v Sutton(1934) 50 TLR 193; see furtherKuwait Airways([36] supra) and [70] below). For clarity, we should also state for good measure thatthe defendant's refusal to comply with the demand will not necessarily constitute conversion(Salmond & Heuston on Tortsat p 100). [emphasis in bold italics added] 19     It is clear therefore, under theOrix Leasingprinciples, that the only intention that needs to be ascertained isthe intention to act inconsistently with the owner’s rights. In order to determine this intention, it is not necessary to find a corollary intention to challenge the owner’s proprietary rights. The question that arises therefore is: what facts are necessary to establish such an intention? 20     InComtech (CA), the Court of Appeal gave some guidance to this question at [28]: The law with regards to the tort of conversion was succinctly summarised in the learned judge's judgment ([9]supra) at [40] to [42] and would not be rehashed here. Essentially, to amount to conversion, there must be detention of the chattel which is consciously adverse to the rights of the owner.The usual mode of proof of conversion is by showing that the owner made a specific and unconditional demand for the return of the goods and the person in possession of the goods unconditionally refused to do so. The demand must be both specific and unconditional. The refusal to return must be unconditional. [emphasis in italics added] 21     The refusal must thus be “unqualified and unjustifiable” (Halsbury’s Laws of Singaporevol 18 (Butterworths Asia, 2000) at para 240.613). Further, it is irrelevant that the detention was temporal (Clerk and Lindsell on Torts, 20thEd, (Sweet & Maxwell, 2010) at para 17-25). The question, therefore, turns to what constitutes an unconditional and unjustifiable refusal to return the owner’s property. This is a question of fact in each case and it goes without saying that each case must turn on its own facts and circumstances. On the one hand, where a warehouseman’s employee refuses to return goods while he consults with higher authority, his refusal is justified (Mires v Solebay(1678) 2 Mod. 242;Alexander v Southey(1821) 5 B & Ald 247); a defendant’s refusal to return property on the basis that he requires a reasonable time to ascertain the identity of the true owner is also a justified refusal (Solomon v Dawes(1794) 1 Esp 83;Vaughan v Watt(1840) 6 M & W 492, 9 LJ Ex 272). On the other hand, in theComtechcases, the defendants had refused to return inkjet printer kits (“the kits”) to the plaintiffs because they wanted to retain the kits to show that they were defective, so as to defend themselves against a claim by the plaintiffs for the price of the kits. This was found to be an unjustified refusal (Comtech (HC)at [51]-[52] (the relevant part of the judgment affirmed inComtech (CA)). Further, it is not sufficient to respond to a demand by saying that the defendant “would do nothing but what the law required” (Davies v Nicholas(1836) 7 C &P 339 at 340); nor to respond to a demand by saying that the defendant would “consult his attorney” and not giving up the property in question (Atkin & Slater(1844) 1 Car & Kir 356, 174 ER 845). Of similar tenor is the case where a defendant refuses to return goods unless the owner complies with a condition which the defendant has no right to impose, for example, where a licensor of building premises detains the licensee’s goods and unjustifiably asserts a lien over the goods for unpaid rent (Finlayson v Taylor, The Times, 14 April 1983). See also the helpful summary of the position where there is a delay in complying with a demand for the return of movable property in para 17-26,Clerk and Lindsell on Torts, 20thEd, (Sweet & Maxwell, 2010). 22     These are but guidelines. As I have said earlier, each case will turn on its own facts. Some of these authorities are quite old and decided well before the enactment of the Torts (Interference with Goods) Act 1977 (c 32) (UK). As the Court of Appeal noted inOrix Leasing(at [44]), the remedy of detinue in the United Kingdom has been abolished by statute and subsumed under the remedy of conversion but this sensible reform to the common law has yet to be adopted in Singapore. Similarly, Gary Chan,The Law of Torts in Singapore, (Academy Publishing 2011) states at para 11.067: “For Singapore, however, detinue remains very much a live tort”; see also the Rules of Court (Cap 322, 2006 Rev Ed), O 13 r 3 and O 45 r 4, and Prof Pinsler’sSingapore Court Practice(LexisNexis, 2009), para 13/3/2 and 13/3/6. The appellants’ claim would have been in detinue at the time the Originating Summons was issued, since the respondent still had possession of the File Server, but as the File Server has since been returned and the torts of detinue and conversion overlap, there is little to be gained on these facts to dwell further on this issue other than to repeat that legislative reform would be helpful. 23     The Court of Appeal, in referring to the expanded tort of conversion today inOrix Leasing, cautioned at [43]: Indeed, we can add, if the tort is not sensibly circumscribed in the context of present day commerce, it could end up raising business costs by necessitating increased insurance coverage and premiums and, perhaps, even stultifying trade flow. Although that statement was made in a slightly different context, the caution against unthinking application of these ancient remedies is clear. The Court of Appeal has also stated at [69], citing with approval the decision ofClayton v Le Roy[1911] 2 KB 1031 at 1052: “The mere retention of another’s property on its own is not conversion, unless the defendant has shown an intention to keep the thing in defiance of the true owner.” 24     Mr Hanam laid emphasis on the fact that the respondent initially claimed ownership of the File Server, (see [8] above), but abandoned that unmeritorious claim later. However, the very paragraph he relies upon goes on to state that the respondent was going to return the server as a gesture of goodwill. There was therefore no expression of any intention to keep the File Server. 25     In my judgment, on the facts of this case, the 28 August e-mail itself was not an “unjustified refusal” or an expression of an intention inconsistent with the appellants’ ownership of the File Server because, as the respondent’s solicitors indicated, having agreed to allow the appellants to collect the File Server and the issue of responsibility for possible damage arising as it did, it was no more than a suggestion that the collection date be postponed pending resolution of this issue of possible damage. It is important to remember that the second appellant helped the respondent set up and start their company and used the File Server for this purpose. It was being used by the second appellant during her employment with the respondent. This is clear from the respondent’s solicitor’s facsimile of 28 August 2012 where it is stated: “Our client has no knowledge of the state or condition the server was in from the time your client was in the company to date” (see [8] above). 26     However, the sending of the e-mail at 8.21 pm, after office hours and the night before the agreed date for collection, calling off the collection of the File Server the next morning, was not reasonable and for which responsibility for the abortive costs of collection must follow. 27     I find that when the respondent turned away the appellants’ contractor and workmen the next day, 29 August 2012, it was pursuant to the suggestion that the collection be postponed pending resolution of the issue of possible damage to the File Server, and therefore not an unjustified refusal in the circumstances. This is because on more than one occasion the appellants themselves appeared in no hurry to take delivery of their File Server. 28     However, it was, in my judgment, reasonable for the respondent or their solicitors to respond within, at the most, three days, with some proposal to resolve the issue. Once that period passed, their holding on to the File Server was no longer justified. Their conduct crossed the line in that after a reasonable period, which in my judgment would be 3 days on the facts of this case, the respondent’s lack of response on the handing over of the File Server may be said to have unjustifiably imposed a condition that the appellants agree with the respondent on the issue of responsibility for damage, if any, caused to the File Server before the File Server could be returned. The respondent is liable for conversion for unlawful detention of the File Server for that short period of 6 days between 2 to 7 September 2012. However, I take the view that this was a very technical commission of the tort, especially as the respondent made clear in its solicitor’s facsimile of 7 September 2012 that the appellants could collect the File Server at any time convenient to both parties and sent two further facsimiles thereafter putting forward the same offer.",
        "Damages for Conversion": "29     Mr Hanam submits that the respondent is liable for unlawful detention of the File Server from 29 August 2012 to 7 September 2012. However, the Originating Summons states the commencement date as 30 August 2012 (see below), and the appellants are bound by that date as no application has been made to amend the same. As noted above, I am of the view that in the circumstances of this case, the first 3 days, (30 August to 1 September 2012), was a reasonable period to put forward a procedure or protocol to try and resolve the handover in relation to possible damage caused to the File Server. The question then arises as to whether, as Mr Hanam submits, the appellants are entitled to substantial damages given that the respondent had dismantled the File Server prior to 29 August 2012, put the File Server to one side ready for collection and never sought to make commercial use of the File Server. 30     Before I turn to the question of what damages the appellants are entitled to, some observations should be made. I note that the appellants have not put forward any evidence of any loss or damage suffered by them. There were only two affidavits filed; one by the second appellant and one by the respondent’s general manager. The Originating Summons prays as follows: 1.The [respondent] do within 7 days of order deliver up to the [appellants] the File Server belonging to the [appellants] in good working condition failing which the [respondent] shall be liable to the [appellants] for damages for conversion such damages to be assessed. 2.The [respondent] do pay the [appellants] damages for wrongful detention of the File Server from 30 August 2012. As delivery up of the File Server was no longer in issue and since prayer 1 has been, as Mr Hanam says, superceded, there is no prayer for damages to be assessed separately. There is also no application before me for such an order. Prayer 2 merely asks for damages for wrongful detention. It therefore behoves the appellants to put forward the evidence of the loss and damage they have suffered and not assume that can be done at some later date.  They have not even put forward the evidence relating to the abortive costs of the attempted collection on 29 August 2012. 31     Three cases on damages for the tort of conversion were put forward:Siew Kong Engineering Works (a firm) v Lian Yit Engineering Sdn Bhd and another[1993] 1 SLR(R) 736 (“Siew Kong”);Strand Electric & Engineering Co Ld v Brisford Entertainments Ld[1952] QB 246 (“Strand Electric”); and the very recent case ofYenty Lily (trading as Access International Services) v ACES System Development Pte Ltd[2012] SGHC 208 (“Yenty Lily”). 32     InYenty Lily, the plaintiff and defendant entered into a contract whereby the plaintiff was to provide mobile platforms and to erect and dismantle these platforms at various locations at a worksite where the defendant was conducting construction work. A dispute arose as to payment under the contract and the plaintiff demanded the return of the platforms. The defendant refused to return the platforms on the basis that they were exclusively intended for the construction. The trial was bifurcated and the trial judge found that the defendant had wrongfully repudiated the contract and also wrongfully detained the platforms. At the assessment stage, the defendant argued that only nominal damages should be awarded since the plaintiff had failed to prove any loss and the defendant had not benefitted from the platforms since it had kept them in storage. 33     Judith Prakash J inYenty Lilyadopted the “user principle”, described as follows (at [43]): “User damages”...are typically awarded where the defendant wrongfully detains and uses the plaintiff’s property for his own purposes. The law compels such a defendant to pay reasonable hire for the period of unauthorised detention, even if the plaintiff suffered no financial loss. The defendant is therefore not allowed to argue that the plaintiff would not have been able to rent out the property during the material time...This is because the user principle protects property rights in themselves and therefore triggers compensation where the owner’s mere right to exclude others at his own discretion has been infringed. 34     The learned judge went on to discuss bothStrand ElectricandSiew Kong, in an exploratory exercise for the juridical basis of the “user principle”, and concluded that the “user principle” was both compensatory and restitutionary in nature. This, to the learned judge, did not make a difference to the final analysis (at [68]-[69]): 68In my judgment, the recognition that the user principle may not be wholly compensatory but may also contain elements of restitution does not lead to the conclusion that a plaintiff cannot recover in a situation where the defendant has not made any discernable use of the plaintiff’s detained or misappropriated property unless she proves actual damage...In my view, depriving the plaintiff of damages simply because the defendant (not being a warehouseman or a carrier), having chosen to detain the plaintiff’s profit-earning goods, has done nothing with them, cannot be justified on principle... 69 ... For many years now, judges have described the principle as being compensatory and have forcefully repeated that description even as some of them also recognise the restitutionary element.It may be that what is important is the fact that, by the detention or appropriation, the defendant gains the opportunity to use the property concerned whilst simultaneously depriving the owner of such opportunity. From this perspective, the defendant’s failure to exploit such opportunity is irrelevant. [emphasis added] 35     The learned judge then turned to the facts of her case and concluded (at [72]-[73]): 72The defendant, therefore, knowingly deprived the plaintiff of the use of a profit-earning chattel, which the defendant knew had been acquired only for business purposes.It knew also that the plaintiff had not had the financial muscle to acquire the platforms on her own and had needed the defendant’s assistance to do so. Yet, the defendant contended that the plaintiff should have gone about the business of hiring out platforms either by acquiring new ones or by renting ones that were in the market and subletting them... 73    In my judgment, the fact that the plaintiff could not, or even by choice, did not, obtain new platforms and rent them out so as to be able to show actual loss cannot justify relieving the defendant of the liability to pay compensatory damages. If the plaintiff had gone into business with alternative platforms, she may have been able to use the losses from such business to establish a claim for actual loss but such claim would have been in addition to her claim for damages to be assessed under the user principle...It does not lie in the mouth of a converter of profit-earning property to deny the property owner substantial damages simply because the converter chose not to use the same in even the most tenuous way. [emphasis added] 36     I now turn toSiew KongandStrand Electric. InSiew Kong, the respondents sent some specialised welding equipment (“the equipment”) to the appellant. The nature and terms of the agreement between the two parties was in dispute. The respondents failed in attempting to retrieve the equipment and therefore commenced proceedings for conversion and detinue. The trial judge found that there was no sale agreement between the two parties and ordered assessment of special damages for the period of retention of the equipment. On appeal, the appellant argued that since there was no evidence of actual loss suffered as a result of the alleged detention, only nominal damages should be awarded. 37     The Court of Appeal rejected that argument and adopted the “user principle” as stated by Denning LJ inStrand Electric(Siew Kongat [17] andStrand Electricat 253). Importantly, the Court of Appeal then stated that (at [18]): Somervell LJ, in considering this question, was careful to draw a clear distinction between a wrongdoer who merely detains the goods without deriving any benefit from the detention and a wrongdoer who detains the goods with a view to deriving a benefit. 38     The Court of Appeal then concluded (at [19]) that: In the present case, the equipment was detained by Siew Kong in order to make commercial use of it.By such detention Siew Kong had denied to the respondents the use of their equipment. Adopting the decision of the Court of Appeal inStrand Electric and Engineering Co Ltd v Brisford Entertainments Ltd ([17]supra), we do not think that a person who has wrongfully detained for his own use property belonging to another should be allowed to profit from this detention on the grounds that the wronged party had not incurred any expenses or had any occasion to use the equipment during the period of the detention. 39     Finally, I turn to an observation by Romer LJ inStrand Electric(at 257) (which was also cited by the learned judge inYenty Lilyat [47]): I agree with my Lord that in this comparatively virgin field it is better to confine our decision to the actual facts before us; and I express no opinion as to what the plaintiffs’ rights would have been in the matter of damageshad the property detained been of a non-profit earning character, or if, although profit-earning, the plaintiffs had never applied it to remunerative purposes. [emphasis added] 40     Three different variables arise from the cases ofYenty Lily, Siew KongandStrand Electric: first, whether or not the propertywas of a profit-earning character. There was no question that the platforms inYenty Lilyand welding equipment inSiew Kongwere of a profit-earning character; similarly, inStrand Electric, the property in question were portable electric switchboards for use in a theatre and of a profit-earning character (the plaintiff in that case hired out the switchboards in the course of its business). Importantly, all three cases emphasised that whether or not the property was of a profit-earning character was to be analysedfrom the owner’s perspective, ie, whether or not the owner had used the property in the course of its business to earn profit. 41     Secondly, whether or not the defendant had retained the profit-earning propertywith a view either (1) to apply the property for the defendant’s own benefit; or (2) to deprive the plaintiff of the use of the property. As I have mentioned above (at [37]),Strand ElectricandSiew Kongfocused on the distinction between two possibilities: a wrongdoer who merely detains the goods without deriving any benefit from the detention, against whom only nominal damages may be awarded, and a wrongdoer who detains the goods with a view to deriving a benefit, against whom substantial damages may be awarded, based on a reasonable rate of hire for the profit-earning property.Yenty Lily, however, raised a third possibility: where the defendant had detained the goods with a view to deprive the plaintiff of the use of the profit-earning property. The learned judge inYenty Lilyfound for the plaintiff because “the plaintiff, as the defendant well knew, acquired the platforms in order to use them in the course of her business and to make a profit from them” and that the defendant in that case “knowingly deprived the plaintiff of the use of a profit-earning chattel” (Yenty Lilyat [70] and [72]).  I respectfully adopt the learned judge’s analysis and would add that, given the “mixed nature of the user principle” (Yenty Lilyat [67]),iehaving both compensatory and restitutionary elements, it is consistent to grant substantial damages both on a loss-based and gains-based analysis. 42     This brings me to the last variable: whether or not that intention to benefit the defendant or to deprive the plaintiff of the benefit of the profit-earning property was actuallyrealised. The three cases are agreed on this question: under the user principle, it is not necessary to establishactual useof the property by the defendant for its own benefit before the owner of the property has a right to substantial damages; nor is it necessary to establishactual lossby the plaintiff from being deprived of the use of the property. 43     Applying these legal principles to the facts of the present case, it is clear, first, that the File Server was never acquired by the appellantsfor the purpose of earning profitin that it had previously been used by the first appellant’s company that had been wound up and was offered to the respondent on that basis,ie, the appellants had no present use for the File Server. On the evidence before me, it was not, and is not, a profit-earning piece of equipment from the appellants’ perspective. Secondly, and in any event, it is also clear that upon the appellants’ demand for the return of the File Server on 27 April 2012, the respondent took steps to dismantle the File Server and put it in storage to await collection by the appellants. As such, it cannot be said that the respondent’s unlawful detention of the File Server for the period from 30 August 2012 to 7 November 2012 waswith a view to deriving a benefit, or to deprive the appellants of the benefit of the server. Further as noted at [12] – [14] above, the respondent’s solicitors asked the appellants three times to collect their File Server and they did not do so. In the circumstances therefore, and in addition to the terms of the application comprised in the Originating Summons, the appellants’ claim for substantial damages must fail.",
        "Conclusion": "44     In the circumstances, the appellants’ appeal is allowed in part and I make the following orders: (a)     the respondent is liable for tort of conversion of the File Server from the 2 to 7 September 2012; (b)     for the reasons set out above, the appellants are awarded nominal damages of $1.00; (c)     the respondent is liable for the abortive costs incurred by the appellants in sending their contractor and workmen to take delivery of the File Server on 29 August 2012; (d)     I will hear the parties on costs here and below and the consequential orders in relation to sub-paragraph (c) above.  [note: 1]Notes of Evidence, Appellant’s Bundle of Documents (“ABOD”), Tab 6 at p 4C-D. [note: 2]Letter from Andrew LLC dated 27 April 2012, ABOD Tab 2 at p 6. [note: 3]Letter from Andrew LLC dated 27 August 2012, ABOD Tab 2 at p 14. [note: 4]Letter from Tan Kok Quan Partnership (“TKQ”) dated 28 August 2012, ABOD Tab 2 at p 15. [note: 5]Email from TKQ dated 28 August 2012, ABOD Tab 2 at p 16. [note: 6]Originating Summons, ABOD Tab 1. [note: 7]Letter from Andrew LLC dated 6 September 2012, ABOD Tab 3 at p 25. [note: 8]Letter from TKQ dated 7 September 2012, ABOD Tab 3 at p 27."
    }
}