{
    "case_title": "Lim Koon Hai and another\n      v\n      Alex Yeo Siak Chuan and another",
    "ncitation": "[2013] SGHC 90",
    "coram": "Tay Yong Kwang J",
    "sections": {
        "Introduction": "1       This dispute concerns the sale of an apartment at 500 Upper East Coast Road, #02-05 The Calypso, Singapore 465540 (the “Property”) by the defendants to the plaintiffs. 2       The defendants brought an originating summons seeking an order for the plaintiffs to remove a caveat lodged by them against the Property (the “Caveat”). The plaintiffs brought a suit seeking specific performance of an option to purchase the Property (the “Option”) against the defendants or damages in the alternative. Both proceedings were consolidated on 8 November 2012. 3       At the conclusion of the hearing, I dismissed the plaintiffs' claim and ordered them to remove the Caveat. On 6 March 2013, the plaintiffs filed an appeal against my decision.",
        "The facts": "4       The first plaintiff is the husband of the second plaintiff. The first defendant is the son of the second defendant. The defendants were the joint owners of the Property. 5       In November 2011, the plaintiffs sold their home at 26 Ceylon Road as part of an en bloc sale and started looking for another property in the eastern part of Singapore. They had to vacate their home by 17 October 2012. 6       In February 2012, the defendants rented out the Property with the help of one Wong Wei Jie (also known as Jolie), a housing agent of Huttons Asia Pte Ltd. Jolie is the first defendant’s friend. 7       In May 2012, the defendants decided to sell the Property. They spoke to several housing agents to secure buyers for the Property but did not sign an exclusive agreement with any of them. The defendants were first-time sellers. 8       In or around August 2012, one Lim Saw Chain (also known as Pauline), a housing agent of ERA Realty Network Private Ltd (“ERA”), entered into a co-broking arrangement with Jolie. Under this arrangement, they agreed to market the Property together and share the commission if the Property was sold.[note: 1]Jolie acted as agent for the defendants while Pauline was the agent for the plaintiffs. Pauline is the first plaintiff’s elder sister. 9       In early August 2012, Pauline brought the first plaintiff to view the Property.[note: 2]Initially, the plaintiffs made an offer to the defendants but this offer was rejected.[note: 3]On 8 August 2012, Pauline sought the help of her superior, Heng Thiam Swee (also known as Darrell), to close the sale of the Property. Darrell is a division director at ERA.[note: 4]He was subpoenaed by the plaintiffs and he testified orally in Court. 10     Pauline claimed that due to her other work commitments,[note: 5]she passed the task of securing the Property for the plaintiffs to her husband, Neo Eng Cheong (also known as Donny), another housing agent of ERA. Darrell was Donny’s superior. This was Donny’s first private property sale, although it appeared that Pauline and Donny worked together as a team.[note: 6]There was no written agreement between Donny and the plaintiffs appointing Donny as the plaintiffs’ agent. 11     On 8 August 2012,[note: 7]Darrell contacted the second defendant after obtaining his contact details from Pauline. It was suggested during the trial that Pauline had bypassed Jolie by obtaining the second defendant’s contact details from a security guard of The Calypso condominium and then passing the information to Darrell.[note: 8]This was not challenged by the plaintiffs. The second defendant in turn gave to Darrell the first defendant’s contact number. 12     Darrell subsequently made contact with the first defendant (the “Unsolicited Call”). It was unclear whether this occurred on 8 August 2012 or 14 August 2012 but that is not important for our purposes.[note: 9]According to the first defendant, during the Unsolicited Call, Darrell told him that he had a genuine buyer for the Property.[note: 10] 13     On 14 August 2012, Darrell arranged with the first defendant for the plaintiffs to view the Property at 7 pm that evening. The accounts of whether this request was made during the Unsolicited Call or a separate call diverged but again this is not important for our purposes.[note: 11]The viewing was attended by the plaintiffs and Pauline but not by Darrell.[note: 12]It was unclear if Donny attended the viewing as well. 14     After the viewing, Pauline informed Darrell that the plaintiffs were willing to buy the Property for S$1.25 million[note: 13](“the Purchase Price”) and he relayed this offer to the first defendant. The defendants agreed to sell the Property at the Purchase Price.[note: 14] 15     At about 10 pm that evening, Donny, Pauline and Darrell met the first plaintiff at his office. At this meeting, Donny  passed to the first plaintiff two copies of an “offer to purchase” letter (the “Offer Letter”) which were prepared by him. The Offer Letter appeared to be an ERA standard form document.[note: 15]The key terms of the Offer Letter were as follows[note: 16]: ... We the undersigned... hereby offer to purchase [the Property]... subject to the following terms and conditions: 1.    Option Period: Fourteen (14) days; Completion Period: Eight (8) weeks 2.    Vacant possession 3.    The sale of the above real estateis subject to the attached option, a copy of which is initialled by us. 4.    Within three (3) working days (i.e.by 4.00 p.m. 16 August 2012); the Owner of the above property must either accept or reject this offer failing which this offer shall lapse. If rejected, the option money tendered herewith will be refunded to me/us within the time stipulated above without any interest thereon and thereafter neither party shall have any claim against the other. If accepted the Owner shall deliver to the undersigned the Option duly signed by the Owner within the time stipulated above. ... [emphasis added] 16     The first plaintiff signed only one copy of the Offer Letter. He passed the signed Offer Letter and a cheque for one percent of the Purchase Price (the “Option Money”) to Darrell for him to hand them to the defendants. He returned the unsigned copy to Donny. The plaintiffs claimed that the signed Offer Letter was received by the defendants but never returned to them. It was therefore the unsigned copy that was tendered in court. On the other hand, the defendants maintained that they never received the Offer Letter (see [18] below). 17     According to Darrell, he prepared the Option after he received the Offer Letter.[note: 17]The key terms of the Option (as prepared by Darrell) were as follows:[note: 18] (A)    ... the Vendor hereby offers to sell to the Purchaser the Property upon the terms and conditions set out herein, which offer remains open for acceptance in the manner hereinafter prescribed until4.00 p.m. on the 16thday of August 2012. (B)    This Option shall be accepted by the Purchaser by signing at the portion of this Option marked “ACCEPTANCE COPY”, and delivering this Option duly signed to the Vendor’s solicitorsSUBRA TT LAW LLC... together with a cheque for five percent (5%) of the sale price (the “Deposit”) less the Option Money. ... (4)    The Property is sold with vacant possession. (5)    The sale and purchase shall be completed...on 11thday of October 2012or on such earlier date as Vendor and the Purchaser may agree. ... (14)  The Vendor agrees to pay ERA Realty Network Pte Ltd a marketing fee of two percent (2%) of the sale price together with Goods and Services Tax thereon (“GST”)... PROVIDED that should any monies paid hereunder be forfeited by the Vendor, one half (1/2) of the monies forfeited shall forthwith be paid to ERA Realty Network Pte Ltd provided that such amount does not exceed the said marketing fee and GST. ... [emphasis added] 18     At about 5 pm on 15 August 2012, Darrell met the first defendant at Funan The IT Mall (“Funan”) to hand over the transaction documents to him. The parties disputed the exact documents that were handed over. According to the first defendant, he received (a) the Option; (b) the cheque for the Option Money; and (c) a non-exclusive estate agency agreement (the “Agency Agreement”).[note: 19]On the other hand, Darrell claimed that, in addition to (a)-(c) above, he also handed over the Offer Letter.[note: 20]This will be considered further at [51] below. It was not disputed during the trial that the defendants received only one copy of the Agency Agreement. More will be said about this later at [56]. 19     On the same day at around 7 pm, at the first defendant’s request, Jolie met the defendants at the second defendant’s home to explain the terms of the Option to them. The defendants also wanted to speak to Jolie about terminating the tenancy at the Property early because the plaintiffs wanted vacant possession of the Property on completion.[note: 21]After some discussions about the commission provisions in the Option and the Agency Agreement, the first defendant filled in the commission payable under the Agency Agreement as one percent (inclusive of GST) and Jolie deleted Clause 14 of the Option (set out in [17] above) and part of Clause 10 of the Agency Agreement,[note: 22]which read as follows:[note: 23] 10. Additional Terms ... Should any Option Money or Deposit paid by the Buyer be forfeited by the Seller, then one half (1/2) of the forfeited sum shall be paid to the Estate Agent, provided such amount does not exceed the commission. 20     The defendants signed both the Option and the Agency Agreement and dated them 15 August 2012. The accounts of events that took place from this point until around 3.30 pm on 16 August 2012 diverged significantly. According to the defendants, Darrell collected the signed Option and Agency Agreement from the second defendant’s home in the late evening of 15 August 2012. He had requested the defendants to sign the Option and pass it back to him that evening on the pretext that the plaintiffs would be flying overseas the next day.[note: 24]When Darrell came to collect the documents, the first defendant asked Darrell if he was sure that the plaintiffs were going to exercise the Option the next day and about the next steps in the transaction. Darrell assured him that he would settle the transaction.[note: 25]At around 3 pm on 16 August 2012, at Darrell’s request, the first defendant and Jolie met him at Bugis Junction (“Bugis”) to discuss his commission. After some discussion, Darrell agreed to the one percent commission, signed the Agency Agreement and returned a copy to the first defendant.[note: 26]There was no discussion about the Option during the meeting.[note: 27] 21     Darrell’s version was that he only met the first defendant and Jolie at Bugis at around 3 pm on 16 August 2012 to collect the signed Option and Agency Agreement. The first defendants refused to return him the signed Offer Letter when asked to do so.[note: 28]He also looked through the Agency Agreement in the presence of the first defendant and Jolie and discovered that Clause 10 of the Agency Agreement had been deleted. When he challenged the first defendant about the deletion, the first defendant remained silent. As Darrell was in a rush, he decided to take the signed Agency Agreement back to check with his head office if the deletion could be accepted.[note: 29]This will be considered further at [56]. 22     At around 3.30 pm on 16 August 2012, Darrell handed the signed Option to Donny at the ERA head office. On or about 4 pm the same day, Donny delivered the Option to the first plaintiff. According to Donny, he went through the Option with the first plaintiff[note: 30]but neither of them realised that pursuant to Clause A of the Option, the deadline for exercising the Option was 4 pm, 16 August 2012 (the “Exercise Deadline”) (see [17] above)iethe Option had already expired. Unaware of this, the first plaintiff handed the Option to his bank to process a housing loan. Sometime on 16 August 2012, Donny and Darrell entered into a written agreement under which they agreed to share the commission received in the sale of the Property (the “Mutual Agreement”).[note: 31] 23     On 24 August 2012, the first plaintiff’s bank informed him that there appeared to be an error with the Exercise Deadline. Through Darrell, the plaintiffs frantically sought to contact the first defendant but were unsuccessful. 24     On 27 August 2012, the plaintiffs discovered that Subra TT Law (“STL”) had no instructions to act for the defendants, contrary to what was stated in Clause B of the Option (see [17] above). The plaintiffs then lodged the Caveat. On the same day, the defendants granted an option to purchase the Property to a new buyer for S$1.27 million (the “New Option”). The New Option had to be exercised by 10 September 2012.[note: 32] 25     On 28 August 2012, plaintiffs attempted to exercise the Option by delivering to the second defendant (a) a copy of the Option signed by the plaintiffs; (b) a cheque for four percent of the Purchase Price; and (c) a letter from their solicitors seeking rectification of the Option. The second defendant refused to accept the documents. 26     On 29 August 2012, the defendants offered the first plaintiff a cheque for the amount of the Option Money and asked him to withdraw the Caveat. The first plaintiff rejected this offer as the cheque was posted-dated to 10 September 2012. 27     On 7 September 2012, the New Option was exercised.",
        "The plaintiffs' case": "28     Counsel for the plaintiffs, Mr Lee, submitted that the Exercise Deadline should be rectified to reflect the 14-day exercise period and that specific performance of the Option should accordingly be granted since the plaintiffs exercised the Option on 28 August 2012, before the rectified Option expired. 29     Mr Lee submitted that the plaintiffs’ intention to have a 14-day exercise period was reflected in Clause 1 of the Offer Letter (set out in [15] above). He argued that the plaintiffs could not have intended to pay for an expired option to purchase, which was essentially what they received. In any event, even if the signed Option was passed to them on 15 August 2012, Mr Lee stressed that it was not practical for the plaintiffs to exercise the Option within a day as they needed time to engage a lawyer and make the necessary financial arrangements with their bank.[note: 33] 30     Mr Lee submitted that rectification should be ordered on the basis of a common mistake between the parties. He relied on three bases to show that the defendants had made a mistake in relation to the 14-day exercise period. First, Mr Lee initially suggested that the defendants had sight of the Offer Letter and that their conduct shortly after granting the Option was consistent with the belief that the Exercise Deadline was not 4 pm, 16 August 2012.[note: 34]He also submitted that the defendants were mistaken because they misunderstood Darrell to mean that the plaintiffs wanted toexercisethe Option urgently when he only said that the plaintiffs wanted the Option back urgently.[note: 35] 31     Second, Mr Lee stressed that the defendants conceded that they would have agreed to the 14-day exercise period if they were told prior to signing the Option that this was what the plaintiffs wanted.[note: 36] 32     Third, he argued that Darrell knew about the 14-day exercise period and that this knowledge should be attributed to the defendants since Darrell was their agent. Mr Lee sought to justify this from a loss allocation perspective. He submitted that should the loss be borne by the defendants, they would have legal recourse against Darrell by virtue of their principal-agent relationship. On the other hand, it would be difficult for the plaintiffs to pursue a claim against their agent because they were related to their agent.[note: 37] 33     In the alternative, Mr Lee argued that rectification ought to be granted on the basis of the unilateral mistake made by the plaintiffs because the defendants knew that the plaintiffs had made a mistake with the Exercise Deadline. 34     Finally, Mr Lee submitted that even if I was not minded to award specific performance, I should award the plaintiffs damages in lieu of specific performance.",
        "The defendants' case": "35     Counsel for the defendants, Mr Morthy, argued that there was no mistake with the Exercise Deadline. Next, he argued that Darrell was at all times acting in the interest of the plaintiffs. If he was to be regarded as an agent of the defendants, it was only on the evening of 15 August 2012 when the plaintiffs signed the Agency Agreement and offered a commission to Darrell, by which point Darrell had already prepared the Option as the agent of the plaintiffs.[note: 38] 36     Mr Morthy also submitted that the defendants never received the Offer Letter and therefore did not know about the 14-day exercise period. He even went as far as to suggest that the Offer Letter was fashioned as an afterthought to support the plaintiffs’ claim.[note: 39] 37     Finally, Mr Morthy stressed that the remedies sought by the plaintiffs were equitable in nature and urged me not to exercise my discretion in the plaintiffs’ favour in the light of the circumstances of the case.[note: 40]",
        "The Happy Valley case": "38     Before I set out my decision, I wish to deal with one point raised by Mr Lee. Apart from his submissions on rectification, Mr Lee attempted to rely onOng Kok Ming (alias Ong Henardi) v Happy Valley Holdings Pte Ltd and another[2011] SGHC 199 (“Happy Valley”) to argue that since the parties were in agreement on the key terms of the Option and the Option Money was already provided, the courts should impute a reasonable exercise period into the Option.[note: 41] 39     InHappy Valley, the court had to determinewhether an agreement existedfor an option to purchase to be issued, even though terms like the option’s exercise period were not yet agreed upon. In the present dispute, the plaintiffs are seeking rectification of an Optionwhich was already issuedbecause they are alleging that notwithstanding the express terms of the Option, the parties were not in factad idemin respect of the exercise period of the Option. The question here, therefore, is not whether the Option existed but whether the conditions for granting rectification were satisfied.",
        "The decision of the court": "40     Given the divergent accounts in relation to some of the events in this dispute, I wish to make some preliminary observations first. I found that Darrell (who was subpoenaed by the plaintiffs), Donny and Pauline were not particularly credible witnesses. They were highly evasive and parts of their testimonies were riddled with inconsistencies and contradictions. On the other hand, I was satisfied that the first defendant and Jolie made genuine attempts to recall the facts and events as best they could; their testimony was largely corroborated by the independent evidence. I was therefore much more inclined to believe their version of the disputed events. 41     I now turn to the key legal principles which the plaintiffs rely on to support their claim.",
        "Rectification for common mistake": "42     Where a document does not truly reflect the intention of the parties, the court has an equitable discretion to rectify the document in line with the parties’ intention. In other words, rectification relates to documents andnot to the parties’ intention. The principles of rectification are reasonably settled and were recently laid down by Lee Seiu Kin J inMaxz Universal Development Group Pte Ltd v Shen Yixuan and Another Suit[2009] SGHC 164 at [22]: ... The following are the general principles regarding rectification: (a)    There must be an “outward expression of accord” in relation to the particular provision. It is not necessary to show that there was a binding agreement prior to the execution of the written document, but it must be shown that parties had a continuing intention with regard to that provision down to the execution of the written contract – seeJoscelyne v Nissen[1970] 2 QB 86. (b)   The burden of proof is on the party seeking rectification and there must be very clear distinct evidence that there was a different intention from the contract document at the time the contract was entered into – seeTucker v Bennett(1887) 38 Ch D 1,Joscelyne v Nissen[1970] 2 QB 86. (c)   The denial of one of the parties that the deed as it stands is contrary to his intention will have considerable weight, and unless the other party can convince the court that the document does not represent both parties’ intentions at the time of execution, rectification will only be ordered exceptionally. It is not sufficient to show that the written contract does not represent the true intention of the parties, it must be shown that the written contract was actually contrary to the intention of the parties – seeLloyd v Stanbury[1971] 1 WLR 535. ...",
        "Rectification for unilateral mistake": "43     The principles of rectification for unilateral mistake were recently considered by Andrew Ang J inSheng Siong Supermarket Pte Ltd v Carilla Pte Ltd[2011] 4 SLR 1094 at [66] and [67]: ... The requirements for allowing rectifications on the ground of unilateral mistake, which requires a higher threshold than that for common mistake, are succinctly set out inAnsonat pp 262-265). Three conditions must be satisfied. First, the non-mistaken party must have actual knowledge of the mistaken party's intentions and of the mistake, and this includes wilfully shutting one's eyes to the obvious. Second, the non-mistaken party must have failed to draw the mistaken party's attention to the mistake. Third, the mistake must be such that the non-mistaken party would derive a benefit, or the mistaken party would suffer a detriment, if the inaccuracy in the document were to remain uncorrected. It is not necessary that the conduct of the non-mistaken party amounts to fraud. All that is necessary is that the knowledge or conduct of the non-mistaken party must be such as to make it inequitable for that party to object to rectification... 44     The higher threshold is required because rectification for unilateral mistake is a drastic remedy. InGeorge Wimpey UK Ltd v VI Construction Ltd[2005] EWCA Civ 77, Sedley LJ observed at [75] that: ... rectification for unilateral mistake has the result of imposing on the defendant a contract which he did not, and did not intend to, make and relieving the claimant from a contract which he did, albeit did not intend to, make. 45     Indeed, the doctrine of rectification for unilateral mistake has been criticised by commentators and it has been suggested that cases of rectification for unilateral mistake should be regarded as situations where the courts give effect to the true agreement between the parties as objectively determined (The Law of Contract in Singapore(Andrew Phang Boon Leonggen ed) (Academy Publishing, 2012) at 10.264).",
        "Intention of the plaintiffs and knowledge of Darrell concerning the Exercise Deadline": "46     Turning to the merits of the plaintiffs’ claim, I accepted that the Exercise Deadline did not reflect the intention of the plaintiffs. The Offer Letter provided for an option period of 14 days and a completion period of eight weeks. This document may have existed prior to the preparation of the Option by Darrell and the 14-day exercise period contained therein would reflect the plaintiffs’ intention. However, the issue remains whether the Offer Letter was tendered to the defendants at all. It appeared to be an internal document for use by ERA agents when recording clients’ instructions on offers to purchase properties. As indicated in the little box at the lower right corner of the standard form, the Offer Letter was in triplicate with the original meant for the client/purchaser, the duplicate meant for the ERA Office and the triplicate for the “Associate” (iethe ERA agent). The only indication that it would be shown to the seller were the words at the lower left stating “The Owner hereby rejects the above offer”, followed by a signature block for the seller’s signature and the date. However, there was no evidence that there was an industry practice where a document like the Offer Letter would always be shown to the seller for him to sign if he rejects the offer. I also see no reason for Donny to prepare an extra standby set without the signatures of the plaintiffs (which was the only copy produced in court – see page 8 of the Agreed Bundle). On the evidence, it was more likely than not that, if the Offer Letter was prepared before the Option, the Offer Letter was never given or shown to the first defendant. I accepted the first defendant’s evidence that no such document was given or shown to him. 47     The terms in the Offer Letter shed some light on how the error as to the Exercise Deadline could have come about.  It appeared that Darrell mistakenly took the Exercise Deadline from the deadline for the owner to accept the offer to purchase,ie4 pm, 16 August 2012, in Clause 4 of the Offer Letter (set out at [15] above). Notwithstanding the first plaintiff’s testimony to the contrary, he must have told Darrell (or told Donny who then informed Darrell) when the plaintiffs needed the Property (iebefore 17 October 2012).[note: 42]He almost certainly would not have wanted to risk being stranded if the Option came back with a completion date that was later than 17 October 2012. 48     With this 17 October 2012 cut-off date in mind, Darrell must have satisfied himself that, based on the eight-week completion period (in Clause 1 of the Offer Letter) starting from 16 August 2012 (iethe Exercise Deadline), the 11 October 2012 completion date he inserted in Clause 5 of the Option (see [17] above) would meet the plaintiffs’ requirements. The calculation of the 11 October 2012 completion date in this manner accords with Darrell’s testimony that he understood the completion period to start from the date on which the Option was exercised. 49     Darrell was apparently labouring under the mistaken assumption that the Option had a 14-day exercise period as well. This was not merely because he testified that he had sight of the Offer Letter but, as Mr Lee pointed out, if he had thought that the Option would expire at 4 pm, 16 August 2012, he would have done everything within his means to ensure the Option was exercised in time as his commission depended on it.",
        "The defendants’ own knowledge": "50     At the outset, Mr Lee’s submission that the defendants would have been prepared to accept a 14-day exercise period had this request been made known to them failed to take the argument very far: the burden was on the plaintiffs to show that the Exercise Deadline was actuallycontraryto the intention of the parties (see [42] above). In this respect, I found that the plaintiffs failed to discharge their burden of proof to show that the defendants had the same intention regarding the Exercise Deadline for the reasons that follow. 51     First, (as indicated at [46] above) I accepted that the defendants never had sight of the Offer Letter. I believed the defendants’ version of the events that took place at Funan on 15 August 2012. Darrell’s version of the events that took place in Funan simply could not be trusted. His recollection that Donny had prepared a non-carbonised version of the Offer Letter was flatly contradicted by Donny’s own testimony (from which I further inferred that if the Offer Letter existed before the Option was prepared, Darrell merely took no more than a cursory glance at the Offer Letter when he prepared the Option). His account of the documents that were handed over to the plaintiffs was also inconsistent. In fact, this was practically accepted by Mr Lee who, in his closing submissions, placed no reliance on the assertion that the defendants had in fact received the Offer Letter. 52     Second, I found that Darrell did not separately mention to the defendants that the plaintiffs wanted a 14-day exercise period. This was apparent from Darrell’s answer to a question posed by Mr Lee:[note: 43] QNow, was [the first defendant] aware that based on the offer to purchase, the option period should actually have been 2 weeks? ADefinitely because, er, we have actually presented the offer to purchase to him, yah.  But, of course, whether he aware that this, erm, particular date is, er, wrong, I’m not too sure because, er, by the time when we received this option to purchase from him together with the commissions agreements from him at Bugis Junction, right, erm, he’s put everything in a envelope.... As stated above, the Offer Letter (or the offer to purchase) was not given or shown to the first defendant. 53     Next, Mr Lee advanced a theory that the defendants knew about the mistake in the Exercise Deadline. As the mistake meant it would be highly unlikely that the plaintiffs could exercise the Option in time, to gain a bigger windfall, they deleted Clause 10 of the Agency Agreement and Clause 14 of the Option to ensure that Darrell would not be entitled to any part of the forfeited Option Money.[note: 44] 54     I considered this theory but could not accept it. I was satisfied that the defendants honestly believed the Exercise Deadline reflected the plaintiffs’ intention. I inferred that the defendants contemplated that the Option would be exercised by 16 August 2012 from Jolie’s evidence that she contacted the defendants’ tenant the same evening of 15 August 2012 about relocating to alternative accommodation. Her testimony was unchallenged by the plaintiffs. 55     Further, there was no evidence that the defendants sought to make the exercise of the Option practically impossible by delaying the delivery of the Option to the plaintiffs. In fact, based on their version of events, they sensed the urgency by returning the signed Option to Darrell on the evening of 15 August 2012, which so far as they were concerned, meant that the plaintiffs had a day to exercise the Option. 56     In this respect, it was crucial to determine the date on which Darrell collected the Option from the defendants. Darrell’s testimony pertaining to this was hopelessly inconsistent. Initially he testified that he only received the Option at Bugis at about 3 pm on 16 August 2012. However, under cross-examination, Darrell admitted that he received the Option on the evening of 15 August 2012 (as per the first defendant’s version of events), citing Donny’s unavailability as the reason why the Option was only passed to Donny at around 3.30 pm on 16 August 2012.[note: 45]The evidence also suggested that the first defendant was only given one copy of the Agency Agreement at Funan. It could therefore be inferred that Darrell must have collected the Agency Agreement in the evening of 15 August 2012 and made a copy of it before handing over a fully executed copy to the first defendant at Bugis on 16 August 2012. 57     I was satisfied that the defendants were not guilty of wilful blindness. In addition to my findings at [54] to [56] above, I noted that, contrary to Mr Lee’s suggestions,[note: 46]some people do not require a housing loan when purchasing property. How the plaintiffs planned to pay for the Property was not the defendants’ concern. This was not a case where the defendants received an option to purchase which had already expired. I was therefore of the view that it was perfectly reasonable for the defendants to accept the Exercise Deadline at face value. 58     I did not draw any inferences against the defendants from their failure to engage STL on 16 August 2012 or to ask Darrell if the Option was exercised when they met up at Bugis later that day. The defendants were inexperienced first-time sellers and they trusted Darrell when he told them that he would take care of all the necessary arrangements on the evening of 15 August 2012 when he collected the signed Option and Agency Agreement from the defendants. 59     I placed little weight on the first plaintiff’s conduct after 21 August 2012 in determining whether the defendants had the requisite intention or knowledge for a claim of rectification to succeed. The observations of the Court of Appeal inKoh Lee Kuen and another v Choon Fook Realty Pte Ltd and others[1996] 3 SLR(R) 182 at [58] are instructive in this respect: ... subsequent events must be viewed with caution as they may not provide evidence of intention prior to or at the time of contract but may be evidence of a later intention... 60     The plaintiff’s claim for rectification for common mistake or unilateral mistake on the basis of the defendants’ actual intention or state of knowledge must therefore fail.",
        "Could Darrell’s knowledge be attributed to the defendants?": "61     It was for this reason that the plaintiffs sought to attribute Darrell’s knowledge of the 14-day exercise period to the defendantsviathe law of agency and to argue that rectification for common mistake should be ordered on this basis. 62     Before considering if such knowledge of a housing agent could be attributed to his client, it must be shown that Darrell was in fact the defendants’ housing agentprior to the defendants granting the Option. After all, assuming no housing agent was involved, knowledge acquired by the defendants after the Option was granted cannot form the basis of a claim for rectification. 63     Whether and when Darrell was appointed as the housing agent for the defendants is a question of fact. Mr Lee submitted that Darrell was appointed during the Unsolicited Call. However, based on the first defendant’s version of the Unsolicited Call, I am not convinced that the first defendant had appointed Darrell as the defendants’ housing agent. The question of whose interest Darrell would represent never came up. The first defendant was entitled to assume that Darrell was calling him as an agent of an interested buyer, given that Darrell was not one of the housing agents marketing the Property. After all, Darrell had represented to the first defendant that he had a genuine buyer (see [12] above). Darrell’s version of the Unsolicited Call was unreliable. His version varied significantly depending on the question that was put to him and I therefore placed little weight on his testimony.[note: 47] 64     I was also satisfied that the defendants had not represented to the plaintiffs at any time that Darrell was acting as their housing agent. The plaintiffs had simply trusted Donny, Pauline and Darrell when they told him that Darrell was the defendants’ housing agent. 65     As mentioned above in [35], Mr Morthy conceded that Darrell became the defendants’ housing agent on the evening of 15 August 2012 when they signed the Agency Agreementieafter Darrell had prepared the Option.[note: 48]I proceeded on this basis for the purposes of my decision. However, on the evidence, the commission in the Agency Agreement was not mutually agreed until Darrell met the first defendant at Bugis on 16 August 2012. It also seemed arguable that it was the defendants’ reliance on Darrell’s assurances that he would take care of everything,after they had already granted the Option, which constituted their implicit appointment of Darrell as their agent. 66     To what extent can the knowledge of an agent acquired prior to his appointment be attributed to his principal? InThe “Dolphina”[2012] 1 SLR 992, after considering various authorities, Belinda Ang J observed at [224]: The effect of these authorities, therefore, is that the knowledge of an agent, such as a director of a company, acquired outside the course of his agency or directorship (such asquadirector of a different company) cannot be attributed to his principal unless the principal was under a duty to inquire into or investigate the matters of which the agent is aware. It is not entirely clear how and when a principal will be under such a duty to inquire or investigate for these purposes (seeBowstead & Reynolds on Agency([216]supra) at para 8-211). InMohammad Jafari-Fini v Skillglass Ltd[2007] EWCA Civ 261 (\"Jafari-Fini\") at [94], Moore-Bick LJ considered that the principal must employ an agent to \"perform a task or transaction of a kind which imposes on the principal a duty to investigate\", but that seems to me to be rather circular. 67     The question of whether a duty arose in this case must be considered in the context of a typical residential property transaction. There was no suggestion that offer to purchase letters were an industry wide practice which the defendants should have enquired about.[note: 49]In fact, in the local context, it is not unusual for the option to purchase to set out all the essential terms of a property transaction. Therefore, sellers are generally not under a duty to inquire about the existence of any terms not contained in the option to purchase. 68     I doubt if any duty of a housing agent to communicate information to his client (arising out of a written agreement or otherwise) alters this position. I find myself in agreement with Hoffmann LJ inEl Ajou v Dollar Land Holdings Plc (No 1)[1994] 2 All ER 685 where he held at p 703-704: I know of no authority for the proposition that in the absence of any duty on the part of the principal to investigate, information which was received by an agent otherwise than as agent can be imputed to the principal simply on the ground that the agent owed to his principal a duty to disclose it. On the contrary, I agree with [Millet J] thatDavid Payne & Co Ltd[1904] 2 Ch 608 at p. 611 is authority against such a proposition. 69     It is the buyer’s housing agent who is responsible for looking out for the buyer’s interest and where the buyer is unrepresented, he has to look after his own interest. In the present dispute, this meant that the plaintiffs’ agent Donny should have handed over the cheque for the Option Money to the defendants (or their agent) only after the terms of the Option were reviewed by him, explained to and agreed by the plaintiffs. Indeed, the terms of the Offer Letter itself seem to contemplate that this would take place. 70     During the cross-examination, Darrell testified that if the transaction had gone through, some of the Donny’s commission (received under the Mutual Agreement) would eventually be paid to Darrell as an “overriding”viaERA’s remuneration structure since Donny was his subordinate (his “downline”).[note: 50]The danger of such a structure is that it incentivises superiors to encourage their subordinates to allow them to “represent” the other party. In practical terms, it was difficult to see how Donny (and/or Pauline) was independent of Darrell. They were practically functioning as one team. It was clear that Darrell’s mistake went undetected until a much later stage because the relationship between Darrell and his subordinates bred complacency and the resulted in the following lapses by Donny. 71     First, Donny never bothered to check the Option after Darrell prepared it and failed to ensure that the plaintiffs initialled on the Option before handing it over with the Option Money (as required by Clause 3 of the Offer Letter). Although Donny testified that he did not fully understand Clause 3 of the Offer Letter, he did not see a need to ask his superior, Darrell, or anybody else about it.[note: 51]If he had checked the Option or got the plaintiffs to initial on the Option, it would have been apparent from reading the first seven lines of the Option that the handwritten Exercise Deadline was incorrect. 72     Second, contrary to Donny’s testimony, it was highly unlikely that he went through the Option with the first plaintiff after getting it back on 16 August 2012. If he had done so, it would be surprising that the Exercise Deadline, which was that very day, was not noticed by him or the first plaintiff. 73     I could not accept that the loss should lie with the defendants just because the plaintiffs were unlikely to seek legal recourse against their own agent as they are related to him. In this case, three housing agents, the first two of whom were related to the first plaintiff and were subordinates of the third, attempted to broker a deal as a team without any regard as to whose interests they were supposed to look after. They created a facade of independence to the transacting parties when they were in reality working hand in glove. They had an agreement to share the commission payable by the defendants (see the Mutual Agreement at page 23 of the Agreed Bundle) and Darrell would eventually benefit from Donny’s share of the commission by virtue of the ERA remuneration structure. There was even evidence by the first plaintiff that Darrell sent a messageviaSMS to him on 29 August 2012 pleading for his “kind help and understanding to give me a grace period ...” to raise money to pay the first plaintiff for his loss, which suggested that Darrell felt personally responsible to the plaintiffs for the mistake he had made. In the circumstances, even if all the conditions for rectification were satisfied, it would have been inequitable to grant rectification in favour of the plaintiffs and to the detriment of the defendants. 74     I therefore dismissed the plaintiffs’ claim for rectification. As a result, their claim for specific performance or damages in lieu of specific performance also failed and I dismissed it as well.",
        "Defendants’ claims": "75     I granted the defendants’ prayer in the originating summons for the plaintiffs’ Caveat on the Property to be lifted. That had to be done by 4 pm on Friday, 15 February 2013. As for the defendants’ claim for damages, it was neither pleaded as a counterclaim in the suit nor raised as a claim in the originating summons. I therefore made no order regarding such a claim. I awarded costs of the proceedings to the defendants, such costs to be agreed or to be taxed. As both matters were consolidated and they dealt with essentially the same subject matter, there would be only one set of costs. 76     Insofar as the plaintiffs were concerned, I sympathised with their situation, that a happy event like moving into a new home had taken such an unfortunate turn. However, having heard all the witnesses, it seems to me that any remedy they may have does not lie against the defendants.  [note: 1]Transcript 6/2/13 p 5; Transcript 6/2/13 p 93 [note: 2]Ibid [note: 3]First plaintiff AEIC [6] (Bundle of affidavits p 91) [note: 4]Transcript 4/2/13 p 44 [note: 5]Transcript 6/2/13 p 11 [note: 6]Transcript 5/2/13 p 111 [note: 7]Transcript 5/2/13 p 7 [note: 8]Transcript 6/2/13 p 120 [note: 9]Transcript 5/2/13 p 7 cf First defendant 1stAEIC [17] (Bundle of affidavits p 7) [note: 10]Transcript 6/2/13 p 17 [note: 11]Transcript 5/2/13 p 12 cf First defendant 1stAEIC [17] (Bundle of affidavits p 7) [note: 12]Transcript 5/2/13 p 19 [note: 13]Transcript 5/2/13 p 20; First defendant 1stAEIC [19] (Bundle of affidavits p 8) [note: 14]First defendant 1stAEIC [19] (Bundle of affidavits p 8) [note: 15]Donny AEIC [7] (Bundle of affidavits p 131); Transcript 5/2/13 p 21 [note: 16]Agreed bundle p 8 [note: 17]Transcript 5/2/13 p 30 [note: 18]Agreed bundle p 11-12 [note: 19]First defendant 1stAEIC [19] (Bundle of affidavits p 8) [note: 20]Transcript 5/2/13 p 52 [note: 21]First defendant 1stAEIC [22] (Bundle of affidavits p 9) [note: 22]Transcript 6/2/13 p 86-87 [note: 23]Agreed bundle p 19. [note: 24]First defendant 1stAEIC [21] (Bundle of affidavits p 21) [note: 25]Transcript 6/2/13 p 49-50 [note: 26]First defendant’s 1stAEIC [24] (Bundle of affidavits p 10) [note: 27]Ibid [note: 28]Transcript 4/2/13 p 55-56 [note: 29]Transcript 4/2/13 p 56-58 [note: 30]Transcript 5/2/13 p 145-146 [note: 31]Agreed bundle p 23 [note: 32]Agreed bundle p 48 [note: 33]First plaintiff AEIC [33] (Bundle of affidavits p 98); Transcript 6/2/13 p 44 [note: 34]Transcript 6/2/13 p 24-25 [note: 35]Transcript 8/2/13 p 15-16 [note: 36]Transcript 8/2/13 p 16 [note: 37]Transcript 8/2/13 p 22 [note: 38]Transcript 8/2/13 p 6 [note: 39]Transcript 8/2/13 p 5 [note: 40]Transcript 8/2/13 p 4 [note: 41]Transcript 8/2/13 p 35 [note: 42]Transcript 4/2/13 p 8-9 [note: 43]Transcript 4/2/13 p 53 -54 [note: 44]Transcript 6/2/13 p 31 [note: 45]Transcript 5/2/13 p 46 [note: 46]Transcript 6/2/13 p 44-45 [note: 47]Transcript 4/2/13 p 46; Transcript 5/2/13 p 8-11 [note: 48]Transcript 8/2/13 p 7 [note: 49]Transcript 8/2/13 p 10 [note: 50]Transcript 5/2/13 p 98-100 [note: 51]Transcript 5/2/13 p 117"
    }
}