{
    "case_title": "Liau Cheng Mee James & another\n      v\n      Liau Ee Ling Julie",
    "ncitation": "[2013] SGHC 147",
    "coram": "Chan Seng Onn J",
    "sections": {
        "The sums of $6,476.90 and $11,879.56 as expenses of the estate": "5       The sums of $6,476.90 and $11,879.56 represented the legal fees of May Oh & Wee and Edmond Pereira & Partners respectively for work done in obtaining the grant of probate. These expenses were plainly necessary for the administration of the Deceased’s estate. The defendant argued that there was an understanding reached between the parties on 1 February 2008 that the parties (and not the estate) would bear the costs of their respective lawyers. In my judgment, the defendant’s contention was not supported by the documentary evidence. In particular, the contemporaneous notes that were allegedly taken at the 1 February 2008 meeting referred to matters that were irrelevant for the purposes of the present suit. I did not believe that an understanding was ever reached such that the plaintiffs had to bear personally the legal costs of obtaining the grant of probate.",
        "The sum of $66,100 as an expense of the estate": "6       The sum of $66,100 represented the 1% commission paid to the property agent for the sale of the Deceased’s property at $6,610,000. The defendant managed to find a buyer who made an offer of $6,538,888 (without commission) for the property. However, this offer was still lower than the eventual sale price of $6,610,000 even after the 1% commission was taken into account. It was also not disputed between the parties that the closed tender process conducted by the property agent produced the highest offer for the Deceased’s property. I therefore found no credible objection to the sum of $66,100 being declared as an expense of the estate.",
        "The counterclaims": "7       The defendant made a claim of $5,401.83 for,inter alia, expenses in relation to the upkeep of the Deceased’s property. I found that the defendant’s claim was not supported by proper documentary evidence because the alleged receipts that she presented appeared to have been typed out by the defendant herself. The only exception I found was the receipt issued by The Salvation Army and I accordingly allowed her claim of $600 for that receipt. 8       I declined to order that the plaintiffs further account for the sum of $6,610,000 as this had been fully accounted for by the plaintiffs in their letter to the defendant dated 4 November 2010. 9       Similarly, I did not require the 2ndplaintiff to further account for the sum of $129,087.49 because she had already given an account of it at the trial. I was satisfied with her detailed explanation on how she had used the monies from the joint account for the benefit of the Deceased when she was alive and thereafter, how she had expended further sums for the purpose of maintaining the Deceased’s property (ie, gardening fees, property tax and utilities). She also paid out a total sum of $100,000 from that account in order to discharge the NTUC reverse mortgage on the Deceased’s property. After paying for these expenses, the balance amount was paid into the estate account for distribution according to the will as the 2ndplaintiff had decided not to claim any money in the joint account for herself. I found that she had fully accounted for the use of the monies in the joint account.",
        "Conclusion": "10     For the foregoing reasons, I allowed the majority of the plaintiffs’ claims and dismissed almost the entirety of the defendant’s counterclaim. I ordered costs to be paid by the defendant to the plaintiffs, to be taxed if not agreed."
    }
}