{
    "case_title": "Lotusonwater Jadeite Pte Ltd\n      v\n      Ang Chee Soon Vincent",
    "ncitation": "[2013] SGHC 100",
    "coram": "Woo Bih Li J",
    "sections": {
        "Introduction": "1       The plaintiff (“Lotusonwater”) is a company incorporated in Singapore which sells jadeite and art products. It has an outlet in The Shoppes at Marina Bay Sands (“MBS”). The defendant (“Ang”) is a businessman and member (meaning a customer) of Lotusonwater.[note: 1]He is also a director and sole shareholder of AVA Global Pte Ltd (“AVA Global”) and holds directorships in various other companies. This action was a claim by Lotusonwater against Ang for breach of contract. Lotusonwater alleged that on 24 March 2011, it entered into a contract with Ang for the sale and purchase of a sandalwood Goddess of Mercy statue at the price of $538,888. With Goods and Services Tax (“GST”), the total price was $576,610.16. 2       Ang however alleged that the contract was not for the sale and purchase of the statueper sebut was instead a package deal for the provision of a geomancy service, also known as feng shui service, which included the supply of the statue for which no separate price was quoted. The geomancy service was to be provided by one Cheah Fah Loong at AVA Global’s factory at Tuas Avenue 2 (“the Tuas factory”) and as it was not provided, the balance sum was not payable. Cheah is also known as Master Yun and was a director of Lotusonwater at all material times. Ang alleged that Master Yun was and is a feng shui “master”, which Master Yun did not deny. 3       Ang also alleged that although Lotusonwater was a contracting party, the contract was not made with him personally but with AVA Global. Ang did not dispute that there were discussions between Master Yun and him in respect of the contract. However, his position was that those discussions and the eventual contract were entered into by him on behalf of AVA Global. 4       Ang’s third allegation was that the statue was defective because it had broken fingers and that Master Yun had initially agreed to replace the statue at no additional cost, but subsequently demanded another $90,000 for the replacement of the statue. 5       On 1 April 2013, I granted Lotusonwater judgment on its claim and costs. I set out my reasons below. I will highlight first the respective versions of events before stating my findings of fact.",
        "Versions of events": "",
        "Lotusonwater’s version": "6       On 23 March 2011, Ang had visited the MBS outlet and indicated that he wanted to buy a sandalwood Goddess of Mercy statue. Master Yun told Ang the one on display was not for sale but that he could purchase the one housed at Master Yun’s house for $538,888, and Ang agreed.[note: 2]With GST, the total purchase price was $576,610.16. Ang then asked Master Yun to accompany him to AVA Global’s factory at Joo Koon Crescent (“the Joo Koon factory”) to indicate where the statue could be placed, and Master Yun agreed.[note: 3] 7       On 24 March 2011, Master Yun accompanied Ang to the Joo Koon factory. After Master Yun indicated to Ang that the Joo Koon factory was not ideal for his business, Ang suggested visiting AVA Global’s other factory, the Tuas factory, to see if the statue could be placed there, and Master Yun agreed.[note: 4]After looking at the factories, Master Yun suggested to Ang to place the statue at the Tuas factory. However, the statue could first be placed at the Joo Koon factory as it would help Ang get a good price for the sale of that factory.[note: 5]Following the visits, Master Yun and Ang returned to the MBS outlet where Ang told Master Yun that he had difficulties paying the full sum, and asked to pay $100,000 first, with the balance to be paid at a later date either with the proceeds of the sale of the Joo Koon factory before October 2011, or by the end of October 2011. Master Yun agreed to this arrangement as Ang was a regular customer.[note: 6]Ang paid the deposit with his personal American Express credit card and the printed receipt (“the Receipt”) with a written tax invoice numbered 811450 (the “Written Invoice”)[note: 7]was issued to him in the name of Hong Ying Hai which is Ang’s Mandarin name spelled in phonetics.[note: 8] 8       On 25 March 2011, Ang inspected the statue, which was brought from Master Yun’s house, at the MBS outlet.[note: 9]Master Yun blessed the statue and wrapped it in red cloth. Thereafter, the statue was brought to Ang’s car at MBS and then to the Joo Koon factory with the help of two of Lotusonwater’s staff.[note: 10]There, Ang signed the delivery order for the statue[note: 11]which acknowledged the delivery of the statue in satisfactory condition. 9       On 28 March 2011, Master Yun received a call from Ang who alleged that the statue was damaged as two of its fingers appeared to have been glued in place. Master Yun assured him that it was common for some touch-ups to be done, but this would not affect the statue’s powers or blessings. There was no mention of a replacement of the statue.[note: 12] 10     On 23 October 2011, Ang visited Master Yun at the Sin Ming Road outlet of Lotusonwater. Ang raised the issue of the alleged defect of the statue and asked for a replacement. Master Yun suggested that if Ang was concerned about the defect then he would replace the delivered statue with the statue on display at MBS, but with an additional payment of $90,000 as the retail price for that statue was $680,000. Ang rejected the offer and left the outlet.[note: 13]Although both parties referred to the payment of an additional $90,000 for a replacement of the statue and a new total price of $680,000, there appeared to be a discrepancy because an additional $90,000 to the original price of $576,610.16 does not amount to $680,000 with or without GST. I mention this for completeness as neither side appeared to notice the discrepancy. Fortunately, the discrepancy had no material effect on the issues before me. 11     Subsequently, Lotusonwater corresponded with Ang for the payment of the outstanding balance sum for the statue which culminated in a letter of demand, dated 14 December 2011, sent by Lotusonwater’s then solicitors to Ang.[note: 14]",
        "Ang’s version": "12     On 23 March 2011, Ang went to the MBS outlet to engage Master Yun for the performance of geomancy service for AVA Global.[note: 15]Master Yun knew that Ang was a director and sole shareholder of AVA Global. When Ang discussed the matter with Master Yun, he referred to AVA Global and its business as “my company”, “my business”, “my factory” and other such generic phrases.[note: 16]Master Yun said that the geomancy service he provided worked best when accompanied with prayers offered to the Goddess of Mercy. Ang had no intention of buying the statue alone. Therefore, Ang suggested that Master Yun visit AVA Global’s Tuas factory. If Master Yun thereafter confirmed that the geomancy service he was to provide coupled with prayers offered to the Goddess of Mercy would indeed enhance AVA Global’s business, Ang would buy the statue.[note: 17]Master Yun agreed with Ang’s suggestion. Ang alleged that he also mentioned that the geomancy service was to be performed after AVA Global had obtained the necessary approvals to renovate the Tuas factory. 13     On 24 March 2011, Ang went to fetch Master Yun. In the course of his conversation with Master Yun, Master Yun asked him where his office was  located at that time. He informed Master Yun that it was located at Joo Koon Crescent and Master Yun said he would also need to view the Joo Koon factory for the geomancy service. As such, Ang drove Master Yun to the Joo Koon factory first. At the Joo Koon factory, Master Yun confirmed that prayers offered to the Goddess of Mercy would enhance the beneficial effect of the geomancy service that he would provide, and indicated a position in Ang’s office at the Joo Koon factory where the statue should be placed first. They then visited the Tuas factory. Thereafter, Ang brought Master Yun back to the MBS outlet. Ang inspected the sandalwood Goddess of Mercy statue on display, encased within a glass case, and found no visible defects or damage to the statue.[note: 18]During his inspection, a staff from the outlet, known as Mei Li, informed Ang of the price of the geomancy service and the statue as $538,888 (with GST, the total was $576,610.16).[note: 19]Ang agreed to the price and requested for the statue to be delivered on 25 March 2011. Master Yun asked for a deposit of $100,000 for the statue and Ang agreed.[note: 20]Ang did not bring AVA Global’s cheque book and so used his personal American Express credit card to pay for it. Ang remembered signing a document written in Chinese at the request of the staff, but could not recollect what was written on the document. Ang was given the Receipt only. His position was that the Written Invoice was not given to him and he did not agree that the Written Invoice was in fact issued on 24 March 2011. Ang said he had assumed that the statue he had purchased was the statue that he had inspected at the MBS outlet. Subsequently, Ang went to the Joo Koon factory and passed the Receipt to his accounts staff and asked them to reimburse him for the $100,000 deposit as a company expense.[note: 21] 14     On 25 March 2011, Ang drove to MBS where he waited for two staff members of Lotusonwater to bring the statue, draped in red cloth, to his car. He did not go up to the MBS outlet of Lotusonwater that day. The statue was brought to him while he was waiting in his car and then brought to the Joo Koon factory and placed in his office. Ang accepted delivery of the statue and signed the delivery order issued by Lotusonwater. He did not examine the statue closely as he assumed that it was the same statue that he had inspected at the MBS outlet the previous day.[note: 22] 15     On 28 March 2011, Ang noticed that two fingers of the left hand of the statue were broken and had been glued into place. Ang rang Master Yun about the issue as he was worried that the broken fingers would mar the beneficial effect to AVA Global’s business. Ang was assured by Master Yun that this was not so, but he still went down to the MBS outlet where, to his surprise, he saw the Goddess of Mercy statue, which he had inspected on 24 March 2011, on display.[note: 23]Mei Li informed him that the display statue was not for sale, and that Ang had paid for a similar statue and not the one on display. Ang then asked for a replacement for his defective statue. Mei Li declined this as the shop’s policy was to not retake statues. On that day or a day later, Ang spoke to Master Yun to insist on a replacement, which Master Yun eventually agreed to.[note: 24] 16     In May 2011, Ang visited the MBS outlet and Mei Li informed him that she was still checking about the replacement statue.[note: 25]On 23 October 2011, Ang visited Master Yun at the Sin Ming Road outlet of Lotusonwater. Ang wanted Master Yun to visit the Tuas factory to perform the geomancy service, and also requested for a replacement of his defective statue. Instead, Master Yun asked for a further $90,000 for the geomancy service and replacement making a total of $680,000. Upon hearing this, Ang cancelled the contract and requested Master Yun to take back the statue and refund the $100,000. Master Yun disagreed and after a heated exchange, Ang was asked to leave the premises.[note: 26]",
        "Findings of Fact": "",
        "Was the contract for a package deal?": "17     Ang alleged that the purchase of the statue was included as part of a package deal for geomancy service that was to be provided to AVA Global by Master Yun. If the geomancy service was cancelled, Ang would not have to pay the balance sum or any sum. Lotusonwater denied the alleged package deal, and claimed that there was only a contract for the sale and purchase of a statue. 18     There were two important pieces of evidence concerning this issue. Firstly, there was email correspondence, from 24 October 2011 to 6 December 2011, between one Anna Tan (“Anna”), Ang’s secretary who was acting on his instructions, and Lotusonwater about the payment of the balance sum of $476,610.16.[note: 27]The package deal was never mentioned in the email from Anna. Ang did not provide a satisfactory explanation for this omission. 19     Secondly, in Ang’s own reply dated 15 December 2011 to a letter of demand sent by Lotusonwater’s then solicitors for the payment of the balance sum, Ang had said:[note: 28] “... Your client sold an inferior wooden figurine to us and we had notified your client to the defects but no action [sic] ever since. Attached [sic] please find photos and emails for your record. We had informed your client to take back the inferior wooden figurine and return the deposit in the amount of $100000.00 to us [sic] however with no response...” Once again, there was no mention of the geomancy service. Neither could Ang satisfactorily explain the omission. Therefore, Ang did not raise the issue about a package deal in writing before this action was commenced by Lotusonwater although he had many occasions to do so. If Ang genuinely believed all along that the contract was primarily for geomancy service and that the statue was part of a package deal, he would have mentioned this when he was pressed for payment. He did not. 20     Additionally, Master Yun’s affidavit of evidence-in-chief (“AEIC”) referred to the Written Invoice.[note: 29]The description of the subject matter of the Written Invoice was in Chinese. The English translation was: “Goddess of Mercy with Multiple Arms and Eyes”. There was no mention of any geomancy service. Master Yun stated in his affidavit that the Written Invoice was issued to Ang after he paid $100,000 as part payment of the statue on 24 March 2011. This was disputed by Ang who said he did not receive the Written Invoice. Indeed, it was suggested by Ang’s counsel that the Written Invoice was issued much later. The original of a booklet of tax invoices that Lotusonwater kept was produced before me. Each invoice had a serial number and a date. A copy of the Written Invoice was found in the booklet. Based on the serial numbers and dates of invoices before and after the Written Invoice, I concluded that Lotusonwater did issue the Written Invoice on 24 March 2011. In my view, Ang did receive it that day. Ang did not suggest that if he had received the Written Invoice, he could not read or understand the description on the Written Invoice. In my view, he did read it and understood that the description was for the statue only. 21     This brings me to three computer generated (“CG”) tax invoices each numbered 811450. According to Master Yun, these three invoices were sent by Lotusonwater to AVA Global with an email dated 12 May 2011 from a staff by the name of Maggie Wu. Each of these invoices was dated 24 March 2011 with the description of the subject as “GEOMANCY SERVICE”.[note: 30]There was no mention of a statue. Three different amounts were stated in the invoices, namely, $476,610.16; $100,000 and $38,000 respectively. 22     Ang said he did not receive the email and the three invoices attached to the email. His counsel pointed out that the email sent by Maggie Wu to AVA Global was sent to a wrong email address. Ang’s position was that AVA Global received one of the three CG invoices, that is, the one which was for $100,000 only.[note: 31]He said that as this invoice was sent to AVA Global, he did not see it when it was received by the accounts department of AVA Global. He asked to look at it only after he received the letter of demand from Lotusonwater’s then solicitors. 23     Master Yun explained during his cross-examination that the three CG invoices were issued at Ang’s request. He was told by Mei Li that Ang could not claim any reimbursement from his company if the invoice was described as the Goddess of Mercy, and so Master Yun signed the invoices but left the description blank for his staff to insert after receiving Ang’s instructions. They were then sent to Ang.[note: 32]Master Yun stated that the $38,000 invoice was a deposit for a geomancy service to be carried out for a factory in Guangzhou, China, which is allegedly owned by Ang,[note: 33]but that the other two invoices were for the $576,610.16 purchase price of the statue.[note: 34] 24     However, Mei Li was not called to give evidence as she was allegedly unavailable. Therefore, whatever she told Master Yun was hearsay evidence and was inadmissible. 25     After considering all the evidence, I concluded that the contract was for the sale and purchase of the statue only. I rejected Ang’s contention that it was for a package deal comprising the provision of geomancy service and the supply of the statue. The fact that he had raised this contention so late in the day was important evidence against his contention. I also found that he did receive the Written Invoice on 24 March 2011 and he did not protest about the description on that invoice because there was no contract for the provision of geomancy service. I also found Master Yun to be a more credible witness than Ang.",
        "Who was the contract with?": "26     As mentioned above, Ang alleged that he had purchased the statue as an agent on behalf of AVA Global. His counsel relied on,inter alia, the CG invoice for $100,000 which was issued to AVA Global and the fact that the statue was placed at AVA Global’s factory.[note: 35] 27     In Ang’s AEIC, he stated that Master Yun knew that the geomancy service was to be done for AVA Global, and that he was representing AVA Global in seeking it. On the other hand, Master Yun stated in his AEIC that although he knew that Ang was a director and sole shareholder of AVA Global, he had always dealt with Ang in his personal capacity. Ang was himself a regular customer. In Ang’s Further and Better Particulars of his Defence, Ang had admitted that he did not “specifically inform Master Yun that the request for geomancy service was made by [him] in his capacity as agent and director of AVA Global...”[note: 36]This was further confirmed in Ang’s cross-examination where he stated that it was only “in [his] mind” that he was representing AVA Global when he contracted with Master Yun for the statue.[note: 37] 28     Furthermore, Ang had admitted in his affidavit that he did not bring AVA Global’s cheque book down to the outlet at MBS and had part-paid $100,000 for the statue with his own personal credit card.[note: 38]When Ang brought Master Yun to visit the factories on 24 March 2011, Ang must already have contemplated the possibility, if not the likelihood, of entering into a contract with Lotusonwater. If he had genuinely intended for AVA Global to be the contracting party, he would have brought its cheque book or a single blank cheque from AVA Global for him to issue. He did not. Neither did he ask for the Written Invoice to be issued in the name of AVA Global. 29     Even if the evidence stated in [28] above was neutral, the email correspondence between Anna and Lotusonwater was not. Notably, in an email dated 6 December 2011 from Anna,[note: 39]she referred to Ang, and not AVA Global, as the purchaser (see, for example, paras 2, 8, 9, 10 and 13 of that email). By 6 December 2011, Ang would have told his secretary that AVA Global was the contracting party, if that was truly the case. 30     Accordingly, I concluded that the contract was entered into with Ang personally.",
        "Was the statue defective, and if so, what was the consequence?": "31     As mentioned above, Ang had alleged that the statue which was delivered was defective as two of its fingers were broken and had been glued into place.[note: 40]Ang stated that he had noticed the alleged defect on 28 March 2011.[note: 41] 32     It is important to note that it was Ang’s burden to prove that the statue was defective. Ang submitted some photographs of the alleged broken fingers,[note: 42]but they were out of focus and dark. The statue was not exhibited in court. Furthermore, I found that Ang was afforded a reasonable opportunity to examine the statue on 25 March 2011. Even if Ang did not go up to the MBS outlet that day and simply waited in his car for the statue to be brought to him, I was of the view that Ang would have examined the statue when it was placed in his office at the Joo Koon factory. After all, the purchase price was a huge sum. Ang had also signed the delivery order which acknowledged that he had received the statue in satisfactory condition.[note: 43]Ang later said that he could not understand English and could not understand what he was signing[note: 44]but I did not believe him. It was noteworthy that there was no interpretation statement for his AEIC and he did not mention this allegation in his AEIC. I was of the view that he failed to discharge his burden of proof. 33     Even if there was a defect in the statue, it appeared that Ang had accepted the statue with knowledge of the defect. In an email dated 15 November 2011 from Anna to Lotusonwater,[note: 45]she had mentioned the defect in the statue and then said that payment would be effected when the Joo Koon factory was sold and payment (for the factory) was collected.[note: 46]However, I would add that Lotusonwater did not plead that Ang had affirmed the contract even if the statue was defective. 34     The email of 15 November 2011 was also material on other points: (a)     There was no mention of the provision of geomancy service. (b)     It corroborated to some extent Master Yun’s evidence as to the reason for delay for the payment of the balance sum, except that Master Yun’s version was that payment thereof would be made when the Joo Koon factory was sold and this was not dependent on AVA Global receiving payment for the factory. (c)     There was no mention of Master Yun having agreed to replace the statue free of charge initially.",
        "Additional observations": "Which statue did Ang purchase? 35     According to Lotusonwater’s version, Master Yun had made it clear that Ang would be purchasing a similar statue, and not the statue on display, which Ang had agreed to.[note: 47]On the other hand, Ang’s counsel alleged during Master Yun’s cross-examination that he had paid for the statue on display but received a defective statue similar to the one on display. 36     This allegation however, was not in his pleaded case. Ang’s pleaded case in relation to the defective statue was that the statue was defective and to be replaced, and not that he did not receive the statue on display.[note: 48] 37     Also, Ang’s Defence to Lotusonwater’s Statement of Claim stated that Ang was shown a “like statue that was displayed at [Lotusonwater’s] premises”.[note: 49]This suggested that Ang knew that he would not be receiving the statue on display, but a similar one. Furthermore, Ang’s affidavit filed on 9 March 2012 in response to an application by Lotusonwater for summary judgment stated that on 25 March 2011, when he brought the statue back to the Joo Koon factory with two members of Lotusonwater’s staff, “[he] had earlier viewed a similar statue at the [MBS Outlet]”.[note: 50]This was telling. Notably, in Ang’s AEIC, he left this part out. 38     As Ang had not pleaded that he had received the wrong statue, he could not rely on this allegation. In any event, I rejected his allegation that he thought that he had bought the statue displayed at the MBS outlet. No counterclaim or set-off pleaded 39     If there was a defect with the statue it would have been arguable whether the defect was so serious as to entitle Ang to terminate the contract and claim the refund of the $100,000 deposit. However, there was no counterclaim for the $100,000 deposit. 40     Alternatively, Ang might have been able to claim damages and set-off the damages against the balance sum. However, Ang also did not claim damages whether by way of set-off or otherwise. Neither was there any evidence as to what the quantum of the damages ought to be.",
        "Conclusion": "41     I granted Lotusonwater judgment for the sum of $476,610.16 with interest thereon at the rate of 5.33% per annum from the date the Writ of Summons was filed, that is 23 December 2011, to the date of payment. 42     Ang was to pay Lotusonwater’s costs (excluding disbursements) of the trial and for the application for summary judgment which I fixed at $80,000. Parties had agreed that I should include the costs of the application for summary judgment in the costs of the trial which I was fixing. 43     Ang was to pay Lotusonwater’s disbursements for the trial and the application for summary judgment which were to be agreed or fixed by the court.  [note: 1]Plaintiff’s Bundle of Affidavits of evidence-in-chief (“PBAEIC”) Tab 1, pp 16-19. [note: 2]Notes of Evidence (“NE”) 25/03/13 9:1-25; PBAEIC Tab 1, p 3, para 7-8. [note: 3]PBAEIC Tab 1, p 4, para 10. [note: 4]PBAEIC Tab 1, p 4 para 10-12. [note: 5]PBAEIC Tab 1, p 4-5, para 11-13. [note: 6]PBAEIC Tab 1, para 14-16. [note: 7]Agreed Bundle (“AB”) p 9-10; PBAEIC Tab 1, p 21-22. [note: 8]The phonetics can also be seen in a comparison of AB 12 and 13 under the addressee. [note: 9]NE 25/03/13 13:1-19; 19:11-14. [note: 10]PBAEIC Tab 1, p 6, para 17. [note: 11]PBAEIC Tab 1, p 7, para 18. [note: 12]PBAEIC Tab 1, p 9, para 21-23. [note: 13]PBAEIC Tab 1, p 11-12, para 27-31. [note: 14]PBAEIC Tab 1, p 60. [note: 15]PBAEIC Tab 3, p 5, para 5. [note: 16]PBAEIC Tab 3, p5, para 5. [note: 17]PBAEIC Tab 3, p 6, para 6. [note: 18]PBAEIC Tab 3, p 8, para 8. [note: 19]PBAEIC Tab 3, p 9, para 8. [note: 20]PBAEIC Tab 3, p 9, para 9. [note: 21]Ibid. [note: 22]PBAEIC Tab 3, p11 , para 10. [note: 23]PBAEIC Tab 3, p 12, para 13. [note: 24]PBAEIC Tab 3, p 13-14, para 13. [note: 25]PBAEIC Tab 3, p 15, para 15. [note: 26]PBAEIC Tab 3, p 17, para 17. [note: 27]AB 42-45; AB 47-48. [note: 28]AB 50. [note: 29]AB 9-10; PBAEIC Tab 1, p 21-22. [note: 30]AB 63-65. [note: 31]AB 64. [note: 32]NE 25/03/13 42:1-43:25. [note: 33]NE 25/03/13 37:8-38:16. [note: 34]NE 25/03/13 50:4-25; NE 25/03/13 63:3-12. [note: 35]NE 25/03/13 69:17-70:2. [note: 36]SDB, Tab 4, p 6. [note: 37]NE 27/03/13 4:18-5:10. [note: 38] [note: 39]AB 47-48. [note: 40]PBAEIC Tab 3, p 11-12, para 12. [note: 41]PBAEIC Tab 3, p 11, para 12. [note: 42]AB 15-18. [note: 43]AB 13. [note: 44]NE 26/3/13 79:18-80:25. [note: 45]AB 44. [note: 46]AB 44. [note: 47]SDB, Tab 1, para 5. [note: 48]SDB, Tab 2, para 13. [note: 49]SDB, Tab 2, para 9. [note: 50]Exhibit P4, para 8."
    }
}