{
    "case_title": "HKL Group Co Ltd\n      v\n      Rizq International Holdings Pte Ltd",
    "ncitation": "[2013] SGHCR 8",
    "coram": "Jordan Tan AR",
    "sections": {
        "Introduction": "1       InHKL Group Co Ltd v Rizq International Holdings Pte Ltd[2013] SGHCR 5 (“the Judgment”), I granted a stay of these proceedings in favour of arbitration on the following condition: [T]hat parties obtain the agreement of the SIAC [Singapore International Arbitration Centre] or any other arbitral institution in Singapore to conduct a hybrid arbitration applying the ICC [International Chamber of Commerce] rules, with liberty to apply should they fail to secure any such agreement. I had also stated (at [37] of the Judgment) that I would hear parties on the issue of the imposition of any other conditions and on the issue of costs. 2       I heard the parties on 4 March 2013. The plaintiff, HKL Group Co Ltd (“HKL”), sought the imposition of an additional condition, namely, that the defendant, Rizq International Holdings Pte Ltd (“Rizq Singapore”), furnish security for the sum claimed pending arbitration. HKL also advanced further arguments concerning the condition I had imposed. As for costs, Rizq Singapore sought costs and HKL resisted. 3       Having heard the parties, I retained the condition I had imposed and added the condition that Rizq Singapore furnish security for costs for the period leading up to the arbitration (and not security for the sum claimed) in the sum of $25,000 by way of solicitor’s undertaking or a bank guarantee within 14 days of my order. I also made no order as to costs. 4       I should also note that at the hearing, the parties informed me that they had accepted the suggestion I had made (at [38] of the Judgment) to resolve the dispute in a more practical manner by agreeing to submit the dispute to a straightforward SIAC arbitration. The parties asked that I record their agreement and I did. 5       That being so, HKL has nonetheless filed an appeal. I now set out the reasons for my decision at the 4 March 2013 hearing.",
        "Retaining the condition previously imposed": "6       HKL argued against the condition I had imposed on the ground that Art 1(2) of the ICC Rules, which took effect on 1 January 2012, provided that only the International Court of Arbitration of the ICC may administer an ICC arbitration. Art 1(2) reads as follows: The [International Court of Arbitration] does not itself resolve disputes. It administers the resolution of disputes by arbitral tribunals, in accordance with the Rules of Arbitration of the ICC .... The Court is the only body authorized to administer arbitrations under the Rules, including the scrutiny and approval of awards rendered in accordance with the Rules. ... 7       I noted also that Article 6(1) of the ICC Rules, which was continued in the 2012 version of the rules, provided that: Where the parties have agreed to submit to arbitration under the [ICC] Rules, they shall be deemed to have submitted ipso facto to the Rules in effect on the date of commencement of the arbitration, unless they have agreed to submit to the Rules in effect on the date of their arbitration agreement. 8       In other words, although the arbitration clause in the present case was concluded before 1 January 2012, Art 1(2) of the ICC Rules applies. 9       Nonetheless, I retained the condition I had imposed as it encompassed, by the use of the words “any arbitral institution”, the option of parties procuring an ICC arbitration in Singapore. I did not truncate the condition to exclude all other arbitral institutions, and therefore did not preclude the option of a hybrid arbitration for one reason. Pathological arbitration clauses create problems for parties and do not represent the majority of arbitration clauses under which arbitration may be initiated with minimal fuss. The path to dispute resolution is fraught with the obstacles generated by the pathology. This being so, the parties should be offered more options for the resolution of the pathology, where these options are within the bounds of consistency with the wording of the arbitration clause. 10     Where the words “Arbitration Committee” used in the arbitration clause do not refer to any particular arbitral institution, it was in my view, unnecessary to limit the options of the parties in resolving the dispute. Although Art 1(2) of the ICC Rules claims for the International Court of Arbitration the sole authority to administer ICC arbitrations, the power of the rules to bind emanates from the consent of the parties. Art 1(2) cannot curtail the freedom of parties to agree to be bound by the result of an arbitration administered by a different arbitral institution applying the ICC Rules, neither can it curtail the power of the court to give an interpretation to a pathological arbitration clause, where that clause uses language which admits the possibility of different arbitral institutions, which provides a wider range of solutions to the parties. 11     I must emphasise, however, that leaving open this possibility of a hybrid arbitration as part of a range of solutions to resolve the problems created by the pathological arbitration clause is in no way a judicial endorsement of a hybrid arbitration. I had noted the inconvenience associated with a hybrid arbitration (at [38] of the Judgment). In the ordinary course of things, hybrid arbitrations should be avoided. In fact, it is inconceivable that commercial parties with the benefit of legal advice will deliberately choose to resolve disputes by way of a hybrid arbitration. But, in this particular context, where parties are faced with the difficulty of overcoming a pathological arbitration clause, it is, in my view, appropriate to avail to them as part of a range of solutions, this solution of a hybrid arbitration, inelegant as it may be. 12     Therefore, if either party were able to procure a straightforward ICC arbitration in Singapore, the condition would be satisfied as would be the case if either party were to procure a hybrid arbitration administered by any other arbitral institution in Singapore.",
        "Condition for security for costs to be furnished": "13     HKL had sought the provision of security for the entire sum claimed. I note that the court has an unfettered discretion to impose terms and conditions upon granting a stay of proceedings in favour of arbitration under s 6(2) of the International Arbitration Act (Cap 143A, 2002 Rev Ed), although this discretionary power has to be exercised judiciously (seeThe “Duden”[2008] 4 SLR(R) 984 at [12] to [16]). 14     In the exercise of my discretion, I saw it fit to impose a condition for Rizq Singapore to furnish security for costs leading up to the arbitration. I was persuaded to impose this condition by what HKL characterises as the dubious financial circumstances of Rizq Singapore. Notably, Rizq Singapore’s registered address is the address of a shopping mall in which Rizq Singapore has no physical presence. Rizq Singapore’s other address stated in its letterhead turned out to be the address of a laundromat. 15     I was concerned that staying the proceedings in favour of arbitration could lead to the expenditure of costs by HKL which it could not recover even if it succeeded. In the circumstances, I imposed the condition for Rizq Singapore to furnish security for costs for the period leading up to the arbitration quantified at $25,000.",
        "The costs order": "16     Rizq Singapore having succeeded in obtaining a stay of proceedings, sought costs. HKL resisted on the ground that the arbitration clause being pathological made it difficult for it to pursue arbitration even if it had wanted to. I accepted the argument of HKL. In my view, HKL could not be faulted for not pursuing arbitration at the outset as the absence of a reference to any arbitral institution made it impossible for HKL to know which arbitral institution to approach. Having initiated these proceedings, HKL could not be entirely faulted for choosing to stay the course by resisting the stay application. 17     For these reasons, I make no order as to costs."
    }
}