{
    "case_title": "SKK (S) Pte Ltd\n      v\n      Management Corporation Strata Title Plan No 1166",
    "ncitation": "[2013] SGHCR 11",
    "coram": "Elaine Liew AR",
    "sections": {
        "Introduction": "1       The proceedings in Notice of Appointment for Assessment of Damages No 39 of 2012 (“the assessment proceedings”) were conducted pursuant to the order of the High Court inSKK (S) Pte Ltd v Management Corporation Srata Title Plan No 1166[2011] SGHC 215 (“theSKKdecision”).",
        "Background facts": "2       SKK (S) Pte Ltd (“the Plaintiff”) was engaged by the Management Corporation of Strata Title Plan No 1166 (“the Defendant”) to supply paint and to carry out repair and repainting works (“the works”) at the Mandarin Gardens Condominium (“the Estate”) (generally, “the Mandarin Gardens project”). The Plaintiff commenced Suit No 1022 of 2009 (“S 1022”) to claim for,inter alia, prolongation costs due to the delay in the works caused by the Defendant. 3       The findings of the trial Judge, Justice Lai Siu Chiu, in theSKKdecision which are pertinent to the assessment proceedings are reproduced below: 99    Szetho (PW4) was the plaintiff’s other expert witness who testified on the issue of the plaintiff’s claim for prolongation costs due to the delay in approval of repairs lists by the defendant. … 100    Szetho assessed thatthe plaintiff’s work had been delayed by 46 days (6.42 weeks) at which time it had completed 57% of the work and needed another 13 weeks to complete the balance 43%.Added to the delay of 46 days/6.42 weeks, that meant thatthe plaintiff’s claim for extension of time totalled 19.42 weeks. … 144    It follows from my earlier finding (that the plaintiff was entitled to an extension of time for completion), thatthe plaintiff was consequentially entitled to prolongation costs (based on Szetho’s computation) for the defendant’s delay in approving the repair lists.… … 155    The plaintiff is awarded interlocutory judgment with damages to be assessed by the Registrar for the claim for prolongation costs. The costs of such assessment with interest thereon are reserved to the Registrar. [emphasis added]",
        "The issues arising from the assessment proceedings": "",
        "Outline of parties’ submissions": "4       According to counsel for the Plaintiff, Ms Sunita Parhar (“Ms Parhar”), the premise of the Plaintiff’s case for the assessment proceedings was a fairly simple one,viz, loss and expenses of the various heads of claim were to be computed with reference to 19.42 weeks. 5       The Plaintiff also drew the Court’s attention to the fact that it had subcontracted the works to ACS Amview Contract Services Pte Ltd (“ACS Amview”) on a back-to-back basis. Thus, the bulk of the documents evidencing loss and expenses were those of ACS Amview. 6       Counsel for the Defendant, Mr Tan Liam Beng (“Mr Tan”), challenged the Plaintiff’s claim for prolongation costs on multiple fronts by disputing causation and loss,ie, elements integral to a claim for damages (“the preliminary contentions”): (a)     The Plaintiff suffered no loss as loss and expenses (if any) were borne by ACS Amview under the subcontract; (b)     Despite the back-to-back nature of the subcontract, ACS Amview was not entitled to a corresponding right for an extension of time, thereby precluding it from claiming prolongation costs as: (i)       ACS Amview had not complied with the contractual requirement to put in a written notification for an extension of time to the Plaintiff (see [16] below); and (ii)       The “pay when paid” provision in the subcontract was unenforceable by virtue of s 9 of the Building and Construction Industry Security of Payment Act (Cap 30B, 2006 Rev Ed) (“SOPA”) (see [21] below); (c)     Even if ACS Amview was entitled to claim for prolongation costs, it was only entitled to loss and expenses incurred during the 6.42 week time frame (see [25] below); and (d)     In any event, ACS Amview had not proven its loss. 7       In response, Ms Parhar urged this Court to disregard the preliminary contentions on the ground that they pertained to issues of liability which had been determined by Lai J and affirmed by the Court of Appeal in Civil Appeal No 129 of 2011 (“CA 129”) (collectively, “the two courts”). Further, she argued that the preliminary contentions were essentially a rehash of the Defendant’s submissions which had been placed before the two courts. 8       Given its position that the Defendant was precluded from re-opening these issues by virtue ofres judicata, the Plaintiff did not address the merits of the preliminary contentions. Whether the Defendant’s preliminary contentions are barred by res judicata 9       Although the Plaintiff had not specifically identified whether the preliminary contentions were caught by cause of action estoppel, issue estoppel or abuse of process,ie, the three distinct principles which come under the umbrella of the doctrine ofres judicata(seeGoh Nellie v Goh Lian Teck and others[2007] 1 SLR(R) 453 (“Goh Nellie”)), I am of the view that Ms Parhar’s objection grounded in the doctrine ofres judicatais misplaced. 10     The bulk of the preliminary issues (see [6] above) did overlap substantially with those advanced before the two courts. However, I note that theSKKdecision made no mention or reference to ACS Amview and CA 129 was dismissed in its entirety. In this respect, I do not think that the mere submissions by the Defendant and/or the passive or non-treatmentper seof these issues by Lai J and in CA 129 suggest that they areres judicatain the sense that the two courts had conclusively dealt with these issues and “[left] nothing else to be judicially determined” (at [28] ofGoh Nellie). This is not to suggest that every issue raised by parties, material or otherwise, needs to be expressly accepted or rejected by the court before one can invoke the doctrine ofres judicata. Instead, one should determine “whether the decision in question is a final and conclusive judgment on the merits [which in turn] may be ascertained from the intention of the judge as gathered from the relevant documents filed, the order made and the notes of any evidence taken or arguments made” (at [28] ofGoh Nellie). 11     It would be useful to reiterate the litigation history of S 1022 leading up to the assessment proceedings at this juncture. Insofar as the Plaintiff’s claim for prolongation costs is concerned, the SKKdecision touched only on the issue of liability as the interlocutory nature of the judgment (at [155] of theSKKdecision) meant that “the only question determine[d] by the [order was] the fixing of liability”, see The Duke of Buccleuch[1892] P 201 at 208 (cited with approval by the Court of Appealin Ling Kee Ling and another v Leow Leng Siong and others[1995] 2 SLR(R) 36). By way of extension, only the issue of liability vis-à-visthe claim for prolongation costs was before the Court of Appeal in CA 129. 12     Set against this backdrop where questions of liability and quantum are to be determined by different forums, one will appreciate that the issues and evidence which may be of relevance to the court determining liability may not be so to the court determining quantum of damages andvice versa. A critical analysis of the issues raised in the preliminary contentions would show that they pertained to matters which fall squarely within the parameters of the assessment proceedings and would not have had much bearing, if any, on the determination of liability between the Plaintiff and the Defendant. To illustrate, the issue of ACS Amview’s entitlement to claim prolongation costs against the Plaintiff under the subcontract (see item (b) of [6] above) would not have been relevant to S 1022 which was primarily concerned with the rights and obligations stemming from the main contract between the Plaintiff and the Defendant. 13     Indeed, the issue of ACS Amview’s entitlement is crucial in ascertaining whether the Plaintiff had suffered “loss” for the purposes of the assessment proceedings. In my view, the Plaintiff’s contractual liability to pay or compensate ACS Amview during the prolongation period can be characterised as a form of loss caused by the Defendant’s delay in approving the repair lists,ie, one that falls under the first limb ofHadley v Baxendale(1854) 9 Exch 341. By the same logic, if – for whatever reason – ACS Amview is not entitled to claim for prolongation costs against the Plaintiff, then correspondingly there will be no loss suffered by the Plaintiff which the Defendant should be made to compensate. 14     The characterisation of the Plaintiff’s liability to compensate ACS Amview’s during the prolongation period as a form of loss suffered by the Plaintiff is not altogether controversial. In Keith Pickavance,Delay and Disruption in Construction Contracts, 4thEd, Sweet & Maxwell (“Delay and Disruption in Construction Contracts”) at paras 21-009 and 21-012, it was envisaged that where the work on site is not carried out by the contractor but by the subcontractors, the contractor may prove its case against the employer,including the amount of damages incurred, by relying on information provided by the subcontractors. 15     Given the above, I am of the view that the preliminary contentions fall within the scope of determination of the assessment proceedings and are not barred byres judicatagiven that theSKKdecision and CA 129 made no judicial determination on them. ACS Amview’s entitlement to claim for prolongation costs against the Plaintiff (1)   Whether the subcontract mandated a written notification for an extension of time 16     Mr Tan argued that ACS Amview was precluded from claiming for prolongation costs against the Plaintiff due to its non-compliance with cl 23(2) of the Singapore Institute of Architects’ Articles and Conditions of Building Contract (“the SIA conditions”) which allegedly mandated a notification in writing for an extension of time by ACS Amview to the Plaintiff. 17     Clause 23(2) of the SIA conditions stipulates: It shall be a condition precedent to an extension of time by the Architect under any provision of this Contract including the present clause (unless the Architect has already informed the Contractor of his willingness to grant an extension of time) thatthe Contractor shall within 28 days notify the Architect in writing of any event or direction or instruction which he considers entitles him to an extension of time, together with a sufficient explanation of the reasons why delay to completion will result.Upon receipt of such notification the Architect, within one month of a request to do so by the Contractor specifically mentioning this sub-clause, shall inform the Contractor whether or not he considers the event or instruction or direction in principle entitles the Contractor to an extension of time. [emphasis added] 18     It is common ground that the main contract is subject to the SIA conditions, see [9] of theSKKdecision. The salient clauses of the document comprising the subcontract,viz, the Details of Contract, Sub-Contract No P/08/008/RO (“the Details of Contract”), which purportedly incorporated the terms of the main contract are reproduced below: … 2All Main Contract Tender and Contract Documents, Correspondences and this Details of Contract will form part of this Contract.[ACS Amview is] deemed to have fully understood the Main Contract Requirement and carried out the work in full compliance with the Main Contract Requirement and Conditions.For the avoidance of doubt, the term Main Contractor or Nominated Subcontractor (stated in the Main Contract) shall be deem(ed) to be [ACS Amview] … Terms and Conditions are per Articles of Contract dated 18thDecember 2006 and Main Contract. … [emphasis added] Mr Tan submitted that by virtue of the terms above, cl 23(2) of the SIA conditions was imported into the subcontract thereby mandating ACS Amview to put in a written notification for an extension of time to the Plaintiff. 19     I disagree with this line of argument for the reasons below: (a)     As rightly observed in Chow Kok Fong,Law and Practice of Construction Contracts, 4thEd, Sweet & Maxwell (“Law and Practice of Construction Contracts”), Vol 2 at para 15.32, “[t]heoperative termsof the contract between the main contractor and the subcontractorremain those actually agreed by the parties” [emphasis added]. Save for the purported wholesale incorporation of the SIA conditions into the subcontract, there is nothing before me which suggests that the Plaintiff and ACS Amview had agreed, expressly or otherwise, to put in place between them a mechanism similar, if not identical, to cl 23(2); and (b)     Even taking Mr Tan’s case at its best, the entity to which ACS Amview has to submit a written notification is theArchitectand not thePlaintiff. This runs contrary to the Defendant’s own case. 20     In the light of the above, I find that (a) cl 23(2) of the SIA conditions is not incorporated into the subcontract; and (b) there is nothing in the subcontract which stipulates for a written notification to be submitted by ACS Amview to the Plaintiff for the purposes of claiming prolongation costs. (2)   The “pay when paid” provision in the Details of Contract 21     In disputing ACS Amview’s entitlement to claim for prolongation costs against the Plaintiff, Mr Tan further contended that the Details of Contract contained a “pay when paid” provision which was unenforceable by virtue of s 9 of SOPA. The relevant term in the Details of Contract states: [ACS Amview] will be paid within 14 days after receipt of payment by [the Plaintiff] from the Main Contract. 22     Section 9 of SOPA reads: Effect of “pay when paid provisions” 9.—(1)  A pay when paid provision of a contract is unenforceable and has no effect in relation to any payment for construction work carried out or undertaken to be carried out, or for goods or services supplied or undertaken to be supplied, under the contract. (2)    In this section — … “pay when paid provision”, in relation to a contract, means a provision of the contract by whatever name called — (a)    that makes the liability of one party (referred to in this definition as the first party) to pay money owing to another party (referred to in this definition as the second party) contingent or conditional on payment to the first party by a further party (referred to in this definition as the third party) of the whole or any part of that money; (b)    that makes the due date for payment of money owing by the first party to the second party contingent or conditional on the date on which payment of the whole or any part of that money is made to the first party by the third party; (c)    that otherwise makes the liability to pay money owing, or the due date for payment of money owing, contingent or conditional on the operation of any other contract or agreement; or (d)    that is of such kind as may be prescribed. 23     On a plain reading, the relevant term is in substance a “pay when paid” provision caught by s 9 of SOPA. Although Mr Tan is correct on this point, with respect, I do not think that it aids in advancing the Defendant’s case in the assessment proceedings. In my judgment, s 9 of SOPA renders void and unenforceablepayment structureswhich are of “pay when paid” nature but does not absolve a party of itspayment obligationsowed to the other. In fact, s 9 of SOPA was designed topreventtheavoidance of payment obligationsby contractors who took advantage of the imbalance inherent in the “pay when paid” provisions by withholding payments to subcontractors for reasons unrelated to the latters’ performance, seeSingapore Parliamentary Debates, Official Report(16 November 2004) vol 78, col 1116. Thus, although the payment structure contained in the Details of Contract is unenforceable at law, the Plaintiff remains contractually liable to compensate ACS Amview for its loss and expenses incurred during the prolongation period. 24     Having addressed the Defendant’s preliminary contentions, I now turn to the assessment proper.",
        "The assessment": "",
        "The relevant time frame for assessment": "The preliminary determination 25     At the hearing on 27 August 2012, Mr Tan sought leave for the Court to make a preliminary determination on the time frame of the Plaintiff’s claim for prolongation costs. The relevant period according to Ms Parhar was 19.42 weeks, whereas Mr Tan took the view that it was for a shorter duration of 6.42 weeks. As seen from [3] above, the figures of 6.42 and 19.42 weeks were derived from the expert opinion of Mr Szetho at the trial which was accepted by Lai J. 26     Based on theSKKdecision, read together with the papers filed in CA 129, I made the preliminary determination that the period of prolongation for the Plaintiff’s claim was pegged to 19.42 weeks. This was upheld on appeal in Registrar’s Appeal No 365 of 2012 on 4 October 2012 (“RA 365”). 27     According to the Plaintiff, the time frame of 19.42 weeks had consistently been held to be correct for the purposes of assessment by four courts to date. The Plaintiff was critical of the Defendant’s stance that the assessment should be referenced to 6.42 weeks and described its persistence as a “continued and repeated disregard for the finding of this Court”.[note: 1] 28     It is correct that I had made the preliminary ruling that the time frame for the Plaintiff’s prolongation costs was 19.42 weeks. Nonetheless, I am of the view that the opinion of the Defendant’s expert witness, Mr Christopher Nunns (“Mr Nunns”), on the issue of time framewith regard to the respective heads of claimshould not be summarily dismissed without it being afforded an opportunity for proper study. The opinion of the Defendant’s expert 29     Mr Nunns filed two affidavits of evidence-in-chief (“AEIC”) for the assessment proceedings: (a)His AEIC filed on 17 August 2012 which contained his Report on Prolongation Costs (“the first report); and(b)His AEIC filed on 29 October 2012 which contained his Supplementary Report on Prolongation Costs (“the second report”).30     In his first and second reports, Mr Nunns opined that the correct period for the assessment of the various heads of claim was 6.42 weeks. This was premised on his view that the period of 19.42 weeks ought to be apportioned into two parts,ie¸6.42 weeks for the period of actual delay and 13 weeks for the period of deferred works. This, in my view, is consistent with Mr Szetho’s computation as summarised at [100] of theSKKdecision:Szetho assessed that the plaintiff’s work had beendelayed by 46 days (6.42 weeks)at which time it had completed 57% of the work andneeded another 13 weeks to complete the balance 43%. Added to the delay of 46 days/6.42 weeks, that meant that the plaintiff’s claim for extension of time totalled 19.42 weeks. [emphasis added]31     During the assessment proceedings, Mr Nunns sought to reconcile his computation (which was referenced to 6.42 weeks) with the preliminary determination and explain the flaw in the Plaintiff’s premise:[note: 2]Ct:Point of clarification from you, Mr Nunns. Your position is that for the 6.42 weeks [of actual delay], the respective average weekly rate(s) in your table [for the various heads of claim] will apply?A:Correct.Q:The same rate will not apply if it is for the rest of the period of 19.42 weeks?A:It is not the same for the remaining 13 weeks as different rates would apply if the Plaintiff have claimed them. They have claimed the same rate throughout the period. There is nothing in the judgment which says that the rate is the same throughout the 19.42 week period. That is to be assessed and that is what I am trying to do.…Q:So your position is that it should be 6.42 weeks?A:19.42 weeks. ... No direct mathematical formula between time and cost. Can’t say that you will have proportionately greater loss just because of delay.…A:Simple example to illustrate, complete suspension of work on site for 3 months and for 1stmonth, all resources and people were still waiting. All there on site and the loss during the 1stmonth will be calculated in one way, and then there was a team mobilisation as there was no resolution, the second two months will have different calculations - you won’t look at all 3 months in the same way. Quite justifiable for [Mr Szetho] to have broken it down into two portions.Delay and prolongation32     The terms “delay” and “prolongation” are oftentimes used interchangeably. It is thus apposite to differentiate between the two, as far as possible, to avoid semantic confusion.33     As noted at para 1-033 ofDelay and Disruption in Construction Contracts, the term “delay” connotes at least 23 different meanings to those who are in the construction and engineering industry. For instance, the 6.42 week “delay” in the Defendant’s approval of the repair lists pertained to “a critical shift in timing of the start of a discrete activity” but was not “delay” in the sense that it was “an increase in the duration of a discrete activity”.34     Prolongation, on the other hand, refers to the extended period in which a contractor has to expend his time-related costs due to the continuing effects of a delay to progress caused by the employer, see para 18-104 ofDelay and Disruption in Construction Contracts. Simply put, prolongation is the knock-on effect of the delay to progress,Laburnum Construction Corp v United States(1963) 163 Ct. Cl. 339, F.2d 451 (“Laburnum Construction Corp”).35     The interplay between the concepts of “delay” and “prolongation” for the purposes of assessment is helpfully summarised inLaburnum Construction Corpwhere it was held that compensation for prolongation must be calculated by reference to the actual period of delay to progress. This way, the compensation claimed is related to the costs actually incurred by the contractor as a result of the employer’s default. This is consistent with the position in Singapore, albeit in the narrower context of head office overheads, as alluded to inLaw and Practice of Construction Contracts, Vol 1 at para 10.117 and accords with the general principles governing the recovery of damages.36     As a matter of causation, there is much force in Mr Nunns’ analysis in distinguishing the two periods, namely, the period ofactual delay(ie, 6.42 weeks) and the period ofdeferred works(ie, 13 weeks) as it brings into focus the following:(a)ACS Amview would have taken 13 weeks to complete the works even absent the delay; and(b)There is no allegation on the part of the Plaintiff/ACS Amview thatadditionalcosts and expense were incurred during the 13 week period.It therefore becomes clear that the costs and expenses incurred by ACS Amview during the deferred works period (ie, 13 weeks) would have had to be incurred in any event, even without the occurrence of the delay, see para 18-113 ofDelay and Disruption in Construction Contracts.To award the Plaintiff/ACS Amview an additional sum for what it was supposed to have performed under the existing subcontract,ie, the works, would result in it gaining a windfall.37     Bearing in mind the principles applicable to a claim for prolongation costs as illustrated above, I am of the view that the period for the assessment of the respective heads of claim is 6.42 weeks. This finding is not inconsistent with the preliminary determination of 19.42 weeks made on 27 August 2012 (which was affirmed in RA 365). Insofar as theSKKdecision determined that the Plaintiff’s claim for prolongation costs is as per Mr Szetho’s computation, it is correct to say that Mr Szetho had computed the prolongation period to be 19.42 weeks. However, as shown at [34]-[36] above, thecomputedprolongation period itself cannot be equated with therecoverableprolongation period (for loss and expenses incurred), as the latter hinges on the period of delay and is subject to proof.38     For completeness, I would add that there is no prejudice to either party consequent to this finding. The Plaintiff’s computation is based on a linear approach,ie, by multiplying the average weekly rates by 19.42 weeks. In the event this Court decides to adopt its average weekly rates, the individual heads of claim can easily be computed with reference to 6.42 weeks. As for the Defendant, it is its case that each head of claim be referenced to the 6.42 week time frame.The heads of claim39     The Plaintiff’s expert witness, Mr Lee Cheng Sung (“Mr Lee”), had originally computed the Plaintiff’s prolongation costs to be in the sum of $627,543.60 in his AEIC filed on 7 June 2012. This figure, however, was revised downwards to $317,318.89 (see Annex A to the Plaintiff’s written submissions filed on 21 January 2013). Mr Nunns, on the other hand, computed the Plaintiff’s claim for prolongation costs to be $77,526.15 in his first report.Costs of on-site supervisors and drivers40     The Plaintiff claimed for three on-site supervisors (for safety, spalling and painting purposes respectively) and also for two drivers. According to Mr Tan Puay Ann (“Mr Peter Tan”), managing director of ACS Amview, the supervisors and drivers were engaged for the Mandarin Gardens project on a full time basis. The payment vouchers issued to the supervisors and the drivers were exhibited to support these claims.[note: 3]41     The Defendant disputed the costs of the three supervisors and the two drivers on the following grounds:(a)     The daily site records prepared by Mr Neo Poh Low (“Mr Neo”), the Plaintiff’s project and sales manager at the relevant time, did not record the attendance of ACS Amview’s three supervisors and two drivers;(b)     The payment vouchers did not appear to have been generated contemporaneously with the time of payment. In other words, the payment vouchers were fabricated; and(c)     Since ACS Amview had other ongoing projects at the material time, the supervisors and the drivers might have been assigned to these other projects.(1)   Daily site records42     According to Mr Neo, the daily site records were prepared for his own consumption to trace the progress of works at the Estate and for him to account to the Defendant and/or residents of the Estate in the event of complaints made in respect of the works.[note: 4]He also explained that the number of workers recorded in the daily site records was based on supervisors’ input given to him on each morning.[note: 5]Mr Neo conceded that the number of workers recorded in his daily site records might be inaccurate given that the number fluctuated quite frequently, even within the same day itself.[note: 6]43     Despite the above, Mr Neo was confident that ACS Amview had three on-site supervisors and two drivers present at the site at the material time. He explained that they were not recorded under specific/separate entries in his daily site records because he treated them as “workers” and therefore lumped their numbers under the generic term:[note: 7]Q:How many site supervisors were there on site?A:One safety supervisor, two supervisors – one is attached with structural repair, spalling all those, one is more on painting, so total of three site supervisors.Q:Why are supervisors not reflected in your report?A:Because supervisors are working site-wide. They are moving around. I take it like workers, lumped together in the total manpower. For me, myself not reflected in the daily records.…Q:Are you aware whether there were any drivers?A:Yes. From [ACS Amview], workers transported to site by two lorries, two drivers who send them there in the morning and send them back after work. Lorries are stationed at the site also help transport material because the size of the estate is very big…more than 1000 units. So they need the transport to transfer painting materials, shift gondolas from block to block. …. Helping on and off, collect [the Plaintiff’s] factory paint, buy materials needed at site.…A:…Drivers for me they are workers, they are multitasking, they help everything out. They don’t even just do arrival thing.44     Although Mr Neo was firm in his stance, he conceded that his recollection of events might be inaccurate due to the passage of time. For instance, although he had initially indicated that he did not record his own presence in the daily site records, Mr Tan pointed him to entries where he did so.[note: 8](2)   Payment vouchers45     As alluded to at [41] above, Mr Tan disputed the authenticity of the payment vouchers produced by ACS Amview. The exchange below took place during cross examination of Mr Peter Tan:[note: 9]Q:Every payment is in the end of the month … you will see the signature of Elsie [ie, ACS Amview’s accounts officer], all signed at about the same spot. Same for Mr Govindasamy [ie, ACS Amview’s supervisor]. Come to the next set, Mr Adaickalam’s [ie, ACS Amview’s supervisor], you will see that Elsie signed all on the same spot just after her name……… My question to you is that these payment vouchers appear – from the way it is signed that it is not contemporaneously signed by [the] person at the end of every month……Q:Put it to you: these payment vouchers were not issued contemporaneously, or at the time at the end of every month as reflected here.…Q:Suggest: all these vouchers were put up after the event at one go instead of being signed contemporaneously at the end of every month reflected there. Agree or disagree?A:Don’t agree.Q:If you look at the payment vouchers of Mr Manickam and Viswa [ie, ACS Amview’s drivers], there is nothing on “Account”. Suggest to you that [ACS Amview] after knowing that [the Plaintiff] will be making prolongation claim, you issued whatever payment voucher and put in the word “Mandarin Gardens” to give the impression that the supervisors were all working there.A:Disagree.Q:Put it to you that if you look at the records of Mr Neo [ie, the daily site records], where there is no records of supervisors, safety supervisor, spalling supervisor and lorry driver, you recreated these payment vouchers and all these suggest that your workers which are now claiming in this hearing were not deployed at the Mandarin Gardens project.A:Disagree.(3)   Evaluation of evidence46     At the assessment hearing, Mr Lee expressed his preference for payment vouchers to daily site records for the purposes of ascertaining loss and expenses. He found the daily site records to be less reliable and stated that in his experience, they usually document only the number of workers present without specific references to their designations such as “supervisors”.[note: 10]47     On this note, I agree with Mr Lee’s observation that the reliability of the contents of the daily site records should be viewed with a certain degree of circumspect and thus should not be assigned too much evidential weight. As made clear by Mr Neo at the outset, the daily site records were not designed to document with high accuracy the number and type of workers present at site on one given day. I accept Mr Neo’s explanation that he had subsumed the number of supervisors and drivers employed by ACS Amview under the category for “workers”, as he perceived them to be working site-wide and taking on multiple roles. The multi-tasking nature of the job scopes of the supervisors and drivers was corroborated by Mr Lee and Mr Peter Tan.48     In respect of the Defendant’s assertion that the supervisors and drivers had been assigned to ACS Amview’s other projects during the prolongation period, I note that it is not denied that ACS Amview had other ongoing projects at the material time.[note: 11]I find Mr Lee’s testimony below pertinent as it highlighted the working climate at the Estate in which ACS Amview had to operate during the prolongation period:[note: 12]Q:You are assuming on face value that these supervisors are there because Mr [Peter Tan] told you so.A:Partly informed by him and partly based on my experience and judgment.It is not that there is no work at all at the site, work has slowed down. He would still be putting his people there. It is not like it is on a total standstill.[emphasis added]As there was no complete standstill at the Estate, with work still ongoing (albeit on a slower pace) during the prolongation period, I do not think that the Defendant had shown, on balance, that these workers had been deployed at ACS Amview’s other project sites at the material time.49     As for the Defendant’s contention that the payment vouchers were fabricated, Mr Tan was invited to substantiate this allegation by obtaining the opinion of a handwriting expert. This, however, was not done and Mr Tan sought to persuade this Court to infer from the manner the signatures were appended on the payment vouchers to draw the conclusion that these documents were generated after the event.50     An allegation of fabrication of evidence is a serious one. As noted by the Court of Appeal inTang Yoke Kheng (trading as Niklex Supply Co) v Lek Benedict and others[2005] 3 SLR(R) 263 at [14]:[T]he standard of proof in a civil case, including cases where fraud is alleged, is that based on a balance of probabilities; butthe more serious the allegation, the more the party, on whose shoulders the burden of proof falls, may have to do if he hopes to establish his case.[emphasis added]Thus, in alleging that ACS Amview was guilty of forging documents, the Defendant bears the onus of adducing cogent evidence to meet the standard of proof. However, as mentioned above, the Defendant did no more than to appeal to the Court to draw an inference against ACS Amview. Further, in spite of the gravity of its allegation, the Defendant did not see it fit to seek production of the originals of the payment vouchers prior to the assessment proceedings. In fact, the request for originals was made rather belatedly during the hearing itself.51     A related point raised by Ms Parhar was that although the Defendant had engaged a clerk of works, it had curiously chose not to call him as witness, despite his attendance at the Estate at the material time. No explanation was given as to why the clerk of works was omitted from the Defendant’s witness list.52     Based on the totality of evidence, I am of the view that the claim for the three supervisors and the two drivers is established. I will adopt the weekly rates provided by the Plaintiff’s expert and award a global sum of $12,192.18 for the three supervisors and $3,792.70 for the two drivers.Foreign workers levy and accommodation for the supervisors and drivers53     The Plaintiff in Annex A to its written submissions filed on 21 January 2013 also included (a) foreign workers levy, and (b) worker’s accommodation as part of its claim for “Costs of Site Staff”,ie, the supervisors and drivers (“levy and accommodation costs”). Given that Mr Lee had, on affidavit and during the assessment hearing,[note: 13]confirmed that he was instructed to drop the claims for levy and accommodation costs, I sought clarification from the Plaintiff by way of letter to parties dated 8 April 2013.54     Ms Parhar’s replies (both dated 9 April 2013) essentially sought to “clarify” that the Plaintiff was pursuing the levy and accommodation costsvis-à-visthe supervisors and the drivers, and that it had abandoned the samevis-à-visgeneral workers. She also stated that the Court could take judicial notice of the levy and pointed out that the accommodation costs claimed was only $634.88. Mr Tan’s objection (in his letters dated 9 and 10 April 2013) was that the Defendant would be prejudiced should the Plaintiff be allowed its claims for levy and accommodation costs in respect of the supervisors and the drivers. This was due to the fact that the Plaintiff’s witnesses were not cross-examined on the same given Mr Lee’s s evidence that the Plaintiff was no longer pursuing these claims.55     The different versions of Mr Lee’s computations of the Plaintiff’s claim for prolongation costs can be found in:(a)His AEIC filed on 7 June 2012 (“first computation”);(b)His AEIC filed on 14 November 2012 (“second computation”); and(c)Annex A to the Plaintiff’s written submissions filed on 21 January 2013 (“third computation”).56     I note that it was only in the third computation that the levy and accommodation costs were included under the category “Costs of Site Staff”, with regard to the supervisors and the drivers. In the first computation, foreign workers levy and accommodation costs were claimed under a different heading,ie, “Costs of General Workers” which includedonlythe drivers but not the supervisors. This was then superseded by the second computation as the Plaintiff had instructed Mr Lee to abandon the levy and accommodation costs against,inter alia¸the drivers. The third computation only came about as part of the Plaintiff’s written submissionsafterthe assessment proceedings.57     Thus, as matters stood at the time of the assessment proceedings, there wasno claimfor levy and accommodation costsvis-à-visthe supervisors and the drivers. It is therefore inaccurate (and at the same time, curious) for the Plaintiff to assert that it was still pursuing these claims when it had never levelled such claimsvis-à-visthe supervisors, and had abandoned the same in respect of the drivers. In addition, given the circumstances, I do not think that it would be fair to allow the Plaintiff to “introduce” these additional heads of claim at this stage. I therefore disallow the levy and accommodation costs.Costs of gondolas58     The Plaintiff claimed for the costs of 16 gondolas over the period of 19.42 weeks and supported its claim using the invoices issued by Mega Engineering (S) Pte Ltd (“Mega Engineering”) to ACS Amview for the supply of gondolas.59     Although Mr Tan referred to an invoice dated 1 June 2009 issued by Mega Engineering which recorded a supply of 13 (as opposed to 16) gondolas to ACS Amview (“the 1 June 2009 invoice”), I note that the relevant period (ie, between 2 May 2009 and 1 June 2009) coincided with the date of completion of the works,ie, 8 May 2009 (at [145] of theSKKdecision). Apart from the 1 June 2009 invoice, all other invoices whichprecededthe completion date/month consistently recorded the supply of 16 gondolas. Therefore, I allow the Plaintiff’s claim for 16 gondolas over the period of 6.42 weeks in the sum of $37,038.78.Riggers on standby for the operation of the gondolas60     The Plaintiff initially claimed for a total of six riggers for the operation of the gondolas. According to Mr Peter Tan, he had constantly insisted that a minimum of six workers be on standby as any number below that would not be enough to operate the 16 gondolas stationed at the Estate.[note: 14]61     This was, however, contradicted by Mr Neo’s daily site records which consistently recorded the presence of only three riggers at the Estate in the following manner:[note: 15]MEGA(ie, the supplier of the riggers) 3 technicians shifting gondolas at lobby N&M.[note: 16]62     Given the above, the Plaintiff conceded on this point at the assessment proceedings and revised its claim to three riggers instead.[note: 17]I also note that Mr Tan only disputed this head of claim in respect of the number of riggers claimed,viz, his position was that based on Mr Neo’s records, only three riggers should be allowed. As such, I allow $13,482 for the claim for three riggers.Licensed electrical worker and the gondola registration fee63     The Plaintiff also claimed for (a) the costs of engaging a licensed electrical worker; and (b) the gondola registration fee, which was described by the Plaintiff as a one off six-monthly fee for the safety endorsement of vertical work platform by a professional engineer.64     Mr Lee testified that it was a requirement by the relevant authority that the gondolas were periodically checked by a professional engineer and due to the prolongation, this had to be renewed. Mr Tan suggested that there should be a proportionate apportionment of these claims, given that the sixth-monthly period expired after the completion date of 8 May 2009. In this regard, Mr Lee pointed out that the fees for the six-month period had been paid upfront. Notably, Mr Tan did not challenge Mr Lee’s position any further.[note: 18]65     The invoice from Mega Engineering which reflected the costs of engaging a licensed electrical worker and of a professional engineer was dated 3 January 2009 (“the 3 January 2009 invoice”).[note: 19]This coincided with the period when the Plaintiff/ACS Amview became aware that they were behind schedule and the period for completion of the works had to be extended beyond December 2008, see Mr Szetho’s opinion that the works were originally scheduled to be completed by the end of December 2008.[note: 20]Further, only the 3 January 2009 invoice included these costs. Thus, I accept Mr Lee’s evidence that they had been incurred due to the Defendant’s delay and had been paid on an upfront basis.66     I allow $1849.44 for the costs to engage a professional engineer and $1849.38 for the costs to hire a licensed electrical worker.Additional premium for extension of performance bond and renewal of factory licence67     The Plaintiff also claimed for the additional premium paid for the extension of the performance bond and also for the costs of renewal of the factory licence due to the prolongation. As rightly pointed out by Mr Tan, no documentary proof was provided for these two heads of claim.68     Indeed, Mr Lee admitted that other than him being orally informed of these expenses, no documentary evidence of these items were given to him. Nevertheless, he testified that from his experience, these two items would have been incurred during the prolongation period:[note: 21]Q:… For (D) - premium of performance bond (“PB”) for six months. Have you got records to show that?A:That was [the Plaintiff’s] responsibility to pay the PB.Q:Did you ask for receipt of all these?A:No.Q:How do you know this has been incurred?A:Was told that this is incurred. I also know that PB is for fixed period, usually linked to the contract period, if the period is prolonged, PB has to be extended.…Q:You asked for the amount but you did not see it fit to ask for the invoice?A:Amount is not very huge, only $ 218. I know that such costs would be incurred. If need be, I can ask [the Plaintiff] to produce.Q:Factory licence?A:Same thing. Usually linked to contract period.(1)   Proof of claims through the invocation of judicial notice69     The Plaintiff in its reply submissions filed on 18 February 2013 urged the Court to take judicial notice that these two items had been incurred by the Plaintiff:(a)     Based on information relating to factory licences which was available on the website of the Ministry of Manpower (“MOM”), the Plaintiff submitted that the main contract between the Plaintiff and Defendant which was entered into prior to 28 February 2010 fell under the old regime where renewal of Certificate of Registration was required. As the works were originally scheduled to end on 5 December 2008 but was extended to 8 May 2009, the Plaintiff submitted that it can be inferred that it had to incur the requisite fees to renew its Certificate of Registration; and(b)     The Court can take judicial notice of the claim for the additional premium for the extension of the performance bond and highlighted that the sum claimed amounted “to only $758.43”.[note: 22]70     The Defendant did not directly address the Plaintiff’s submissions on the taking of judicial notice, though it maintained that these heads of claim should fail for want of proof.(2)   Whether judicial notice can bridge the evidential gap in proving payment of specified amount of fees71     It is trite that the Plaintiff bears both the legal and evidential burden in proving the expenses incurred for the renewal of the factory licence fees and for the extension of performance bond. In this regard, the Plaintiff chose to demonstrate proof of these two items through the invocation of judicial notice.72     As noted inHalsbury's Laws of Singaporevol 10 (LexisNexis, 2006 Reissue) at para 120.267:… Judicial notice dispenses with proof and may save a party on whom the burden of proof of the fact would otherwise lie from the consequences of failure or omissions to offer proof of that fact. … The reason for accepting proof by judicial notice is not so much that the fact is well known or that it is indisputable but that the nature of the fact is such that it has an objective existence independent of the complexion of any individual case (so that its character is general rather than particular) and its proof is readily available to the court itself. [footnotes omitted]73     It was held inPlaza Singapura (Pte) Ltd v Cosdel (S) Pte Ltd[1990] 2 SLR(R) 22 that the court should be cautious in invoking the doctrine of judicial notice. In ascertaining whether judicial notice ought to be taken of a fact, the court should carefully consider whether it is of unassailable character, bearing in mind that any doubt as to the public notoriety of any fact which is alleged to be judicially noticeable ought to be resolved against the party seeking to rely on that fact, seeZheng Yu Shan v Lian Beng Construction (1988) Pte Ltd[2009] 2 SLR(R) 587 at [83]–[84].74     With these considerations in mind, it is clear that the fact of extension of performance bond cannot be a matter of public notoriety which warrants the taking of judicial notice. The regulatory requirement by MOM, on the other hand, may arguably warrant the taking of judicial notice. However, it should be noted that thefact of renewal of factory licenceas required by MOM which may be proven by the taking of judicial notice is different from thefact of payment of a specified amount for the renewal of the licencewhich, in my view, may not be proven in the same manner.75     The Plaintiff’s claims for the sum paid for the extension of performance bond and the renewal of factory licence could have been easily substantiated by documentary proof. The relative ease of obtaining documentary evidence of these payments was alluded to by Mr Lee in the course of cross-examination (though I would highlight that no explanation was proffered as to why this was not done):[note: 23]Q:You asked for the amount but you did not see it fit to ask for the invoice?A:Amount is not very huge, only $ 218. I know that such costs would be incurred.If need be, I can ask [the Plaintiff] to produce.[emphasis added]76     I also do not agree with the Plaintiff’s position that the court should nonetheless allow these claims as they were of relatively small sum. A smaller sum claimed is no excuse to having a lax attitude towards proof – the onus remains on the Plaintiff to prove these heads of claims on a balance of probability. As the Plaintiff has failed to discharge its burden, I disallow these claims.Head office overheads(1)   The Plaintiff’s methodology in assessing head office overheads77     Mr Lee relied on the Emden’s formula to compute the head office overheads of ACS Amview. The Defendant’s main objections to this were twofold:(a)     As ACS Amview was a small set up, Mr Lee could have computed the head office overheads based on first principles with reference to its actual costs and expenses, without having to resort to using the Emden’s formula;[note: 24]and(b)     The information applied to the Emden’s formula was flawed as it was based on only one year’s worth of accounts.78     Mr Lee explained that the Emden’s formula was preferred to the Eichleay or Hudson’s formulae (viz, the two other formulae widely used for computing head office overheads) in this case as it reflected more closely the calculated loss in the event of prolongation of a contract. He also highlighted the deficiencies of the other two formulae should they be applied to the present assessment proceedings.[note: 25]When asked whether he agreed with the Defendant’s proposition that an assessment of head office overheads should have been done based on “first principles” before one turns to one of the formulae, Mr Lee replied as follows:[note: 26]A:I think that even if it is done, it would be very controversial and it would not have any improvement over a formula method. A lot of work but taking a lot of assumptions as well. Not easy to get proper documentations although you know that there is costs incurred.79     On this issue, Mr Nunns conceded that it was common to use a formula to compute the head office overheads. He also accepted that the Emden’s formula is appropriate for the present assessment.[note: 27](2)   The use of formula and the issue of proof80     It is recognised that contractors find it convenient to advance a claim for profits and overheads based on the formulae proposed by writers of standard textbooks, see para 10.120 ofLaw and Practice of Construction Contracts, Vol 1. In principle, I see no objection to the use of the Emden’s formula (or Eichleay or Hudson’s, as may be appropriate) even to smaller organisations given the inherent difficulties associated with assessing head office overheads. Although each formula has its own conceptual limitations (see para 10.128 of theLaw and Practice of Construction Contracts, Vol 1), it is nonetheless the more economical and practical way of computing such claims.81     At this juncture, parties should be reminded that the formulae themselves do not constitute proof of loss, seePeak Construction (Liverpool) Ltd v McKinney Foundations Ltd(1970) 69 LGR 1. I would also add that parties seeking to assess head office overheads by using one of the formulae should be diligent in ensuring the accuracy and integrity of the data/information applied to the formula of choice. This, as I observed, was lacking on the part of the Plaintiff. During the assessment proceedings, it transpired that the Plaintiff did not ascertain whether the individual items (eg, insurance, legal and professional fee, interest and late payment,etc)[note: 28]which formed the constituent components of the Emden’s formula, were in fact related to the Mandarin Gardens project. This necessitated a round of verification with Mr Peter Tan on whether the specific items were directly attributable to the Mandarin Gardens project. Although the Plaintiff’s claim for head office overheads was subsequently revised to eliminate items which were not attributable to the Mandarin Gardens project (and therefore should not have been included in the Emden’s formula), the verification process could and should have been done prior to the assessment proceedings.(3)   Whether the Plaintiff has demonstrated proof82     In mounting a claim for head office overheads, the learned author ofLaw and Practice of Construction Contracts, Vol 1 at para 10.117 opined as follows:To sustain a claim for loss of profit or offsite overheads,a claimant contractor must firstly show that for the critical period of delay, market conditions in the construction industry were sufficiently favourable at the relevant point in time so that it is reasonable to expect that the resources which were tied up in the delayed project could have been deployed to enable him to recover his profit and head office overheads on such work as could be reasonably secured at the material time. The persuasiveness of this contention depends significantly on the contractor demonstrating thathe had reasonable prospects of securing such work. … in most cases, these claims arenormally canvassed on the basis that the amount claimed reflects the average profit and overheads contribution achieved in the claimant’s past projects.[emphasis added]83     From the above, one may deduce that ACS Amview needs to demonstrate that (a) there were reasonable prospects for it to be engaged in other project(s) but for the delay; and (b) such other project(s) may contribute to its profit and overheads. In demonstrating the latter, historical data evidencing the average profit and overheads contributions may be relied on by it.84     In my judgment, the Plaintiff has failed to overcome the hurdles in proving the claim for head office overheads. It has not shown that ACS Amview had reasonable prospects of taking up other projects at the material time. As admitted by Mr Lee, he did not ascertain with ACS Amview whether there were job offers made during the prolongation period.[note: 29]Further, there is insufficient proof in respect of the turnover yielded from ACS Amview’s other and/or past projects to reflect itsaverageprofit and overheads contribution. The limited information in this regard included only the following:(a)ACS Amview’s business size was in the region of eight to ten projects per year (for 2008 and 2009);[note: 30](b)The Mandarin Gardens project was its biggest project for 2008/2009;[note: 31]and(c)Its project income for the year ended September 2009 was $8,445,702.85     As pointed out by Mr Nunns, ACS Amview had only produced its audited accounts for the year ended September 2009 for the assessment proceedings. Notably, no reason was given as to why it had not provided its accounts for the preceding years. This is unsatisfactory as it provides a distorted snapshot of its financials. In this respect, I agree with Mr Nunns observations below:[note: 32]A:… If you do use formula [in calculating head office overheads], normal practice is that you use accounts and that involves looking at company records, not one year but three years. For such organizations, their accounts go up and down. There would be erratic turnover, and it is not correct to only use one year.86     In the light of the foregoing, I disallow the claim for ACS Amview’s head office overheads for want of proof.The 10% administrative costs incurred by the Plaintiff(1)   The grounds for claiming 10% administrative costs87     The Plaintiff advanced different grounds for its claim for 10% administrative costs. Mr Lee’s first response was the claim was derived from the “contract agreement between [the Plaintiff] and [ACS Amview]”,ie, the Details of Contract.[note: 33]The relevant term of the Details of Contract read:4    Forall subsequent authorized variation works, you are deemed to cover us [the Plaintiff] a10% profit and attendanceof the approved variation sum by the Main Contract.[emphasis added]88     Upon further questioning by Mr Tan, Mr Lee shifted his position and stated that the 10% administrative costs was based on instructions given by the Plaintiff and that it was “normal” in terms of a contractor’s overheads. In fact, he thought that the Plaintiff might be under-claiming since it was only asking for 10%.[note: 34]89     Ms Parhar also shed some light on the Plaintiff’s basis in claiming the 10% administrative costs in the course of cross-examining Mr Nunns:[note: 35]Q:You also said that the 10% claim, you disagree?A:That is my opinion.…Q:Mr Nunns, you are aware [the Plaintiff] is [the] main contractor and all site meetings and letters and communications about delay and prolongation were made by [the Plaintiff]?A:YesQ:Accept it would have taken up time?A:YesQ:Would that not be a loss?A:It would be a costs incurred, a loss, by [the Plaintiff].(2)   Whether the Defendant should bear the 10% administrative costs90     Two difficulties arise in respect of the Plaintiff’s claim for 10% administrative costs:(a)There does not appear to be anylegalbasis to the Plaintiff’s claim for “administrative costs”; and(b)It is unclear how the Plaintiff had arrived at the 10% figure.91     The initial position that the term in the Details of Contract (see [87] above) allowed for its claim for 10% administrative costs is untenable since the term “prolongation” does not square with “authorised variation work”. Even if it could be claimed as the Plaintiff’s overheads (which I make no finding given the paucity of evidence in this regard), there is nothing to support the 10% figure claimed.92     Further, the Plaintiff’s basis that the administrative costs were to cover its loss/costs for attending site meetings and putting in claims for extension of time on behalf of ACS Amview does not appear to be compensatoryvis-à-visthe Defendant. In this connection, it is arguable that an implied term exists between the Plaintiff and ACS Amview for the former to do the necessary to put in claims for an extension of time when required (seeFoo Jong Peng and others v Phua Kiah Mai and another[2012] 4 SLR 1267). Bearing in mind that the doctrine of privity of contract precludes ACS Amview from making a direct claim for an extension of time (and in turn prolongation costs) against the Defendant, ACS Amview would be left without recourse in the event of delay if such term is not implied into the subcontract.93     As I see is no legal basis for the Plaintiff to claim for 10% administrative costs, I disallow it.Conclusion94     For ease of reference, the table below is a summary of the amount allowed for the Plaintiff’s various heads of claims:s/nHeads of ClaimAmount allowed[note: 36]1Costs of three supervisors$ 12,192.182Costs of two drivers$ 3,792.703Foreign worker levy for the supervisors and driversNot allowed4Workers’ accommodation for the supervisors and driversNot allowed5Costs of 16 gondolas$ 37,038.806Three riggers for the operation of gondolas$ 13,482.007Safety endorsement of vertical work platform by Professional Engineer (6-monthly interval)$1,849.448Licensed electrical worker$1,849.389Additional premium for extension of performance bondNot allowed10Renewal of Factory LicenceNot allowed11Head office Administrative CostsNot allowed1210% Administrative costs claimed by the PlaintiffNot allowedTotal allowed$70,204.5095     I will hear parties on costs on a date to be fixed by Registry.[note: 1]Plaintiff’s reply submissions filed on 18 February 2013 at para 90.[note: 2]Notes of Evidence (“NE”), 20 November 2012, p 45 lines 15-22; p 46 lines 19-24; p 47 lines 21-27.[note: 3]Mr Lee’s AEIC filed on 7 June 2012 at pp26-36.[note: 4]NE, 20 November 2012, p 28 lines 20-24.[note: 5]Ibid, p 28 lines 28-31.[note: 6]Ibid, p 29 lines 15-22.[note: 7]Ibid, p 29 lines 109; p 29 lines 24-31; p 20 lines 1-2; p 35 lines 16-20.[note: 8]Ibid, p 32 lines 15-24.[note: 9]NE, 19 Nov 2012, p 47 lines 23-30; p 48 lines 8-11, lines 17-19 and lines 24-31; p 49 lines 1-10.[note: 10]Ibid, p 17, lines 23-27.[note: 11]Ibid, p 17 lines 12-15; p 40 lines 10-11.[note: 12]Ibid, p 17, lines 29-31; p 18 lines 1-3.[note: 13]Ibid, p 12 lines 31-32; p 13 lines 1-3 and lines17-19.[note: 14]NE, 20 November 2012, p 9 lines 23-29.[note: 15]Mr Szetho’s AEIC filed on 18 June 2011 at p 111.[note: 16]NE, 20 November 2012, p 31 lines 15-16.[note: 17]Ibid, p 32 lines 7-8.[note: 18]NE, 19 November 2012, p 19 lines 9-20.[note: 19]Mr Lee’s AEIC filed on 7 June 2012 at p 51.[note: 20]Mr Szetho’s AEIC filed on 18 June 2011 at para 3.[note: 21]NE, 19 November 2012, p 18 lines 12-22 and 27-32.[note: 22]Plaintiff’s reply submissions filed on 18 February 2013 at para 84.[note: 23]NE, 19 November 2012, p 18 lines 27-29.[note: 24]Ibid, p 26 lines 4-5.[note: 25]Ibid, p 28 lines 3-15.[note: 26]Ibid, p 29 lines 27-31; p 30 lines 1-5.[note: 27]NE, 20 November 2012, p 39 lines 6-15; p 41 lines 11-16.[note: 28]NE, 19 November 2012, p 25 lines 1-24.[note: 29]Ibid, p 26 lines 5-8.[note: 30]NE, 19 November 2012, p 38 lines 10-17.[note: 31]NE, 20 November 2012, p 16 lines 18-27.[note: 32]Ibid, p 39 lines 16-19.[note: 33]NE, 19 November 2012, p 4 at lines 14-21.[note: 34]Ibid, p 7 at lines 1-11.[note: 35]NE, 20 November 2012, p 41 lines 18-19, 30-32; p 42 lines 1-7.[note: 36]Based on the weekly rates provided by the Plaintiff’s expert with reference to the 6.42 week period.",
        "The heads of claim": "39     The Plaintiff’s expert witness, Mr Lee Cheng Sung (“Mr Lee”), had originally computed the Plaintiff’s prolongation costs to be in the sum of $627,543.60 in his AEIC filed on 7 June 2012. This figure, however, was revised downwards to $317,318.89 (see Annex A to the Plaintiff’s written submissions filed on 21 January 2013). Mr Nunns, on the other hand, computed the Plaintiff’s claim for prolongation costs to be $77,526.15 in his first report. Costs of on-site supervisors and drivers 40     The Plaintiff claimed for three on-site supervisors (for safety, spalling and painting purposes respectively) and also for two drivers. According to Mr Tan Puay Ann (“Mr Peter Tan”), managing director of ACS Amview, the supervisors and drivers were engaged for the Mandarin Gardens project on a full time basis. The payment vouchers issued to the supervisors and the drivers were exhibited to support these claims.[note: 3] 41     The Defendant disputed the costs of the three supervisors and the two drivers on the following grounds: (a)     The daily site records prepared by Mr Neo Poh Low (“Mr Neo”), the Plaintiff’s project and sales manager at the relevant time, did not record the attendance of ACS Amview’s three supervisors and two drivers; (b)     The payment vouchers did not appear to have been generated contemporaneously with the time of payment. In other words, the payment vouchers were fabricated; and (c)     Since ACS Amview had other ongoing projects at the material time, the supervisors and the drivers might have been assigned to these other projects. (1)   Daily site records 42     According to Mr Neo, the daily site records were prepared for his own consumption to trace the progress of works at the Estate and for him to account to the Defendant and/or residents of the Estate in the event of complaints made in respect of the works.[note: 4]He also explained that the number of workers recorded in the daily site records was based on supervisors’ input given to him on each morning.[note: 5]Mr Neo conceded that the number of workers recorded in his daily site records might be inaccurate given that the number fluctuated quite frequently, even within the same day itself.[note: 6] 43     Despite the above, Mr Neo was confident that ACS Amview had three on-site supervisors and two drivers present at the site at the material time. He explained that they were not recorded under specific/separate entries in his daily site records because he treated them as “workers” and therefore lumped their numbers under the generic term:[note: 7] Q:How many site supervisors were there on site? A:One safety supervisor, two supervisors – one is attached with structural repair, spalling all those, one is more on painting, so total of three site supervisors. Q:Why are supervisors not reflected in your report? A:Because supervisors are working site-wide. They are moving around. I take it like workers, lumped together in the total manpower. For me, myself not reflected in the daily records. … Q:Are you aware whether there were any drivers? A:Yes. From [ACS Amview], workers transported to site by two lorries, two drivers who send them there in the morning and send them back after work. Lorries are stationed at the site also help transport material because the size of the estate is very big…more than 1000 units. So they need the transport to transfer painting materials, shift gondolas from block to block. …. Helping on and off, collect [the Plaintiff’s] factory paint, buy materials needed at site. … A:…Drivers for me they are workers, they are multitasking, they help everything out. They don’t even just do arrival thing. 44     Although Mr Neo was firm in his stance, he conceded that his recollection of events might be inaccurate due to the passage of time. For instance, although he had initially indicated that he did not record his own presence in the daily site records, Mr Tan pointed him to entries where he did so.[note: 8] (2)   Payment vouchers 45     As alluded to at [41] above, Mr Tan disputed the authenticity of the payment vouchers produced by ACS Amview. The exchange below took place during cross examination of Mr Peter Tan:[note: 9] Q:Every payment is in the end of the month … you will see the signature of Elsie [ie, ACS Amview’s accounts officer], all signed at about the same spot. Same for Mr Govindasamy [ie, ACS Amview’s supervisor]. Come to the next set, Mr Adaickalam’s [ie, ACS Amview’s supervisor], you will see that Elsie signed all on the same spot just after her name… … … My question to you is that these payment vouchers appear – from the way it is signed that it is not contemporaneously signed by [the] person at the end of every month… … Q:Put it to you: these payment vouchers were not issued contemporaneously, or at the time at the end of every month as reflected here. … Q:Suggest: all these vouchers were put up after the event at one go instead of being signed contemporaneously at the end of every month reflected there. Agree or disagree? A:Don’t agree. Q:If you look at the payment vouchers of Mr Manickam and Viswa [ie, ACS Amview’s drivers], there is nothing on “Account”. Suggest to you that [ACS Amview] after knowing that [the Plaintiff] will be making prolongation claim, you issued whatever payment voucher and put in the word “Mandarin Gardens” to give the impression that the supervisors were all working there. A:Disagree. Q:Put it to you that if you look at the records of Mr Neo [ie, the daily site records], where there is no records of supervisors, safety supervisor, spalling supervisor and lorry driver, you recreated these payment vouchers and all these suggest that your workers which are now claiming in this hearing were not deployed at the Mandarin Gardens project. A:Disagree. (3)   Evaluation of evidence 46     At the assessment hearing, Mr Lee expressed his preference for payment vouchers to daily site records for the purposes of ascertaining loss and expenses. He found the daily site records to be less reliable and stated that in his experience, they usually document only the number of workers present without specific references to their designations such as “supervisors”.[note: 10] 47     On this note, I agree with Mr Lee’s observation that the reliability of the contents of the daily site records should be viewed with a certain degree of circumspect and thus should not be assigned too much evidential weight. As made clear by Mr Neo at the outset, the daily site records were not designed to document with high accuracy the number and type of workers present at site on one given day. I accept Mr Neo’s explanation that he had subsumed the number of supervisors and drivers employed by ACS Amview under the category for “workers”, as he perceived them to be working site-wide and taking on multiple roles. The multi-tasking nature of the job scopes of the supervisors and drivers was corroborated by Mr Lee and Mr Peter Tan. 48     In respect of the Defendant’s assertion that the supervisors and drivers had been assigned to ACS Amview’s other projects during the prolongation period, I note that it is not denied that ACS Amview had other ongoing projects at the material time.[note: 11]I find Mr Lee’s testimony below pertinent as it highlighted the working climate at the Estate in which ACS Amview had to operate during the prolongation period:[note: 12] Q:You are assuming on face value that these supervisors are there because Mr [Peter Tan] told you so. A:Partly informed by him and partly based on my experience and judgment.It is not that there is no work at all at the site, work has slowed down. He would still be putting his people there. It is not like it is on a total standstill. [emphasis added] As there was no complete standstill at the Estate, with work still ongoing (albeit on a slower pace) during the prolongation period, I do not think that the Defendant had shown, on balance, that these workers had been deployed at ACS Amview’s other project sites at the material time. 49     As for the Defendant’s contention that the payment vouchers were fabricated, Mr Tan was invited to substantiate this allegation by obtaining the opinion of a handwriting expert. This, however, was not done and Mr Tan sought to persuade this Court to infer from the manner the signatures were appended on the payment vouchers to draw the conclusion that these documents were generated after the event. 50     An allegation of fabrication of evidence is a serious one. As noted by the Court of Appeal inTang Yoke Kheng (trading as Niklex Supply Co) v Lek Benedict and others[2005] 3 SLR(R) 263 at [14]: [T]he standard of proof in a civil case, including cases where fraud is alleged, is that based on a balance of probabilities; butthe more serious the allegation, the more the party, on whose shoulders the burden of proof falls, may have to do if he hopes to establish his case. [emphasis added] Thus, in alleging that ACS Amview was guilty of forging documents, the Defendant bears the onus of adducing cogent evidence to meet the standard of proof. However, as mentioned above, the Defendant did no more than to appeal to the Court to draw an inference against ACS Amview. Further, in spite of the gravity of its allegation, the Defendant did not see it fit to seek production of the originals of the payment vouchers prior to the assessment proceedings. In fact, the request for originals was made rather belatedly during the hearing itself. 51     A related point raised by Ms Parhar was that although the Defendant had engaged a clerk of works, it had curiously chose not to call him as witness, despite his attendance at the Estate at the material time. No explanation was given as to why the clerk of works was omitted from the Defendant’s witness list. 52     Based on the totality of evidence, I am of the view that the claim for the three supervisors and the two drivers is established. I will adopt the weekly rates provided by the Plaintiff’s expert and award a global sum of $12,192.18 for the three supervisors and $3,792.70 for the two drivers. Foreign workers levy and accommodation for the supervisors and drivers 53     The Plaintiff in Annex A to its written submissions filed on 21 January 2013 also included (a) foreign workers levy, and (b) worker’s accommodation as part of its claim for “Costs of Site Staff”,ie, the supervisors and drivers (“levy and accommodation costs”). Given that Mr Lee had, on affidavit and during the assessment hearing,[note: 13]confirmed that he was instructed to drop the claims for levy and accommodation costs, I sought clarification from the Plaintiff by way of letter to parties dated 8 April 2013. 54     Ms Parhar’s replies (both dated 9 April 2013) essentially sought to “clarify” that the Plaintiff was pursuing the levy and accommodation costsvis-à-visthe supervisors and the drivers, and that it had abandoned the samevis-à-visgeneral workers. She also stated that the Court could take judicial notice of the levy and pointed out that the accommodation costs claimed was only $634.88. Mr Tan’s objection (in his letters dated 9 and 10 April 2013) was that the Defendant would be prejudiced should the Plaintiff be allowed its claims for levy and accommodation costs in respect of the supervisors and the drivers. This was due to the fact that the Plaintiff’s witnesses were not cross-examined on the same given Mr Lee’s s evidence that the Plaintiff was no longer pursuing these claims. 55     The different versions of Mr Lee’s computations of the Plaintiff’s claim for prolongation costs can be found in: (a)His AEIC filed on 7 June 2012 (“first computation”);(b)His AEIC filed on 14 November 2012 (“second computation”); and(c)Annex A to the Plaintiff’s written submissions filed on 21 January 2013 (“third computation”).56     I note that it was only in the third computation that the levy and accommodation costs were included under the category “Costs of Site Staff”, with regard to the supervisors and the drivers. In the first computation, foreign workers levy and accommodation costs were claimed under a different heading,ie, “Costs of General Workers” which includedonlythe drivers but not the supervisors. This was then superseded by the second computation as the Plaintiff had instructed Mr Lee to abandon the levy and accommodation costs against,inter alia¸the drivers. The third computation only came about as part of the Plaintiff’s written submissionsafterthe assessment proceedings.57     Thus, as matters stood at the time of the assessment proceedings, there wasno claimfor levy and accommodation costsvis-à-visthe supervisors and the drivers. It is therefore inaccurate (and at the same time, curious) for the Plaintiff to assert that it was still pursuing these claims when it had never levelled such claimsvis-à-visthe supervisors, and had abandoned the same in respect of the drivers. In addition, given the circumstances, I do not think that it would be fair to allow the Plaintiff to “introduce” these additional heads of claim at this stage. I therefore disallow the levy and accommodation costs.Costs of gondolas58     The Plaintiff claimed for the costs of 16 gondolas over the period of 19.42 weeks and supported its claim using the invoices issued by Mega Engineering (S) Pte Ltd (“Mega Engineering”) to ACS Amview for the supply of gondolas.59     Although Mr Tan referred to an invoice dated 1 June 2009 issued by Mega Engineering which recorded a supply of 13 (as opposed to 16) gondolas to ACS Amview (“the 1 June 2009 invoice”), I note that the relevant period (ie, between 2 May 2009 and 1 June 2009) coincided with the date of completion of the works,ie, 8 May 2009 (at [145] of theSKKdecision). Apart from the 1 June 2009 invoice, all other invoices whichprecededthe completion date/month consistently recorded the supply of 16 gondolas. Therefore, I allow the Plaintiff’s claim for 16 gondolas over the period of 6.42 weeks in the sum of $37,038.78.Riggers on standby for the operation of the gondolas60     The Plaintiff initially claimed for a total of six riggers for the operation of the gondolas. According to Mr Peter Tan, he had constantly insisted that a minimum of six workers be on standby as any number below that would not be enough to operate the 16 gondolas stationed at the Estate.[note: 14]61     This was, however, contradicted by Mr Neo’s daily site records which consistently recorded the presence of only three riggers at the Estate in the following manner:[note: 15]MEGA(ie, the supplier of the riggers) 3 technicians shifting gondolas at lobby N&M.[note: 16]62     Given the above, the Plaintiff conceded on this point at the assessment proceedings and revised its claim to three riggers instead.[note: 17]I also note that Mr Tan only disputed this head of claim in respect of the number of riggers claimed,viz, his position was that based on Mr Neo’s records, only three riggers should be allowed. As such, I allow $13,482 for the claim for three riggers.Licensed electrical worker and the gondola registration fee63     The Plaintiff also claimed for (a) the costs of engaging a licensed electrical worker; and (b) the gondola registration fee, which was described by the Plaintiff as a one off six-monthly fee for the safety endorsement of vertical work platform by a professional engineer.64     Mr Lee testified that it was a requirement by the relevant authority that the gondolas were periodically checked by a professional engineer and due to the prolongation, this had to be renewed. Mr Tan suggested that there should be a proportionate apportionment of these claims, given that the sixth-monthly period expired after the completion date of 8 May 2009. In this regard, Mr Lee pointed out that the fees for the six-month period had been paid upfront. Notably, Mr Tan did not challenge Mr Lee’s position any further.[note: 18]65     The invoice from Mega Engineering which reflected the costs of engaging a licensed electrical worker and of a professional engineer was dated 3 January 2009 (“the 3 January 2009 invoice”).[note: 19]This coincided with the period when the Plaintiff/ACS Amview became aware that they were behind schedule and the period for completion of the works had to be extended beyond December 2008, see Mr Szetho’s opinion that the works were originally scheduled to be completed by the end of December 2008.[note: 20]Further, only the 3 January 2009 invoice included these costs. Thus, I accept Mr Lee’s evidence that they had been incurred due to the Defendant’s delay and had been paid on an upfront basis.66     I allow $1849.44 for the costs to engage a professional engineer and $1849.38 for the costs to hire a licensed electrical worker.Additional premium for extension of performance bond and renewal of factory licence67     The Plaintiff also claimed for the additional premium paid for the extension of the performance bond and also for the costs of renewal of the factory licence due to the prolongation. As rightly pointed out by Mr Tan, no documentary proof was provided for these two heads of claim.68     Indeed, Mr Lee admitted that other than him being orally informed of these expenses, no documentary evidence of these items were given to him. Nevertheless, he testified that from his experience, these two items would have been incurred during the prolongation period:[note: 21]Q:… For (D) - premium of performance bond (“PB”) for six months. Have you got records to show that?A:That was [the Plaintiff’s] responsibility to pay the PB.Q:Did you ask for receipt of all these?A:No.Q:How do you know this has been incurred?A:Was told that this is incurred. I also know that PB is for fixed period, usually linked to the contract period, if the period is prolonged, PB has to be extended.…Q:You asked for the amount but you did not see it fit to ask for the invoice?A:Amount is not very huge, only $ 218. I know that such costs would be incurred. If need be, I can ask [the Plaintiff] to produce.Q:Factory licence?A:Same thing. Usually linked to contract period.(1)   Proof of claims through the invocation of judicial notice69     The Plaintiff in its reply submissions filed on 18 February 2013 urged the Court to take judicial notice that these two items had been incurred by the Plaintiff:(a)     Based on information relating to factory licences which was available on the website of the Ministry of Manpower (“MOM”), the Plaintiff submitted that the main contract between the Plaintiff and Defendant which was entered into prior to 28 February 2010 fell under the old regime where renewal of Certificate of Registration was required. As the works were originally scheduled to end on 5 December 2008 but was extended to 8 May 2009, the Plaintiff submitted that it can be inferred that it had to incur the requisite fees to renew its Certificate of Registration; and(b)     The Court can take judicial notice of the claim for the additional premium for the extension of the performance bond and highlighted that the sum claimed amounted “to only $758.43”.[note: 22]70     The Defendant did not directly address the Plaintiff’s submissions on the taking of judicial notice, though it maintained that these heads of claim should fail for want of proof.(2)   Whether judicial notice can bridge the evidential gap in proving payment of specified amount of fees71     It is trite that the Plaintiff bears both the legal and evidential burden in proving the expenses incurred for the renewal of the factory licence fees and for the extension of performance bond. In this regard, the Plaintiff chose to demonstrate proof of these two items through the invocation of judicial notice.72     As noted inHalsbury's Laws of Singaporevol 10 (LexisNexis, 2006 Reissue) at para 120.267:… Judicial notice dispenses with proof and may save a party on whom the burden of proof of the fact would otherwise lie from the consequences of failure or omissions to offer proof of that fact. … The reason for accepting proof by judicial notice is not so much that the fact is well known or that it is indisputable but that the nature of the fact is such that it has an objective existence independent of the complexion of any individual case (so that its character is general rather than particular) and its proof is readily available to the court itself. [footnotes omitted]73     It was held inPlaza Singapura (Pte) Ltd v Cosdel (S) Pte Ltd[1990] 2 SLR(R) 22 that the court should be cautious in invoking the doctrine of judicial notice. In ascertaining whether judicial notice ought to be taken of a fact, the court should carefully consider whether it is of unassailable character, bearing in mind that any doubt as to the public notoriety of any fact which is alleged to be judicially noticeable ought to be resolved against the party seeking to rely on that fact, seeZheng Yu Shan v Lian Beng Construction (1988) Pte Ltd[2009] 2 SLR(R) 587 at [83]–[84].74     With these considerations in mind, it is clear that the fact of extension of performance bond cannot be a matter of public notoriety which warrants the taking of judicial notice. The regulatory requirement by MOM, on the other hand, may arguably warrant the taking of judicial notice. However, it should be noted that thefact of renewal of factory licenceas required by MOM which may be proven by the taking of judicial notice is different from thefact of payment of a specified amount for the renewal of the licencewhich, in my view, may not be proven in the same manner.75     The Plaintiff’s claims for the sum paid for the extension of performance bond and the renewal of factory licence could have been easily substantiated by documentary proof. The relative ease of obtaining documentary evidence of these payments was alluded to by Mr Lee in the course of cross-examination (though I would highlight that no explanation was proffered as to why this was not done):[note: 23]Q:You asked for the amount but you did not see it fit to ask for the invoice?A:Amount is not very huge, only $ 218. I know that such costs would be incurred.If need be, I can ask [the Plaintiff] to produce.[emphasis added]76     I also do not agree with the Plaintiff’s position that the court should nonetheless allow these claims as they were of relatively small sum. A smaller sum claimed is no excuse to having a lax attitude towards proof – the onus remains on the Plaintiff to prove these heads of claims on a balance of probability. As the Plaintiff has failed to discharge its burden, I disallow these claims.Head office overheads(1)   The Plaintiff’s methodology in assessing head office overheads77     Mr Lee relied on the Emden’s formula to compute the head office overheads of ACS Amview. The Defendant’s main objections to this were twofold:(a)     As ACS Amview was a small set up, Mr Lee could have computed the head office overheads based on first principles with reference to its actual costs and expenses, without having to resort to using the Emden’s formula;[note: 24]and(b)     The information applied to the Emden’s formula was flawed as it was based on only one year’s worth of accounts.78     Mr Lee explained that the Emden’s formula was preferred to the Eichleay or Hudson’s formulae (viz, the two other formulae widely used for computing head office overheads) in this case as it reflected more closely the calculated loss in the event of prolongation of a contract. He also highlighted the deficiencies of the other two formulae should they be applied to the present assessment proceedings.[note: 25]When asked whether he agreed with the Defendant’s proposition that an assessment of head office overheads should have been done based on “first principles” before one turns to one of the formulae, Mr Lee replied as follows:[note: 26]A:I think that even if it is done, it would be very controversial and it would not have any improvement over a formula method. A lot of work but taking a lot of assumptions as well. Not easy to get proper documentations although you know that there is costs incurred.79     On this issue, Mr Nunns conceded that it was common to use a formula to compute the head office overheads. He also accepted that the Emden’s formula is appropriate for the present assessment.[note: 27](2)   The use of formula and the issue of proof80     It is recognised that contractors find it convenient to advance a claim for profits and overheads based on the formulae proposed by writers of standard textbooks, see para 10.120 ofLaw and Practice of Construction Contracts, Vol 1. In principle, I see no objection to the use of the Emden’s formula (or Eichleay or Hudson’s, as may be appropriate) even to smaller organisations given the inherent difficulties associated with assessing head office overheads. Although each formula has its own conceptual limitations (see para 10.128 of theLaw and Practice of Construction Contracts, Vol 1), it is nonetheless the more economical and practical way of computing such claims.81     At this juncture, parties should be reminded that the formulae themselves do not constitute proof of loss, seePeak Construction (Liverpool) Ltd v McKinney Foundations Ltd(1970) 69 LGR 1. I would also add that parties seeking to assess head office overheads by using one of the formulae should be diligent in ensuring the accuracy and integrity of the data/information applied to the formula of choice. This, as I observed, was lacking on the part of the Plaintiff. During the assessment proceedings, it transpired that the Plaintiff did not ascertain whether the individual items (eg, insurance, legal and professional fee, interest and late payment,etc)[note: 28]which formed the constituent components of the Emden’s formula, were in fact related to the Mandarin Gardens project. This necessitated a round of verification with Mr Peter Tan on whether the specific items were directly attributable to the Mandarin Gardens project. Although the Plaintiff’s claim for head office overheads was subsequently revised to eliminate items which were not attributable to the Mandarin Gardens project (and therefore should not have been included in the Emden’s formula), the verification process could and should have been done prior to the assessment proceedings.(3)   Whether the Plaintiff has demonstrated proof82     In mounting a claim for head office overheads, the learned author ofLaw and Practice of Construction Contracts, Vol 1 at para 10.117 opined as follows:To sustain a claim for loss of profit or offsite overheads,a claimant contractor must firstly show that for the critical period of delay, market conditions in the construction industry were sufficiently favourable at the relevant point in time so that it is reasonable to expect that the resources which were tied up in the delayed project could have been deployed to enable him to recover his profit and head office overheads on such work as could be reasonably secured at the material time. The persuasiveness of this contention depends significantly on the contractor demonstrating thathe had reasonable prospects of securing such work. … in most cases, these claims arenormally canvassed on the basis that the amount claimed reflects the average profit and overheads contribution achieved in the claimant’s past projects.[emphasis added]83     From the above, one may deduce that ACS Amview needs to demonstrate that (a) there were reasonable prospects for it to be engaged in other project(s) but for the delay; and (b) such other project(s) may contribute to its profit and overheads. In demonstrating the latter, historical data evidencing the average profit and overheads contributions may be relied on by it.84     In my judgment, the Plaintiff has failed to overcome the hurdles in proving the claim for head office overheads. It has not shown that ACS Amview had reasonable prospects of taking up other projects at the material time. As admitted by Mr Lee, he did not ascertain with ACS Amview whether there were job offers made during the prolongation period.[note: 29]Further, there is insufficient proof in respect of the turnover yielded from ACS Amview’s other and/or past projects to reflect itsaverageprofit and overheads contribution. The limited information in this regard included only the following:(a)ACS Amview’s business size was in the region of eight to ten projects per year (for 2008 and 2009);[note: 30](b)The Mandarin Gardens project was its biggest project for 2008/2009;[note: 31]and(c)Its project income for the year ended September 2009 was $8,445,702.85     As pointed out by Mr Nunns, ACS Amview had only produced its audited accounts for the year ended September 2009 for the assessment proceedings. Notably, no reason was given as to why it had not provided its accounts for the preceding years. This is unsatisfactory as it provides a distorted snapshot of its financials. In this respect, I agree with Mr Nunns observations below:[note: 32]A:… If you do use formula [in calculating head office overheads], normal practice is that you use accounts and that involves looking at company records, not one year but three years. For such organizations, their accounts go up and down. There would be erratic turnover, and it is not correct to only use one year.86     In the light of the foregoing, I disallow the claim for ACS Amview’s head office overheads for want of proof.The 10% administrative costs incurred by the Plaintiff(1)   The grounds for claiming 10% administrative costs87     The Plaintiff advanced different grounds for its claim for 10% administrative costs. Mr Lee’s first response was the claim was derived from the “contract agreement between [the Plaintiff] and [ACS Amview]”,ie, the Details of Contract.[note: 33]The relevant term of the Details of Contract read:4    Forall subsequent authorized variation works, you are deemed to cover us [the Plaintiff] a10% profit and attendanceof the approved variation sum by the Main Contract.[emphasis added]88     Upon further questioning by Mr Tan, Mr Lee shifted his position and stated that the 10% administrative costs was based on instructions given by the Plaintiff and that it was “normal” in terms of a contractor’s overheads. In fact, he thought that the Plaintiff might be under-claiming since it was only asking for 10%.[note: 34]89     Ms Parhar also shed some light on the Plaintiff’s basis in claiming the 10% administrative costs in the course of cross-examining Mr Nunns:[note: 35]Q:You also said that the 10% claim, you disagree?A:That is my opinion.…Q:Mr Nunns, you are aware [the Plaintiff] is [the] main contractor and all site meetings and letters and communications about delay and prolongation were made by [the Plaintiff]?A:YesQ:Accept it would have taken up time?A:YesQ:Would that not be a loss?A:It would be a costs incurred, a loss, by [the Plaintiff].(2)   Whether the Defendant should bear the 10% administrative costs90     Two difficulties arise in respect of the Plaintiff’s claim for 10% administrative costs:(a)There does not appear to be anylegalbasis to the Plaintiff’s claim for “administrative costs”; and(b)It is unclear how the Plaintiff had arrived at the 10% figure.91     The initial position that the term in the Details of Contract (see [87] above) allowed for its claim for 10% administrative costs is untenable since the term “prolongation” does not square with “authorised variation work”. Even if it could be claimed as the Plaintiff’s overheads (which I make no finding given the paucity of evidence in this regard), there is nothing to support the 10% figure claimed.92     Further, the Plaintiff’s basis that the administrative costs were to cover its loss/costs for attending site meetings and putting in claims for extension of time on behalf of ACS Amview does not appear to be compensatoryvis-à-visthe Defendant. In this connection, it is arguable that an implied term exists between the Plaintiff and ACS Amview for the former to do the necessary to put in claims for an extension of time when required (seeFoo Jong Peng and others v Phua Kiah Mai and another[2012] 4 SLR 1267). Bearing in mind that the doctrine of privity of contract precludes ACS Amview from making a direct claim for an extension of time (and in turn prolongation costs) against the Defendant, ACS Amview would be left without recourse in the event of delay if such term is not implied into the subcontract.93     As I see is no legal basis for the Plaintiff to claim for 10% administrative costs, I disallow it.Conclusion94     For ease of reference, the table below is a summary of the amount allowed for the Plaintiff’s various heads of claims:s/nHeads of ClaimAmount allowed[note: 36]1Costs of three supervisors$ 12,192.182Costs of two drivers$ 3,792.703Foreign worker levy for the supervisors and driversNot allowed4Workers’ accommodation for the supervisors and driversNot allowed5Costs of 16 gondolas$ 37,038.806Three riggers for the operation of gondolas$ 13,482.007Safety endorsement of vertical work platform by Professional Engineer (6-monthly interval)$1,849.448Licensed electrical worker$1,849.389Additional premium for extension of performance bondNot allowed10Renewal of Factory LicenceNot allowed11Head office Administrative CostsNot allowed1210% Administrative costs claimed by the PlaintiffNot allowedTotal allowed$70,204.5095     I will hear parties on costs on a date to be fixed by Registry.[note: 1]Plaintiff’s reply submissions filed on 18 February 2013 at para 90.[note: 2]Notes of Evidence (“NE”), 20 November 2012, p 45 lines 15-22; p 46 lines 19-24; p 47 lines 21-27.[note: 3]Mr Lee’s AEIC filed on 7 June 2012 at pp26-36.[note: 4]NE, 20 November 2012, p 28 lines 20-24.[note: 5]Ibid, p 28 lines 28-31.[note: 6]Ibid, p 29 lines 15-22.[note: 7]Ibid, p 29 lines 109; p 29 lines 24-31; p 20 lines 1-2; p 35 lines 16-20.[note: 8]Ibid, p 32 lines 15-24.[note: 9]NE, 19 Nov 2012, p 47 lines 23-30; p 48 lines 8-11, lines 17-19 and lines 24-31; p 49 lines 1-10.[note: 10]Ibid, p 17, lines 23-27.[note: 11]Ibid, p 17 lines 12-15; p 40 lines 10-11.[note: 12]Ibid, p 17, lines 29-31; p 18 lines 1-3.[note: 13]Ibid, p 12 lines 31-32; p 13 lines 1-3 and lines17-19.[note: 14]NE, 20 November 2012, p 9 lines 23-29.[note: 15]Mr Szetho’s AEIC filed on 18 June 2011 at p 111.[note: 16]NE, 20 November 2012, p 31 lines 15-16.[note: 17]Ibid, p 32 lines 7-8.[note: 18]NE, 19 November 2012, p 19 lines 9-20.[note: 19]Mr Lee’s AEIC filed on 7 June 2012 at p 51.[note: 20]Mr Szetho’s AEIC filed on 18 June 2011 at para 3.[note: 21]NE, 19 November 2012, p 18 lines 12-22 and 27-32.[note: 22]Plaintiff’s reply submissions filed on 18 February 2013 at para 84.[note: 23]NE, 19 November 2012, p 18 lines 27-29.[note: 24]Ibid, p 26 lines 4-5.[note: 25]Ibid, p 28 lines 3-15.[note: 26]Ibid, p 29 lines 27-31; p 30 lines 1-5.[note: 27]NE, 20 November 2012, p 39 lines 6-15; p 41 lines 11-16.[note: 28]NE, 19 November 2012, p 25 lines 1-24.[note: 29]Ibid, p 26 lines 5-8.[note: 30]NE, 19 November 2012, p 38 lines 10-17.[note: 31]NE, 20 November 2012, p 16 lines 18-27.[note: 32]Ibid, p 39 lines 16-19.[note: 33]NE, 19 November 2012, p 4 at lines 14-21.[note: 34]Ibid, p 7 at lines 1-11.[note: 35]NE, 20 November 2012, p 41 lines 18-19, 30-32; p 42 lines 1-7.[note: 36]Based on the weekly rates provided by the Plaintiff’s expert with reference to the 6.42 week period.",
        "Conclusion": "94     For ease of reference, the table below is a summary of the amount allowed for the Plaintiff’s various heads of claims: s/nHeads of ClaimAmount allowed[note: 36]1Costs of three supervisors$ 12,192.182Costs of two drivers$ 3,792.703Foreign worker levy for the supervisors and driversNot allowed4Workers’ accommodation for the supervisors and driversNot allowed5Costs of 16 gondolas$ 37,038.806Three riggers for the operation of gondolas$ 13,482.007Safety endorsement of vertical work platform by Professional Engineer (6-monthly interval)$1,849.448Licensed electrical worker$1,849.389Additional premium for extension of performance bondNot allowed10Renewal of Factory LicenceNot allowed11Head office Administrative CostsNot allowed1210% Administrative costs claimed by the PlaintiffNot allowedTotal allowed$70,204.50   95     I will hear parties on costs on a date to be fixed by Registry.   [note: 1]Plaintiff’s reply submissions filed on 18 February 2013 at para 90. [note: 2]Notes of Evidence (“NE”), 20 November 2012, p 45 lines 15-22; p 46 lines 19-24; p 47 lines 21-27. [note: 3]Mr Lee’s AEIC filed on 7 June 2012 at pp26-36. [note: 4]NE, 20 November 2012, p 28 lines 20-24. [note: 5]Ibid, p 28 lines 28-31. [note: 6]Ibid, p 29 lines 15-22. [note: 7]Ibid, p 29 lines 109; p 29 lines 24-31; p 20 lines 1-2; p 35 lines 16-20. [note: 8]Ibid, p 32 lines 15-24. [note: 9]NE, 19 Nov 2012, p 47 lines 23-30; p 48 lines 8-11, lines 17-19 and lines 24-31; p 49 lines 1-10. [note: 10]Ibid, p 17, lines 23-27. [note: 11]Ibid, p 17 lines 12-15; p 40 lines 10-11. [note: 12]Ibid, p 17, lines 29-31; p 18 lines 1-3. [note: 13]Ibid, p 12 lines 31-32; p 13 lines 1-3 and lines17-19. [note: 14]NE, 20 November 2012, p 9 lines 23-29. [note: 15]Mr Szetho’s AEIC filed on 18 June 2011 at p 111. [note: 16]NE, 20 November 2012, p 31 lines 15-16. [note: 17]Ibid, p 32 lines 7-8. [note: 18]NE, 19 November 2012, p 19 lines 9-20. [note: 19]Mr Lee’s AEIC filed on 7 June 2012 at p 51. [note: 20]Mr Szetho’s AEIC filed on 18 June 2011 at para 3. [note: 21]NE, 19 November 2012, p 18 lines 12-22 and 27-32. [note: 22]Plaintiff’s reply submissions filed on 18 February 2013 at para 84. [note: 23]NE, 19 November 2012, p 18 lines 27-29. [note: 24]Ibid, p 26 lines 4-5. [note: 25]Ibid, p 28 lines 3-15. [note: 26]Ibid, p 29 lines 27-31; p 30 lines 1-5. [note: 27]NE, 20 November 2012, p 39 lines 6-15; p 41 lines 11-16. [note: 28]NE, 19 November 2012, p 25 lines 1-24. [note: 29]Ibid, p 26 lines 5-8. [note: 30]NE, 19 November 2012, p 38 lines 10-17. [note: 31]NE, 20 November 2012, p 16 lines 18-27. [note: 32]Ibid, p 39 lines 16-19. [note: 33]NE, 19 November 2012, p 4 at lines 14-21. [note: 34]Ibid, p 7 at lines 1-11. [note: 35]NE, 20 November 2012, p 41 lines 18-19, 30-32; p 42 lines 1-7. [note: 36]Based on the weekly rates provided by the Plaintiff’s expert with reference to the 6.42 week period."
    }
}