{
    "case_title": "BJZ\n      v\n      BKA",
    "ncitation": "[2013] SGHC 149",
    "coram": "Judith Prakash J",
    "sections": {
        "Background": "4       The parties are both in the medical profession. The husband is 53 years old while the wife is 50 years old. They have two sons: the elder (“B”) was born in 1994 whilst the younger (“C”) was born in 1997. 5       Both parties have practised their professions throughout the marriage. The wife set up her own clinic and was in private practice even before the marriage. After the elder son was born, however, she decided to work part-time in order to spend more time on the family. From about the end of 1994, she worked three days a week and she has maintained that schedule until now. The wife earns a comfortable income. 6       The husband was originally employed by the Ministry of Health where he rose to the position of consultant at a public hospital. In 2005, he went into private practice and set up three companies (‘the husband’s companies”), one of which provides his medical expertise to patients whilst the other two provide ancillary services. The husband has been extremely successful in his practice and has accumulated substantial wealth. 7       The parties bought their first matrimonial home (the “first property”) in 1991 for $1m. This was sold in October 2005 for $2.48m and the net profits were reinvested in the replacement matrimonial home (“the Home”) which was purchased in 2005. The Home is held in joint names and is estimated to be worth around $10m.",
        "Custody, care and control": "8       The parties, having agreed to a joint custody order in respect of the sons, initially disputed care and control only. When the parties appeared before me, however, I was told that they had agreed to shared care and control of the elder son, B. B is currently completing his upper secondary school education and is scheduled to be enlisted in national service in or around August this year. I think that it is not necessary for me to make any care and control order in respect of B as he is old enough and independent enough to decide where he wants to reside when not serving national service. B did indicate to me that when the parties set up separate homes, he would prefer to live with the husband because he and his father have common activities like gym attendance. No matter where the wife lives after leaving the Home, B will be mobile enough to visit her whenever he chooses. 9       The younger son, C, is still in secondary school. It is the wife’s position that the husband is not a suitable caregiver and is a bad role model for C. The wife is still living in the Home but after the ancillary order relating to division of the matrimonial assets has been made, she plans to move out and wishes to take the younger son with her. She wants care and control of C with reasonable access to the husband. 10     The wife says that she has been the primary caregiver of the children since their births. She sacrificed her career development by moving from full-time to part-time work so that she could spend more time with them. Her focus has always been on the children’s well-being and education. She is aware that it is important to keep a balance between school and play and does not overly indulge them to gain their favour. The wife explained her recent expensive clothes purchases for C by saying that she had to manage his expectations because the husband had repeatedly humoured him with branded goods. 11     The wife’s criticisms of the husband centred on the inappropriate lifestyle which she asserted he had introduced to the sons. The wife stated that after the divorce she had continued to reside in the Home to watch over the boys despite her uncomfortable living conditions (she lives in the basement in a room with no windows). C was at an impressionable age and needed proper guidance. 12     The wife criticised the husband for taking the elder son out clubbing. She said that he had smuggled B into clubs and allowed him to stay out till the early hours of the morning. He also permitted B to drink alcohol in a club. She exhibited photographs showing the husband and B in a club with a friend pouring alcohol down B’s throat. After the parties split up, the husband had held wild parties at home. She exhibited photographs of a drunken B taken during a party. On 22 September 2011, the husband took B out clubbing even though it was a school night. They returned home, intoxicated, only at 2am. As a result, B missed school the next day. The husband did not dispute this assertion save to say the night out was justified in view of the once a year Formula One night race. 13     The wife asserted that the husband engaged in motor racing and participated in street races at night. Sometimes he took B along with him, totally disregarding his safety. She pointed out that that the husband had not denied this and had said that he participated in driving trips and holidays and had taken his son for such trips. He stated that he would continue to take the boys on holiday at their request as they had specific interests and hobbies. Both were interested in cars, guns and hunting and he expected such interests to continue in the foreseeable future. He had taken them to visit a specific gun-club in San Francisco so they that could have the experience of live ammunition being used. 14     The wife complained that the husband had indulged the children in both alcohol and games. Since the divorce, he had bought a new play-station and two big screens for them just for gaming. He also bought C the latest gaming personal computer. The wife considered C to be quite a gaming addict and thought the husband should not indulge him so much. As a result, the sons regularly played games into the early hours of the morning. The wife was not as sanguine as the husband regarding the boys’ interest in guns. She thought it was not healthy for them to develop such an interest at a young age. 15     The wife was also concerned that the husband’s relationships and behaviour with women would have an adverse impact on the moral values of the sons. Between 2009 and 2011, the husband went out with his girlfriends and friends at least four times a week. The husband had precipitated the breakdown of the marriage by leaving the wife in 2009 for a young woman whom he was then very much in love with. This relationship did not last, however, and he then became involved with another young lady (“X”) in 2010. While dating her, he also had another girl stay over with him at the Home. The wife asserted that X likes to party and it was she who had poured liquor into B’s throat at the nightclub. The wife complained that the husband likes to take raunchy photographs and had filmed himself engaging in sexual activities. The wife made other complaints about the husband’s sexual behaviour which I will not go into in detail. 16     The husband had tried to influence the children’s views by taking them to expensive restaurants and introducing them to high living. He bought them branded goods and indulged them so that they would “choose” him over their mother who would appear to be “controlling” rather than disciplining them. The husband earned a much higher income than the wife and used this money to control the children. 17     The husband submitted that the wife’s allegations that he is an unsuitable parent are not borne out by the facts. The boys are close to him and comfortable with him. He takes them to school and picks them up from school as and when they ask him to; he takes them out dining and shopping; he takes them on holiday to gun clubs in San Francisco at their request and when B was having problems in his boarding school abroad, the husband solved the issue by enrolling B in a private school in Singapore. He was the parent that B turned to when B got into a fight at school. 18     The husband asserted that the wife did not hesitate to expose the family’s problems to the children’s classmates’ parents, thereby causing the children embarrassment. She also used the children to get back at him. 19     As far as all the photographs and other evidence that the wife produced about his various activities, the husband asked that the court strike out such evidence and disregard it, in particular, the photographs, which he asserted were stolen from his computer after the wife hacked into his computer by breaking into his room while he was away. I should point out here that the wife denied the allegations that she had to hack into his computer in order to obtain these photographs and asserted that the computer was easily accessible and no hacking was required. The husband’s allegations about computer hacking are now the subject of a separate District Court suit which he has brought against the wife. 20     The husband also said that he has admitted to his adultery and inappropriate association with other women and the photographs should not be used against him since the adultery was not disputed. 21     The husband’s position was that care and control of the children should be decided by the boys themselves in view of their ages. Should the children decide to live with the wife, he would seek liberal access including overnight access and liberty to take the children overseas and he would give the wife the same access arrangements should they decide to live with him. 22     In my judgment, the husband has not effectively rebutted the wife’s assertions about the way in which he carries on his life and the lifestyle to which he has introduced his sons. From the evidence, that lifestyle is an extremely adult one which is generally unsuitable for teenagers. The husband’s main submission on care and control was to ask the court to ascertain the sons’ views and be guided accordingly. I did speak to both sons. They love both parents and did not criticise either. As I said above, B expressed a preference to live with his father. C, however, did not make any explicit choice. In any case, the court has to be guided by its objective determination as to what is in the best interests of the children. Whilst the children’s preferences have to be considered, in view of their immaturity such preferences cannot be the deciding factor. 23     As stated, the parties have agreed on B’s position. As for C, having considered all the circumstances, I find that it would be in his best interests for the wife to have sole care and control of him. C is still at an impressionable age and it would benefit him to live in a quieter, and more disciplined, environment in which he can concentrate on his studies and prepare for adult life. The father’s lifestyle would be exciting for any young man and may distract him from such preparation. 24     The husband shall have reasonable access to C. He shall be entitled to overnight access from Friday evening to Sunday night at 9pm on alternate weekends and otherwise shall be free to see C whenever C’s schedule permits and C is willing, as long as C is back home by 9pm. As for holiday access, the husband shall be entitled to take C overseas for one long holiday of up to two weeks each year and for up to two shorter holidays of up to five days each time. The husband shall give the wife at least one month’s prior notice of any overseas holiday on which he wishes to take C.",
        "Division of matrimonial property": "25     As would have been gathered from what has been stated so far in this judgment, the parties are wealthy and there are a number of issues to be considered in connection with the division of matrimonial property. These are as follows: 1    whether a forensic accountant should be appointed; 2    what date should be taken for division of the assets; 3    what forms the pool of matrimonial assets; 4    what were the parties’ contributions to the acquisition of the assets and the marriage; and 5    what is the proper division of the same.",
        "Forensic accountant": "26     The husband has proposed that a forensic accountant be engaged to trace his earnings, his assets and the expenditure of the family for such period as the court deems fit. The husband believed that this would be the most open and fair determination of the assets under his control and/or in his possession. He also proposed that the sum of $986,507 which was in the wife’s possession as at 31 December 2009 be similarly traced by the forensic accountant. 27     The sum of $986,507 represents the total credit balance of the wife’s bank balances as of 31 December 2009. It is not disputed that $250,000 of this sum came from the husband’s sole POSB account and $633,294.82 was withdrawn from the parties’ joint investment account with BNP Paribas (“BNP”). This withdrawal was by the wife without the knowledge of the husband. As for the $250,000, $100,000 came from a cheque which the husband gave to the wife in August 2009 and the other $150,000 came from a blank cheque that the husband had left with the wife and which she completed by filling in the amount. The wife admitted that she had taken the various sums of money without the husband’s consent. She explained that she felt insecure after discovering the husband’s affairs. She said she was anxious and fearful that the husband would leave her and the children destitute. The wife claimed that out of the $633,294.82 taken from the BNP account, she had spent some $546,000 for living expenses, bags and jewellery and holidays with her sons. She was not able to fully account for this expenditure. In particular, the wife claimed to have spent about $228,000 on handbags and jewellery but was not able to give receipts for this expenditure. 28     As far as the sum of $986,507 is concerned, I do not see any need for the appointment of a forensic accountant. The wife has admitted that the bulk of this money had come from the husband and the parties’ joint account and although she claims to have expended a lot of it, she is willing to have the whole amount taken into consideration as part of the matrimonial assets held by her. As for the husband’s assets, income and expenditure, there is enough material in the affidavits for the parties to make submissions on. I do not think that the expense and delay of a forensic accountant is required in order for the court to make an equitable distribution of the assets. In any event, the exercise of ascertainment and division of matrimonial assets is not an exercise in accounting where precise numbers are always required. Whilst the court does have to make findings on the value of assets and the contributions and the expenditure of the parties to the marriage, much of this can be done in fairly broad terms without calculating the numbers down to the last dollar. I therefore hold that no forensic accountant should be appointed.",
        "Date of division": "29     The husband submits that the assets should be divided as of mid-2010 whilst the wife’s position is that the date of the division should be the date of the interim judgment,ie, February 2011. 30     The husband contended that the marriage had broken irretrievably by mid-2010 because: 1    The parties had physical fights on two occasions in May and June 2010 which caused each of them to apply for a personal protection order against the other. 2    The wife moved into the basement of the Home in June 2010 and the parties stopped communicating with each other except through the maids and the children. 3    The husband took over the management of the household expenses in or about July 2010 and is still managing the same. 4    The children communicated directly with the husband on their needs and the parties had and still share their care and control. 31     The husband asserted that on account of the matters set out in [30] above, the wife’s non-financial contributions as a wife had ended by mid-2010 and he had taken over the non-monetary aspects of the household management for the children and himself from then. In this regard, after July 2010, it was he who had made efforts to get B enrolled in a private school in Singapore after B refused to return to his English boarding school and had also helped C change his school in Singapore. 32     InYeo Chong Lin v Tay Ang Choo Nancy and another appeal[2011] 2 SLR 1157, the Court of Appeal observed at [19] and [39] that there are four possible dates which a court could conceivably adopt as the operative date for division of the assets. These are the date of separation, the date on which the divorce proceedings started, the date of the interim judgment, and the date of hearing of the ancillary matters. Of these four possible dates, the court considered that generally speaking, it would be sensible to apply either the date of the interim judgment or the date of the hearing of the ancillary matters but that much would depend on the fact situation. 33     In this case, the husband has not given any compelling reason why the date of division should be mid-2010 when the marriage seems to have broken down irretrievably rather than February 2011 when the interim judgment was issued. After the wife moved out of the matrimonial bedroom, she did not delay in filing divorce proceedings and these were not protracted, only some four months elapsing between filing and the interim order. It would be a different matter if one of the parties was asking for the date of hearing of the ancillary matters to be the operative date since it took quite a while for these to come on for hearing due to the various discovery and interlocutory applications and appeals that were filed. There is no evidence of any great change in either party’s financial position between mid-2010 and February 2011 such that it would be inequitable to the husband to use February 2011 as the operative date. The husband’s point was that from August 2010, the wife had stopped making non-financial contributions to the marriage. Even if this was accepted completely (and the wife does not agree since she was still acting as the children’s mother) the period of six months between August 2010 and February 2011 isde minimiswhen considered in the context of a 20-year marriage. I will therefore take February 2011 as the operative date.",
        "Pool of matrimonial assets": "34     There are three sets of assets to be considered: the wife’s assets, the husband’s assets and the assets which are in joint names. At the hearing, the parties produced a list of matrimonial assets which were to be considered by the court. It should be noted that the parties did not agree on all the values ascribed to the various assets. 35     The wife’s assets as disclosed in the list totalled $1,604,067.98. Most of the values attributed to these assets were as of dates in February 2011 but some items were valued as at the end of January 2011. The wife’s assets comprised the following: 1    $389,627.18 being the value of a 25% share in a shophouse unit in Hougang (“the shophouse”) which the wife uses for her practice; 2    $190,000 being the value of the wife’s car; 3    $119,542.37 being the total value of six insurance policies taken out by the wife; 4    $17,461.50 being the total value of two share counters held by her; 5    $364,932.10 being the total of the credit balances in her various bank accounts; 6    $855.07 being the balance in her CPF ordinary account; 7    $39,500 being the balance in her CPF Medisave account; 8    $68,149.76 being the balance in her CPF Special account; 9    $228,000 being the cost of bags and jewellery purchased by her; and 10     $186,000 being the cost of watches and diamond jewellery owned by her. The wife accepts that the total value of her assets includes the $883,294.82 derived from her withdrawal from the BNP account and the proceeds of the two POSB cheques given to her by the husband. The husband’s position is that of all the assets in the wife’s control and/or possession, only her 25% share in the shophouse and her insurance policies were paid for solely by her. All other assets had been paid for by him. Even the wife’s CPF assets emanated from him because it was one of the husband’s companies that employed her as a director and made CPF contributions for her. If items 5 and 9 are taken together they amount to $592,932.10. That means that she had spent another $290,362.72 from the sum of $883,294.82 which she has not accounted for. This sum could be added to her assets, giving her assets worth a total of $1,894,430.70. However, I do not think it would be correct to add back the entire sum. As mentioned (at [27] above), the husband had given the wife $100,000 in 2009. This was after she told him her savings were almost used up. He gave her this money for household and family expenses. Therefore, I would deduct this sum of $100,000. That would make the wife’s assets $1,794,430.70. 36     The husband’s assets are not quite as easy to value as he gave varying dates in 2011 for the values attributed to the assets. The husband’s assets according to the wife’s list comprised: S/NoDescriptionValue (S$)Value Date1Motor vehicle65,800.0025 Nov 201127 insurance policies141,489.11Dates between 28 May 2011 and 14 June 20113Shares in public companies82,900.0028 Feb 20114Investments in Radlink Radiologic and Real Estate Consortium1,548,000.00No date given5POSB account no. xxxxxx48-4318,434.8528 Feb 20116Moneys withdrawn in cash from POSB account no. xxxxxx48-4594,074.7317 Feb 20117Moneys in five other POSB accounts1,573,251.7131 Mar 20118DBS (SRS) account34,551.6431 Jan 20119HSBC account xxx-xxxxxx-496189,996.187 Feb 201110HSBC account xxx-xxxxxx-90150,346.28 (£24,428.34)7 Feb 201111HSBC account xxxxx259174,395.12 (£84,617.64)23 Mar 201112Safe deposit box1,350,000.0018 Feb 201113Watches244,000.00Cost prices at various dates14Club memberships5,524.003 May 201115Investment in Enceladus100,000.00Unknown16Investment in Solar energy company26,066.80 (US$20,000.00)Sep 201017The husband’s companiesWife’s valuation:2,800,000.00Husband’s valuation:53,132.00 for two companies, third having no value.Unknown18CPF ordinary account6,757.6331 Dec 201019CPF special account126,780.7316 Jun 201120Medisave account39,284.6731 Dec 201021Personal loan to friendWife’s valuation: 135,000.00Husband’s valuation:Nil – bad loanUnknown   37     If the husband’s assets in the list above are valued in accordance with the values given to them by the wife, the total value would be $9,606,653.45. It should be noted that certain of the assets in the list presented to me have not been included by me in [36] above. Further, the husband had various comments on the list and the values of the assets. 38     I explain my reasons for leaving out certain assets. First, in respect of three items, to include those assets would result in double-counting. These items are details of dividends paid to the husband by the husband’s companies between July 2010 and January 2011. Those amounts were paid by the husband into his bank accounts and would either be captured by the balances in the accounts or would be part of the assets acquired by the husband during the relevant period. The list also contained the details of loans that apparently been made to the husband by the husband’s companies. The total amount of these loans was $1,299,122.41 as at January 2011. I have not included these loans as separate assets since I take the view that the sums loaned, unless spent, must have been reflected in the husband’s other assets disclosed in the list. I am treating the loan amounts as the husband’s assets rather than his liabilities since the husband’s companies belong entirely to him and in this respect, their assets (iethe loans) must be treated as his. 39     Next, I must deal with the husband’s comments on the list in [36] above: 1Item 3 The husband argued that these shares valued at $82,900 should not be included because they were acquired after the interim judgment. I was not, however, shown evidence of this. The husband’s counsel said that his money was messy and it would be best to appoint a forensic accountant to trace how his money had moved. I take the view that if the husband was not able to show when exactly these shares were acquired and that they were not acquired with funds which he had in hand at the time of the interim judgment, these shares even if acquired after the interim judgment must be treated as representing funds in the husband’s hand at that time and therefore should form part of the assets. 2Item 6 The husband explained that this money was withdrawn in order to repay the hire purchase loan for his Lamborghini car when he sold the car in January 2011. He was willing to account for the sale proceeds of the car which amounted to $740,000. I accept this and therefore item 6 should be removed and instead the husband credited with the sum of $740,000. 3Item 9 The husband objected to this item on the basis that it was a bank account which was opened to repay the mortgage loan on the Home. I do not accept this objection. Although the money in the account might be intended to pay the mortgage, it would still form part of his assets. 4Item 11 The husband objected to this item on the basis that it was a bank account opened to pay for B’s education abroad. The purpose of the item did not take it out of the class of matrimonial assets, however. I also accept the wife’s contention that she had reduced the amount by the sum of £8,078.50 which the husband had disputed. The item must stay. 5Item 12 The husband argued that the value of this item should be $970,000 being the amount of cash in the safe deposit box as at May 2010. As I have found that 1 February 2011 is the operative date, this argument is not accepted and the value of the item must remain at $1,350,000. 6Item 17 The husband contested the wife’s valuation of the husband’s companies at $2.8m as being unrealistic. He stated that two of the companies were worth $53,132 being the amount of undistributed profits and that the third company had no value. The husband’s point was that basically the value of the companies depended on the services that he rendered and that if he was not involved in the companies and providing his medical services, the companies would have no value at all. He explained that the companies paid their earnings to him by way of loans, salary and dividend. For example, the main company paid him a monthly salary of $25,000 and monthly dividends of $100,000 in 2010. The moneys earned by the husband’s companies that year were reflected in his various bank accounts and deposits. The companies did not themselves have substantial assets. I accept the husband’s contention that the companies have no real value apart from their ability to offer his medical services and that the income of the companies was regularly transferred to the husband’s accounts. 7Item 19 The husband argued that the balance in his CPF special account should be taken as of the cut-off date by which he meant August 2010. As I have held that 1 February 2011 is the operative date that is the date that must be used for this calculation as well. The husband provided a CPF statement of account which showed that as at 31 December 2010, his special account balance was $161,280.73. The wife derived her figure of $126,780.73 in respect of his balance by deducting $34,500 from $161,280.73 because the husband had invested the $34,500 in an insurance policy in February 2011 and the value of this policy had already been included in item 2. As it stands therefore, item 19 correctly reflects the husband’s balance in his CPF special account. 8Item 21 In about 2007, the husband lent a friend of his, whom I shall refer to as “BY”, $300,000 to assist him in starting a food and beverage business which business subsequently failed. BY only repaid $121,000. He gave the husband some cash cheques towards the balance but when the husband presented these for payment, they were dishonoured by the bank. In February 2011, BY signed a note in which he promised to repay the husband the balance of $179,000 as soon as the funds became available. The wife says that this loan should be considered part of the husband’s assets but the husband contends that realistically, there is little chance of recovering it. I accept the husband’s contention and hold that this loan should not be considered part of the husband’s assets. 40     Taking the above findings into consideration, I therefore make the following adjustments: 1    the value of item 6 shall be increased from $594,074.73 to $740,000; 2    in relation to item 17, the husband’s companies shall be valued at $53,132; and 3    in relation to item 21, the value shall be nil. After adjustment, the total value of the husband’s assets is $6,870,710.72. 41     There are two other assets to be considered. These consisted of real properties held in joint names. The first of these was a unit in a building called The Icon (“the Icon unit”). Prior to the hearing before me, the Icon unit was sold and the net sale proceeds amounting to $443,009.01 were held by the solicitors who acted for the parties. It is not disputed that the Icon unit was paid for entirely by the husband. 42     The second joint property is the Home. This was purchased in 2005 for $4.85m. The wife estimated that as at February 2012, it was worth $9.5m and that in March 2013, it was worth some $10.5m. Whilst both parties contributed towards the acquisition of the Home and it is not disputed that the wife’s contribution was very much less than the husband’s, there is some uncertainty about exactly how much the wife contributed. 43     The wife’s position is that when the parties bought the first property in 1989, she contributed $6,693.17 from her CPF account towards the down payment. The husband serviced the mortgage loan with his CPF and in cash until the first property was sold in 2005 at a net profit of $1,517,247.15. The proceeds were then used to purchase the Home. The purchase was financed by a lump sum of $901,000 from the husband’s CPF account, a housing loan of $1.5m and the balance came from the parties’ joint account which included the proceeds of sale of the first property. Thereafter, the wife contributed $1,300 per month from her CPF towards payment of the mortgage loan until May 2009. From June 2009, she paid $855 a month instead. The wife did not state what her total payment was. The balance of the mortgage loan instalments were paid by the husband in cash and from his CPF account. 44     The husband’s position was that the wife had contributed only $6,693.17 from her CPF account towards the purchase of the first property whilst he had contributed $832,062.71 from his CPF account and also paid monthly mortgage payments in cash. He said that when the first property was sold, the CPF contributions of the parties were transferred towards the acquisition of the Home. Altogether the lump sum contribution from his CPF account was $901,000. As at 31 December 2010, he had used $967,188.40 from his CPF account towards the acquisition of the Home. He had also paid some $50,000 in renovation expenses. 45     The husband calculated that in terms of direct financial contributions, the wife had contributed 0.1% to the purchase of the Home while he had contributed 99.9%. This calculation was made on the basis that the wife’s only contribution was the $6,693.17 lump sum from her CPF account and that subsequent monthly instalments towards the mortgage had to be credited to him although they were made from her account. The husband said that, as a tax saving device, one of his companies had employed the wife as a director and had declared a monthly salary of $4,500 as being payable to her and had on this basis contributed $720 a month into her CPF account. The wife, he said, was well aware at all times that she would not be paid the salary as such and that this had been the arrangement between them since the companies were incorporated in 2008. 46     InNK v NL[2007] 3 SLR(R) 743 (“NK v NL”), the Court of Appeal gave guidance as to how contributions to the acquisition of a matrimonial home should be assessed. In that case, in 1993, the parties had purchased the matrimonial home in their joint names at the price of $1.31m. The matrimonial home was financed partly by ploughing in profits made from the sale of two earlier properties that the parties had owned as joint tenants. The wife contended that the total profits from the sale of these two properties amounted to $400,000 and these profits were ploughed back into the purchase of the matrimonial home. In addition, the husband contributed $440,332.55 (33.6% of the purchase price) from his CPF savings while the wife contributed $94,200 (about 7.19% of the purchase price) from her CPF account. The remainder of the price was financed with a bank loan which the husband subsequently paid back in full. On appeal, it was argued that the trial judge had failed to give the wife sufficient credit in relation to the acquisition of the matrimonial home because he had not taken into account the $400,000 profit that was realised from the sale of the previous properties. The Court of Appeal observed that this was undoubtedly a factor to be taken into account in determining a fair and equitable division of the matrimonial home. The judge’s award of 20% of the matrimonial home to the wife comprising approximately 8% direct financial contribution and 15% indirect financial contribution did not take adequate account of the profits (from the previous sales) to which the wife was entitled. In the result, the Court of Appeal was of the view that having regard to the reinvested profits and the wife’s indirect contributions, she should be awarded 40% of the matrimonial home. 47     In this case, the profits from the sale of the first property amounted to approximately $1.5m and the wife’s share of this profit has to be considered as part of her financial contribution to the acquisition of the Home. Whilst the wife had contributed only $6,693.17 directly to the first property, her interest in the profits from that property would have been greater than her direct financial contribution as her indirect contributions to the welfare of the family would also have to be factored in. By 2005, the parties had been married for some 15 years and had two children. Accordingly, although it may be difficult to quantify exactly what the wife’s share of the profit was, it would have, if assessed at that time, been much higher than her direct financial contribution would have indicated. This is a factor for me to bear in mind when it comes to distribution. 48     Further, as far as I am concerned, if the wife was declared to be a director of the husband’s company and declared to be entitled to a monthly salary of $4,500 then the CPF paid on that salary was the wife’s money, not the husband’s. It is irrelevant that the company earned its income from providing the husband’s medical services. The husband considered it beneficial to him to operate his company in this way (ieusing the wife as a director in name only) and it would be, in my opinion, unfair to give him both the benefit of the arrangement and the benefit of the wife’s CPF contributions. The wife must therefore be given credit for her CPF contributions towards the mortgage loan. 49     The next issue is the value of the Home. The wife gave me estimates. The husband, on the other hand, provided a valuation report giving a valuation of $8.5m as at 31 October 2011. He stated that as at 31 May 2010, the outstanding mortgage loan was $722,000. Using the figures given by the husband which I accept, the net value of the Home would have been around $7,778,000 in February 2011. 50     The total value of all matrimonial assets would be: 1Wife’s assets$1,794,430.702Husband’s assets$6,870,710.723Joint assets(a)  $443,009.01(b)  $7,778,000Total$16,886,150.43 rounded down to $16,886,150.",
        "Parties’ submissions on division": "51     The husband’s original proposal was that the wife be awarded 20% of the matrimonial assets in his possession or control, apart from the Home, as these assets had been acquired by him alone. In this calculation, he included the sum of $443,009.01,ie, the net proceeds of sale of the Icon unit which would bring the total value of his assets to $7,313,719.73. If he had maintained this offer, the wife would have been entitled to $1,462,743.95 being 20% of the assets in the husband’s hands. In March 2012, the husband also argued that this amount should be set-off against the assets in the wife’s hands and that she should give him 20% ($78,500) of her share of the shophouse on the basis of his non-financial contributions to the marriage. 52     At the hearing before me in April this year, however, the husband changed his position and he is now willing for the wife to keep all the assets in her hands. He has also given up his previous claim to 20% of the value of the wife’s share in the shophouse. On this basis, in respect of matrimonial assets other than the Home, the wife would keep the sum of $1,794,430.70 (including her watches and jewellery) while the husband would retain assets valued at $7,313,719.73 (including his watches). 53     As for the Home, the husband’s proposal is that the wife be given a 30% share of its market value as at mid-May 2010 less the outstanding mortgage of $722,000. He calculated the net value as $7,778,000. Therefore, he would be willing to pay the wife $2,334,000 to buy her out and keep the Home as a home for their sons and himself. In total, on the husband’s proposal, the wife would get some $4,127,830.70 which would be equivalent to slightly less than 25% of the total value of the matrimonial assets. 54     The husband contended that in the determination of the division of assets, the court should have regard to the fact that the marriage had broken down irretrievably by mid-2010 for the reasons I have enumerated in [30] above. He asserted that the wife’s non-financial contributions had ended then and that he had taken over the non-monetary aspects of the household management for the children and himself. He has also been the one dealing with the sons’ educational issues. 55     The husband submitted that the classification method of division of matrimonial assets set out inNK v NLbe applied in this case as it would be fair and equitable. It was held in that case that in the attribution of indirect contributions to the division of matrimonial assets, there were two distinct methods that could be employed. The first, the global assessment method, required a calculation of the net value of all matrimonial assets followed by a just and equitable division in the light of all the circumstances of the case. The other, the classification method, required a separation of the matrimonial assets into classes with individual apportionments for each class. The methodology that led to a just and equitable division should be applied, although, in the vast majority of cases either method would likely achieve the same result. 56     The husband gave the following reasons for his submission that the classification method was the correct one to adopt here: 1    The wife had contributed only $4,400 excluding interest to the purchase of the first property and upon the sale of this house her CPF monies were first refunded with interest to her CPF account and then transferred towards the payment of the Home. In percentage terms her direct financial contribution was less than 1%. 2    The other assets in the wife’s possession, including the sum of $883,000 odd taken by the wife in 2009 had been acquired by the husband alone. The wife had caused a loss in the BNP account by liquidating the investment in October 2009 so as to be able to withdraw cash. 3    The husband had put up all the money for the investments made by the parties. The wife had recommended only one of the investments while the husband had initiated the other three. 4    Of the assets in the wife’s possession and control, only the shophouse and her insurance policies had been acquired by her sole efforts. Her CPF contributions had, effectively, been made by him and he had paid for the car she drove as well as the car he drove but that was registered in her name. 57     InNK v NLitself, the Court of Appeal observed at [33] that the paramount aim of either method was to ensure that the matrimonial assets concerned were divided in ajustandequitablemanner. Therefore, the court conducting the exercise should adopt the method that led to that result. In the case ofNK v NL, the court adopted the classification method because: 1    the circumstances of the case, in particular, the adverse inference drawn against the husband regarding the quantum of cash assets available for distribution, required the court to consider the matrimonial home and the remaining matrimonial assets separately; and 2    of the need to give full credit and value to indirect contributions. Thus, before I can decide which is the appropriate method to adopt in this case I need to consider the circumstances. 58     The husband’s position is that the wife made no indirect financial contributions towards the family expenses. He said that the outgoings and maintenance of the matrimonial homes had been borne by him alone. He had also solely financed all renovations and improvements undertaken to the properties. He said that he had never demanded that the wife should share the household and family expenses. Instead, he had given her $10,000 a month to be used for the family’s expenses and this had continued up till July 2010. It was only then that he took over management of the household finances. 59     The husband asserted that the wife had taken household items, including expensive crystal ware and crockery from the Home to hide them in the shophouse. She had claimed that these were paid for solely by her and should belong to her only. The husband contended that as these items were matrimonial assets, the court should draw an adverse inference against the wife. Further, she was continuing to remove household items from the Home which the husband had to replace. The husband asked the court to take this conduct into account as the items taken by her had cost thousands of dollars and by removing the items she had deprived the husband and sons of the use of the same. 60     The husband argued that the wife’s non-financial contributions were not extensive. He disagreed that she had helped obtain the mortgage loan for the first property and asserted that it was his determination and industry which had led to the high standard of living that the family enjoyed. He had worked hard for himself and the family for 20 years. Whilst the wife had claimed to have switched over to part-time work for the sake of the first son, the husband contended that she worked part-time because she had a shared clinic and was also freelancing as a locum in another clinic. The husband had taken full financial responsibility for the family and he did not ask the wife to work part-time as they had hired a maid during her pregnancy and arranged with his mother and his mother’s maid to babysit when the child was born. 61     According to the husband, the first son was looked after by the maid and his mother. Food was cooked at his mother’s house and either eaten there or taken back by him to the matrimonial home. This lifestyle continued after the birth of the second son until about 2006. From the husband’s point of view, until they moved into the Home, his mother contributed substantially to care of the family. After the parties moved into the Home, the housework and cooking was done by the maids. The wife never cooked a meal for the family. 62     The husband developed hobbies and taught his sons photography and how to use various IT gadgets. He took them to clubs to participate in various activities. He also often entertained at home and encouraged the children to join these functions. The wife developed her own hobbies over the years which were different from those of the husband. The parties grew apart except for family activities and holidays. 63     Despite his submissions on how family life had been conducted, the husband said that he did not doubt that the wife had made non-financial contributions during the marriage. He also urged the court not to discount his own contributions. He believed that he had been a good father and was a reasonable husband who made no demands on the wife. His offer of 30% of the net value of the Home and 20% of all other assets for the wife’s non-financial contributions was fair and equitable. 64     The wife’s proposal was for an equal division of assets. She contended that this would be just and equitable because of: 1    the long marriage of 20 years; 2    her indirect contributions; and 3    the lack of full and frank disclosure on the part of the husband. 65     The wife asserted that her contributions had been under-estimated by the husband. The wife had worked full-time for nine years and she reduced her work to three days a week after the first son was born so that she could care for the family. The wife asserted that throughout the marriage she had paid for household expenses and maintenance of the home. This included groceries, marketing and house repairs. She also looked after the children’s expenses including their clothes, toys and enrichment classes, pocket money and tuition fees. The maids’ expenses were paid by her throughout the marriage and it was she who supervised the maids and arranged for them to learn how to cook. In 2009, the wife had had only $6,000 in savings as most of her income had gone towards the family. 66     Whilst the husband paid for the renovations of the first property, the wife had supervised all the work that was done. She was entirely responsible for the major upgrading and aesthetic makeover of the house. When the Home was bought, she became involved in the interior design and décor of the house. She liaised with the interior designers and helped choose the furniture and furnishings. After the family moved in, whenever there were problems in the house like roof leaks, electrical problems and so forth, she managed them on her own without help from the husband. 67     After B was born, the wife supervised the maid and on the days that she did not work, she stayed home to look after him. In due course, she also looked after the second son. She took care of both children when they were ill. As the boys grew older, she enrolled them for nursery, kindergarten and enrichment classes and supervised their studies and emotional and social development. She also volunteered at a primary school for two years in order to obtain a primary one place in the school for B. The wife asserted that for the family she put her social life on hold and spent her weekends and public holidays with the husband and the boys. Her overseas trips were all family holidays and she planned the trips and packed for everyone. The wife also managed the household expenses until August 2010. 68     Apart from her care for the sons, the wife performed wifely duties. She assisted the husband in entertaining at the Home, she helped in the renovations of his clinic and she also discussed investments with him. She carried out chores like depositing his cash earnings in the bank on a weekly basis. The husband would discuss the problems he faced with his staff with her and she would give him advice. She also helped him manage the welfare of his staff. 69     The wife explained why she had withdrawn cash from the BNP account. She stated that when she found out that the husband was having an affair in 2009 she became anxious because she had only $6,000 left in her personal savings account. She was extremely worried about the children and her future and was concerned that the husband might abandon them and squander his money on his girlfriend. I should mention that the husband did not accept this explanation. His position was that the wife was not authorised to withdraw the funds unilaterally and that he had supported the household and continued to do so although in July 2010 he stopped giving money to the wife for this purpose and took over direct administration of the household expenses. He had also given the wife $100,000 for expenses when she told him that her savings were almost exhausted. 70     In support of her case on her indirect contributions to the marriage, the wife pointed out that the husband had admitted: 1    When he decided to set up his own clinic in 2005, he had the wife’s support even though he had told her there was a possibility that things might not work out and his income might drop. 2    When he first started his clinic, the wife would assist him by depositing his daily cash earnings in the bank and this had gone on for a few months. 3    She was involved in the design of the clinic and its renovation though he said that her involvement was limited to liaising with the interior designer while he chose the design and decided on the budget. 4    She did refer patients to him. 5    He entertained at home quite often and the wife had helped on these occasions though his position was that the majority of the work was done by the maids and the caterers. 71     The wife asserted that the husband had not made full and frank disclosure. In his first affidavit in relation to ancillary matters (“AOM”) made on 3 March 2011, the husband stated that he had a safe deposit box with a local bank. The wife then made a request for interrogatories asking that the husband disclose the contents of the box. On 27 April 2011, in purported response, the husband filed an affidavit in which he affirmed the box contained only watches, personal documents and some mementoes. In a subsequent affidavit filed some months later, the husband disclosed he had $600,000 in his safe deposit box. Later, in his third AOM (dated 30 November 2011), the husband admitted that the cash in his safe deposit box amounted to $1.35m as at February 2011. This money represented the profits from his companies paid out to him between 2008 and 2009 as well as the balance of cash each month as he usually withdrew more than he needed from his bank account for his household and personal expenses. 72     The wife submitted that the husband had lied three times under oath,ie, in his first AOM, in the affidavit of 27 April 2011 and in the third AOM. On that basis, she asserted he may have concealed other assets. She pointed out that he did not disclose his investments with his friend, Dr Lim, and his investment with his brother in a solar energy company, until his third AOM. These disclosures came only after the wife queried him about his investments on the basis of documents she had found. The wife asked for an adverse inference to be drawn against the husband.",
        "My decision": "73     I have come to the conclusion that the classification method as set out inNK v NLshould be applied in this case though not precisely for the reasons given by the husband. My reason for dividing the assets into two classes,ie, the Home and the other assets, are as follows. First, the wife’s direct contributions to the Home have to be considered separately because of the matters mentioned in [47] above,ie, the fact that her share of the profits from the first property would have to be accounted as part of her direct contribution to the Home. Second, in relation to the wife’s indirect contributions, apart from her care of the children, most of such contributions were in relation to the Home and the maintenance of the family. Third, the husband was not completely forthcoming in relation to disclosure of his assets. In his first AOM, he did not disclose the cash in the safe deposit box and it was not until his third AOM that the full amount was revealed. There was also the husband’s failure to disclose the investments mentioned in [72] above. There is therefore a question as to whether an adverse inference should be drawn against the husband though an inference, if drawn, would not relate to the Home but only to the other assets.",
        "The Home": "74     In relation to the Home, as I have pointed out above, it is not possible to mathematically calculate the wife’s direct financial contribution as I do not have full figures. Further, the husband’s calculation recognised only the wife’s initial CPF contribution. Neither of the parties provided a calculation that included the wife’s share of the profits of the first property and the wife’s contributions from her CPF account towards repayment of the mortgage loan on the Home. I have considered the wife’s indirect contribution to the marriage. I am satisfied that the wife made significant contributions to the care of the family especially in relation to the upbringing of the two children. Once the children were born she gave up the full-time practice she had carried on for nine years so that she could be more involved in their up-bringing. Whilst she did have help from her mother-in-law and the maids, I am satisfied that she was a devoted mother who put her children first. Her income earning capacity and career development took a back seat to the family. The husband’s suggestion that there were care arrangements in place and the wife could have continued to work full-time was a disingenuous one. He must have been aware of the benefit his sons derived from the attentions of a loving and educated mother. The wife also contributed to the husband’s lifestyle by her participation in his entertainment, her care of the Home and her efforts in assisting him in setting up his clinic albeit these latter efforts only took place for a year or so. The wife also managed the Home and trained the domestic staff. The husband took over the financial management of the Home only in August 2010. I accept that the financial expenses of the family were borne by the husband to quite a large degree but the wife made reasonable contributions in this regard. The wife’s contribution may have been lower than the husband’s but as she worked part-time, her income was also very much lower than his. Even before the husband left government service, he was earning between $900,000 and $1m a year. His income increased further once he went out into private practice. It was therefore natural that he shouldered most of the financial burden for the acquisition of the expensive assets. 75     Having considered the length of the marriage, the wife’s direct financial contributions and her indirect contributions in the form of paying for items like groceries and the children’s tuition fees from her own funds as well as managing the housekeeping money the husband provided from time to time and also her care of the family, it is in my judgment equitable to award the wife a 50% share of the Home.",
        "Other assets": "76     I now come to the other assets. The total value of the other assets using the figures in [50] but excluding the value of the Home would be $9,108,150.43. Of this sum, the amount acquired by the wife’s sole efforts would be $617,674.38 (ie, her share in the shophouse, her CPF balances and her insurance policies) which is equivalent to just under 7% of the total value of the other assets. In all the circumstances, it would be just and equitable to award the wife a further 30% for her non-financial contributions to the marriage. In coming to this conclusion, whilst I have considered the husband’s non-financial contributions, I have paid more attention to the husband’s proven lack of adherence to the standards of full and frank disclosure. I therefore added an extra 5% when computing the share awarded to the wife to cover the possibility that the husband may have other assets which he has not disclosed. Some of his disclosures were made only because of the wife’s detective work. The total that the wife is entitled to therefore would be 37% of the other assets,ie, $3,370,015.66 or to round it up, $3,370,016. In respect of the other assets, the husband shall pay the wife the difference between $3,370,016 and $1,794,430.70 within three months of the date hereof. 77     As for the Home, the husband shall have the option to acquire the wife’s 50% share by paying her 50% of the current market value of the same (less the outstanding mortgage amount as at 1 February 2011). I use the current value because the parties should share any appreciation or depreciation in the value of the Home that has taken place since February 2011. It would not be equitable for one party to get the full benefit of any appreciation or bear the full loss arising from any depreciation in value. 78     The parties shall jointly appoint a valuer within four weeks hereof. The husband shall exercise his option within one month of the issue of the valuation report and the acquisition of the wife’s share shall be completed within four months thereof. If the husband does not wish to acquire the wife’s share, the Home shall be sold in the open market and the net proceeds after payment of all expenses and mortgage loan and after refunding to the husband the difference between the amount of the mortgage loan outstanding on 1 February 2011 and the amount outstanding on the date of the sale, shall be divided equally between the parties. Each party shall refund his/her CPF account from his/her proceeds of the sale. 79     In coming to my conclusion as to division, I have been guided by cases such asAFS v AFU[2011] 3 SLR 275,Ng Ah Yiew v Goh Chai Seng[2011] SGHC 217,ATT v ATS[2012] 2 SLR 859 andNK v NLitself.",
        "Maintenance": "The wife’s maintenance 80     The Judge made a maintenance order in favour of the wife on 27 April 2012. He awarded her $12,169 a month. On 17 January this year, the Court of Appeal ordered that that order should stand as an interim maintenance order pending the disposal of the ancillary matters by another judge. Thus, when the parties appeared before me, they addressed the issue of maintenance post-divorce afresh. 81     Both parties agree that the maintenance award should be a lump sum figure. They, naturally, disagree on the quantum of that lump sum. The husband’s position is that the wife should be awarded a lump sum of $180,000 being $1,500 a month for ten years. She would get to keep her own earnings of $7,000 each month and would not be asked to contribute to the sons’ expenses. The wife, however, wants $2.3m based on $12,000 a month for 16 years. The wife calculated that she earned about $6,372.25 a month based on her notices of assessment for 2008 and 2009 while the husband earned about $150,000 a month. The husband confirmed that in 2010 his monthly income was $125,000. 82     First, I deal with the multiplier. The husband did not cite any authority to justify his proposal of ten years. As for the wife, she relied onNg Ngah Len @ Datin Sandra Kauh v Kuah Tian Nam @ Dato Peter Kuah[2003] SGHC 109 (“Datin Sandra Kauh”) where I had fixed a multiplier of 16 in respect of a husband who was a 52 year old businessman and a wife who was a 46 year old housewife. The marriage lasted 21 years. In arriving at 16 years, I had referred to the case ofOng Chen Leng v Tan Sau Poo[1993] 2 SLR(R) 545 (“Ong Chen Leng”). That case established the proposition that for the calculation of lump sum maintenance a straight line calculation should be used,ie, taking a compromise between the average life expectancy of a Singapore woman (then 70 years) and the usual retirement age (65 years) of a Singapore male worker less the wife’s present age. InDatin Sandra Kauh, the calculation would have resulted in a multiplier of 21.5 but I reduced it to 16 on the basis that early receipt of the funds and careful stewardship thereof would provide adequate maintenance for the wife. 83     The principle established inOng Chen Lengwas recently endorsed and updated by the Court of Appeal. InWan Lai Cheng v Quek Seow Kee and another appeal and another matter[2012] 4 SLR 405 (“Wan Lai Cheng”), the parties were both aged 66 and had been married for 36 years at the time of the interim judgment for divorce. Dealing with the issue of maintenance, Phang JA (with whom the other members of the coram agreed on this issue) applied the method of quantifying an appropriate multiplier for a lump sum award set out inOng Chen Leng. He noted, however, that the average life expectancy of women in Singapore is now 85 years based on figures released in 2011 by the Department of Statistics Singapore. Using this method, inWan Lai Chengitself, the multiplier would have been nine years as calculated by the formula [(85 + 65) ÷ 2] – 66. Phang JA accepted the new life expectancy figure but used eight years rather than nine as the multiplier because that was the multiplier sought by the wife. 84     In the present case, if theOng Chen Lengformula as revised byWan Lai Chengis used, the multiplier would be 25. The wife has however discounted that figure further by asking for 16 years instead. I consider this reasonable in the circumstances where the wife is a professional in private practice and capable of working until 65 or even 70. As the wife has no major health issues, she can set her own timetable for retirement. 85     I now move to the multiplicand. The wife based her multiplicand of $12,000 on total monthly expenditure of $18,541.88 less her average gross monthly income of $6,372.25 which gave her a deficit of $12,169.93. The detailed figures were presented to me during the hearing and I heard submissions from the husband’s counsel on which figures were considered to be exaggerations or not claimable. I have been through the figures again and have reassessed the wife’s reasonable expenditure. I was informed by her counsel that once the ancillary matters are settled, the wife intends to move out of the basement room in the Home and to acquire an apartment unit nearby where she can accommodate the younger son and be close enough to see the elder son frequently. 86     I have taken the wife’s plans into account and in my calculations have provided for a maid; food and utilities for three adults; and an estimate for property tax and conservancy and sinking fund charges. I have also considered the parties’ lifestyle (meaning the lifestyle they enjoyed prior to the breakdown of the marriage). The salient features of the same are that they lived in an expensive house in a good residential area; the parties had three cars (including a Lamborghini worth $740,000 driven by the husband); they entertained frequently and fairly lavishly with a free flow of alcohol and catered food; they planned to give their sons an overseas education; in 2010 the husband gave the wife $10,000 a month for household expenses; the husband was frequently out clubbing and was part of a racing club; and after 2005 when they travelled, they did so mainly in business class. The husband did not stint on his personal expenditure either as can be seen from his collection of watches which cost about $244,000 and his estimated monthly expenditure of $5,000 on entertainment, $4,000 on travel and $500 on grooming. 87     In my judgment, reasonable monthly expenditure for the wife would be in the region of $13,588.41. This figure is made up as follows: HOUSEHOLD EXPENSES$1Marketing for three adults including a maid750.002Groceries750.003Vitamins and health supplements100.004Newspaper30.005Maintenance of air-conditioners50.006Dry cleaning of household items and replacement of curtains40.007Eating out1,000.008Cooking gas50.009Utilities500.0010Outings and entertainment750.0011Property tax150.0012Conservancy fee and service charge300.0013Maid’s expenses (salary, medical, agent etc)1,000.00TOTAL5,470.00CAR EXPENSES1Petrol500.002Road tax170.003Parking coupons and parking150.004Insurance170.005Car repair/maintenance200.006Changing of tyres50.007Viacom expenses6.41TOTAL1,246.41PERSONAL EXPENSES1Massage/Spa300.002Manicure and pedicure100.003Medisave420.004Personal income tax300.005Medical checkups83.006Handphone150.007Haircut170.008Clothes1,250.009Safe deposit box120.0010Skin care/cosmetics etc700.0011Dry cleaning of clothes100.0012Allowance to parents1,000.0013Presents250.0014Travel1,250.0015Singing lessons379.0016Exercise300.00TOTAL6,872.00   88     Taking the wife’s monthly expenses as being $13,500 per month, once her own income of $6,372.25 is deducted, the shortfall would be $7,216.16. I would round this down to $7,200 a month. Using the multiplier of 16 years means that the lump sum maintenance would come up to $1,382,400. I think that this is fair and equitable in all the circumstances. The wife is still fairly young and the children are grown up and do not need her to be at home during the day time. She can therefore go back to full-time practice if she wishes to enjoy a more luxurious lifestyle. She also has a decent nest-egg from the division of the matrimonial assets. As for the husband, this award represents less than a year’s income. It is eminently affordable. The sons’ maintenance 89     The husband is willing to provide complete support for both his sons. In view of this commitment, I will not make a maintenance order for C although he will be living with the wife. The wife can pay for C’s food at home and his utilities whilst the husband can provide the rest, including but not limited to C’s pocket money, transport, clothing, medical and educational expenses. In the event that the husband does not support C or supports him inadequately, the relevant application can be made.",
        "Conclusion": "90     In summary, I make the following orders: 1    the wife is granted care and control of the younger son, C; 2    the husband shall have access to C as follows: (i)       overnight access from Friday evening to 9pm on Sunday night on alternate weekends; (ii)       whenever C is free and willing to see him as long as C is back by 9pm; (iii)       upon giving the wife one month’s prior notice, during one overseas holiday of up to two weeks each year and during two shorter overseas holidays of up to five days each time; 3    the Home is to be divided between the parties equally with the husband being given the option to buy out the wife’s interest therein on the terms set out in [77] and [78]; 4    the other matrimonial assets are to be divided in the proportions 37:63 in favour of the husband and the husband shall pay the wife the sum of $1,575,585 (rounded up) (per [76] above) within three months of today; and 5    the husband shall pay the wife lump sum maintenance of $1,382,400 within three months of today. 91     The parties have fought long and hard over the ancillary matters and there have been many interlocutory applications. I will hear them on the appropriate costs order. At such hearing, I would like counsel to be prepared with details of expenditure incurred in respect of each interlocutory application made by each of them insofar as the costs of such application have not yet been dealt with."
    }
}