{
    "case_title": "Wong Kien Keong\n      v\n      Khoo Hoon Eng",
    "ncitation": "[2013] SGHC 275",
    "coram": "Belinda Ang Saw Ean J",
    "sections": {
        "Introduction": "1       These are the ancillary proceedings in a long-running acrimonious dispute between the parties following the execution of a deed of separation dated 28 March 2003 (“the Deed”) and their subsequent divorce three years later. Of primary concern in these ancillary proceedings is the approach the court should take towards enforceable deeds of separation as well as the weight that should be accorded to a deed of separation under s 112(2) of the Women’s Charter (Cap 353, 1997 Rev Ed) (“the Charter”). 2       The parties, Mr Wong Kien Keong (“the Plaintiff”) and Mdm Khoo Hoon Eng (“the Defendant”), divorced after a marriage of more than 28 years. The Plaintiff is a lawyer, while the Defendant is an associate professor at the National University of Singapore (“NUS”). As of 2013, the Plaintiff is 61 years old while the Defendant is 62 years old. The children of the marriage, two sons, are now adults. 3       On 12 March 2003, the Defendant moved out of the matrimonial home to live in an apartment at Aspen Heights. Shortly thereafter, the parties signed the Deed. 4       After the Deed was executed, the Defendant commenced divorce proceedings on 29 June 2004, which were later discontinued on 20 March 2006. The Plaintiff then filed for divorce based on three years of separation. Thedecree nisiof 28 May 2006 was made absolute on 13 May 2011, before ancillary proceedings were completed. 5       In the meantime, the hearing of ancillary matters was delayed by the Defendant’s applicationvideSummons No 1553 of 2011 filed on 8 April 2011 to set aside the Deed. Her application was dismissed on 21 March 2012 (seeWong Kien Keong v Khoo Hoon Eng[2012] SGHC 127 (“the 2012 Judgment”)). The Defendant appealed against my decision in Civil Appeal No 32 of 2012 (“CA 32/2012”). The Court of Appeal ordered CA 32/2012 to be stayed until the ancillary proceedings were completed as it was envisaged that the prospect of an appeal against orders made in the ancillary proceedings was likely, and in the interest of expediency, all related appeals should to be heard at the same time. 6       The parties duly proceeded with the ancillary proceedings for the division of matrimonial assets, with the matter listed for hearing on 2 October 2012. By this time, some nine years had elapsed since the signing of the Deed, and six years from thedecree nisi.The ancillary issue of division of matrimonial assets was the main area of contention between the parties. After four intermittent days of hearing, I reserved judgment. 7       The ancillary proceedings were made difficult by extensive discovery applications and interrogatories, numerous voluminous affidavits, and the various written submissions covering the different positions taken from time to time as the Defendant adjusted her case along the way.",
        "The parties’ arguments on division of the matrimonial assets": "8       The Plaintiff’s case was that the Deed should be given full weight in which case an order adopting the terms of the Deed should be granted. He maintained that the Deed was exceedingly fair and just when it was made. He relied on his expert’s report to show that the Defendant stood to receive 44% of the assets as at 12 March 2003.[note: 1]The Plaintiff’s counsel, Mr Randolph Khoo (“Mr Khoo”), emphasised that this percentage division of 44% of the matrimonial assets comprised in the Deed for the Defendant was higher than the range of percentages between 35% and 40% derived from cases that broadly shared the same facts.[note: 2] 9       In contrast, the Defendant’s position was that no weight should be given to the Deed. On its face, the Defendant was given only one out of the five immoveable properties in Singapore, and one out of seven immoveable properties in Malaysia. Counsel for the Defendant, Ms Suchitra Ragupathy (“Ms Ragupathy”) argued that a fair and equitable division would be to give the Defendant 60% of all the immovable matrimonial assets as compared to what she was given under the Deed which was allegedly a mere 18% of all the matrimonial assets. Ms Ragupathy also complained of the Plaintiff’s failure to make full and frank disclosure. For instance, she referred to the Plaintiff’s retirement benefits that were not included in the list of matrimonial assets under the Deed, and relied on the omission to support her contention that the agreed division under the Deed was unfair and inequitable to the Defendant. I will deal with this contention in due course. 10     A related issue is the appropriate date of valuation of the matrimonial assets. The Plaintiff contended that the appropriate date of valuation should be 12 March 2003 when the Defendant moved out of the matrimonial home to live on her own, since their divorce was granted on the basis of 3 years’ separation from that date. In contrast, the Defendant argued for a later date, 2 October 2012, being the start of the hearing of the ancillary matters. Mr Khoo disagreed with Ms Ragupathy’s choice of dates. His contention was that the unwarranted litigation had prolonged the dispute to the point of obscuring the reality that the marriage had long since ended.[note: 3]He accused the Defendant of skewing the facts by using 2012 valuations which were much higher (as compared to 2003) to give an inaccurate picture of the Deed made in 2003.",
        "Overview of this judgment": "11     In this judgment, I shall examine the court’s approach to post-nuptial agreements in Singapore. The Deed was upheld in the 2012 Judgment and as such, the existence of the Deed is one of the factors to be taken into account under s 112(2) of the Charter. As a first step to determining the weight to be accorded to the Deed, the court looks at the percentage division of the matrimonial assets under the Deed. 12     In addition, the Deed would be scrutinised in light of the other factors set out in s 112(2). If a consideration of the other relevant factors and circumstances show that the division prescribed under the Deed is unfair, the division under the Deed is unlikely to be accorded any weight whatsoever and it will be disregarded from the court’s assessment of a fair and equitable award for the parties. However, this is not the only approach that the court can take. A mixture of fact and the exercise of discretion may justify a different approach, as was the case inAFS v AFU[2011] 3 SLR 275. I will be discussing this case later in the judgment. 13     As a related observation, where parties have failed to point towards any form of inequity in the s 112(2)(e) agreement, the court is not likely to substitute its own discretion or judgment for that of the parties, and will instead seek to uphold the agreement. Where parties have agreed to comprehensively and conclusively organise their financial arrangements after or in contemplation of their separation, there would be no good reason why such an agreement should not be given full weight. This approach was first observed inWong Kam Fong Anne v Ang Ann Liang[1992] 3 SLR(R) 902 where Michael Hwang JC considered the court’s exercise of its powers under s 106(1) of the Women's Charter (Cap 353, 1985 Rev Ed) (now s 112(1) of the Charter) in relation to an agreement made by the parties prior to their divorce concerning the disposal of their matrimonial assets. While s 106(2) did not contain a provision similar to s 112(2)(e) of the Charter, Hwang JC’s observations are useful in highlighting the importance of exercising caution when interfering with a s 112(2)(e) agreement. At [36]: The deed was therefore intended as a comprehensive financial and property settlement between the parties.The deed was made at a time when the parties had already been separated, and divorce was viewed as a real possibility, although not necessarily in the immediate future.Under these circumstances, I considered that the onus was on the husband, who was seeking to disclaim the effectiveness of the deed, to justify why the court should proceed to exercise its powers under s 106 in disregard of the express intentions of the parties made in contemplation of precisely the situation which had now arisen. [emphasis added] 14     Returning to the present case, a central factual question for me to decide is what percentage share in the division of the assets was ascribed to the Defendant by the Deed. For the further reasons explained in this judgment, the Defendant’s percentage share is 34% based on a computation of the March 2003 values of the assets that was determined to be S$8,307,351. 15     The court’s task is to make a fair and equitable award having regard to the assets that are determined to be matrimonial assets subject to division and the applicable valuation date or dates that are used to arrive at the total monetary value of the matrimonial assets. In so doing, I will give consideration to the Deed and all the other relevant factors in this case. On the facts and evidence, I find that the Plaintiff’s retirement benefits is a matrimonial asset that should be up for division and that a fair and equitable division for the Defendant is 40% of this adjusted pool of assets based largely on 2003 values.  In this respect, the ancillary orders that I make in this case do not discard but give effect to some of the terms in the Deed, and will also deal with how this 6% increase is to be provided for by the Plaintiff. 16     In this judgment, maintenance is discussed after the division of assets. The Defendant asked for maintenance if she was not successful in securing a division of 60% of the immovable matrimonial assets. It is not disputed that the Deed did not deal with maintenance. For the reasons below, there is justification for awarding the Defendant lump sum maintenance.",
        "The approach towards post-nuptial agreements": "17     In the division of the matrimonial assets, s 112(2) of the Charter requires the court to have regard to “all the circumstances of the case” including a non-exhaustive list of factors, of which s 112(2)(e) is of particular significance in this case. The non-exhaustive list of factors are: (a)    the extent of the contributions made by each party in money, property or work towards acquiring, improving or maintaining the matrimonial assets; (b)    any debt owing or obligation incurred or undertaken by either party for their joint benefit or for the benefit of any child of the marriage; (c)    the needs of the children (if any) of the marriage; (d)    the extent of the contributions made by each party to the welfare of the family, including looking after the home or caring for the family or any aged or infirm relative or dependant of either party; (e)    any agreement between the parties with respect to the ownership and division of the matrimonial assets made in contemplation of divorce; (f)    any period of rent-free occupation or other benefit enjoyed by one party in the matrimonial home to the exclusion of the other party; (g)    the giving of assistance or support by one party to the other party (whether or not of a material kind), including the giving of assistance or support which aids the other party in the carrying on of his or her occupation or business; and (h)    the matters referred to in section 114(1) so far as they are relevant. 18     The legal position in Singapore is now trite: the court has the overriding power to scrutinise the terms of both pre-nuptial and post-nuptial agreements (including deeds of separation) and will do so in accordance with the principles of justice, fairness and equity to both parties (seeTQ v TR and another appeal[2009] 2 SLR(R) 961 at [73]–[75]). InAOO v AON[2011] 4 SLR 1169, the Court of Appeal reiterated inobiterthat the approach towards the division of matrimonial assets set out inTQ v TR(a decision on pre-nuptial agreements) also applied to post-nuptial agreements (at [19]): On a related note, we would also observe that even agreements between parties in respect of thedivision of matrimonial propertyare not enforceable in and of themselves. The law governing agreements on division of matrimonial assets is well established: ultimate power is vested in the court in the case at hand to divide matrimonial assets in a proportion which is just and equitable. In particular, a postnuptial agreement between parties isonly one ofthe factors to be considered by court, and any such agreement cannot oust the jurisdiction of court. This is made clear by s 112 of the Act itself …. [emphasis in original] 19     Recently, Chao Hick Tin JA inAQS v AQR[2012] SGCA 3 reiterated the legal position at [35]: In any case, an agreement between the parties made in contemplation of divorce could not be decisive. It is only one of the factors listed in s112(2) of the Women’s Charter that the court must take into account as part of its overarching duty to reach a just and equitable division in light of all the circumstances of the case. This Court affirmed inTQ v TR and another appeal[2009] 2 SLR(R) 961 at [75] that even though post-nuptial agreements could be accorded more weight than pre-nuptial agreements, how much weight was to be allocated to a postnuptial must ultimately depend on the precise circumstances of the case. … 20     Mr Khoo relied onGranatino v Radmacher[2010] 3 WLR 1367 (“Granatino”) for the proposition that the court should defer to the wishes of the parties and be slow to interfere in a marital agreement, especially a separation agreement, unless there was a significant or material change in circumstances to diminish or eliminate the weight to be given to the marital agreement.[note: 4]Mr Khoo’s point was that when a separation agreement was put together with divorce in mind, in the absence of exceptional grounds amounting to a change of circumstances (and there was no suggestion of such a change in this case), the Deed should be accorded full weight. Specifically, the English Supreme Court inGranatinonoted at [65] that: … A separation agreement is designed to take effect immediately and to address the circumstances prevailing at the time that it is made, as well, of course, as those contemplated in the future. It will have regard to any children of the family, to the assets of husband and wife, to their incomes and to their pension rights. Thus it makes sense to look for a significant change of circumstances as the criterion justifying a departure from the agreement. 21     There are two other cases beforeGranatinothat dealt with the circumstances to be considered in determining the weight to be given to marital agreements. Ormrod LJ inEdgar v Edgar[1980] 1 WLR 1410 observed at 1417: To decide what weight should be given, in order to reach a just result, to a prior agreement not to claim a lump sum, regard must be had to the conduct of both parties, leading up to the prior agreement, and to their subsequent conduct, in consequence of it. It is not necessary in this connection to think in formal legal terms, such as misrepresentation or estoppel;allthe circumstances as they affect each of two human beings must be considered in the complex relationship of marriage. So, the circumstances surrounding the making of the agreement are relevant. Under pressure by one side, exploitation of a dominant position to secure an unreasonable advantage, inadequate knowledge, possibly bad legal advice, an important change of circumstances, unforeseen or overlooked at the time of making the agreement, are all relevant to the question of justice between the parties. Important too is the general proposition that formal agreements, properly and fairly arrived at with competent legal advice, should not be displaced unless there are good and substantial grounds for concluding that an injustice will be done by holding the parties to the terms of their agreement. There may well be other considerations which affect the justice of this case; the above list is not intended to be an exclusive catalogue. [emphasis in original] 22     Ormrod LJ’s observations became the basis of a test created by the Privy Council inMacLeod v MacLeod[2009] 3 WLR 437 (“MacLeod”) wherein the party claiming ancillary relief despite financial arrangements having been made must show a change in circumstances which would make these arrangements manifestly unjust, such as a failure to make proper provision for any child of the family, or that it is contrary to public policy to cast onto the public purse an obligation which ought properly to be shouldered within the family (see [41]). 23     The majority of the Supreme Court inGranatinoapproved the approach established inMacLeod. It must be noted that Baroness Hale of Richmond in her dissenting judgment inGranatinodisapproved of the majority introducing a presumption or starting point in favour of giving effect to a nuptial agreement untainted by vitiating factors as it was “an inadmissible judicial gloss” to do so (seeGranatinoat [166] and [169]). Instead, she preferred a test of fairness (at [169]): … The test to be applied to such an agreement, it seems to me, should be this: “Did each party freely enter into an agreement, intending it to have legal effect and with a full appreciation of its implications? If so, in the circumstances as they now are, would it be fair to hold them to their agreement?”That is very similar to the test proposed by the majority, but it seeks to avoid the “impermissible judicial gloss” of a presumption or starting point, while mitigating the rigours of theMacLeod v MacLeodtest in an appropriate case. It allows the court to give full weight to the agreement if it is fair to do so and I adhere to the view expressed inMacLeod v MacLeod[2010] 1 AC 298 that it can be entirely fair to hold the parties to their agreement even if the outcome is very different from what a court would order if they had not made it. … [emphasis added] 24     In my view, the majority’s approach inGranatino, which introduces a presumption in favour of giving full weight to a valid marital agreement, is inconsistent with the approach articulated inTQ v TRand reiterated by the Court of Appeal in subsequent cases. Indeed, the majority’s approach inGranatinocontradicts s 112 of the Charter which requires the court to take into account various factors and not to give priority to the existence of a marital agreement. 25     I do not accept Mr Khoo’s additional argument that a change of circumstances is the only criterion justifying a departure from the Deed. A change in circumstances, whether unforeseen or overlooked at the time of entering into the marital agreement, may be relevant in considering how much weight should be accorded to the agreement (see also the 2012 Judgment at [55]). However, it would most certainly not be theonlyrationale for departing from the agreement. Otherwise, the court would effectively be giving an overriding effect to the Deed, which as mentioned earlier, would be contradictory to s 112(2) of the Charter. For completeness, the recent Court of Appeal decision ofAYM v AYL[2013] 1 SLR 924 (although a case on s 112(4) of the Charter) made clear that not just any change in circumstance will suffice. At the very least, the new circumstance must be seen as so radical a change as to justify a variation of the consent order. Andrew Phang Boon Leong JA delivering the judgment of the appellate court said at [25]: … We are of the view that where new circumstances have emerged since the order was made whichso radically changethe situation so that to implement the order as originally made would be to implement something which is radically different from what was originally intended, this would amount to unworkability, and the court would make,inter alia, the necessary variation to deal with such unworkability. [emphasis in original] 26     At these ancillary proceedings, the court will have regard to the Deed in making the ancillary orders. The legislative intent of s 112(2)(e) is to give regard to a marital agreement that is fair and equitable. In the recent Court of Appeal case ofLian Hwee Choo Phebe v Tan Seng Ong[2013] 3 SLR 1162, the court remarked at [16]: It bears mention that if in any particular divorce proceedings it is established that an agreement falling within s 112(2)(e) exists, that agreement is only one of the factors the court has to consider when deciding how the matrimonial assets are to be divided. Depending on the circumstances, this may not be the main factor in the division. The parties and the Judge were fully aware of this aspect and the Judge noted at [55] of his judgment that his finding on the existence of the Agreement was not the end of the inquiry and the court would have to look at all the circumstances to determine how much weight to give to the Agreement. 27     In the later decision ofSita Jaswant Kaur v Surindar Singh s/o Jaswant Singh[2013] 4 SLR 838 (“Sita Jaswant Kuar”), Choo Han Teck J found that the settlement agreement that parties had signed after a mediation session was unjust and inequitable as it did not encompass all the matrimonial assets and the division was disadvantageous to the wife. Choo J observed at [6]: … In a division of matrimonial assets proceedings, the court is not merely enforcing an agreement or the resolution of a mediation; it is exercising its discretion under s 112(2), taking into account any agreement which may have been made and any other circumstances present, to determine what is a fair and equitable division. … 28     He thus concluded that a just and equitable division would be to give each party an equal share of the matrimonial assets.Sita Jaswant Kuarshowed that in a case of an unjust and inequitable agreement, the court can give little or no weight to the agreement and divide the assets as it deems fair and equitable. 29     Conversely, an alternative approach was adopted by Andrew Ang J inAFS v AFU. In that case, the husband and wife had entered into a deed of separation, in which one clause provided that the assets acquired by either party after the date of the deed would remain as assets of the acquiring party, while two recitals required full disclosure by both parties. The deed was entered into on 19 February 2003, and adecree nisiwas obtained on 28 April 2006. The ancillary proceedings came before Andrew Ang J only four years after thedecree nisiand orders were made on 25 November 2010. By this time, some seven years had already elapsed since the deed. Ang J observed at [18] that even if the agreement was not set aside, the court had liberty to decide that an agreement “ought not to apply if the court does not consider it just and equitable”. 30     Ang J found that it would be inequitable to the wife to hold both parties to the clause in question as the husband, in breach of the recitals, had failed to disclose his acquisition of shares worth some S$12m and S$985,000 as consideration thereof in the drawing up of the separation agreement, and had subsequently failed to comply with his duty of full and frank disclosure to the court. These shares and the consideration were found to be matrimonial assets which the wife would have had a share of had they been disclosed under the agreement. Therefore, Ang J awarded the wife a 25% share of the shares and the consideration, leaving undisturbed the wife’s earlier 50% share of the matrimonial assets under the agreement. In doing so, Ang J had given considerable weight to the agreement and had only tweaked specific parts of the agreement such that he could arrive at a just and equitable division in relation to the shares and the consideration. 31     How much weight the court accords to a marital agreement depends on the division under the agreement as well as the facts of the case, which means that not only the terms but also the parties’ conduct surrounding the making and the execution of the agreement would be scrutinised. In addition, the court will look at the marital agreement in light of the other factors set out in s 112(2). I propose to approach the problem here in the following manner. First, the starting point is to ascertain the manner of division under the Deed as this is necessary to determine how much weight should be accorded to it. Second, the Deed will be considered in light of the various factors listed under s 112(2) to arrive at a fair and equitable division.",
        "The 2012 Judgment": "32     I should mention again the 2012 Judgment where the standard vitiating factors that would negate the effect of the Deed were considered and rejected. There was no unworthy conduct giving cause to reduce or eliminate the weight to be attached to the Deed. Consequently, the reference to the parties’ conduct (at [31] above) should not be interpreted as re-opening the question of whether the Deed should be enforced. As stated, the issue of the parties’ conduct leading to the signing of the Deed was already addressed in the 2012 Judgment where I had found the Deed to be valid based on the following findings: (a)     The Defendant had appreciated the legal significance of the Deed (at [30]–[34]); (b)     The Defendant had received legal advice on the Deed (at [35]–[36]), and had even bargained with the Plaintiff for a larger division of 50% of the matrimonial assets (at [31] and [33]); (c)     The Defendant was not too affected or depressed to think clearly and rationally before signing the Deed (at [37]–[42]); (d)     The Defendant had not signed the Deed on the Plaintiff’s false promise of reconciliation (at [47]–[48]); and (e)     The Defendant’s ability to function normally at work was consistent with the evidence that at the material time she was not in either a depressive state or that she was mentally vulnerable (at [49]). I am thus minded not to dwell on the circumstances surrounding the making of the Deed even though Ms Ragupathy continued to press the point that the Defendant was depressed and was coerced into signing the Deed. 33     In this case, the contemporaneous documentation exhibited by the parties indicates how and why the division resulted. In an e-mail dated 21 March 2003, a few days before the Deed was signed, the Plaintiff informed the Defendant in no uncertain terms that he was giving her “more than a 20% split” of their matrimonial assets. This e-mail was written to the Defendant as a response to her letter which raised the argument that she was entitled to at least 50% of all the assets that were acquired during the marriage. In his e-mail, the Plaintiff wrote:[note: 5] I am very annoyed by your letter as I have stated over the phone. There is no split of 50% to you. I do not agree and will never agree. The only way for you to hope to achieve that is for us to have a full blown legal dispute over our matrimonial assets. … … Thirdly, I believe that if I split 20% of our total assets as of end 2002 to you, it would be a fair split. The proposal that I gave you had more than a 20% split. … …. The separation deed will be drafted. It will be binding. If you love me you do not fight with me and take what I think is fair. If you fight me you will lose me forever. 34     An earlier e-mail sheds light on the Plaintiff’s rationale for his proposal of more than a 20% split of the matrimonial assets. In his e-mail dated 6 March 2003, the Plaintiff set out his proposed financial arrangements for the separation and justified it in the following manner:[note: 6] … But I have to set out our financial agreement nevertheless, pending a formal agreement which we will sign … … The financial arrangements are fair in my view. First, you have lived a good life with me economically, materially and I believe intellectually. Secondly, I gave you an opportunity to come to Singapore and you achieved self-actualization, fulfilment… Thirdly, had we separated after your desertion to Meng Keat 16 years ago, you would not have lived as full a life as you did. … On my part, I acknowledge the contribution you have made to my life and the enrichment that I have had because of you. … If you wish to boil down the financial arrangements, you have gotten close to S$450,000 on Aspen Heights already in hand, plus S$100K now, plus another S$100K by end 2004 plus the down payment for your car … of about S$80K, plus the apartment in KL. Should I assist you to pay for the remainder of Aspen Heights, I would be giving you another S$450K. If you add up the worst case scenario, you have $630K immediately and perhaps another S$550K into the future, giving you a total of S$1,130,000 which is more than your life savings. Even S$630K would be more than your life savings. The apartment represents the proceeds of the bungalow sold and I have not counted it therefore. I also did not count the other cars which you drove and the fact that you lost no money on the investments in share that we both made (I am happy to absorb the losses as they were mainly my decisions). I also helped you furnished your apartment and of course let you have whatever you need to set you up. Of course, you should not forget that the boys are funded by me all the way through university and you need not worry about that. If we want to be really fair, you should bear half of that, but I am not asking you to. … I hope I have made myself reasonably transparent for you to see where I am coming from. Please take this as a statement of the reasons for the financial arrangements. … The same e-mail also stated that the Plaintiff would contribute to “half of the monthly instalment payments” for Aspen Heights. 35     The e-mails revealed the Plaintiff’s intentions quite clearly — that the Defendant would receive more than 20%, but not more than 50% of the matrimonial assets, and that this proposal was based on the Plaintiff’s sense of fairness and the Plaintiff’s financial ability to pay for the outstanding loans on the properties. The Defendant had eventually agreed to this arrangement as borne out by her signing of the Deed. Nevertheless, Mr Khoo argued that fairness should not be measured against the e-mail contents but on the objective basis of the parties’ gains from the separation which I will now turn to.[note: 7]",
        "The division under the Deed": "",
        "Matrimonial assets listed under the Deed": "36     Based on the Deed, the division of the matrimonial assets listed in the Deed were as follows: (a)The Plaintiff1.Real Estate1.1130 Tanjong Rhu Road, #12-01 Pebble Bay Four (“#12-01 Pebble Bay”)1.2130 Tanjong Rhu Road, #12-10 Pebble Bay Four (“#12-10 Pebble Bay”)1.3130 Tanjong Rhu Road, #10-01 Pebble Bay Four (“#10-01 Pebble Bay”)1.4B-18-02 Vista Kiara Condominium, 7 Jalan 1/61A Bukit Kiara, Kuala Lumpur (“H Vista Kiara”)1.51-12-9 Lanai Kiara Condominium, Jalan 1/61A Off Bukit Kiara, Kuala Lumpur (“Lanai Kiara”)1.6B-11-09 and B-11-10, Plaza Mont Kiara on Lot 1885 & 1886, Mukim Batu, Kuala Lumpur (“Plaza Mont Kiara”)1.7C10-3-2, Danau Permai Condo, Jalan 3/109F, Taman Desa, Kuala Lumpur (“Danau Permai Condo”)1.8Lot 62, Orchard Heights, Kerak, Pahang (“Orchard Heights”)2.Cash on Deposit or in Bank Account2.1All assets in account with ABN-AMRO Bank, Hong Kong2.2All Assets in account with UBS AG, 25/F One Exchange Square, 8 Connaught Place, Central, Hong Kong2.3Australian Dollar Fixed Deposit of AUD$162,336 (as at 25 November 2002) with the DBS Bank, Hong Kong2.4Any and all accounts held in the name of the Plaintiff with any bank or financial institution3.Investment Funds and Other Assets3.1All securities purchased under the Horizon Global Equity arranged by DBS Bank3.2All securities purchased under Eight Unit Trusts arranged by DBS Bank3.3All other assets held solely in the name of the Plaintiff(b)     The Defendant1.Real Properties1.1263 River Valley Road, #03-17 Aspen Heights (“Aspen Heights”)1.2B-08-01 Vista Kiara Condominium, 7 Jalan 1/61 A Bukit Kiara, Kuala Lumpur (“W Vista Kiara”)2.Cash on Deposit or in Bank Account2.1Any and all accounts held solely in the name of the Defendant with any bank or financial institution(c)     Assets held jointly by both parties1.Real Properties1.125 Leonie Hill #12-01, Leonie Gardens (“Leonie Hill”)2.Cash on Deposit or in Bank Account2.1Fixed 4-Year Term US Dollar Deposit by way of a principal sum of US$200,000 with the DBS Bank (the “Fixed Term Deposit”)37     Notably, the Deed did not provide for any specific valuations of the assets. The Deed also did not provide for a full particularisation of the matrimonial assets. These were points of contention between the parties and they will be elaborated upon below.38     The Deed provided for a further elaboration on part (c) which related to assets held jointly by the parties. The Leonie Hill property was the parties’ original matrimonial home which they bought in April 1993. The relevant portion of clause 2.3.1 relating to the Leonie Hill property stated that it was to be beneficially owned in proportion to the respective contributions of the Plaintiff to the Singapore Central Provident Fund (“CPF”) and the Defendant to the Academic Staff Provident Fund Scheme of the National University of Singapore (“ASPF”). Clause 2.31 also stated that:… The [Plaintiff] shall purchase from the [Defendant] her share of [the Leonie Hill property] subject to the approval of the CPF, ASPF and the DBS Bank, at a consideration equivalent to the redemption amount for the ASPF and the [Plaintiff] shall also assume the entire loan obligations to the DBS Bank including all monthly mortgage repayments without recourse to the [Defendant] upon such purchase. After the purchase of [the Leonie Hill property] by the [Plaintiff], it shall become a [part (a) asset] and all rights, benefits and liabilities in respect of [the Leonie Hill property] shall be enjoyed and/or borne by the [Plaintiff].39     By this clause, the Plaintiff was to purchase the Defendant’s beneficial ownership in the Leonie Hill property based on the Defendant’s contributions to her ASPF. The Defendant’s ASPF contributions amounted to S$437,834 before interest,[note: 8]while the Plaintiff’s contributions were S$603,100 before interest. As of March 2003, the Plaintiff would have had to pay $437,834 to the Defendant for her ASPF contributions.40     As for the Fixed Term Deposit, the Deed provided that this was to be shared equally between the Plaintiff and Defendant.41     The Deed also provided at clauses 2.4 and 2.5 that(a)     All assets and bank accounts held and all liabilities borne solely in the name of the Plaintiff or held jointly by the Plaintiff and the Defendant not listed in the Deed shall be owned or borne legally and beneficially by the Plaintiff; and(b)     All assets and bank accounts held and all liabilities borne solely in the name of the Defendant not listed in the Deed shall be owned or borne legally and beneficially by the Defendant.42     Additionally, under clause 3 of the Deed, the Plaintiff was to pay the Defendant an annual sum of S$100,000 for each year from 2003 to 2008 on top of a sum of S$100,000 to be paid on or before 3 March 2003. This amounts to a total of S$700,000.43     During the hearing before me,  Ms Ragupathy argued that a fair and equitable division would be to see the Defendant exit the marriage with 60% of all the immoveable properties as compared to what she was getting under the Deed which she maintained was a mere 18% of all the matrimonial assets. On the other hand, Mr Khoo argued that the Deed provided for a fair and equitable distribution as the Defendant would receive 44% of all the matrimonial assets.The value of the pool of assets under the Deed44     I note that the Deed does not mention the values of the total assets comprised in the pool and does not particularise the assets in the names of the respective parties. This gives rise to the problem of determining the precise asset pool and monetary value.. For this section alone, I will be relying on the values as of March 2003 as the Deed was signed on 28 March 2003.45     For the purposes of the ancillary proceedings, each side produced an accountant’s report to particularise the nature and value of the assets subject to division under the Deed. Suffice it to say, the Plaintiff’s expert, Cheng Soon Keong (“CSK”), calculated that the total value of the monetary assets under the Deed as S$6,225,549 to conclude that the Defendant was getting 44% of the pool of assets under the Deed as of March 2003. On the other hand, the Defendant’s expert, Loke Poh Keun (“LPK”), estimated a larger pool of matrimonial assets valued at S$16,950,520 as of 2010.[note: 9]It appears that LPK and CSK were working on different bases: LPK had included additional assets into the pool and had utilised later valuation dates than CSK. I note that LPK’s valuation dates were inappropriate in this exercise of determining the value of the assets and its division under a document that was signed in March 2003.46     I will now examine CSK’s figures and explain my conclusion that a 44% division to the Defendant was inaccurate.47     Mr Khoo attempted to show through CSK’s report that the Defendant was receiving a sum that entitled her to 44% of the matrimonial assets in 2003 and that this was a fair and equitable distribution of the assets. In this report, there were deductions totalling S$989,926 for tax liabilities, remittances and insurance payments for the children which resulted in a smaller pool of assets available for distribution. This approach is untenable. Notably, these deductions were for payment obligations after March 2003.[note: 10]Moreover, the balances in some of the bank accounts, which I will turn to later, were actually larger in March 2003 than what was stated in CSK’s report which contributed to the inflated figure of 44%. In these circumstances, the 44% share of the matrimonial assets was not sustainable.48     On a review of the evidence, I am of the view that the Defendant was given 34% under the Deed, based on a total valuation of S$8,307,351, being the sum total of all the assets listed in the Deed. There were four main components that constitute the entire portfolio of assets under the Deed which I will now elaborate upon: First, the immovable properties under the Deed (“the Properties”); second, an alleged S$3.4m in some of the bank accounts and investments portfolios (the “Contested Accounts”); third, the Fixed Term Deposit (see point 2.1 of the table at [36(c)]); and  fourth, the remaining accounts that included shares and unit trusts in Singapore and overseas, as well as the rest of the matrimonial assets which both parties did not contest (“the Uncontested Assets”).The Properties49     The issue here was with the valuation of the Properties. The valuations that I decided to adopt were those provided by CSK. His report had valued the Properties at 12 March 2003 which was the closest date to the Deed. I note that while CSK attempted to substantiate his values by cross-referencing these values to the Plaintiff’s affidavits, they were not entirely accurate. Overall, there was a lack of evidence on the part of the Defendant for that period in time despite the many adjournments and opportunities to furnish the relevant evidence. Instead, the Defendant chose to value the Properties at a later stage as seen from LPK’s report. In any event, there was no challenge by the Defendant to the Plaintiff’s valuations as of 12 March 2003. Therefore, as of March 2003, the Properties, including their liabilities, were valued at S$3,091,795. The values for each immovable property can be found below in Annex 1.The Contested Accounts50     It was not disputed that the monies in the bank accounts and investment portfolios were matrimonial assets. The Defendant’s complaint was that before the Deed was signed, an alleged S$3,461,103.10 in some of the bank accounts and investments portfolios were withdrawn by the Plaintiff. For ease of reference, this amount will be referred to as S$3.4m. On the other hand, the Plaintiff contended that the amount in question was much smaller and was S$1,718,389.88. I have set out the amounts contended by both parties in Annex 2 (ie, the Contested Accounts).51     Both the Plaintiff and Defendant tabulated a list of the amounts they alleged were in the Contested Accounts.[note: 11]From the outset, it must be noted that the paper trail for the movement of monies in the bank accounts and investment portfolios was not clear from either of the parties’ affidavits, although both parties were given ample time to produce documents to support their cases. Further, counsel did not assist in the clarification of how these Contested Accounts were related to the specific accounts listed in the Deed. I thus made reference to the accounts listed in the Deed according to the evidence that I had before me.52     For S/N 1 of Annex 2, the Defendant produced an ABN AMRO bank letter which stated the balance in the account as of 1 November 2002 to be S$879,624.30.[note: 12]The Plaintiff stated that the bank account was closed on 7 April 2003, and the monies were transferred to another ABN AMRO bank account.[note: 13]The remaining balance in the closed account was US$565.79.[note: 14]According to the Plaintiff, the monies were then transferred into a HSBC account.[note: 15]As of 31 Aug 2006, the credit balance in the HSBC account was US$258,088.69.[note: 16]As there was no paper trail for me to ascertain the movement of the monies, I adopted the Wife’s number instead.53     As for S/N 2 of Annex 2, the Defendant had relied on the December 2002 statement of account to arrive at the figure of $1,897,486.72.[note: 17]However, she had misread this document by simply lifting the figure from the debit value without looking at the balance which was actually zero. It could be inferred from the document that the account was used to make time deposits which meant that monies that flowed in always flowed out into other deposits. The Plaintiff showed that the amount in the account as of 31 October 2002 was US$492,010.[note: 18]Monies credited into that account were moved by the Plaintiff into another UBS AG account after he found out about the Defendant’s infidelity. The Plaintiff was otherwise unable to show any later figure in this other UBS AG account except for a figure as of 31 July 2006.[note: 19]The figure of S$731,939.79 stated by CSK could also not be reconciled with his report.[note: 20]Due to the lapse of time and the absence of values as of March 2003, I adopted the 31 October 2002 figure as this was closest in time to the date of the Deed. Converted into Singapore dollars with the exchange rate used by the Defendant (US$1=S$1.70), the amount was S$836,417.54     The Defendant arrived at her figure at S/N 3 of Annex 2 based on a portfolio summary for August 2002.[note: 21]The Plaintiff was unable to support his number with any documentary evidence.[note: 22]Hence, I adopted the Defendant’s number which is S$117,708.88.55     The Defendant asserted that although the monies in S/N 4 of Annex 2 went into the Plaintiff’s sole DBS Account No [xxx72-5], they were initially transferred from a joint DBS Account No [xxx47-0].[note: 23]The Plaintiff however had earlier asserted that the joint DBS Account No [xxx47-0] was a sole account.[note: 24]Even so, since the Plaintiff did not dispute that the sole DBS Account No [xxx72-5] contained funds that were part of the matrimonial pool, I accepted it to be so. However, I could not accept the Defendant’s figure of S$235,318.00 as there was no substantiation for it. Neither could I accept the Plaintiff’s figure of S$174,002.61, as this was not the amount stated in his affidavit of asset and means. Instead, I found a copy of the deposits made in October 2002 which amounted to AUD$161,677.05.[note: 25]Using the closest exchange rate I could find to that date,ie, the rate furnished by CSK for 28 March 2003, I calculated that the amount was S$170,714.80.56     For the investments listed as S/N 5 to 7 in Annex 2, the Defendant relied on an e-mail from a representative at DBS. The numbers stated by the Defendant in Annex 2 were the proceeds received when the investments were sold on 31 March 2004.[note: 26]The proceeds were then placed in the Plaintiff’s POSB Account. CSK seemed to have permutated the numbers to reflect what he thought it would be as at 12 March 2003.[note: 27]However, there was no methodology to explain how he arrived at the amounts. Therefore, the only numbers that were substantiated were supplied by the Defendant, albeit with a year’s difference, and so I accepted the Defendant’s numbers.57     In conclusion, I find that as of March 2003, the Contested Accounts comprised S$2,335,430. The breakdown of this figure can be found below in Annex 3 (ie, the Revised Contested Accounts).Fixed Term Deposit58     As of March 2003, the Fixed Term Deposit which amounted to S$348,240[note: 28]was supposed to be split equally by the partiesie. S$174,120 each. There is no dispute on this figure.The Uncontested Assets59     As for the Uncontested Assets, I accepted the figures in CSK’s report which totalled S$2,531,886 as they were valued in March 2003.[note: 29]A full list of the Uncontested Assets as well as their values can be found below in Annex 4.Conclusion on total value of assets and division under the Deed60     I find that the value of all the matrimonial assets as of March 2003 was S$8,307,351, being the sum total of the Uncontested Assets, the Revised Contested Accounts, the Fixed Term Deposit and the Properties.61     Accordingly, under the Deed, the Wife would receive S$1,060,197 of the Uncontested Assets,[note: 30]S$427,586 for Aspen Heights and W Vista Kiara, S$174,120 from the Fixed Deposit, and S$437,834 from Leonie Hill (see above at [39]). Furthermore, the Plaintiff would have to pay the Defendant S$700,000 pursuant to clause 3 of the Deed. Therefore, the Defendant would receive S$2,799,737, or 34% under the Deed.Is the 34% share under the Deed fair and equitable?62     I will now deal with the Defendant’s complaints as to why the Deed was unfair and inequitable. Subsequently, I will assess what would be a fair and equitable division under s 112(1) of the Charter, bearing in mind that the Deed is a factor to be taken into consideration under s 112(2)(e).The Defendant’s complaints on excluded assets63     The first complaint was that some assets had been excluded from the Deed. I will deal with this complaint first, leaving her second complaint on the percentage figures to later (see [77]). Should I find any of the complaints to be valid, this may affect the weight I accord to the Deed, bearing in mind the broad brush approach that the court is to take.Suria Stonor64     Ms Ragupathy had initially argued that a property purchased by the Plaintiff in Malaysia known as Suria Stonor should be included in the pool. However, she dropped this claim in the course of oral arguments seeing that the Plaintiff had purchased the property on 31 July 2006, which post-dated the Deed, and thus this property did not belong in the pool of assets.Rental income65     The Defendant also contended that the pool of matrimonial assets should include the rental income earned from the various properties up to 2002.[note: 31]The Defendant’s claim for the rental income was untenable as the monies were applied to the various properties to cover part of the mortgage loans and other property-related expenses on the various properties up to 2002.[note: 32]To claim that they were to be included into the pool would be to overlook where the monies were applied to and double count the amount, which cannot be correct. I thus reject the Defendant’s claim for rental income earned.66     Ms Ragupathy also argued that rental income collected by the Plaintiff in the period 2008 to 2010 should be included in the division.[note: 33]I disagree simply because this rental income accrued after the Deed.The alleged S$3.4m67     Ms Ragupathy submitted that S$3.4m was taken by the Plaintiff from the bank accounts and investment portfolios before the Defendant signed the Deed, and that these monies should rightly be added to the pool of assets. I have already dealt with the actual amount of monies in these accounts (see [50]–[57]) and have considered these monies to be part of the pool of assets when I found that the Defendant was to receive 34% under the Deed.68     As regards Ms Ragupathy’s related argument that the Plaintiff had dissipated S$3.4m and that they were no longer available for division, this point is now moot since I have calculated the total value of the asset pool under the Deed to be S$8,307,351, and the Defendant’s 34% share was derived partly from this figure as well. In any case, as parties had heavily contested this point before me in the ancillary hearing, for completeness, I will deal with this issue.69     Ms Ragupathy contended that even before the Deed was signed, the Plaintiff had transferred monies from some of the parties’ joint accounts into his sole accounts in December 2002 and February 2003, and had refused to produce statements of accounts as of November 2002. Ms Ragupathy argued that there was some S$2.4m in the Contested Accounts that the Defendant could not attain as part of the matrimonial assets because of the movement of funds by the Plaintiff before the Deed was signed.[note: 34]Ms Ragupathy then argued that this amount had increased to S$3,461,103.10 during the hearing on 2 October 2012.[note: 35]I have concluded that S$2,335,430 was in the Contested Accounts and this was the amount in issue (ie, the Revised Contested Accounts at Annex 3).70     For the Defendant’s allegation to succeed, the Defendant must prove that the balances in the Revised Contested Accounts had decreased, and that the Plaintiff had used the amounts in them for his own means even though they belonged in the pool of matrimonial assets. Mr Khoo argued that in respect of the amounts in the Revised Contested Accounts, the monies were not stolen or misapplied,[note: 36]and that there were legitimate expenses between 2002 and 2006 to explain where the monies went.71     Mr Khoo explained the nature of these legitimate expenses.[note: 37]At the hearing before me, Mr Khoo produced a list of expenses that included a cash payment to the Defendant, the payment of the Plaintiff’s tax liabilities, the insurance policies and education for their children, and mortgage payments for the Aspen Heights property from March 2003 to September 2006.[note: 38]I note that some monies were utilised for the part payment of the purchase price for #10-01 Pebble Bay before 2003 and the losses of investments in Horizon Global Equity, Eight C Fund and Eight D Fund, but Ms Ragupathy did not refute any of the expenses. Any remaining unaccounted monies at the end of 2006 would likely to have been S$177,918.28. However, this amount would have already been taken into account in the total value of the pool of assets under the Deed,ie, S$8,307,351 (see above at [57] about Annex 3). In conclusion, I find that the allegation of dissipation was not made out.The Plaintiff’s retirement benefits72     As for the Plaintiff’s retirement benefits, Ms Ragupathy argued that they should be up for division. Ms Ragupathy also complained that the Plaintiff has not fully disclosed his income and/or interests in his legal practice.73     This issue of non-disclosure has already cropped up several times in these proceedings. In Summons 3708 of 2007 and 3819 of 2007, the Deputy Registrar rejected the Defendant’s application for discovery in relation to the Plaintiff’s income and interests in all companies under the umbrella of Baker & McKenzie and all related documents. On appeal, the District Judge in Chambers allowed the appeal and ordered for discovery and interrogatories to be made in relation to the income and interest of the Plaintiff in Baker & McKenzie and Abogado Pte Ltd only. The Plaintiff appealed against the order of the District Judge. Andrew Ang J allowed the appeal after the Plaintiff filed the 4thaffidavit of Mr Robert S Spencer (“Mr Spencer”), the Chief Financial Officer of Baker & McKenzie International. The Plaintiff thus obtained four affidavits from Mr Spencer, which clarified and stated the Plaintiff’s interests and income from the various companies under the umbrella of Baker & McKenzie.74     Ms Ragupathy alleged that the evidence of Mr Spencer could not be believed as Mr Spencer was somehow complicit with the Plaintiff in omitting relevant information or avoiding answering questions, despite having been sworn to state the truth in his affidavits.75     This is a speculative and grave allegation that I am not willing to entertain in the absence of objective evidence. The four affidavits of Mr Spencer cumulatively show that all the income and interests whatsoever that the Plaintiff had in the companies have been disclosed at paragraph 7 of the first affidavit of Mr Spencer.[note: 39]Specifically, Mr Spencer stated at paragraph 6 of his third affidavit that all income received by the Plaintiff from Baker & McKenzie has been included in paragraph 7 of the first affidavit.[note: 40]I am not willing to infer from the omission of Mr Spencer to state this in his first and second affidavit that Mr Spencer is deliberately evasive and understating the Plaintiff’s income. The subsequent affidavits filed after the first affidavit clarified the first affidavit. There is thus no basis for the Defendant’s allegations of non-disclosure.76     However, as a matter of principle, I did recognise that even though the entitlement to the benefits was prospective in nature it would nevertheless be considered a matrimonial asset.The Defendant seeks 60% share of the immovable properties77     The Defendant’s second complaint relates to the percentage of division under the Deed. She maintained that she was entitled to 60% of the immovable properties. Ms Ragupathy contended that according to the valuation as of 26 November 2012, the Defendant was given only 18% of all the matrimonial assets.[note: 41]Therefore, the division under the Deed was unfair. However, in my judgment, there was no legal justification for using the 2012 values. As for the 60% share, the Defendant’s assertion was without merit. This will be clear from my elaboration below.Other relevant factors78     Generally, to determine a just and equitable division in terms of percentage under s 112(2) of the Charter, I will have to consider the relevant factors listed.79     It is trite law that the division of matrimonial assets eschews an examination of the exact contributions of husband and wife (seeNK v NL[2007] 3 SLR(R) 743 at [28]). The relevant principles are succinctly stated by Phang JA inPang Rosaline v Chan Kong Chin[2009] 4 SLR(R) 935 at [23]:In arriving at our decision as to what was a “just and equitable” division … we bore in mind, in particular, the following principles. The first centred on the fact that the division of matrimonial assets under s 112 of the Act is not – and cannot be – a precise mathematical exercise and that the court’s discretion is to be exercised in broad strokes instead … In this regard, it was also pointed out inNK v NL(at [22]–[27]), thatdirectfinancial contributions are not to be considered as aprima faciestarting point although they nevertheless constitute a factor which should be considered by the court pursuant to the exercise of its discretion under s 112 of the Act (which involves what is essentially a multi-factorial approach). We have also referred to the need to ensure thatindirectcontributions are also accorded due recognition (see [21] above).80     The Court of Appeal’s observations inBCB v BCC[2013] 2 SLR 324 (at [13]–[26]) are apposite in this case where the Plaintiff’s direct financial contributions to the acquisition of real properties in Singapore and Malaysia during the marriage were significantly more than the Defendant who had a much lower income. At [27]:The purpose of highlighting the above decisions (which necessarily constitute but an indicative sample only) is to demonstrate a certain trend in cases that sharebroadlysimilar facts. This trend appears to be that, for marriages of moderate lengths of time … or for marriages which have lasted for a very long time …andwhere there are children to the marriage and both parties are working and have made direct as well as indirect contributions to the marriage, the courts would recogniseallthese contributionsdespitearguments to the effect that one party had mademore directfinancial contributions. [emphasis in original]81     Adopting a “broad brush” approach to a division of the matrimonial assets is of particularly relevance in this case especially given (a) the significant number of assets, (b) that the exact financial contribution of each party to the acquisition of the assets was not fully documented by either party, and (c) the conflicting accounts of the extent of their contributions offered by both parties. As stated inYeo Chong Lin v Tay Ang Choo Nancy and another appeal[2011] 2 SLR 1157 (“Yeo Chong Lin”) at [66] and [81]:… What must be clearly recognised is that when the court makes such a determination it is not undertaking an exercise based on arithmetic but a judgmental exercise based, in part at least, on feel.…… At the end of the day, we wish to underscore the point that the broad brush approach, as stated in [66], is all about feel and the court’s sense of justice.82     The Plaintiff argued that whatever the Defendant was given under the Deed was fair as he had paid for most of properties in Singapore and Malaysia. The Defendant, on the other hand, contended in her affidavits[note: 42]that she had also made direct financial contributions towards the acquisition of the properties too and alleged that the rental incomes from the various properties were used to pay off the loans on the properties. However, she was unable to adduce direct evidence of her payments towards such acquisitions. She referred to payments out of a Gleneagles and Kent Ridge account but no evidence was adduced to show the amounts and the periods of payments.[note: 43]In particular, while the Defendant alleged that she paid cash and used monies from her ASPF account to pay for the Leonie Hill property,[note: 44]she did not produce documents showing her contributions in this respect. Nevertheless, the Plaintiff did not deny that she had contributed financially, though in a limited way, to the acquisition of Leonie Hill.[note: 45]83     The Plaintiff has adduced evidence showing that he had made substantial, if not the majority of the financial contributions towards the acquisition of the properties,[note: 46]in particular the Leonie Hill, #10-01 Pebble Bay and Aspen Heights properties. At any rate, it is not unreasonable to infer from the Plaintiff’s larger income earnings that he financed the acquisition of the properties. It was also an observable trend that the family’s wealth grew in the 1990s when the Plaintiff began working in Singapore. Their matrimonial home, Leonie Hill, was purchased in 1993, and the bulk of the properties in Singapore and in Malaysia were acquired after the Plaintiff became an international partner in Baker & McKenzie in 1993.[note: 47]84     There is no doubt that the Plaintiff’s earnings as a lawyer in Singapore were more than the Defendant who was an academic. A comparison of the income tax declarations of the parties clearly showed that the Plaintiff’s income grew steadily over the years and was much larger than the Defendant’s income.[note: 48]85     It was clear from the affidavits that the Plaintiff has worked hard and done very well in his second career and that his career switch has benefitted the family. He paid for most of the children’s education and living expenses overseas,[note: 49]as well as the insurance premiums for the children.[note: 50]The Defendant did not deny that the Plaintiff had paid for most of the children’s overseas education.[note: 51]86     There is one other point in the Plaintiff’s favour. The properties in Singapore and Malaysia that were encumbered were largely repaid by 2012 and in this way, the Plaintiff managed to keep the bulk of the matrimonial assets intact without the assistance of the Defendant after 2003. In fact, the Plaintiff had paid for all the outstanding loans on the Aspen Heights property even though the Defendant was supposed to pay for half of them after the date of the Deed. From March 2003 to May 2012, the Plaintiff had managed to pay off the outstanding mortgage balance on the Leonie Hill property. Between March 2003 and 31 December 2010, the mortgage for #10-01 Pebble Bay was also fully paid for by the Plaintiff. Between March 2003 to February 2013, the Plaintiff had managed to pay off the Aspen Heights mortgage (albeit partly with the use of the matrimonial assets, see above at [71]), and S$722,362.07 of the #12-01 Pebble Bay mortgage from March 2003 to December 2011. Between March 2003 and January 2012, the Plaintiff had also managed to pay S$306,129.73 of the mortgage over the #12-10 Pebble Bay property.[note: 52]It was clear from the Plaintiff’s meticulous spread sheets that the loans (and their interest) were paid off by him, for which due credit for asset preservation should be accorded to him. In this regard, the Plaintiff’s wealth management efforts must be recognised.87     The contributions of the Defendant must be considered too. The dynamics of the parties’ relationship and events prior to 1987 when the Plaintiff moved to Singapore to work as a lawyer are particularly important. For the first ten years of the marriage, the Defendant earned more than the Plaintiff.[note: 53]When the Plaintiff was in England studying for his engineering doctorate and law degree, the Defendant took a year’s sabbatical to be with him and the family.[note: 54]During those years, the Defendant cared for the older son and ran the household.[note: 55]The Defendant said she helped the Plaintiff complete his doctoral thesis.[note: 56]During the intervals when the Plaintiff was studying overseas and the Defendant was back in Malaysia with her son, the Defendant had to take care of her son and ran the household. Later, in the transition and during the early stages of the Plaintiff’s professional career, the family expanded with the birth of the parties’ second son, and the Defendant’s full time employment in academia would have given some measure of economic stability to the family.88     The Defendant claimed that she paid for the Plaintiff’s tuition fees at Oxford,[note: 57]which the Plaintiff strongly denied.[note: 58]The Defendant submitted that from the years 1977 to 1987, she earned substantially more than the Plaintiff and all her earnings went towards the family expenses, paying off government/bank loans and supporting the Plaintiff in obtaining his degree. In contrast, the Plaintiff claimed that he was granted fully paid study leave and paid for his tuition and living expenses with monies from his pay and his scholarship allowance. He relied on his income tax statements from 1987 to 1988 to show that he was receiving an income during that period.[note: 59]In this respect, I am inclined to agree with the Plaintiff that he provided substantial funding for his studies. However, it is undeniable that the Defendant made indirect and non-financial contributions to the family while the Plaintiff was studying, by supporting the Plaintiff and taking care of the older son.89     Between 1982 and 1984, the Plaintiff read law and concurrently pursued an engineering doctorate. The Plaintiff admitted that during those years, the family’s finances were tight. His evidence acknowledges that the Defendant’s salary was used largely to support herself and the elder child and to pay for the instalments on a house in Malaysia. His salary was used to support himself as well as pay for the instalments on a house he had purchased. A third property in Malaysia was financed by the rental income they collected. It is not disputed that the Plaintiff’s earnings in the period 1978 to 1987 compared to the Defendant’s earnings were about 40:60 in the Defendant’s favour.[note: 60]Thereafter, the Plaintiff worked in Singapore as a lawyer.90     Indeed, the family’s fortune changed and improved tremendously in Singapore with the Plaintiff’s very substantial earning power which, over a lengthy marriage, generated a sizeable number of properties and a high standard of living for the family including overseas education for the children. Thus, the Plaintiff’sopportunityto be a high-income earner was the result of the parties’ earlier joint efforts.91     Ms Ragupathy submitted that the Plaintiff was “made” by the Defendant. To claim that the Defendant “made” the Plaintiff who he is today is to downplay the Plaintiff’s own ability and drive. That said, a significant feature in this case was the Defendant’s contributions to the marriage by providing the necessary environment for the Plaintiff to successfully pursue a law degree and an engineering doctorate degree concurrently. It was a significant contribution to the marriage, for without his law degree, the Plaintiff would not have been able to confidently embark upon and successfully achieve a career switch that turned out to be one of the best decisions they made as a couple. In my view, the Defendant’s contributions to the marriage in the early years were essential to the Plaintiff attaining his law degree. However, there comes a point in time when the Plaintiff’s own ability to excel in his career allowed him to reap the benefits of a successful professional career and this continued after the separation and divorce.92     As for their two children, there is conflicting evidence on both sides on their care and welfare. The Defendant maintained that she played a substantial role in the two children’s lives ferrying them to and from school and their extra classes, helping them with their homework, in addition to managing the household when the children were young. The Plaintiff disagreed, arguing that the Defendant continued to pursue her interests of reading extensively and attending classes for Chinese guzheng and embroidery art stitching. It was he who spent most of his free time with the children in their early childhood. Needless to say, both parents were working professionals and had to cope with the demands of balancing work and family. In my view, both contributed what they could in terms of time and effort within the spheres of their own work and non-work related activities to the welfare of the children.93     During better times, both parties were good for each other as husband and wife. This was acknowledged by the Plaintiff in the e-mail dated 6 March 2003 (mentioned above at  [34]) which bears repeating here:… On my part, I acknowledge the contribution you have made to my life and the enrichment that I have had because of you. …and in an earlier e-mail to the Defendant on 8 February 2003,[note: 61]where he wrote:… [I] should be able to get over you over a period of time – 1 year, 2 years, who knows? [D]epends on whether [I] will find myself a good companion. [T]hat would be difficult.[Y]ou are a hard act to follow.[emphasis added]Recent awards94     Turning now to some relevant awards by the court, I observed that in the context of a working mother for a moderate to long marriage, the wife was generally awarded between 35% and 40% of the pool of assets. InLiew Chui Fong v Yew Kok Chin[2007] SGHC 225, the marriage lasted 28 years and the parties had two children. The wife who had worked throughout the marriage received 40% of the property. InPang Rosaline v Chan Kong Chin[2009] 4 SLR(R) 935, the parties were both working and had children. The wife was awarded 40% of the assets after 32 years of marriage. InAYQ v AQR[2013] 1 SLR 476, the family had two children and both spouses were working. The wife was awarded almost 41% of the assets after 23 years of marriage. InBHN v BHO[2013] SGHC 91, where both spouses were gainfully employed and were married for more than 20 years with two children, the wife received 40% of the matrimonial assets.95     As for the following cases, the wife received 35% of the assets. InLeong Choon Kum v Chia Kin Tuck[2005] SGHC 73, the working mother of two attained about 35% of the assets after 22 years of marriage. InZD v ZE and Another[2008] SGHC 225, the wife was awarded 35% of the matrimonial assets. She had been married nearly 17 years and had three children. She had worked at the husband’s company and had also looked also after the children who were all diagnosed with Attention Deficit Hyperactive Disorder. InAOH v AOI[2011] SGHC 14, the court ordered the husband to pay 35% of the assets to the wife who was working full-time. The couple had been married for 12 years and had one child.96     I observed that in most of the cases identified in the sample above, where the wife received 35% of the matrimonial assets, the marriage was generally less than 20 years. On the other hand, for marriages more than 20 years, the wife was awarded 40%. However, I note that in exceptional cases where the value of the assets is very large, then even for long marriages, the percentage awarded to the wife could be less than 35%. This was the case inYeo Chong Linwhere the court upheld the trial judge’s order of 35:65 even though the marriage lasted for 49 years, and the wife had been a housewife.Just and equitable division97     There are features in this case which warrant a departure from the 34% division under the Deed to the Defendant, but this does not mean that the Defendant is entitled to 60% of the matrimonial assets as she contended or that the Deed will be given little or no weight. In this particular case, a just and equitable division would require a reapportionment of the percentage division under the Deed based on an asset pool of S$8,307,351. In addition, the Plaintiff’s retirement benefits which were not covered by CSK’s report[note: 62]and not explicitly stated in the Deed will be dealt with separately from the Deed.98     After considering all the facts and circumstances of this case, including the Deed as a factor under s 112(2)(e) of the Charter, I find that a just and equitable division would be a 40% share to the Defendant. This leads me to the next issue which is the pool of assets and the valuation dates.Applicable dates to the pool of assets and valuation99     The debate between the parties was as follows. Mr Khoo argued that the matrimonial assets should be determined and valued as of the date of the Deed, while Ms Ragupathy argued that what constituted a matrimonial asset should be determined as of the date of the Deed, but they should be valued as of the first ancillary hearing on 2 October 2012.100    The Court of Appeal inYeo Chong Linrecognised that there was no definitive operative date for deciding what fell in the category of matrimonial assets, and that depending on the nature of the assets and the circumstances surrounding their acquisition, multiple dates were distinctly possible (at [36]). The court noted that broadly, there were four timelines that a court could adopt:[39] … The first is the date of separation. The second is the date on which the petition of divorce is filed. The third is the date on which a decreenisiis granted. The fourth is the date of hearing of ancillary matters (including the date of the hearing of an appeal). …101    On the facts, I found that the date on which the Deed was signed was the date at which parties had formally recorded the parties’ decision to go their own separate ways. The Deed itself was set out in a manner to bring an end to the relationship and was indeed the date of separation. In the Deed, it was clearly stated in the recitals that parties had agreed to live apart from each other from 12 March 2003 and that parties were now seeking “financial independence of each other”. Furthermore, the Deed stated that the Deed was a formalisation of the division of assets. At clauses 2.6 to 2.10 of the Deed, the parties had agreed to stop using overdraft facilities, wind down joint accounts in Malaysia, Singapore and anywhere else, and cancel each other’s supplementary credit cards. I found this to be a clear sign that the parties no longer wanted to be financially liable to each other and for each other’s debts. I thus used March 2003 as the operative date for identifying all matrimonial assets in the pool.102    As for the value of the pool,Yeo Chong Linhad stated at [39] that the value “must be assessed” as at the date of the hearing. In this case, this meant a valuation of assets as of 2012. However, it must be kept in mind thatYeo Chong Linwas not a case where a s 112(2)(e) agreement was in issue.103    One interpretation of the reasoning inYeo Chong Lincould be that the assets should be divided at the latest time possible so that both parties share the benefit or burden of the increase or decrease in the value of the asset. On the other hand, some cases seem to support the position that there is judicial discretion to choose another date which might be more just. In a decision afterYeo Chong Lin, Anthony Patrick Nathan v Chan Siew Chin[2011] 4 SLR 1121 (“Anthony Patrick Nathan”), Quentin Loh J preferred a more flexible rule to the date of valuation and concluded at [29]:Ultimately, the date on which matrimonial assets should be valued is up to the court's discretion, just as it is when it comes to the operative date on which the pool of matrimonial assets should be determined. What is critical is to arrive at a \"just and equitable division\" … in all the circumstances in each particular case.However,Anthony Patrick Nathandid not discuss the ruling in [39] ofYeo Chong Lin.104    The same approach was observed by Loh J in the later case ofYong Shao Keat v Foo Jock Khim[2012] SGHC 107 at [10], and Steven Chong J inChan Yuen Boey v Sia Hee Soon[2012] 3 SLR 402 followedAnthony Patrick Nathan. These two cases also did not discuss the ruling in [39] ofYeo Chong Lin.105    In an appropriate case, as Loh J rightly observed, an alternative valuation date can apply, as illustrated in the case ofWan Lai Cheng v Quek Seow Kee and another appeal and another matter[2012] 4 SLR 405 (“Wan Lai Cheng”), where the Court of Appeal unanimously decided that several of the properties were to be valued as at the date a few days after the wife filed for divorce (this was done for the convenience of both parties)ie, 31 July 2007, rather than at the date of the judgmentie, 14 January 2011. InWan Lai Cheng, the Court of Appeal found that after 31 July 2007, the husband had enhanced the liabilities over the properties for his own benefit, and not for the benefit of both spouses. It was therefore just and equitable for the court to decide that a later date should not be chosen, but rather an earlier date which was closer to the commencement of the divorce proceedings.106    Therefore, although the general starting point would be that as iterated inYeo Chong Lin, the case law seems to indicate that the court will have discretion to choose a more appropriate date of valuation.107    In this case, I find that the appropriate date to value the pool would be March 2003. On its face, the Deed was clearly meant to sever all relationships between the parties. The three years in between would be for parties to sort out their various obligations under the Deed and eventually allow for either party to file for a divorce. Clause 1.6.2 makes it even clearer that the division was to be as at the date of the Deed:In the event that a petition is filed for a decree of divorce based on the ground that the marriage has broken down irretrievably…, the party against whom the petition for a decree is filed, hereby irrevocably agrees to give her or his consent: (a) in writing … and (b) to theconsent order of court embodying such terms as the [Plaintiff] and the [Defendant] may agree based upon the general division of assets set out in this Deed.[emphasis added]What the clause suggests is that parties contemplated that they would still be bound by the Deed in an application for divorce filed three years later. The inference to be drawn was that the assets were to be valued as of 2003, at the point of the division, and that there would be, in effect, no re-opening of the distribution of assets.108    The inference above is reinforced by the reasons stated above at [101]. I agree with Mr Khoo that the marriage had long since ended and the separation was certainly final in light of the Plaintiff’s serious relationship with his current wife back then.109    Mr Khoo even tabulated a chronology of proceedings to show the development of the long-drawn dispute between the parties.[note: 63]Mr Khoo’s related argument was that the Defendant had prolonged the proceedings so as to take advantage of the rising property market to enhance the size of her share. According to the valuations submitted by Ms Ragupathy, as of 26 November 2012, the values of the Properties had increased to S$14,544,193.[note: 64]I accept that the ancillary proceedings were indeed prolonged, however, it was not necessary for me to decide on whether the time lapse between the separation and the first ancillary hearing was unwarranted. As stated earlier, I did not accept Ms Ragupathy’s calculation of the Defendant’s claim based on the 2012 valuations.110    By way of observation, an appropriate case where the date of a s 112(2)(e) agreement could be departed from, is where there is evidence of bad faith demonstrating one party’s deliberate attempt to prolong the period before the ancillary hearing to the disadvantage of the other in the knowledge of the value of the pool increasing over time for reasons such as anen blocsale. This will result in a division at the later date looking more unjust as it will be tilted in favour of the party guilty of bad faith.The assessment111    In light of the matters aforesaid, I find that the pool of assets and the valuation would be as of March 2003. Further, as stated in my finding earlier at [98], a just and equitable division is to award a 40% share to the Defendant.112    To recapitulate, strictly under the Deed (see [60]–[61]), the Defendant would be receiving S$2,799,737 out of the total assets of S$8,307,351. The division to her was as follows:(a)     S$1,060,197 of the Uncontested Assets;(b)     S$427,586 for Aspen Heights and W Vista Kiara;(c)     S$174,120 from the Fixed Deposit;(d)     S$437,834 from Leonie Hill; and(e)     S$700,000 per clause 3 of the Deed (of which the Plaintiff has already paid S$100,000).113    With the reapportionment of the percentages to 40%, the Defendant would be receiving 6% more of the total assets comprised under the Deed, or, S$498,441, and I so award her this additional amount in cash contributions from the Plaintiff.114    In relation to the Plaintiff’s retirement benefits, I find that the Defendant would have been entitled to a share of the Plaintiff’s retirement benefits up to March 2003.115    As for the dispute on the quantum, the Defendant claimed that she was entitled to part of a sum of US$951,056.[note: 65]This was based on an amalgamation of numbers found in Mr Spencer’s various affidavits. As of 2008, the Plaintiff would be able to withdraw US$348,724 from his capital account, and attain US$134,124.67 that was withheld for contingent tax liabilities.[note: 66]Additionally, should the Plaintiff retire at age 65, he would be entitled to a lump sum payment of US$271,208, a seniority-based annual entitlement of $77,000. As for his client origination-based entitlement, LPK estimated this based on 2008 figures and arrived at US$120,000.[note: 67]It was quickly apparent that the numbers were contingent on time as well as the Plaintiff’s date of retirement.116    Based on the best information available before me, I used the 2007 values found in Mr Spencer’s affidavits. Therefore, as of 2007, the Plaintiff would have been able to withdraw US$323,724 from his capital account and attain US$60,064.15 for contingent tax liabilities. Should the Plaintiff have retired in 2008 (after one year’s notice from 2007) he would be entitled to US$31,469 as a lump sum payment and US$60,800 as a seniority-based portion of his annual entitlement. His client origination portion would be about US$100,000, being the average of what Mr Spencer had stated.[note: 68]Therefore, the total amount would be US$576,057.117    Accordingly, I order that the Plaintiff to pay the Defendant 40% of US$576,057, being US$230,422.80 in cash contributions.Adjustments between the parties within the Deed118    According to clause 2.2, read with clause 2.3.1(a) of the Deed, the Defendant was to pay for half of the mortgage on the Aspen Height property, however she did not do so. As mentioned above at [71], the Plaintiff had used part of the matrimonial assets (from the Revised Contested Accountsie, Annex 3) to pay off the mortgage payments for the Aspen Heights property from March 2003 to September 2006 which totalled S$354,542.88. Subsequently, the rest of the mortgage payments were paid for by the Plaintiff out of his own pocket. I was also informed by Mr Khoo that by March 2013, the mortgage had been fully redeemed by the Plaintiff.[note: 69]According to Mr Khoo’s letter to the court dated 14 May 2013, the Plaintiff had paid a total of S$1,024,260.26 including interest from March 2003 onwards. It would be double-counting not to deduct the payments made from the Revised Contested Accounts. Therefore, the Plaintiff had essentially paid S$669,717.38 for both his and the Defendant’s share of the loan. As such, the Plaintiff is entitled to be paid back S$334,858.69 by the Defendant under clauses 2.2 and 2.3.1(a) of the Deed.119    At the same time, the Plaintiff was required to pay a total of S$700,000 to the Defendant by 2008 under clause 3 of the Deed, but did not carry this part out entirely. According to Ms Ragupathy’s letter to the court dated 17 May 2013, the Plaintiff withheld the payments under clause 3 of the Deed as the Defendant had refused to transfer the beneficial interests in some of the properties to him and he had deemed the withholding of the sums as a means to pay off the Defendant’s share in the property loans. Thus far, the Defendant has received S$100,000. Hence, the Plaintiff is required to pay the Defendant the remaining S$600,000. I also note that the Plaintiff has not refunded the Defendant’s principal ASPF contributions to the Leonie Hill property.120    In the final adjustment between the parties, they would have to account for the sums stated above to each other. Therefore, in setting off the amounts owed between the Plaintiff and the Defendant, I find that the Plaintiff is to pay the Defendant the net sum of S$265,141.31 under clause 3 of the Deed. In arriving at this net figure, I have already taken into account the S$100,000 that the Plaintiff has paid. Additionally, I find that the Plaintiff is to pay the Defendant for her principal ASPF contributions to the Leonie Hill property.Maintenance121    The Defendant argued that if she could not attain 60% of the immoveable properties, she wanted maintenance at $2,500 a month. In the light of my award of 40% to the Defendant, I have to consider what an appropriate amount of maintenance would be. Section 114(1) of the Charter states that:(1)    In determining the amount of any maintenance to be paid by a man to his wife or former wife, the court shall have regard to all the circumstances of the case including the following matters:(a)    the income, earning capacity, property and other financial resources which each of the parties to the marriage has or is likely to have in the foreseeable future;(b)    the financial needs, obligations and responsibilities which each of the parties to the marriage has or is likely to have in the foreseeable future;(c)    the standard of living enjoyed by the family before the breakdown of the marriage;(d)    the age of each party to the marriage and the duration of the marriage;(e)    any physical or mental disability of either of the parties to the marriage;(f)    the contributions made by each of the parties to the marriage to the welfare of the family, including any contribution made by looking after the home or caring for the family; and(g)    in the case of proceedings for divorce or nullity of marriage, the value to either of the parties to the marriage of any benefit (for example, a pension) which, by reason of the dissolution or annulment of the marriage that party will lose the chance of acquiring.122    The Plaintiff rejected the Defendant’s claim for maintenance as fanciful and the quantum as excessive. He submitted that the Defendant is financially independent and does not need maintenance. To reinforce his contention, he pointed out that after the parties separated, the Defendant did not seek maintenance from the Plaintiff, and did not apply for interim maintenance. The arguments are legally unsound for as a matter of principle, the Defendant is entitled to seek maintenance under the Charter.123    The principles governing the court’s power to order maintenance for a former wife were comprehensively canvassed by the Court of Appeal inFoo Ah Yan v Chiam Heng Chow[2012] 2 SLR 506 at [12]–[19] (“Foo Ah Yan”). The overarching principle is that of financial preservation, which requires the wife to be maintained at a standard, which is, to a reasonable extent, commensurate with the standard of living she had enjoyed during the marriage (Foo Ah Yanat [13]). The court applies s 114(2) in a commonsense holistic manner that takes into account the new realities that flow from the breakdown of a marriage and responds to the requirements of justice in each case (Foo Ah Yanat [15]–[16]). Hence it has been observed that the aim in ordering maintenance of a wife is to even out any financial inequalities between spouses, taking into account any economic prejudice suffered by the wife during the marriage. The courts have also held that a former wife must, where possible, exert reasonable efforts to secure gainful employment and contribute to preserve her pre-breakdown lifestyle and that although the husband isprima facieobliged to maintain his former wife beyond his retirement and up to the former wife’s remarriage or the death of either party, the former wife who has assets of her own should not expect a full subsidy for her lifestyle. The Court of Appeal inFoo Ah Yanalso made it clear at [20]–[22] that the non-provision of maintenance to the wife during marriage does not preclude the court from ordering maintenance for the wife after divorce.124    Ultimately, it is the reasonableness of the maintenance claim compared to the husband’s ability to pay which guides the court’s application of the principle of financial preservation (Foo Ah Yanat [19]).125    The court’s power to order maintenance is supplementary to its power to order a division of the matrimonial assets, such that the courts regularly take into account each party’s share of the matrimonial assets when assessing the appropriate quantum of maintenance (Foo Ah Yanat [26].126    The Defendant had earlier stated that her living expenses were about S$23,438 a month, while her monthly take home pay was S$14,865.[note: 70]There was no explanation on how the Defendant made up for the shortfall since 2003, and I agree with Mr Khoo that there was also no evidence to support her expenses. I also agree that the Defendant had grossly overstated her initial claim of S$23,438 a month seeing that Ms Ragupathy eventually proposed a significantly reduced monthly figure of S$2,500 at the adjourned hearing.127    The Defendant is now 62 years of age and will be looking to retiring in the near future and with that, her earnings from academia will stop, leaving her only with potentially passive income from the properties. Bearing in mind the relevant principles cited above, I am of the view that the Defendant should be given a monthly sum of S$1,650.128    As the divorce was acrimonious, I am of the view that a lump sum maintenance would be appropriate in the circumstances. Accordingly, I order that the Plaintiff is to pay the Defendant a lump sum maintenance of S$200,000 to the Defendant, being the rounded up monthly sum of S$1,650 multiplied by the multiplicand of 10, representing 10 years of maintenance.Orders to be made129    The parties are to carry out the terms of the Deed in the light of the orders made here at [113], [117], [119], [120] and [128]. To this end, parties are directed to work out the precise orders they require from this court, taking into account the set-offs at [120]. Arithmetical corrections, if any, should be dealt with in the precise orders to be made. Parties are to write in to the Registry as soon as they are ready with a draft order. At the same time, I will hear parties on costs.Annex 1: The PropertiesNo.PropertyValuation as of March 2003 (S$)1#12-01 Pebble Bay338,0142#12-10 Pebble Bay211,4323#10-01 Pebble Bay388,8944H Vista Kiara201,6085Lanai Kiara137,6506Plaza Mont Kiara247,4287Danau Permai Condo137,4608Orchard Heights105,3869Aspen Heights221,39610W Vista Kiara206,19011Leonie Hill896,337TotalS$3,091,795Annex 2: The Contested AccountsNo.Description (cf CSK’s report appendix 4)Defendant’s amount (S$)Plaintiff’s amount (S$)1ABN AMRO Joint Account No [xxx151] (S/N 65)879,624.30444,808.602UBS AG Joint Account No [xxx998] (S/N 59)1,897,486.72731,939.793UBS Painewebber Joint Account No [xxx288] (S/N 40)117,708.88110,987.684DBS Account No [xxx72-5] (S/N 61, 64)235,318.00174,002.615Horizon Global Equity (S/N 29)216,322.11161,917.746Eight C Fund (S/N 31)61,152.2251,876.327Eight D Fund (S/N 30)53,490.8742,857.14TotalS$3,461,103.10S$1,718,389.88Annex 3: The Revised Contested AccountsNo.DescriptionAmount (S$)1ABN AMRO Joint Account No [xxx151]879,6242UBS AG Joint Account No [xxx998]836,4173UBS Paine Webber Joint Account No [xxx288]117,7094DBS Account [xxx72-5]170,7155Horizon Global Equity216,3226Eight C Fund61,1527Eight D Fund53,491TotalS$2,335,430Annex 4: Uncontested AssetsNo.AssetValue (S$)OwnershipMotor Vehicles1Jaguar Model No SOV 3.2LWB025,217.00Plaintiff2Jaguar40,000.00DefendantSub-total65,217.00Insurance Policies1Prudential Insurance (Prulink) Policy No [xxx099]160,541.54Party insured: PlaintiffBeneficiary: Plaintiff’s estate2Prudential Insurance Policy No [xxx619]88,236.01Party insured: PlaintiffBeneficiary: Plaintiff’s estate3Prudential Insurance Policy No [xxx485]28,406.58Party insured: DefendantBeneficiary: Plaintiff4Hartford Life [xxx660]32,745.84Plaintiff5Prudential [xxx015] (Investment Linked Policy) Whole life Par Series 2355,926.36Defendant6Insurance policy [xxx536]25,177.46Defendant7Prudential unit trust investments [xxx015]263,211.00DefendantSub-total955,244.79Investments of shares, unit trusts etc. in Singapore or overseas, and bank accounts in Singapore and overseas1DBS Vickers Securities – SGD Securities123,670.00Plaintiff2CPF DBS Investment43,140.00Plaintiff3OCBC [xxx171] Supp Ret. Scheme Investment A/c58,132.85Defendant4Shares7.10Defendant5Shares – Cityneon1,750.00Defendant6Saujana Consolidated Bhd366.56Plaintiff7DBS Vickers Securities – USD Securities83,253.25Plaintiff8POSB A/c No [xxx14-1]39,437.41Plaintiff9HSBC A/c No [xxx490]46,031.30Plaintiff10DBS Bank A/c No [xxx27-2] (overdraft)(56,297.31)Joint account11DBS Bank (Sgp) [xxx59-5]74.82Joint account12DBS Bank SGP Auto [xxx94-1]16,012.07Joint account13Joint bank a/c BOA [xxx713]10,139.61Joint account (Defendant and son)14DBS autosave A/c [xxx01-5]35,854.22Defendant15DBS Savings A/c [xxx614]1,000.00Defendant16ABN-AMRO Bank A/c No [xxx202]443,816.94Plaintiff17HSBC A/c No [xxx081]578.39Joint account18ABN-AMRO HK [xxx518]992.03Joint account19Maybank A/c No [xxx448] (current account)14.38Plaintiff20Maybank A/c No [xxx405]27,803.19Joint account21Malayan Banking A/C [xxx455]6,102.61Defendant22Malayan Banking A/C [xxx908] (Fixed Deposit)18,111.66Defendant23Loan to Homestead20,336.60Defendant24National Westminster Bank Plc A/c No [xxx921] (current account)632.75Joint account25National Westminster Bank Plc A/c No [xxx582]1,890.79Joint accountSub-total922,851.22CPF/EPF/ASPF monies1CPF161,332.16Plaintiff2EPF – Malaysian Govt Compulsory Savings57,189.85Plaintiff3CPF129,486.91Defendant4EPF balances61,804.80Defendant5EPF Unit Trust Investments11,695.28DefendantSub-total421,509.00Club Memberships1Saujana Country Club9,164.00Plaintiff2Singapore Cricket Club3,500.00Plaintiff3Tioman Island Resort Bhd2,800.00Plaintiff4Sub-total15,464.00Other assets/investments1Jewellery31,600.00Defendant2Winder collection35,000.00Plaintiff3Watches and jewellery15,000.00Plaintiff4Artworks and paintings40,000.00Plaintiff5Rosewood furniture30,000.00PlaintiffSub-total151,600.00Grand TotalS$2,531,886.01[note: 1]Plaintiff’s Bundle of Submissions (“PBS”), Tab 1, para 41.[note: 2]PBS, Tab 4, para 151.[note: 3]PBS, Tab 1, para 16.[note: 4]PBS, Tab 4, para 13.[note: 5]Plaintiff’s Bundle of Affidavits (“PBA”), Tab 3, p 149; This is the same e-mail referred to in the 2012 Judgment at [32].[note: 6]PBA, Tab 3, pp 151-152[note: 7]PBS, Tab 2, point 7.3.[note: 8]Defendant’s Bundle of Documents (“DBD”), Tab 39, p 137.[note: 9]DBD, Tab 39, p 4.[note: 10]PBA, Tab 16, pp 241–245.[note: 11]Defendant’s Bundle of Submissions (“DBS”), Tab 5, Table D; PBS, Tab 5, pp 4–7.[note: 12]PBA, Tab 18, p 37.[note: 13]PBS, Tab 5, p 4.[note: 14]PBA, Tab 17, pp 74–75.[note: 15]PBA, Tab 1, p 214.[note: 16]PBA, Tab 1, p 190.[note: 17]DBD, Tab 14, p 275.[note: 18]PBA, Tab 17, p 80.[note: 19]PBA, Tab 1, p 189.[note: 20]PBA, Tab 16, p 65.[note: 21]DBD, Tab 34, p 799.[note: 22]PBA, Tab 16, p 63.[note: 23]DBS, Tab 5, Table D.[note: 24]PBA, Tab 1, p 215.[note: 25]PBA, Tab 17, pp 108–112.[note: 26]DBD, Tab 39, p 1046.[note: 27]PBA, Tab 16, p 62.[note: 28]PBA, Tab 16, p 63.[note: 29]PBA, Tab 16, pp 60–67.[note: 30]CSK’s report, p 44.[note: 31]DBS, Tab 5, para 61.[note: 32]PBS, Tab 6, Annex 9.[note: 33]DBS, Tab 1, pp 46–47.[note: 34]DBS, Tab 1, paras 103–107.[note: 35]DBS, Tab 5, paras 24–25; Table D.[note: 36]Notes of Arguments, p 23.[note: 37]PBS, Tab 5, p 8.[note: 38]PBS, Tab 5, pp 8–11.[note: 39]PBA, Tab 19, p 3.[note: 40]PBA, Tab 25, p 2.[note: 41]Defendant’s Bundle of Tables, Vol 2, Table O.[note: 42]DBD, Tab 33, pp 13–15; Tab 34, pp 11–13.[note: 43]DBD, Tab 33, pp 13–14.[note: 44]DBD, Tab 33, p 13.[note: 45]PBA. Tab 9, p 25.[note: 46]PBA, Tab 9, pp 25–29, 196–214.[note: 47]Miscellaneous Bundle of Documents (“MBD”), Tab 1, pp 2–3; PBS, Tab 1, p 6.[note: 48]PBA, Tab 1, pp 32, 49–116, 256–275.[note: 49]PBA, Tab 1, pp 43, 296.[note: 50]PBA, Tab 1, pp 43, 313.[note: 51]DBD, Tab 34, p 26.[note: 52]MBD, Tab 1, pp 4–12.[note: 53]DBD, Tab 33, pp 8–10; DBD, Tab 36. P 30.[note: 54]DBD, Tab 33, pp 8–9.[note: 55]DBD, Tab 33, pp 9–10[note: 56]DBD, Tab 33, pp 10.[note: 57]DBD, Tab 33, p 9; DBD, Tab 36, p 31.[note: 58]PBA, Tab 18, pp 30–31.[note: 59]PBA, Tab 17, pp 2–3; 26–36.[note: 60]PBS, Tab 3, pp 21–22.[note: 61]PBA, Tab 2, p 85.[note: 62]PBS, Tab 7, p 5.[note: 63]PBS, Tab 4, Annex 11.[note: 64]Defendant’s Bundle of Tables, Vol 2, Table O.[note: 65]DBD, Tab 39, p 142.[note: 66]PBA, Tab 25, p 2.[note: 67]PBA, Tab 19, pp 5–6.[note: 68]PBA, Tab 19, pp 4–5.[note: 69]Notes of Arguments, p 36.[note: 70]DBD, Tab 33, pp 19–21.",
        "The value of the pool of assets under the Deed": "44     I note that the Deed does not mention the values of the total assets comprised in the pool and does not particularise the assets in the names of the respective parties. This gives rise to the problem of determining the precise asset pool and monetary value.. For this section alone, I will be relying on the values as of March 2003 as the Deed was signed on 28 March 2003. 45     For the purposes of the ancillary proceedings, each side produced an accountant’s report to particularise the nature and value of the assets subject to division under the Deed. Suffice it to say, the Plaintiff’s expert, Cheng Soon Keong (“CSK”), calculated that the total value of the monetary assets under the Deed as S$6,225,549 to conclude that the Defendant was getting 44% of the pool of assets under the Deed as of March 2003. On the other hand, the Defendant’s expert, Loke Poh Keun (“LPK”), estimated a larger pool of matrimonial assets valued at S$16,950,520 as of 2010.[note: 9]It appears that LPK and CSK were working on different bases: LPK had included additional assets into the pool and had utilised later valuation dates than CSK. I note that LPK’s valuation dates were inappropriate in this exercise of determining the value of the assets and its division under a document that was signed in March 2003. 46     I will now examine CSK’s figures and explain my conclusion that a 44% division to the Defendant was inaccurate. 47     Mr Khoo attempted to show through CSK’s report that the Defendant was receiving a sum that entitled her to 44% of the matrimonial assets in 2003 and that this was a fair and equitable distribution of the assets. In this report, there were deductions totalling S$989,926 for tax liabilities, remittances and insurance payments for the children which resulted in a smaller pool of assets available for distribution. This approach is untenable. Notably, these deductions were for payment obligations after March 2003.[note: 10]Moreover, the balances in some of the bank accounts, which I will turn to later, were actually larger in March 2003 than what was stated in CSK’s report which contributed to the inflated figure of 44%. In these circumstances, the 44% share of the matrimonial assets was not sustainable. 48     On a review of the evidence, I am of the view that the Defendant was given 34% under the Deed, based on a total valuation of S$8,307,351, being the sum total of all the assets listed in the Deed. There were four main components that constitute the entire portfolio of assets under the Deed which I will now elaborate upon: First, the immovable properties under the Deed (“the Properties”); second, an alleged S$3.4m in some of the bank accounts and investments portfolios (the “Contested Accounts”); third, the Fixed Term Deposit (see point 2.1 of the table at [36(c)]); and  fourth, the remaining accounts that included shares and unit trusts in Singapore and overseas, as well as the rest of the matrimonial assets which both parties did not contest (“the Uncontested Assets”). The Properties 49     The issue here was with the valuation of the Properties. The valuations that I decided to adopt were those provided by CSK. His report had valued the Properties at 12 March 2003 which was the closest date to the Deed. I note that while CSK attempted to substantiate his values by cross-referencing these values to the Plaintiff’s affidavits, they were not entirely accurate. Overall, there was a lack of evidence on the part of the Defendant for that period in time despite the many adjournments and opportunities to furnish the relevant evidence. Instead, the Defendant chose to value the Properties at a later stage as seen from LPK’s report. In any event, there was no challenge by the Defendant to the Plaintiff’s valuations as of 12 March 2003. Therefore, as of March 2003, the Properties, including their liabilities, were valued at S$3,091,795. The values for each immovable property can be found below in Annex 1. The Contested Accounts 50     It was not disputed that the monies in the bank accounts and investment portfolios were matrimonial assets. The Defendant’s complaint was that before the Deed was signed, an alleged S$3,461,103.10 in some of the bank accounts and investments portfolios were withdrawn by the Plaintiff. For ease of reference, this amount will be referred to as S$3.4m. On the other hand, the Plaintiff contended that the amount in question was much smaller and was S$1,718,389.88. I have set out the amounts contended by both parties in Annex 2 (ie, the Contested Accounts). 51     Both the Plaintiff and Defendant tabulated a list of the amounts they alleged were in the Contested Accounts.[note: 11]From the outset, it must be noted that the paper trail for the movement of monies in the bank accounts and investment portfolios was not clear from either of the parties’ affidavits, although both parties were given ample time to produce documents to support their cases. Further, counsel did not assist in the clarification of how these Contested Accounts were related to the specific accounts listed in the Deed. I thus made reference to the accounts listed in the Deed according to the evidence that I had before me. 52     For S/N 1 of Annex 2, the Defendant produced an ABN AMRO bank letter which stated the balance in the account as of 1 November 2002 to be S$879,624.30.[note: 12]The Plaintiff stated that the bank account was closed on 7 April 2003, and the monies were transferred to another ABN AMRO bank account.[note: 13]The remaining balance in the closed account was US$565.79.[note: 14]According to the Plaintiff, the monies were then transferred into a HSBC account.[note: 15]As of 31 Aug 2006, the credit balance in the HSBC account was US$258,088.69.[note: 16]As there was no paper trail for me to ascertain the movement of the monies, I adopted the Wife’s number instead. 53     As for S/N 2 of Annex 2, the Defendant had relied on the December 2002 statement of account to arrive at the figure of $1,897,486.72.[note: 17]However, she had misread this document by simply lifting the figure from the debit value without looking at the balance which was actually zero. It could be inferred from the document that the account was used to make time deposits which meant that monies that flowed in always flowed out into other deposits. The Plaintiff showed that the amount in the account as of 31 October 2002 was US$492,010.[note: 18]Monies credited into that account were moved by the Plaintiff into another UBS AG account after he found out about the Defendant’s infidelity. The Plaintiff was otherwise unable to show any later figure in this other UBS AG account except for a figure as of 31 July 2006.[note: 19]The figure of S$731,939.79 stated by CSK could also not be reconciled with his report.[note: 20]Due to the lapse of time and the absence of values as of March 2003, I adopted the 31 October 2002 figure as this was closest in time to the date of the Deed. Converted into Singapore dollars with the exchange rate used by the Defendant (US$1=S$1.70), the amount was S$836,417. 54     The Defendant arrived at her figure at S/N 3 of Annex 2 based on a portfolio summary for August 2002.[note: 21]The Plaintiff was unable to support his number with any documentary evidence.[note: 22]Hence, I adopted the Defendant’s number which is S$117,708.88. 55     The Defendant asserted that although the monies in S/N 4 of Annex 2 went into the Plaintiff’s sole DBS Account No [xxx72-5], they were initially transferred from a joint DBS Account No [xxx47-0].[note: 23]The Plaintiff however had earlier asserted that the joint DBS Account No [xxx47-0] was a sole account.[note: 24]Even so, since the Plaintiff did not dispute that the sole DBS Account No [xxx72-5] contained funds that were part of the matrimonial pool, I accepted it to be so. However, I could not accept the Defendant’s figure of S$235,318.00 as there was no substantiation for it. Neither could I accept the Plaintiff’s figure of S$174,002.61, as this was not the amount stated in his affidavit of asset and means. Instead, I found a copy of the deposits made in October 2002 which amounted to AUD$161,677.05.[note: 25]Using the closest exchange rate I could find to that date,ie, the rate furnished by CSK for 28 March 2003, I calculated that the amount was S$170,714.80. 56     For the investments listed as S/N 5 to 7 in Annex 2, the Defendant relied on an e-mail from a representative at DBS. The numbers stated by the Defendant in Annex 2 were the proceeds received when the investments were sold on 31 March 2004.[note: 26]The proceeds were then placed in the Plaintiff’s POSB Account. CSK seemed to have permutated the numbers to reflect what he thought it would be as at 12 March 2003.[note: 27]However, there was no methodology to explain how he arrived at the amounts. Therefore, the only numbers that were substantiated were supplied by the Defendant, albeit with a year’s difference, and so I accepted the Defendant’s numbers. 57     In conclusion, I find that as of March 2003, the Contested Accounts comprised S$2,335,430. The breakdown of this figure can be found below in Annex 3 (ie, the Revised Contested Accounts). Fixed Term Deposit 58     As of March 2003, the Fixed Term Deposit which amounted to S$348,240[note: 28]was supposed to be split equally by the partiesie. S$174,120 each. There is no dispute on this figure. The Uncontested Assets 59     As for the Uncontested Assets, I accepted the figures in CSK’s report which totalled S$2,531,886 as they were valued in March 2003.[note: 29]A full list of the Uncontested Assets as well as their values can be found below in Annex 4. Conclusion on total value of assets and division under the Deed 60     I find that the value of all the matrimonial assets as of March 2003 was S$8,307,351, being the sum total of the Uncontested Assets, the Revised Contested Accounts, the Fixed Term Deposit and the Properties. 61     Accordingly, under the Deed, the Wife would receive S$1,060,197 of the Uncontested Assets,[note: 30]S$427,586 for Aspen Heights and W Vista Kiara, S$174,120 from the Fixed Deposit, and S$437,834 from Leonie Hill (see above at [39]). Furthermore, the Plaintiff would have to pay the Defendant S$700,000 pursuant to clause 3 of the Deed. Therefore, the Defendant would receive S$2,799,737, or 34% under the Deed.",
        "Is the 34% share under the Deed fair and equitable?": "62     I will now deal with the Defendant’s complaints as to why the Deed was unfair and inequitable. Subsequently, I will assess what would be a fair and equitable division under s 112(1) of the Charter, bearing in mind that the Deed is a factor to be taken into consideration under s 112(2)(e).",
        "The Defendant’s complaints on excluded assets": "63     The first complaint was that some assets had been excluded from the Deed. I will deal with this complaint first, leaving her second complaint on the percentage figures to later (see [77]). Should I find any of the complaints to be valid, this may affect the weight I accord to the Deed, bearing in mind the broad brush approach that the court is to take. Suria Stonor 64     Ms Ragupathy had initially argued that a property purchased by the Plaintiff in Malaysia known as Suria Stonor should be included in the pool. However, she dropped this claim in the course of oral arguments seeing that the Plaintiff had purchased the property on 31 July 2006, which post-dated the Deed, and thus this property did not belong in the pool of assets. Rental income 65     The Defendant also contended that the pool of matrimonial assets should include the rental income earned from the various properties up to 2002.[note: 31]The Defendant’s claim for the rental income was untenable as the monies were applied to the various properties to cover part of the mortgage loans and other property-related expenses on the various properties up to 2002.[note: 32]To claim that they were to be included into the pool would be to overlook where the monies were applied to and double count the amount, which cannot be correct. I thus reject the Defendant’s claim for rental income earned. 66     Ms Ragupathy also argued that rental income collected by the Plaintiff in the period 2008 to 2010 should be included in the division.[note: 33]I disagree simply because this rental income accrued after the Deed. The alleged S$3.4m 67     Ms Ragupathy submitted that S$3.4m was taken by the Plaintiff from the bank accounts and investment portfolios before the Defendant signed the Deed, and that these monies should rightly be added to the pool of assets. I have already dealt with the actual amount of monies in these accounts (see [50]–[57]) and have considered these monies to be part of the pool of assets when I found that the Defendant was to receive 34% under the Deed. 68     As regards Ms Ragupathy’s related argument that the Plaintiff had dissipated S$3.4m and that they were no longer available for division, this point is now moot since I have calculated the total value of the asset pool under the Deed to be S$8,307,351, and the Defendant’s 34% share was derived partly from this figure as well. In any case, as parties had heavily contested this point before me in the ancillary hearing, for completeness, I will deal with this issue. 69     Ms Ragupathy contended that even before the Deed was signed, the Plaintiff had transferred monies from some of the parties’ joint accounts into his sole accounts in December 2002 and February 2003, and had refused to produce statements of accounts as of November 2002. Ms Ragupathy argued that there was some S$2.4m in the Contested Accounts that the Defendant could not attain as part of the matrimonial assets because of the movement of funds by the Plaintiff before the Deed was signed.[note: 34]Ms Ragupathy then argued that this amount had increased to S$3,461,103.10 during the hearing on 2 October 2012.[note: 35]I have concluded that S$2,335,430 was in the Contested Accounts and this was the amount in issue (ie, the Revised Contested Accounts at Annex 3). 70     For the Defendant’s allegation to succeed, the Defendant must prove that the balances in the Revised Contested Accounts had decreased, and that the Plaintiff had used the amounts in them for his own means even though they belonged in the pool of matrimonial assets. Mr Khoo argued that in respect of the amounts in the Revised Contested Accounts, the monies were not stolen or misapplied,[note: 36]and that there were legitimate expenses between 2002 and 2006 to explain where the monies went. 71     Mr Khoo explained the nature of these legitimate expenses.[note: 37]At the hearing before me, Mr Khoo produced a list of expenses that included a cash payment to the Defendant, the payment of the Plaintiff’s tax liabilities, the insurance policies and education for their children, and mortgage payments for the Aspen Heights property from March 2003 to September 2006.[note: 38]I note that some monies were utilised for the part payment of the purchase price for #10-01 Pebble Bay before 2003 and the losses of investments in Horizon Global Equity, Eight C Fund and Eight D Fund, but Ms Ragupathy did not refute any of the expenses. Any remaining unaccounted monies at the end of 2006 would likely to have been S$177,918.28. However, this amount would have already been taken into account in the total value of the pool of assets under the Deed,ie, S$8,307,351 (see above at [57] about Annex 3). In conclusion, I find that the allegation of dissipation was not made out. The Plaintiff’s retirement benefits 72     As for the Plaintiff’s retirement benefits, Ms Ragupathy argued that they should be up for division. Ms Ragupathy also complained that the Plaintiff has not fully disclosed his income and/or interests in his legal practice. 73     This issue of non-disclosure has already cropped up several times in these proceedings. In Summons 3708 of 2007 and 3819 of 2007, the Deputy Registrar rejected the Defendant’s application for discovery in relation to the Plaintiff’s income and interests in all companies under the umbrella of Baker & McKenzie and all related documents. On appeal, the District Judge in Chambers allowed the appeal and ordered for discovery and interrogatories to be made in relation to the income and interest of the Plaintiff in Baker & McKenzie and Abogado Pte Ltd only. The Plaintiff appealed against the order of the District Judge. Andrew Ang J allowed the appeal after the Plaintiff filed the 4thaffidavit of Mr Robert S Spencer (“Mr Spencer”), the Chief Financial Officer of Baker & McKenzie International. The Plaintiff thus obtained four affidavits from Mr Spencer, which clarified and stated the Plaintiff’s interests and income from the various companies under the umbrella of Baker & McKenzie. 74     Ms Ragupathy alleged that the evidence of Mr Spencer could not be believed as Mr Spencer was somehow complicit with the Plaintiff in omitting relevant information or avoiding answering questions, despite having been sworn to state the truth in his affidavits. 75     This is a speculative and grave allegation that I am not willing to entertain in the absence of objective evidence. The four affidavits of Mr Spencer cumulatively show that all the income and interests whatsoever that the Plaintiff had in the companies have been disclosed at paragraph 7 of the first affidavit of Mr Spencer.[note: 39]Specifically, Mr Spencer stated at paragraph 6 of his third affidavit that all income received by the Plaintiff from Baker & McKenzie has been included in paragraph 7 of the first affidavit.[note: 40]I am not willing to infer from the omission of Mr Spencer to state this in his first and second affidavit that Mr Spencer is deliberately evasive and understating the Plaintiff’s income. The subsequent affidavits filed after the first affidavit clarified the first affidavit. There is thus no basis for the Defendant’s allegations of non-disclosure. 76     However, as a matter of principle, I did recognise that even though the entitlement to the benefits was prospective in nature it would nevertheless be considered a matrimonial asset.",
        "The Defendant seeks 60% share of the immovable properties": "77     The Defendant’s second complaint relates to the percentage of division under the Deed. She maintained that she was entitled to 60% of the immovable properties. Ms Ragupathy contended that according to the valuation as of 26 November 2012, the Defendant was given only 18% of all the matrimonial assets.[note: 41]Therefore, the division under the Deed was unfair. However, in my judgment, there was no legal justification for using the 2012 values. As for the 60% share, the Defendant’s assertion was without merit. This will be clear from my elaboration below.",
        "Other relevant factors": "78     Generally, to determine a just and equitable division in terms of percentage under s 112(2) of the Charter, I will have to consider the relevant factors listed. 79     It is trite law that the division of matrimonial assets eschews an examination of the exact contributions of husband and wife (seeNK v NL[2007] 3 SLR(R) 743 at [28]). The relevant principles are succinctly stated by Phang JA inPang Rosaline v Chan Kong Chin[2009] 4 SLR(R) 935 at [23]: In arriving at our decision as to what was a “just and equitable” division … we bore in mind, in particular, the following principles. The first centred on the fact that the division of matrimonial assets under s 112 of the Act is not – and cannot be – a precise mathematical exercise and that the court’s discretion is to be exercised in broad strokes instead … In this regard, it was also pointed out inNK v NL(at [22]–[27]), thatdirectfinancial contributions are not to be considered as aprima faciestarting point although they nevertheless constitute a factor which should be considered by the court pursuant to the exercise of its discretion under s 112 of the Act (which involves what is essentially a multi-factorial approach). We have also referred to the need to ensure thatindirectcontributions are also accorded due recognition (see [21] above). 80     The Court of Appeal’s observations inBCB v BCC[2013] 2 SLR 324 (at [13]–[26]) are apposite in this case where the Plaintiff’s direct financial contributions to the acquisition of real properties in Singapore and Malaysia during the marriage were significantly more than the Defendant who had a much lower income. At [27]: The purpose of highlighting the above decisions (which necessarily constitute but an indicative sample only) is to demonstrate a certain trend in cases that sharebroadlysimilar facts. This trend appears to be that, for marriages of moderate lengths of time … or for marriages which have lasted for a very long time …andwhere there are children to the marriage and both parties are working and have made direct as well as indirect contributions to the marriage, the courts would recogniseallthese contributionsdespitearguments to the effect that one party had mademore directfinancial contributions. [emphasis in original] 81     Adopting a “broad brush” approach to a division of the matrimonial assets is of particularly relevance in this case especially given (a) the significant number of assets, (b) that the exact financial contribution of each party to the acquisition of the assets was not fully documented by either party, and (c) the conflicting accounts of the extent of their contributions offered by both parties. As stated inYeo Chong Lin v Tay Ang Choo Nancy and another appeal[2011] 2 SLR 1157 (“Yeo Chong Lin”) at [66] and [81]: … What must be clearly recognised is that when the court makes such a determination it is not undertaking an exercise based on arithmetic but a judgmental exercise based, in part at least, on feel. … … At the end of the day, we wish to underscore the point that the broad brush approach, as stated in [66], is all about feel and the court’s sense of justice. 82     The Plaintiff argued that whatever the Defendant was given under the Deed was fair as he had paid for most of properties in Singapore and Malaysia. The Defendant, on the other hand, contended in her affidavits[note: 42]that she had also made direct financial contributions towards the acquisition of the properties too and alleged that the rental incomes from the various properties were used to pay off the loans on the properties. However, she was unable to adduce direct evidence of her payments towards such acquisitions. She referred to payments out of a Gleneagles and Kent Ridge account but no evidence was adduced to show the amounts and the periods of payments.[note: 43]In particular, while the Defendant alleged that she paid cash and used monies from her ASPF account to pay for the Leonie Hill property,[note: 44]she did not produce documents showing her contributions in this respect. Nevertheless, the Plaintiff did not deny that she had contributed financially, though in a limited way, to the acquisition of Leonie Hill.[note: 45] 83     The Plaintiff has adduced evidence showing that he had made substantial, if not the majority of the financial contributions towards the acquisition of the properties,[note: 46]in particular the Leonie Hill, #10-01 Pebble Bay and Aspen Heights properties. At any rate, it is not unreasonable to infer from the Plaintiff’s larger income earnings that he financed the acquisition of the properties. It was also an observable trend that the family’s wealth grew in the 1990s when the Plaintiff began working in Singapore. Their matrimonial home, Leonie Hill, was purchased in 1993, and the bulk of the properties in Singapore and in Malaysia were acquired after the Plaintiff became an international partner in Baker & McKenzie in 1993.[note: 47] 84     There is no doubt that the Plaintiff’s earnings as a lawyer in Singapore were more than the Defendant who was an academic. A comparison of the income tax declarations of the parties clearly showed that the Plaintiff’s income grew steadily over the years and was much larger than the Defendant’s income.[note: 48] 85     It was clear from the affidavits that the Plaintiff has worked hard and done very well in his second career and that his career switch has benefitted the family. He paid for most of the children’s education and living expenses overseas,[note: 49]as well as the insurance premiums for the children.[note: 50]The Defendant did not deny that the Plaintiff had paid for most of the children’s overseas education.[note: 51] 86     There is one other point in the Plaintiff’s favour. The properties in Singapore and Malaysia that were encumbered were largely repaid by 2012 and in this way, the Plaintiff managed to keep the bulk of the matrimonial assets intact without the assistance of the Defendant after 2003. In fact, the Plaintiff had paid for all the outstanding loans on the Aspen Heights property even though the Defendant was supposed to pay for half of them after the date of the Deed. From March 2003 to May 2012, the Plaintiff had managed to pay off the outstanding mortgage balance on the Leonie Hill property. Between March 2003 and 31 December 2010, the mortgage for #10-01 Pebble Bay was also fully paid for by the Plaintiff. Between March 2003 to February 2013, the Plaintiff had managed to pay off the Aspen Heights mortgage (albeit partly with the use of the matrimonial assets, see above at [71]), and S$722,362.07 of the #12-01 Pebble Bay mortgage from March 2003 to December 2011. Between March 2003 and January 2012, the Plaintiff had also managed to pay S$306,129.73 of the mortgage over the #12-10 Pebble Bay property.[note: 52]It was clear from the Plaintiff’s meticulous spread sheets that the loans (and their interest) were paid off by him, for which due credit for asset preservation should be accorded to him. In this regard, the Plaintiff’s wealth management efforts must be recognised. 87     The contributions of the Defendant must be considered too. The dynamics of the parties’ relationship and events prior to 1987 when the Plaintiff moved to Singapore to work as a lawyer are particularly important. For the first ten years of the marriage, the Defendant earned more than the Plaintiff.[note: 53]When the Plaintiff was in England studying for his engineering doctorate and law degree, the Defendant took a year’s sabbatical to be with him and the family.[note: 54]During those years, the Defendant cared for the older son and ran the household.[note: 55]The Defendant said she helped the Plaintiff complete his doctoral thesis.[note: 56]During the intervals when the Plaintiff was studying overseas and the Defendant was back in Malaysia with her son, the Defendant had to take care of her son and ran the household. Later, in the transition and during the early stages of the Plaintiff’s professional career, the family expanded with the birth of the parties’ second son, and the Defendant’s full time employment in academia would have given some measure of economic stability to the family. 88     The Defendant claimed that she paid for the Plaintiff’s tuition fees at Oxford,[note: 57]which the Plaintiff strongly denied.[note: 58]The Defendant submitted that from the years 1977 to 1987, she earned substantially more than the Plaintiff and all her earnings went towards the family expenses, paying off government/bank loans and supporting the Plaintiff in obtaining his degree. In contrast, the Plaintiff claimed that he was granted fully paid study leave and paid for his tuition and living expenses with monies from his pay and his scholarship allowance. He relied on his income tax statements from 1987 to 1988 to show that he was receiving an income during that period.[note: 59]In this respect, I am inclined to agree with the Plaintiff that he provided substantial funding for his studies. However, it is undeniable that the Defendant made indirect and non-financial contributions to the family while the Plaintiff was studying, by supporting the Plaintiff and taking care of the older son. 89     Between 1982 and 1984, the Plaintiff read law and concurrently pursued an engineering doctorate. The Plaintiff admitted that during those years, the family’s finances were tight. His evidence acknowledges that the Defendant’s salary was used largely to support herself and the elder child and to pay for the instalments on a house in Malaysia. His salary was used to support himself as well as pay for the instalments on a house he had purchased. A third property in Malaysia was financed by the rental income they collected. It is not disputed that the Plaintiff’s earnings in the period 1978 to 1987 compared to the Defendant’s earnings were about 40:60 in the Defendant’s favour.[note: 60]Thereafter, the Plaintiff worked in Singapore as a lawyer. 90     Indeed, the family’s fortune changed and improved tremendously in Singapore with the Plaintiff’s very substantial earning power which, over a lengthy marriage, generated a sizeable number of properties and a high standard of living for the family including overseas education for the children. Thus, the Plaintiff’sopportunityto be a high-income earner was the result of the parties’ earlier joint efforts. 91     Ms Ragupathy submitted that the Plaintiff was “made” by the Defendant. To claim that the Defendant “made” the Plaintiff who he is today is to downplay the Plaintiff’s own ability and drive. That said, a significant feature in this case was the Defendant’s contributions to the marriage by providing the necessary environment for the Plaintiff to successfully pursue a law degree and an engineering doctorate degree concurrently. It was a significant contribution to the marriage, for without his law degree, the Plaintiff would not have been able to confidently embark upon and successfully achieve a career switch that turned out to be one of the best decisions they made as a couple. In my view, the Defendant’s contributions to the marriage in the early years were essential to the Plaintiff attaining his law degree. However, there comes a point in time when the Plaintiff’s own ability to excel in his career allowed him to reap the benefits of a successful professional career and this continued after the separation and divorce. 92     As for their two children, there is conflicting evidence on both sides on their care and welfare. The Defendant maintained that she played a substantial role in the two children’s lives ferrying them to and from school and their extra classes, helping them with their homework, in addition to managing the household when the children were young. The Plaintiff disagreed, arguing that the Defendant continued to pursue her interests of reading extensively and attending classes for Chinese guzheng and embroidery art stitching. It was he who spent most of his free time with the children in their early childhood. Needless to say, both parents were working professionals and had to cope with the demands of balancing work and family. In my view, both contributed what they could in terms of time and effort within the spheres of their own work and non-work related activities to the welfare of the children. 93     During better times, both parties were good for each other as husband and wife. This was acknowledged by the Plaintiff in the e-mail dated 6 March 2003 (mentioned above at  [34]) which bears repeating here: … On my part, I acknowledge the contribution you have made to my life and the enrichment that I have had because of you. … and in an earlier e-mail to the Defendant on 8 February 2003,[note: 61]where he wrote: … [I] should be able to get over you over a period of time – 1 year, 2 years, who knows? [D]epends on whether [I] will find myself a good companion. [T]hat would be difficult.[Y]ou are a hard act to follow.[emphasis added]",
        "Recent awards": "94     Turning now to some relevant awards by the court, I observed that in the context of a working mother for a moderate to long marriage, the wife was generally awarded between 35% and 40% of the pool of assets. InLiew Chui Fong v Yew Kok Chin[2007] SGHC 225, the marriage lasted 28 years and the parties had two children. The wife who had worked throughout the marriage received 40% of the property. InPang Rosaline v Chan Kong Chin[2009] 4 SLR(R) 935, the parties were both working and had children. The wife was awarded 40% of the assets after 32 years of marriage. InAYQ v AQR[2013] 1 SLR 476, the family had two children and both spouses were working. The wife was awarded almost 41% of the assets after 23 years of marriage. InBHN v BHO[2013] SGHC 91, where both spouses were gainfully employed and were married for more than 20 years with two children, the wife received 40% of the matrimonial assets. 95     As for the following cases, the wife received 35% of the assets. InLeong Choon Kum v Chia Kin Tuck[2005] SGHC 73, the working mother of two attained about 35% of the assets after 22 years of marriage. InZD v ZE and Another[2008] SGHC 225, the wife was awarded 35% of the matrimonial assets. She had been married nearly 17 years and had three children. She had worked at the husband’s company and had also looked also after the children who were all diagnosed with Attention Deficit Hyperactive Disorder. InAOH v AOI[2011] SGHC 14, the court ordered the husband to pay 35% of the assets to the wife who was working full-time. The couple had been married for 12 years and had one child. 96     I observed that in most of the cases identified in the sample above, where the wife received 35% of the matrimonial assets, the marriage was generally less than 20 years. On the other hand, for marriages more than 20 years, the wife was awarded 40%. However, I note that in exceptional cases where the value of the assets is very large, then even for long marriages, the percentage awarded to the wife could be less than 35%. This was the case inYeo Chong Linwhere the court upheld the trial judge’s order of 35:65 even though the marriage lasted for 49 years, and the wife had been a housewife.",
        "Just and equitable division": "97     There are features in this case which warrant a departure from the 34% division under the Deed to the Defendant, but this does not mean that the Defendant is entitled to 60% of the matrimonial assets as she contended or that the Deed will be given little or no weight. In this particular case, a just and equitable division would require a reapportionment of the percentage division under the Deed based on an asset pool of S$8,307,351. In addition, the Plaintiff’s retirement benefits which were not covered by CSK’s report[note: 62]and not explicitly stated in the Deed will be dealt with separately from the Deed. 98     After considering all the facts and circumstances of this case, including the Deed as a factor under s 112(2)(e) of the Charter, I find that a just and equitable division would be a 40% share to the Defendant. This leads me to the next issue which is the pool of assets and the valuation dates. Applicable dates to the pool of assets and valuation 99     The debate between the parties was as follows. Mr Khoo argued that the matrimonial assets should be determined and valued as of the date of the Deed, while Ms Ragupathy argued that what constituted a matrimonial asset should be determined as of the date of the Deed, but they should be valued as of the first ancillary hearing on 2 October 2012. 100    The Court of Appeal inYeo Chong Linrecognised that there was no definitive operative date for deciding what fell in the category of matrimonial assets, and that depending on the nature of the assets and the circumstances surrounding their acquisition, multiple dates were distinctly possible (at [36]). The court noted that broadly, there were four timelines that a court could adopt: [39] … The first is the date of separation. The second is the date on which the petition of divorce is filed. The third is the date on which a decreenisiis granted. The fourth is the date of hearing of ancillary matters (including the date of the hearing of an appeal). … 101    On the facts, I found that the date on which the Deed was signed was the date at which parties had formally recorded the parties’ decision to go their own separate ways. The Deed itself was set out in a manner to bring an end to the relationship and was indeed the date of separation. In the Deed, it was clearly stated in the recitals that parties had agreed to live apart from each other from 12 March 2003 and that parties were now seeking “financial independence of each other”. Furthermore, the Deed stated that the Deed was a formalisation of the division of assets. At clauses 2.6 to 2.10 of the Deed, the parties had agreed to stop using overdraft facilities, wind down joint accounts in Malaysia, Singapore and anywhere else, and cancel each other’s supplementary credit cards. I found this to be a clear sign that the parties no longer wanted to be financially liable to each other and for each other’s debts. I thus used March 2003 as the operative date for identifying all matrimonial assets in the pool. 102    As for the value of the pool,Yeo Chong Linhad stated at [39] that the value “must be assessed” as at the date of the hearing. In this case, this meant a valuation of assets as of 2012. However, it must be kept in mind thatYeo Chong Linwas not a case where a s 112(2)(e) agreement was in issue. 103    One interpretation of the reasoning inYeo Chong Lincould be that the assets should be divided at the latest time possible so that both parties share the benefit or burden of the increase or decrease in the value of the asset. On the other hand, some cases seem to support the position that there is judicial discretion to choose another date which might be more just. In a decision afterYeo Chong Lin, Anthony Patrick Nathan v Chan Siew Chin[2011] 4 SLR 1121 (“Anthony Patrick Nathan”), Quentin Loh J preferred a more flexible rule to the date of valuation and concluded at [29]: Ultimately, the date on which matrimonial assets should be valued is up to the court's discretion, just as it is when it comes to the operative date on which the pool of matrimonial assets should be determined. What is critical is to arrive at a \"just and equitable division\" … in all the circumstances in each particular case. However,Anthony Patrick Nathandid not discuss the ruling in [39] ofYeo Chong Lin. 104    The same approach was observed by Loh J in the later case ofYong Shao Keat v Foo Jock Khim[2012] SGHC 107 at [10], and Steven Chong J inChan Yuen Boey v Sia Hee Soon[2012] 3 SLR 402 followedAnthony Patrick Nathan. These two cases also did not discuss the ruling in [39] ofYeo Chong Lin. 105    In an appropriate case, as Loh J rightly observed, an alternative valuation date can apply, as illustrated in the case ofWan Lai Cheng v Quek Seow Kee and another appeal and another matter[2012] 4 SLR 405 (“Wan Lai Cheng”), where the Court of Appeal unanimously decided that several of the properties were to be valued as at the date a few days after the wife filed for divorce (this was done for the convenience of both parties)ie, 31 July 2007, rather than at the date of the judgmentie, 14 January 2011. InWan Lai Cheng, the Court of Appeal found that after 31 July 2007, the husband had enhanced the liabilities over the properties for his own benefit, and not for the benefit of both spouses. It was therefore just and equitable for the court to decide that a later date should not be chosen, but rather an earlier date which was closer to the commencement of the divorce proceedings. 106    Therefore, although the general starting point would be that as iterated inYeo Chong Lin, the case law seems to indicate that the court will have discretion to choose a more appropriate date of valuation. 107    In this case, I find that the appropriate date to value the pool would be March 2003. On its face, the Deed was clearly meant to sever all relationships between the parties. The three years in between would be for parties to sort out their various obligations under the Deed and eventually allow for either party to file for a divorce. Clause 1.6.2 makes it even clearer that the division was to be as at the date of the Deed: In the event that a petition is filed for a decree of divorce based on the ground that the marriage has broken down irretrievably…, the party against whom the petition for a decree is filed, hereby irrevocably agrees to give her or his consent: (a) in writing … and (b) to theconsent order of court embodying such terms as the [Plaintiff] and the [Defendant] may agree based upon the general division of assets set out in this Deed.[emphasis added] What the clause suggests is that parties contemplated that they would still be bound by the Deed in an application for divorce filed three years later. The inference to be drawn was that the assets were to be valued as of 2003, at the point of the division, and that there would be, in effect, no re-opening of the distribution of assets. 108    The inference above is reinforced by the reasons stated above at [101]. I agree with Mr Khoo that the marriage had long since ended and the separation was certainly final in light of the Plaintiff’s serious relationship with his current wife back then. 109    Mr Khoo even tabulated a chronology of proceedings to show the development of the long-drawn dispute between the parties.[note: 63]Mr Khoo’s related argument was that the Defendant had prolonged the proceedings so as to take advantage of the rising property market to enhance the size of her share. According to the valuations submitted by Ms Ragupathy, as of 26 November 2012, the values of the Properties had increased to S$14,544,193.[note: 64]I accept that the ancillary proceedings were indeed prolonged, however, it was not necessary for me to decide on whether the time lapse between the separation and the first ancillary hearing was unwarranted. As stated earlier, I did not accept Ms Ragupathy’s calculation of the Defendant’s claim based on the 2012 valuations. 110    By way of observation, an appropriate case where the date of a s 112(2)(e) agreement could be departed from, is where there is evidence of bad faith demonstrating one party’s deliberate attempt to prolong the period before the ancillary hearing to the disadvantage of the other in the knowledge of the value of the pool increasing over time for reasons such as anen blocsale. This will result in a division at the later date looking more unjust as it will be tilted in favour of the party guilty of bad faith. The assessment 111    In light of the matters aforesaid, I find that the pool of assets and the valuation would be as of March 2003. Further, as stated in my finding earlier at [98], a just and equitable division is to award a 40% share to the Defendant. 112    To recapitulate, strictly under the Deed (see [60]–[61]), the Defendant would be receiving S$2,799,737 out of the total assets of S$8,307,351. The division to her was as follows: (a)     S$1,060,197 of the Uncontested Assets; (b)     S$427,586 for Aspen Heights and W Vista Kiara; (c)     S$174,120 from the Fixed Deposit; (d)     S$437,834 from Leonie Hill; and (e)     S$700,000 per clause 3 of the Deed (of which the Plaintiff has already paid S$100,000). 113    With the reapportionment of the percentages to 40%, the Defendant would be receiving 6% more of the total assets comprised under the Deed, or, S$498,441, and I so award her this additional amount in cash contributions from the Plaintiff. 114    In relation to the Plaintiff’s retirement benefits, I find that the Defendant would have been entitled to a share of the Plaintiff’s retirement benefits up to March 2003. 115    As for the dispute on the quantum, the Defendant claimed that she was entitled to part of a sum of US$951,056.[note: 65]This was based on an amalgamation of numbers found in Mr Spencer’s various affidavits. As of 2008, the Plaintiff would be able to withdraw US$348,724 from his capital account, and attain US$134,124.67 that was withheld for contingent tax liabilities.[note: 66]Additionally, should the Plaintiff retire at age 65, he would be entitled to a lump sum payment of US$271,208, a seniority-based annual entitlement of $77,000. As for his client origination-based entitlement, LPK estimated this based on 2008 figures and arrived at US$120,000.[note: 67]It was quickly apparent that the numbers were contingent on time as well as the Plaintiff’s date of retirement. 116    Based on the best information available before me, I used the 2007 values found in Mr Spencer’s affidavits. Therefore, as of 2007, the Plaintiff would have been able to withdraw US$323,724 from his capital account and attain US$60,064.15 for contingent tax liabilities. Should the Plaintiff have retired in 2008 (after one year’s notice from 2007) he would be entitled to US$31,469 as a lump sum payment and US$60,800 as a seniority-based portion of his annual entitlement. His client origination portion would be about US$100,000, being the average of what Mr Spencer had stated.[note: 68]Therefore, the total amount would be US$576,057. 117    Accordingly, I order that the Plaintiff to pay the Defendant 40% of US$576,057, being US$230,422.80 in cash contributions. Adjustments between the parties within the Deed 118    According to clause 2.2, read with clause 2.3.1(a) of the Deed, the Defendant was to pay for half of the mortgage on the Aspen Height property, however she did not do so. As mentioned above at [71], the Plaintiff had used part of the matrimonial assets (from the Revised Contested Accountsie, Annex 3) to pay off the mortgage payments for the Aspen Heights property from March 2003 to September 2006 which totalled S$354,542.88. Subsequently, the rest of the mortgage payments were paid for by the Plaintiff out of his own pocket. I was also informed by Mr Khoo that by March 2013, the mortgage had been fully redeemed by the Plaintiff.[note: 69]According to Mr Khoo’s letter to the court dated 14 May 2013, the Plaintiff had paid a total of S$1,024,260.26 including interest from March 2003 onwards. It would be double-counting not to deduct the payments made from the Revised Contested Accounts. Therefore, the Plaintiff had essentially paid S$669,717.38 for both his and the Defendant’s share of the loan. As such, the Plaintiff is entitled to be paid back S$334,858.69 by the Defendant under clauses 2.2 and 2.3.1(a) of the Deed. 119    At the same time, the Plaintiff was required to pay a total of S$700,000 to the Defendant by 2008 under clause 3 of the Deed, but did not carry this part out entirely. According to Ms Ragupathy’s letter to the court dated 17 May 2013, the Plaintiff withheld the payments under clause 3 of the Deed as the Defendant had refused to transfer the beneficial interests in some of the properties to him and he had deemed the withholding of the sums as a means to pay off the Defendant’s share in the property loans. Thus far, the Defendant has received S$100,000. Hence, the Plaintiff is required to pay the Defendant the remaining S$600,000. I also note that the Plaintiff has not refunded the Defendant’s principal ASPF contributions to the Leonie Hill property. 120    In the final adjustment between the parties, they would have to account for the sums stated above to each other. Therefore, in setting off the amounts owed between the Plaintiff and the Defendant, I find that the Plaintiff is to pay the Defendant the net sum of S$265,141.31 under clause 3 of the Deed. In arriving at this net figure, I have already taken into account the S$100,000 that the Plaintiff has paid. Additionally, I find that the Plaintiff is to pay the Defendant for her principal ASPF contributions to the Leonie Hill property.",
        "Maintenance": "121    The Defendant argued that if she could not attain 60% of the immoveable properties, she wanted maintenance at $2,500 a month. In the light of my award of 40% to the Defendant, I have to consider what an appropriate amount of maintenance would be. Section 114(1) of the Charter states that: (1)    In determining the amount of any maintenance to be paid by a man to his wife or former wife, the court shall have regard to all the circumstances of the case including the following matters: (a)    the income, earning capacity, property and other financial resources which each of the parties to the marriage has or is likely to have in the foreseeable future; (b)    the financial needs, obligations and responsibilities which each of the parties to the marriage has or is likely to have in the foreseeable future; (c)    the standard of living enjoyed by the family before the breakdown of the marriage; (d)    the age of each party to the marriage and the duration of the marriage; (e)    any physical or mental disability of either of the parties to the marriage; (f)    the contributions made by each of the parties to the marriage to the welfare of the family, including any contribution made by looking after the home or caring for the family; and (g)    in the case of proceedings for divorce or nullity of marriage, the value to either of the parties to the marriage of any benefit (for example, a pension) which, by reason of the dissolution or annulment of the marriage that party will lose the chance of acquiring. 122    The Plaintiff rejected the Defendant’s claim for maintenance as fanciful and the quantum as excessive. He submitted that the Defendant is financially independent and does not need maintenance. To reinforce his contention, he pointed out that after the parties separated, the Defendant did not seek maintenance from the Plaintiff, and did not apply for interim maintenance. The arguments are legally unsound for as a matter of principle, the Defendant is entitled to seek maintenance under the Charter. 123    The principles governing the court’s power to order maintenance for a former wife were comprehensively canvassed by the Court of Appeal inFoo Ah Yan v Chiam Heng Chow[2012] 2 SLR 506 at [12]–[19] (“Foo Ah Yan”). The overarching principle is that of financial preservation, which requires the wife to be maintained at a standard, which is, to a reasonable extent, commensurate with the standard of living she had enjoyed during the marriage (Foo Ah Yanat [13]). The court applies s 114(2) in a commonsense holistic manner that takes into account the new realities that flow from the breakdown of a marriage and responds to the requirements of justice in each case (Foo Ah Yanat [15]–[16]). Hence it has been observed that the aim in ordering maintenance of a wife is to even out any financial inequalities between spouses, taking into account any economic prejudice suffered by the wife during the marriage. The courts have also held that a former wife must, where possible, exert reasonable efforts to secure gainful employment and contribute to preserve her pre-breakdown lifestyle and that although the husband isprima facieobliged to maintain his former wife beyond his retirement and up to the former wife’s remarriage or the death of either party, the former wife who has assets of her own should not expect a full subsidy for her lifestyle. The Court of Appeal inFoo Ah Yanalso made it clear at [20]–[22] that the non-provision of maintenance to the wife during marriage does not preclude the court from ordering maintenance for the wife after divorce. 124    Ultimately, it is the reasonableness of the maintenance claim compared to the husband’s ability to pay which guides the court’s application of the principle of financial preservation (Foo Ah Yanat [19]). 125    The court’s power to order maintenance is supplementary to its power to order a division of the matrimonial assets, such that the courts regularly take into account each party’s share of the matrimonial assets when assessing the appropriate quantum of maintenance (Foo Ah Yanat [26]. 126    The Defendant had earlier stated that her living expenses were about S$23,438 a month, while her monthly take home pay was S$14,865.[note: 70]There was no explanation on how the Defendant made up for the shortfall since 2003, and I agree with Mr Khoo that there was also no evidence to support her expenses. I also agree that the Defendant had grossly overstated her initial claim of S$23,438 a month seeing that Ms Ragupathy eventually proposed a significantly reduced monthly figure of S$2,500 at the adjourned hearing. 127    The Defendant is now 62 years of age and will be looking to retiring in the near future and with that, her earnings from academia will stop, leaving her only with potentially passive income from the properties. Bearing in mind the relevant principles cited above, I am of the view that the Defendant should be given a monthly sum of S$1,650. 128    As the divorce was acrimonious, I am of the view that a lump sum maintenance would be appropriate in the circumstances. Accordingly, I order that the Plaintiff is to pay the Defendant a lump sum maintenance of S$200,000 to the Defendant, being the rounded up monthly sum of S$1,650 multiplied by the multiplicand of 10, representing 10 years of maintenance.",
        "Orders to be made": "129    The parties are to carry out the terms of the Deed in the light of the orders made here at [113], [117], [119], [120] and [128]. To this end, parties are directed to work out the precise orders they require from this court, taking into account the set-offs at [120]. Arithmetical corrections, if any, should be dealt with in the precise orders to be made. Parties are to write in to the Registry as soon as they are ready with a draft order. At the same time, I will hear parties on costs.",
        "Annex 1: The Properties": "No.PropertyValuation as of March 2003 (S$)1#12-01 Pebble Bay338,0142#12-10 Pebble Bay211,4323#10-01 Pebble Bay388,8944H Vista Kiara201,6085Lanai Kiara137,6506Plaza Mont Kiara247,4287Danau Permai Condo137,4608Orchard Heights105,3869Aspen Heights221,39610W Vista Kiara206,19011Leonie Hill896,337TotalS$3,091,795",
        "Annex 2: The Contested Accounts": "No.Description (cf CSK’s report appendix 4)Defendant’s amount (S$)Plaintiff’s amount (S$)1ABN AMRO Joint Account No [xxx151] (S/N 65)879,624.30444,808.602UBS AG Joint Account No [xxx998] (S/N 59)1,897,486.72731,939.793UBS Painewebber Joint Account No [xxx288] (S/N 40)117,708.88110,987.684DBS Account No [xxx72-5] (S/N 61, 64)235,318.00174,002.615Horizon Global Equity (S/N 29)216,322.11161,917.746Eight C Fund (S/N 31)61,152.2251,876.327Eight D Fund (S/N 30)53,490.8742,857.14TotalS$3,461,103.10S$1,718,389.88",
        "Annex 3: The Revised Contested Accounts": "No.DescriptionAmount (S$)1ABN AMRO Joint Account No [xxx151]879,6242UBS AG Joint Account No [xxx998]836,4173UBS Paine Webber Joint Account No [xxx288]117,7094DBS Account [xxx72-5]170,7155Horizon Global Equity216,3226Eight C Fund61,1527Eight D Fund53,491TotalS$2,335,430",
        "Annex 4: Uncontested Assets": "No.AssetValue (S$)OwnershipMotor Vehicles1Jaguar Model No SOV 3.2LWB025,217.00Plaintiff2Jaguar40,000.00DefendantSub-total65,217.00Insurance Policies1Prudential Insurance (Prulink) Policy No [xxx099]160,541.54Party insured: PlaintiffBeneficiary: Plaintiff’s estate2Prudential Insurance Policy No [xxx619]88,236.01Party insured: PlaintiffBeneficiary: Plaintiff’s estate3Prudential Insurance Policy No [xxx485]28,406.58Party insured: DefendantBeneficiary: Plaintiff4Hartford Life [xxx660]32,745.84Plaintiff5Prudential [xxx015] (Investment Linked Policy) Whole life Par Series 2355,926.36Defendant6Insurance policy [xxx536]25,177.46Defendant7Prudential unit trust investments [xxx015]263,211.00DefendantSub-total955,244.79Investments of shares, unit trusts etc. in Singapore or overseas, and bank accounts in Singapore and overseas1DBS Vickers Securities – SGD Securities123,670.00Plaintiff2CPF DBS Investment43,140.00Plaintiff3OCBC [xxx171] Supp Ret. Scheme Investment A/c58,132.85Defendant4Shares7.10Defendant5Shares – Cityneon1,750.00Defendant6Saujana Consolidated Bhd366.56Plaintiff7DBS Vickers Securities – USD Securities83,253.25Plaintiff8POSB A/c No [xxx14-1]39,437.41Plaintiff9HSBC A/c No [xxx490]46,031.30Plaintiff10DBS Bank A/c No [xxx27-2] (overdraft)(56,297.31)Joint account11DBS Bank (Sgp) [xxx59-5]74.82Joint account12DBS Bank SGP Auto [xxx94-1]16,012.07Joint account13Joint bank a/c BOA [xxx713]10,139.61Joint account (Defendant and son)14DBS autosave A/c [xxx01-5]35,854.22Defendant15DBS Savings A/c [xxx614]1,000.00Defendant16ABN-AMRO Bank A/c No [xxx202]443,816.94Plaintiff17HSBC A/c No [xxx081]578.39Joint account18ABN-AMRO HK [xxx518]992.03Joint account19Maybank A/c No [xxx448] (current account)14.38Plaintiff20Maybank A/c No [xxx405]27,803.19Joint account21Malayan Banking A/C [xxx455]6,102.61Defendant22Malayan Banking A/C [xxx908] (Fixed Deposit)18,111.66Defendant23Loan to Homestead20,336.60Defendant24National Westminster Bank Plc A/c No [xxx921] (current account)632.75Joint account25National Westminster Bank Plc A/c No [xxx582]1,890.79Joint accountSub-total922,851.22CPF/EPF/ASPF monies1CPF161,332.16Plaintiff2EPF – Malaysian Govt Compulsory Savings57,189.85Plaintiff3CPF129,486.91Defendant4EPF balances61,804.80Defendant5EPF Unit Trust Investments11,695.28DefendantSub-total421,509.00Club Memberships1Saujana Country Club9,164.00Plaintiff2Singapore Cricket Club3,500.00Plaintiff3Tioman Island Resort Bhd2,800.00Plaintiff4Sub-total15,464.00Other assets/investments1Jewellery31,600.00Defendant2Winder collection35,000.00Plaintiff3Watches and jewellery15,000.00Plaintiff4Artworks and paintings40,000.00Plaintiff5Rosewood furniture30,000.00PlaintiffSub-total151,600.00Grand TotalS$2,531,886.01    [note: 1]Plaintiff’s Bundle of Submissions (“PBS”), Tab 1, para 41. [note: 2]PBS, Tab 4, para 151. [note: 3]PBS, Tab 1, para 16. [note: 4]PBS, Tab 4, para 13. [note: 5]Plaintiff’s Bundle of Affidavits (“PBA”), Tab 3, p 149; This is the same e-mail referred to in the 2012 Judgment at [32]. [note: 6]PBA, Tab 3, pp 151-152 [note: 7]PBS, Tab 2, point 7.3. [note: 8]Defendant’s Bundle of Documents (“DBD”), Tab 39, p 137. [note: 9]DBD, Tab 39, p 4. [note: 10]PBA, Tab 16, pp 241–245. [note: 11]Defendant’s Bundle of Submissions (“DBS”), Tab 5, Table D; PBS, Tab 5, pp 4–7. [note: 12]PBA, Tab 18, p 37. [note: 13]PBS, Tab 5, p 4. [note: 14]PBA, Tab 17, pp 74–75. [note: 15]PBA, Tab 1, p 214. [note: 16]PBA, Tab 1, p 190. [note: 17]DBD, Tab 14, p 275. [note: 18]PBA, Tab 17, p 80. [note: 19]PBA, Tab 1, p 189. [note: 20]PBA, Tab 16, p 65. [note: 21]DBD, Tab 34, p 799. [note: 22]PBA, Tab 16, p 63. [note: 23]DBS, Tab 5, Table D. [note: 24]PBA, Tab 1, p 215. [note: 25]PBA, Tab 17, pp 108–112. [note: 26]DBD, Tab 39, p 1046. [note: 27]PBA, Tab 16, p 62. [note: 28]PBA, Tab 16, p 63. [note: 29]PBA, Tab 16, pp 60–67. [note: 30]CSK’s report, p 44. [note: 31]DBS, Tab 5, para 61. [note: 32]PBS, Tab 6, Annex 9. [note: 33]DBS, Tab 1, pp 46–47. [note: 34]DBS, Tab 1, paras 103–107. [note: 35]DBS, Tab 5, paras 24–25; Table D. [note: 36]Notes of Arguments, p 23. [note: 37]PBS, Tab 5, p 8. [note: 38]PBS, Tab 5, pp 8–11. [note: 39]PBA, Tab 19, p 3. [note: 40]PBA, Tab 25, p 2. [note: 41]Defendant’s Bundle of Tables, Vol 2, Table O. [note: 42]DBD, Tab 33, pp 13–15; Tab 34, pp 11–13. [note: 43]DBD, Tab 33, pp 13–14. [note: 44]DBD, Tab 33, p 13. [note: 45]PBA. Tab 9, p 25. [note: 46]PBA, Tab 9, pp 25–29, 196–214. [note: 47]Miscellaneous Bundle of Documents (“MBD”), Tab 1, pp 2–3; PBS, Tab 1, p 6. [note: 48]PBA, Tab 1, pp 32, 49–116, 256–275. [note: 49]PBA, Tab 1, pp 43, 296. [note: 50]PBA, Tab 1, pp 43, 313. [note: 51]DBD, Tab 34, p 26. [note: 52]MBD, Tab 1, pp 4–12. [note: 53]DBD, Tab 33, pp 8–10; DBD, Tab 36. P 30. [note: 54]DBD, Tab 33, pp 8–9. [note: 55]DBD, Tab 33, pp 9–10 [note: 56]DBD, Tab 33, pp 10. [note: 57]DBD, Tab 33, p 9; DBD, Tab 36, p 31. [note: 58]PBA, Tab 18, pp 30–31. [note: 59]PBA, Tab 17, pp 2–3; 26–36. [note: 60]PBS, Tab 3, pp 21–22. [note: 61]PBA, Tab 2, p 85. [note: 62]PBS, Tab 7, p 5. [note: 63]PBS, Tab 4, Annex 11. [note: 64]Defendant’s Bundle of Tables, Vol 2, Table O. [note: 65]DBD, Tab 39, p 142. [note: 66]PBA, Tab 25, p 2. [note: 67]PBA, Tab 19, pp 5–6. [note: 68]PBA, Tab 19, pp 4–5. [note: 69]Notes of Arguments, p 36. [note: 70]DBD, Tab 33, pp 19–21."
    }
}