{
    "case_title": "BFC\n      v\n      Comptroller of Income Tax",
    "ncitation": "[2013] SGHC 169",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "Introduction": "1       This is an appeal by a taxpayer (“the Appellant”) against the decision of the Income Tax Board of Review (“the ITBR”) in Income Tax Appeals Nos 6 and 7 of 2011. The ITBR upheld the decision of the Comptroller of Income Tax (“the Comptroller”) that certain borrowing expenses incurred by the Appellant in respect of two bond issues were not deductible for the purposes of assessing income tax. Dissatisfied with the decision of the ITBR, the Appellant appealed to the High Court vide this Income Tax Appeal No 2 of 2013 (“TA 2/2013”).",
        "Background": "2       The Appellant carries on the business of hospitality, investment holding and property investment. The Appellant also owns and operates a hotel (“the Hotel”). In 1995 and 1996, the Appellant issued bonds (subsequently referred to as “the 1995 Bonds” and “the 1996 Bonds” respectively). Each bond issue was for a five year term with the 1995 Bonds maturing in 2000 and the 1996 Bonds maturing in 2001.",
        "The 1995 Bonds": "3       The 1995 Bonds were secured bonds with a principal amount of $150,000,000. Interest was payable semi-annually in arrears on the principal amount at 5.625% per annum. In addition to interest, the Appellant also offered a discount and redemption premium to purchasers. The issue price of the 1995 Bonds was set at 99.5695% of the principal amount. This provided a discount of 0.4305% or $645,750 on the principal amount. The redemption premium, which was payable upon maturity and set at 1.5% of the principal amount, amounted to $2,250,000. 4       It was the Appellant’s case that the proceeds of the 1995 Bonds were used for three purposes: (a) the financing of the renovation of the Hotel; (b) the refinancing of the existing borrowings of both the Appellant and its subsidiaries; and (c) as working capital for the day-to-day operations of the Appellant’s business.",
        "The 1996 Bonds": "5       The 1996 Bonds were unsecured bonds with a principal amount of $165,000,000. Interest was payable annually in arrears on the principal amount at 5.75% per annum. As with the 1995 Bonds, the Appellant offered a discount on the 1996 Bonds. The issue price of the 1996 Bonds was thus set at 92.9197% of the principal amount, giving a discount of 7.0803% or $11,682,495. The Appellant did not offer a redemption premium for the 1996 Bonds. 6       It was the Appellant’s case that the proceeds of the 1996 Bonds were used as working capital to finance the day-to-day operations of the Appellant’s business.",
        "The Disputed Tax Treatment": "7       In assessing the Appellant’s income that was chargeable with tax, the Comptroller allowed the deduction of interest paid on the 1995 Bonds and the 1996 Bonds. With regard to the 1995 Bonds, the Appellant was able to identify (and the Comptroller accepted) that part of the net proceeds, in the sum of $36,564,000, was used to finance the renovation of the Hotel. The Comptroller allowed a proportionate deduction for the interest paid on the 1995 Bonds. The Appellant sought a similar deduction relating to the discount and redemption premium incurred in respect of the 1995 Bonds. 8       As for the balance of the proceeds of the 1995 Bonds and the 1996 Bonds, the Comptroller regarded this as forming a mixed pool of funds. Here, the Comptroller applied an interest adjustment method known as the Total Assets Method (“the TAM”). Applying the TAM, the Comptroller only allowed a deduction for interest expenses attributable to income-producing assets. The Appellant thus sought similar deductions based on the TAM for the discounts and redemption premium paid on the 1995 Bonds and the 1996 Bonds. 9       Based on [7] and [8] above, the sums claimed by the Appellant as deductibles were as follows: (a)     $2,439,598 for Year of Assessment 2001 in relation to the discount and redemption incurred in respect of the 1995 Bonds; and (b)     $8,731,692 for Year of Assessment 2002 in relation to the discount incurred in respect of the 1996 Bonds. 10     The Comptroller disallowed the Appellant’s claims for the above deductions on two grounds. First, the Comptroller found that the discounts and redemption premium were not “interest” and therefore not deductible under s 14(1)(a) of the Income Tax Act (Cap 134, 2001 Rev Ed)(“the ITA”). Second, the Comptroller found that the discounts and redemption premium were not outgoings and expenses wholly and exclusively incurred in the production of the Appellant’s income chargeable with tax and therefore not deductible under s 14(1) of the ITA. 11     Dissatisfied with the Comptroller’s disallowance of its claims, the Appellant appealed to the ITBR.",
        "The Decision of the ITBR": "12     The appeal was heard by the ITBR on 25 July 2012. The ITBR dismissed the appeal in its grounds of decision (“the GD”) dated 14 December 2012. The ITBR held that the discounts and the redemption premium were not deductible for three primary reasons. (Henceforth the reference to paragraphs in the GD of the ITBR will be in parentheses.) 13     First, the discounts were not deductible under s 14(1) of the ITA as they only related to the non-receipt of the amount of the discounts (at [17]–[18]). Therefore, they were not “outgoings or expenses” incurred by the Appellant. 14     Second, the discounts and redemption premium were not deductible under s 14(1) of the ITA because part of the bond proceeds formed a mixed pool of funds, some of which were not used for income producing purposes. Accordingly, the discount and redemption premium were not wholly and exclusively incurred in the production of the income (at [24]). 15     Third, the discounts and redemption premium were not “interest” within the meaning of the term under s 14(1)(a) of the ITA and therefore did not rank for deduction under that provision. This was so as the discounts and redemption premiums were one-off payments while interest remained payable as long as the bonds remained unredeemed (at [27]). Furthermore, s 10(1)(d) of the ITA referred distinctly to “interest” and “discount”, thereby importing a difference between the two, even if they were both examples of borrowing costs (at [28]). In this regard, the 2008 amendments to the ITA which specifically provided for the deduction of discounts and redemption premiums also suggested that such borrowing costs were not interest (at [29]). 16     The Appellant appealed to the High Court against the whole of the ITBR’s decision.",
        "The Scheme Relating to the Deduction of Expenditure under the ITA": "17     Income chargeable with income tax is arrived at after taking into account the various deductions allowed under the ITA. In this regard, s 14 prescribes a positive test of deductibility and provides for what is deductible. In these proceedings, the Appellant claims that the sums paid as discounts and redemption premium were deductible under ss 14(1) or 14(1)(a) of the ITA. The relevant provisions read: 14.—(1) For the purpose of ascertaining the income of any person for any period from any source chargeable with tax under this Act (referred to in this Part as the income), there shall be deducted all outgoings and expenses wholly and exclusively incurred during that period by that person in the production of the income, including (a) except as provided in this section – (i) any sum payable by way of interest;… (ii) … upon any money borrowed by that person where the Comptroller is satisfied that such sum is payable on capital employed in acquiring the income; … I should add that it is common ground between the parties that the Appellant only needs to succeed on either s 14(1) or s 14(1)(a). The Comptroller accepts that the requirements for deductibility under s 14(1) and under the subparagraphs of s 14(1) are separate and independent. 18     On the other hand, s 15 of the ITA prescribes a negative test of deductibility. It provides for what is not deductible notwithstanding the fact that the expenditure satisfies the positive test of deductibility under s 14. In these proceedings, s 15(1)(c) is pertinent. It reads: 15.—(1) Notwithstanding the provisions of this Act, for the purpose of ascertaining the income of any person, no deduction shall be allowed in respect of – … (c) any capital withdrawn or any sum employed or intended to be employed as capital except as provided in s 14(1)(h); … The effect of s 15(1)(c) is that an expense will not rank for deduction if the expense is capital as opposed to revenue in nature. 19     Based on the foregoing statutory provisions, the issues in this appeal are as follows: (a)     Whether the discounts and redemption premium were “interest” under s 14(1)(a) of the ITA. (b)     Whether the discounts and redemption premium were outgoings and expenses wholly and exclusively incurred in the production of the Appellant’s income under s 14(1) of the ITA. (c)     Whether the discounts and redemption premium were capital as opposed to revenue expenses and therefore prohibited from deduction under s 15(1)(c) of the ITA.",
        "Were the discounts and redemption premium “interest” under s 14(1)(a) of the ITA?": "20     Section 14(1)(a) of the ITA grants a deduction to sums payable as “interest” upon money borrowed by the taxpayer. The term “interest” however is not defined by the ITA. Rather, its meaning falls to be determined as a matter of statutory interpretation. Surprisingly, there has been little local authority interpreting the term. In this regard, the leading local authority isChng Gim Huat v Public Prosecutor[2000] 2 SLR(R) 360 (“Chng Gim Huat”). 21     The facts inChng Gim Huatare straightforward. The taxpayer had extended a loan to a friend. The taxpayer later sought repayment of the loan and received several sums of money from the borrower. The taxpayer then argued that the repayments were capital in nature as opposed to interest income. The issue then was whether these sums were interest income and whether the taxpayer had wilfully omitted them from his income tax returns with the intention to evade tax. In discussing the meaning of “interest”, Yong Pung How CJ said (at [28]): The Act itself does not contain a definition of the term “interest” which has been defined in the Oxford English Dictionary, vol VII (2nd Ed, 1989) at p 1099 as: money paid for the use of money lend (the principal), or for forbearance of a debt, according to a fixed ratio “Interest” has also been described as “the return or compensation for the use or retention by one person of a sum of money belonging to or owed to another”: Halsbury’s Laws of England vol 32 (Butterworths, 4th Ed Reissue) at para 106 and as “compensation for the delay in payment”:perFarrell J inBond v Barrow Haematite Steel Company[1902] 1 Ch 353 at 363. The Scottish Lord President Lord Strathclyde inSchulze v Benstead1916 SC 188 at 191 approved what I consider to be a useful working definition which has been cited in theSingapore Master Tax Guide 1998(17th Ed) at para 893: Interest signifies a sum payable in respect of the use of another sum of money, called the principal.It is also often described as a compensation for delayed payment. There is no definition of the word  ‘interest’ in the Income Tax Act. A good working definition for tax purposes, was given inSchulze v Benstead(Surveyor of Taxes) (1915) 7 TC 30 as ‘a creditor’s share of the profit which the borrower or the debtor is presumed to make from the use of the money.Otherwise stated, it is just recompense to the creditor for being deprived of the use of his money.’ [emphasis added] [emphasis in original] 22     The foregoing passage inChng Gim Huatwas cited by Andrew Ang J inACC v Comptroller of Income Tax[2011] 1 SLR 1217 (“ACC”) at [25]. Based onChng Gim Huat, interest can be described as the compensation paid to a lender for the use of his money. Put differently, from the perspective of the borrower, interest is the consideration paid for the use of the lender’s money. 23     Furthermore, it is said that nomenclature, or the label attached to a payment, does not affect the legal question of whether that payment is or is not interest: seeChng Gim Huatat [36];ACCat [25];Nicholas Pike v The Commissioners for Her Majesty’s Revenue and Customs[2011] UKFTT 289 (TC);Federal Commissioner of Taxation v Broken Hill Pty Ltd(2000) 45 ATR 507 (“Broken Hill”) at [36]. In my view, this proposition is incontrovertible. The common law looks at the substance of a transaction and not at its label or form. As Hill J said vividly inBroken Hill(at [36]), “a licence does not become a lease because the parties choose to call it one, if it is in truth a licence”. 24     This brings me to the crux of the Appellant’s contentions. Relying onChng Gim Huat, the Appellant contended that interest is consideration paid by the borrower for the use of the lender’s money. Similarly, the discounts and redemption premium paid by the Appellant in respect of the 1995 and 1996 Bonds were paid as consideration for the use of the bondholders’ money. It followed therefore that the discounts and redemption were interest in nature and substance, notwithstanding the labels attached to those payments. In support of the contentions, the Appellant referred me to several cases which I shall deal with in turn. 25     The first is the decision of the Ontario Court of Appeal inRe Unconscionable Transactions Relief Act: Re Sampson and Barfried Entreprises Ltd(1962) OR 1103 (“Re Unconscionable Transactions Relief Act”) where Schroeder JA said (at 1108): The American authorities speak of interest as the compensation allowed by law or fixed by the parties for the use or forbearance of money, or as damages for its detention. Broadly speaking it is regarded as compensation which may be demanded by the lender from the borrower, or by the creditor from the debtor for the use of money. The word “interest” is not, then, a technical term and it is not restricted in any sense to compensation determinable by the application of a rateper centumto the principal amount of a loan. It may be for a fixed sum of moneywhether denominated a bonus, discount or premium, provided that it is referable to a principal money or to an obligation to pay money. [emphasis added] 26     As to the meaning of “discount”, Lord M’Laren opined inR. Buchanan & Company v John Macdonald(1895) 23 R 264 (“R. Buchanan”) that discount was the payment of interest in advance.  In this regard, Lord M’Laren held (at 267)  that: …In the first place I think the word “discount” has no technical or universal meaning. In what is perhaps its most common meaning it is equivalent to the payment of interest in advance; as, for example, when a banker advances the amount upon a bill of exchange which is not yet due, discounting the interest up to the day of payment. 27     Like a discount, the Appellant submitted that a redemption premium could be interest in nature and substance. The Appellant referred the court to the Scottish case ofCommissioners of Inland Revenue v Thomas Nelson & Sons Ltd(1938) 22 TC 175 (“Thomas Nelson”), the facts of which were as follows. The taxpayer company lent a sum of money to its subsidiary. The loan was for 10 years. Under the terms of the loan, the borrower was to pay interest and a premium which varied according to the date of payment. In discussing the nature of the premium, Lord President Normand said (at 179): …The premiums are part of the consideration given by the borrowers for the use of the capital lent to them, and part of “the creditor’s share of the profit which the borrower…is presumed to make from the use of the money”…It is not irrelevant to notice that the agreement provides for a payment by way of a premium which may be made in each year of the currency of the loan, and that, taken along with the stipulated interest, the effect of this provision is to give the lenders a return on their capital varying between 5 per cent in the earlier years and something over 5½ per cent in the later years, a rate which can only be regarded as a reasonable return for the use of their capital and not as to any extent an accretion to it. 28     This brings me to the South African case ofCommissioner for Inland Revenue v Genn & Co (Pty) Ltd(1955) 20 SATC 113 (“Genn & Co”). The taxpayer in that case had sought to borrow money to purchase its trading stock. To do this, the taxpayer entered into an arrangement with an investment company under which the investment company was to obtain loans for the taxpayer from third-party lenders at the cost of 10% per annum. This percentage included the interest payable to the lenders and a raising fee payable to the investment company. 29     The issue then was whether the raising fees paid to the investment company formed part of the consideration paid by the taxpayer for the use of the loan proceeds. In this respect, Schreiner JA said (at 119) : …[I]t is not possible in the present case to justify a difference in treatment between the interest on the loans and the commissions; the circumstances mentioned above show that in each casethe commission together with the interest formed in effect one consideration which the company had to pay for the use of the money for the period of the loan. [emphasis added] 30     In my judgment, the effect of the cases referred to at [25]–[29] is this. Those cases recognise that interest, discounts and redemption premiums may be incurred by a borrower as consideration for the use of the lender’s money. It does not however follow that the discounts and redemption premiums are necessarily interest. This is clear from the passages inThomas NelsonandGenn & Cowhich I have cited at [27] and [28] above respectively. In this regard, the Comptroller also referred the court toDitchfield (Inspector of Taxes) v Sharp and others[1983] STC 590 where Fox LJ remarked (at 595) that: …Consideration on a purchase and sale can, it seems to me consist of a mixture of cash, property in specie, discounts and loans at a commercial rate of interest.Together they form the consideration. They do not thereby lose their character individually. … [emphasis added] 31     In my view, the principles enunciated by Fox LJ can properly be applied to the present case. If discounts and redemption premiums were to be regarded as interest by virtue of the fact that they are all borrowing costs, this would make nonsense of each concept individually. Put simply, one must first consider the essential characteristics of each of those concepts. In particular, the differences between each concept must be carefully considered. It is only where a payment made by a borrower bears the characteristics of interest, discount or redemption premium that it can be properly called, notwithstanding the label one attaches to that payment. 32     In this regard, the Comptroller contends that it is a fundamental feature of interest that it accrues with time. I agree. InCity Hardware Pte Ltd v Kenrich Electronics Pte Ltd[2005] 1 SLR(R) 733 at [39], it was held that interest “runs from day to day until repayment of the loan, its total depending on the length of the loan”. This feature of interest was also recognised inNicholas Pike v The Commissioners for Her Majesty’s Revenue and Customs(“Nicholas Pike”) (supra [23]) where it was held (at [50]) that: …[W]e find that the natural and ordinary meaning of interest is that it is a sum of moneycalculated by reference to an underlying debt which is payment by time for the use of the money borrowed and which accrues from day to day, whether or not it is paid periodically. [emphasis added] Nicholas Pikeis also significant because it recognised (at [49]) that the question of whether a payment is interest is not determined by the label attached to it. 33     For completeness, I also add that in cross-examination before the ITBR, the Appellant’s expert witness agreed that interest bears the feature of accrual with time. 34     The question then is whethertruediscounts and redemption premiums bear the same features as interest. As to the ordinary meaning of these concepts, I find the following explanations inThe Law and Practice of Singapore Income Tax(LexisNexis, 2011) to be instructive. The learned authors say (at [3.239] and [3.241]): Income from ‘discounts’ is assessable under section 10(1)(d). The term ‘discount’ is, however, not defined in the Act. In the Oxford English Dictionary, the following meaning is given to the term ‘discount’: The deduction made from the amount of a bill of exchange or promissory note, by one who gives value for it before it is due, this deduction being calculated at a defined rate per cent for the time the document has to run; practically the interest charged by a banker or bill discounter for advancing the value of a bill before it is due. … A discount on a debt security is similar to interest in that the economic purpose of the discount is to provide a return to the holder of the debt security. … Although the foregoing passage establishes that the purpose of paying a discount is similar to that of paying interest, it does not go as far as to state that the terms are synonymous. In this regard, the Privy Council has described a discount as “a deduction from the pricefixed once and for allat the time of payment” [emphasis added]:Chow Yoong Hong v Choong Fah Rubber Manufactory[1962] AC 209 at 217. A true discount therefore, is different from interest insofar as the former does not accrue with time. 35     As to the meaning of a premium, the authors ofThe Law and Practice of Singapore Income Taxsay (at [3.245]): A premium is, in the broadest term, a payment which is usuallya once and for all paymentmade for some right…A premium may also be paid on the redemption of securities by the issuer of securities. Such a premium provides an economic return to the holder of the securities not different from interest or discount payable on the securities. [emphasis added] Therefore, unlike interest, a true premium does not bear the feature of accrual with time. 36     The Appellant contended that interest need not bear the feature of accrual over time. The Appellant said that the timing of the payment was a commercial (as opposed to a legal) consideration which did not impact on the nature or substance of a discount or premium. In this respect, the Appellant referred me toNicholas Pikewhere it was held (at [48]) that: We agree with Mr Gibbon that the authorities do not require interest to be paid periodically: there is nothing in even Pennycuick LJ’s remarks inWillingalewhich required interest to be paid periodically. On the contrary,Lomax,Schulze v Benstedand Lord Salmon inWillingaleanticipate that interest can be interest even if it is paid in a single lump sum at the end of the loan. And inDavies v Premier Investments Ltdthe High Court decided that in relation to a loan on terms similar to those in this case (albeit for a shorter period) that the ‘premium’ was indeed interest although paid only on redemption. In these cases the judges were of course giving ‘interest’ its ordinary meaning and we would also comment that in our view, irrespective of these authorities, we also consider that the ordinary meaning of interest does not require periodicity in payment. Term loans where interest is paid in one lump sum on the date of redemption are a normal type of financial instrument. 37     In my judgment, the Appellant’s contention is misconceived. In particular it conflates the issue of how interest is paid with the issue of whether it accrues with time. Cases likeNicholas Pikeclearly establish that while interest must bear the feature of accrual with time,it need not be paid periodically. 38     Having considered the ordinary meaning of the terms “interest”, “discount” and “redemption”, I come to the more important issue – whether the discounts and redemption premium incurred by the Appellant in respect of the 1995 and 1996 Bonds were “interest” under s 14(1)(a) of the ITA. The meaning of “interest” therefore, is a question of statutory interpretation. Reference to the common law or ordinary meaning of “interest”alonewould be wholly inadequate. 39     In Singapore, any discussion on statutory interpretation necessarily takes place against the backdrop of s 9A of the Interpretation Act (Cap 1, 2002 Rev Ed). Section 9A(1) provides that: In the interpretation of a provision of a written law, an interpretation that would promote the purpose or object underlying the written law…shall be preferred to an interpretation that would not promote that purpose or object. Section 9A(1) therefore mandates that a purposive approach be taken in statutory interpretation. 40     Taking such an approach in the present case, the question to be answered is whether “interest” under s 14(1)(a) of the ITA, when read harmoniously within the statutory context in which it is found as well as the objects and purposes underlying that statutory context, includes the discounts and redemption premium incurred by the Appellant in respect of the 1995 and 1996 Bonds: see generallyDorsey James Michael v World Sport Group Pte Ltd[2013] 3 SLR 354 at [21]. 41     At this juncture I need to first digress and explain the relevance of the 2008 amendments to the ITA to the present proceedings (as contained in the Income Tax Act (Cap 134, 2008 Rev Ed) (“the ITA 2008”)). In 2007, s 14(1)(a) of the ITA was amended by way of the Income Tax (Amendment No 2) Act 2008. Section 14(1)(a) of the ITA 2008 now reads: 14.—(1) For the purpose of ascertaining the income of any person for any period from any source chargeable with tax under this Act (referred to in this Part as the income), there shall be deducted all outgoings and expenses wholly and exclusively incurred during that period by that person in the production of the income, including — (a) except as provided in this section — (i) any sum payable by way of interest; and (ii) any sumpayable in lieu of interest or for the reduction thereof, asmay be prescribed by regulations(including the restriction of the deduction of the sum in respect of money borrowed before the basis period relating to the year of assessment 2008,. upon any money borrowed by that person where the Comptroller is satisfied that such sum is payable on capital employed in acquiring the income. [emphasis added] The relevant regulations are the Income Tax (Deductible Borrowing Costs) Regulations 2008 (Cap 134, S115/2008) (“the 2008 Regulations”). Under Reg 2 of the 2008 Regulations, read with the Schedule, “[d]iscount on debt securities payable on maturity or early redemption of those securities” and “[p]remium on debt securities payable on the maturity or early redemption of those securities” are prescribed as deductible borrowing costs for the purposes of s 14(1)(a)(ii) of the ITA 2008. 42     The legislative intent underlying the 2008 amendments to the ITA were explained by the Minister for Finance in the Annual Budget Statement 2007 delivered on 15 February 2007 as follows: I will also do more to keep our tax regime relevant to new business structures and financial practices. Recognising that business borrowings are now taking various innovative and non-traditional forms,I will now allow all borrowing costs that are essentially similar to interest to qualify as tax-deductible expenses, with effect from YA2008. Such tax deductible costs will include certain guarantee fees and bonds discounts. This will cost the Government $110 million a year. IRAS will release further details on this change. [emphasis added] 43     As to the relevance of the 2008 amendments to the ITA, Comptroller’s contentions were twofold. First, he contended that if discounts and redemption premiums were “interest”, there would have been no need to provide for their deduction under the 2008 Regulations. Therefore, the 2008 Regulations flowed from the recognition that while discounts and redemption premiums were types of borrowing costs, they were distinct from interest. Second, the Comptroller contended that it was evident from the Minister’s words “I will now allow all borrowing costs that are essentially similar to interest to qualify as tax-deductible expenses” that prior to 2008, borrowing costs such as discounts and redemption premium did not rank for deduction under s 14(1)(a) of the ITA. The Comptroller’s contentions in this regard were accepted by the ITBR (at [28]). 44     Before me, the Appellant contended that subsequent legislation cannot be used to interpret earlier legislation. The Appellant relied onACCat [42] where Andrew Ang J made the pertinent point that: …I do not think that the content of such subsidiary legislation, made by the Minister pursuant to powers conferred under s 13(4) of the ITA, can be taken to be a guide as to what Parliament intended by the language used in the Act, particularly if the Notification postdated the 1977 amendments by some 13 years. 45     Against this, the Comptroller contended that subsequent legislation can be used to interpret earlier legislation where the earlier legislation was ambiguous. In this regard, the Comptroller relied on the House of Lords case ofKirkness (Inspector of Taxes) v John Hudson & Co Ltd[1955] AC 696 (“Kirkness”) where Viscount Simonds said (at 711): …I quite agree that subsequent legislation, if it proceeded upon an erroneous construction of previous legislation, cannot alter that previous legislation; but if there be any ambiguity in the earlier legislation, then the subsequent legislation may fix the proper interpretation which is to be put upon the earlier. This approach was later applied by the Privy Council inCommissioner of Inland Revenue v Hang Seng Bank Ltd[1991] AC 306. 46     Between the two opposing contentions, I prefer the Appellant’s arguments. Under s 9A of the Interpretation Act, the Court must give effect to the will of Parliament as expressed in the law. In my view however, legislative intent is to be determined at or around the time the law is passed. If Parliament enacts subsequent legislation having proceeded on a particular interpretation of earlier legislation, Parliament’s interpretation would be highly relevant to the interpretation of the subsequent legislation. Conversely, it is of no relevance to the interpretation of the earlier legislation. Similarly, ministerial statements uttered years after legislation is passed are unhelpful as interpretive instruments. 47     Accordingly, I place no reliance on the 2008 amendments in the interpretation of s 14(1)(a) of the ITA. Be that as it may, it does not follow that discounts are “interest” under the ITA. In this regard, it is pertinent to note that the charging provision of the ITA, namely s 10(1)(d), provides: 10.—(1) Income tax shall, subject to the provisions of this Act, be payable at the rate or rates specified hereinafter for each year of assessment upon the income of any person accruing in or derived from Singapore or received in Singapore from outside Singapore in respect of — … (d) dividends, interest or discounts; … If the concepts of “interest” and “discount” were synonymous, it is inconceivable that Parliament would have specified both under s 10(1)(d) of the ITA. It is a fundamental rule of statutory interpretation that Parliament shuns tautology and does not legislate in vain. Effect must be given to all the words of a statute:JD Ltd v Comptroller of Income Tax[2006] 1 SLR(R) 484 at [43] (“JD Ltd”). In my judgment, the ITBR was correct in finding that the ITA imported a difference between interest, discounts and redemption premiums, even if they were all examples of borrowing costs. 48     The Appellant argued that the ITBR erred in its finding on this point as s 10(1)(d) of the ITA deals with the charging of income with tax as opposed to deductions. CitingTasman Forestry Ltd v Commissioner of Inland Revenue[1999] 3 NZLR 129, the Appellant submitted that there is no symmetry between the charging and deductibility provisions of the ITA. In this regard, I accept that the policy considerations underlying the charging and deductibility provisions are different. In my view however, this does not detract from the principle that Parliament shuns tautology in legislation. Moreover, the cases cited by the Appellant as to the meaning of interest,viz,Chng Gim HuatandThomas Nelson, were cases relating to the charging of income tax as opposed to deductibility. Therefore, the Appellant’s contentions as to the relevance of s 10(1)(d) of the ITA are misconceived. 49     This brings me to the two cases which weigh most strongly in favour of the Appellant’s contention that the discounts and redemption premium incurred in respect of the 1995 and 1996 Bonds were “interest”. In considering the cases, I am mindful of the Court of Appeal’s caution inJD Ltdat [32] that as tax law is essentially a creature of statute, regardmustbe had to the statutory context. Therefore, foreign authorities will only be helpful if the corresponding tax statutes were identical to or very similar to the ITA in Singapore. 50     In this regard,R. Buchanan(see [26] above) does not assist the Appellant’s case.R. Buchananconcerned the enforcement of payment for goods by a supplier under an agreement with a retailer. It did not arise under income tax legislation. Even ifR. Buchanandoes stand for the proposition that discount is “interest” in substance and nature, this is untenable in the light of the statutory scheme under the ITA. As I explained at [47] above, the ITA imports an express distinction between “interest” and “discount”. 51     For the same reasons, I also findRe Unconscionable Transactions Relief Act(see [25] above) to be unpersuasive. That case involved points of Canadian constitutional law and the Unconscionable Transactions Relief Act, the statutory scheme of which is wholly different from the ITA. Moreover, if discounts and redemption premiums were all “interest”, s 10(1)(d) of the ITA would be rendered  tautologous. 52     At most,R. BuchananandRe Unconscionable Transactions Relief Actshow that the plain and ordinary meaning of “interest” is sufficiently wide to encompass discounts and redemption premiums. That, however, is not conclusive of the interpretation of the term. Under s 9A of the Interpretation Act, “interest” must be read in the light of its statutory purpose and context. 53     As I explained at [47] above, the distinction between the concepts of interest, discounts and redemption premiums under the ITA must be given effect. In my judgment, the distinction, which flows from the ordinary and commercial meaning of “interest”, is this. To count as “interest”, a payment must be consideration paid by the borrower for the use of the lender’s money which bears thefundamental feature of accrual with time. Then and only then will the payment be interest, notwithstanding the label attached to it. 54     The issue then is whether the discounts and redemption premium incurred by the Appellant in respect of the 1995 and 1996 Bonds bore this feature. In my judgment it is clear that they did not. Both the discounts and the redemption premium were one-off obligations, based on a fixed percentage of the principal loan amount. Their amounts did not accrue with time. Rather, they were ascertainable at the time the bonds were issued. Consequently, the discounts and redemption premium incurred by the Appellant in respect of the 1995 and 1996 Bonds were not “interest” under s 14(1)(a) of the ITA. It follows that the Appellant’s claim for their deduction under that provision must fail. 55     For completeness, I shall briefly address the Comptroller’s contention that the discounts and redemption premium paid by the Appellant compensated the bondholders for capital risks and therefore, were not interest. In particular, the Comptroller contended that the discounts and redemption premiums were not paid as compensation to the bondholders for the use of their money during the period of the bonds. Rather, they served to compensate the bondholders for the risk that their money would never be repaid at all. 56     The Comptroller referred the court to the UK decision inLomax (H.M. Inspector of Taxes) v Peter Dixon & Son, Ltd[1943] 25 TC 353 (“Lomax”). The facts inLomaxare as follows. The taxpayer carried on the business of manufacturing newsprint. To obtain a source of supply of wood pulp, it made arrangements in 1930 for the formation of a foreign company to which it lent money. In 1933, an agreement was entered into for the repayment of the loan. The foreign company issued interest-bearing notes. The notes were unsecured. Rather, they were issued at a discount of 6% and to be redeemed at a premium of 20% above value if the foreign company’s profits permitted it. 57     InLomax, Lord Greene MR held that the discount and redemption premium compensated the taxpayer for capital risk. Accordingly, they were capital as opposed to income in nature and not chargeable with income tax. Lord Greene MR said (at 367): It may be convenient to sum up my conclusions in a few propositions. (1) Where  a loan is made at or above such a reasonable commercial rate of interest as is applicable to a reasonably sound securitythere is no presumption that a “discount” at which the loan is made or a premium at which it is payable is in the nature of interest.(2)The true nature of the “discount” or the premium (as the case may be) is to be ascertained from all the circumstances of the caseand, apart from any matter of law which may bear upon the question (such as the interpretation of the contract), will fall to be determined as a matter of fact by the Commissioners. (3) In deciding the true nature of the “discount” or premium, in so far as it is not conclusively determined by the contract, the following matters together with any other relevant circumstances are important to be considered, viz, the term of the loan, the rate of interest expressly stipulated for, the nature of the capital risk, the extent to which, if at all, the parties expressly took or may reasonably be supposed to have taken the capital risk into account in fixing the terms of the contract. [emphasis added] 58     In this regard, the Comptroller first contended that all discounts and redemption premiums were invariably compensation for capital risk and therefore, not interest. Based on the passage inLomaxcited at [57] above, this contention is plainly untenable. It is clear fromLomaxthat the true nature of a discount or premium will depend on all the circumstances of the case. The Comptroller’s contention then was that the discounts and redemption incurred by the Appellant in respect of the 1995 and 1996 Bonds were compensation for capital risks. In my judgment, the Comptroller’s contention in this regard is of marginal, if any, relevance to the case before me. 59     For one, it is important to confine Lord Greene MR’s dicta to its proper context. Here, it is pertinent to note thatLomaxwas a case concerning the charging of income tax as opposed to deductibility. 60     Furthermore, I am not persuaded thatLomaxstands as authority for the proposition that in some cases, discounts and redemption premiums can be “interest” on the basis that they compensate a lender for the use of his money. Rather,Lomaxheld in effect that based on the circumstances of a case, discounts and redemption premiums, like interest,can properly be said to be income in the hands of the lender. Then, they would be chargeable with income tax. If, on the other hand, the discounts and redemption premium were paid to compensate the lender for capital risk, they would represent an accretion to the lender’s capital and therefore not subject to income tax. This scheme of things is clearly reflected in s 10(1) of the ITA which only subjects “income” to tax. 61     In the premises, I findLomaxto be of little assistance in determining whether the discounts and redemption premium incurred by the Appellant in respect of the 1995 and 1996 bonds were “interest” under the ITA.",
        "Were the discounts and redemption premium outgoings and expenses wholly and exclusively incurred in the production of the Appellant’s income under s 14(1) of the ITA?": "62     I now turn to consider whether the discounts and redemption premium incurred by the Appellant were deductible under s 14(1) of the ITA. To recapitulate, that provision reads: 14.—(1) For the purpose of ascertaining the income of any person for any period from any source chargeable with tax under this Act (referred to in this Part as the income), there shall be deducted all outgoings and expenses wholly and exclusively incurred during that period by that person in the production of the income,… 63     The ITBR had disallowed the Appellant’s claim for deduction under this section of the ITA on the ground that discounts did not fall within the plain and ordinary meaning of “outgoings” or “expenses” under the provision (at [17]–[18]). In this regard, the ITBR accepted the Comptroller’s contention that those terms required there to have been actual disbursement made by the Appellant. The discounts, which the ITBR regarded as merely the non-receipt of the relevant amount, did not bear this feature. 64     In support of its contentions, the Comptroller referred the Court to the following dictionary definitions. InThe New Shorter Oxford English Dictionary on Historical Principles(Clarendon Press, 1993, Volume 2) at p 2038, “outgoing” is defined to be “expenditure, outlay”. As to an “expense”, Black’s Law Dictionary (West, 9thEd, 2009) at 658 defines the term as “an expenditure of money, time, labor, or resources to accomplish a result; esp., a business expenditure chargeable against revenue for a specific period”. “Expenditure” in turn is defined by Black’s Law Dictionary as “1. The act or process of paying out; disbursement. 2. A sum paid out”. 65     Conversely, the Appellant contended that a payment need not be an actual disbursement for it to be deductible under s 14(1) of the ITA. In this regard, the decision of the Australian High Court inFederal Commissioner of Taxation v James Flood Pty Ltd(1953) 88 CLR 492 (“James Flood”) is instructive. The Court there said (at 506): …The word ‘outgoing’ might suggest that there must be an actual disbursement. But partly because such an interpretation would produce very strange and anomalous results, and partly because of the use of the word ‘incurred’,the provision has been interpreted to cover outgoings to which the taxpayer is definitively committed in the year of income although there has been no actual disbursement. [emphasis added] Based on the reasoning inJames Flood, a distinction is to be drawn between cases where there is a clear legal liability to incur the expenditure, notwithstanding the fact that actual payment only falls due in a later year, and cases where the liability to incur the expenditure is merely contingent or anticipatory. It is only in the former that the expenditure will be deductible under s 14(1) of the ITA even though no actual payment has been made. In my judgment, the reasoning inJames Floodcan be properly transposed to s 14(1) of the ITA. In this respect, the Comptroller’s contentions are unpersuasive because they give insufficient weight to the term “incurred” under s 14(1). 66     In any event, the sums sought by the Appellant as deductions related to Years of Assessment 2001 and 2002. By then, it was not in dispute that the Appellant had redeemed the bonds at their full face value. In relation to the 1995 Bonds, which were for the principal sum of $150,000,000 and issued at a discount of 0.4305%, the Appellant only received the total sum of $149,354,250 at the time of issue. At maturity however, the Appellant paid the bondholders the total sum of $150,000,000 plus the redemption premium.  In relation to the 1996 Bonds, which were for the principal sum of $165,000,000 and issued at a discount of 7.0803%, the Appellant only received the total sum of $153,317,505 at the time of issue. At maturity, the Appellant paid the bondholders the total sum of $165,000,000 plus the redemption premium. 67     In my judgment, with regard to the discount in Years of Assessment 2001 and 2002, the Appellant had, by redeeming the bonds at their full face value, incurred actual outgoings in the sums of $645,750 and $11,682,495 respectively. Similarly, I find that the redemption premium paid to the bondholders in Year of Assessment 2001 was an actual outgoing incurred by the Appellant. Clearly then, discounts and redemption premium were “outgoings and expenses” under s 14(1) of the ITA. 68     The issue then is whether the expenses were wholly and exclusively incurred in the production of the Appellant’s income. The effect of s 14(1) in this regard was explained by Yong CJ inPinetree Resort Pte Ltd v Comptroller of Income Tax[2000] 3 SLR(R) 136 (“Pinetree Resort”) at [47] in the following terms: Section 14(1) of the Income Tax Act provides that in ascertaining the income of a taxpayer for any period, there shall be deducted all outgoings and expenses wholly and exclusively incurred during that period by the taxpayer in the production of the income as long as these are not expressly prohibited by other sections in the Income Tax Act.The important feature of when deductions may be made for the purposes of this case is the fact that s 14 requires a nexus between the incurrence of the expense and the production of income. In determining whether this nexus is present, the business has to be looked at as a whole set of operations directed toward producing income, in which case an expenditure which is not capital expenditure is usually considered as having been incurred in gaining or producing income;W Nevill & Co v FCT(1937) 56 CLR 290. [emphasis added] 69     Therefore, for the discounts and redemption premium incurred by the Appellant in respect of the 1995 and 1996 Bonds to qualify for deduction under s 14(1) of the ITA, there must be a nexus between the incurring of the discounts and redemption premium and the production of the Appellant’s income. 70     It is also clear from Yong CJ’s judgment inPinetree Resortthat s 14(1) of the ITA only grants a deduction to expenditure that is revenue as opposed to capital in nature. In this regard, there is a close nexus between ss 14(1) and 15(1)(c) of ITA. By prohibiting the deduction of capital (as opposed to revenue) expenses, s 15(1)(c) serves to reinforce the requirement under s 14(1) of the ITA that the expenses must be wholly and exclusively incurred in the production of the taxpayer’s income to qualify for deduction under that provision.",
        "Were the discounts and redemption premium capital expenses and thus prohibited from deduction under s 15(1)(c) of the ITA?": "71     This brings me to the third issue,viz, whether the discounts and redemption premiums incurred by the Appellant in respect of the 1995 and 1996 Bonds were capital expenses and thus prohibited from deduction by s 15(1)(c) of the ITA. 72     As I explained at [70] above, the distinction between the concepts of capital and revenue is a crucial one under the ITA. Unfortunately, as the Court of Appeal observed inComptroller of Income Tax v IA[2006] 4 SLR(R) 161 (“IA”) at [1], the distinction is “often elusive and even illusory”. More pertinently however, the Court of Appeal held (at [16]) that in distinguishing capital from revenue, the concept of “purpose”is a principal legal tool. 73     As regards the deductibility of interest expenses under s 14(1)(a) of the ITA, the position in Singapore was settled by the Court of Appeal inT Ltd v Comptroller of Income Tax[2006] 2 SLR(R) 618 (“T Ltd”).  InT Ltd, the taxpayer company purchased a parcel of land on which a shopping centre was to be built and subsequently operated by the taxpayer. The taxpayer sought to deduct from its taxable income the interest incurred on a loan it had taken out, prior to the granting of the temporary occupation permit (“TOP”), to purchase the land on which the shopping centre was to be built. 74     The Court of Appeal there held that in determining whether interest expenses were in the nature of capital or revenue, it was necessary to examine the nature of the underlying loan. The Court said [24]: Interest is derivative in nature. It owes its existence to a loan.Whether it is a capital or a revenue expense depends on the purpose for which the loan is employed. If the loan is used for developing a capital asset, the interest payable on that loan was not deductible for tax purposes. If the loan is employed in acquiring income, the interest thereon became deductible under s 14(1)(a). …[emphasis added] 75     The approach inT Ltdwas later endorsed by the Court of Appeal inIA. The facts inIAcan be stated as follows. The taxpayer was a property development company. The taxpayer purchased a parcel of land for development into a condominium project. This was funded in part by a loan from a syndicate of banks (“the Syndicated Loan”). To repay the same with the revenue it had received from progress payments made by purchasers in the condominium project, the taxpayer had to withdraw money held in a project account for the condominium project. To do this, the taxpayer had to furnish a banker’s guarantee to the Urban Redevelopment Authority and expenses were incurred in so doing (“the Guarantee Expenses”). In repaying the loan on a date earlier than the next interest payment date, the taxpayer incurred a pre-payment penalty (“the Pre-Payment Expenses). In addition, the taxpayer incurred borrowing expenses (“the Borrowing Expenses”). The taxpayer sought to deduct the Guarantee Expenses, the Pre-Payment Expenses, and the Borrowing Expenses from its taxable income (collectively, “the Relevant Expenses”). 76     The issue inIAthen was whether the Relevant Expenses were revenue expenses deductible under s 14(1) and s 15(1)(c) of the ITA. It is pertinent to note thatIA, unlikeT Ltd, was a case concerning the deductibility ofnon-interest borrowing costsunder s 14(1), as opposed to s 14(1)(a), of the ITA. Nevertheless, the Court of Appeal inIAheld (at [15]-[16]) that the principles enunciated inT Ltd(see [73] above) were of equal application to the case before them. In particular, the purpose of the underlying loan was regarded as important in determining whether the Relevant Expenses were capital or revenue in nature. 77     It is also apposite to note that inIAandT Ltd, the Court of Appeal expressly debunked the following two propositions. First, inIAat [64], the Court of Appeal rejected the proposition thatall loans and their accompanying borrowing costswere capital in nature. The appellate court said: The corollary of any approach that disregards the purpose of loan is that, in specific context ofloans,allloans – and the accompanying expenses – wouldalmost neverbe considered to berevenuetransactions for the very simple reason that,withouttaking into account the purpose of the taxpayer in entering into the transaction concerned,any and all funds from any loanwouldclearly amount to an addition or accretion to the capital structure of the taxpayer. However, such an approach…is bothexcessively literal as well as too blunt and sweeping. More importantly, it is inconsistent withlegal principlewhich looksnot merelyat afactualapproach but, rather, one which can be justified on anormativelevel as well. [emphasis in original] Second, and as regards interest, the Court of Appeal inT Ltdrejected the proposition that interest was inherently revenue in nature and not caught by the prohibition under s 15(1)(c) of the ITA. In this regard, the Court of Appeal said at [20]–[21]: …A plain reading of s 15(1)(c) does not compel us to exclude interest expenditure from its scope. The said provision applies to all capital expenditure. Interest in respect of a capital purpose is capital expenditure and is therefore incurred as a “sum employed or intended to be employed as capital” within the meaning of s 15(1)(c). Reading s 15(1)(c) in the way we have indicated above need not result in conflict with s 14(1)(a). For the provisions to conflict, it would have to be assumed that s 14(1)(a) allows the deductibility of all interest, including interest in respect of sums employed as capital, which is what s 15(1)(c) would prohibit if it does apply to interest. However, s 14(1)(a) allows the deductibility of interest payable on a loan only if it was “payable on capital employed in acquiring the income”. Where a taxpayer has borrowed money for investment and incurred interest on the loan, the investment must produce income for the interest to be deductible under the Act…If the loan is applied towards an accretion of capital, the interest incurred thereon is not a deductible item. This means, in the context of this appeal, that only the interest incurred after the grant of the TOP qualifies for deduction under s 14(1)(a). The operative provision that excludes interest on loans taken out for the acquisition of capital is therefore s 14(1)(a) and there is no need to resort to s 15(1)(c). 78     In determining the purpose of the underlying loan, and consequently the nature of the borrowing costs incurred on that loan, the framework laid down by the Court of Appeal inIAis instructive. There, it said (at [67]–[69]): One guideline – in so far as the present (and specific) context ofloansare concerned – is to ascertain whether or not there is asufficient relationship or linkage between the loan in question and the main transaction or project for which the loan has (ostensibly, at least) been taken. If there is no, or an insufficient, linkage, then it must be assumed that the sole purpose of the loan is to augment or add to the capital structure of the taxpayer. If so, then the loan itself must be of a capital nature. A clear illustration of a situation where there is no linkage to the main transaction is where the taxpayer takes out the loan without stipulating what it is to be used for. On the other hand, if there is a linkage, such linkagemustnevertheless besufficient. This is undoubtedly a question of fact and (we might add) commonsense. For the avoidance of doubt, however, we are of the view that a sufficient linkage would clearly be present if the evidence demonstrates that the loan was taken in order to finance the main transaction or project. Indeed, this would be the position in the standard situation. If it is ascertained that there is a sufficient relationship or linkage in the manner set out in the preceding two paragraphs, then the next question to ask is whether or not the main transaction or projectitselfis of a capital nature or of a revenue nature. This constitutes, in effect, the second (and closely related) guideline. If the project itself is of acapitalnature, then it must follow (given the satisfaction of the requirement of linkage) that theloanlinked to itcannot possiblybe of a revenue nature. This is because the funds from the loan would,ex hypothesi, beintended toaugment or add to thecapital structureof the taxpayer,given the (capital) nature of the project itself. Put simply, these funds would besunk intothe taxpayer’s capital structure when viewed from thelong-term perspective. If, on the other hand, the loan is linked to a project which is of arevenuenature, theconverseresult would ensue inasmuch as the loan would be of a revenue nature as well. [emphasis in original] The Court of Appeal (at [79]) then summarised this framework as follows: Tosummarisethe approach we have set out above: (a) One should first ascertain thepurposeof the taxpayer in entering intothe loan–ie, whether it was for the purposes of revenueorfor the purposes of capital. In order to ascertain such a purpose, a reasoned approach would include the relevant steps in (b) to (d) below. (b) One ought to ascertain,first, whether a sufficient linkage or relationship exists between the loan and the main transaction or project for which the loan was taken. (c) If, in (b) above, no, or an insufficient, linkage is established, the purpose of the loan must,ex hypothesi, be merely to add to the capital structure of the taxpayer and is therefore capital in nature. In this regard, it may in fact be proved thatonly some of the elementsof the loan donothave a linkage to the main transaction, andone main (if not conclusive) indicatorof thisabsence of a linkageis that those particular elements or parts of the loan arenottemporary and fluctuating in nature but are, instead, or a permanent (and thereforecapital) nature (at this stage, one is applying thenarrower versionof the “temporary and fluctuating test” suggested by Mr Liu). One should note that this narrower version of the “temporary and fluctuating test” is fraught with potential practical problems. (d) On the other hand, if in (b) above, a sufficient linkage is established, one must then (andsecondly) proceed to ascertain whether themain transactionis of a capital or of a revenue nature (at this stage, one is applying thebroader versionof the “temporary and fluctuating test”). If it is of a capital nature, then (given the linkage to the loan) the loan is also of a capital nature. If, on the other hand, the main transaction is of a revenue nature, then (once again, given the linkage to the loan) the loan is also of a revenue nature. In the nature of things, the process outline herenecessarilyinvolves a consideration of thepurposeof themain transactionand is alsofactualin nature. [emphasis in original] 79     Two points bear further elaboration here. First, in determining the purpose of the borrowing, the Court engages in an objective inquiry. As the Court of Appeal inIAsaid (at [39]): …[W]hilst theavowedpurpose for the taking of a loan will be accorded due consideration by the court, thepurely subjectiveassertions by the taxpayer arenot conclusive. If, in other words, theobjective factstell a different story, the court is then free to disregard such assertions. [emphasis in original] 80     Second, the relevant time for determining the purpose of a loan is generally the time at which the loan was taken. This rule however is not an absolute one and a different result may ensue if it is shown that there has been a clear change in the purpose of the loan from a revenue to capital one (andvice versa): seeIAat [90]-[91]. 81     Here, the Appellant accepted that the purpose of the bond issues is pertinent in determining whether bonds and the borrowing costs incurred on them were capital or revenue in nature. However, the Appellant contended that in ascertaining thepurposeof the bond issues, it is material to have regard to theusesof the bond proceeds. In this regard, the Appellant relied on the decision of the Australian High Court inKidston Goldmines Ltd v Federal Commissioner of Taxation(1991) 22 ATR 168 (“Kidston Goldmines”) where it was held (at 176) that: In most cases, the purpose of the borrowing will be ascertained from the use to which the borrowed funds were put… Where the funds are employed in a business devoted to assessable income, it may be said that moneys borrowed to secure capital or working capital will be clearly deductible… … …If the true test were confined to purpose of the borrowing, a taxpayer who borrowed funds for an income producing purpose would continue to receive a deduction, notwithstanding that the income producing activity had ceased…Conversely, if funds were borrowed for a non-income producing purpose, eg to purchase a home in which the taxpayer resides and later the home was let, no deduction would be available to the taxpayer for the interest payable which is a direct cost of the income producing activity of letting the house. … 82     The gist of Appellant’s contention was this: As the proceeds for the 1995 and 1996 Bonds were used to: (a) finance the renovation of the Hotel; (b) finance the day-to-day operations of the Appellant’s business; and (c) provide loan and equity funding to the Appellant’s subsidiaries, theusesof the bonds proceeds resulted in the production of the Appellant’s income. Thus, thepurposeof the 1995 and 1996 Bonds were to acquire income. It followed that discounts and redemption premium paid in respect of the 1995 and 1996 Bonds were revenue in nature. 83     The Appellant’s contentions in my view are misconceived because they conflate the question of how the bond proceeds were used with the question of why the bonds were issued (ie, the purpose). The reasons underlying the Appellant’s contentions will become clear later in my judgment. At this juncture however, it suffices to say that I do not find the Appellant’s contentions to be persuasive. Under the principles enunciated inIA, the Court is entitled to, and often will, have regard to the use of the bond proceeds in determining the purpose of the bond issue. However, the uses to which the bond proceeds were put are not conclusive of the purpose of the bond issues:see Federal Commissioner of Taxation v Hunter Douglas Ltd(1983) 50 ALR 97 (“Hunter Douglas”). Put simply, thetrue focusof the Court’s enquiry remains the purpose of the borrowing as opposed to the use of the borrowed funds. If this was not so, the framework prescribed in IA to determine the purpose of a loan would be rendered wholly nugatory. In that case, the enquiry would simply be what the borrowed funds wereusedfor. 84     I now turn to apply the framework established by the Court of Appeal inIAto the facts of this case. The first issue that arises is whether there was a sufficient linkage or relationship between the 1995 and 1996 Bonds and the main transaction or projects for which the bond proceeds were intended to be used. 85     The main documentary evidence pertaining to the purpose of the 1995 and 1996 Bonds is as follows: (a)     For the 1995 Bonds: (i)       The Subscription Agreement dated 27 November 1995; (ii)       The Trust Deed dated 6 December 1995; (iii)       The Board Resolution dated 24 November 1995; and (iv)       The Corporate Announcement made by the Appellant in December 1995. (b)     For the 1996 Bonds: (i)       The Subscription Agreement dated 18 September 1996; (ii)       The Board Resolution dated 1 April 1996; and (iii)       The Information Memorandum dated 20 September 1996. 86     For the 1995 Bonds, the Subscription Agreement and Trust Deed were silent on the purpose of the bond issue. Moreover, the Board Resolution in respect of the 1995 Bonds did not state the intention of the Appellant’s directors in issuing the 1995 Bonds. On the other hand, the Corporate Announcement made by the Appellant in December 1995 stated that the “proceeds from the Bond Issue [would] be used to re-finance the existing borrowings of the Hotel, to finance the renovation work carried out or to be carried out on the Hotel and for working capital purposes”. 87     For the 1996 Bonds, the Subscription Agreement was again silent on the purpose of the bond issue. However, the Board Resolution in respect of the 1996 Bonds stated that: The purpose of the Bonds Issue is to raise medium term funds at a favourable interest rate. The net proceeds of this Issue are intended to be used to refinance the existing borrowings of the Company and its Subsidiaries. Furthermore, the Information Memorandum for the 1996 Bonds provided that: The estimate net proceeds of approximately $152 million from the Bond Issue will be used to refinance existing borrowings (including interest) of the Group. 88     The Comptroller agreed that a sufficient linkage was made out between a portion of the proceeds of the 1995 Bonds and the hotel refurbishment project because $36,564,000 of the net bond proceeds of $148,579,175 could be traced to that specific project. This was also the view taken by the ITBR (at [7]). 89     Conversely, as regards the balance of the proceeds of the 1995 Bonds and the whole of the proceeds of the 1996 Bonds, the Comptroller asserted that there was no linkage, or an insufficient linkage, between the bond issues and the uses to which the bond proceeds were intended to be put. According to the Comptroller, this is so as the 1995 and 1996 Bonds were issued without the stipulation of any specific purpose. Rather, they were issued for the general purpose of augmenting the Appellant’s capital structure. Applying the framework inIA, the Comptroller argued that the bond issues were capital in nature and disallowed from deduction under ss 14(1) and 15(1)(c) of the ITA. 90     I disagree with the Comptroller’s contentions in this respect. In my judgment, the fact that the Subscription Agreements for the 1995 and 1996 Bonds were silent on the purpose of the bond issues is not fatal to the Appellant’s case. As the Court of Appeal explained inIA, the question of whether there is a sufficient linkage between the loan in question and the main transaction for which the loan has been taken is a question of fact and will depend on all the circumstances of the case. 91     InIA, the agreement for the Syndicated Loan expressly provided that the Syndicated Loan could only be used to finance the purchase price of the land and the development costs of the condominium project. Therefore, on the facts ofIA, there was a clear linkage between the Syndicated Loan and the main transaction for which the loan was taken (ie, the condominium project):IAat [82]. In my view however,IAdoes not stand for the inflexible proposition that a loan agreement must necessarily state the purpose of the loan before a sufficient linkage will be held to exist. 92     On my reading of the evidence, I am satisfied that the 1995 and 1996 Bonds were issued for the followingpurposes: (a) to finance the renovation of the Hotel; (b) to refinance the existing borrowings of the Appellant and its subsidiaries; and (c) to finance the day-to-day operations of the Appellant’s business. Accordingly, I find that a sufficient linkage is established between the 1995 and 1996 Bonds and each of these purposes. 93     With regard to the 1996 Bonds, the purpose of the bond issue is clear from the Board Resolution and the Information Memorandum. With regard to the 1995 Bonds, I accept that the Corporate Announcement made by the Appellant evinces the purpose of the bond issue despite the fact that the Corporate Announcement was made after the 1995 Bonds were issued. The Comptroller contended that the Corporate Announcement merely reflected theusesto which the borrowed funds were put, as opposed to thepurposeof the borrowing. I disagree. First, it is pertinent to note that the Corporate Announcement was made shortly after the 1995 Bonds were issued. Second, the Comptroller’s contention is at odds with its earlier concession (see [88] above) that there was a sufficient linkage between the 1995 Bonds and the hotel refurbishment project. 94     This brings me to the second issue arising under theIAframework,viz, whether the uses to which the bond proceeds were intended to be put were themselves capital or revenue in nature. In Singapore, the test to be applied in distinguishing capital from revenue expenditure was settled in the seminal decision ofABD v Comptroller Income Tax[2010] 3 SLR 209 (“ABD”). InABDat [75], Andrew Phang Boon Leong JA summarised the position as follows: … (a)    In ascertaining whether or not the expenditure relates to the creation of a new asset or new field of trading (or the strengthening thereof), thepurposeof the expenditure must be ascertained; in particular, the court should have regard to the following guidelines (bearing in mind that the categories of guidelines are not closed): (i)    Themannerof the expenditure, in particular, whether the expenditure was a one-time expenditure or a recurrent expenditure. Although this is not conclusive in and of itself, a one-time expenditure would tend to suggest that that expenditure is capital in nature. (ii)   Theconsequence or resultof the expenditure. In particular, if the expenditure results in either the strengthening of the existing core business structure of the taxpayer or adds to that structure, it is more likely to be capital in nature. In this regard, the concept of a “core business structure” may be seen as comprisingthe permanent (albeit not necessarily perpetual) structure of the taxpayer’s business which is utilised for the generation of profitsand is (to that extent) to be viewed as constituting the(permanent) assetsof the business itself (an oft-used analogy in this regard is the distinction between the tree (which is the source of the fruit) and the fruit itself).However, where the “assets” arethemselves the stock-in-tradeof the business, expenditure relation to such “assets” is more likely to be revenue in nature. (b)    In applying the various guidelines set out above (as well as any other specific (and applicable) guidelines to be found in the case law generally), thespecific factsare obviously of the first importance. However, the facts - in and of themselves - have no normative force and therefore cannot be the justification (in and of themselves) for the decision arrived at by the court because to do so would be, in effect, to hoist oneself by one's own legal petard. As noted in the introduction (above at [7]), the categorisation of an expenditure as being of capital or income nature cannot rest simply on the court's appraisal of the facts. Whilst different factors may be relevant in each case to the determination of the nature of the expenditure in light of all the circumstances of that case, the underlying principle is that for the expenditure to be of a capital nature, thefirst principle(as detailed above at [71]-[72]),viz, that the expenditure must have either created a new asset or opened new fields of trading not hitherto available to the taxpayer, must be complied with. The guidelines laid down at (a) above are useful factors to be considered in the analysis of whether the expenditure in a particular case complies with this principle although the weight of each factor depends upon the nature of the expenditure. Moreover, previous decisions of the courts provide guidance as to the factors which may point towards an income or capital expenditure in each unique set of circumstances, particularly where the facts of the case at hand are analogous to those in a previous decision. I now turn to apply the principles to the case before me. 95     The Comptroller contended that based on the principles enunciated inABD, the expenditure incurred by the Appellant in respect of the hotel refurbishment work was capital in nature. I agree. In this regard, the hotel premises were apermanent(as opposed to temporary) asset that the Appellant used to generate its business income. Put simply, they were the “tree” from which the Appellant derived its business income. The hotel refurbishment work then had the effect of strengthening the Appellant’s core business structure. In such circumstances, the expenditure incurred by the Appellant in respect of the hotel refurbishment loan was capital as opposed to revenue in nature. 96     This brings me to the next issue of whether the Appellant’s refinancing of its existing borrowings and the borrowings of its subsidiaries was a transaction that was capital or revenue in nature. The Comptroller contended that refinancing was in effect the financial readjustment of borrowed capital and therefore, unconnected with the daily income-earning activities of a taxpayer who was not engaged in financial operations. As regards such a taxpayer, the Comptroller submitted that refinancing was a transaction that was capital as opposed to revenue in nature. 97     In support of its contentions, the Comptroller referred the court to the Privy Council’s decision inMontreal Coke and Manufacturing Company v Minister of National Revenue[1944] AC 126 (“Montreal Coke”). The facts inMontreal Cokeare stated as follows: The taxpayer companies carried on important undertakings in Canada. These undertakings were financed in part by money borrowed from the public on interest-bearing bonds. The bonds were redeemable before maturity at a premium which was payable as to both principal and interest. To reduce their interest costs, the taxpayer companies sought to redeem the bonds before maturity and to re-borrow at more favourable rates. The taxpayer companies sought deductions for the substantial refinancing expenses incurred in the operation. 98     InMontreal Coke, the issue was whether the refinancing expenses incurred by the taxpayer companies were deductible under s 6 of the Income War Tax Act 1927. The relevant statutory provision reads: In computing the amount of the profits or gains to be assessed, a deduction shall not be allowed in respect of (a) disbursements or expenses not wholly, exclusively and necessarily laid out or expended for the purpose of earning the income; (b) any outlay, loss or replacement of capital or any payment on account of capital or any depreciation depletion or obsolescence, except as otherwise provided in this Act. 99     The Privy Council held that the refinancing expenses were not deductible under s 6(a) of the Income War Tax Act 1927. In delivering the judgment of the Privy Council, Lord Macmillan said (at 133-134): …If the statute permitted the deduction of expenditure incurred for the purpose of increasing income the appellants might well have prevailed, but such a criterion would have opened a very wide door. It is obvious that there can be many forms of expenditure designed to increase income which would not be appropriate deductions in ascertaining annual net profit or gain. The statutory criterion is a much narrower one. Expenditure, to be deductible, must be directly related to the earning of income. The earnings of a trader are the product of the trading operations which he conducts. These operations involve outgoings as well as receipts, and the net profit or gain which the trader earns is the balance of his trade receipts over his trade outgoings. It is not the business of either the appellants to engage in financial operations…It is to those business that they look for their earnings. Of course, like other business people, they must have capital to enable them to conduct their enterprises, but their financial arrangements are quite distinct from the activities by which they earn their income. No doubt, the way in which they finance their businesses will, or may, reflect itself favourably or unfavourably in their annual accounts,but expenditure incurred in relation to the financing of their businesses is not, in their Lordships’ opinion, expenditure incurred in the earning of their income within the statutory meaning.The statute, in s. 5(b), significantly employs the expression “capital used in the business to earn the income.” differentiating between the provision of capital and the process of earning profits. [emphasis added] 100Montreal Cokewas considered by our Court of Appeal inIA. As I explained at [75] above, the taxpayer inIAhad incurred the Guarantee Expenses and the Pre-Payment Expenses in repaying the Syndicated Loan at a date earlier than the next interest payment date. There, the Comptroller contended that while the Guarantee Expenses and the Pre-Payment Expenses incurred allowed the taxpayer to obtain substantial interest savings, this related to the taxpayer’s financial structure and therefore, the said expenses were capital as opposed to revenue in nature. The Comptroller inIAcitedMontreal Cokeas authority for this proposition. 101    InIAat [97], the Court of Appeal distinguishedMontreal Cokeon the basis that the original loan inMontreal Cokewas capital in nature. Therefore, the expenses incurred in connection with that loan were also capital in nature. In contrast, the Court inIAhad earlier found (at [83]) that the Syndicate Loan was revenue in nature. Furthermore, with regard to the Guarantee Expenses, the Court held (at [108]) that it was established law that expenses incurred in connection with the refinancing of a revenue loan were also revenue in nature. 102    Before me, the Comptroller contended that the principles enunciated inMontreal Cokeremained good law in Singapore. The Comptroller said that the Court of Appeal inIAhad not disagreed with the principles enunciated inMontreal Coke. Rather, the Court had only distinguishedMontreal Cokeon its facts. The Comptroller further contended that the decision inMontreal Cokewas correct because the refinancing expenses in that case related to a capital loan. Therefore, the refinancing expenses would also have been capital in nature unless the taxpayer was engaged in the business of financial operations. 103    In my judgment, where a later loan is taken out to refinance an earlier loan, the principles enunciated inMontreal CokeandIAare both easily and properly reconciled by adopting the following two-step methodology. First, one must ask whether the earlier loan was capital or revenue in nature. If the earlier loan was revenue in nature, it would follow that the later loan and the borrowing expenses incurred in connection therewith would also be revenue in nature. If on the other hand the earlier loan was capital in nature, one should move on to the second step.  The enquiry here is whether the taxpayer was ordinarily engaged in the business of financial operations. If the taxpayer was not, then borrowing expenses incurred on the later loan are likely to be capital expenses and disallowed as a deduction under s 15(1)(c) of the ITA. 104    It bears noting that under s 80(4) of the ITA, the Appellant has the burden of proving that the Comptroller’s assessment of its income tax was excessive. Therefore, in these proceedings, as with the proceedings before the ITBR below, it is incumbent upon the Appellant to adduce evidence revealing the nature of the loans to be refinanced by the 1995 and 1996 Bonds. The Appellant has not done so. In my judgment, the Appellant’s failure to do so is fatal to its case under the first step of the two-step methodology I have set out earlier at [103] above. 105    The Appellant’s case thus turned on the second step, in particular, the application of the principles enunciated by the Privy Council inMontreal Coke. In this regard, the Appellant was plainly not engaged in the business of financial operations. It follows that the refinancing transactions for which the 1995 and 1996 Bonds were issued would have been capital as opposed to revenue in nature. To this extent, it also follows that the 1995 and 1996 Bonds were capital in nature. 106    I now come to the third use to which the 1995 and 1996 Bonds were to be put, namely, the financing of the day-to-day operations of the Appellant’s business. In this regard, the Appellant contended that such use of the bond proceeds was clearly revenue as opposed to capital in nature. 107    In my view, it is an incontrovertible proposition of law that a loan taken out for the purpose of acquiring trading stock is revenue as opposed to capital in nature.  In this regard the following passage of Lockhart J’s judgment inHunter Douglasis illuminating. There, Lockhart J said (at 116): Borrowing money to carry on business must prima facie be treated as augmenting the capital employed in the business.Borrowings by finance companies to then lend to their customers, and borrowing by trading companies to finance the purchase of trading stock, are exceptions to this general rule. Such borrowings are an integral part of the ordinary conduct of the company’s business and thus are revenue, not capital, items…. Borrowings are prima facie part of a company’s fixed capital. The distinction is between capital which enables a business enterprise to be conducted and the activities by which the income of the business is earned. Expenditure incurred in relation to the financing of a business is not expenditure incurred in the earning of the income of that business. [emphasis added] 108    It is also clear fromIAthat a loan taken out for the purpose of acquiring trading stock is revenue in nature. There, the taxpayer property development company had taken out the Syndicated Loan to purchase a parcel a land for development into a condominium project. Clearly then, the purpose of the Syndicated Loan was to enable the taxpayer to purchase trading stock. This was central to the Court’s finding (IAat [89]) that the Syndicated Loan was revenue in nature. 109    In my judgment however, the facts in the case before me are clearly distinguishable from those inIA. InIA, the Syndicated Loan was taken out with thespecific purposeof acquiring the taxpayer’s working capital, being land for development into a condominium project. In the present case, no such specific purpose exists. At best, the Appellant had issued the 1995 and 1996 Bonds for the general purpose of securing funds for the acquisition of working capital for the Appellant’s business. 110    The evidence showed that apart from the bond proceeds attributable to the Appellant’s hotel refurbishment project, the remaining proceeds of the 1995 and 1996 Bonds went into a mixed pool of funds that contained proceeds of other bonds issued by the Appellant. This was acknowledged by the Appellant’s witness in cross-examination before the ITBR. 111    I am mindful that in determining the purpose of the bond issues under theIAframework, the fact that the bond proceeds went into a mixed pool of funds is inconclusive as to whether the bonds were issued for capital or revenue purpose. I am also of the view that under theIAframework, the Appellant is not required to trace the exact uses to which the proceeds of the 1995 and 1996 Bonds were put. In my judgment however, the fact that the bond proceeds went into a mixed pool of funds supports the inference that while the Appellant may have intended to use the proceeds of the 1995 and 1996 Bonds to acquire its working capital, it did not have any specific projects or transactions in mind. This in turn supports the inference that the Appellant had issued the 1995 and 1996 Bonds for the general purpose of augmenting its capital structure. 112    Applying the framework inIA, I find that there was no linkage or an insufficient linkage between the 1995 and 1996 Bonds and the specific uses (whether revenue or otherwise) to which the bond proceeds may have been put. Rather, the only linkage that can be established is between the 1995 and 1996 Bonds and the general purpose of securing funds for the acquisition of working capital for the Appellant’s business. 113    Here, it is also apposite to note that thebond proceeds themselvesdid not constitute the Appellant’s working capital. Rather, the Appellant had tousethe bond proceeds to acquire its working capital. It is therefore not surprising that in these proceedings, the Appellant purported to equate the purpose of the bond issues with how the bond proceeds were used. Only then could the Appellant even attempt to show some linkage between the bond issue and a purpose that was clearly revenue in nature. However, as explained earlier at [83], the Appellant’s contentions in this regard are misconceived. I reiterate that under theIAframework, the true enquiry relates to thepurposeof the loan as opposed tohowthe borrowed funds were used. 114    This is a convenient juncture to consider the cases cited by the Appellant in support of its contention that the discounts and the redemption premium incurred in respect of the 1995 and 1996 Bonds were expenses incurred in securing working capital, and therefore, revenue as opposed to capital in nature. The Appellant relied on the decision of the High Court of Australia inColes Myer Finance Limited v Commissioner of Taxation of the Commonwealth of Australia(1993) 176 CLR 640 (“Coles Myer”). In that case, the taxpayer was a finance company. To raise finance for lending purposes, the taxpayer drew and sold bills of exchange and promissory notes at a discount. In holding that the discount incurred by the taxpayer was a revenue expense and therefore an allowable deduction, the majority said (at 664–665): Though the borrowed moneys were capital, it was working or circulating capital from which the taxpayer derived its profit by turning the borrowed money to account at higher rates of interest than those paid to the taxpayer’s lenders.The borrowing, as much as the lending, was an integral part of the day-to-day conduct of the taxpayer’s profit-earning business. … In our view, the present case…is an illustration of a loss or outgoing incurred for the purpose of securing working or circulating capital which is clearly deductible. There is no question but that the taxpayer issues bills and notes for the purpose of its business as a finance company, using the moneys raised by discounting the bills and notes for the purpose of providing finance, from which it earns its income…In effect the discount offered by the taxpayer is the cost of acquiring the funds which it turns over in its business, the amount of the discount serving the same purpose as the amount of interest on borrowed moneys; the amount of the discount is the cost of those moneys. … [emphasis added] 115    The Appellant also referred toFederal Commissioner of Taxation v Energy Resources of Australia Ltd(1996) 185 CLR 66 (“Energy Resources”). InEnergy Resources, the taxpayer was a mining company that had issued promissory notes to retire a finance facility from which funds had been obtained by the taxpayer for the purpose of financing the development and operation of a mine. The taxpayer incurred a discount in the issuance of those notes. The issue inEnergy Resourcesconcerned how the discounts were to be calculated. Pertinently, the Commissioner did not dispute that discount incurred by the taxpayer was a revenue expense and therefore an allowable deduction under the Australian income tax legislation. However, the Court remarkedobiter(at 73–74) that: The receipts from the [promissory notes] were not income. They were capital and not revenue receipts. The taxpayer did not trade in promissory notes; nor was it a financier. Money was not its stock in trade. Similarly, the payments made to discharge the liabilities arising from the notes were capital and not revenue payments. But that does not mean that the cost of the discounts was necessarily a capital expense. Where a taxpayer incurs loss or expense in raising funds by issuing promissory notes at a discount to their face value,its entitlement to a s 51 deduction for that loss or expense depends on the use to which the funds are to be put…As Dixon J pointed out inTexas Co (Australasia) Ltd v Federal Commissioner of Taxation(30):“Some kinds of recurrent expenditure made to secure capital or working capital are clearly deducible.”[emphasis added] 116    In my view, neitherColes MyernorEnergy Resourcesassist the Appellant’s case. For one, in neither case did the court expressly consider the question of whether a loan taken out for the general purpose of securing funds for the acquisition of working capital was capital or revenue in nature.  As regardsEnergy Resources, the question of whether the loan was capital or revenue in nature was not even before the Court. Furthermore, although it ultimately did not decide the issue, the Court appeared to suggest (at 74) that based on the evidence before it, a large part of the loan was in fact capital in nature. 117    As regardsColes Myer, the taxpayer there was a financial company. Therefore, the money it had received under the promissory notes was its stock and trade which it then on-lent to generate its business income. Quite clearly then, the discounts incurred by the taxpayer were expenses directly incurred in securing its working capital and therefore, revenue expenses. This is distinguishable from this case as the Appellant was plainly not a financial company. The same result ensues ifColes Myeris rationalised under the framework established inIA. InColes Myer, the loan was taken out for thespecific purposeof on-lending. From the point of view of a financial company, this was clearly a revenue purpose as lending was the very activity through which the taxpayer generated its trade income. 118    This brings me to the case ofBeauchamp (Inspector of Taxes) v F.W. Woolworth plc[1990] 1 AC 478 (“Beauchamp”). InBeauchamp, the taxpayer ran a number of retail shops in the United Kingdom. The taxpayer took out loans so as to have cash for general trading purposes. The taxpayer later incurred currency losses in respect of the loans. The issue inBeauchampthen was whether the currency losses were deductible for the purposes of assessing income tax. This in turn depended on whether the loans on which the currency losses were incurred were capital or revenue in nature. 119    InBeauchamp, the taxpayer’s finance director gave evidence that the taxpayer had requiredincreased working capitalfor various reasons. This included an extensive modernisation programme involving the repair, refurbishment and enlargement of the taxpayer’s premises. The loans were also taken out to overcome the taxpayer’s cash-flow problems. Therefore, it was obvious that the loans were taken out with no specific purpose as the taxpayer was free to use the loans for any one of several purposes. 120    InBeauchamp, Hoffmann J held at first instance (seeBeauchamp (HM Inspector of Taxes) v FW Woolworth plc[1987] STC 279) that the loans in question were a sufficiently permanent addition to the taxpayer’s funds so as to be regarded as capital in nature. Hoffmann J’s decision was reversed on appeal to the Court of Appeal. On appeal to the House of Lords, their Lordships upheld Hoffmann J’s decision that the loans were capital in nature. 121Beauchampwas given careful and thorough consideration by the Court of Appeal inIA. There is no need to repeat that exercise here. In these proceedings, it is more pertinent to have regard to the Court of Appeal’s treatment ofBeauchampinIA;it said at [37]: It is clear…that,unlikethe present case, the loans inBeauchamp’s case were intended forgeneraluse. Indeed, there was ample evidence that part of the loan was intended for acapitaluse. That the loans were intended for general use did weight heavily with Hoffmann J is evidenced in the passage from his judgment which we have just quoted. Indeed, if the funds from a loan can be utilised foranypurpose, then the concept of purpose, in our view,doesbecome immaterial or irrelevant. This is becausesomething that can be used for anything is not only uninformative but is also (and more importantly) clearly marked out for one purpose only – it is part of the general capital funding or structure of the taxpayer. At this point, it is true that there is, literally speaking, a purpose. However, in the nature of things, there is no need for the court to ascertain the specific purpose as such. The court can simply assume what is already obvious – that there is no real specific purpose, with the funds from the loan concerned being available for any purpose and, as such, constituting part of the capital structure of the company.This, we reiterate, is clearlynotthe situation on the facts of the present appeal. [emphasis in original in italics, emphasis added in underline] The effect of the foregoing passage is that where a loan is taken for a general as opposed to a specific purpose, it is likely to be capital as opposed to revenue in nature. 122    Turning then to apply the principles to this case, it is pertinent that there was no linkage between the 1995 and 1996 Bonds and any specific project or transaction that was clearly revenue in nature. Conversely, it is clear from the evidence that the bonds were issued for the more general purpose of raising funds for the acquisition of working capital. In my judgment, this was a transaction that was capital in nature. It follows that insofar as the 1995 and 1996 Bonds were to be put to use as working capital to finance the day-to-day operations of the Appellant’s business, they were capital as opposed to revenue in nature. 123    From my findings at [95], [105] and [122], I conclude that the 1995 and 1996 Bonds bore the nature of capital. Accordingly, the discounts and redemption premium incurred by the Appellant in respect of the 1995 and 1996 Bonds were also capital in nature and therefore, disallowed from deduction under s 15(1)(c) of the ITA. 124    My findings at [54] and [123] are sufficient to dispose of the entire appeal before me. For completeness however, I shall briefly address the other arguments raised by the Appellant in support of its contention that the discounts and redemption premium paid on the 1995 and 1996 Bonds were expenses that were revenue as opposed to capital in nature. Broadly speaking, the Appellant’s contentions were twofold. 125    First, the Appellant contended that as the bond proceeds were used to produce the Appellant’s income, the 1995 and 1996 Bonds were revenue in nature. Being derivative in nature, the Appellant says that the discounts and redemption premium paid on those bonds were revenue expenses and not prohibited from deduction under s 15(1)(c) of the ITA. 126    In my view, the Appellant’s contentions are misconceived. The test to be applied in distinguishing between capital and revenue expenditure, as set out inABDandIA, looks to thepurpose of the expenditure. The test isnotwhether the expenditureresulted in the production of the income. If this were otherwise, expenditure incurred to acquire a capital asset, such as machinery, would turn into revenue expenditure just because the use of the machinery led to the production of the taxpayer’s income. Similarly, the 1995 and 1996 Bonds, being issued for capital purposes, did not turn into a revenue loan merely because they resulted in the production of the Appellant’s income. 127    Second, the Appellant contended that by allowing the deduction of interest paid on the 1995 Bonds and the 1996 Bonds, it was unreasonable for the Comptroller not to allow the deduction of the discounts and redemption premium paid on the same bonds. This was so as the discounts and redemption premium were also “interest” under s 14(1)(a) of the ITA. Moreover, by allowing the deduction of interest paid on the 1995 and 1996 Bonds, the Comptroller must have been satisfied that the bonds were in the nature of revenue as opposed to capital. 128    I do not accept the Appellant’s contentions in this regard. For one, as I explained at [54] above, the discounts and redemption premium incurred by the Appellant were not “interest” under s 14(1)(a) of the ITA. I also found at [123] above that the 1995 and 1996 Bonds were capital in nature. In my views, the Comptroller’s treatment of the interest paid under the 1995 and 1996 Bonds is irrelevant in these proceedings. The issue of whether the interest paid on the bonds were capital or revenue expenses is not before me. Nor was it before the ITBR. 129    I should also reiterate that under s 80(4) of the ITA, the Appellant bears the burden of proving that the Comptroller’s assessment of its income tax was excessive. In particular, the Appellant bears the burden of proving that the discounts and redemption premium incurred in respect of the 1995 and 1996 Bonds were revenue expenses. In effect, the Appellant’s contentions as regard the Comptroller’s treatment of the interest paid on the bonds amounted to no more than an attempt to shift the burden to the Comptroller to prove that the discounts and redemption premium incurred by the Appellant were capital in nature. In my view, the Appellant cannot, and should not, be permitted to do this. 130    Finally, I wish to briefly address the Comptroller’s contentions with regard to the deductibility of interest under s 14(1)(a) of the ITA. The Comptroller contended that it was justified in allowing the deduction of the interest paid on the Bonds and not allowing the deduction of the discounts and redemption premiums as the requirements under s 14(1) and s 14(1)(a) of the ITA were different. According to the Comptroller, deductibility under s 14(1)(a) depended on whether the interest waspayable on capital employed in acquiring the income. Therefore, the Comptroller said that under s 14(1)(a), the Comptroller need not be satisfied that the underlying loan was revenue in nature. 131    I disagree. In my view it is clear fromT LtdandIAthat the deductibility of interest expenses depends on the nature of the underlying loan. Interest expenses incurred on a capital loan would also be capital in nature and therefore disallowed as a deduction under s 15(1)(c) of the  ITA. This is so even if the requirements for deductibility under s 14(1)(a) are satisfied. However, nothing turns on this issue in the present appeal and I need not say more on this issue.",
        "Conclusion": "132    For reasons stated earlier, I dismiss the Appellant’s appeal with costs to the Comptroller, to be taxed on a standard basis unless otherwise agreed."
    }
}