{
    "case_title": "Chiam Heng Hsien (personal representative of the estate of Chiam Toh Moo, deceased, and partner of Mitre Hotel Proprietors)\n      v\n      Chiam Heng Chow (executor of the estate of Chiam Toh Say, deceased) and others",
    "ncitation": "[2013] SGHC 35",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "Originating Summons No 1123 of 2010": "2       Heng Hsien’s claim pertains to the proceeds of sale of 145 Killiney Road (“the Property”), of which MHP’s share amounts to $11.5m (“the Proceeds”).  In originating summons no 1123 of 2010 (“OS1123/2010”), the first and second defendants, in their capacity as executors of the estate of Toh Say, applied for an order for the distribution of the Proceeds in the following manner (with provision for payment of $1.5m to pay for taxes, expenses and legal costs incurred in five actions commenced by originating summonses from 1996 to 2006 and four appeals arising from those actions): (a)     Estate of Toh Moo: 21/88 share (b)     Estate of Toh Say: 25/88 share (c)     Estate of Toh Tong: 21/88 share (d)     Estate of Toh Kai: 19/88 share (e)     Estate of Chiam Toh Lew: 2/88 share 3       At the hearing of OS1123/2010 before Philip Pillai J (“Pillai J”) on 30 November 2011, counsel for Heng Hsien, who was the first defendant in OS1123/2010, informed the court that Heng Hsien claimed the entirety of the Proceeds and intended to file a writ against the defendants to prosecute his claim. In view of this, Pillai J adjourned the hearing of OS1123/2010sine die, pending the determination of those claims.",
        "Suit No 1 of 2012: Summonses No 917, 918, 919 and 920 of 2012": "4       On 3 January 2012, Heng Hsien filed the writ in the present suit. After close of pleadings, on 27 February 2012, the defendants applied in the following summonses to strike out the writ on the ground that it disclosed no reasonable cause of action or was otherwise an abuse of the process of court: (a)     Summons No 917 of 2012 filed by first defendant and second defendant; (b)     Summons No 919 of 2012 filed by third defendant; and (c)     Summons No 918 of 2012 filed by fourth defendant. 5       The first defendant and second defendant also applied in Summons No 920 of 2012 for a determination of a question of law, namely whether Toh Say held his legal and equitable interest the 25/88 share of the Proceeds “effectively in his possession of which he had also the legal estate”. The first defendant and second defendant prayed that, if the answer was in the positive, Heng Hsien’s action against them be dismissed with costs. 6       On 10 May 2012, assistant registrar Jordan Tan (“AR Tan”) declined to strike out the writ but gave leave to Heng Hsien to amend his statement of claim. One of the reasons was that it transpired that Heng Hsien was not the personal representative of the estate of Toh Moo as purported in the writ and therefore, on that ground alone, an amendment was necessary. AR Tan also gave other grounds for dismissing the application which I need not go into. He ordered costs to be in the cause as the “opposing parties [had] been partially [successful]”.",
        "Registrar’s Appeals No 176, 177, 184 and 187 of 2012": "7       The defendants appealed against the decision of AR Tan in the four registrar appeals (“the appeals”) before me. The appeals were heard on 30 August 2012 with Heng Hsien appearing in person. By that time, Heng Hsien had, on 23 August 2012, filed an amended statement of claim (“Amended SOC”). The appeals were heard on the basis of the Amended SOC. After hearing Heng Hsien and counsel for the defendants, I made the following orders: (a)     Para 23 of the Amended SOC be struck off; (b)     Paras 24, 42, 44 and 45 of the Amended SOC be struck off; (c)     Paras 39, 40, 41 of the Amended SOC be struck off; (d)     Prayers 1 and 2 of the Amended SOC be struck off; (e)     Heng Hsien be granted leave to amend the statement of claim to plead his remedy against the fourth defendant in respect of the 21/88 share of the Proceeds, such amendment to be filed by 30 November 2012 failing which Heng Hsien’s claim against the fourth defendant would be struck out without further order; (f)     Costs of the suit to be paid by Heng Hsien to the first defendant, second defendant and third defendant to be taxed unless agreed. Costs of the fourth defendant to be paid by Heng Hsien to the fourth defendant fixed at $10,000. 8       The outcome of the appeals was that Heng Hsien’s claims against the first defendant, second defendant and third defendant were struck off.",
        "Civil Appeal Nos 124, 125, 126 and 127 of 2012": "9       Heng Hsien has filed civil appeal nos 124, 125, 126 and 127 of 2012 against my decisions in registrar’s appeal nos 176, 177, 184 and 187 of 2012 respectively. I now give the grounds for my decision.",
        "Factual background": "10     This case is one further episode in the long running saga of the Chiam family. There have been numerous skirmishes in the courts for more than a quarter century and the background has been so well chronicled in various judgments that it does not justify my adding to the considerable literature in existence. For the detailed background facts, I need only to refer to the judgment of the Court of Appeal delivered on 8 September 1993 in civil appeal no 150 of 1991, reported asChiam Heng Chow and another (executors of the estate of Chiam Toh Say, deceased) v Mitre Hotel (Proprietors)(a firm) and others[1993] 2 SLR(R) 894 (“CA150/1991”). In that appeal, the first defendant and second defendant, as executors of the estate of Toh Say, were the appellants, MHP was the first respondent, Heng Hsien was the second respondent and Toh Kai was the third respondent. As there is a correspondence of parties between CA150/1991 and the present suit, part of my decision is based on the decision in that appeal. 11     MHP was formed in 1952 with the execution of a partnership deed by Toh Moo, Toh Say, Toh Tong, Toh Kai and Toh Lew. All the original partners have since passed away. In October 1952, Toh Say executed a deed declaring that he held a one-tenth undivided share in the Property on trust for MHP. After numerous actions by some of the original partners and their issue, the Property was finally sold by order of court in originating summons no 830 of 2006 (and affirmed in subsequent appeals). The sale fetched the sum of about $120m. After setting aside the sum of about $5.6m for expenses and costs, including costs of litigation, a balance of $115m was available for distribution to the owners of the Property. MHP’s one-tenth share came to $11.5m and its distribution is the subject matter in OS1123/2010, which was stayed pending determination of the present suit.",
        "Claim against first defendant and second defendant": "12     Heng Hsien’s claims against the first defendant and second defendant are in their capacities as executors of the estate of Toh Say. His claims relied on the facts set out in para 19 of the Amended SOC which states as follows: 19    On 31 March 1975, Chiam Toh Say served a notice on all the other partners of MHP to dissolve the partnership.  He also suspended the partnership account.  After serving the said notice, Chiam Toh Say left the premises of the Mitre Hotel with some accounting book and files belonging to MHP and never returned.  So far as the other partners of MHP were concerned, we treated him as having withdrawn from the partnership, and could not hold him liable for future losses and liabilities of MHP. 13     Heng Hsien’s claim against the first defendant and second defendant is pleaded in the following manner in para 23 of the Amended SOC, which provides as follows: 23    As the right to claim against MHP for the share owed to Chiam Toh Say’s estate accrued at the time of his death on 16 February 1990, or alternatively, at the time of the grant of probate to the 1stand 2ndDefendants on or about 29 September 1990, the Plaintiff avers that the said claim has become time-barred by operation of section 6 of the Limitation Act (Cap. 163) and/or become prevented by laches. 14     Heng Hsien’s claim is predicated on Toh Say’s 1975 notice of dissolution being effective in dissolving the partnership. However, the Court of Appeal in CA150/1991 held that the notice did not dissolve the partnership, and made the following finding at [26] of its judgment: 26    On the basis of all these facts, we have come to the conclusion that [Heng Hsien] and [Toh Kai] and Toh Lew at all material times did not give effect to the notice of dissolution issued by the solicitors for Toh Say; they had treated the notice as having no effect. The partnership was not dissolved as at 31 March 1975 and Toh Say continued to remain a partner and was entitled to a share of profits for the period 1976 to 1986. 15     As this finding of fact is binding on Heng Hsien, it meant that the partnership was not dissolved at the time of Toh Say’s death on 16 February 1990. It is not in dispute that no final and general account had been taken. Therefore there was no settlement or liquidation of the affairs of MHP to date and the estate of Toh Say was entitled to claim his share of the assets of the partnership. As for the point regarding the Limitation Act (Cap 163, 1996 Rev Ed), it does not apply to an action by a beneficiary under a trust. I accordingly struck out para 23 of the Amended SOC, which meant that Heng Hsien’s claim against the first defendant and second defendant was struck out.",
        "Claim against third defendant": "16     Heng Hsien’s claim against the third defendant is set out in para 42(b) of the Amended SOC which alleges that he had purchased Toh Tong’s 21/88 share by way of a $50,000 loan to Toh Tong’s son and executor, Chiam Heng Pout (“Heng Pout”). Paragraph 42(b) provides as follows: The estate of Chiam Toh Tong has no further claim on any of the assets of MHP, as the Plaintiff has purchased all the 21/88 share from Toh Kai as agreed by way of the $50,000 loan made to Chiam Heng Pout, and save the estate of Toh Tong with nominal share to be decided by the Plaintiff and the Plaintiff will pay the 3rdDefendant, the legal representative of the estate of Toh Tong a reasonable amount (to be decided by the Plaintiff) in respect of the nominal share of the said estate in MHP ... 17     The facts pleaded by Heng Hsien for this claim are as follows: (a)     In November 1974, Toh Kai acquired Toh Tong’s 21/88 share (para 25 of the Amended SOC). (b)     In the mid-1980s, the plaintiff extended a loan of $50,000 to Heng Pout to enable him to tide over his financial difficulties. The loan was given on condition that if it was not repaid within six months or Heng Pout became bankrupt within this period, then Heng Hsien would acquire the 21/88 share (paras 34 and 35 of the Amended SOC). 18     The problem with this allegation is that on Heng Hsien’s own pleading, Toh Kai had, by the time of the loan, acquired Toh Tong’s 21/88 share. Therefore his claim for that share is against the estate of Toh Kai (represented by the fourth defendant) and not the estate of Toh Tong (represented by the third defendant). 19     However, Heng Hsien is precluded from taking the position that Toh Kai had acquired Toh Tong’s 21/88 share on account of the outcome of originating summons no 136 of 2002. The third defendant was the plaintiff in that action and Heng Hsien was the defendant and the court gave a declaration that the estate of Toh Kai held the 21/88 share in MHP on trust for the estate of Toh Tong. That being the case, Heng Hsien had not pleaded that Heng Pout had pledged that 21/88 share as security for the loan, it being his case that it was Toh Kai who had agreed to this. In any event, by that time the third defendant was an executor of the estate and it was not pleaded that she had given her consent to the share being pledged for the loan. 20     Therefore, Heng Hsien’s action against the third defendant ought to be struck off.",
        "Chiam Toh Lew’s 2/88 share": "21     Paragraph 24 of the Amended SOC alleged that after Chiam Toh Lew died in 1975, the executors of his estate sold the 2/88 share he held in MHP to the partners of MHP for the sum of $7,000. Heng Hsien had paid this amount to the executors. On the basis that Toh Say had disposed of his share and Toh Kai had withdrawn from MHP, Heng Hsien claimed that he had acquired the 2/88 share personally. However, in view of [14] above, Toh Say was still a partner. On Heng Hsien’s own pleadings, the 2/88 share was acquired by MHP. To the extent that the $7,000 came from him, he had a claim against MHP for this amount. Therefore para 24 of the Amended SOC should be struck out.",
        "Claim against fourth defendant": "22     Paragraphs 39, 40, 41 and 42(c) of the Amended SOC set out the claim against the fourth defendant. They plead that on 8 September 1993, the estate of Toh Kai had served notice of withdrawal as partner of MHP and had effectively withdrawn from the partnership. As with the first defendant and second defendant, Heng Hsien pleaded that “the claim by Chiam Toh Kai’s estate against MHP accrued following his death, and it is now time-barred, or alternatively, is defeated by laches”. 23     As with the case of the first defendant and second defendant (see [15] above), there was no final and general account taken upon the alleged withdrawal by the estate of Toh Kai from MHP. Therefore there was no settlement or liquidation of the affairs of MHP to date and the estate of Toh Kai was similarly entitled to claim his share of the assets of the partnership. 24     Furthermore, Heng Hsien’s positionvis-a-visthe estate of Toh Kai is inconsistent with the following: (a)     Heng Hsien’s affidavit dated 6 June 2011 filed in OS1123/2010 in which he affirmed at [43] that the fourth defendant “was admitted to the partnership, to represent Chiam Toh Kai’s Estate”. (b)     The estate of Toh Kai continuing to receive income tax notice of assessment after 1993 in respect of the income of MHP. (c)     The order of court of 25 March 2003 in originating summons no 136 of 2002 (in which the plaintiff was third defendant, as trustee of the estate of Toh Tong, and the defendant was the fourth defendant as trustee of the estate of Toh Kai) declaring that the estate of Toh Kai held the 21 shares on trust for the estate of Toh Tong and that the estate of Toh Kai had beneficial interest in the remaining 19 shares in its name. 25     As for the point regarding the Limitation Act, it does not apply to an action by a beneficiary under a trust. I accordingly struck out paras 39, 40, 41 and 42(c) of the Amended SOC. 26     However certain paragraphs of the Amended SOC, in particular paras 34 to 38, could be construed as a claim by Heng Hsien against the estate of Toh Kai in relation to an agreement by Heng Hsien to lend $50,000 to Heng Pout (the son of Toh Tong) in consideration for Toh Kai pledging a 21/88 share in the partnership. However there was no remedy pleaded in the Amended SOC. I took into consideration the fact that Heng Hsien was acting in person before me and did not have the benefit of legal advice and granted him leave to amend the Amended SOC accordingly. However, I noted that the application in OS1123 for the court to sanction distribution of the proceeds had been made in 2010 and stayed to permit Heng Hsien to make the claims in this suit and the fact that this dispute in various incarnations had been raging for decades. It was therefore incumbent on Heng Hsien to prosecute his claim with expediency and I gave him until 30 November 2012 to file the amendments to the Amended SOC, failing which the suit would be struck off without further order.",
        "Costs": "27     In view of the outcome, I ordered Heng Hsien to pay costs of the suit to the first defendant and second defendant, as well as to the third defendant, which shall be taxed unless agreed between them. I ordered Heng Hsien to pay the costs of the fourth defendant which I fixed at $10,000."
    }
}