{
    "case_title": "Mullaichelvan s/o Perumal\n      v\n      Lee Heng Kah",
    "ncitation": "[2013] SGHCR 3",
    "coram": "Colin Seow AR",
    "sections": {
        "Introduction": "1       On 27 February 2009, a road traffic accident occurred between one Mullaichelvan s/o Perumal (“the Plaintiff”) and Lee Heng Kah (“the Defendant”) at a road junction along Mandai Road. At the time of the accident, the Plaintiff was riding a motorcycle while the Defendant was driving a motor vehicle. As a result of the accident, the Plaintiff suffered, inter alia, bodily injuries. 2       The Plaintiff commenced a suit against the Defendant on 19 April 2011, but the parties eventually reached a settlement on the issue of liability and on 28 November 2011 a consent judgment (“the consent judgment”) was recorded by a High Court Judge that the Defendant shall be liable to pay the Plaintiff 95% of damages which was to be assessed. On 3 September 2012, Notice of Appointment for Assessment of Damages No 43 of 2012 (“NA 43/2012”) was filed by the Plaintiff for an assessment of damages against the Defendant. NA 43/2012 eventually came up for hearing before me from 17 September 2012 to 20 September 2012, at the end of which I reserved judgment. Parties’ written submissions and reply submissions were tendered and exchanged on 17 October 2012 and 30 October 2012 respectively. I now deliver my judgment with my reasons.",
        "Agreed damages": "3       At the hearing before me, counsel have informed the court that parties have agreed to the following items of damages to be paid by the Defendant to the Plaintiff: Agreed damages(a)Medical expenses$18,119.98(b)Loss of motorcycle$5,405.00(c)Transport expenses$2,300.00(d)Nursing care and/or loss of wife’s income$5,500.00(e)Future medical care$18,000.00Total$49,324.98   4       This agreed sum is subject to a further 5% deduction on account of 95% liability being attributed to the Defendant pursuant to the consent judgment (see [2] above).",
        "Disputed claims": "5       I shall now deal with the contested categories of damages, having read the written submissions and reply submissions that have been tendered to the court.",
        "Head injuries": "6       The Plaintiff suffered head injuries as a result of the accident. The head injuries consist of traumatic subarachnoid haemorrhage, left temporal lobe contusion and a fracture of the left frontal skull bone. It is not disputed that there was only structural damage to the Plaintiff’s head occasioned by the accident, and that there was no psychological or cognitive impairments. The Plaintiff however still complains of some giddiness and headaches, although the point that the Plaintiff is suffering from residual disabilities and complications in his head was challenged by the Defendant’s counsel during cross-examination. The Defendant, on the other hand, contends that the Plaintiff’s head injuries were not severe as the Plaintiff’s head was treated conservatively with no major cranial neurosurgery, and that the Plaintiff was fully conscious and alert upon being admitted to hospital after the accident occurred. 7       In submitting a figure of $75,000, the Plaintiff’s counsel suggested that the severity of the structural damage to the Plaintiff’s head is comparable to that found inLee Wei Kong (by his litigation representative Lee Swee Chit) v Ng Siok Tong[2012] 2 SLR 85 (“Lee Wei Kong”),Tan Juay Mui (by his next friend Chew Chwee Kim) v Sher Kuan Hock and another (Liberty Insurance Pte Ltd, co-defendant; Liberty Insurance Pte Ltd and another, third parties)[2012] 3 SLR 496 (“Tan Juay Mui”) andTan Yu Min Winston v Uni-Fruitveg Pte Ltd[2008] 4 SLR(R) 825 (“Tan Yu Min Winston”). This point is rather contentious and I shall go deeper into some details of these cases which have been cited to me. 8       InLee Wei Kong, the victim suffered,inter alia, severe traumatic head injuries with fracture of the left zygoma, fracture of the left temporal bone that extended to the base of skull, large left parieto-temporal extradural haematoma with severe mass effect that caused a midline shift of the brain, bilateral frontal subdural haematomas, subarachnoid haemorrhage and right brain contusion and was left in coma for 17 days. There were also psychological and cognitive disabilities in that case. At first instance, an Assistant Registrar (“AR”) awarded $80,000 for injury to the victim’s whole body including structural damage to the head and fractures to the cervical spine. Taking into account the other damage suffered by the victim, the AR arrived at a total sum of $285,000 for damages for pain and suffering and loss of amenities. On appeal, the High Court Judge globally reduced the damages for pain and suffering and loss of amenities to $160,000. On further appeal to the Court of Appeal, this particular part of the award was not disturbed. 9       InTan Juay Mui, the victim suffered, inter alia, severe brain injury with blood collecting between the layers of the brain. An AR who heard the case awarded $170,000 for the head injuries, and this included paralysis and loss of vision and loss of amenities. On appeal, the Judge agreed with the AR’s analysis that the severity of the victim’s head injuries was somewhere between that inLee Wei Kong(see [8] above) andRamesh s/o Ayakanno (suing by the committee of the person and the estate, Ramiah Naragatha Vally) v Chua Gim Hock[2008] SGHC 33 (where the victim was left unable to move or talk and with a shortened life expectancy of ten years) and did not disturb the award made by the AR for head injuries. 10     InTan Yu Min Winston, the victim, a polytechnic student, suffered,inter alia, serious head injuries with psychological and cognitive impairments. On assessment, an AR awarded a total figure of $90,000 for collective injuries to the victim’s head region. On appeal, a High Court Judge refused to disturb this figure under the heading of “Head Injuries”. 11     Having regard to the medical evidence adduced on the structural head damage suffered by the Plaintiff in the present case, and comparing the present case with the authorities discussed above, I am unable to agree with Plaintiff’s counsel that the Plaintiff should be awarded $75,000 for structural head damage. First, the structural damage to the Plaintiff’s head in the present case was not as severe and extensive as that found inLee Wei Kong(see [8] above). Second, even inTan Juay Mui(see [9] above) where the High Court Judge has found that the severity of the victim’s head injuries was greater than inLee Wei Kong, the final sum awarded for head injuriesincludingparalysis, loss of vision and loss of amenities, was fairly circumspect. In my view, I find that an appropriate sum to be awarded in the present case for structural damage to the Plaintiff’s head should be$45,000.",
        "Left brachial plexus injury": "12     This is the injury to the Plaintiff’s left upper limb which led to paralysis of the said limb. The evidence before me as regards this injury are as follows. Ms Christine Goh, who was the Plaintiff’s occupational therapist, gave evidence in court that the Plaintiff still has some limited use of his left upper limb which she considered was not entirely paralysed. However, according to the evidence of Dr Yegappan Muthukaruppan (“Dr Yegappan”) (an orthopaedic specialist), the Plaintiff’s left upper limb is “atrophied and flail” and “essentially paralysed”. Dr Yegappan also stated that the Plaintiff’s left upper limb “is a useless limb and [the Plaintiff] will never regain use” of that limb. Dr Yong Fok Chuan (“Dr Yong”) who is an orthopaedic specialist and the Plaintiff’s treating doctor for his left brachial plexus injury, gave evidence that the Plaintiff’s condition is “equivalent to a loss of an upper limb”, and “similar to an amputation”. Dr Lee Soon Tai (“Dr Lee”), the Defendant’s expert witness and an orthopaedic specialist, agreed with Dr Yong’s evidence in his own testimony in court. 13     The cases ofOoi Han Sun and another v Bee Hua Meng[1991] 1 SLR(R) 922 andFauziyah Binte Mansor v Abu Bakar Hussin[1993] SGHC 134 were cited to me. The Defendant’s counsel submits that just as in those cases where there were brachial plexus injuries suffered by the victims, an award of $50,000 would be fair and reasonable in the present case. The Plaintiff’s counsel, however, argues that no less than $75,000 should be awarded on account that in the present case, the Plaintiff also suffered consequential numbness to his right calf and ankle, and consequential injury to the left hemi diaphragm, arising from the treatment of the left upper limb (ie, the harvesting of, inter alia, the sural nerve). 14     On review of the evidence placed before me, I note that Dr Yegappan’s report dated 6 December 2010 has recorded that the Plaintiff suffered numbness in the right calf and ankle due to nerve harvesting. In the same report, he also recorded that the transfer of the left phrenic nerve “will have paralyzed [the Plaintiff’s] left hemi diaphragm as shown in the chest x-rays”. The first point regarding the numbness in the right calf and ankle was not contested during the hearing before me, and I accept this evidence given also that it has not been disputed that the harvesting of the Plaintiff’s sural nerve did actually take place. The second point regarding the Plaintiff’s left hemi diaphragm, was similarly not challenged during the hearing. 15     Accordingly, I award a sum of$53,000for the left brachial plexus injury as well as for the consequential numbness in the Plaintiff’s right calf and ankle, and consequential injury to the left hemi diaphragm, arising from the treatment of the left brachial plexus injury.",
        "Lower limb injuries": "16     The Plaintiff also suffered fractures to the left ankle, open fractures of the proximal and distal phalanges of the left big toe with nail bed lacerations, and fracture of the middle phalanx of the left 2ndtoe. The Defendant’s counsel submitted that an award of $12,000 for all these lower limb injuries would be reasonable. The Plaintiff’s counsel, on the other hand, seeks an award of $22,000 for the left ankle injury, $8,000 for the open fractures of the proximal and distal phalanges of the left big toe with nail bed laceration, and $4,000 for the fracture of the middle phalanx of the left 2ndtoe. I am satisfied on the evidence and on examination of the case precedents cited to me in submissions[note: 1]that an award of$15,000would be a fair sum for the left ankle injury. As for the injuries to the phalanges of the left big and 2ndtoe, with nail bed lacerations, I find that a combined award of$6,000would fairly compensate the Plaintiff for these toe injuries which have since healed with no residual permanent disabilities.",
        "Right distal radius fracture": "17     This is the fracture of the Plaintiff’s right wrist. Although the injury has since been treated with positive results, the Plaintiff still complains of pain to his right wrist when carrying loads, and that such pain could get worse in cold weather. Dr Lee’s oral evidence in court indicated that although the injury would not give rise to any risk of rheumatism, there was a 20-25% increased chance of arthritis developing in the future in the Plaintiff’s right wrist as a result of the fracture. This part of Dr Lee’s evidence was not challenged by the Defence. Having regard to the table of precedents cited to me by Plaintiff’s counsel in written submissions,[note: 2]I award$15,000to the Plaintiff for this particular injury.",
        "Left distal radius fracture": "18     This is the fracture of the Plaintiff’s left wrist. The Plaintiff’s counsel in written submissions has accepted that no award should in principle be granted for this injury because it is accepted that this injury did not arise from the present accident. However, the Plaintiff’s counsel at the same time also invited the court to nonetheless make a small award for the swelling of the left wrist which the Plaintiff has complained of after the accident. I see no basis, in the absence of any supporting medical evidence, to make such an award for the swelling. Accordingly, no award is made for this injury.",
        "Spinal injuries": "19     As regards the injuries to the Plaintiff’s C6 and C7 vertebrae (ie, right transverse processes fracture), it emerged that the injuries were not detected in the CT cervical spine scan conducted on the Plaintiff on 27 February 2009 (ie, the day of the accident), but instead were detected one day later in another CT cervical spine scan done on 28 February 2009. The Defendant’s counsel has argued that it was possible that this could be explained by the Plaintiff having sustained the C6 and C7 injuries in the hospital and not as a result of the accident. In the absence of any supporting evidence, I am not inclined to agree with that suggestion. As such, I will award the Plaintiff$3,000for the C6 and C7 injuries. This sum was actually asked for by the Plaintiff’s counsel in written submissions, and this sum was also the sum that the Defendant’s counsel in their written submissions were prepared to accept in any event.[note: 3] 20     As regards the injury to the Plaintiff’s L1 and L4 vertebrae (ie, undisplaced fracture of L1 vertebra and compression fracture of L4 vertebra), the dispute is as to the quantum of the damages to be awarded. In his written submissions, the Plaintiff’s counsel has referred to,inter alia, theGuidelines for the Assessment of General Damages in Personal Injury Cases(Academy Publishing, 2010), p 23, where it states that “damages for fracture of one vertebra starts at about $15,000, discounting for overlap for two or more such fractures”. Accordingly, the Plaintiff’s counsel submits,inter alia, that a combined award of $26,000 would be reasonable for both the L1 and L4 fractures in the present case. I find this to be a reasonable submission, and therefore award$26,000to the Plaintiff for both the L1 and L4 fractures.",
        "Comminuted fracture of left 1stand 2ndribs with pneumothorax": "21     The cases and precedents on the proper award to be given for such injuries are relatively uncontroversial.[note: 4]The cases and precedents appear to suggest that where there are fractures to two ribs with pneumothorax,among other injuries, an award of around $7,000–$8,000 will be granted by the court (seeSoh Eng Peng v Tay Heow Hua (DC Suit No 4581 of 1998)andHeng Kim Eng v Singapore Bus Service (Suit No 2690 of 1987)). Accordingly, I find the Plaintiff’s counsel’s submission of $13,000 in the present case to be excessive and award$5,000for this category of injuries.",
        "Collapse of bilateral lower lobes of lungs": "22     There appears to be some degree of overlap between this category and the previous category because the Plaintiff accepts that the collapse of the bilateral lower lobes of the lungs was caused by left lung haziness (which, according to Dr Yong’s unchallenged evidence, was a separate pathology)andpneumothorax (dealt with at [21] above). Plaintiff’s counsel also admitted that he is not able to find specific comparable awards for this injury. No evidence was led to show how much of the collapse of the bilateral lower lobes of the Plaintiff’s lungs was attributed to pneumothorax and left lung haziness respectively. In the circumstances, I will only grant an award of$1,000to recognise that the left lung haziness (a separate pathology), might probably have had certain additional adverse impact on the Plaintiff’s lungs as a result of the accident.",
        "Adrenal suppression": "23     In the Defendant’s counsel’s written submissions,[note: 5]it was pointed out that Dr Yegappan’s evidence indicated that it was possible that the adrenal suppression suffered by the Plaintiff could have resulted from the traumatic lung and chest injury sustained by the Plaintiff during the accident. However, Dr Lee gave evidence that adrenal suppression was just a temporary condition where the adrenal gland failed to work fully at the time of the Plaintiff’s admission into hospital. Given thus, I find no reason to award a substantial amount for this category of claim. I will award only$600to the Plaintiff for this.",
        "Laceration and scars, etc": "24     The Plaintiff’s counsel submits the Plaintiff should be compensated in the sum of $20,000 for the cuts, lacerations, keloids and scars on the Plaintiff’s body that were caused by the accident. The Defendant’s counsel, on the other hand, submits that $10,000 would be a fairer sum. The list of the Plaintiff’s laceration and scars, etc, which were noted by Dr Lee in his 1 April 2012 medical report appears to be rather extensive: (a)Surgical scar of 3cm with depression at the right frontal skull for ICP insertion.(b)Laceration scar of 4cm at the right posterior skull.(c)A-3cm healed laceration scar over the chin.(d)Multiple keloid laceration scars of 12cm, 5cm, 4cm, 4cm, and 2 X 3cm over the upper chest region.(e)Surgical scar of 10cm over the left clavicle.(f)Keloidal surgical scar of 20cm over the left breast.(g)Surgical scar of 7cm over the left axilla.(h)A-5cm keloidal scar over the volar aspect of the right wrist.(i)Keloidal surgical scar of 7cm over the volar aspect of the left wrist.(j)Surgical scar of 15cm at the postero-lateral side of the right calf for sural nerve harvesting.(k)Surgical scar of 7cm at the medial side of the left ankle.(l)Surgical scar of 12cm over the lateral side of the left ankle.25     In the circumstances, I will grant an award of$14,000for all these scars, keloids and lacerations which the Plaintiff has to bear on his body as a result of the accident (cf Guidelines for the Assessment of General Damages in Personal Injury Cases(Academy Publishing, 2010), p 57).Comminuted fracture of right inferior pubic ramus bone (pelvis) and mild sensory loss over right ring finger26     The Plaintiff also claims $12,000 for comminuted fracture of his right inferior pubic ramus bone (pelvis). This injury was recorded in one Dr Madeline Phuah’s medical report dated 19 February 2010 and Dr Yong’s report dated 19 March 2010. However, Dr Lee’s medical report dated 1 April 2012 indicated that the right inferior pubic ramus fracture “had been treated conservatively and consolidated with no residual permanent incapacity”. In the circumstances, I will award a modest sum of$1,500for this injury.27     The Plaintiff also claims $5,000 for mild sensory loss over his right ring finger. This injury does not appear to have been disputed by the Defence. However, I am of the view that $5,000 is excessive, given that the evidence suggests that what the Plaintiff had actually sustained during the accident was just a laceration over the right ring finger (as found in Dr Yong’s report dated 19 March 2010, and Dr Yegappan’s report dated 6 December 2010). I will therefore award a sum of$800for the mild sensory loss over the Plaintiff’s right ring finger.Loss of amenities28     At paragraph 115 of the Plaintiff’s counsel’s written submissions, the Plaintiff’s claim for loss of amenities appears to have been factored into the figures which the Plaintiff had submitted for the respective injuries discussed above. No specific arguments were pursued by the Plaintiff’s counsel in respect of loss of amenities. Accordingly, I see no reason to make any finding on loss of amenities in the present case.Pre-trial loss of income29     I come now to the Plaintiff’s claim for pre-trial loss of income. There is no dispute that the Defendant is liable to pay the Plaintiff for this particular claim. However, the quantum of this claim is disputed.30     Prior to the accident, the Plaintiff was working as a permanent night shift container driver/prime mover. He has since ceased work as a result of his disability caused by the accident. The Plaintiff’s counsel submits that the proper average monthly income should be calculated at $3,500, whereas the Defendant’s counsel argues that a multiplicand of $3,145.41 would be more accurate. The Defendant’s counsel reasoned that $3,145.41 is the accurate figure because that was the Plaintiff’s average monthly salary as stated in his former employer’s letter which was tendered in court.[note: 6]The Defendant’s counsel also sought to justify this amount by drawing attention to the Plaintiff’s income tax statements for the years 2007 and 2008. In fact, the Defendant’s counsel also submits that based on the income tax statements, the Plaintiff’s average monthly income could actually be found to be even lower at around $2,866. As I understand it, this lower sum was arrived at by adding the Plaintiff’s total assessable income for the years 2007 and 2008, before averaging it out over 24 months (ie, two years).31     From the outset, I am unable to agree with the Defendant’s counsel’s calculation of the Plaintiff’s average monthly income. First and foremost, I find that the Defendant’s counsel’smethodof averaging out the total assessable income for the years 2007 and 2008 over24months to be erroneous because the documentary evidence (ie, the Plaintiff’s Central Provident Fund (“CPF”) statement for the period of January 2008 to December 2008)[note: 7]clearly indicated that there was zero contribution to the Plaintiff’s CPF account for the months of June and July 2008. What this means is that the Plaintiff did not have any income for those two months, for otherwise there should have been entries for CPF contributions recorded for those months in the Plaintiff’s CPF statement.32     Instead, I find that the Plaintiff’s counsel’s mathematical basis andmethodof calculating the Plaintiff’s average monthly income[note: 8]would tend to more accurately compute the proper multiplicand to be adopted in the present case although, using the same method, the figure I arrived at is slightly higher than the sum of $3,500 which the Plaintiff submits. Here is how I arrived at the appropriate multiplicand. First, on review of the evidence, I accept that the Plaintiff’s yearly income for the years 2007, 2008 and 2009 are as follows: $37,257.01 (2007;12months of employment), $31,486.90 (2008;10months of employment) and $7,665 (2009;2months of employment before the accident took place on 27 February 2009).[note: 9]Averaging out the sum of these figures over 12 + 10 + 2 = 24 months (representing the total number of months for which the Plaintiff received income in the years 2007, 2008 and 2009), I get ($37,257.01 + $31,486.90 + $7,665)/24 =$3,183.70. This would represent the Plaintiff’s average base monthly income. To that, I have to also add a sum of money to account for CPF contributions which would have been made by the Plaintiff’s former employer if the Plaintiff had not been involved in the accident and had continued working in his previous job. The employer’s monthly contribution to the Plaintiff’s CPF account would have been at 16% of the Plaintiff’s average base monthly income, which works out to around$509.40. With that, the multiplicand is therefore $3,183.70 + $509.40 =$3,693.10.33     Having determined the multiplicand, the next issue is what would be the appropriate multiplier in the present case. The Defendant’s counsel has raised the argument that the multiplier should be limited to 30 months starting from the day of the accident (ie, no pre-trial loss of income should be awarded from August 2011 onwards), because the Plaintiff has failed to mitigate his pre-trial loss of income by seeking re-employment after his occupational therapist, Ms Christine Goh, had made recommendations to the Plaintiff on 27 July 2011 that he could consider re-training for sedentary jobs.34     The Defendant’s counsel also seeks to rely on the case ofWee Sia Tian v Long Thik Boon[1996] 2 SLR(R) 420 (“Wee Sia Tian”) to show that in the present case, just as in that case, the court should grant limited pre-trial loss of income for the reason that the Plaintiff has failed to attempt re-training or re-employment.35     I should firstly point out that in the evidence, although there is nothing to suggest that the Plaintiff has made any attempts at jobre-training, the Plaintiff however did on his evidence state that he attempted unsuccessfully to seek employment through a friend. Next, in my opinion, the circumstances inWee Sia Tianare different from those in the present case. There, the victim did not suffer any residual disability of such severity which is akin to the Plaintiff’s in the present case, namely an effective loss of use of a limb. There was therefore greater readiness on the part of the court in that case to believe that had the victim made genuine attempts, he would have been able to mitigate his pre-trial loss of income to a significant extent by securing gainful employment. Next, the court in that case also seemed to have placed significant emphasis in its decision on the fact that the victim was not given any further medical leave after November 1993, and hence presumably the medical opinion was that he was capable of working at some level at least (seeWee Sia Tianat [20]). Here, the situation is different because although the Plaintiff eventually ceased to receive medical leave certificates from his doctor, Dr Yong, since 25 May 2011, the same doctor has given evidence to explain that this was so only because in his medical opinion, the Plaintiff was “not expected to work, because it is a permanent disability”. Dr Yong also stated in his evidence that he had advised the Plaintiff that there was no point in giving any medical certificates from 25 May 2011 onwards as the Plaintiff was unable to return to work.[note: 10]No doubt later on 27 July 2011, Ms Christine Goh made an assessment as an occupational therapist that the Plaintiff “will be suitable for sedentary jobs (Occasional lifting of 10lbs. 0-33% of the day) with positional demands of mainly sitting and standing, and which requires the use of only one upper limb”, and that the Plaintiff “may consider going for job retraining to improve or learn new skills in other areas of expertise and industries that will suit his needs”, such as a being a car park attendant or a telephone operator.[note: 11]However, during cross-examination, Ms Goh conceded that whether the Plaintiff could actually secure a suitable sedentary job along the lines of her recommendation would depend on “whether such jobs are available and whether employers are able to do the modifications to accommodate him”.[note: 12]In my final analysis having regard to the evidence before me, I am not convinced that the Plaintiff should, as argued by the Defendant’s counsel, be deprived of his pre-trial loss of income from August 2011 onwards. I therefore hold that the proper multiplier to be adopted in the present case for pre-trial loss of income is47 months(ie, from March 2009 to January 2013).36     In the result, I assess the Plaintiff’s pre-trial loss of income to be at ($3,693.10 x 47) - 2% deduction for income tax = $173,575.70 - $3,471.51= $170,104.19. The 2% deduction for income tax is a figure submitted by the Plaintiff’s counsel[note: 13]and this percentage does not seem to have been disputed by the Defendant’s counsel.Loss of future earnings (“LFE”)37     On LFE, the Plaintiff’s counsel has candidly acknowledged that the Plaintiff should, despite his disability in his upper left limb, not expect to remain jobless for the rest of his life post-trial.[note: 14]Accordingly, the Plaintiff’s counsel accepts that some discount should be made on the multiplicand which is to be applied for computing LFE in the present case. In particular, the Plaintiff’s counsel made reference to the Plaintiff’s wife’s evidence given to this court to give some examples of what anable-bodiedperson is able to earn in a sedentary job. For instance, it was shown that the Plaintiff’s wife had earned around $870 per month as a telemarketer, and is currently earning $1,080 per month as a therapy assistant. Using,inter alia, these figures, the Plaintiff’s counsel suggests that a disabled person such as the Plaintiff could not realistically expect to earn the same amount in those employment positions, even assuming that he is able to secure any of these sedentary jobs with modifications made by the employers to accommodate his disability in his upper left limb in the first place. As such, the Plaintiff’s counsel submitted that a discount in the sum of $400 a month from the multiplicand which has been determined under the head of pre-trial loss of income would be fair for the purposes of calculating the LFE in the present case.38     The Defendant’s counsel disagrees and submits in the main that the claim for LFE should fail because the Plaintiff has done nothing so far to help himself regain employment. In the alternative, the Defendant’s counsel submits that even if LFE were to be awarded, a discount of $645.41 per month should be applied to the multiplicand instead, having regard to the statistics published by the Ministry of Manpower (“MOM”) on the median wage for car park attendants (one of the possible jobs which Ms Christine Goh has recommended that the Plaintiff may consider for employment: see [35] above).[note: 15]I am not persuaded by the Defendant’s counsel’s primary argument that the claim for LFE should fail entirely. The issue is therefore one of quantum rather than entitlement.39     In my view, I am of the view that a discount of$500per month on the multiplicand would be reasonable. I am not persuaded to adopt the figure of $645.41 submitted by the Defendant’s counsel because, in any case, the MOM statistics merely reports the average wages forable-bodiedpersons. Accordingly, I hold that the appropriate multiplicand to be adopted for calculating LFE in the present case is $3,693.10 - $500 =$3,193.10.40     As for the multiplier, the Plaintiff’s counsel has submitted a figure of 13 years to be fixed as the multiplier, while the Defendant’s counsel has submitted 6 years.41     The Plaintiff is currently around 48 years old and has a wife of around the same age. He has a son who by now should be in his second year in polytechnic and a younger daughter who is by now a secondary two student. Having considered the cases cited to me in the written submissions for both sides,[note: 16]the statutory retirement age, as well as the Plaintiff’s personal and family circumstances, I am of the view that a fair value for the multiplier in this case is10 years.42     In the result, I award the Plaintiff ($3,193.10 x 10 x 12) - 2% deduction for income tax =$375,508.56for LFE.Loss of earning capacity (“LEC”)43     Although in principle there is nothing which bars a plaintiff from being awarded damages for both LFE and LEC, there must be some “necessary evidence” to support such an outcome (seeChai Kang Wei Samuel v Shaw Linda Gillian[2010] 3 SLR 587). In the present case, I find no reason to grant any award of damages for LEC as I do not see any evidence put before me in support of this claim.Conclusion44     In summary, I make the following award of damages in favour of the Plaintiff:General damagesPain and suffering:Head injuries$45,000.00Left brachial plexus injury$53,000.00Lower limb injuries$21,000.00Right distal radius fracture$15,000.00Spinal injuries$29,000.00Comminuted fracture of left 1stand 2ndrib with pneumothorax$5,000.00Collapse of bilateral lower lobes of lungs$1,000.00Adrenal suppression$600.00Laceration and scars, etc$14,000.00Mild Sensory Loss over Right Ring Finger$800.00Comminuted Fracture of Right Inferior Pubic Ramus Bone (Pelvis)$1,500.00$185,900.00Loss of future earnings:$375,508.56Future medical care (agreed):$18,000.00Special damagesAgreed special damages (agreed):Medical expenses$18,119.98Loss of motorcycle$5,405.00Transport expenses$2,300.00Nursing care and/or loss of wife’s income$5,500.00$31,324.98Pre-trial loss of income:$170,104.19TotalGeneral + special damages:$780,837.73Less 5% on account of 95% liability to be attributed to the Defendant-$39,041.89Final award:$741,795.8445     Interest is to be applied at half of 5.33% on special damages from the date of service of the writ to the date of judgment, and at 5.33% on general damages for pain and suffering from the date of service of the writ to the date of judgment. The usual consequential orders are to apply.46     I will hear parties on the issue of costs.[note: 1]Plaintiff’s counsel’s written submissions (17 October 2012) at paras 53 and 99, and Defendant’s counsel’s written submissions (17 October 2012) at paras 53 and 55.[note: 2]Plaintiff’s counsel’s written submissions (17 October 2012) at para 64.[note: 3]Plaintiff’s counsel’s written submissions (17 October 2012) at para 77, and Defendant’s counsel’s written submissions (17 October 2012) at para 78.[note: 4]Plaintiff’s counsel’s written submissions (17 October 2012) at para 70, and Defendant’s counsel’s written submissions (17 October 2012) at paras 60, 65 and 66.[note: 5]Defendant’s counsel’s written submissions (17 October 2012) at para 61.[note: 6]See Plaintiff’s Bundle of Documents at p 51 and Defendant’s counsel’s written submissions (17 October 2012) at para 114.[note: 7]Plaintiff’s Bundle of Documents at p 57.[note: 8]Plaintiff’s counsel’s written submissions (17 October 2012) at paras 119-130.[note: 9]See Plaintiff’s counsel’s written submissions (17 October 2012) at paras 122, 124 and 128 and all supporting documents referred to therein.[note: 10]Plaintiff’s counsel’s written submissions (17 October 2012) at para 134.[note: 11]Plaintiff’s Bundle of Affidavits at p 83.[note: 12]Plaintiff’s counsel’s written submissions (17 October 2012) at para 144.[note: 13]Plaintiff’s counsel’s written submissions (17 October 2012) at paras 137 and 142.[note: 14]Plaintiff’s counsel’s written submissions (17 October 2012) at para 147.[note: 15]Defendant’s counsel’s written submissions (17 October 2012) at paras 147-150.[note: 16]Plaintiff’s counsel’s written submissions (17 October 2012) at paras 151-156 and Defendant’s counsel’s written submissions (17 October 2012) at para 141.",
        "Comminuted fracture of right inferior pubic ramus bone (pelvis) and mild sensory loss over right ring finger": "26     The Plaintiff also claims $12,000 for comminuted fracture of his right inferior pubic ramus bone (pelvis). This injury was recorded in one Dr Madeline Phuah’s medical report dated 19 February 2010 and Dr Yong’s report dated 19 March 2010. However, Dr Lee’s medical report dated 1 April 2012 indicated that the right inferior pubic ramus fracture “had been treated conservatively and consolidated with no residual permanent incapacity”. In the circumstances, I will award a modest sum of$1,500for this injury. 27     The Plaintiff also claims $5,000 for mild sensory loss over his right ring finger. This injury does not appear to have been disputed by the Defence. However, I am of the view that $5,000 is excessive, given that the evidence suggests that what the Plaintiff had actually sustained during the accident was just a laceration over the right ring finger (as found in Dr Yong’s report dated 19 March 2010, and Dr Yegappan’s report dated 6 December 2010). I will therefore award a sum of$800for the mild sensory loss over the Plaintiff’s right ring finger.",
        "Loss of amenities": "28     At paragraph 115 of the Plaintiff’s counsel’s written submissions, the Plaintiff’s claim for loss of amenities appears to have been factored into the figures which the Plaintiff had submitted for the respective injuries discussed above. No specific arguments were pursued by the Plaintiff’s counsel in respect of loss of amenities. Accordingly, I see no reason to make any finding on loss of amenities in the present case.",
        "Pre-trial loss of income": "29     I come now to the Plaintiff’s claim for pre-trial loss of income. There is no dispute that the Defendant is liable to pay the Plaintiff for this particular claim. However, the quantum of this claim is disputed. 30     Prior to the accident, the Plaintiff was working as a permanent night shift container driver/prime mover. He has since ceased work as a result of his disability caused by the accident. The Plaintiff’s counsel submits that the proper average monthly income should be calculated at $3,500, whereas the Defendant’s counsel argues that a multiplicand of $3,145.41 would be more accurate. The Defendant’s counsel reasoned that $3,145.41 is the accurate figure because that was the Plaintiff’s average monthly salary as stated in his former employer’s letter which was tendered in court.[note: 6]The Defendant’s counsel also sought to justify this amount by drawing attention to the Plaintiff’s income tax statements for the years 2007 and 2008. In fact, the Defendant’s counsel also submits that based on the income tax statements, the Plaintiff’s average monthly income could actually be found to be even lower at around $2,866. As I understand it, this lower sum was arrived at by adding the Plaintiff’s total assessable income for the years 2007 and 2008, before averaging it out over 24 months (ie, two years). 31     From the outset, I am unable to agree with the Defendant’s counsel’s calculation of the Plaintiff’s average monthly income. First and foremost, I find that the Defendant’s counsel’smethodof averaging out the total assessable income for the years 2007 and 2008 over24months to be erroneous because the documentary evidence (ie, the Plaintiff’s Central Provident Fund (“CPF”) statement for the period of January 2008 to December 2008)[note: 7]clearly indicated that there was zero contribution to the Plaintiff’s CPF account for the months of June and July 2008. What this means is that the Plaintiff did not have any income for those two months, for otherwise there should have been entries for CPF contributions recorded for those months in the Plaintiff’s CPF statement. 32     Instead, I find that the Plaintiff’s counsel’s mathematical basis andmethodof calculating the Plaintiff’s average monthly income[note: 8]would tend to more accurately compute the proper multiplicand to be adopted in the present case although, using the same method, the figure I arrived at is slightly higher than the sum of $3,500 which the Plaintiff submits. Here is how I arrived at the appropriate multiplicand. First, on review of the evidence, I accept that the Plaintiff’s yearly income for the years 2007, 2008 and 2009 are as follows: $37,257.01 (2007;12months of employment), $31,486.90 (2008;10months of employment) and $7,665 (2009;2months of employment before the accident took place on 27 February 2009).[note: 9]Averaging out the sum of these figures over 12 + 10 + 2 = 24 months (representing the total number of months for which the Plaintiff received income in the years 2007, 2008 and 2009), I get ($37,257.01 + $31,486.90 + $7,665)/24 =$3,183.70. This would represent the Plaintiff’s average base monthly income. To that, I have to also add a sum of money to account for CPF contributions which would have been made by the Plaintiff’s former employer if the Plaintiff had not been involved in the accident and had continued working in his previous job. The employer’s monthly contribution to the Plaintiff’s CPF account would have been at 16% of the Plaintiff’s average base monthly income, which works out to around$509.40. With that, the multiplicand is therefore $3,183.70 + $509.40 =$3,693.10. 33     Having determined the multiplicand, the next issue is what would be the appropriate multiplier in the present case. The Defendant’s counsel has raised the argument that the multiplier should be limited to 30 months starting from the day of the accident (ie, no pre-trial loss of income should be awarded from August 2011 onwards), because the Plaintiff has failed to mitigate his pre-trial loss of income by seeking re-employment after his occupational therapist, Ms Christine Goh, had made recommendations to the Plaintiff on 27 July 2011 that he could consider re-training for sedentary jobs. 34     The Defendant’s counsel also seeks to rely on the case ofWee Sia Tian v Long Thik Boon[1996] 2 SLR(R) 420 (“Wee Sia Tian”) to show that in the present case, just as in that case, the court should grant limited pre-trial loss of income for the reason that the Plaintiff has failed to attempt re-training or re-employment. 35     I should firstly point out that in the evidence, although there is nothing to suggest that the Plaintiff has made any attempts at jobre-training, the Plaintiff however did on his evidence state that he attempted unsuccessfully to seek employment through a friend. Next, in my opinion, the circumstances inWee Sia Tianare different from those in the present case. There, the victim did not suffer any residual disability of such severity which is akin to the Plaintiff’s in the present case, namely an effective loss of use of a limb. There was therefore greater readiness on the part of the court in that case to believe that had the victim made genuine attempts, he would have been able to mitigate his pre-trial loss of income to a significant extent by securing gainful employment. Next, the court in that case also seemed to have placed significant emphasis in its decision on the fact that the victim was not given any further medical leave after November 1993, and hence presumably the medical opinion was that he was capable of working at some level at least (seeWee Sia Tianat [20]). Here, the situation is different because although the Plaintiff eventually ceased to receive medical leave certificates from his doctor, Dr Yong, since 25 May 2011, the same doctor has given evidence to explain that this was so only because in his medical opinion, the Plaintiff was “not expected to work, because it is a permanent disability”. Dr Yong also stated in his evidence that he had advised the Plaintiff that there was no point in giving any medical certificates from 25 May 2011 onwards as the Plaintiff was unable to return to work.[note: 10]No doubt later on 27 July 2011, Ms Christine Goh made an assessment as an occupational therapist that the Plaintiff “will be suitable for sedentary jobs (Occasional lifting of 10lbs. 0-33% of the day) with positional demands of mainly sitting and standing, and which requires the use of only one upper limb”, and that the Plaintiff “may consider going for job retraining to improve or learn new skills in other areas of expertise and industries that will suit his needs”, such as a being a car park attendant or a telephone operator.[note: 11]However, during cross-examination, Ms Goh conceded that whether the Plaintiff could actually secure a suitable sedentary job along the lines of her recommendation would depend on “whether such jobs are available and whether employers are able to do the modifications to accommodate him”.[note: 12]In my final analysis having regard to the evidence before me, I am not convinced that the Plaintiff should, as argued by the Defendant’s counsel, be deprived of his pre-trial loss of income from August 2011 onwards. I therefore hold that the proper multiplier to be adopted in the present case for pre-trial loss of income is47 months(ie, from March 2009 to January 2013). 36     In the result, I assess the Plaintiff’s pre-trial loss of income to be at ($3,693.10 x 47) - 2% deduction for income tax = $173,575.70 - $3,471.51= $170,104.19. The 2% deduction for income tax is a figure submitted by the Plaintiff’s counsel[note: 13]and this percentage does not seem to have been disputed by the Defendant’s counsel.",
        "Loss of future earnings (“LFE”)": "37     On LFE, the Plaintiff’s counsel has candidly acknowledged that the Plaintiff should, despite his disability in his upper left limb, not expect to remain jobless for the rest of his life post-trial.[note: 14]Accordingly, the Plaintiff’s counsel accepts that some discount should be made on the multiplicand which is to be applied for computing LFE in the present case. In particular, the Plaintiff’s counsel made reference to the Plaintiff’s wife’s evidence given to this court to give some examples of what anable-bodiedperson is able to earn in a sedentary job. For instance, it was shown that the Plaintiff’s wife had earned around $870 per month as a telemarketer, and is currently earning $1,080 per month as a therapy assistant. Using,inter alia, these figures, the Plaintiff’s counsel suggests that a disabled person such as the Plaintiff could not realistically expect to earn the same amount in those employment positions, even assuming that he is able to secure any of these sedentary jobs with modifications made by the employers to accommodate his disability in his upper left limb in the first place. As such, the Plaintiff’s counsel submitted that a discount in the sum of $400 a month from the multiplicand which has been determined under the head of pre-trial loss of income would be fair for the purposes of calculating the LFE in the present case. 38     The Defendant’s counsel disagrees and submits in the main that the claim for LFE should fail because the Plaintiff has done nothing so far to help himself regain employment. In the alternative, the Defendant’s counsel submits that even if LFE were to be awarded, a discount of $645.41 per month should be applied to the multiplicand instead, having regard to the statistics published by the Ministry of Manpower (“MOM”) on the median wage for car park attendants (one of the possible jobs which Ms Christine Goh has recommended that the Plaintiff may consider for employment: see [35] above).[note: 15]I am not persuaded by the Defendant’s counsel’s primary argument that the claim for LFE should fail entirely. The issue is therefore one of quantum rather than entitlement. 39     In my view, I am of the view that a discount of$500per month on the multiplicand would be reasonable. I am not persuaded to adopt the figure of $645.41 submitted by the Defendant’s counsel because, in any case, the MOM statistics merely reports the average wages forable-bodiedpersons. Accordingly, I hold that the appropriate multiplicand to be adopted for calculating LFE in the present case is $3,693.10 - $500 =$3,193.10. 40     As for the multiplier, the Plaintiff’s counsel has submitted a figure of 13 years to be fixed as the multiplier, while the Defendant’s counsel has submitted 6 years. 41     The Plaintiff is currently around 48 years old and has a wife of around the same age. He has a son who by now should be in his second year in polytechnic and a younger daughter who is by now a secondary two student. Having considered the cases cited to me in the written submissions for both sides,[note: 16]the statutory retirement age, as well as the Plaintiff’s personal and family circumstances, I am of the view that a fair value for the multiplier in this case is10 years. 42     In the result, I award the Plaintiff ($3,193.10 x 10 x 12) - 2% deduction for income tax =$375,508.56for LFE.",
        "Loss of earning capacity (“LEC”)": "43     Although in principle there is nothing which bars a plaintiff from being awarded damages for both LFE and LEC, there must be some “necessary evidence” to support such an outcome (seeChai Kang Wei Samuel v Shaw Linda Gillian[2010] 3 SLR 587). In the present case, I find no reason to grant any award of damages for LEC as I do not see any evidence put before me in support of this claim.",
        "Conclusion": "44     In summary, I make the following award of damages in favour of the Plaintiff: General damages Pain and suffering:Head injuries$45,000.00Left brachial plexus injury$53,000.00Lower limb injuries$21,000.00Right distal radius fracture$15,000.00Spinal injuries$29,000.00Comminuted fracture of left 1stand 2ndrib with pneumothorax$5,000.00Collapse of bilateral lower lobes of lungs$1,000.00Adrenal suppression$600.00Laceration and scars, etc$14,000.00Mild Sensory Loss over Right Ring Finger$800.00Comminuted Fracture of Right Inferior Pubic Ramus Bone (Pelvis)$1,500.00$185,900.00Loss of future earnings:$375,508.56Future medical care (agreed):$18,000.00   Special damages Agreed special damages (agreed):Medical expenses$18,119.98Loss of motorcycle$5,405.00Transport expenses$2,300.00Nursing care and/or loss of wife’s income$5,500.00$31,324.98Pre-trial loss of income:$170,104.19   Total General + special damages:$780,837.73Less 5% on account of 95% liability to be attributed to the Defendant-$39,041.89Final award:$741,795.84   45     Interest is to be applied at half of 5.33% on special damages from the date of service of the writ to the date of judgment, and at 5.33% on general damages for pain and suffering from the date of service of the writ to the date of judgment. The usual consequential orders are to apply. 46     I will hear parties on the issue of costs.  [note: 1]Plaintiff’s counsel’s written submissions (17 October 2012) at paras 53 and 99, and Defendant’s counsel’s written submissions (17 October 2012) at paras 53 and 55. [note: 2]Plaintiff’s counsel’s written submissions (17 October 2012) at para 64. [note: 3]Plaintiff’s counsel’s written submissions (17 October 2012) at para 77, and Defendant’s counsel’s written submissions (17 October 2012) at para 78. [note: 4]Plaintiff’s counsel’s written submissions (17 October 2012) at para 70, and Defendant’s counsel’s written submissions (17 October 2012) at paras 60, 65 and 66. [note: 5]Defendant’s counsel’s written submissions (17 October 2012) at para 61. [note: 6]See Plaintiff’s Bundle of Documents at p 51 and Defendant’s counsel’s written submissions (17 October 2012) at para 114. [note: 7]Plaintiff’s Bundle of Documents at p 57. [note: 8]Plaintiff’s counsel’s written submissions (17 October 2012) at paras 119-130. [note: 9]See Plaintiff’s counsel’s written submissions (17 October 2012) at paras 122, 124 and 128 and all supporting documents referred to therein. [note: 10]Plaintiff’s counsel’s written submissions (17 October 2012) at para 134. [note: 11]Plaintiff’s Bundle of Affidavits at p 83. [note: 12]Plaintiff’s counsel’s written submissions (17 October 2012) at para 144. [note: 13]Plaintiff’s counsel’s written submissions (17 October 2012) at paras 137 and 142. [note: 14]Plaintiff’s counsel’s written submissions (17 October 2012) at para 147. [note: 15]Defendant’s counsel’s written submissions (17 October 2012) at paras 147-150. [note: 16]Plaintiff’s counsel’s written submissions (17 October 2012) at paras 151-156 and Defendant’s counsel’s written submissions (17 October 2012) at para 141."
    }
}