{
    "case_title": "Fong Khim Ling (administrator of the estate of Fong Ching Pau Lloyd, deceased)\n      v\n      Tan Teck Ann",
    "ncitation": "[2013] SGHC 104",
    "coram": "Judith Prakash J",
    "sections": {
        "Loss of dependency": "9       I deal first with the appeal on the dependency claim. It is settled law that parents may claim damages for loss of dependency from the death of their child even “where there was rarely any actual dependency, so long as there was some basis of fact from which the inference could be drawn that there was a reasonable expectation of pecuniary benefits to the parent, and therefore of prospective loss from the death”:Ng Siew Choo v Tan Kian Choon[1990] 1 SLR(R) 235 (“Ng Siew Choo”) at [15]. InHanson Ingrid Christina v Tan Puey Tze[2008] 1 SLR(R) 409, I said at [26] that: The final aim of any court in calculating loss of dependency is to make a direct assessment of the value of the reasonable expectation of pecuniary benefit:Gul Chandiram Mahtani v Chain Singh[1999] 1 SLR(R) 154. This may be done in two ways: (a) the court may simply add together the value of the benefits received by the dependents from the deceased (“traditional method”); or (b) the court may deduct a percentage from the deceased’s net salary consisting of his or her exclusively personal expenditure (“percentage deduction method”). 10     Where the child has yet to enter the workforce the traditional method is inapplicable so the percentage deduction method should be used. This exercise is necessarily speculative. However the court should not be too cautious but must do its best with the evidence available. InMan Mohan Singh v Zurich Insurance (Singapore) Pte Ltd (now known as QBE Insurance (Singapore) Pte Ltd) and another and another appeal[2008] 3 SLR(R) 735 (“Man Mohan Singh (CA)”) the Court of Appeal noted at [17] that: When young persons meet with untimely deaths in accidents, any assessment of loss of dependency entails, by its very nature, a measure of estimation. However, this is not a valid reason for applying, in all cases, conservative estimates that would invariably put the defendants in a more advantageous position than the grief-stricken loved ones and future dependants of the victims. 11     What the court should not do is to have unthinking regard to benchmarks or guidelines supposedly established by the precedents. Each case turns on its own facts. Indeed, the Court of Appeal inMan Mohan Singh (CA)cautioned at [30] that: We should emphasise that the very unfortunate events that gave rise to the present appeals presented a factual matrix that is uncommon (arguably, even unique). As a result, the considerations which we have taken into account in deciding on the appropriate sums to award the appellants for loss of dependency – including the appellants’ sudden loss of both of their sons in the same accident and the concomitant loss of all prospects of financial support from either of their two children, as well as the highly unlikely prospect of the appellants having another child in the future – are specific to these appeals, and the sums which we have ultimately decided on cannot be regarded as setting new benchmarks for future cases.Indeed, it is clear that, in this particular area of the law, no one decision can, in any event, be generally regarded as setting firm guidelines or benchmarks as every case turns on its facts. (emphasis added) 12     I agreed with this approach and adopted it in the following analysis.",
        "Multiplicand": "Prospective earnings 13     The appellant said that there was sufficient evidence for me to infer that the deceased would have become a manager or at the very least earned an income equivalent to that of a manager. The deceased, who was 21 years old when he died, had distinguished himself in his diploma studies and during National Service as a medic. At Ngee Ann Polytechnic he had won a prize for outstanding performance in the subject of retail management. He had done well enough to obtain a place in Singapore Management University to read business management. He had even been shortlisted for a scholarship offered by the university but had passed away before the first interview. The appellant admitted that there was no concrete evidence of the precise career path of the deceased but given his degree course it was reasonable to assume that he would have become a manager or taken on some other job with an equivalent salary. 14     The appellant said that the correct basis for assessing his prospective earnings for the purpose of deriving a multiplicand was therefore the statistics for managers’ salaries listed in the MOMRW instead of the GES which listed only starting salaries and made no provision for future increments. The appellant relied on the MOMRW for 2009 instead of that for 2010 which the Deputy Registrar had used but nothing turned on this. According to this, the deceased would have enjoyed a prospective average salary of $6,058 as being the average monthly salary of managers from age 25 to age 54. The appellant argued that in so far as the District Judge had failed to provide for future increases in salary, he had fallen into error. 15     The respondent said that the mere fact that the deceased had been admitted to read business management did not show that he would have become a manager upon graduation. It was common for students to change their course of study and even to embark on a career completely unrelated to their degree. Even if the deceased had graduated with a degree in business management, there was some chance he would have started his own business and so not earned a steady wage. In the circumstances, therefore, it was too speculative to use the MOMRW data on managers as a basis for assessing the deceased’s prospective salary. 16     As a matter of interpretation, I did not think that inMan Mohan Singh (CA)the Court of Appeal laid down a rule that the MOMRW should invariably be used in assessing claims for loss of dependency. In that case, both parties had accepted the MOMRW for 2005 as the basis for computing the decedents’ projected earnings (seeMan Mohan Singh (CA)at [9]). I also noted that the Court of Appeal cautioned against viewing the case as setting benchmarks for new cases and that every case turns on its own facts (see [11] above). 17     In this case, the parties did not deny that the deceased would likely have graduated with a degree in business management. According to the GES used by the District Judge, $3,200 was a reasonable starting pay for graduates from this degree programme. I noted that according to the MOMRW for 2011, the latest available, the median monthly gross starting salary of a business management graduate from Singapore Management University was also $3,200. No doubt some allowance should be made for future increases in salary. However, I agreed with the respondent that it was too speculative to use the MOMRW statistics for managers. These statistics were over-inclusive. They averaged wage data across some 30 occupations, including company director, engineering manager, general manager, legal service manager, managing director and even restaurant manager. With the exception of the last, these were all high paying jobs (generally over $7,000 a month) requiring either specialist skills (for engineering and legal services managers) or substantial management aptitude and they would have skewed the average wage. 18     There was no evidence before me that the deceased would have attained any of these jobs or a managerial job at all. He had obtained a diploma in business studies which seems similar in nature to business management and he had won a prize for outstanding performance in his retail management studies. There were testimonies to his ability from his lecturers at the Polytechnic and from his superior officer in his National Service unit. In my considered view, none of this evidence suggested that he would have become a manager or indeed that he had wanted to become one. 19     As a general point, there is no necessary correlation between having a business management degree and becoming a manager. One rises to become a manager through the development and display of managerial acumen and these have little to do with one’s degree. It is probably for this reason that the MOMRW does not give salaries for business graduates 10 or 15 years after graduation. This information would not be very useful because such graduates can and do enter many occupations with a corresponding diversity in salaries. A business degree, unlike a qualification in engineering or medicine or in some other professional course, is a relatively general degree that enables one to enter into many different occupations with ease. 20     This is unlikeMan Mohan Singh (CA)where it was reasonable to expect that, accepting that the two decedents would have graduated from the Institute of Technical Education and Polytechnic, they would have taken on employment respectively in the clerical, production craftsman or plant/machine operator and assembly work category and as a technician or associate professional. InHo Yeow Kim v Lai Hai Kuen[1999] 1 SLR(R) 1068 (“Ho Yeow Kim”) the deceased was a 17-year-old student who had been studying at an Institute of Technical Education for three months before he was killed in a car accident. It was reasonable to expect that even though the deceased had just begun a course in mechatronics he would likely have graduated and earned a salary as a mechatronics engineer. 21     A better comparison is, therefore, the case ofTan Ngo Hwa v Siew Mun Phui[1998] SGHC 376 (“Tan Ngo Hwa”). Lai Siu Chiu J held that there was not enough evidence to show that the deceased, who was just 16 when she died and had not yet taken her ‘O’ level examinations, would have obtained a degree in hotel management. However, Lai J accepted that she would have obtained a Bachelor of Arts degree from an overseas university with a starting salary of $2,000. This figure was obtained from the median starting gross salary for local university graduates holding Bachelor of Arts degrees as stated in the Report on Wages in Singapore 1997. It was accepted that her salary would have risen progressively to $4,000 to $5,000 and that it was not unreasonable for her to have given her parents $400 to $500 initially which would have risen to $1,000:Tan Ngo Hwaat [26]. 22     Notwithstanding my view expressed above that a court should not be too cautious in the assessment exercise, on the facts there was simply not enough evidence to justify the appellant’s contention that the deceased would have become a manager and that therefore the MOMRW data on managers should be used. It follows that I would have even less basis to make a determination that, as the appellant contended, the deceased would have earned a salaryequivalentto that of a manager and I accordingly declined to take that course. 23     However this does not mean that no provision should be made for a future increase in salary where it is reasonable to do so. Where the deceased’s likely occupation cannot be readily ascertained the court should make a determination based on the range of possible occupations. It should not be too sceptical but at the same time it cannot be overly optimistic about the deceased’s prospects. In my judgment it was reasonable to expect that the deceased as a business management graduate would probably have earned a future gross median wage of about $5,500, which, when averaged with the starting salary of $3,200, worked out to prospective earnings of $4,350. This fell comfortably within the MOMRW salary ranges for occupations which a business management graduate may reasonably be expected to have entered. Indeed, on one view this was generous. Given that the deceased had been on course to read business management and the fact that he had won a prize in retail management during his Diploma course, it is not unreasonable to presume that he may have become a retail or sales manager in the retail industry. According to the MOMRW for 2011, the median gross wage for a retail/shop sales manager in the wholesale and retail trade was a substantially lower figure of $3,284. Apportionment of earnings 24     In relation to how much the deceased would have given his parents had he lived, the appellant claimed a rate of 40% of prospective earnings on the ground that this was consistent with the decided cases. This figure, he argued, should be split unequally with 60% of the sum going to the mother and 40% to the father. 25     The first case cited to me in support of this proposition wasHo Yeow Kimwhere the Court of Appeal accepted that the deceased would have given 40% of his salary to his parents after taking into account the likelihood of his getting married and the contribution to his family being consequently reduced. 26     The second case wasTan Harry v Teo Chee Yeow Aloysius[2004] 1 SLR(R) 513 (“Tan Harry”). In this case, the plaintiffs were the parents of the deceased who had died following an anaesthetic procedure administered by the first defendant. The deceased had been employed as a tax manager. Woo Bih Li J declined to disturb the Assistant Registrar’s determination that the deceased would have given 40% of his salary to his parents. 27     The final case wasLi Zhongyuan v Novena Hall Pte Ltd[2009] SGDC 133. The deceased was a student from China in Singapore to prepare to sit for his ‘O’ level examinations. He fell to his death from an open window on the third level of the hostel where he was residing. The defendant, which was the occupier of the hostel, was assessed as 50% liable. District Judge Laura Lau said at [62] that: In the circumstances, the Plaintiffs have not put forth any cogent reasons and I am not persuaded to depart from the usual apportionment of 40% of the mean monthly income to the Plaintiffs, following the Court of Appeal’s decision inHo Yeow Kimand a more recent High Court decision,Tan Harry v Teo Chee Yeow Aloysius[2004] 1 SLR 513.  InMan Mohan Singh, the Court of Appeal was inclined to follow the apportionment rate of 40% inHo Yeow Kim, but decided eventually that an apportionment rate of 35% was more appropriate in view of the likelihood that the deceased sons would have married and established their own families by their early to mid-twenties, in accordance with their mother’s stated wish for them. 28     With respect, I did not agree that the cases cited support the proposition that 40% is the “usual apportionment” that should be used as the baseline regardless of the factual matrix. I have said above at [9]-[11] that the test facing the court is to assess the value of the reasonable expectation of pecuniary benefit on the part of the deceased’s dependents and that each case will turn on its own facts. In my view the Court of Appeal inMan Mohan Singh (CA)did not intend to lay down a general benchmark of 40%. At [17] of that case, the Court said that: [I]t is both logical and fair to assume, based on an extrapolation from the last available academic results of Gurjiv and Pardip, that they would have completed their studies at the appropriate level had they lived; in this respect, they should not be treated any differently from the deceased son inHo Yeow Kim. 29     Because the factual matrices in both cases were similar there was some justification for the court to assess the apportionment of salary with reference to the same benchmarks. By contrast, inTan Ngo Hwa, the deceased’s contributions to her parents were estimated as ranging between $900 and $1,000 of her prospective salary which was assessed in the range of $4,000 to $5,000, an apportionment rate of about 20% to 25%.Ho Yeow Kimdiscussed the case ofTan Ngo Hwaand had no criticism of the reasoning there. InTan Harrythe deceased had been working for some time and there was considerable evidence as to how much he was actually contributing to his dependents. In that case therefore apportionment proceeded using the traditional method to which I alluded at [9] above and could be distinguished on this basis. 30     In the present case, I noted that there was evidence that the deceased’s father earned $4,000 to $5,000 a year, or about $400 a month, providing services to temples. The mother earned $1,000 a month as a clerk. They had two other children, both older than the deceased. The eldest child, Clifford Fong, earned $4,080 a month as a marine engineer but had a wife and three children. He gave evidence that although his wife also worked they could barely support the expenses of their own family and said that as a result he contributed less than $200 a month to his parents. The second child, Elita Fong, testified that she was currently unemployed and was not in good health. Although her husband earned $3,500 a month he had to support his own family and was unable to contribute anything. Both claimed that they were not very close to their parents. 31     In my viewMan Mohan Singh (CA)differed from the present case in that there the parents had no other children while in the present case the deceased had two siblings who should be expected to take up some of the burden of caring for their parents. Under s 5 of the Maintenance of Parents Act (Cap 167B, 1996 Rev Ed), the parents have a legal right to claim maintenance from their children subject to an assessment of their needs and their children’s earning capacity and expenses. In any case, at the very least, the siblings have a moral duty to contribute whatever they can to their parents. 32     I accepted that the deceased would have been the main contributor to the support of his aged parents. However, I did not accept that he would have apportioned as much as 40% of his gross salary. While he was alive he did not regularly make financial contributions to the family even though their mortgage was in arrears. Although he had some income from part-time jobs done during his school holidays and also his allowance from National Service he preferred to save much of the money for personal expenditure such as a computer and a motorcycle. Furthermore, there was evidence that he would likely have married and so reduced the amount he contributed to his parents. This principle is well established: seeNg Siew Choo v Tan Kian Choon[1990] 1 SLR(R) 235 at [22] andMan Mohan Singh (CA)at [18]. 33     I have said that the deceased’s prospective earnings were likely to be in the region of $4,350. In these circumstances, it was not unreasonable to expect that, after accounting for personal savings, expenditures, CPF, the likelihood of marriage and the fact that the parents still have two other children, the deceased would have given about 25% of his assessed prospective earnings, or about $1,100 a month rounded up, to his parents. This would have almost doubled their available income while both parents were still working and almost replaced it once they had retired. 34     The appellant urged me to make allowance for the deceased’s promise to take over the mortgage of his parents’ flat in Woodlands once he started working. I did not do so because there was evidence that the parents would in return have transferred the flat to the deceased. 35     As to the unequal split in the multiplicand, counsel for the appellant could say only that this was fair because he felt more for the mother’s plight. In my view this was not a relevant consideration and, accordingly, I declined to disturb the equal split set by the District Judge. Multiplier 36Man Mohan Singh (CA)is the main authority on multipliers in damages assessment and the following principles emerge at [22]-[30]: (a)     Where there is more than one dependent, a separate multiplier should be adopted for each dependent. (b)     Life expectancy is relevant and should be determined as at the time of the deceased’s passing. (c)     Also relevant is the dependent’s working history, age of retirement and prospect of other forms of support. (d)     Discounts should be given for the vicissitudes of life and for payment upfront. (e)     The multiplier may be split into periods each with a different multiplicand to take into account changing circumstances. (f)     The usual range is from eight to 12 years. 37     The appellant claimed a multiplier of 11 years for the father and 13 years for the mother. The father was 57 years old when the deceased met with the accident and would have been 62 at the time the deceased would have graduated. The District Judge allowed for a life expectancy of 77 years for a multiplier of 15 years, with 33% discount for acceleration, for a multiplier of 10.05 years. I did not hear any argument that the District Judge erred with reference to the principles laid down inMan Mohan Singh (CA)and accordingly found no reason to disturb his determination. 38     As for the mother, the District Judge found a multiplier of 25 years as follows. The mother was 51 years old at the time of the accident and would be 56 at the time the deceased would have graduated. She would probably have continued working for a further period of six years, until she turned 62, the notional retirement age. She would then have required support from that age to her assessed life expectancy of 81 years, a period of 19 years. Accordingly, the District Judge awarded $200 for the first period of six years and $544 for the subsequent 19 years, and the whole was discounted 33% for accelerated payment. This was equivalent to a multiplier of 14.2 years at $544 a month. The appellant sought a multiplier of 13 years and as this was less than that awarded below, I saw no reason to vary the award.",
        "Costs of assessment hearing": "39     The appellant’s sole argument is that the costs given by the Deputy Registrar of $25,000 plus disbursements were manifestly too low with reference to two cases of assessment of damages in which counsel for the appellant had acted for a party. Counsel for the appellant did not discuss either case in any detail and neither is reported. Therefore it was impossible to tell whether the comparison was apt. In any case there was no principled criticism of the Deputy Registrar’s order. I therefore dismissed the appeal on the costs order.",
        "Conclusion": "40     I have said that the deceased would probably have earned $4,350 over the course of his working life and apportioned about 25% of that sum to his parents in equal shares, for a combined multiplicand of $1,100, rounded up. This differed minimally from the $1,088 assessed by the District Judge and as I left the multipliers unchanged there was therefore no reason to disturb the decision below. In the circumstances, I dismissed the appeal even though I accepted that the District Judge had erred in principle in not allowing for future increases in the deceased’s salary to be factored into the multiplicand. I awarded costs of the appeal to the respondent fixed at $2,500 all in."
    }
}