{
    "case_title": "UDL Marine (Singapore) Pte Ltd\n      v\n      Jurong Town Corporation and other suits",
    "ncitation": "[2013] SGHC 236",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "Introduction": "1       The trial before me involved three suits which were consolidated pursuant to an order of court dated 9 February 2012. 2       UDL Marine (Singapore) Pte Ltd (“UDL”) is the plaintiff in Suit No 502 of 2010 (“S502”) and Suit No 156 of 2011 (“S156”), and the defendant in Suit No 98 of 2011 (“S98”). UDL is a wholly owned subsidiary of UDL Holding Limited, a company incorporated in Hong Kong. UDL was known as Denlane Shipbuilding Pte Ltd (“Denlane”) before it was renamed UDL Marine (Singapore) Pte Ltd on 28 December 2007. UDL’s primary business is in the building of ships, tankers and other ocean-going vessels. 3       Jurong Town Corporation (“JTC”) is the defendant in S502 and the plaintiff in S98. JTC is a statutory body established under the Jurong Town Corporation Act (Cap 150, 1998 Rev Ed). 4       Economic Development Board of Singapore (“EDB”) is the defendant in S156. EDB is a statutory body established under the Economic Development Board Act (Cap 85, 2012 Rev Ed).",
        "Background": "5       By way of a lease agreement dated 6 March 1981 (“the Lease”), the land at 3 Benoi Road, Singapore 629877 (“the Premises”) was leased to a company known as UDL Shipbuilding (S) Pte Ltd (“UDL Shipbuilding”).[note: 1]Sometime in 1996, UDL Shipbuilding went into receivership.[note: 2]At the end of 1998, UDL (then known as Denlane), which was an associate company of UDL Shipbuilding, secured an agreement with the mortgagee, Oversea-Chinese Banking Corporation, to purchase the interest under the mortgage and take over the Lease (subject to JTC’s approval).[note: 3]On 12 July 1999, JTC gave its in-principle approval to the proposed transfer, subject to certain conditions including undertaking liability for unpaid and outstanding rent in respect of the Premises.[note: 4]Formal approval was granted by JTC on 20 October 1999.[note: 5] 6       The Lease was to expire on 1 January 2002 and UDL applied for it to be renewed. By way of a letter dated 9 December 2002, JTC made an offer to UDL to renew the Lease for a further term of nine years from 1 January 2002[note: 6].  On 8 September 2003, UDL wrote to JTC, confirming acceptance of the terms and conditions of the offer letter of 9 December 2002.[note: 7]On 9 December 2003, JTC wrote to inform UDL that the renewal of the Lease had been approved.[note: 8]The lease was to run for nine years, from 1 January 2002 to 31 December 2010. 7       Leung Yat Tung (“Leung”), managing director of UDL, gave evidence that around 2004, he gathered from “market talk”[note: 9]that JTC had plans to redevelop waterfront sites in the area where the Premises was situated. He understood that existing tenants, including UDL, would not have their leases renewed upon expiry. Therefore, UDL decided to sell the remainder of the Lease and found a potential purchaser in Kim Hock Corporation (“Kim Hock”). A conditional sale and purchase agreement for the Lease was entered into with Kim Hock on 14 January 2005 at the price of $3,200,000. The agreement was made subject to the requisite approval from JTC for the transfer of the balance of the Lease. On 18 January 2005, UDL’s solicitors wrote to JTC requesting JTC’s approval.[note: 10]However on 18 March 2005, UDL wrote to JTC advising that the sale and purchase agreement between UDL and Kim Hock had been rescinded. The events leading to this rescission form the core of the dispute in this case.",
        "The disputed facts": "",
        "UDL’s evidence": "8       Sometime in late February 2005, a few weeks after the conditional sale and purchase agreement with Kim Hock was signed, Leung was informed that an EDB officer was trying to contact him and had requested a return call. Accordingly, he called and made contact with Sidat Senanayake (“Sidat”), a Senior Officer of the EDB, handling Oil and Gas and Alternative Energy matters. 9       In his several affidavits, Leung’s versions of events varied somewhat. Although it may be expected that he would flesh out the details of the conversation between him and Sidat, there were conflicts in terms of what had transpired. The statement of claim (“SOC”) in S502 and S156 asserted that Sidat had told Leung during their very first phone conversation in late February 2005 that EDB had learnt from JTC of UDL’s decision to dispose of the remainder of the Lease. Sidat asked for the reason. Leung replied that UDL’s decision was based on its understanding that the waterfront area was to be redeveloped and that the Lease would not be extended beyond 31 December 2010. Leung claimed that Sidat then made the following  representations (as set out in para 8 of the SOC in S502): … as a yet to be published policy, [JTC] had decided to postpone the redevelopment of the area and would grant extensions of 20 years for the yards in the area including the Premises. Given this new development, [Sidat] requested that [UDL] reconsider the Potential Sale and to maintain their business in Singapore I shall refer to these representations as the “Alleged Representations”. 10     Leung then asked Sidat for clear confirmation that the Lease for the Premises would be available for an extension of 20 years. Both SOCs in S502 and S156 continued the narrative with a description of the first meeting with Sidat in early March 2005 during which Sidat repeated the Alleged Representations and assured Leung that he had checked and confirmed this matter with JTC. Sidat further stated that EDB would render the necessary assistance to procure the extension of the Lease and that UDL should therefore withdraw from the sale to Kim Hock. 11     This version was reaffirmed in Leung’s affidavit in S502 filed on 16 September 2010 (“the 16 September 2010 Affidavit”) in support of an interim injunction. In that affidavit, Leung repeated the position in the SOC that Sidat had represented to him that JTC had postponed redevelopment plans and were prepared to grant extensions to leases in the area. Leung fleshed out the conversation between them in the following manner at para 7.7: I told [Sidat] that [UDL] needed certainty and asked him to reconfirm the correctness of the [Alleged Representations]. He told me that what he had told me was correct but he would nevertheless reconfirm the position with [JTC] and then speak to [UDL] again. I told him that [UDL] would await the outcome of his discussions with [JTC]. I was quite happy when I heard this and felt re-assured as the EDB is a reputable Statutory Authority and who, from [UDL’s] previous extension application process experience from 2000 to 2002, worked very closely with [JTC]. 12     Leung went on to state that Sidat called him again sometime in March 2005 to state that he had checked with JTC and repeated the representations about the postponement of redevelopment and possibility of a 20-year lease extension. He said that on 13 April 2005 he met with Sidat (in the 16 September 2010 Affidavit, this would be the first meeting with Sidat). He told Sidat that following his assurances about the renewal of the Lease, UDL had called off the sale to Kim Hock. He asked Sidat whether the Lease could be renewed immediately, given that there were another five and a half years left. Sidat responded that JTC was aware of this and he did not foresee any difficulty for a renewal. Leung then asked Sidat to confirm this in writing. This confirmation came, after several reminders, by way of an email[note: 11]from Sidat dated 26 May 2005 which states as follows: Dear Mr Leung, my apologies for not responding sooner. We have discussed the matter with JTC, who is agreeable to consider such a conditional extension for UDL. This is subject to EDB’s support and we would therefore look forward to receiving a proposal from UDL on your proposed plans for the site. Jen Siang has returned from his overseas travels, so you can follow-up on this directly with him. thank you & best regards sidat “Jen Siang” refers to Kong Jen-Siang (“Kong”), an EDB officer in the logistics and transport cluster handling maritime and land transport matters, who was Sidat’s colleague in EDB.  Sidat was no longer involved in the matter after this email. 13     The main differences between the version in Leung’s 16 September 2010 Affidavit and the SOCs are that there were two phone conversations between Leung and Sidat (as opposed to one in the SOC) and they met for the first time on 13 April 2005 (as opposed to March 2005). 14     Leung filed another affidavit on 2 November 2010 (“the 2 November 2010 Affidavit”) in originating summons no 1133 of 2010 in an application under O 53 r 5 of the Rules of Court (Cap 322, R5, 2006 Rev Ed) for an order to quash the decision of JTC to refuse extension of the Lease. This affidavit repeated the version in his 16 September 2010 Affidavit. 15     Leung filed a further affidavit in this consolidated suit, dated 11 June 2012 (“11 June 2012 Affidavit”). This essentially repeated the version in the two earlier affidavits except that Leung added that, after the second phone conversation in March 2005, he “continued to correspond via email” with Sidat. 16     In his affidavit evidence-in-chief (“AEIC”), a different version emerged in relation to the sequence of events. Leung deposed that in the first phone call, Sidat had only stated that EDB had learnt of the sale to Kim Hock and wanted to meet to discuss this issue. Sidat did not make the Alleged Representations during that conversation. Leung agreed to meet and Sidat, along with a colleague, turned up at UDL’s office at the Premises sometime in late February or early March 2005. It was at this meeting that Sidat had made the Alleged Representations on postponement of redevelopment and the possibility of lease extension. Sidat asked for the reason for the sale to Kim Hock. Leung was surprised that EDB had learnt of this as well as their unsolicited involvement. He asked Sidat the reason for the intervention by EDB. Sidat explained that EDB wanted to know if the sale was due to a decision by UDL to withdraw from Singapore or for some other reason. This was because it was EDB’s role to promote and assist foreign investment in Singapore. Leung explained that the decision was based on his understanding that the Premises was located in an area which was slated for redevelopment and that the lease would not be renewed upon expiry. UDL found it commercially necessary to sell the remainder of the Lease and review other investment opportunities. Leung told Sidat that UDL was considering all options, including pulling out of Singapore. Leung said that Sidat then informed him that JTC had actually decided to postpone the proposed redevelopment in the area for 20 years and would be able to grant extensions of up to 20 years. Sidat asked Leung whether, given this development, UDL would reconsider the sale to Kim Hock. As this was contrary to the impression that Leung had, he asked Sidat to check and confirm this. Sidat reiterated what he had said and was adamant that it was correct. However he agreed to check with JTC and revert. 17     Sometime in early March 2005, Sidat called Leung to arrange another meeting, which was held on 17 March 2005. At this second meeting, Sidat told Leung that he had checked and obtained confirmation from JTC that the redevelopment of the area had been postponed and that JTC would be granting extensions to existing leases for up to 20 years. Sidat assured Leung that, should UDL decide to stay, EDB would provide the necessary support and assistance to procure the lease renewal. This included EDB providing its approval of UDL’s business plan in the lease renewal application “after which JTC’s approval would be no more than a mere formality”.[note: 12]Sidat told Leung that, as the reasons for exit were no longer of concern, UDL should withdraw from the potential sale to Kim Hock. 18     Leung said that he was surprised at Sidat’s in-depth knowledge of the proposed sale to Kim Hock as UDL had not notified EDB of the sale. He drew the conclusion that: (a) Sidat was working in conjunction with JTC, (b) Sidat had been informed of the details of the sale by JTC, and (c) Sidat was tasked to speak with Leung to persuade UDL to withdraw from the proposed sale. The following day, on 18 March 2005, UDL sent the letter to JTC advising of rescission of the sale to Kim Hock. 19     Leung claimed that he was both encouraged by Sidat’s strong support for UDL and also surprised at his extent of knowledge about the sale to Kim Hock despite the fact that the EDB was never notified of the intended sale. As such, Leung stated that he naturally concluded that Sidat was working in conjunction with JTC and was persuaded that the EDB and JTC would have been ready to grant UDL a 20-year extension of the Lease, pending thev submission of a business plan supported by the EDB. When asked during cross-examination why Leung thought that UDL could be so important that a senior officer of the EDB would ask them to apply for an extension, Leung proffered the following explanation[note: 13]: ... so if you were to ask me what did I know at the time, then I could tell you he was very keen, and I wouldn’t know why. But [Sidat] came, you know,with the blessing of JTC, because -- I mean,he was very informed. He was very keen for me to opt out of the deal, for some reason I did not know. He tried to convince me -- he tried to convince me it was my business which is -- hevalued for future contribution of Singapore shipbuilding industry, or like so. ... We were one of those guys who actually are staking out during the very bad time of shipbuilding industry. There’s a lot of people actually fold up and withdraw from the industry. [emphasis added] 20     Leung explained during cross examination that he decided to cancel the intended sale with Kim Hock and on 18 March 2005, and so duly informed JTC of the cancellation, based on the confidence he had placed on Sidat’s Alleged Representations[note: 14]: In a series of discussion leading to the final confirmation by Mr Sidat in this email, I had this impression from him; and in fact it was a strong enough impression that I made the decision to cancel the sale on 17 March.",
        "Sidat’s evidence": "21     Sidat gave evidence that he was employed by EDB from July 2003 to August 2007. In March 2005, he was a senior officer in the Logistics and Transport Cluster, along with Kong. Sidat covered Kong’s duties while the latter was on leave or overseas assignment. 22     Sidat said that one of the matters he helped Kong with was the matter of the UDL lease. Sidat said that he recalled speaking to Leung on the phone and meeting him at the Premises. However he could not recall the exact dates. Based on an email from Kong to Ernest Tay (“Tay”), JTC’s assistant manager (lease management) dated 17 March 2005 (see [27]), Sidat said that the initial contact with Leung would have been before that date as the email referred to a meeting with UDL on that date. 23     Sidat categorically denied UDL’s allegation that he had “sought to persuade [UDL] to reconsider its decision” to sell the Lease to Kim Hock. He said that EDB was tasked to provide comments and feedback on the proposed sale to Kim Hock. His role was limited to fact finding and reporting back to JTC. UDL was not a client of EDB and no file had been opened for it. Critically, Sidat denied that he had represented to Leung that, as a yet to be published policy, JTC had decided to postpone redevelopment in the area and would be prepared to grant lease extensions of up to 20 years. He also denied that he told Leung that EDB would render the necessary assistance to procure extension of the Lease. Sidat gave the following reasons to support these contentions: (a)     If it was a yet to be published policy, he could not have disclosed it to Leung as this would be a breach of his undertaking to EDB to safeguard official secrets and possibly an offence under the Official Secrets Act (Cap 213, 2012 Rev Ed). (b)     He did not recall that there was any such policy at the time. (c)     Extensions of leases fell within the purview of JTC and EDB merely provided inputs if requested to do so; EDB could not dictate to JTC on these matters. (d)     No business plan had been provided by UDL which could form the basis of an assessment. It was EDB’s practice to ask for a business plan before providing any feedback or recommendation. (e)     He was merely covering Kong on this matter and could not have taken such a decision on his behalf.",
        "Further background": "24     Tay testified that JTC was “indifferent”[note: 15]when it came to “who the choice of assignee is/should be”[note: 16]. However, Tay stated that JTC’s approval would still be required for the assignment as a whole.[note: 17]In particular Tay stated that one of JTC’s concerns in assessing a lessee’s application to assign its lease was whether there were subsisting breaches by the outgoing assignor under the Lease. After receipt of UDL’s application for approval to transfer the Lease to Kim Hock, JTC carried out a site inspection of the Premises around 26 January 2005. JTC observed that there were unauthorised structures and occupiers in the Premises. This was drawn to UDL’s attention, upon which UDL represented that they would provide JTC with a letter of undertaking to regularise the unauthorised structures. On 3 February 2005, Tay wrote to UDL requesting that UDL provides its letter of undertaking by 11 February 2005.[note: 18] 25     According to Tay, it was also normal practice for JTC to notify the relevant officer of the EDB whose portfolio included the management of the assignor’s lease, so as to obtain EDB’s comments on the assignment.[note: 19]As such, he emailed Kong on 14 February 2005, setting out the details of the proposed assignment and asked for his comments.[note: 20]On 24 February 2005, Kong informed Tay that EDB wished to meet up with UDL and Kim Hock before providing JTC with EDB’s views on the transfer.[note: 21]In an email sent on the same day, Tay provided Kong with the contact details of the UDL and Kim Hock representatives.[note: 22] 26     On 4 March 2005, Kong emailed Tay to state that he intended to further discuss with UDL to find out if UDL was willing to consider offers from other potential assignees as follows:[note: 23] … I am going to sound out [UDL] if they are willing to consider other offers from Strat Marine or ASL. I will try to ask about Kim Hock, but being a recycling [company], I doubt they will be able to make good use of this prime marine site ... 27     On 17 March 2005, Kim Hock sent an email to Tay inquiring about JTC’s decision on the assignment which had been pending for two months. Tay sent Kim Hock an email on 17 March 2005 stating the assignment was “still pending EDB approval”. This email was copied to Kong with the query “What is the status of the assignment? Hope to hear from you soon”.[note: 24]Kong replied the same day stating that UDL had informed EDB that they were reviewing their plans.[note: 25]He also told Tay that UDL’s change of position was a “commercial decision” and that JTC should allow UDL to communicate with Kim Hock directly. 28     Tay gave evidence that he was surprised at Kong’s email.[note: 26]He stated that JTC had a “non-intrusive” approach towards the proposed assignment. In an email dated 18 March 2005, he wrote to Kong to clarify that JTC was indifferent as to the identity of the potential assignee and therefore had no intention to obstruct communications between UDL and Kim Hock. 29     As stated at [18] above, UDL wrote to JTC on 18 March 2005, notifying JTC that the sale and purchase agreement between UDL and Kim Hock had been rescinded and that its application for consent for the assignment was no longer required. On the same day, UDL also wrote to EDB to inform them of the same. The letter from UDL to EDB read[note: 27]: We ... would like to inform you that the intended transfer was cancelled. Due to this new development we deem your inquiry is no longer applicable and there is no further action to follow as the case is closed. 30     It is common ground that subsequent to the rescission of the sale to Kim Hock, UDL engaged with EDB to develop a business plan to support its application for lease extension from JTC. The process dragged on somewhat for a number of reasons. It was only on 7 August 2008, more than three years after the first contact with EDB, that UDL submitted its application to JTC for lease renewal. On 23 October 2008, JTC acknowledged receipt of the business plan and lease renewal application but informed UDL that the application could not be processed for the time being as JTC was undertaking a comprehensive waterfront study. Notwithstanding this, UDL continued to engage with EDB on refining the business plan. On 24 September 2009, UDL applied to EDB for “Incentive for Redevelopment Plan” at the Premises, setting out its investment plan for the Premises. On the same day, UDL submitted its formal application for lease renewal to JTC. However on 20 November 2009, JTC wrote to UDL to advise that its application was not successful. UDL then embarked on a series of correspondence with JTC to appeal for a change of mind, including engaging a law firm to represent it. This process dragged on for another half a year. On 23 June 2010, JTC wrote to UDL to state that UDL’s application could not be granted. UDL filed the writ in S502 on 8 July 2010.",
        "Finding of fact on the Alleged Representations": "31     UDL’s case in S502 and S156 turns on the Alleged Representations. These are oral and not supported by any documentation from EDB, except that Leung pointed to emails that support their existence, which I will consider below. Sidat was unable to recall what exactly transpired in his dealings with Leung, which is not unexpected in the circumstances; indeed it would be surprising if he did recall anything given his brief involvement and the long passage of time. But Sidat was able to categorically deny that he had made those representations based on the normal procedure in EDB and the nature of his involvement in the matter – see [23] above. Although those reasons appear to be valid and accord with common sense, this does not mean that he did not make the Alleged Representations. In determining whether Leung’s allegations are true, or the extent to which they are true, it is necessary to consider all the relevant facts, including the supporting evidence. I now turn to consider them. 32     Sidat became involved in February 2005 when Leung first spoke to him on the phone and had dropped out of the picture after 26 May 2005. According to Leung, all the Alleged Representations were made to him by Sidat and nobody else. It was essentially Leung’s words against Sidat’s. I find the following factors to be relevant in my finding of fact in this regard: (a)     Leung had given inconsistent accounts (b)     The documentary evidence does not support UDL (c)     Late allegation of misrepresentation (d)     Sidat’s version is logical",
        "(i)   Leung had given inconsistent accounts": "33     I have set out in [9] to [16] above the various versions that Leung had given in his affidavits as well as that in the SOCs. The crucial events concerning the Alleged Representations took place in March 2005, some five years before UDL took out the writ in the first action, S502, on 8 July 2010. It is of course not surprising that Leung would have been mistaken on some of the details. However the burden of proof rests on UDL and given the importance of Leung’s evidence, consistency of his evidence would increase its probative value.  Conversely, inconsistency would reduce it.",
        "(ii)   The documentary evidence does not support UDL": "34     Leung relied on several contemporaneous emails to support his evidence. I set out the events leading to those emails. 35     Leung gave evidence that he met Sidat at EDB’s offices on 13 April 2005 to inform him of UDL’s withdrawal from the sale to Kim Hock. At that meeting, Leung said that he made it clear to Sidat that UDL’s decision to withdraw for the assignment was based on Sidat’s representations and assurances, acting for EDB, with the concurrence of JTC. Leung said that he requested Sidat to provide him with written confirmation of what Sidat had previously told him. In addition, Leung asked Sidat to check whether JTC would entertain an early application for lease renewal as the normal procedure envisaged such applications only around six months prior to lease expiry. Sidat, on the other hand, denied that Leung had told him that UDL’s decision was based on his representations. He said that if Leung had said this, he would have “corrected him on the spot”.[note: 28]However Sidat admitted that Leung had asked whether JTC would entertain an early application for the renewal of the Lease and he agreed to check with JTC. 36     Leung said that, as no response was forthcoming from Sidat, he sent Sidat an email[note: 29]on 19 April 2005 as follows: Just a short note to thank you for your attendance to the last discussion on 13 April 2005. It is our understanding that you are to ascertain if it is an open policy for JTC to give conditional agreement for extension of tenancy notwithstanding the length of the unexpired term. Given this being a starting position of all commercial assumptions it would be critical if this can be confirmed at the earliest. 37     On 25 May 2005, still absent a response from Sidat, Leung again wrote to Sidat to say: We write to update progress of things and wonder if you have managed to obtain confirmation from JTC if a conditional grant of extension of the tenancy would be a feasible approach to get things moving. We await to hear from you on the matter.[note: 30] 38     On 26 May 2005, Sidat replied to Leung with the following email: We have discussed the matter with JTC, who is agreeable to consider such a conditional extension for UDL. This is subject to EDB’s support and we would therefore look forward to receiving a proposal from UDL on your proposed plans for the site. Jen Siang has returned from his overseas travels, so you can follow-up on this directly with him.[note: 31] 39     It should be noted that Leung had stated that he had asked Sidat to provide him with a written confirmation of the Alleged Representations made by Sidat to him, which he had relied upon in deciding to withdraw from the sale to Kim Hock – see [35] above. However in both emails to Sidat, Leung made no mention of this request to Sidat for written confirmation. He only asked Sidat to confirm with JTC about the possibility of a conditional extension of the tenancy, to which Sidat replied in his 26 May 2005 email, which was what he wanted in addition to the first request. The three emails are more consistent with Sidat’s version than Leung’s.",
        "(iii)   Late allegation of misrepresentation": "40     There had been many meetings and emails between Leung and JTC as well as EDB. On 15 December 2005, Leung wrote to Kong asking him to “indicate [Leung’s] proper way forward at his [sic] juncture or if there [was] something new [that Leung] must incorporate before submission”.[note: 32]Separately, Kong then wrote to one Miss Karen Lee (“Lee”), a JTC officer, on 19 December 2005, to say[note: 33]: [UDL] was talking to us about renewing their yard lease early this year. This was before the joint EDB-JTC criteria for waterfront land renewal was formalized. Hence, the company is not aware of the changes. I have briefed them on the process, and promised that someone will send them the relevant forms. ... Besides the joint EDB-JTC form, I would like to send the company our normal EDB forms for further assessment into the business plan. 41     On 20 December 2005, Leung spoke to Tay who was in charge of managing UDL’s lease. During this conversation, Leung alleged that Tay never suggested a different mode of process for an extension application or contradicted Leung’s impression of JTC’s position as represented by Sidat. Tay however gave evidence that during the conversation, he clarified JTC’s position to Leung upon Leung claiming that he was confused on the procedure for renewing the Lease (ie, the renewal application was subject to JTC’s assessment and approval, and was not guaranteed). Crucially, after this conversation, Tay wrote an email to Lee to record the conversation with Mr Leung. This email[note: 34]read: Spoke to Mr Leung (MD, [UDL]) just now. The renewal of lease came about when EDB stepped in to stop the assignment between [UDL] & Kim Hock. He is very confused and unclear abt the renewal of lease procedures because our focus of assessments (P&M, VA...) is different from EDB. There are EDB forms, waterfront assessment forms and JTC renewal application to fill up which makes him confused on the procedures and processes. A meeting has been arranged next week to address his doubts and concerns. One comment arising from this case based on the tele-conversation (25 mins), it seems like EDB is sending a wrong signal or message to [UDL] that so long they have a fantastic idea/vision, EDB will support their plans andJTC will grant them the renewal. This is not true as we need to perform our own assessments. Perhaps, it is good to highlight to EDB (indirectly) when you meet them the next time as it is creating unnecessary confusion on ground. [emphasis in original] 42     This email showed that EDB had given Leung the impression that so long as UDL came out with a very good proposal, EDB would support its plans and JTC would grant approval. But this does not support UDL’s position that Sidat had made the Alleged Representations. 43     From 2005 to 2008, the preparation of UDL’s business plan was delayed. Leung attributed this to the bad market conditions which were prevailing at that time. As a result, UDL had to take “some time to pitch [their] business angle in the proper way, in order to come up with a business plan which [would have been] compatible to what Singapore shipbuilding market [needed]”.[note: 35] 44     It was not until the litigation commenced in 2010, some five years after the event, that UDL alleged that Sidat had made the Alleged Representations. Leung explained that he did not wish to unnecessarily accuse Sidat or anyone of personal wrongdoing. While this is understandable, it is a factor to be considered in deciding whether Leung’s version is accurate. In my view, it weighs against him.",
        "(iv)   Sidat’s version is logical": "45     Sidat had given his explanation why he could not have made the Alleged Representations – see [23] above. The reasons are logical. This is another factor to be weighed.",
        "Conclusion": "46     Weighing the four factors set out above in the context of the entirety of the evidence before me, I find that UDL had failed to discharge its burden of proof that Sidat had made the Alleged Representations to Leung. Indeed, I find on a balance of probability that Sidat did not make the Alleged Representations to Leung. In my view, the true reason for Leung’s decision to jettison the sale of the Lease to Kim Hock was Sidat’s representation that JTC would be prepared to consider an application for extension of the Lease. Leung had decided to grasp this opportunity. 47     In view of my finding of fact, I do not need to deal with the submissions by EDB and JTC relating to a finding of fact in favour of UDL. I need only to state that I agree with their submissions that UDL’s claim in negligence and proprietary estoppel fails.",
        "Events post 2005": "",
        "UDL’s breaches of the Lease": "48     The period from 2005 to 2007 is also significant. Tay gave evidence that during this time, UDL was almost in “perpetual breach” of its obligations under the Lease.[note: 36]UDL’s breaches first surfaced in a site inspection of the Premises conducted on 26 January 2005, after UDL had sought JTC’s authorisation for the assignment of the Lease to Kim Hock.[note: 37]During the site inspection, it was observed that there were structures placed on the Premises for which UDL had not obtained JTC’s authorisation. Moreover, it was observed that there were occupiers on the Premises which UDL had not obtained JTC’s authorisation for. Tay said that these irregularities were drawn to the attention of UDL, whereupon UDL represented that it would provide a letter of undertaking to regularise the unauthorised structures. Upon UDL’s failure to provide such a letter in due time, Tay wrote to UDL on 3 February 2005, requesting that the letter of undertaking be provided by 11 February 2005. In the same letter, Tay also reminded UDL that the sublease for one of its sub-lessees had expired and ought to be renewed by 14 February 2005. 49     In a letter dated 16 September 2005, one Low Fatt Hoong (“Low”) of JTC, wrote to UDL to inform them that a letter of undertaking would no longer be required as the proposed assignment to Kim Hock had been shelved. In the same letter, UDL was further directed to remove all the unauthorised structures on the Premises within one month.[note: 38]On 20 December 2005, JTC received a letter from S.R Engineering Pte Ltd (“S.R Engineering”), enquiring whether there was any available industrial land for the purposes of constructing accommodation quarters.[note: 39]Tay gave evidence that he was surprised to see that S.R Engineering used 3 Benoi Road (iethe address of the Premises) as its mailing address as at that time, UDL had not sought JTC’s permission to sublet the premises to S.R Engineering.[note: 40]Thereafter, on 23 December 2005 Tay wrote to UDL, highlighting the illegal subletting and reminding UDL of their obligations under the Lease.[note: 41]In the same letter, UDL was given one month to rectify their breach. 50     On 2 February 2006, during a site meeting conducted at the Premises, it came to JTC’s attention that UDL had persisted in the illegal subletting, in breach of its obligations under the Lease.[note: 42]On 7 February 2006, Low wrote to UDL on this issue, identifying the illegal sub-tenants found to be occupying the Premises and giving UDL one month to address the issue. A meeting was also arranged on 13 February 2006 to discuss the issue of UDL’s illegal subletting. On the same day, Tay sent UDL a letter to minute the discussions at the meeting.[note: 43]In that letter Tay informed UDL that JTC was not agreeable to UDL’s request for a further four to six months to regularise the illegal subletting. Rather UDL was to abide by the deadline established in JTC’s letter on 7 February 2006. 51     More than five months later, in or around July 2006, it came to JTC’s attention that Blue-Sea Engineering Pte Ltd (“Blue-Sea”) was still an unauthorised subtenant at the Premises, despite JTC’s letters. On 31 July 2006, UDL wrote to JTC to explain that its relationship was not one of sub-lease and therefore not in breach of the Lease.[note: 44]UDL’s position in that letter was that under the relevant agreement, they had not conferred Blue-Sea with an exclusive right of use and possession. Rather, the nature of the agreement was to provide facilities to Blue-Sea according to their work requirements. On this basis, UDL claimed that consent from JTC was not required as there was no sub-letting. 52     On 2 August 2006, a further site inspection was conducted at the Premises.[note: 45]The findings made during that inspection were recorded in a letter dated 8 August 2006, from JTC to UDL. The letter noted that eight illegal sub-tenants were found to be occupying the Premises, two of which had become sub-tenants since the last site inspection. The same letter also noted the existence of unauthorised structures on the Premises. Again, UDL was given one month to regularise the breaches of the Lease. On 10 August 2006, Gillian of UDL responded to JTC’s letter dated 8 August 2006 to inform JTC that UDL was taking steps to remedy the identified breaches of the Lease. 53     On 7 September 2006, a further site meeting was conducted at the Premises. At this meeting, it was observed that all but one, of the unauthorised structures had been removed from the Premises. It was also found that the illegal sub-tenants had either vacated, or were in the process of vacating the Premises or were in the process of making sub-letting application with JTC. 54     Sometime in early October 2006, UDL requested that JTC allow it to make the sub-letting applications retrospectively.[note: 46]According to Tay, UDL did not explain the reasons for such a request. On 5 October 2006, Tay informed UDL that JTC was not agreeable to its request. JTC subsequently altered its position and on 20 October 2006, informed UDL that the sub-letting application for one of their sub-tenants had been approved, with the subletting period being retrospective from 1 September 2006 to 31 May 2007. The letter however stressed that UDL’s prior unauthorised sub-letting amounted to a breach of the Lease but that JTC was prepared to allow UDL to remedy the breach on a without prejudice basis. JTC again wrote to UDL on 25 October 2005, in the same terms, to inform that the sub-letting application for another of their sub-tenants had been approved. 55     Between 2006 and 2007, UDL’s payment of rent was also in arrears. In a letter dated 19 July 2006, JTC informed UDL that its rent was S$164,915.79 in arrears, that amount being the equivalent of three months’ rent. 56     According to Tay, UDL’s breaches of the Lease did not stop in 2006. On 11 September 2007, a site inspection was conducted at the Premises.[note: 47]During that inspection, it was observed that UDL had breached the Lease in the following ways.[note: 48]First, UDL had erected unauthorised structures in the form of 12 containers which were being used as stores, offices and rest areas for their workers. Second, one of UDL’s sub-lessees was found to be in occupation of the Premises, despite the expiry of its sub-lease. Around this time, JTC also received a call from one Mr Alan Soong, an administrative manager of UDL. The purpose of the call was to enquire on JTC’s guidelines on dormitories and other temporary structures. On 12 September 2007, JTC wrote to UDL in a letter, notifying them of the breaches observed during the inspection and requiring them to remedy the said breaches.[note: 49]In the same letter, JTC also informed UDL that dormitories were not allowed on the premises due to health and safety concerns.",
        "UDL’s lease renewal application": "57     It was only on 30 June 2008 that Leung met one Mr Kenneth Chew (“Kenneth Chew”), another EDB officer to present UDL’s business plan to him, likening the process to “[getting] EDB to correct my homework, if you like, before [UDL] were to submit”[note: 50]and it being a step of “prudence”.[note: 51]Kenneth Chew told Leung that the business plan was “interesting and novel”[note: 52]and that UDL should liaise directly with JTC from thereon. This purportedly gave Leung encouragement, who then interpreted this as an indication that EDB was in agreement with the plan and UDL simply had to “[sort] out the formalities with JTC directly”[note: 53]. 58     On 22 July 2008, Leung, along with one Ms Maureen Monserrat (“Ms Monserrat”), a UDL employee, met with Tay to present UDL’s business plan to him. Tay then requested Leung to submit a formal application for the renewal by giving him a CD-ROM with the standard format of submission. According to Leung, Tay seemed pleased and did not give any negative feedback to Leung with regards to the business plan. Leung also claimed to have told Tay about UDL refraining from selling the Premises, and UDL’s preparedness to invest in new yard facilities. Tay’s evidence, however, was that he did not find it necessary for him to comment on UDL’s business plan at that time given that UDL had not submitted a complete application at that time. In fact, Tay claimed to have informed Leung and Ms Monserrat clearly that the application could not be processed just based on the business plan, and that the entire application process would be reviewed by JTC after UDL submits a complete application. 59     UDL submitted its application for a renewal of the Lease to JTC on 6 August 2008. Leung’s explanation as to why it took so long for UDL following Sidat’s email to send in its renewal application was due to the bad market conditions at that time, which had caused them to take “some time to pitch [their] business angle in the proper way, in order to come up with a business plan which [would have been] compatible to what Singapore shipbuilding market needs”[note: 54]. 60     On 18 August 2008, Tay wrote to UDL in an email to confirm JTC’s receipt of UDL’s business plan but to inform UDL that the application form was incomplete. In a letter dated 22 August 2008, Leung wrote to JTC explaining that UDL wished to resubmit the application form. The said form was enclosed in the letter. 61     On 23 October 2008, Tay emailed UDL to acknowledge receipt of UDL’s business plan and waterfront lease renewal form, but also informed Leung that JTC could not process the application as JTC would be embarking on a comprehensive waterfront study. 62     Leung’s evidence was that UDL and JTC remained in communication between 23 October 2008 and August 2009, and JTC and EDB never altered their position as originally communicated by Sidat, and the tone of discussions throughout was “pure[ly] procedural as if the lease would be renewed”[note: 55]. In particular, on 3 August 2009 one Mr Tang Kok Min (“Tang”), an assistant manager at JTC who had taken over managing the Lease from Tay, sent UDL an email which stated the following: Hi Maureen Has [sic] gone through UDL business plan and it is in accordance to our assessment requirement except that on top of this plan, EDB would like you to also fill up the form attached accordingly and submit to Davin Wang who is also cc-ed in the email list. Thank you. 63     Leung testified that even if the email “[didn’t] say so”,[note: 56]he understood it to mean that: (a) the EDB had seen and approved UDL’s business plan, (b) the grant of an extension of the Lease would be forthcoming, and (c) the only missing item was just the formal papers required by the EDB. Following the above 3 August 2009 email came various other requests from the EDB on 5 August, 2 September and 23 September 2009, asking for figures, documents and forms. Upon the suggestion from Mr Dhillon, counsel for JTC, that these requests indicated that the EDB could not have endorsed UDL’s business plan, Leung insisted that they were merely a “question of clarification and supply of information” which had “nothing to do with the basic theme”.[note: 57] 64     Unknown to UDL, as of August 2009, JTC was already not keen to renew the Lease as can be seen from the internal correspondence between JTC and EDB. On 20 August 2009, Tang wrote to Davin Wang (“Davin”) with the following:[note: 58] Yes, UDL were once well-know [sic] to sublet or even illegal sublet [sic] for the past few years. However, I’ve checked our record and it showed that we did not send them any written warnings for this breach at all. Hence, it is difficult to prove that they have indeed sublet illegally. What we have heard abt the illegal sublet has always been “hearsay”, no physical evidence is found from the past. The coy has came [sic] in for renewal since 2008 and we are holding their application becos of the waterfront policy review. Think they deserve a fair assessment now. But from land use point of view, they have not been using the 4-ha land optimally. And JTC is keen to take back the land. Altas [sic], taking away the illegal sublet, we want to know if EDB is supportive of their renewal based on their biz plan and their importance in the industry value chain. Do we still need this coy in Singapore? 65     Davin’s reply on the same day was similarly negative, and read as follows[note: 59]: TE is not keen to support their renewal request as they do not have a strong case. But as a measure of good faith and due diligence, I have asked for their project numbers and am still waiting for Maureen to revert. 66     On 1 September 2009, Ms Monserrat submitted the completed EDB form to Davinviaemail, and she furnished missing information on 18 September 2009. Davin’s reply on the same day (18 September 2009) stated the following[note: 60]: ... [W]e have reviewed your business plan based on the information you submitted and reverted with our inputs to JTC accordingly. The decision regarding your application rests with JTC and they can advise you accordingly about your continued interest. Per our conversation, I suggest you follow up with JTC directly if there are material changes in your projections/business plan accordingly. Thank you. 67     Leung claimed that he was assured by Tang that UDL’s submission was “good enough” at a meeting on 16 October 2009 with Tang and Davin[note: 61]and there was nothing UDL needed to do to improve on[note: 62]. Leung took “good enough” to mean “not only the so-called formal paper submission, but in order to achieve the very end of getting the approval”[note: 63].",
        "Events following the rejection": "68     JTC informed UDL via a letter dated 20 November 2009 that UDL’s application for renewal of the Lease was unsuccessful. Leung wrote to JTC on 25 November 2009 (the day that UDL received JTC’s 20 November 2009 letter of rejection) expressing UDL’s disappointment in the decision and seeking a meeting to clarify the reasons underlying the rejection. When quizzed by Mr Dinesh Dhillon, counsel for the defendant in S502, why this letter made no mention of Sidat’s Alleged Representations, Leung responded as follows[note: 64]: Okay. Now, I’m a businessman. If you say, why didn’t I take JTC to court the first day they turned me down, I said I actually tried toplay within the system. I tried to play along with the protocol of the application. I tried to play along with the process of appeal. [emphasis added] 69     In explaining what he meant by “play within the system”, Leung elaborated as follows during cross-examination[note: 65]: The system was you have to go through the application, and then ultimately, you know, the JTC has to actually make a stamp on a piece of paper, stamp approval, and went through the process on the record ... Now, if you asked me, did I react as I should have [and] brought them to court the first day, the answer is no. And if you want to hear my explanation, I explain. I tried to play within the system and allow the parties to come to terms and give me what I want within the system. That’s it. 70     Leung’s 16 September 2010 Affidavit also set out his belief on how renewal processes with statutory boards in Singapore functioned as follows[note: 66]: As far as I am aware, this [ie, once the EDB gave their support of UDL’s business plan, the Lease would be renewed as a matter of formality] is the practice particularly of statutory bodies here in Singapore. One does not get an upfront formal approach or decision but rather receives informal assurances as statutory bodies here have to, as a matter of record, “go by the book”. 71     On 3 December 2009, Leung wrote to JTC to seek clarification whether the reason for JTC’s purported change of position was due to some understanding reached between JTC and Singmarine Keppel Pte Ltd (“Singmarine”). Leung recounted that previously one Mr Hoe Eng Hock (“Hoe”), the executive director of Singmarine, had met with him in 2008 and “gave a message ... that Singmarine was intended to apply for and take over [UDL’s] yard when [UDL’s] lease [was] to expire by December 2010 …”.[note: 67]There was no reply to this letter. In respect of Leung’s allegation that there was some form of agreement between JTC and Singmarine, Hoe also strongly denied any such “understanding” between JTC and Singmarine, and reiterated that he only made the offer to Leung to sublease a part of UDL’s shipyard for a short period of approximately twelve months in order to “ameliorate imminent space congestion issue[s]”[note: 68]that Singmarine was facing. 72     Separately, UDL also made arrangements to meet EDB. As such, on 14 December 2009, there was a meeting between UDL’s Leung and Cristina Menina, and the EDB’s Davin, Dennis Tan and Ralph Foong (“Foong”). Foong, the EDB officer who had become involved with the Lease from July 2009, stated that he made it clear to UDL during the meeting that JTC’s decision not to renew the Lease was final. However, he said that the EDB officers still agreed to listen to UDL share their business plan with them during the meeting as they “did not consider it appropriate to turn them away”[note: 69], given UDL’s continued interest in investing in Singapore notwithstanding JTC’s rejection of their renewal application. 73     After this meeting, Leung wrote to Foong on 15 December 2009 stating the following[note: 70]: … To this Business Plan, we would appreciate if EDB would advise on points of refinement, if any, and to endorse this plan accordingly to its merits. … 74     Foong stated that he was surprised by this request for endorsement as he had never given an impression that the EDB would or could endorse a company’s business plan. 75     On or about 22 December 2009, UDL’s Leung, Cristina Menina and Gillian Leung and JTC’s Loh Yew Pong and Tang had another meeting. This was reflected in Leung’s letter to Loh Yew Pong on 30 December 2009 where Leung requested assistance from JTC in looking for “alternative site allocation”, and reiterated that UDL was determined to go ahead with the business plan “whether to redevelop our site at the current Benoi Road yard or a suitable new yard to be identified”. 76     On 8 January 2010, there was another meeting involving the EDB’s Foong, Dennis Neo (his subordinate), and Leung. Following the meeting, Leung sent three letters to Foong on 8 January, 12 February and 15 March 2010. In those letters, Leung noted the EDB’s satisfaction that UDL’s plan was technically feasible and compatible to the projected development of Singapore’s marine industry and sought a written endorsement of UDL’s business plan from the EDB for the purposes of approaching JTC with their application. 77     Foong categorically denied indicating any form of support for UDL’s business plan and stated that Leung’s letters had in fact “twisted and misrepresented”[note: 71]what was said during the 8 January 2010 meeting. As a result, Foong called UDL on 16 March 2010 to voice his objections to the purportedly false statements in the letter dated 15 March 2010. The exact content of the telephone conversation is disputed, as Foong disagreed with certain parts of the internal telephone memorandum as recorded by Cristina Menina. 78     Following the telephone conversation, Leung wrote to Foong on 22 March 2010 to “thank [Foong] for confirming that the EDB [had] given a recommendation to JTC for land allocation under [UDL’s] business plan”.[note: 72]That same day, UDL’s then counsel TSMP Law Corporation (“TSMP”) wrote to JTC, asking for a renewal of the Lease. 79     Foong responded to Leung’s letters collectively in an email dated 13 May 2010, clarifying certain matters to UDL. In particular, Foong reiterated that “EDB [was] not in a position to endorse any company’s business plan” and that the EDB “did not at any time endorse UDL’s business plan”. That same day, TSMP wrote to EDB threatening to take legal action. On 18 May 2010, EDB replied to TSMP, denying all allegations and reserving EDB’s rights. 80     On 29 April 2010, JTC wrote to UDL stating that JTC was not obliged to allocate land on the basis of the EDB’s endorsement. On 19 May 2010, JTC informed UDL that their appeal was not successful and that JTC was maintaining its decision not to grant a renewal of the Lease. At the same time, JTC reiterated UDL’s obligation to reinstate and return the Premises to JTC by the expiry of the Lease. This prompted yet another letter from Leung to Loh Yew Pong on 21 May 2010 requesting confirmation on when and how the joint assessment had taken place and whether the EDB’s input had changed since November 2009. Shortly after this letter, Leung wrote another letter on 26 May 2010 addressed to both Mr Cedric Foo, Chairman of JTC, and Mr Leo Yip, Chairman of EDB, indicating that UDL was “on the cusp of commencing proceedings against the JTC and the EDB” but was willing to “make one final effort to resolve matters amicably”.[note: 73] 81     Subsequently, on 16 June 2010, a meeting chaired by Ms Tang Wai Yee, JTC’s Director of Aerospace, Marine & Clean Tech Cluster was attended by some EDB and UDL representatives. This, in turn prompted Leung to write to Mr Cedric Foo (Chairman of JTC) again on 18 June 2010 to voice his unhappiness about the meeting which he described as “disappointing and somewhat shocking” and “no more than an attempt at a public relations exercise in the hope that UDL would somehow be placated and quietly withdraw”.[note: 74] 82     On 23 June 2010, JTC replied stating that JTC was unable to provide a new waterfront lease to UDL due to the tightening of the policy for allocation of scarce waterfront land, but also assured Leung that the Multi Agency Committee (comprising JTC, EDB and SPRING Singapore) had thoroughly assessed UDL’s application before finalising its decision. 83     On 16 September 2010, UDL applied for an interim injunction to allow UDL to remain on the Premises pending the resolution of S502. The application was dismissed on 4 November 2010 by Kan Ting Chiu J.",
        "Events after the Lease expired": "84     The Lease expired on 31 December 2010. However, UDL did not vacate the Premises by that date. In February 2011, JTC commenced proceedings via Originating Summons No 125 of 2011 (“OS 125/2011”) against certain unauthorised sublesses on or about 17 February 2011 in order to recover possession of the Premises. Accordingly, UDL handed over the keys to the Premises on 4 March 2011. However, UDL failed to remove its heavy equipment from the Premises even after it had handed the keys over to JTC. 85     On or about 12 May 2011, an explosion occurred on board a vessel which was situated on the Premises by one of the authorised sublessees, Haosen Marine Pte Ltd (“Haosen”). As a result, several structures on the Premises and some of the neighbouring buildings were damaged and the Building and Construction Authority of Singapore (“the BCA”) ordered the closure of the Premises. As a result of the BCA’s order of closure, the unauthorised subleesses had limited access and could not vacate the Premises. 86     UDL claimed that it had engaged Haosen to perform reinstatement works on 23 December 2010. However, according to Jeremy Chan Chuan Weng (“Jeremy”), the JTC officer handling the Lease from 15 April 2010 to 16 December 2012, he was told by Haosen’s Mr David Soh that UDL had only approached Haosen in February 2011 to request a quotation for reinstatement works to be done on the Premises. JTC eventually engaged their own term contractor, Sek Loong Trading & Construction Service Pte Ltd (“Sek Loong”), to survey the Premises and provide a fee quotation for reinstatement works and demolition of structures. Preparations for the works began in September 2011 and the works began in October 2011 after Sek Loong received the BCA’s permit. By 20 December 2011, the demolition and removal of all building structures affected by the explosion was completed (except the backfilling of the land). The BCA was informed of the completion via a letter dated 20 December 2011, written by one Mr Ng Boon Hoo, a professional engineer who requested the BCA to lift the closure order. The closure order was lifted sometime in early January 2012. By 5 March 2012, the backfilling work was done and the reinstatement works were hence complete. A few days before the completion of the backfilling work, JTC offered the Premises to COSL Oil-Tech (Singapore) Ltd (“COSL”). COSL’s lease of the Premises commenced on 1 June 2012.",
        "UDL’s claim against JTC in S502": "87     UDL’s claim against JTC is based on the existence of the Alleged Representations. It follows that, from my finding of fact in [46] above that Sidat did not make the Alleged Representations, UDL’s claim against JTC fails. I therefore dismiss UDL’s claim against JTC in S502.",
        "UDL’s claim against EDB in S156": "88     Similarly, UDL’s claim against EDB is based on the same Alleged Representations. For the same reasons, I also dismiss UDL’s claim against EDB in S156.",
        "JTC’s claim against UDL in S98": "89     JTC’s claims in S98 are substantially the following: (a)     Double rent for the holding over period,ie, from 1 January 2011 (the day following the expiry of the Lease on 31 December 2010) to the date of re-possession on 4 March 2011. (b)     Rent for the reinstatement period from 4 March 2011 to 5 March 2012. (c)     Reinstatement costs of $282,333.27 comprising the following: (i)       S$268,031.54 to Sek Loong for a substantial part of the reinstatement works; (ii)       S$11,370.73 to Sek Loong for the removal of cladding; and (iii)       S$2,931.00 to Kim Bock Contractor Private Limited for removal of overgrown vegetation along the fence at the Premises. 90     UDL accepted that should its case against JTC in S502 fail, the Lease would have expired on 31 December 2010 and JTC would be entitled to re-possession of the Premises. However UDL submitted that: (a)     JTC is not entitled to the quantum of double rent it is claiming. (b)     JTC is not entitled to the quantum of reinstatement cost it is claiming. (c)     JTC is not entitled to rent for the entire reinstatement period.",
        "Double Rent": "91     UDL contended that the holding over period was 1 January to 4 March 2011 but disputed the quantum. Under s 28(4) of the Civil Law Act (Cap 43, 1999 Rev Ed) (“Civil Law Act”): Every tenant holding over after the determination of his tenancy shall be“chargeable, at the option of his landlord, with double the amount of his rent until possession is given up by him or with double the value during the period of detention of the land or premises so detained, whether notice to that effect has been given or not.”[emphasis added] 92     A landlord has two options under s 28(4) of the Civil Law Act,viz, to charge double rent, or double value. There was some disagreement as to whether under the first option, double rent, is based on the rent last paid by the tenant or the rent that the tenant would have to pay during the holdover period. JTC relied onSarawak Machineries Trading Co & Anor v Sii Hing Kung & Ors[2004] 2 MLJ 213 (“Sarawak Machineries”) in which it was held that it was not restricted to the rent last paid as the statute was concerned with the period after the tenancy had come to an end. However in that case there was an option in the tenancy agreement for renewal at a higher rent. The court held that in those circumstances, the relevant rent was the higher rent in the option. The present case does not contain such a provision.Sarawak Machineriesis not authority for the proposition that in a claim for double rent it does not relate to the rent last paid. Indeed, if that rent is computed on the basis of the market rent during the holdover period, it would be no different from the second option of charging double the value. It seems to me that it would be more logical for the first option to refer to the rent last paid and the second option to refer to the market rent during the holding over period. This would give the landlord the option to charge double the last rent paid if the market value of the land had fallen in the holding over period, or if it has risen, to charge double the market rent. Further, if the landlord opts for double market value, he has the burden of proving the market value which may be a difficult task. He can simply opt for double rent which relieves him of this evidential burden. However in the present case, JTC has in any event, has opted for double market value and I need only to consider that issue. 93     Jeremy, a senior analyst in the corporate planning division of JTC, gave evidence that the value of the Premises in 2011 was $78,895.70 per month. This was based on JTC’s posted rate for land and waterfront area from 1 January 2011. UDL did not offer any evidence to the contrary and I accept this figure as the market value during the holding over period. Applying this sum over the two months and four days, the double rent would come up to $167,971.49.",
        "Reinstatement Period and Rent": "94     UDL contended that the 1-year reinstatement period was unreasonably long. However considering the following circumstances, I find that it was reasonable: (a)     The Premises was occupied by a number of unauthorised sub-lessees which UDL had failed to clear and JTC had to act reasonably in evicting them. (b)     On 12 May 2011, less than two months after re-possession an explosion occurred aboard a vessel of one of the unauthorised sub-lessees which damaged several structures on the Premises. BCA issued a closure order which was not lifted until January 2012 and this further delayed reinstatement works. 95     JTC claimed that the holding over period extended beyond 4 March 2011, the date that UDL handed the keys to the Premises to JTC. I do not agree. UDL had surrendered possession on that date. What UDL had failed to do was to comply with its obligations to deliver vacant possession and reinstate the Premises according to the terms of the Lease. For this breach, JTC is entitled to costs of evicting the sub-lessees and reinstatement of the land and any loss arising from its inability to obtain income from the Land. JTC did not cite to me any authority for its proposition that the holding over period covered the reinstatement period and I see no reason why a landlord should be entitled to a very punitive sum of double rent or double value for a period in which the tenant has no longer any control over the premises. What JTC is entitled to is the rent under the Lease for this period as provided for in clause 1.10(h)(iii) and (iv) of the Lease which provide as follows: (iii) If [UDL] shall for any reason fail to carry out the decontamination and reinstatement works, then [JTC] may recover from [UDL] all costs and expense which [JTC] may incur in carrying out or causing such decontamination and reinstatement works to be carried out including any tests thereto which [JTC] may deem necessary. (iv) [JTC] shall be entitled to further recover from [UDL] as a debt all rent, GST, property tax and such other amounts which [JTC] would be entitled to receive from [UDL] had the period within which the decontamination and reinstatement works are effected been added to the term of the lease. Subparagraph (iv) states that JTC is entitled to the rent for the reinstatement period as if such period had been “added to the term of the lease”. This clearly means that the rent that UDL is liable for is that under the Lease, which was $54,926.25 per month. For the 12-month reinstatement period, it amounts to $659,115.00.",
        "Reinstatement Cost": "96     I accept JTC’s submission that it is entitled to the full reinstatement costs of $282,333.27 that it had incurred.",
        "Orders": "97     I therefore order UDL to pay JTC the sum of $1,109,419.76 comprising the following: (a)     Double rent for the holding over period from 1 January to 4 March 2011 amounting to $167,971.49. (b)     Rent for the reinstatement period pursuant to clause 1.10(h)(iv) of the Lease amounting to $659,115.00. (c)     Reinstatement costs amounting to $282,333.27. 98     Unless there is any reason to order differently (for which the parties have liberty to apply), I also order UDL to pay the costs of JTC and EDB in S502, S156 and S98 on the standard basis.  [note: 1]Defendant’s (JTC’s) bundle of documents vol 1 (1DB) pp 1-8. [note: 2]Leung’s affidavit evidence-in-chief (AEIC) dated 21 January 2013 p 5 para 11. [note: 3]First volume agreed bundle (1AB) pp 1-3. [note: 4]1AB pp 4-12. [note: 5]1AB p 13. [note: 6]1AB p 36. [note: 7]1AB p 98. [note: 8]1AB p 99. [note: 9]Leung’s AEIC dated 16 September 2010 p 3 para 7.1 [note: 10]1AB p 110. [note: 11]Leung’s 16 September 2010 affidavit para 7.10; 1AB p 127 [note: 12]Leung’s AEIC p 11 para 23(b) [note: 13]notes of evidence (“NE”) day 2 pp 48-49 [note: 14]NE day 2 p 63 [note: 15]NE Day 3 p 15. [note: 16]Tay’s AEIC p 5 para 10. [note: 17]Tay’s AEIC p 5 para 11. [note: 18]1AB p 114. [note: 19]Tay’s AEIC p 6 para 12. [note: 20]1 AB p 119. [note: 21]Tay’s AEIC p 9 para 18] [note: 22]1AB p 117. [note: 23]1AB p 117. [note: 24]1AB p 121 [note: 25]1AB p 120. [note: 26]Tay’s affidavit p 13 para 23 [note: 27]1AB p 125 [note: 28]Sidat’s AEIC filed 21 January 2013, p 9 para 18. [note: 29]1AB p 128. [note: 30]1AB p 127 [note: 31]1AB p 127 [note: 32]1AB p 133 [note: 33]1AB p 132 [note: 34]1AB p 131 [note: 35]NE day 1 p 43 [note: 36]Tay’s affidavit p 23 para 42 [note: 37]Tay’s affidavit p 6 para 14 [note: 38]1AB p 129. [note: 39]1AB p 134. [note: 40]Tay’s affidavit p 23, para 43 [note: 41]1AB p 136 [note: 42]Tay’s affidavit p 25, para 46 [note: 43]1AB p 141 [note: 44]1 AB p 147 [note: 45]Tay’s affidavit p 29, para 53 [note: 46]Tay’s AEIC p 33, para 59 [note: 47]Tay’s AEIC p 39, para 73 [note: 48]1AB p 169 [note: 49]1AB p 171 [note: 50]NE day 1 p 52 [note: 51]NE day 1 p 53 [note: 52]Leung’s AEIC p 21 para 43 [note: 53]Ibid [note: 54]NE day 1 p  43 [note: 55]Leung’s AEIC p 23 para 50 [note: 56]NE day 1 p 69 [note: 57]Id, pp 74-75 [note: 58]1AB p 405 [note: 59]1AB p 403 [note: 60]1AB p 408 [note: 61]NE day 1 p 84 [note: 62]Leung’s AEIC p 26 para 57 [note: 63]NE day 1 p 88 [note: 64]NE day 1 p 92 [note: 65]NE day 1 p 94 [note: 66]Leung’s 16 September 2010 Affidavit p 10 para 8.4. [note: 67]1AB p 511 [note: 68]Hoe’s AEIC p 3 para 7 [note: 69]Foong’s AEIC pp 14-15 para 20 [note: 70]1AB p 521 [note: 71]Foong’s AEIC p 18 para 28 [note: 72]1AB p 542 [note: 73]2AB p 566 [note: 74]2AB p 575"
    }
}