{
    "case_title": "Law Society of Singapore\n      v\n      Udeh Kumar s/o Sethuraju",
    "ncitation": "[2013] SGHC 121",
    "coram": "Sundaresh Menon CJ; \n      Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA",
    "sections": {
        "Introduction": "1       It is axiomatic that, subject to his or her overriding duty to the court, an advocate and solicitor’s first duty is to his or her client. This overarching duty takes various forms which are, in the final analysis, both obvious as well as commonsensical. One duty is to communicate directly with one’s client. Another is to keep the client reasonably informed. A third is to always advance the client’s interests unaffected by the advocate and solicitor’s and/or a third party’s interest, the failure to do so amounting to the advocate and solicitor placing himself or herself in an unacceptable position of a conflict of interests. All three duties were alleged to have been contravened by the advocate and solicitor (“the Respondent”) in the present proceedings, which concerned an application by the Law Society of Singapore (“the Applicant”) for an order pursuant to s 98(1) of the Legal Profession Act (Cap 161, 2009 Rev Ed) (“the Act”) that the Respondent be made to suffer such punishment as is provided for in s 83(1) of the Act. 2       InThe Law Society of Singapore v Udeh Kumar s/o Sethuraju[2012] SGDT 4 (“the Report”), the Disciplinary Tribunal (“the DT”) found that all three charges against the Respondent were made out beyond a reasonable doubt and that cause of sufficient gravity therefore existed for disciplinary action against him; hence, the present application which is before this court.",
        "Facts": "",
        "Parties to the dispute": "3       The Respondent is an Advocate and Solicitor of the Supreme Court of approximately 25 years’ standing. During the material time, he practised in the firm of S K Kumar & Associates (“the Firm”). He is now practicing in S K Kumar Law Practice LLP. 4       The complainant, Nor Afidah binte Mohamed Kassim (“the Complainant”), was the Respondent’s client. She worked as a school cleaner and claimed that she was not well-educated and was unfamiliar with the English language. She was married to one Norazman bin Ali (“Norazman”) and in 2009, the couple were in the process of undergoing divorce proceedings. 5       One Mohamed Haron Bin Hassan (“Haron”) was a housing agent who was employed by Happiness Housing System Pte Ltd (“Happiness”). Haron is also the cousin of the Complainant. Happiness was owned, in the proportion of 49%, by one Mr Peh Teck Tiong (“Peh”). Peh, whose first name is Desmond, was also the sole proprietor of Heedmasters Credit, a firm of licensed moneylenders (“Heedmasters”). Both Happiness and Heedmasters were, at the material time, located at Sultan Plaza at Jalan Sultan. 6       At the material time, the Respondent employed one Nur Elliana Taye Binte Saifuddin (“Elly”) as a conveyancing secretary. The Respondent had an office on the 9th floor of the Housing Development Board (“HDB”) Hub at Toa Payoh. It was on the same floor as two other law firms.",
        "The events on 26 September 2009": "7       In September 2009, the Complainant and Norazman asked Haron to sell their flat at Block 504 Bedok North Street 3 #11-126 (“the Flat”). Around the same time, the Complainant needed $10,000 to settle her debts. Haron claimed that she had sought his help to secure a loan and had told him that she was “desperate” because she was being chased by friends and relatives. 8       On 26 September 2009, Haron introduced the couple to Heedmasters at Sultan Plaza, so that the Complainant could borrow $10,000. The Complainant discussed the request for the loan with Peh who agreed to extend a loan of $10,000 to the Complainant. The Complainant signed a number of documents – the loan agreement, a loan application form (collectively, “the First Loan Agreement”), a form of note of contract under the Moneylenders Act and a declaration under the Bankruptcy Act as well as copies of the duly acknowledged cheque and cash voucher. In the First Loan Agreement, the Complainant was named as the borrower and Norazman was named as surety. 9       Whether she knew what she had signed and whether she had been given copies of those documents is in issue. One of the documents contained the Complainant’s confirmation that she had received $10,000, consisting ofcash in the sum of $6,000and acheque for $4,000.",
        "The events on 8 October 2009": "10     On 8 October 2009,the Complainant and Norazmansigned some documents in different offices at the HDB Hub in Toa Payoh, as follows: (a)     A Warrant to Act appointing the Firm in the sale of the Flat; (b)     A Letter of Authority declaring that the Firm was authorised to collect the sale proceeds on their behalf and to deduct,inter alia, the legal costs of $1,500 (“the First LOA”); and (c)     A Power of Attorney signed by Norazman authorising the Complainant to act in the sale of the Flat on his behalf (“the POA”). 11     On the very same day, presumably after the POA had been signed, the Complainant –without Norazman– signed the following documents: (a)     A Letter of Authority declaring that the Firm was authorised to pay out, from the sale proceeds, the sum of $19,000 plus interest in favour of Heedmasters (“the Second LOA”); (b)     A Statutory Declaration to the effect that she intended to sell the Flat and that she had applied to Heedmasters for a business loan of S$9,000 for a business enterprise known as “Afidah Spa” in the presence of Mr Loh Chiu Cheong of Chiu Cheong & Co, a firm of Advocates and Solicitors, which was on the same floor as the Respondent’s office; and (c)     A second loan agreement signed by the Complainant which stated that Heedmasters had agreed to extend a business loan of S$9,000 for a business enterprise known as “Afidah Spa” (“the Second Loan Agreement”). Curiously, the Second Loan Agreement was dated 9 October 2009 instead of 8 October 2009 (which was the date of signing). 12     Theexact circumstances and locationsin which these documents were signed are disputed by the parties. In summary, the Complainant contended that: (a)     she was taken to the Respondent’s office more than once to sign the aforementioned documents and was attended to by one David (who was an employee of Happiness); (b)     she did not read or understand the documents which she had signed and no one explained their contents to her; and (c)     she had only been paid $10,000, despite having signed documents to the effect that she had incurred a $19,000 loan, without realizing what she was doing. 13     The Respondent, however, contended that: (a)     Elly had explained these documents to the Complainant and that the latter had acknowledged that she understood them; (b)     there was no one by the name of David at the Respondent’s office on that day; (c)     it was the Complainant herself who told Haron that she had wanted to enter into the Second Loan Agreement; and (d)     the full $19,000 had been transferred to her.",
        "HDB’s letter on the caveat": "14     On 20 November 2009, HDB sent a letter to the Complainant informing her that a caveat (for a loan of $10,000) had been lodged against the Flat by Heedmasters (“the Caveat”). That letter went on to state that the HDB would not be able to process the application for the sale of the Flat unless the Caveat was withdrawn. It also noted that the Complainant had engaged a solicitor to Act for her in the sale of the Flat. In fact, the name of the Firm was indicated at the bottom of the letter as the letter was copied to the Firm as well.",
        "Subsequent events in 2010 leading to the sale completion": "15     By a letter dated 11 February 2010, the Firm wrote a letter (which was signed by the Respondent) to HDB stating that it had “taken [the Complainant’s] instructions on the matter and that [the Complainant and the buyers] are agreeable to complete on 25 March 2010”. A similar letter was sent to the Central Provident Fund (“CPF”) Board to give the latter notice to “discharge the [CPF charge] on the [Flat]”. HDB replied to the Firm on 13 February 2010 stating its in-principle approval for the resale transaction of the Flat to the buyers. 16     On 8 March 2010, HDB forwarded the Transfer instrument for the Complainant’s execution to the Firm. The Firm replied to HDB by way of a letter dated 18 March 2010, with a signed copy of the Transfer instrument (ie, with the Complainant’s signature) attached. 17     By a letter dated 22 March 2010, the Firm asked Heedmasters’ solicitors, TH Tan Raymond & Co (“TH Tan”), to withdraw the Caveat so as to enable completion of the sale of the Flat to take place on 25 March 2010. It also asked how much would be payable to Heedmasters on 25 March 2010. On the same day, TH Tan informed the Firm that it would withdraw the Caveat upon receipt of the Firm’s undertaking to pay $25,939.43 to Heedmasters and $500 to TH Tan (“the undertaking”). The Firm responded by furnishing the undertaking to TH Tan. It is disputed whether the undertaking was given with the Complainant’s knowledge and consent. 18     Completion of the sale of the Flat duly took place on 25 March 2010. On completion, the Firm received HDB’s cheque for the balance sale proceeds in the sum of $55,986.07 and the completion account.",
        "Events after the sale completion": "19     The Complainant sent the Respondent a letter dated 25 March 2010 (“the 25 March 2010 letter”) which was delivered on the morning of 26 March 2010. The 25 March 2010 letter was drafted by one Fadil of Billal & Co (who was also known as Sheik Nawaz) to revoke the Firm’s authority to deduct and/or disburse the sale proceeds to any party, and to instruct the Firm to forward the sale proceeds, less the Firm’s conveyancing fees of $1,200, to thenew solicitorsacting for the Complainant, Anthony & Co. The Complainant signed that letter on her own behalf as well as for Norazman. The 25 March 2010 letter was followed shortly by a letter dated 26 March 2010 from Anthony & Co to the Firm, essentially repeating the same points in the 25 March 2010 letter. 20     The Respondentreplied to Anthony & Coon the same day (ie, 26 March 2010) stating that the Firm had obtained instructions from the Complainant to give an undertaking to TH Tan, and the Firm would therefore be unable to comply with Anthony & Co’s request. Anthony & Co replied on 30 March 2010 and denied that the Complainant had given instructions to the Firm to give the undertaking, demanded payment of the unclaimed sums, and stated that the Complainant had borrowed $10,000 but had been made to sign documents for $19,000 instead. 21     The contents of Anthony & Co’s letter dated 30 March 2010 were subsequently reiterated by the Complainant in her last letter to the Firm (dated 21 April 2010), in which the Complainant claimed that she “did not meet [the Respondent] at any material time let alone [gave him instructions to give an undertaking to TH Tan]”.",
        "The legal proceedings and consent order": "22     On 11 May 2010, the Firm issued Originating Summons No 168 of 2010 (“the OS”) in the Subordinate Courts, with itself as the plaintiff and Norazman, the Complainant, Heedmasters and Happiness as the defendants. In the OS, the Firm prayed that the balance surplus sale proceeds of the Flat held by the Firm be paid into court in order for the defendants’ conflicting claims to be resolved. On 20 May 2010, Heedmasters commenced proceedings in District Court Suit No 1616 of 2010 (“the DC Suit”) against the Complainant for $19,000, being the total sum of the two loans of $10,000 (which was given on 26 September 2009) and $9,000 (which was given on 9 October 2009), as well as for the respective interest amounts. 23     On or about 14 January 2011, the OS and the DC Suit were settled on the following terms in a consent order recorded in the OS: thatthe Complainant would pay Heedmasters the sum of $10,000 and interest of $1,175 in full and final settlement of Heedmasters’ claims against the Complainant, as well as $2,000 to Heedmasters in full and final settlement of Heedmasters’ claim on another loan that had been extended to the Complainant’s mother; the Complainant would pay $4,540 to Happiness in full and final settlement of its agent’s commission at 2%; that the Complainant would pay $1,500 to the Firm for its conveyancing fees; that the costs of the OS be fixed at $1,000 to be paid by the Complainant to the Firm; and that the balance of $35,771.07 be paid to the Complainant. The DC Suit by Heedmasters against the Complainant was accordingly discontinued.",
        "The charges against the Respondent": "24     By a letter dated 16 June 2010, the Complaint made a formal complaint against the Respondent to the Law Society. Following the report of the Inquiry Committee, the Law Society formulated three charges against the Respondent, as follows: FIRST CHARGE That you, Udeh Kumar s/o Sethuraju, are charged with grossly improper conduct in the discharge of your professional duty as an advocate and solicitor of the Supreme Court of Singapore as set out in section 83(2)(b) of the Legal Profession Act (Chapter 161) in that, whilst you acted for the Complainant in respect of the sale of the flat at Block 504, Bedok North Street 3, #11-126, Singapore 46504, you failed to advance the Complainant’s interests unaffected by your own interest and the interest of any other person, by acting in or preferring your own interest and/or the interest of Heedmasters, Haron and/or Happiness. OR IN THE ALTERNATIVE That you, Udeh Kumar s/o Sethuraju, are charged that, whilst you acted for the Complainant in respect of the sale of the flat at Block 504, Bedok North Street 3, #11-126, Singapore 46504, you failed to advance the Complainant’s interests unaffected by your own interest and the interest of any other person, by acting in or preferring your own interest and/or the interests of Heedmasters, Haron and/or Happiness, thereby breaching rules 25(a) and/or 25(b) of the Legal Profession (Professional Conduct) Rules (Chapter 161, Section 71), such breach amounting to improper conduct or practice as an advocate and solicitor within the meaning of section 83(2)(b) of the Legal Profession Act (Chapter 161). OR IN THE FURTHER ALTERNATIVE That you, Udeh Kumar s/o Sethuraju, are charged with conduct unbefitting an advocate and solicitor in the discharge of your professional duty as an advocate and solicitor of the Supreme Court of Singapore as set out in section 83(2)(h) of the Legal Profession Act (Chapter 161) in that, whilst you acted for the Complainant in respect of the sale of the flat at Block 504, Bedok North Street 3, #11-126, Singapore 46504, you failed to advance the Complainant’s interests unaffected by your own interest and the interest of any other person, by acting in or preferring your own interest and/or the interest of Heedmasters, Haron and/or Happiness. SECOND CHARGE That you, Udeh Kumar s/o Sethuraju, are charged with grossly improper conduct in the discharge of your professional duty as an advocate and solicitor of the Supreme Court of Singapore as set out in section 83(2)(b) of the Legal Profession Act (Chapter 161) in that, in breach of rule 11A(2)(f) of the Legal Profession (Professional Conduct) Rules (Chapter 161, Section 71), you did not communicate directly with the Complainant to obtain or confirm her instructions in the course of providing advice and at appropriate stages relating to the sale of her flat at Block 504, Bedok North Street 3, #11-126, Singapore 46504, where there is reason to believe that the Complainant was referred to you or your firm (S. K. Kumar & Associates) by a third party. OR IN THE ALTERNATIVE That you, Udeh Kumar s/o Sethuraju, are charged with conduct unbefitting an advocate and solicitor in the discharge of your professional duty as an advocate and solicitor of the Supreme Court of Singapore as set out in section 83(2)(h) of the Legal Profession Act (Chapter 161) in that, in breach of rule 11A(2)(f) of the Legal Profession (Professional Conduct) Rules (Chapter 161, Section 71), you did not communicate directly with the Complainant to obtain or confirm her instructions in the course of providing advice and at appropriate stages relating to the sale of her flat at Block 504, Bedok North Street 3, #11-126, Singapore 46504, where there is reason to believe that the Complainant was referred to you or your firm (S. K. Kumar & Associates) by a third party. THIRD CHARGE That you, Udeh Kumar s/o Sethuraju, are charged with conduct unbefitting an advocate and solicitor in the discharge of your professional duty as an advocate and solicitor of the Supreme Court of Singapore as set out in section 83(2)(h) of the Legal Profession Act (Chapter 161) in that, in breach of rule 17 of the Legal Profession (Professional Conduct) Rules (Chapter 161, Section 71), you did not keep the Complainant reasonably informed of the progress of the sale of her flat at Block 504, Bedok North Street 3, #11-126, Singapore 46504.",
        "A summary of the charges": "25     As can be seen, the first charge centres on the issue of an allegedconflict of interestsinvolving the Respondent on the one hand anda third partyon the other (“the First Charge”). The second charge relates to the advocate and solicitor’s duty (pursuant to r 11A(2)(f) of the Legal Profession (Professional Conduct) Rules (Chapter 161, Section 71) (“the Rules”)) to communicate directly with his or her client (“the Second Charge”). The third charge relates to the advocate and solicitor’s duty (pursuant to Rule 17 of the Rules) to keep his or her client reasonably informed (“the Third Charge”). 26     It is well-established that, in proceedings of this nature, the Law Society (the Applicant in this case) must establish its case against the advocate and solicitor concerned (the Respondent in this case)beyond a reasonable doubt(see, for example,Law Society of Singapore v Ahmad Khalis bin Abdul Ghani[2006] 4 SLR(R) 308 at [6] and, most recently,Law Society of Singapore v Wan Hui Hong James[2013] SGHC 85 at [46]–[52]). This naturally entails the adducing of relevant evidence sufficient to meet this standard of proof. Although these are simple propositions, they are of the first importance and cannot be taken for granted. Indeed, the fundamental importance of these propositions as applied in a practical context will, in fact, be driven home in relation to the DT’s findingsvis-á-visone of the charges against the Respondent.",
        "The Disciplinary Tribunal’s decision": "",
        "The First Charge": "45     In its essence, the Respondent’s defence with respect to this particular charge was a straightforward one: He wascompletely uninvolvedin – and, hence,ignorant of –the loan transactions between the Complainant and Heedmasters. Counsel for the Respondent, Mr Francis Xavier SC (“Mr Xavier”), therefore argued that in the circumstances there could be no conflict of interests, as the factual basis which is a pre-requisite before such a conflict can be found did not exist in the first place. In addition to the precise analysis of the relevant facts, such an argument also raises two broader issues of principle to which our attention first turns. Two broader issues of principle 46     The first issue of principle is related to the more specific issue of factual analysis referred to at the end of the preceding paragraph. Indeed, it is an overarching principle which leads to (and in fact, mandates) the analysis which must face every court or tribunal in a situation where a conflict of interests involving an advocate and solicitor is alleged. Put simply, a meticulous and granular analysis of all the relevant facts is imperative. Although the application of the general law to the particular facts is an obvious approach in virtually any given legal case, the process of detailed factual analysis is of particular importance in such a situation. 47     As already noted above (at [26]), the standard of proof placed upon the applicant is a high one,viz, proof beyond a reasonable doubt. It is therefore imperative that sufficient evidence be adduced to satisfy this standard of proof. This in turn entails the establishment of,inter alia,the precise relationshipswhich are said to have resulted in a conflict of interests situation involving the advocate and solicitor in question. 48     The second broader issue of principle relates to the kind of ignorance which would suffice to excuse the advocate and solicitor concerned where an allegation of a conflict of interests is involved. As we will elaborate upon below, the argument from ignorance cannot be used by the advocate and solicitor concerned as a cloak for the dereliction of his or her duty to the client. At the very least, ignorance can – and will – constitute the basis for other charges (such as the Second and Third Charges which were also proffered against the Respondent in the present proceedings). More importantly, if the precise facts justify a finding ofwilful blindnesson the part of the advocate and solicitor concerned, then that advocate and solicitor cannot utilise (literal) ignorance as an excuse in a charge involving an alleged conflict of interests – or, we might add, any other charge for that matter. As already mentioned, we will return to this particular issue in more detail later. Let us turn, first, to the facts of the present case. Analysis of and decision on the First Charge 49     It is paramount, in our view, to commence our analysis of Issue 1 by identifying who precisely the third party was alleged to be in the context of the present proceedings. We would observe – parenthetically – that, although it is possible for an advocate and solicitor to find himself or herself in a conflict of interests situationvis-á-vishis or her clientwith no third parties involved, this is not the fact situation envisaged in the First Charge. In the circumstances, therefore, it isnecessaryto identify the third party, in the absence of which there would be no factual basis for ascertaining whether the Respondent was in fact in a conflict of interests situation in the first place. 50     Looking closely at the First Charge, a clear possibility of a third party is Heedmasters and/or Peh. However, if this is the case, it is our view that the evidence demonstrating that the Respondent did in fact have a relationship with Heedmasters and/or Peh is virtually non-existent. As we pointed out to both counsel during oral submissions, the only finding to this effect in the Report was to be found in only one short paragraph, as follows (see the Report at [172]): Second, we do not accept that the Respondent did not know Peh. The Respondent said that while in 2009 he had acted for Happiness and Haron in “maybe, one or two cases”, he did not know Peh. But this claim did not sit well with his remark in an unguarded moment during cross examination when he voluntarily referred to Peh as “Desmond Peh”, suggesting a familiarity beyond that which he was prepared to admit at the hearing. 51     With respect, we do not think that this constitutes sufficient evidence to establish the necessary causative relationship in the context of what is required in the present proceedings between the Respondent on the one hand and Peh on the other – particularly when we bear in mind that the standard of proof that is required to be satisfied by the Applicant is that beyond a reasonable doubt. Indeed, Mr Xavier referred us during oral submissions to a letter from the Respondent’s firm to Peh to explain how Peh’s full name (and nothing else which suggested a personal relationship as such) might have come to be known by the Respondent. We also note Mr Xavier’s submission to the effect that Peh, having already been served with a subpoena by the Applicant, could have been called as a witnessby the Applicantbut was not. 52     Counsel for the Applicant, Mr Tan Tee Jim SC (“Mr Tan”), however, sought to argue that the Respondent ought to have known about the loan transactions or ought to have investigated further after Elly had passed the relevant documents to him. Mr Tan further submitted that, had the Respondent investigated further, he would then have known about the loan transactions between the Complainant and Heedmasters. However, Mr Xavier submitted (correctly, in our view) that there was no evidence on record to show that Elly had handed copies of documents with respect to the loan transactions to the Respondent. More importantly, the Applicant did not furnish any concrete evidence which would convincingly suggest that the Respondent hadwilfullychosen not to know about the loan transactionsin order to further the interests of Heedmasters. 53     What, then, about Haron and/or Happiness? As the DT itself noted in a passage which was already cited (see the Report at [172], cited above at [50]), the Respondent did admit to having acted for Haron and Happiness on one or two occasions. However, unlike, for example, the clear pattern of clearly unacceptable transactions inVardan Vasantha, where there was a clear “standing arrangement” between the advocate and solicitor in question and the third party whose interests she was accused of advancing (at [30]–[31]), there is no evidence on record of a similar pattern of such conduct in the present case. Put simply, the fact that the Respondent might have acted for Haron and Happiness on one or two occasions in the past was neither here nor there. In the absence of evidence to the contrary, this court cannot assume that those transactions were tainted in any way, let alone that they constituted a pattern of misconduct that was therefore relevant in the context of the present proceedings. 54     For the Respondent to have a duty to disclose his relationship with Haron to the Complainant, it must first be shown thatthe Respondent knew of (or was wilfully blind to)the following alleged facts which were accepted by the DT: (a) that Peh owned 49% of Happiness, (b) that it was in Haron’s interest to recommend the Complainant to Peh, and (c) that Peh told the Complainant that she had to appoint the Respondent (ie, the appointment issue above at [27]). However, there was similarly insufficient evidence to demonstrate that the Respondent knew of (or was wilfully blind to) these alleged facts. Given this lack of evidence, it cannot be said with certainty that the Respondent was aware of howHaron’s interestwas being advanced at all in the various transactions that had taken place. While the DT did make some findings on the conduct of Haron/Happiness in relation to the loan transactions (see the Report at [115]–[117], [144], [164] and [171]), what was crucially missing is strong evidence demonstrating the Respondent’s knowledge or acquiescence to it. The key inquiry rests, in the final analysis, onthe Respondent’sperspective and conduct and, as we have just mentioned, there is no evidence on record of any wrongdoing by the Respondent as suchin relation to the First Charge. 55     In summary, therefore, the factual basis for a conflict of interests situation involving the Respondent in the context of the present proceedings is, in our view, clearly absent. In the circumstances, we find that the Respondent is not guilty of the First Charge. 56     We shall now touch briefly on the situation (albeit not present on the evidence before this court) where the court finds that an advocate and solicitor was aware of circumstances which would reasonably have raised concerns of apotentialconflict of interests, but nevertheless chose to be silent in order to (literally) avoid any charge along the lines of the First Charge in this case. In our view, the advocate and solicitor concerned in such a situation would be guilty ofa conflict of interest notwithstanding his or her wilful blindness as to the true facts, as he or she was clearly suspicious that something was amiss but deliberately chose to turn a blind eye in order to avoid confirming that his or her client’s interest might have been prejudiced in favour of either a third party or his (or her) own. It has been well established that the concept of wilful blindness in criminal proceedings isthe legal equivalentofactual knowledge(see, for example, the decision of the Singapore Court of Appeal inTan Kiam Peng v PP[2008] 1 SLR(R) 1 at [96]–[141]), and we are unable to see why the same legal inference should not be drawn in quasi-criminal proceedings such as the present (seeThe Law Society of Singapore v Chhabra Vinit[2011] SGDT 8, where the concept was applied to a disciplinary proceeding against an advocate and solicitor similar to the present instance). However, whether or not there has in fact been wilful blindness on the part of the advocate and solicitor concerned is a fact-sensitive inquiry, for which theproper adducing and careful analysing of precise evidencewill be of crucial importance. 57     In the present case, for example, it was, in fact, open to the Applicant to adduce evidence of wilful blindness on the part of the Respondent. However, this did not appear to be an explicit case theory advanced by the Applicant in the proceedings before the DT (a point which Mr Xavier vigorously made when asked to consider this particular issue in the context of the present proceedings). Hence, it was not surprising that there was no evidence on record before us which would have allowed us to consider this particular point. That having been said, it bears reiterating that if,in fact, an advocate and solicitor is guilty of wilful blindness on the facts of a particular case, it will not avail him or her to ensure that he or she has nothing (literally speaking) to do with the transaction in question, and then claim that he or she was not in a position of conflict of interests as he or she was ignorant – albeit wilfully – of that particular transaction. Indeed, such conduct is not only deplorable but also completely anathema to the nobility and professionalism that are the hallmarks of an honourable profession. As mentioned above at [56], such a conduct, if found, will render the concerned advocate and solicitor guilty ofwilful blindness amounting to a conflict of interestsand liable to sanctions of equal measure to that of an advocate and solicitor who had acted in a conflict of interests situation with actual knowledge.",
        "The Second Charge": "The law with regard to r 11A(2)(f) 58     The analysis of the conduct of the Respondent in relation to the Second Charge can be brief simply because the Respondent himself eventually admitted to it (see above at [41]). However, in his written submissions, the Respondent did raise an issue in relation to the interpretation of r 11A(2)(f) (see above at [41]) which is of general significance for future cases and we therefore find it necessary to address it accordingly. Rule 11A itself reads as follows: Touting and referrals 11A.—(1) An advocate and solicitor or a law practice shall not tout for business or do anything which is likely to lead to the reasonable inference that it is done for the purpose of touting. (2) Without prejudice to the generality of paragraph (1), where there is reason to believe that a client is referred to an advocate and solicitor or a law practice by a third party,the advocate and solicitoror law practice, as the case may be,shall— (a)    maintain the independence and integrity of the profession and not permit the referror to undermine the professional independence of the advocate and solicitor or law practice; (b)    not reward the referror by the payment of commission or any other form of consideration; (c)    not allow the referral in any way to affect the advice given to such client; (d)    advise the client impartially and independently and ensure that the wish to avoid offending the referror does not in any way affect the advice given to the client; (e)    ensure that the referror does not in any way influence any decision taken in relation to the nature, style or extent of the practice of the advocate and solicitor or law practice; and (f)communicatedirectlywith the client to obtain or confirm instructions in the process of providing advice and at all appropriate stages of the transaction. [emphasis added in italics, bold italics and underlined bold italics] 59     The relevant legal question which arises from Issue 2 is whether or not the obligations of the advocate and solicitor concerned can be delegated to an employee of the law firm who is not himself or herself an advocate and solicitor. 60     InLaw Society of Singapore v Liew Boon Kwee James[2006] SGDSC 9, the Disciplinary Committee (“DC”), as it was then known, appears to have accepted that an advocate and solicitor neednot personally attendto the clients concerned as his conveyancing secretary had properly attended to them (at [37]). However, it is important to note that, in that particular case, there wasno clear evidencethat the clients had beenreferred by a third partyto the advocate and solicitor concerned and the DC also did not appear to have considered whether r 11A(2)(f) had been breached. 61     Despite the dearth of case law authority, it seems to us that, as a matter of general principle (and, indeed, first principles), the advocate and solicitor concerned ought to be undera personal responsibilitytocommunicate directly with the clientwhen the client is referred to the advocate and solicitor by a third party.Indeed, this appears to be what the literal language of r 11A(2)(f) itself demands, particularly if one has regard to the word “shall” in relation to the advocate and solicitor’s conduct as well as to the need for such conduct to consist in the advocate and solicitor communicating “directly” with the client. More importantly, however, is the fact that such a duty arises in the context ofa referral by a third party. In the circumstances, therefore, it is both logical as well as commonsensical to require the advocate and solicitor concerned to undertakea personal responsibilityto communicate directly with the referred client to ensure that everything is in order – particularly since there is a greater danger that such a client might bein a vulnerable position. The advocate and solicitor, with “his position as a fiduciary and his standing as a professional” (see Jeffrey Pinsler,Ethics and Professional Responsibility: A Code for the Advocate and Solicitor(Academy Publishing, 2007) at para 17-002) mustpersonallyensure that the referred client’s interests are not in any way undermined by those of the referror. This probably explains why r 11A(2)(f) was expressly promulgated notwithstanding the fact that such a situation could arguably be covered by the general rules concerning the avoidance of conflict of interests (ie, r 25 of the Rules) as well as the obligation to be diligent and competent (ie, r 12 of the Rules). 62     We also reject the Respondent’s reliance on the phrase “or law practice, as the case may be” to suggest that the obligation in this particular rule need not attach to an advocate and solicitor. An appropriate construction – consistent with the approach we have adopted in relation to r 11A(2)(f) – is that this particular phrase permitsother advocates and solicitorsin thesamelaw practice to communicate directly with the client concerned in the event that the advocate and solicitor concerned leaves the firm or is otherwise temporarily occupied with other matters. 63     However, we would also hasten to add that, as with all legal rules and principles, r 11A(2)(f) ought not to be interpreted – let alone applied – in a dogmatic or mechanistic fashion. As this court has observed (inLaw Society of Singapore v Tan Phuay Kiang[2007] 3 SLR(R) 477 (“Tan Phuay Kiang”) at [100]): It is also axiomatic that it isthe spirit and intent, rather than just the plain letter, of the professional ethical rules that breathe life and legitimacy into the standards that are relevant in assessing whether a lawyer has discharged his professional obligations. [emphasis added] 64     In particular, we are of the view that it is unnecessary for the advocate and solicitor concerned to attend to every single detail of the transaction in question with his or her client. However, it is clear that, at the very outset of the relationship, the advocate and solicitorshould in fact meet personally with the client and also thereafter whenever it is necessary. In this latter regard, whether the advocate and solicitor’s personal presence is required (or whether the task at a given stage of the transaction can be reasonably delegated to his or her employee) would depend very much on the nature of the transaction and the action required, as well as the accepted practice (if any) in the legal profession at that particular point in time. In this last-mentioned regard, it is significant, in our view, that r 11A(2)(f) refers,inter alia, to “allappropriatestages of the transaction” [emphasis added]. As a general rule of thumb, what is permitted, in the final analysis, is reasonable delegation. What, however, isnotpermitted is substantial (or even total) abdication of his or her responsibility to the client in relation to the duty under this particular rule. Application of the law to the facts 65     It is pertinent to note that in the present case, the Respondent not only failed to personally attend to the Complainant on 8 October 2009 but also did not bother to attend or meet or communicate directly with the Complainantat allthroughout the period of the retainer. Indeed, even after the Complainant had sent a personal letter to the Firm on the morning of 26 March 2010 revoking the Respondent’s authority to “deduct and/or disburse any part of our sales proceeds to any parties” (which, according to the Respondent, contradicts the Complainant’s own earlier instructions), there is no evidence that the Respondentpersonallytried to communicate directly with the Complainant to clarify the matter. It is also important to point out that, for matters on and beyond 26 March 2010, the Respondent ought not to be permitted to use Elly as a convenient excuse for his failure to communicate directly with the Complainant as Elly had testified in her own Affidavit of Evidence-in-chief that after being “surprised with [the Complainant’s] sudden change of instructions [on 26 March 2010] ... I then left the matters to [the Respondent]”. 66     It should therefore come as no surprise that the Respondent has chosen not to challenge the Second Charge in the present proceedings (see above at [41]). He has been guilty of a total abdication of his duty pursuant to r 11A(2)(f). This complete dereliction of duty is most deplorable and clearly constituted “grossly improper” conduct within the meaning of s 83(2)(b) of the Act, as the systematic, consistent nature of the Respondent’s breach of his duty over a period of a few months was certainly more than an oversight or mere negligence on his part (see alsoRe Lim Kiap Khee[2001] 3 SLR 616).",
        "The Third Charge": "67     The Third Charge relates to r 17 of the Rules (“r 17”), which reads as follows: Keeping client informed 17.An advocate and solicitor shall keep the client reasonably informed of the progress of the client’s matter. 68     Since it is not disputed that the Respondent had made no effort at all to communicate with the Complainantat all material times, the DT was justified, in our view, in finding that the Respondent had also breached r 17 in failing to keep the Complainant reasonably informed of the progress of the sale of the Flat. 69     In this regard, the Respondent’s argument to the effect that r 17 could be satisfied on the facts of this case by Elly’s actionsalonewasnotone which we could accept – not at least in the context of thetotalfailure by the Respondent to communicate with the Complainant. Once again (and consistent with our observations in relation to r 11A(2)(f) above at [64]), whilst it is unnecessary for the advocate and solicitor concerned (here, the Respondent) topersonallykeep the client (here, the Complainant) reasonably informed ateverystage of the transaction (here, the progress of the sale of the Flat), it is wholly unacceptable when, as is the case here, the advocate and solicitor simply abdicates his duty altogether. Once again, however, what can be reasonably delegated to the advocate and solicitor’s employee would depend very much on the nature of the transaction and the action required, as well as the accepted practice (if any) in the legal profession at that particular point in time (see also above at [64] in relation to r 11A(2)(f)). 70     Finally, we also pause to observe that, even allowing for the fact (as noted above) that the dissemination of certain routine information need not be carried out personally by the advocate and solicitor, the fact remains that, in the context of the present case, there is, in any event,no objective evidencesupporting Elly’s claim that she had contacted the Complainant throughout the material period to inform her about: (a) the Caveat being lodged; (b) the Completion Date being brought forward to 25 March 2010; (c) the Transfer Instrument that has to be signed; and (d) the undertaking that was issued. Indeed, we also note that there was an entire absence of any attendance/correspondence notes which could have supported the Respondent’s case in this particular regard. In our view, this is precisely the reason why this court had earlier stressed the importance of an advocate and solicitor keeping “attendance notes and contemporaneous written records”, the failure of which could justify an adverse inference being drawn against the advocate and solicitor (Tan Phuay Khiangat [82]) and even a total rejection of the advocate and solicitor’s version of events (Tan Phuay Khiangat [86]). In our view, a similar adverse inference against the Respondent should be drawn in the present case in relation to Issue 3. 71     In the circumstances, it is clear that the Respondent is guilty of the Third Charge.",
        "The parties’ submissions": "",
        "The Applicant’s submissions": "37     In its submissions, the Applicant generally reiterated and affirmed the DT’s reasoning and conclusion. 38     To support the conviction of the Respondent on the First Charge, the Applicant relied onLaw Society of Singapore v Vardan Vasantha Lakshmi[2007] 1 SLR(R) 240 (“Vardan Vasantha”) to argue that the First Charge against the Respondent can be supported by the Respondent’s failure to: (a) disclose his relationship with Happiness/Haron to the Complainant; (b) meet the Complainant despite the latter’s vulnerability; and (c) prevent Heedmasters and Haron from using his office to make the Complainant sign documents that were prejudicial to her. 39     To support the conviction of the Respondent on the Second and Third Charges, the Applicant highlighted the fact that the Respondent did not meet the Complainant concerning the sale of the Flat, nor was there any attendance note or document at all demonstrating that the Respondent kept the Complainant informed of the progress of the sale.",
        "The Respondent’s submissions": "40     In so far as the First Charge was concerned, the Respondent submitted that he did not act for Heedmasters in respect of the loan transactions and that, crucially, there wasinsufficient evidence that the Respondent had somehow preferred the interests of Haron and/or Happiness over that of the Complainant. The Respondent also submitted that the Complainant was clearly aware (as at 8 October 2009) that she had executed documents confirming that she had taken two loans totalling $19,000, and that he had no prior relationship with Heedmasters which was necessary in order to amount to a relevant conflict of interests. 41     In so far as the Second Charge was concerned, the Respondent “unreservedly accept[ed]” that he had failed to communicate directly with the Complainant but urged the court to consider various mitigating circumstances. The Respondent also submitted that the DT had erred in law in construing r 11A(2)(f) as requiring a legal advisor to personally communicate directly with the client, and that it was sufficient for the obligation to be carried out by a designated employee of the law firm. 42     In so far as the Third Charge was concerned, the Respondent submitted that the Complainant had been kept reasonably informed by Elly based on events during the material period which suggested that there must have been some form of correspondence between Elly and the Complainant. 43     The Respondent therefore urged the court to dismiss the First and Third Charges, but accepted responsibility for his failing pursuant to the Second Charge.",
        "The issues before this court": "44     The issues before this court are as follows: (a)     Did the Respondent fail to advance the Complainant’s interests unaffected by his or any other person’s interest as per the First Charge such as to amount to grossly improper conduct or conduct unbefitting an advocate and solicitor as stated in the First Charge (“Issue 1”)? (b)     Did the Respondent fail to communicate directly with the Complainant in breach of r 11A(2)(f) as per the Second Charge such as to amount to grossly improper conduct or conduct unbefitting an advocate and solicitor as stated in the Second Charge (“Issue 2”)? (c)     Did the Respondent fail to keep the Complainant reasonably informed of the progress of the sale of the Flat as per the Third Charge such as to amount to conduct unbefitting an advocate and solicitor as stated in the Third Charge (“Issue 3”)? (d)     If any or all of the above charges are made out, what ought to be the appropriate sentence meted out on the Respondent (“Issue 4”)?",
        "Our decision": "",
        "Conclusion": "72     For the reasons set out above, we find the Respondent not guilty of the First Charge but guilty of both the Second Charge as well as the Third Charge. 73     We note, once again, that the Respondent did not seek to contest the Second Charge which, relative to the Third Charge, was, in our view, the more serious one. However, despite this mitigating factor, we are compelled to observe that the Respondent’s dereliction of duty was extremely serious, constituting, as it did, a total abdication of his duty in this particular regard (see above at [65] and [66]). Indeed, it was the veryantithesisof what an appropriate lawyer-client relationship should be. We have also found the Respondent guilty under the Third Charge as well. 74     In the circumstances, we are of the view that an appropriate sanction against the Respondent would be a suspension from practice for three months. We should add that, should an advocate and solicitor be found guilty of a similar offence in future cases, the sanction could be much more severe. Taking into account all the circumstances, and given that the Applicant did not succeed in establishing the primary or most serious charge (ie, the First Charge), we order that the Applicant is only entitled to half of the costs of the proceedings both here as well as before the DT. The period of suspension is to commence one month from the date of this judgment or on any other date as directed by this court pursuant to a request by the Respondent."
    }
}