{
    "case_title": "Ong Hong Kiat\n      v\n      RIQ Pte Ltd",
    "ncitation": "[2013] SGHC 131",
    "coram": "Quentin Loh J",
    "sections": {
        "The Issues": "3       The issues arising from both OS 352 and OS 460,\n                    as framed by the parties, are as follows: (a)     Issue 1: Whether there was a\n                        concluded agreement between the parties for the sale of the\n                    Shares. (b)     Issue 2:\n                        Whether such an agreement was rescinded by mutual agreement of the\n                        parties. (c)     Issue\n                        3: Whether such an agreement had been abandoned by the\n                    parties. (d)     Issue 4:\n                        Whether Mr Ong was entitled to access RIQ’s accounting and other\n                        records relating to the financial position of RIQ.",
        "The facts": "4       The background facts in [4]–[8] are not\n                    really in dispute; insofar as they are, they constitute my findings of fact.\n                    What follows after [8] also contains my findings of fact. RIQ was incorporated\n                    in Singapore on 13 May 1995, and was involved in the repair, installation and\n                    commissioning of marine navigation and communication equipment on board marine\n                        vessels.[note: 1]Mr Lim was appointed a director of RIQ on\n                    28 April 1998, and Mr Ong was appointed a director of RIQ on 19 January\n                        2001.[note: 2]It is undisputed that before 2012, Mr Lim\n                    was the majority shareholder holding 325,000 (65%) shares in RIQ whilst Mr Ong\n                    held 175,000 (35%) shares in RIQ. They were the only shareholders. Mr Lim\n                    accordingly had the final say in matters relating to RIQ. 5       Mr Ong and Mr Lim were introduced to one another\n                    in 1998, and were, at that time, operating their own businesses in the marine\n                    equipment industry. After two years of working with each other, Mr Lim invited\n                    Mr Ong to join him to work in RIQ.[note: 3]The arrangement between the two parties was that\n                    Mr Lim would manage the marketing efforts of RIQ which would require him to\n                    travel abroad, while Mr Ong would manage the “day-to-day\n                    operations” of RIQ in Singapore.[note: 4]Mr Ong’s wife, Betsy Oh Siew Har\n                    (“Betsy”), also worked in RIQ as its accountant from about 2007.\n                    The relationship between Mr Lim and Mr Ong was an easy one based on\n                    trust. 6       Some strain between them had developed in the\n                    period of time leading up to the events in February and March 2012. The reasons\n                    for this are not relevant but the real trouble started when Betsy informed Mr\n                    Lim that the company had recorded a loss of $300,000 for the financial year\n                    ending August 2011. Mr Lim was surprised and disappointed by this\n                        news.[note: 5]However, this loss of $300,000\n                    became a source of suspicion for Mr Lim when he noticed that RIQ’s draft\n                    financial statements in February 2012 recorded a profit of $769,558.[note: 6] 7       On or about 19 February 2012, Mr Lim discovered\n                    that a sum of $980,000 had been paid into his personal bank account from RIQ.\n                    When he queried this, Mr Lim found that $980,000 had been paid both to him and\n                    Mr Ong for directors’ fees and remuneration. Of the $980,000, $180,000 had\n                    been booked as the annual salary of the directors, while the remaining $800,000\n                    was booked as directors’ fees. These payments were effected by Mr Ong\n                    without Mr Lim’s consent or approval, and were not authorised by any\n                        resolutions.[note: 7]Having been under the\n                    impression that RIQ had made a loss in the financial year ending 31 August 2011,\n                    Mr Lim was therefore surprised that this large sum of money had been paid out to\n                    the directors. This, subsequently, became an issue between the parties and it\n                    led to the sudden resignation of Betsy, who was in charge of the RIQ’s\n                    accounts. Mr Lim said this happened in the course of him pressing her to explain\n                    the large payments. 8       Mr Lim also gave evidence that these large\n                    payments and the way they were booked would mean that RIQ was operating at a\n                    loss for that financial year and that would have an adverse effect on their\n                    relationship with the bankers, both in the present and the future, as well as\n                    RIQ’s reputation when trying to secure business.[note: 8]Furthermore, the General Manager of RIQ, Mr Abdul Jaleel S/O Mohamed Ally\n                    (“Mr Jaleel”), gave evidence that in and around that period of\n                    time, RIQ had also lost their dealership with a major supplier which accounted\n                    for a significant amount of their annual turnover.[note: 9]I accepted the evidence\n                    of Mr Lim and Mr Jaleel on these matters as they made commercial sense, and\n                    found that they constituted important background to the dispute.",
        "The events in and around 22 February 2012": "9       There was a meeting on 21 February 2012 between\n                    Mr Lim and Mr Ong at the RIQ office where Mr Ong wanted to be bought out of RIQ\n                    by Mr Lim at a very high price. There were obviously fairly severe disagreements\n                    between the parties: Mr Lim was dissatisfied that Mr Ong’s work was 3\n                    months behind schedule, that Mr Ong wanted to be bought out and at a very high\n                    price, and that there were large payments out of RIQ without Mr Lim’s\n                    consent or authorisation. Mr Lim admitted that the large payments out of RIQ\n                    were the subject of their biggest quarrel in all their years working together.\n                    Mr Jaleel’s evidence, which was not challenged, was that the staff told\n                    him there were voices raised at the meeting which troubled them. It is not\n                    disputed that Betsy resigned from RIQ suddenly with effect from 21 February\n                    2012. This was after she was called into the meeting and queried over the\n                    payments. 10     This was followed by another meeting on 22\n                    February 2012 which ended with Mr Lim making an offer to purchase the Shares at\n                    $200,000, with Mr Ong being allowed to keep the car which had been bought by RIQ\n                    for his use (“the Car”).[note: 10]At this meeting, it\n                    was not mentioned between the parties that Mr Ong would have to pay back to RIQ\n                    the directors’ fee of $800,000 which he had caused to be paid out to both\n                    of them without proper authorisation or agreement.[note: 11] 11     According to Mr Lim’s evidence, Mr Ong\n                    accepted this offer and as a result, surrendered his company credit card and\n                    office keys to Mr Lim. Mr Ong’s evidence was that he never accepted any\n                    such offer. He handed over the office keys because he thought that Mr Lim had\n                    forgotten to bring his own set of keys and wanted to borrow Mr Ong’s set,\n                    while the company credit card was not really used anyway and so Mr Ong just\n                    handed it over.[note: 12]I found Mr Ong’s explanation of\n                    the incident to be, to say the least, incredible. This kind of evidence is one\n                    of the factors that made me prefer Mr Lim’s version of events when it\n                    conflicted with Mr Ong’s.",
        "The events in between 22 February 2012 and 18 March 2012": "12     After 22 February 2012, notwithstanding that\n                    there were controversies as to whether Mr Ong had effectively resigned as a\n                    director of RIQ, the company register still reflected that he was a director of\n                    RIQ. This meant that Mr Ong was still required to sign off on company\n                        cheques.[note: 13]This was also\n                    supported by the SMS exchange between Mr Ong and Mr Lim on 24 February\n                    2012: Mr Lim to Mr Ong at 1:35pm: We need you to sign more cheque [sic] for\n                        salary n supplier payment n also to sign the Financial Statement for 2011. I\n                        planned for the transfer to be on 5 March 0930am. Of [sic] you require I can first issue the cheque to you\n                        tomorrow. Mr Ong to Mr Lim at 2:03pm: You can sign the financial statement and ask someone to sent it to our\n                        auditor together with the cheque on Monday morning and I will it there. As\n                        for the cheque, you can ask Yoke Chen to prepare and I will sign it. I will\n                        be going to batam tomorrow morning. I will sign the financial report at auditor office on Monday\n                        morning 13     The main person to liaise with Mr Ong on the\n                    signing of the cheques was Mr Jaleel. From early March 2012 to April 2012, Mr\n                    Jaleel and Mr Ong met up frequently in order for Mr Ong to sign off on company\n                    cheques. These meetings were arranged via SMS between Mr Jaleel and Mr Ong.\n                    There was, therefore, constant contact between Mr Jaleel and Mr\n                Ong. 14     One such SMS exchange was especially\n                    important, and this was an SMS sent by Mr Jaleel to Mr Ong on 14 March 2012 at\n                    1:28pm, which reads as follows: Hi Raymond just checking if u have decided if Terry offer ok with u\n                        without the lawyer stuff as he wants to settle soonest thanks Mr Ong gave evidence in cross-examination that his understanding of\n                    the meaning of “lawyer stuff” was a provision which meant that RIQ\n                    would have no claims against Mr Ong after his resignation and vice versa\n                    (“the No Claims Condition”) (see also [24] below).[note: 14]Mr Jaleel, on the other hand, gave evidence in cross-examination that\n                    “lawyer stuff” meant that the parties should try to avoid getting\n                    lawyers involved in the matter and just settle the dispute amicably. I preferred\n                    Mr Jaleel’s evidence on this matter for obvious reasons. 15     In another two SMSs sent by Mr Jaleel,\n                    references were made to “positive news from Terry” and\n                    “Good news”. When cross-examined as to what the positive or good\n                    news might be, Mr Jaleel’s evidence was that he could not\n                remember. 16     Notwithstanding this, I found Mr Jaleel to be\n                    a credible witness. He answered questions in a straightforward manner and\n                    without prevarication. From his evidence, it was also clear that he did not take\n                    sides, as was his body language in court, towards either Mr Ong or Mr Lim. He\n                    obviously got on with the both of them. Mr Jaleel was operating at a lower level\n                    in RIQ compared to Mr Ong and Mr Lim. He did not strike me as someone with\n                    in-depth and detailed technical knowledge or having the same kind of business\n                    capability as Mr Ong or Mr Lim. He treated Mr Lim and Mr Ong as his bosses. RIQ\n                    had just lost a major customer, and a shareholder dispute (whispers of which had\n                    gone out into the industry) or a lawsuit between them was the last thing RIQ\n                    needed. He was hoping that his two bosses would settle their differences\n                    amicably and they could all move on, especially as RIQ was facing great\n                    commercial challenges.",
        "The events in and around 18 March 2012": "17     Subsequently, on Mr Lim’s request, the\n                    parties met at Tiong Bahru market on 18 March 2012. At this meeting, Mr Lim\n                    offered to increase the price he would pay for the Shares from $200,000 to\n                    $345,000. This was not disputed by Mr Ong. Mr Lim gave evidence, and I accept\n                    his evidence, that this increase in price was made in order to better reflect Mr\n                    Ong’s share of the retained earnings of RIQ. It was also Mr Ong’s\n                    own evidence that Mr Lim told him that the correct value of the Shares, having\n                    regard to the retained earnings, was $345,000.[note: 15] 18     The follow-up to this meeting took place via a\n                    series of SMS exchanges between the parties. The first SMS was from Mr Ong to Mr\n                    Lim on 19 March 2012 at 11:29am which reads: Good morning boss, after stu Good morning boss, you [sic] offer of S$145k\n                        for the S$1.1M dividends brought down is too little, thanks. Mr Lim responded via an SMS sent on 19 March 2012 at 11:47am which\n                    reads: Your dividend on 1.3mil is 455k. Your share of 1.4mil is 590k. Total is\n                        945k, amount already paid to you is 800k. Balance is 145k. If not when we\n                        recall you will need to pay back 345k being overpayment by the accountant.\n                        Please reply quickly I am out of time. 19     The context behind Mr Lim’s reply SMS\n                    was important. As a result of Mr Lim’s concern that RIQ’s balance\n                    sheet reflected a loss, Mr Lim decided to book $800,000 of the $980,000 paid out\n                    to the directors as shareholder dividends rather than to have the money\n                    accounted for as directors’ fees. The $180,000 was considered to be\n                    directors’ remuneration and would remain as they had been booked. This\n                    would ensure that RIQ would reflect a profit on its balance sheet. In working\n                    out how the dividend payments were to be structured, Mr Lim worked backwards. He\n                    took his $800,000 as dividends on his 65% shareholding; on a 100%, it would come\n                    to $1.23m which he rounded up to $1.3m,ie$2.60 a\n                    share. Mr Ong’s 35% share of the dividends would be $455,000. This meant\n                    that Mr Ong would still have $345,000 ($800,000 - $455,000) which had already\n                    been paid out to him unaccounted for.[note: 16]Mr Lim knew that\n                    Mr Ong was in possession of $345,000 which was not properly sanctioned, and was\n                    therefore using this as a bargaining tool since Mr Ong would not have wanted to\n                    pay any money back. Mr Lim referred me to the accounts for these figures and\n                    their calculation. Mr Ong would also know these figures as his wife was, until\n                    she resigned, RIQ’s accountant. 20     The SMS was also important in explaining why\n                    Mr Lim increased the initial cash offer by $145,000, from $200,000 to $345,000.\n                    According to Mr Lim’s explanation of the SMS, a number of factors were\n                    taken into account in arriving at the figure of $145,000. As already mentioned,\n                    based on a $1.3m dividend payment, Mr Ong’s 35% share would be $455,000.\n                    However, $1.6m in total (being $800,000 multiplied by two) had already been paid\n                    out by RIQ, which meant that there was an excess of $300,000 left unaccounted\n                    for. Mr Lim added the amount of $300,000 to the approximate retained earnings of\n                    $1.1m to arrive at the figure of $1.4m. Mr Ong’s 35% share of this $1.4m\n                    would be $490,000. It should be noted that Mr Lim made an error in the SMS when\n                    he wrote “Your share of 1.4mil is 590k”, which he later clarified\n                    during cross examination.[note: 17]By totalling up Mr\n                    Ong’s shares in the dividend payments and retained earnings, his 35% share\n                    in RIQ would be $945,000 ($455,000 + $490,000). Since Mr Ong was already paid\n                    $800,000, this meant that he was still owed another $145,000. It was on this\n                    basis that Mr Lim increased his offer from $200,000 to $345,000. 21     Accordingly, I found that Mr Lim’s reply\n                    SMS constituted clear and objective evidence that any offer made by Mr Lim to\n                    purchase Mr Ong’s shares also included the term that the directors’\n                    fee of $800,000 paid out to Mr Ong need not be paid back to RIQ although there\n                    might be some re-booking of those sums so as to improve the negative balance\n                    sheet (“the No Pay Back Term”). This was also supported by the\n                    fact that Mr Lim in arriving at the retained earnings value of $1.4m must have\n                    done so on the basis that the $1.6m paid out would not be recovered by RIQ,\n                    since the excess $300,000 was also divided between the parties according to\n                    their respective shares. It was clear both parties understood that Mr Ong could\n                    keep the unauthorised directors’ fee payment of $800,000 he had received\n                    from RIQ if he accepted Mr Lim’s offer. 22     After another exchange of SMSs, Mr Ong sent an\n                    SMS to Mr Lim on 19 March 2012 at 12:33pm (“the Acceptance SMS”)\n                    which reads: Boss I accept your offer ofr [sic] S$345k\n                        & all documents ready to sign at auditor office tomorrow, thanks, This was then followed-up by a further SMS exchange between Mr Ong and\n                    Mr Lim on 19 March 2012 at 12:33pm: Mr Lim to Ong: You resign as director from 22ndfeb?? Mr Ong to Lim: 29thfeb 23     I found that the SMS exchanges and the\n                    evidence given by Mr Lim on the matter were consistent with the instructions Mr\n                    Lim gave the auditors, K S Ng & Co (“K S Ng”), and the\n                    corporate secretary, Supreme Corporate Services Pte Ltd (“SCS”),\n                    via an email sent on 19 March 2012 at 4:09pm.[note: 18]The material portion of the said email is\n                    reproduced as follows: Kindly amend director’s resolution and relevant document as\n                        follows, For financial year ended [sic]\n                            31stAug 2011, a)    No director’s fee. b)    Director’s Salary to be S$12,000 per\n                            month. c)    Bonus to be 03 month of Monthly\n                        Salary Kindly also prepare the documents for a)    Declare Dividend of S$2.60 per share. b)    Ong Hong Kiat to resign as a director of RIQ Pte\n                            Ltd as of 29thFeb 2012. c)    Ong Hong Kiat will sell his 35% share in RIQ Pte\n                            Ltd for S$345,000 to Lim Siang Hwee.",
        "The events after 19 March 2012": "24     After 19 March 2012, a number of material\n                    events occurred. The first was SCS’s email of 21 March 2012, sent at\n                    9.42am, to Mr Lim, which attached the revised AGM documents reflecting that the\n                    parties would only receive $180,000 each for the financial year ending 31 August\n                    2011, the declaration of dividends of $2.60 per share for the financial year\n                    ending 31 August 2011, as well as the relevant paperwork for the resignation of\n                    Mr Ong and the transfer of the Shares.[note: 19]Importantly, Mr Ong’s draft\n                    resignation letter contained the following provision: I acknowledge that I shall henceforth have no further claims against the\n                        Company in respect of all matters and disputes which have arisen prior to\n                        this date on the understanding that the Company shall likewise have no\n                        claims whatsoever against me. This provision or other words to similar effect, was in essence the No\n                    Claims Condition (see [14] above). 25     The documents were finalised on 23 March 2012\n                    which triggered a series of SMS exchanges between Mr Lim and Mr Ong, when Mr Lim\n                    sought out Mr Ong to sign the necessary documents. Although Mr Ong sought some\n                    clarification about the situation and seemed to resist signing the documents, he\n                    eventually agreed to sign the documents. However, the documents were never\n                    signed, which resulted in the following SMSs sent by Mr Lim to Mr Ong: 28 March 2012 11:56am: Tmr 9.15am at auditor to sign all documents. 29 March 2012 8:55am: Kindly advise if you want to sign the document\n                        today. If you do not rely [sic] I will take it\n                        that you have changed your mind and is not signing. 29 Mar 2012  12:04pm: Last chance please reply by 2pm\n                        today. 26     On 30 March 2012, Mr Jaleel messaged Mr Ong\n                    via SMS at 6.15pm (“the Jaleel SMS”) as follows: Hi Raymond [sic] terry say SGD175K+car and\n                        he will sign the total prior no claim letter also u sign the resign n sell\n                        shares document by tomorrow pls advice thanks Mr Ong alleged that Mr Jaleel sent him the SMS on Mr Lim’s\n                    behalf in an attempt to negotiate. Mr Lim’s case is that he did not\n                    authorise Mr Jaleel to negotiate the purchase of the Shares on his\n                        behalf.[note: 20]On this matter, I found that Mr Jaleel\n                    was not acting on Mr Lim’s behalf in sending the SMS to Mr Ong. It\n                    appeared that Mr Jaleel had made a mistake on the price in suggesting the amount\n                    of $175,000, which was significantly lower than Mr Lim’s offer on 18 March\n                    2012 of $345,000. If Mr Jaleel was indeed acting on behalf of Mr Lim to\n                    negotiate, it would have been unlikely that Mr Jaleel would have suggested an\n                    even lower amount than previously offered. It might have been that the\n                    “total prior no claim letter” was a reference to the No Claims\n                    Condition, and this term might have been worth much more than the shortfall in\n                    the price. However, there has been no evidence or submissions on the effective\n                    value of the No Claims Condition to Mr Ong. 27     On 31 March 2012, Mr Lim suggested that the\n                    parties meet to speak regarding the matter (“the 31 March 2012\n                    SMS”): Mr Lim to Mr Ong at 9.49am: I want to settle with you without going to court so we need to talk. If\n                        you want to then we talk today and get it done. 28     This led to the parties meeting on 1 April\n                    2012 in a final attempt to resolve the matter without having to go to\n                    litigation. The parties had differences as to what exactly transpired during the\n                    meeting. Mr Lim gave evidence that the purpose of having the meeting was because\n                    he wanted to avoid litigating the dispute if possible, and also because he\n                    wanted to understand why Mr Ong was not willing to follow through with the\n                    alleged agreement. Mr Lim reiterated to Mr Ong that he should honour the alleged\n                    agreement concluded on 19 March 2012. Mr Ong, on the other hand, gave evidence\n                    that he confronted Mr Lim regarding Mr Jaleel’s proposal on 30 March 2012.\n                    Mr Lim responded to this by saying that Mr Jaleel had made a typographical\n                    error, and that his intention was to pay Mr Ong $345,000 and to allow him to\n                    keep the Car. Mr Ong then informed Mr Lim that the amount was still too low, and\n                    he wanted a valuation of RIQ. I preferred Mr Lim’s evidence regarding the\n                    meeting, and found that Mr Lim only asked Mr Ong to comply with the terms of the\n                    agreement due to his reluctance to take legal action against Mr Ong. From Mr\n                    Lim’s perspective, the agreement was a good deal for Mr Ong, and future\n                    litigation was to be avoided. 29     On 6 April 2012, there was a further exchange\n                    of SMSs between the parties (“the 6 April 2012 SMSs”). The SMSs\n                    are reproduced as follows: Mr Lim to Mr Ong at 5.54pm: [n]eed to move forward on our issues so now you feel my previous offer of\n                        S$345K for all you shares in RIQ is too low and now you wants a valuation of\n                        the company. Mr Ong to Lim at 6.26pm: Yes, I wants a valuation Mr Lim to Mr Ong at 6.26pm: [m]y previous offer of S$345K for all your shares in RIQ is a good\n                        deal. The 6 April 2012 SMSs were the final recorded communication directly\n                    between the parties.",
        "My analysis": "",
        "Issue 1: Whether there was a concluded agreement between the parties\n                for the sale of the Shares": "30     There were three elements to this issue: (a)\n                    the terms of the offer made by Mr Lim to Mr Ong; (b) whether there was valid\n                    acceptance of this offer; and (c) whether any concluded agreement was incomplete\n                    and should therefore not constitute a valid contract. What were the terms of the offer made by Mr Lim to Mr Ong? 31     It was uncontroversial that Mr Lim did make an\n                    offer to Mr Ong to purchase the Shares. The controversy surrounds what thetermsof this offer were. I should point out\n                    that the differences between the parties on the terms of the offer was only of\n                    consequence to the issue of whether there was a valid acceptance of Mr\n                    Lim’s offer by Mr Ong and it is imperative that the terms of the offer are\n                    identified right at the outset. 32     It is settled law that offer and acceptance as\n                    concepts of contract formation constitute the objective manifestations of an\n                    intention to contract: seeGay Choon Ing v Loh Sze Ti Terence\n                        Peter[2009] 2 SLR(R) 332 (“Gay Choon\n                        Ing”) andCooperatieve Centrale\n                        Raiffeisen-Boerenleenbank BA (Trading as Rabobank International), Singapore\n                        Branch v Motorola Electronics Pte Ltd[2011] 2 SLR\n                63. 33     In the context of an offer, it is stated inThe Law of Contract in Singapore(Andrew B L\n                    Phang gen ed) (Academy Publishing, 2012) (“The Law of\n                        Contract in Singapore”) at para 03.024 that “the\n                    key element of an offer is that of intention” and that “[t]his ...\n                    has to be ascertained objectively”. The learned authors further elaborate\n                    that: [T]he offeree’s objective perception that the offeror has made him\n                        an offer is essential in the objective test of ascertaining an offer. Thus\n                        if the offeree reasonably believes that the offeror has made him an offer,\n                        the offeror would be bound even if the offeror did not actually intend to do\n                        so. This is not a departure from the objective principle because the law\n                        asks what areasonable person in the offeree’s\n                            positionwould have perceived the offeror’s purported\n                        offer to mean. It does not ask what the offereeactuallythought. It may well be that the offeree’s\n                        subjective intention coincides with what a reasonable person would have\n                        thought but it is clear that the law takes as its guide the latter and not\n                        the former. [emphasis in original] 34     It was undisputed by the parties that an offer\n                    was made by Mr Lim to buy out Mr Ong on 22 February 2012. It was not clear that\n                    Mr Ong had accepted that offer although the evidence suggests that was the case,viz, the return of the company credit card and\n                    the office keys and Mr Ong keeping the car. However, I did not have to make a\n                    finding on this matter because it was uncontroversial that Mr Lim replaced his\n                    initial offer during the 18 March 2012 meeting at Tiong Bahru market. I accepted\n                    Mr Lim’s evidence that he increased the sum of money to be paid to Mr Ong\n                    from $200,000 to $345,000 for the reasons set out at [20] above. Importantly, I\n                    found that an objective assessment of Mr Lim’s intentions was that Mr Lim\n                    intended to be bound by two other terms,ie, Mr\n                    Ong keeping the Car and the No Pay Back Term. That it would not have made sense\n                    for Mr Lim to replace his earlier offer with a figure which was lower than what\n                    was previously made, given the circumstances, further supports this\n                    analysis. 35     Therefore, I found that the subsequent offer\n                    made on 18 March 2012 only sought to increase the sum of money Mr Lim would pay\n                    Mr Ong from $200,000 to $345,000. That was the final term being negotiated\n                    – the price. This new price of $345,000 together with the term that Mr Ong\n                    could keep the Car and the No Pay Back Term constituted the material terms of\n                    the offer made by Mr Lim to Mr Ong. Was there valid acceptance of the offer? 36     On the evidence, I found that valid acceptance\n                    of the offer would depend on whether the Acceptance SMS constituted valid\n                    acceptance by Mr Ong of the offer made by Mr Lim. A succinct definition of\n                    acceptance is put forward by Professor Treitel in Edwin Peel,Treitel on the Law of Contract(Sweet & Maxwell, 13th Ed,\n                    2011) at p 17, which was endorsed by the Singapore Court of Appeal inGay Choon Ingat [47]: An acceptance is afinal and unqualifiedexpression of assentto the terms of an offer.[emphasis added] It is further noted in Andrew B L Phang and Goh Yi Han,Contract Law in Singapore(Kluwer Law International,\n                    2012) (“Contract Law in Singapore”)\n                    at para 143 that: The key requirement of an acceptance is that there be a final and\n                        unqualified expression of assent on the part of the offeree to the terms of\n                        an offer. The objective ascertainment of intention is likewise applicable to\n                        determine acceptance as it is for an offer. Contract Law in Singaporealso states at\n                    para 146 that “anything less than an unconditional and unqualified assent\n                    to the terms of the offer renders the purported acceptance acounter-offerinstead [emphasis in\n                original]”. 37     Counsel for Mr Ong, Mr Devinder Rai\n                    (“Mr Rai”), submitted that the Acceptance SMS did not constitute\n                    valid acceptance of Mr Lim’s offer and was, at most, a counter-offer. This\n                    was because the terms of the offer made by Mr Lim were that Mr Lim would pay Mr\n                    Ong $345,000 and that Mr Ong could keep the Car in return for the Shares, while\n                    the terms discernible from the Acceptance SMS were that Mr Lim would pay Mr Ong\n                    $345,000 and that “all documents ready to sign”. That the terms in\n                    the offer and the acceptance were different must mean that Mr Ong did not accept\n                    the offer made by Mr Lim, but was instead making a counter-offer. In making the\n                    submission, Mr Rai relied on the judgment of Judith Prakash J inOverseas Union Insurance v Turegum Insurance Co[2001] 2\n                    SLR(R) 285 (“Overseas Union\n                    Insurance”), which states (at [29]): As Treitel states (at p 41) an offeree who attempts to accept\n                        an offer on new terms, not contained in the original offer, may be rejecting\n                        the original offer and instead making a counter-offer. Such offeree cannot\n                        later accept the original offer. To accept an offer, the offeree must, as\n                        Prof Phang states (at p 96): ... unreservedly assent to the exact terms proposed by the offeror.\n                            If, while purporting to accept the offer as a whole, he introduces a new\n                            term which the offeror has not had a chance of examining, he is in fact\n                            making a counter-offer. When such a counter-offer is made, no contract will result unless the\n                        counter-offer is accepted by the offeror. 38     I found, however, that the Acceptance SMS was\n                    not a counter-offer, but constituted valid acceptance of the offer made by Mr\n                    Lim. This issue is best analysed in two parts: why I found that parties intended\n                    to be bound by the same terms, and why I found that parties did not have\n                    different intentions on whether to be bound by any other terms. (1)   Parties intended to be bound by the same terms 39     As opposed to what Mr Rai submits, Mr\n                    Lim’s offer was not merely to pay Mr Ong $345,000 and that Mr Ong could\n                    keep the Car. As previously mentioned at [34], an objective ascertainment of Mr\n                    Lim’s intentions would lead to the conclusion that another material term\n                    of the offer was the No Pay Back Term. Although Mr Ong in the Acceptance SMS\n                    only expressly referred to the $345,000, I found that he implicitly intended\n                    that he need not pay back any money already paid out and could keep the Car, in\n                    exchange for the Shares. Therefore, both Mr Lim and Mr Ong intended to be bound\n                    by the same terms. (2)   Parties did not have different intentions on whether to be\n                bound by other terms 40     This issue is whether the phrase “all\n                    documents ready to sign” found in the Acceptance SMS constituted a term\n                    which Mr Ong intended to form part of the agreement which was not part of Mr\n                    Lim’s offer. 41     What does that phrase mean? Mr Rai submits\n                    “all documents” is not a term of art.[note: 21]Evidence was given by both Mr Ong and Mr Lim\n                    that “all documents” would consist of the necessary share transfer\n                    form, directors’ resolution for the approval of the dividend payout,\n                    directors’ resolution for the resignation of Mr Ong, directors’\n                    resolution for the approval of the Financial Statements for the financial year\n                    ending August 2011, and Mr Ong’s letter of resignation.[note: 22]These documents are ordinarily\n                    considered to be administrative follow up or accompanying paperwork to give\n                    effect to any buy-out agreement. It would be artificial to say that this was a\n                    new material term. 42     The only document which could have contained a\n                    material term to the agreement by which Mr Lim might not have intended to be\n                    bound, would be one of the conditions in Mr Ong’s letter of resignation\n                    — the No Claims Condition. It was Mr Ong’s case that he wanted the\n                    No Claims Condition and that Mr Lim had not agreed to that. 43     I found that the first time the No Claims\n                    Condition was “raised” in documentary evidence was in an email\n                    sent from Ms Emlynn Chong (“Ms Chong”) of SCS to Mr Lim dated 21\n                    March 2012 at 9:42am. That was not at the behest or initiative of Mr Ong. The No\n                    Claims Condition set out in the draft resignation letter of Mr Ong as a director\n                    was prepared by SCS. Ms Chong said that this No Claims Condition in the draft\n                    resignation letter was part of a template resignation letter used by\n                        SCS.[note: 23]I accepted her evidence because she was not\n                    challenged on this, and there was also some corroboration by the second witness\n                    called by the defence, Mr Ng Yong Yi, who was an audit partner of K S Ng in\n                    charge of the RIQ accounts. 44     Mr Lim’s evidence, which I accepted, was\n                    that he saw the No Claims Condition for the first time in that email\n                        attachment.[note: 24]Importantly, I found that this evidence\n                    by Mr Lim was not inconsistent with the offer given by Mr Lim to Mr Ong that he\n                    would not make a claim for the “unaccounted sum” of $345,000 which\n                    was paid out to Mr Ong, as stated in the 19 March 2012 SMS at 11.47am (see above\n                    at [18]). I find as a fact that Mr Lim agreed not to make a claim for the\n                    “unaccounted sum”, but did not agree to the No Claims Condition\n                    because he did not even contemplate such a term at the material\n                time. 45     I now turn to address whether Mr Ong intended\n                    that the No Claims Condition should form part of the agreement. It bears\n                    reiteration that this intention has to manifest itself on an objective\n                    assessment of the circumstances. Mr Ong’s evidence was that he\n                    contemplated the No Claims Condition before 19 March 2012 and did intend the\n                    parties to be bound by it. However, this is not reflected explicitly in any\n                    documentary evidence. In fact, the only documentary evidence showing that Mr Ong\n                    contemplated the No Claims Condition or any other similar condition was found in\n                    a draft resignation letter (distinct from the one drafted by SCS) Mr Ong sent as\n                    an attachment in an email to Mr K S Ng of K S Ng and Ms Chong. This email,\n                    however, was sent on 21 March 2012 at 12:29pm, and would not constitute evidence\n                    of the parties’ intentions on 19 March 2012. Mr Ong never raised this\n                    specifically with Mr Lim. 46     Mr Ong put forth the construction that the\n                    phrase “& all documents ready to sign” in the Acceptance SMS\n                    meant the No Claims Condition. However, those words clearly cannot be stretched\n                    to imply the No Claims Condition. Importantly, when this was put to him in\n                    cross-examination, Mr Ong conceded that “& all documents ready to\n                    sign” constituted a condition of the agreement only in his mind and was\n                    not spelt out or expressed in the Acceptance SMS.[note: 25]It is clear on\n                    any view that this unspoken thought of Mr Ong cannot become a term or condition\n                    of the agreement. Therefore, I found that Mr Ong’s evidence of the No\n                    Claims Condition as part of the “& all documents ready to\n                    sign” condition being in his mind could not help him establish that he\n                    did intend the No Claims Condition to be a term of the agreement when he sent\n                    out the Acceptance SMS. 47     Furthermore, Mr Ong himself conceded that a\n                    reasonable person looking at the SMS exchanges between the parties up to 5 April\n                    2012 would have thought that Mr Ong intended to sign the documents.[note: 26] 48     Mr Ong then tried to say that the words\n                    “lawyer stuff” in an SMS sent by Mr Jaleel to Mr Ong on 14 March\n                    2012 at 1:28pm referred to the No Claims Condition. This would suggest two\n                    things: that Mr Ong contemplated the No Claims Condition prior to 19 March 2012,\n                    and that Mr Jaleel knew about this condition which raises the possibility that\n                    Mr Lim might have known about the condition as well. However, as stated above\n                    (at [14]), the evidence of Mr Ong was in direct contradiction to Mr\n                    Jaleel’s and I preferred the evidence of both Mr Jaleel and Mr Lim on this\n                    issue. 49     I therefore found that the No Claims Condition\n                    was not part of Mr Ong’s terms when negotiating the agreement for the sale\n                    of the Shares prior to 19 March 2012. At best, Mr Ong only sought assurances\n                    that he would not have to pay back to RIQ the unaccounted sums of money paid out\n                    to him (iethe No Pay Back Term). The No Claims\n                    Condition which would constitute a material term of the agreement was an\n                    afterthought of Mr Ong’s. Thus, the Acceptance SMS was not a counter-offer\n                    by Mr Ong, but constituted valid acceptance of Mr Lim’s offer on 18 March\n                    2012. 50     Accordingly, there was a valid agreement\n                    between the parties formed on 19 March 2012, and the material terms of the\n                    agreement were that Mr Ong was to transfer the Shares to Mr Lim in return for Mr\n                    Lim paying him $345,000, Mr Ong being allowed to keep the Car, and the No Pay\n                    Back Term (“the 19 March 2012 Agreement”). Was the 19 March 2012 Agreement an incomplete agreement? 51     Mr Rai further submitted that even if an\n                    agreement was found to exist, it should be “void for incompleteness\n                    and/or uncertainty”. The words “& all documents ready to\n                    sign” in the Acceptance SMS was a material term of the agreement, and\n                    since the phrase “all documents” was not a term of art, the Court\n                    would not able to identify exactly the documents which the parties agreed would\n                    be ready for signature. In support of his submission, Mr Rai cited the case ofG Scammell & Nephew Ltd v HC and JG Ouston[1941] AC 251 at 268: … There are in my opinion two grounds on which the court ought to\n                        hold that there was never a contract. The first is that the language used\n                        was so obscure and so incapable of any definite or precise meaning that the\n                        court is unable to attribute to the parties any particular contractual\n                        intention. … Mr Rai furthers citesThe Law of Contract in\n                        Singaporeat para 03.166 for the proposition that an agreement is\n                    not binding “if essential matters without which the contract is too\n                    uncertain or incomplete to be workable remain to be agreed\n                upon”. 52     Mr Rai also claims that the parties themselves\n                    were unclear as to what the term “all documents” encompassed, and\n                    that parties were referring to different documents in the various SMSs sent\n                    between them. This must mean that it was “difficult if not impossible to\n                    objectively ascertain the intentions of the parties from the entire chain of\n                        correspondence”.[note: 27] 53     I cannot accept this submission at all and\n                    held that the agreement was not unclear or incomplete such that it should not be\n                    regarded as binding. As mentioned earlier above at [41], parties have given\n                    evidence as to what “all documents” might be said to comprise of.\n                    These documents are invariably administrative documents which were needed to\n                    give effect to the buy-out. Furthermore, even if the exact documents could not\n                    be identified, there were no documents that would have made the contract\n                    unworkable or void for uncertainty. As stated inThe Law of\n                        Contract in Singaporeat para 03.166 (continuing from the\n                    previous quotation at [51]): Conversely put, the parties must reach substantial or essential agreement\n                        before a contract can be regarded as concluded. A contract may be regarded\n                        as having been formed even though it has not been worked out in meticulous\n                        detail. Similarly if a contract calls for further agreement between the\n                        parties, the absence of further agreement between the parties will vitiate\n                        the contract only if it makes it unworkable or void for uncertainty. I found that parties had arrived at substantial or essential\n                    agreement, and there were no material documents which could have required\n                    further agreement between the parties. Therefore, the 19 March 2012 Agreement\n                    was not an incomplete agreement, and is binding on the parties. 54     It should not be forgotten that Mr Ong had,\n                    without Mr Lim’s agreement, paid himself the same amount as Mr Lim despite\n                    being a 35% shareholder by way of directors’ fees and remuneration. This\n                    resulted in RIQ’s balance sheet reflecting a loss. The sudden resignation\n                    of Betsy, who was in charge of the accounts, also speaks for itself. I should\n                    also state that Mr Ong’s evidence was quite unsatisfactory. He feigned\n                    ignorance of the meaning of questions, evaded answering questions, and when\n                    caught out, still stood by his statements. Reading through his cross-examination\n                    will clearly illustrate the unsatisfactory nature of his evidence.",
        "Issue 2: Whether the 19 March 2012 Agreement had been rescinded by\n                mutual agreement of the parties.": "55     Mr Rai further submits that even if there was\n                    a concluded and valid contract on 19 March 2012, this contract was rescinded by\n                    mutual agreement of the parties. To support his submission, Mr Rai relies on the\n                    following statement made by the Court of Appeal inGay Choon\n                        Ingat [53]: The aforementioned paragraphs suggest (correctly, in our view) that the\n                        courts look at thewholecourse of the\n                        negotiations between both parties in order to ascertain if an agreement is\n                        reachedat any given point in time. It should\n                        further be noted that where such a point is identified, the mere fact that\n                        negotiations are continuedthereafterdoes not\n                        of itself affect the existence of the agreementalready\n                            concluded. Of course, if the continued negotiations disclosean agreed rescissionof an agreement\n                        already concluded, then the position is quite different. [emphasis in\n                        original] Mr Rai also relied on a passage fromChitty on\n                        Contractsvol 1 (H G Beale gen ed) (Sweet & Maxwell, 30th Ed,\n                    2008), approved by Lee Seiu Kin J inUncharted Business Pte\n                        Ltd v Asiasoft Online Pte Ltd[2009] SGHC 188 at [21]: On the issue of mutual consent to terminate an\n                            agreement,Chitty on\n                        Contracts(Sweet & Maxwell, 30th Ed 2008) vol 1 at\n                        paras 22-025–22-026 states: 22-025 Rescission by agreement.Where a\n                            contract is executory on both sides, that is to say where neither party\n                            has performed the whole of his obligations under it, it may be rescinded\n                            by mutual agreement, express or implied … The consideration for\n                            the discharge … is found in the abandonment by each party of his\n                            right to performance … It depends upon the consent of both\n                            parties, to be gathered from their words or conduct and not upon the\n                            intimation by one of them that he does not intend to be bound by the\n                            agreement. 22-026 Effect of rescission.A contract\n                            which is rescinded by agreement is completely discharged and cannot be\n                            revived. 56     Counsel for Mr Lim, Mr Lai Yew Fei (“Mr\n                    Lai”), relied on the same passage inGay Choon\n                        Ing, and essentially contended that continued negotiations do not\n                    necessarily mean that there is rescission by agreement. Mr Lai submitted that it\n                    has to be clear that there was an agreement to rescind through the continuing\n                    negotiations. Mr Lai further relied on the case ofIntense\n                        Investments Ltd v Development Ventures Ltd and another[2006] All\n                    ER (D) 346 (Jun) (at [131]) for the proposition that the mere willingness to\n                    negotiate further “does not itself unravel a binding\n                        contract”[note: 28]: I reject the suggestion, that because Mr Bramley was prepared to consider\n                        (and was even enthusiastic about) taking part in a renegotiation of the\n                        contract terms, it meant that the existing agreement was somehow rendered\n                        invalid or was terminated in some way. It is very common for businessmen to\n                        agree a contract on one set of terms and then, as the situation develops,\n                        suggest or request variations to the terms of that agreement. Sometimes\n                        those variations can be agreed. However, if as here, the proposed variations\n                        to a contract are not agreed, that does not mean that the validity of the\n                        underlying contract has been affected in any way. 57     Therefore, whether the events which occurred\n                    after 19 March 2012 constituted further negotiations between the parties, and\n                    more importantly, whether the further negotiations evinced an agreement to\n                    rescind the prior agreement, were determinative of the issue. There were a\n                    number of material events which occurred after 19 March 2012 which were\n                    initially of concern. 58     The first event was the Jaleel SMS (see above\n                    at [26]). Mr Rai submitted that Mr Jaleel was acting on Mr Ong’s behalf,\n                    and that this was evidence of continuing negotiations. As mentioned earlier, I\n                    found that this was not the case, and that Mr Jaleel had acted on his own\n                    accord. Furthermore, it is unlikely that Mr Lim would have intended to negotiate\n                    with Mr Ong by offering him less favourable terms than before (see above at\n                    [26]). In any case, even if the Jaleel SMS constituted continuing negotiations\n                    between the parties, it was not evidence that they had agreed to rescind the\n                    earlier agreement. The continued negotiations in the context Mr Rai raised them\n                    at best suggest that no agreement was concluded in the first place, rather than\n                    establish that the parties had agreed to set aside the earlier\n                agreement. 59     The second event to consider was the meeting\n                    between the parties on 1 April 2012. Mr Rai’s submission was that if there\n                    was indeed an agreement between the parties on 19 March 2012, there would have\n                    been no need for parties to meet on 1 April 2012. However, as stated earlier at\n                    [27], the purpose of the meeting was because Mr Lim wanted to have another try\n                    at persuading Mr Ong to honour the 19 March 2012 Agreement so that formal legal\n                    proceedings would not have to be commenced. 60     Finally, Mr Rai submitted that the use of the\n                    term “settle” in the 31 March 2012 SMS meant that Mr Lim was not\n                    claiming to enforce a contract, but was clearly still negotiating the sale of\n                    Shares, and therefore impliedly agreed that there was no concluded agreement. Mr\n                    Ong also treated the 31 March 2012 SMS to mean that the sale of the Shares was\n                    still being negotiated. Therefore, even if there had been an agreement on 19\n                    March 2012, this amounted to a consensual rescission of the agreement. This was\n                    further reinforced by the language used by Mr Lim in the 6 April 2012 SMSs. Mr\n                    Rai submitted that Mr Lim in using the term “previous offer” must\n                    be taken to have meant that he did not believe that the sale of the Shares was\n                    in fact agreed upon. With respect, Mr Rai’s submissions on this point were\n                    incorrect. Although Mr Lim in the 31 March 2012 SMS did use the term\n                    “settle”, the SMS clearly expressed that Mr Lim did not wish the\n                    matter to result in litigation, which must have meant that he thought he had an\n                    agreement to enforce in the first place. Mr Lai also submitted that when Mr Lim\n                    used the term “previous offer” in the 6 April SMS, what he meant\n                    to say was that the “offer that was accepted” by Mr Ong was a good\n                    deal. Taking into consideration the context of the dispute, I found that the\n                    mere fact that the term “previous offer” was being used would not\n                    be sufficient to establish, on an objective basis, that Mr Lim had intended for\n                    the 19 March 2012 Agreement to be rescinded. I also noted that the language used\n                    by the parties, as evident in their SMS exchanges, along with their\n                    typographical mistakes, militates against construing their SMS exchanges as if\n                    they were properly drafted exchanges of those well versed in\n                English. 61     Therefore, I found that the meetings and SMS\n                    exchanges between the various parties in the dispute from after 19 March 2012 to\n                    6 April 2012 did not clearly show mutual agreement between the parties to\n                    rescind the 19 March 2012 Agreement. On the contrary, they clearly show Mr Lim\n                    trying to get Mr Ong to honour his agreement and to avoid a costly legal battle\n                    when his efforts were much better spent on RIQ’s business which had just\n                    suffered a big commercial blow. On Mr Ong’s part, having agreed to the\n                    buy-out terms, he changed his mind.",
        "Issue 3: Whether the 19 March 2012 Agreement had been abandoned by\n                the parties": "62     Mr Rai submitted that the 19 March 2012\n                    Agreement had been abandoned by the parties, and relied onChitty on Contractsvol 1 (H G Beale gen ed) (Sweet &\n                    Maxwell, 30th Ed, 2008) at para 22-027: Abandonment.It is open to the court to\n                        infer that the parties have mutually agreed to abandon their contract where\n                        the contract has been followed by a long period of delay or inactivity on\n                        both sides. The party seeking to establish abandonment of a contract must\n                        show that the other party so conducted himself as to entitle him to assume,\n                        and that he did assume, that the contract was agreed to be abandonedsub silentio. Mr Rai also stated that his submission was premised on a “close\n                    analogy ... with the position in relation to the consensual abandonment of\n                    contractual arbitration clauses”. It was, therefore, somewhat surprising\n                    that his submissions did not raise any authorities regarding the consensual\n                    abandonment of contractual arbitration clauses. Furthermore, Mr Rai also based\n                    his submissions on the same factual events which he relied upon to show that the\n                    19 March 2012 Agreement was rescinded. As set out above, the various findings of\n                    fact did not favour Mr Ong, and this meant that the claim in abandonment could\n                    not be made out. 63     With respect, Mr Rai’s submissions are\n                    of no substance. Abandonment by prolonged inactivity in the context of\n                    arbitration is of no application here. InPaal Wilson &\n                        Co A/S v Partenreederei Hannah Blumenthal (Hannah Blumenthal)[1983] 1 AC 854 (“Hannah\n                    Blumenthal”), the well-known English House of Lords decision,\n                    Lord Brandon identified two ways in which implicit abandonment may be shown (at\n                    914): … Where A seeks to prove that he and B have abandoned a contract in\n                        this way, there are two ways in which A can put his case. The first way is\n                        by showing that the conduct of each party, as evinced to the other party and\n                        acted on by him, leads necessarily to the inference of an implied agreement\n                        between them to abandon the contract. The second method is by showing that\n                        the conduct of B, as evinced towards A, has been such as to lead A\n                        reasonably to believe that B has abandoned the contract, even though it has\n                        not in fact been B's intention to do so, and that A has significantly\n                        altered his position in reliance on that belief. The first method involves\n                        actual abandonment by both A and B. The second method involves the creation\n                        by B of a situation in which he is estopped from asserting, as against A,\n                        that he, B, has not abandoned the contract ... In that case, parties entered into a contract for the sale of a ship\n                    which contained a clause for arbitration in London. When a dispute arose in\n                    1972, the buyers and sellers each appointed an arbitrator but did not arrange\n                    for the appointment of a third arbitrator as required by the contract, and after\n                    various pleadings were exchanged in 1974, there was inactivity for three years.\n                    In 1979, both parties began to prepare for the arbitration, with the buyers\n                    preparing an expert report on the ship’s log books, and the sellers\n                    tracing witnesses to testify at the hearing. This was followed by the sellers,\n                    in 1980, seeking a declaration,inter alia, that\n                    there was an agreement to abandon the arbitration. The claim failed, primarily\n                    on the ground that by tracing witnesses to testify, the sellers could not show\n                    that they had acted on or significantly altered their position in relation to\n                    any actual or reasonably perceived abandonment of the arbitration by the\n                    buyers. 64     The House of Lords inHannah Blumenthal, in arriving at their decision, approved the\n                    English High Court decision inAndre et Compagnie SA v Marine\n                        Transocean Ltd (The Splendid Sun)[1981] QB 694\n                        (“The Splendid Sun”), where the\n                    claim in abandonment succeeded. In that case, the owners of the Splendid Sun\n                    hired their ship to charterers under an agreement providing for arbitration in\n                    London. After a dispute arose in 1969, arbitral proceedings were commenced\n                    between the parties. This was followed by inactivity between 1970 and 1977, and\n                    when the charterers received a letter from the owners enclosing points of claim\n                    in the arbitration, they sought and were granted an injunction to restrain the\n                    shipowners from proceeding with the arbitration. It was held that the proper\n                    inference to be drawn from the conduct of the parties, in particular the long\n                    period of total inactivity, was that the agreement to have the dispute submitted\n                    to arbitration had been abandoned. 65     InRe An Arbitration\n                        Between Hainan Machinery Import and Export Corp and Donald & McArthy Pte\n                        Ltd[1995] 3 SLR(R) 354, Judith Prakash J considered an\n                    abandonment claim raised by the defendants, and made references to theHannah Blumenthaland theThe\n                        Splendid Sun. The claim was dismissed,inter\n                        alia, on the ground that there was no long period of\n                    inactivity. 66     In the present case, the inactivity pleaded\n                    was that Mr Lim did not seek to enforce the 19 March 2012 Agreement since, as\n                    alleged by Mr Ong, the terms of the sale of the Shares were still being\n                    negotiated between them even after 19 March 2012. Even if Mr Ong’s claims\n                    were accepted, the period of inactivity would only amount to a mere two months\n                    (which was the time until OS 460 was filed), and cannot be considered an\n                    adequate time period of inactivity for abandonment to be found. As suggested inThe Law of Contract in Singapore(at para\n                    03.032), “[t]he question remains whether an intention to be bound can be\n                    objectively ascertained from the conduct of the offeror”. With respect,\n                    this must be correct, and I found that an intention to abandon the contract\n                    could not be objectively ascertained from the two-month delay in Mr Lim seeking\n                    to enforce the 19 March 2012 Agreement.",
        "Issue 4: Whether Mr Ong was entitled to access RIQ’s accounting\n                and other records relating to the financial position of RIQ": "67     This issue arose when Mr Ong wrote to RIQ\n                    requesting for an inspection of RIQ’s accounts pursuant to s 199 of the\n                    Companies Act on 28 March 2012, and was rejected,inter\n                        alia, on the basis that Mr Ong was no longer a director or a\n                    shareholder of RIQ. Mr Ong then commenced OS 352. The relevant sections of s 199\n                    of the Companies Act are reproduced as follows: (1)    Every company and the directors and managers\n                            thereof shall cause to be kept such accounting and other records as will\n                            sufficiently explain the transactions and financial position of the\n                            company and enable true and fair profit and loss accounts and\n                            balance-sheets and any documents required to be attached thereto to be\n                            prepared from time to time, and shall cause those records to be kept in\n                            such manner as to enable them to be conveniently and properly\n                            audited. ... (3)    The records referred to in subsection (1)\n                            shall be kept at the registered office of the company or at such other\n                            place as the directors think fit and shall at all times be open to\n                            inspection by the directors. 68     Art 82(e) of the Articles of Association of\n                    RIQ provides that the office of director shall become vacant if the director\n                    resigns his office by notice in writing to the company. It followed from the 19\n                    March 2012 Agreement that Mr Ong was to resign as a director of RIQ with effect\n                    from 29 February 2012. This was evidenced by the SMS exchange between Mr Ong and\n                    Mr Lim following from the Acceptance SMS (see above at [22]). I found that the\n                    SMS sent by Mr Ong constituted resignation in writing pursuant to Art 82(e). Mr\n                    Lim was the director and majority shareholder of RIQ, and would be authorised to\n                    accept Mr Ong’s notice of resignation on behalf of RIQ. 69     As stated inWalter Woon on\n                        Company Law(Tan Cheng Han gen ed) (Sweet & Maxwell, 3rd Ed,\n                    2009) at para 10.47: This right of inspection may be exercised only by directors and not\n                        ex-directors, and any order of court authorising an auditor to inspect such\n                        record on behalf of a director will be ineffective after the\n                        director’s removal. Therefore, I found that Mr Ong had no right of inspection of\n                    RIQ’s “accounting and other records relating to the financial\n                    position of [RIQ], which are necessary to explain all the transactions of [RIQ]\n                    for the financial years 2010 and 2011”[note: 29]pursuant\n                    to s 199 of the Companies Act.",
        "Conclusion": "70     In light of the foregoing, I made the\n                    following orders at the conclusion of the hearing: (a)     Mr Ong was to transfer his 175,000\n                        shares in RIQ to Mr Lim forthwith and in this respect there would be an\n                        order in terms of Prayers (1), (2), (3), (4) and (5) in OS\n                    460; (b)     Mr Ong was to\n                        resign as a director of RIQ with effect from 29 February\n                    2012; (c)     Mr Lim was to\n                        pay Mr Ong the sum of $345,000 upon receiving the share certificates and\n                        share transfer forms in respect of the 175,000 shares; (d)     the Car would belong to Mr Ong and\n                        insofar as there was any trust or transfer document in existence, they shall\n                        be of no effect upon conclusion of the above transactions, and insofar as it\n                        is necessary, any documentation to effect the same shall be carried\n                        out; (e)     the\n                        necessary resolutions effecting the above were to be signed by both\n                        parties; (f)     for\n                        the avoidance of doubt, Mr Lim and RIQ would not make any claims against Mr\n                        Ong in respect of the monies relating to the No Pay Back\n                    Term; (g)     no order was\n                        made with regards to Prayers (1) and (2) of OS 352; and (h)     I gave the parties liberty to\n                        apply. 71     I took the view that costs must follow the\n                    event in these two proceedings, and therefore awarded costs to RIQ in OS 352 and\n                    to Mr Lim in OS 460, which were to be taxed if not agreed.  [note: 1]OS 352 Affidavit of Mr Ong dated 10 April 2012 at para\n                                3; OS 352 Affidavit of Mr Ong dated 21 May 2012 at paras 3 to\n                                5 [note: 2]OS 460 Affidavit of Mr Lim dated 11 May 2012 at para\n                                5 [note: 3]OS352\n                                Affidavit of Mr Ong dated 21 May 2012 at paras 5 to\n                        7 [note: 4]OS 352\n                                Affidavit of Mr Ong dated 21 May 2012 at para\n                        14 [note: 5]OS 352 Affidavit of Mr Ong dated 21 May 2012 at paras\n                                17 to 18 [note: 6]OS 352 Affidavit of Mr Lim dated 29 June 2012 at para\n                                20 [note: 7]OS 352 Affidavit of Mr Lim dated 29 June\n                                2012 at para 8 [note: 8]Transcripts 15 January 2013 p 81 [note: 9]Transcripts 16\n                                January 2013 p 76 [note: 10]Transcripts\n                                15 January 2013 p 90 [note: 11]Transcripts\n                                16 January 2013 p 25 [note: 12]Transcripts 14 January 2013 pp 49 to\n                                50 [note: 13]OS 352 Affidavit of Mr Jaleel dated 29\n                                June 2012 at paras 9 to 11 [note: 14]Transcript 14 January 2013 at p 27 [note: 15]OS352\n                                Affidavit of Mr Ong dated 21 May 2012 at para\n                        33 [note: 16]Transcripts\n                                15 January 2013 p 77 to 79 [note: 17]Transcripts\n                                15 January 2013 p 80 [note: 18]OS 352\n                                Affidavit of Ms Chong dated 27 September 2012 at p\n                        52 [note: 19]OS 352\n                                Affidavit of Ms Chong dated 27 September 2012 at para\n                            12 [note: 20]Transcripts 15 January 2013 pp 34 to\n                                35 [note: 21]Mr Ong’s Skeletal Submissions at para\n                        12 [note: 22]Transcript 14 January 2013 pp 13 to 16; Transcript 16 January\n                                2013 p 11 [note: 23]Transcript 16 January 2013 pp 45 to\n                        46 [note: 24]Transcript 16 January 2013 pp 2 to\n                                4 [note: 25]Transcript\n                                14 January 2013 pp 13 to 14 [note: 26]Transcripts 14 January 2013 pp 21 to\n                        22 [note: 27]Mr\n                                Ong’s skeletal submissions para\n                    14 [note: 28]Lim’s skeletal submissions at\n                                para 44 [note: 29]Originating\n                                Summons No 352 of 2012 pp 1 to 2"
    }
}