{
    "case_title": "Global Distressed Alpha Fund I Ltd Partnership\n      v\n      PT Bakrie Investindo",
    "ncitation": "[2013] SGHC 30",
    "coram": "Tay Yong Kwang J",
    "sections": {
        "Introduction": "1       This case turns on the interpretation of O 67 r 10(2) of the Rules of Court (the “Rules”). The appellant/judgment debtor, PT Bakrie Investindo (“Bakrie”), is appealing against the dismissal of an application to adjourn the examination of judgment debtor proceedings (“EJD”) granted in favour of the respondent/judgment creditor, Global Distressed Alpha Fund I Limited Partnership (“GDAF”). 2       This appeal raises two issues in relation to O 67 r 10(2): (a)     first, whether an EJD comes within the meaning of “execution” for the purposes of O 67 r 10(2); and (b)     second, whether an application to set aside a registration of a foreign judgment registered under the Reciprocal Enforcement of Commonwealth Judgments Act (Cap 264) (“RECJA”) is considered “finally determined” for the purposes of O 67 r 10(2) if the application is pending hearing before the Court of Appeal.",
        "The relevant provision": "3       Order 67 r 10 reads as follows: (1)    Execution shall not issue on a judgment registered under the [Reciprocal Enforcement of Commonwealth Judgments Act (Cap 264)] or [Reciprocal Enforcement of Foreign Judgments Act (Cap 265)] until after the expiration of the period which, in accordance with Rule 5(2), is specified in the order for registration as the period within which an application may be made to set aside the registration or, if that period has been extended by the Court, until after the expiration of that period as so extended. (2)    If an application is made to set aside the registration of a judgment, execution on the judgment shall not issue until after such application is finally determined. (3)    Any party wishing to issue execution on a judgment registered under the [Reciprocal Enforcement of Commonwealth Judgments Act (Cap 264)] or [Reciprocal Enforcement of Foreign Judgments Act (Cap 265)] must produce to the Sheriff an affidavit of service of the notice of registration of the judgment and any order made by the Court in relation to the judgment.",
        "Factual background": "4       On 17 February 2011, GDAF obtained an English judgment against Bakrie (the “English Judgment”). On 18 July 2011, the English Judgment was registered in Singapore pursuant to s 3 of the RECJA and a registration order was granted (the “Registration Order”). 5       On 14 June 2012, GDAF successfully applied for an order to examine a director of Bakrie, Mr Kurniawan, as to Bakrie’s assets and for Mr Kurniawan to produce all books or documents in his possession, custody or power relevant to Bakrie’s assets (the “Bakrie EJD Order”). 6       Bakrie applied to set aside the Registration Order and the Bakrie EJD Order but was unsuccessful at the hearing before the assistant registrar on 24 September 2012 and subsequently on appeal before Woo Bih Li J on 31 October 2012. Bakrie has appealed to the Court of Appeal against the decision of Woo Bih Li J (the “CA Appeals”). 7       On 5 November 2012, Bakrie’s solicitors wrote to the registry to inform that Bakrie had filed the notices for the CA Appeals and requested an adjournment of the examination of Mr Kurniawan until after the CA Appeals have been disposed off. On 6 November 2012, the assistant registrar rejected this request and directed that the EJD proceed before her on the same day, as scheduled (the “Bakrie EJD”). 8       During the Bakrie EJD (at which Mr Kurniawan was absent), counsel for Bakrie, Mr Suresh Damodara (“Mr Damodara”), argued that an EJD constitutes “execution” for the purposes of O 67 r 10(2) and that this provided an automatic stay of the Bakrie EJD until after the disposal of the CA Appeals. 9       On 21 November 2012, the assistant registrar dismissed Bakrie’s arguments and Bakrie appealed to a Judge. On 17 December 2012, I heard the parties and dismissed Bakrie’s appeal. Bakrie has appealed to the Court of Appeal against my decision.",
        "Does an EJD constitute “execution” for the purposes of O 67 r 10(2)?": "",
        "The parties’ submissions": "10     Relying onRe Cheah Theam Swee, ex parte Equiticorp Finance Group Ltd and another[1996] 1 SLR(R) 24(“Re Cheah Theam Swee”), Mr Damodara argued that “execution” should be given a wide meaning so as to achieve consistency between the use of “execution” in s 3(3) of the RECJA and O 67.[note: 1]Mr Damodara submitted that this wide meaning of “execution” would encompass the enforcement of, or giving effect to, the judgments or orders of a competent court through the use of procedures such as an EJD.[note: 2] 11     Conversely, counsel for GDAF, Mr Emmanuel Chua (“Mr Chua”), contended that “execution” should be given a narrow meaning so as to give full effect to the legislative intention behind the RECJA,ieto facilitate the enforcement and recognition in Singapore of Commonwealth judgments to which the RECJA applied.[note: 3]For this proposition, he also relied onRe Cheah Theam Sweeas well as an analysis of the nature of an EJD.[note: 4]On that basis, he argued that “execution” in O 67 r 10(2) referred only to the various modes of execution provided by the Rules, such as garnishee proceedings and writs of seizure and sale.[note: 5] 12     However, by way of observation, I note that although both sides have invited me to adopt meanings of “execution” that represent extreme ends along a spectrum of possible meanings, one cannot exclude the possibility that the correct interpretation of “execution” may lie somewhere along this spectrum.",
        "The meaning of “execution” in O 67 r 10": "13     InRe Cheah Theam Swee, the question arose as to whether a bankruptcy notice could be taken out on a Commonwealth judgment registered in Singapore under the RECJA. Section 3(3) of the RECJA provides: (3)    Where a judgment is registered under this section — ... (b)    the registering court shall have the same control and jurisdiction over the judgment as it has over similar judgments given by itself,but in so far only as relates to execution under this section; ... (emphasis added) 14     The crux of that dispute was whether “execution” in s 3(3)(b) of the RECJA was wide enough to encompass bankruptcy proceedings. In arriving at his decision, Warren Khoo J felt it was necessary to consider the legislative intention of the RECJA (at [18]): It is the evident object and purpose of the [RECJA] to facilitate the enforcement of judgments obtained in the superior courts of the United Kingdom and other Commonwealth countries to which the [RECJA] is extended. ... 15     Warren Khoo J went on to say (at [21], [25] and [26]): 21    As pointed out by the learned editors ofHalsbury’s Laws of Englandvol 17 (Butterworths, 4thEd) at para 401, the word “execution” can mean one of two things. In its wide sense, it signifies the enforcement of or giving effect to the judgements or orders of courts of justice. In its narrower sense, it means the enforcement of those judgments or orders by a public officer under the various modes of execution provided by rules of court, such as writs offi fa, possession, delivery. ... 25    It follows that when considering the question whether bankruptcy proceedings may be taken on a registered judgment on the strength of sub-s (3), the question to be askedis not whether such proceedings are a form of \"execution\" in the sense, for example, that a writ of seizure and sale is a form of execution. The relevant question, rather, is whether they are proceedings properly taken on the registered judgment as a final and conclusive judgment, as opposed to proceedings seeking to impeach the existence or validity of the judgment. 26    For these reasons, I would hold that on a proper construction of these provisions of the Act a bankruptcynotice can be founded upon a judgment registered under the Act. (emphasis added) 16     Warren Khoo J also held (at [24]) that the purpose of adding the qualification “but in so far only as relates to execution under this section” in s 3(3)(b) of the RECJA was merely to prevent a judgment debtor from attempting to impeach the registered judgment in Singapore rather than before the original court that heard the substantive dispute. In this context, the judge opined that “execution” in s 3(3)(b) of the RECJA has the wide meaning (iethe meaning as contended by Bakrie) rather than the narrow meaning (iethe meaning contended by GDAF) since the RECJA does not refer to the various modes of execution of a registered judgment. 17     However,Re Cheah Theam Sweeis not the only local case on that issue. InRe Cheah Theam Swee, Warren Khoo J referred with approval toRe Loo Choon Beng(unreported) andRe Tan Patrick, ex parte Walter Peak Resorts Ltd (in receivership)[1994] 2 SLR(R) 379 (“Patrick Tan”), where the court in both cases also had to consider the question whether bankruptcy proceedings could properly be taken out on a Commonwealth judgment in the light of s 3(3) of the RECJA. In fact, Warren Khoo J (at [28]) asserted that the court in the other two cases had reached the same conclusion as he did by a different route and that all these decisions would result in a uniformity of treatment of judgments registered under the RECJA and the Reciprocal Enforcement of Foreign Judgments Act (“REFJA”) (which relates to the recognition and enforcement in Singapore of foreign judgments of certain countries to which the REFJA applied). 18     InPatrick Tan, Lai Kew Chai J opined (at [6]) that s 4(2) of the REFJA (Cap 265, 1985 Rev Ed)[note: 6], assisted in the contextualisation of s 3(3) of the RECJA. This was because the REFJA and the RECJA, although structured differently, were couched in similar enough terms to make it clear that the two pieces of legislation were meant to complement each other and thus it was necessary to bring them in line with each other. 19     This observation by Lai Kew Chai J is supported by the structure of the Rules. Order 67 provides for rules for the enforcement of judgments registered underboththe REFJA and the RECJA. Further, O 67 r 10(1) and (2) adopt the language of s 4(5) of the REFJA, which states: Execution shall not issue on the judgment so long as, under this Part and the Rules of Court made thereunder, it is competent for any party to make an application to have the registration of the judgment set aside or, where such application is made, until after the application has been finally determined. 20     Mr Damodara submitted that O 67 must be consistent with and facilitative of its empowering statute (iethe RECJA) and therefore the meaning of “execution” in O 67 r 10(2) must have the same meaning as “execution” in the RECJA (as interpreted byRe Cheah Theam Swee)[note: 7]. For this submission, he relied on Warren Khoo J’s dicta (at [22]): Since [RECJA], or s 3 [RECJA], does not refer to the various modes of execution of a registered judgment, it is difficult to construe the words “execution under this section” as meaning execution in the narrower sense. 21     However, Mr Damodara’s argument appears to have used the wrong starting point. Even if his argument is accepted in principle, given that O 67 r 10 adopts the wording of s 4(5) of the REFJA (see [19] above), the analysis should perhaps have started with the meaning of “execution” in the REFJA and not the RECJA. 22     It seems clear fromPatrick Tanthat s 4(4) of the REFJA, like s 3(3) of the RECJA, deals with thescopeof the Singapore court’s jurisdiction over a foreign judgment, as opposed to purely procedural matters, which is what s 4(5) of the RECJA (and correspondingly, O 67 r 10) deals with. It is therefore not necessarily the case that “execution” should bear the same meaning in s 4(5) of the REFJA and in O 67 r 10. 23     What is the meaning of “execution” in s 4(4) of the REFJA? The provision reads: Subject to the provisions of this Act with respect to the setting aside of registration — (a)    a registered judgment shall, for the purposes of execution, be of the same force and effect; (b)    proceedings may be taken on a registered judgment; (c)    the sum for which a judgment is registered shall carry interest; and (d)    the registering court shall have the same control over the execution of a registered judgment, as if the judgment had been a judgment originally given in the registering court and entered on the date of registration. 24     InPatrick Tan, Lai Kew Chai J held (at [14]) that “proceedings” in s 4(4) of the REFJA encompasses bankruptcy proceedings. Clearly, such an interpretation of “proceedings” is broad enough to cover an EJD as well. The question then is this: in the light of the broad construction of “proceedings” in s 4(4) of the REFJA, was it still necessary to construe the word “execution” in s 4(4) of the REFJA widely in order to demarcate the boundaries of the court’s jurisdiction in relation to foreign judgments registered under the REFJA? It would seem, therefore, that unlike the case of s 3(3)(b) of the RECJA, nothing in the plain language of s 4(2) of the REFJA requires “execution” to have a wide meaning in order to give effect to the legislative intention of the REFJA. 25     One must also have sufficient regard for the context in which “execution” is used in O 67 r 10 (and correspondingly in s 4(4) of the REFJA),iethe words “execution... shall not issue”. On a plain and natural reading of the provision, the word “issue” in relation to “execution” is likely to be shorthand for the issuing of a writ of execution or such other enforcement procedures which have similar consequences for the judgment debtor as a writ of execution. If so, this lends itself to the narrow construction of “execution” and an EJD (the nature of which is discussed below) would not fall within this narrow meaning.",
        "The nature of an EJD": "26     InFagot v Gaches[1943] 1 KB 10 (“Fagot”), the English Court of Appeal had to consider whether an EJD came within the words “enforcement of, any judgment or order of any court... for the payment or recovery of a sum of money” in s 1(1) Courts (Emergency Powers) Act 1939: Subject to the provisions of this section, a person shall not be entitled, except with the leave of the appropriate court, to proceed to execution on, or otherwise to the enforcement of, any judgment or order of any court.... for the payment or recovery of a sum of money: Provided that nothing in this sub-section shall apply to - (a) any judgment for the recovery of damages for tort; .... (c) any judgment or order under which no sum of money is recoverable otherwise than in respect of costs. 27     In holding that an EJD did not come within the said words, Goddard LJ observed (at p 12): The object of examining a judgment debtor is to find out whether he has got means, and, incidentally, whether it is worth making an application under the Courts (Emergency Powers) Act, 1939, for leave to proceed to enforce the judgment. The mere fact that a debtor is to be examined to ascertain whether he has any means on which execution may issue does not seem to me to fall within the words of the Courts (Emergency Powers) Act, 1939. 28     Parcq LJ agreed (at p 12) with Goddard J but for a slightly different reason: ... I do not think that normally anyone, whether a lawyer or a layman, would say that a party who applies for an order for the examination of the judgment debtor as to means is executing or enforcing the judgment. 29     The views expressed by both these learned judges are in line with the local authorities. InUnited Overseas Bank Ltd v Thye Nam Loong (S) Pte Ltd and 2 others[1994] SGHC 262, KS Rajah JC held: The order for examination of judgment debtor... enables the judgment creditor to obtain the necessary information from the judgment debtor in order to enforce a judgment... The judgment debtor may be examined to establish his means and assets, and the appropriate methods to enforce the judgment. Towards this end, the court is empowered to order the judgment debtor or officer to attend before the Registrar, and be orally examined on the questions... 30     In fact, this was already the local position prior toFagotas was evident fromRe Sassoon Ezekiel[1933] MLJ 245, where it was held by Mills J (at p 246) that an EJD was merely “discovery in aid of execution”. 31     It is true that an EJD can only be ordered once judgment has been obtained by the judgment creditor. In that sense, an EJD is a step taken towards the enforcement of a judgment because it is a post-judgment proceeding that furthers the successful plaintiff’s interest in obtaining the fruits of his judgment. Yet, the proposition that an EJD is a thing apart from the typical forms of execution is supported by the structure of the Rules. Order 45, which deals with the methods of enforcing judgments, refers to various writs of execution, garnishee proceedings, the appointment of a receiver and an order of committal as means by which a judgment can be enforced. In this regard, the application for an EJD is notably absent from O 45 and is instead found in O 48. 32     On this basis, even if “execution” should take on the wide meaning, then unless it is construed in itsloosestsense to includeany steptaken towards the enforcement of a judgment, I am of the view, having regard to the nature of an EJD, that it would still not fall within “execution” in O 67 r 10(2).",
        "When is an application to set aside a registration order “finally determined” for the purposes of O 67 r 10(2)?": "33     Although it is not necessary for the disposal of the appeal before me, for the sake of completeness, I deal with the issue of whether the application to set aside the Registration Order has been finally determined, notwithstanding the pending CA Appeals against Woo Bih Li J’s decision. 34     Before delving into the parties’ submissions proper, I shall deal with Mr Damodara’s submissions that until the CA Appeals have been finally dealt with,no effectshould be given to the Registration Order. Mr Damodara argues that this is premised on the logic that there can be no EJD application without a judgment first being awarded and the EJD must arise as a result of giving effect to the judgment.[note: 8]The assumption appears to be that a judgment that is pending appeal has no legal effect. This is incorrect as a matter of law for a judgment takes effect from the day it is pronounced. GDAF was therefore entitled to apply for an EJD from the date of the assistant registrar’s judgment. 35     Notwithstanding the above, the implicit thrust of Mr Damodara’s submissions is that, assuming that an EJD constitutes “execution” for the purposes of O 67 r 10(2), the application to set aside the Registration Order is only finally determined once all avenues of appeal have been exhausted. 36     On the other hand, Mr Chua submitted that an application was finally determined once it was conclusively dealt with by a court of competent jurisdiction which had the benefit of arguments from both parties (in this case before the assistant registrar on 24 September 2012), regardless of whether any appeal is pending or whether any right of appeal exists.[note: 9] 37     In support of his contention, Mr Chua sought to apply the meaning of “final and conclusive” in s 3(3) of the REFJA by analogy to “finally determined” in O 67 r 10(2), stressing that the legislative intention of the REFJA (discussed above at [14]) lends weight to this interpretation.[note: 10] 38     I disagreed with Mr Chua’s submissions on this point. The relevant parts of s 3(2) and s 3(3) of the REFJA provide as follows: (2)    Any judgment of a superior court of a foreign country to which this Part extends, other than a judgment of such a court given on appeal from a court which is not a superior court, shall be a judgment to which this Part applies, if — (a)    it is final and conclusive as between the parties thereto; (b)    ... (c)    ... (3)For the purposes of this section, a judgment shall be deemed to be final and conclusive notwithstanding that an appeal may be pending against it, or that it may still be subject to appeal, in the courts of the country of the original court. (emphasis added) 39     Section 3(3) of the REFJA is little more than a restatement of the English common law position in relation to the recognition and enforcement of foreign judgments, where a judgment can only be so recognised and enforced in the English court if it is “final” in the narrow sense that it is not interlocutory and “conclusive” in the sense that if an attempt were to be made by one party to litigate the same point between the same parties in the same country, the other party could defeat the attempt by pleadingres judicata. 40     In fact, it was deemed necessary to include s 3(3) of the REFJA to clarify any potential ambiguity in the interpretation of “final” in s 3(2) of the REFJA, since a natural reading of “final” in s 3(2) of the REFJA suggests that it means no further avenues for either party to raise any arguments in relation to the foreign judgment before the foreign court are available. However, there is no similar clarifying provision in relation to s 4(5) of the REFJA (and correspondingly in O 67 r 10), which suggests that it is the natural meaning of “finally determined” that is to be preferred in s 4(5) of the REFJA (and correspondingly in O 67 r 10),ieno further appeals are possible. 41     Mr Chua sought to rely on the Malaysian case ofRe Lo Kon Wah; ex p Jupiter Securities Sdn Bhd[2000] 5 MLJ 180 (“Re Lo Kon Wah”) to reinforce his point. In that case, the High Court of Kuala Lumpur had to determine whether a summary judgment was a final judgment within the contemplation of s 3(1) of the Bankruptcy Act 1967. In holding that a judgment obtained after a senior assistant registrar had heard arguments from both sides based upon affidavit evidence constituted a final judgment for these purposes, the court distinguishedRe Udos ak Riging, ex p Seabanc Kredit Sdn Bhd[1994] 3 MLJ 383 (“Re Udos”), where the issue was whether a default judgment was considered a final judgment for the purpose of bankruptcy proceedings. 42     I found the discussion inRe Lo Kon Wahabout the meaning of the phrase “final judgment” to be of little assistance in construing the meaning of “finally determined” in O 67 r 10. InRe Lo Kon WahandRe Udos, much depended on the nature of summary proceedings and of default proceedings as well as the relevant legislative provisions in those cases. 43     However, inRe Udos, Abdul Kadir Sulaiman J (citing Lord Esher MR inRe Riddel ex p Earl of Strathmore) on the meaning of “finally determined”, said (at p 387H to 388A): In my view... judgment will only be a final one after the debtor has exhausted his remedy given by law. I find support in the dicta of Lord Esher MR inRe Riddel ex p Earl of Strathmore(1888) 20 QBD 512 where at p 516 he said: ... in my opinion, ‘a final judgment’ means a judgment obtained in an action by which the question whether there was a pre-existing right of the plaintiff against the defendant is finally determined, in favour either of the plaintiff or of the defendant. I think that definition will be found to cover most cases, though perhaps not every one. ... In my opinion the question is, not only was the claim determined, but was it finally determined? It can only have been finally determined if between the two parties to the action it cannot be raised again. (original emphasis in bold italics) 44     I agree that an application to set aside the Registration Order is only finally determined if between the two parties to the action it cannot be raised again,iewhere all avenues of appeal have been exhausted or where the parties are barred from making any further appeals. I therefore found in favour of Bakrie on this point.",
        "Conclusion": "45     In the circumstances, I held that for the purposes of O 67 r 10(2): (a)     an EJD does not come within the meaning of “execution”;  and (b)     an application to set aside the Registration Order is not finally determined until all avenues of appeal in respect of that application have been exhausted. 46     Accordingly, the appeal was dismissed with costs.  [note: 1]Defendant’s Written Submissions at 11E-12A. [note: 2]Defendant’s Written Submissions at 6G-9A. [note: 3]Plaintiff’s Written Submissions at [54]-[55]. [note: 4]Plaintiff’s Written Submissions at [41]-[49]. [note: 5]Plaintiff’s Written Submissions at [42]. [note: 6]Now s 4(4) of the REFJA (Cap 265, 2001 Rev Ed). [note: 7]Defendant’s Written Submissions at 11E-12A. [note: 8]Defendant’s Written Submissions 17G-18B. [note: 9]Plaintiff’s Written Submission [58]-[61]. [note: 10]Plaintiff’s Written Submission [62]-[64]."
    }
}