{
    "case_title": "Law Society of Singapore\n      v\n      Wan Hui Hong James",
    "ncitation": "[2013] SGHC 85",
    "coram": "Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1       This was an application by the Law Society of\n                    Singapore (“the Law Society”) pursuant to s 94(1) read with\n                    s 98 of the Legal Profession Act (Cap 161, 2009 Rev Ed)\n                    (“the Act”) for Wan Hui Hong James (“the\n                    respondent”), an advocate and solicitor of 42 years’ standing, to\n                    be punished under s 83 of the Act. 2       The misconduct to which the respondent admitted\n                    consisted of accepting a significant gift from a client without advising the\n                    client to seek independent advice in respect of the gift. The respondent further\n                    admitted that he had thereby breached r 46 of the Legal Profession\n                    (Professional Conduct) Rules (Cap 161, R 1, 2010 Rev Ed)\n                    (“the Rules”). However, the respondent denied the Law\n                    Society’s allegation that he had been dishonest. After hearing parties, we\n                    found that the respondent had indeed been dishonest, and accordingly, we ordered\n                    that he be struck off the roll. We now set out the reasons for our\n                    decision.",
        "The rule on solicitors receiving gifts from clients": "3       Before turning to the facts and issues in this\n                    case, we take the opportunity to clarify the rationale and purport of r 46\n                    of the Rules. As there has been no judicial guidance thus far on r 46\n                    – this being the first occasion on which a breach of that rule has come\n                    before this Court as far as we can ascertain – we think that it would now\n                    be appropriate to provide some such measure of guidance to the profession.\n                    Rule 46 reads as follows: Gift by will or inter vivos from\n                        client 46.    Where a client\n                            intends to make asignificant gift by will or inter\n                                vivos, or in any other manner, to – (a)    an advocate and\n                                solicitoracting for\n                            him; (b)    any member of\n                                the law firm of the advocate and solicitor; (c)    any member,\n                                director or employee of the law corporation of the advocate and\n                                solicitor; (ca)   any partner or\n                                employee of the limited liability law partnership of the advocate\n                                and solicitor; or (d)    any member of\n                                the family of the advocate and solicitor, the advocate and solicitorshall not act for the\n                            clientandshall advise the client to be independently advised in respect of the\n                            gift. [original emphasis omitted; emphasis added in italics and bold\n                        italics]",
        "The rule in other jurisdictions": "4       In England, the professional obligations of\n                    solicitors are currently described in the Solicitors Regulation Authority Code\n                    of Conduct 2011 (“the English Code of Conduct 2011”). The approach\n                    taken there is a novel one called “[o]utcomes-focused regulation”.\n                    This approach eschews specific rules of conduct, and instead lays down conduct\n                    guidelines at a higher level of generality by defining broad mandatory\n                    “Principles” and “outcomes”.\n                    “Principles” include “not allow[ing] your independence to\n                    be compromised” and “act[ing] in the best interests of each\n                    client”, while “outcomes” include “treat[ing] your\n                    clients fairly” (O(1.1)) and “provid[ing] services to your clients\n                    in a manner which protects their interests in their matter, subject to the\n                    proper administration of justice” (O(1.2)). The English Code of Conduct\n                    2011 also includes certain “indicative behaviours” which, while\n                    not mandatory, describe conduct which “may tend to show”\n                    achievement of the “outcomes” and compliance with the\n                    “Principles” - both of whicharemandatory. “Indicative behaviour” 1.9 (IB(1.9)) in the English\n                    Code of Conduct 2011 is the closest analogue to r 46 of the Rules, and\n                    reads as follows: [R]efusing to act where your client proposes to make a gift of significant\n                        value to you or a member of your family, or a member of your firm or their\n                        family, unless the client takes independent legal advice ... IB 1.9 of the English Code of Conduct 2011 is based on\n                    r 3.04 of an earlier version of the same code in 2007 (“the English\n                    Code of Conduct 2007”). The English Code of Conduct 2007 was not\n                    “outcomes-focused” like the English Code of Conduct 2011, but\n                    instead prescribed specific rules of conduct. Rule 3.04 of the English Code\n                    of Conduct 2007 read: 3.04 Accepting gifts from\n                            clients Where a client proposes to make a\n                        lifetime gift or a gift on death to, or for the benefit of: (a)    you; (b)    any principal, owner or employee of your\n                                firm; (c)    a family member of any of the\n                            above, and the gift is of a significant amount, either in itself or having regard\n                        to the size of the client’s estate and the reasonable expectations of\n                        the prospective beneficiaries, you must advise the client to take\n                        independent advice about the gift, unless the client is a member of the\n                        beneficiary’s family. If the client refuses, you must stop acting for\n                        the client in relation to the gift. 5       Another analogue to r 46 of the Rules may\n                    be found in r 11.2 of the Australian state of New South Wales’\n                    Professional Conduct and Practice Rules 1995 (“the New South Wales\n                    rules”) as follows: 11.2  A practitioner who receives instructions from a\n                            person to – 11.2.1    draw a will under which the practitioner or an\n                            associate will, or may, receive a substantial benefit other than any\n                            proper entitlement to commission ... and the reasonable professional\n                            fees of the practitioner or the practitioner’s firm;\n                        or 11.2.2    draws any other instrument under which the\n                            practitioner or an associate will, or may, receive a substantial benefit\n                            in addition to the practitioner’s reasonable remuneration ... must\n                            decline to act on those instructions and offer to refer the person, for\n                            advice, to another practitioner who is not an associate of the\n                            practitioner, unless the person instructing the practitioner is\n                            either: 11.2.3    a member of the practitioner’s immediate\n                            family; or 11.2.4    a practitioner, or a member of the immediate\n                            family of a practitioner, who is a partner, employer, or employee, of\n                            the practitioner. 6       We should say that we refer to these rules in\n                    other jurisdictions for the points of divergence, rather than the convergence\n                    that exists between them and r 46 of the Rules.",
        "Rationale for the rule": "7       It is often said that the rule on advocates and\n                    solicitors receiving gifts from their clients stems from the fact that an\n                    advocate and solicitor stands as a fiduciary in relation to his client. The\n                    broad idea behind this statement is undoubtedly correct, but it might perhaps\n                    benefit from a greater degree of clarity because, in the words of\n                    Professor P D Finn (“Finn”) at the beginning of his\n                    seminal workFiduciary Obligations(The Law Book\n                    Company Ltd, 1977), the term “fiduciary” is “one of the\n                    most ill-defined, if not altogether misleading terms in our law” (at\n                    para 1). In Finn’s view, it is preferable to focus not on fiduciaryrelationships, but on fiduciaryobligations(at paras 2–3): On the modern usage of “fiduciary”, Sealy concluded that it\n                        is not definitive of a single class of relationships to which fixed rules\n                        and principles apply.Rather its use has generally been\n                            descriptive, providing a veil behind which individual rules and\n                            principles have been developed.This conclusion—an\n                        incontestable one—is the starting point of this work. In the following\n                        pages it will be suggested that it is meaningless to talk of fiduciary\n                        relationships as such. Once one looks to the rules and principles which\n                        actually have been evolved, it quickly becomes apparent that it is pointless\n                        to describe a person—or for that matter a power—as being\n                        fiduciary unless at the same time it is said for the purposes of which\n                        particular rules and principles that description is being used.These rules are everything. The description\n                            “fiduciary”, nothing.... ...It is not because a person is a\n                            “fiduciary” or a “confidant” that a rule\n                            applies to him. It is because a particular rule applies to him that he\n                            is a fiduciary or confidantfor its\n                            purposes. [emphasis in orginal in italics; emphasis added in bold] In the same vein, in the English Court of Appeal case ofBristol and West Building Society v Mothew[1998]\n                    Ch 1, Millett LJ (as he then was) opined at 18C that a fiduciary\n                    “is not subject to fiduciary obligations because he is a fiduciary; it is\n                    because he is subject to them that he is a fiduciary”. 8       Accordingly, we would say that the rule on\n                    advocates and solicitors receiving gifts from their clients stems from the fact\n                    that the relationship between an advocate and solicitor and his client is of\n                    such a nature as to warrant the imposition of fiduciary obligations on him. What\n                    then is the nature of their relationship? It is one in which the advocate and\n                    solicitor undertakes to act on behalf of his client and to take up his\n                    client’s cause as his own, which then gives rise to a duty to act in the\n                    client’s interests. In this relationship the advocate and solicitor almost\n                    invariably assumes a position of ascendency and influence over his client who\n                    then relies on and trusts him. As a consequence, he is subject to two fiduciary\n                    obligations, adopting for present purposes Finn’s classification of the\n                    various fiduciary obligations as outlined at paras 161–168. The first\n                    is not to put himself in a position where his personal interests conflict with\n                    his duty to act in the interests of his client. The second is not to exercise\n                    undue influence over his client,ie, not to\n                    misuse, whether actively or passively, his influence over his client. When his\n                    client intends to make a gift to him, or to a person with whom he has close\n                    personal or professional ties, these two fiduciary obligations are related in\n                    the sense that, even though the apparent interests of both parties seem to be\n                    aligned (since both parties seem to desire that the gift be made to him), he is\n                    deemed to be in a position of conflict because of the presumption that his\n                    client is making the gift under his undue influence. As Vaughan Williams LJ\n                    noted inWright v Carter[1903] 1 Ch 27\n                        (“Wright”) at 50: [W]henever you have these fiduciary relations (and in the present case we\n                        have to deal with the particular fiduciary relation of solicitor and\n                        client),the moment the relation is established, there\n                            arises a presumption of influence, which\n                            presumption will continue as long as the relation, such as that of\n                            solicitor and client,continues, or at\n                            all events until it can be clearly inferred that the influence had come\n                            to an end.[emphasis added in italics and bold\n                        italics] Wrightwas not a case involving\n                    disciplinary proceedings against a solicitor. Rather, it was a civil case in\n                    which the plaintiff sought to set aside a gift that he had made to his\n                    solicitor. Yet the essence of the principle articulated therein by Vaughan\n                    Williams LJ nonetheless remains relevant even in disciplinary cases,\n                    because that same restraint which makes a gift made to a solicitor liable to be\n                    set aside would also place the solicitor under an ethical duty to refrain from\n                    accepting a questionable gift from his client. 9       When a client intends to make a gift to an\n                    advocate and solicitor, there is an ethical duty on him to remove, as far as he\n                    can, any vestiges of influence (or the appearance thereof) he might have over\n                    his client by virtue of their relationship. In the words of Dixon J in the\n                    High Court of Australia inJohnson v Buttress(1936) 56 CLR 113 at 135: It is his duty to use his position of influence in the interest of no one\n                        but the man who is governed by his judgment, gives him his dependence and\n                        entrusts him with his welfare. When he takes from that man a substantial\n                        gift of property,it is incumbent upon him to show that\n                            it cannot be ascribed to the inequality between them which must arise\n                            from his special position.He may be taken to possess a\n                        peculiar knowledge not only of the disposition itself but of the\n                        circumstances which should affect its validity ; he has chosen to\n                        accept a benefit which may well proceed from an abuse of the authority\n                        conceded to him, or the confidence reposed in him ; and the relations\n                        between him and the donor are so close as to make it difficult to\n                        disentangle the inducements which led to the transaction. [emphasis\n                        added] The removal of any vestiges of influence is, in essence, what r 46 of\n                    the Rules mandates. It stipulates two distinct obligations to be met in the\n                    discharge of that ethical duty. One is that the advocate and solicitor must\n                    advise the client to be independently advised. The other is that he must refuse\n                    to act for his client, or to act for his client any longer. The scope and\n                    content of these two obligations will be considered below. When an advocate and\n                    solicitor fails to comply with r 46 of the Rules, disciplinary action is taken\n                    against him because he is taken to have misused his influence over his client,\n                    and thus to have put himself in a position where his personal interests conflict\n                    with his duty to act in the interests of his client.",
        "“Significant gift”": "10     As the text makes clear, r 46 of the\n                    Rules applies only when a “significant” gift is intended. Where\n                    the gift is of a trifling nature, it is not presumed to have been made or\n                    intended under the influence of the solicitor-client relationship, because it is\n                    the sort of gift that would not seem untoward in any ordinary relationship\n                    between non-strangers. But where the gift is a significant one, it is no longer\n                    readily explicable on the basis of ordinary sentiment, and this attracts the\n                    presumption that it is explicable only on the basis of influence arising from\n                    the solicitor-client relationship. In the context of r 46 of the Rules, a\n                    “significant” gift must mean not only a gift significant in\n                    absolute terms, but also a gift significant having regard to the client’s\n                    means and the reasonable expectations of other prospective beneficiaries, if\n                    any. This is the amplified definition of “significant” in the\n                    English Code of Conduct 2007, and it is, in our view, also the correct meaning\n                    to be attributed to “significant” as used in r 46 of the Rules. An\n                    improvident widow who intends a gift of all that she has in the world surely\n                    intends a significant gift even if its monetary value may not be significant in\n                    relation to the assets of the advocate and solicitor. In the final analysis,\n                    what is significant will be fact sensitive and assessed on a case by case\n                    basis. 11     As a rule of thumb, the more significant the\n                    gift, the stronger the presumption that the gift is influenced by the\n                    solicitor-client fiduciary relationship, and the more imperative the need for\n                    the client to be independently advised in respect of the gift.",
        "“Shall advise the client to be independently\n                advised”": "12     The advocate and solicitor to whom his client\n                    intends a significant gift is obliged to advise his client to be independently\n                    advised in respect of the gift, because the dispassionate counsel of an\n                    uninvolved party is needed to establish that his client’s judgment has not\n                    been clouded by influence arising from their solicitor-client relationship. It\n                    should be observed that this obligation arises regardless of the nature of the\n                    matter in which the advocate and solicitor acts for his client. In New South\n                    Wales, the obligation to refer the client for independent advice arises only\n                    when the nature of the solicitor’s involvement is that of drawing up the\n                    client’s will, or any other instrument by which a disposal of his\n                    client’s property is effected. In Singapore, by contrast, the width of\n                    r 46 of the Rules is such that the obligation arises even if the intended\n                    gift is wholly unrelated to the matter in which the advocate and solicitor is\n                    acting for the client. 13     What then does it mean for the client to be\n                    independently advised? The phrase “independent advice” is defined\n                    in r 32 of the Rules, but that definition applies only to\n                    rr 33–34, and in any event it does not elaborate on what the content\n                    of the advice should be. As such we look elsewhere for guidance. The question\n                    arises not infrequently in civil cases where the donor of a gift seeks to set\n                    aside a gift made to a fiduciary (not necessarily a solicitor). In that context,\n                    the Privy Council inInche Noriah v Shaik Allie bin\n                        Omar[1929] AC 127 (“Inche\n                        Noriah”) declared at 135: It is necessary for the [fiduciary] to prove that the gift was the result\n                        of thefree exercise of independent will. The\n                        most obvious way to prove this is by establishing that the gift was made\n                        afterthe nature and effect of the transaction had been\n                            fully explainedto the donor by some independent andqualifiedperson so completely as to\n                        satisfy the Court that the donor was acting independently of any influence\n                        from the [fiduciary] and with thefull appreciation of\n                            what he was doing... [emphasis added] The following observations of Fletcher Mouton LJ in an earlier\n                    case of the English Court of AppealIn re Coomber;Coomber v Coomber[1911] 1 Ch 723\n                        (“Coomber”) at 729–730 are\n                    also instructive: I think that a solicitor best gives advice when he takes care that the\n                        clientunderstands fully the nature of the act and the\n                            consequences of that act. He is not bound to say “I\n                        will advise you to do it” ; or “if I were you I would do\n                        it” ; or “if I were you I would not do it.”\n                        Nothing of that kind is necessary for competent and independent advice. All\n                        that is necessary is thatsome independent person, free\n                            from any taint of the relationship, or of the consideration of interest\n                            which would affect the act, should put clearly before the\n                        person what are the nature and the consequences of the act. It is for adult\n                        persons of competent mind to decide whether they will do an act, and I do\n                        not think that independent and competent advice means independent and\n                        competent approval. It simply means thatthe advice shall\n                            be removed entirely from the suspected\n                        atmosphere; and that from the clear language of an\n                        independent mind, they should know precisely what they are doing. [emphasis\n                        added] It will be noted that, while Fletcher Moulton LJ was conscious of\n                    the need for a prospective donor of a gift to receive independent advice when\n                    the intended recipient of the gift is a fiduciary, he was also concerned that\n                    the standard of independent advice required should not be unduly\n                high. 14     The preceding remarks were all addressed to\n                    the question of a fiduciary’s entitlement to retain a gift, and not the\n                    question of whether a solicitor had fulfilled his professional obligation to\n                    advise his client to be independently advised in respect of an intended gift.\n                    Nevertheless, these remarks provide helpful guidance on the scope of a\n                    solicitor’s ethical duties in that regard, insofar as they inform what he\n                    should say when advising his client to be independently advised. 15     It should be remembered that the obligation of\n                    the advocate and solicitor under r 46 of the Rules is toadvisethe client to be independently advised. He is in no\n                    position to dictate or supervise the content of the independent advice, and\n                    therefore does not deserve sanction just because the independent advice is\n                    somehow inadequate. On the other hand, he does not fulfil his obligation merely\n                    by telling his client “You should seek independent advice” without\n                    more. Something in the way of the formulation of Cozens-Hardy MR inCoomberat 726 comes closer to the mark:\n                    “I cannot take this unless you have independent advice; consult an\n                    independent solicitor, put the matter before him, and he must explain the matter\n                    fully to you”. Yet even that appears too perfunctory to suffice,\n                    especially if it is said as an afterthought – so what more must the\n                    advocate and solicitor do? 16     In our view,Royal Bank of\n                        Scotland plc v Etridge (No 2)[2002] 2 AC 773\n                        (“Etridge”) provides a measure\n                    of guidance, even though that case dealt with a rather different set of facts.\n                    InEtridgea number of wives had each charged her\n                    interest in her home in favour of a bank as security for her husband’s or\n                    his company’s debts. Each wife later sought to set aside this charge on\n                    the ground that she had been under the undue influence of her husband.\n                    Lord Nicholls described, at [79], the steps that a bank wishing to uphold\n                    the transaction should take whenever a transaction is questionable enough to put\n                    the bank on inquiry: ... I consider the bank should take steps to checkdirectly with the wifethe name of the solicitor she wishes\n                        to act for her. To this end, in future the bank should communicate directly\n                        with the wife, informing her that for its own protection it will require\n                        written confirmation from a solicitor, acting for her, to the effect that\n                        the solicitor has fully explained to her the nature of the documents and the\n                        practical implications they will have for her. She should be told that the\n                        purpose of this requirement is that thereafter she should not be able to\n                        dispute she is legally bound by the documents once she has signed them. She\n                        should be asked to nominate a solicitor whom she is willing to instruct to\n                        advise her, separately from her husband, and act for her in giving the\n                        necessary confirmation to the bank ... ... ... If the bank is not willing to undertake the task of explanation\n                        itself, the bank must provide the solicitor with the financial information\n                        he needs for this purpose. Accordingly it should become routine practice for\n                        banks, if relying on confirmation from a solicitor for their protection, to\n                        send to the solicitor the necessary financial information. What is required\n                        must depend on the facts of the case. [emphasis in original] 17     Notwithstanding the dissimilarities betweenEtridgeand the present disciplinary\n                    proceedings before us,Etridgeis of assistance\n                    because, in one crucial respect, the position of the banks in that case is\n                    similar to the position of an advocate and solicitor to whom his client intends\n                    a significant gift. Both have an obligation to advise a person presumed to be\n                    under the influence of another person to be independently advised, so as to\n                    ensure that the former makes a decision which is an uninfluenced expression of\n                    personal volition. This obligation exists even though neither banks nor\n                    advocates and solicitors have direct control over the content of independent\n                    advice received by the person under the presumed influence. Therefore, the steps\n                    which a bank should take in anEtridge-type\n                    situation, and the steps which an advocate and solicitor should take in a\n                    situation falling under r 46 of the Rules, are directed at the same goal\n                    (safeguarding the autonomy of the person presumed to be influenced), and subject\n                    to the same limitation (inability to ensure personally that the independent\n                    advice is of sufficiently emancipating quality, owing to an inability to\n                    intervene directly in that independent advice). It follows that the steps to be\n                    taken by both should not be too divergent. 18     Drawing together the threads identified inInche Noriah,CoomberandEtridge, we now\n                    elaborate on the content of an advocate and solicitor’s obligation, under\n                    r 46 of the Rules, to advise his client to be independently advised in\n                    respect of the gift: (a)     He should explain to his client the\n                        reason why independent advice is required,viz, to ensure that the client’s decision to make a gift\n                        to him is a free exercise of independent will, given the presumption that\n                        the decision is influenced by the solicitor-client relationship. He should\n                        explain that, even if the client does not perceive any influence, such\n                        influence may nevertheless exist,eg,\n                        influence arising from the client’s gratitude towards the advocate and\n                        solicitor for help in navigating the forbidding labyrinth that is the law;\n                        under such influence, decisions may be made that the client will later, upon\n                        sober reflection, regret. He should explain that the independent advice must\n                        give the client a full understanding of the nature and consequences of the\n                        gift which is intended. He should emphasise, repeatedly if necessary, the\n                        importance of receiving independent advice. (b)     Since the independent advice must proceed from\n                        someone sufficiently qualified to render it, we would, for the sake of\n                        clarity, draw bright lines and make it a rule that the person giving the\n                        independent advice be another advocate and solicitor, no matter how\n                        uncomplicated the legal issues involved. (c)     The donee advocate and solicitor,ie, the advocate and solicitor to whom the gift is\n                        intended, should ask his client to nominate the advising advocate and\n                        solicitor. He should then ensure that the advising advocate and solicitor\n                        has no connections or involvement which would in any way compromise\n                        independence. This is not to say that the advising advocate and solicitor\n                        can never be someone known to the donee advocate and solicitor – given\n                        the relatively small size of the legal profession here, it is perhaps\n                        difficult for legal professionals to avoid knowing one another. This is also\n                        not to say that the donee advocate and solicitor absolutely cannot refer his\n                        client to an advising advocate and solicitor, even to an advising advocate\n                        and solicitor whom he knows. However, if the advising advocate and solicitor\n                        is known to the donee advocate and solicitor, and issues subsequently arise\n                        as to the propriety of the gift, then the advice given by the advising\n                        advocate and solicitor, as well as the context in which the advising\n                        advocate and solicitor became involved, will come under even closer\n                        scrutiny, and all the more so if the advising advocate and solicitor was not\n                        chosen by the client but was referred to the client by the donee advocate\n                        and solicitor. (d)     The donee advocate and solicitor should advise his client to obtain written\n                        confirmation from the advising advocate and solicitor to the effect that a\n                        full explanation of the nature of the transaction, and its practical\n                        implications, has been furnished. (e)     If the transaction by which the gift is to be made is of\n                        some complexity, he should provide the advising advocate and solicitor with\n                        all information necessary to make the independent advice sufficiently\n                        comprehensive. However, in providing such information, he must not say or do\n                        anything which would influence the views of the advising advocate and\n                        solicitor in respect of the transaction. (f)     He may tell the client that, whatever the\n                        content of the independent advice, the decision is ultimately the\n                        client’s to make, but he must not convey even the slightest impression\n                        that such independent advice is but a formality. (g)     Should the client decline to seek\n                        independent advice for whatever reason, he should insist with some force\n                        that his client do so, and reiterate the importance of receiving that\n                        independent advice. In the absence of such advice, the advocate and\n                        solicitor should decline to accept the gift.",
        "“Shall not act for the client”": "19     The other obligation stipulated in r 46 of the\n                    Rules is that the advocate and solicitor “shall not act for the\n                    client”. Now r 46 of the Rules itself is ambiguous on whether the\n                    phrase “in respect of the gift” qualifies only the obligation to\n                    “advise the client to be independently advised”, or whether it\n                    qualifies also the other obligation to “not act for the client”.\n                    Approaching this ambiguity in the abstract, it is not difficult to see why an\n                    advocate and solicitor should be obliged to refuse to act when he acts\n                    “in respect of the gift”. When he so acts, the client is presumed\n                    to look to him for advice and guidance concerning the gift. Consequently, it is\n                    thus presumed that he continues to exert influence over the client’s\n                    judgment in relation to the gift, notwithstanding the independent advice which\n                    the client may have received. Conversely, if the advocate and solicitor acts for\n                    the client not “in respect of the gift” – in other words, in\n                    a matter unrelated to the gift – he is not relied upon for advice and\n                    guidance pertaining to the gift, and it is not presumed that the client’s\n                    judgment in making the gift was influenced by him. This is so long as the client\n                    received independent advice or was at least advised to be independently advised.\n                    Therefore, as a matter of commonsense, our view is that the phrase “in\n                    respect of the gift” qualifies also the obligation “shall not act\n                    for the client”. In other words, the advocate and solicitor’s\n                    obligation to refuse to act arises only when continuing to act would be acting\n                    “in respect of the gift”. 20     What then does it mean to act “in\n                    respect of the gift”? A clear instance of so acting is when the advocate\n                    and solicitor draws up an instrument by which a disposal of the client’s\n                    property is effected, such as a will. By drawing up such an instrument, he would\n                    be directly assisting the client’s intended disposal of the client’s\n                    property to himself – that is, the intended gift – and he is\n                    therefore considered to be acting “in respect of the gift”.\n                    Contrariwise, a clear instance of not acting “in respect of the\n                    gift” is when he acts for his client in a litigation matter, and the gift\n                    which the client intends does not require his assistance to effect,eg, a gift of cash or in the form of a cheque. Yet,\n                    between such clear instances lies murkier territory. For instance, does an\n                    advocate and solicitor act in “respect of the gift” when he acts\n                    in the sale of his client’s property, and the client intends to make a\n                    gift to him of part of the sale proceeds? While much will depend on the facts\n                    and circumstances of each case, the essential question in each inquiry is\n                    whether the nature of the matter in which the advocate and solicitor acts for\n                    his client is such as to warrant the presumption that the client’s\n                    judgment in making the gift is influenced by the advocate and\n                solicitor. 21     All we have said on the obligation to refuse\n                    to act is consistent with the sparse comments considering that obligation.\n                    Jeffrey Pinsler,Ethics and Professional Responsibility:\n                        A Code for the Advocate and Solicitor(Academy Publishing, 2007)\n                    at para 17-018 states r 46 of the Rules as providing that the advocate\n                    and solicitor “must not act, and is obliged to counsel the client to be\n                    independently advised, in respect of the gift”; the comma after the words\n                    “independently advised” indicates the view that “in respect\n                    of the gift” qualifies also the obligation “shall not act for the\n                    client”. TheGuide to Professional Conduct for\n                        Advocates and Solicitors(Alvin Chen gen ed) (Law Society of\n                    Singapore, 2011) at p 31 reproduces a Guidance Note of 4 December 2007\n                    from the Law Society’s Ethics Committee expressing the view that, where a\n                    solicitor’s parents instruct him to prepare a will under which he would\n                    receive a gift, “rule 46 [of the Rules] does not prohibit a\n                    solicitor from acting for his parents in contentious matters unrelated to the\n                    gift, subject to the general rules on conflict of interest and common\n                    law”. 22     Hence where the advocate and solicitor does\n                    not act “in respect of the gift”, there is no obligation on him to\n                    refuse to act for his client; his only obligation is to advise the client to be\n                    independently advised in respect of the gift. However, where he does indeed act\n                    “in respect of the gift”, then he has two obligations which are\n                    cumulative and not alternative. Unlike the English Code of Conduct 2007 where\n                    the obligation to refuse to act only arises if the client refuses to take\n                    independent advice about the gift, an advocate and solicitor in Singapore who\n                    acts “in respect of the gift” is obliged both to refuse to act and\n                    to advise the client to be independently advised.",
        "Client who is related to the advocate and solicitor": "23     In the English Code of Conduct 2007 and the\n                    New South Wales rules, the solicitor’s obligations to refuse to act and to\n                    advise the client to be independently advised do not arise where the client is\n                    closely related to the solicitor. In Singapore, however, r 46 of the Rules\n                    contains no such exception. Those obligations apply regardless of the degree of\n                    propinquity in the relationship between an advocate and solicitor and his\n                    client. As is made clear in the same Guidance Note from the Law Society’s\n                    Ethics Committee referred to at [21] above, the obligations apply even if it is\n                    the solicitor’s own parents who instruct him.",
        "Client who is not a fully competent adult": "24     By its terms, r 46 of the Rules assumes\n                    that the client is one to whom independent advice would be of some utility. This\n                    presupposes a client who is capable of making decisions for herself in a\n                    rational manner. In our view, this means that where the client is not, or does\n                    not appear to be, such a fully competent adult, even more stringent obligations\n                    must apply. To quote Fletcher Moulton LJ inCoomberat 730: When a man takes upon himself the responsibility of advising those who are\n                        not adults, who are not persons capable of managing their own affairs in the\n                        broadest sense of the word, other conditions may arise ... There, the judge was alluding to additional obligations which might be\n                    imposed on the solicitor purporting to render independent advice; but equally,\n                    ora fortiori, if the advocate and solicitor to\n                    whom the gift is intended wishes to avail himself of the apparent generosity of\n                    one who is not a fully competent adult, additional obligations must\n                    apply. 25     Of course, it would be best if the advocate\n                    and solicitor declines entirely to retain the intended gift or any part of it.\n                    On the other hand, if he wishes to retain it, he does not discharge his ethical\n                    duty merely by complying with the letter of r 46 of the Rules, however\n                    comprehensive the independent advice received by the client might be. Extra\n                    steps will have to be taken, and what those extra steps are will depend on the\n                    circumstances of the case. If, for example, the client is one with a history of\n                    mental health problems, the advocate and solicitor must at least ensure that she\n                    undergoes proper psychiatric evaluation to certify her ability to understand the\n                    nature and effect of what she is doing.",
        "Civil consequences": "26     We emphasise that it will always be preferable\n                    for advocates and solicitors to decline to accept gifts from clients, unless the\n                    value of the gift is insignificant both in absolute terms and relative to the\n                    client’s means. This is because, even if the advocate and solicitor can\n                    show that he fulfilled his ethical duties under r 46 of the Rules, the gift\n                    may nevertheless be liable to be set aside. We do not intend here to discuss at\n                    any length the law on setting aside gifts for undue influence. Suffice to say,\n                    inWright, Stirling LJ echoed\n                    Lord Eldon’s statement in an earlier case that it was “almost\n                    impossible” to uphold a gift to a solicitor from his client (at 57); inEtridge, Lord Nicholls said that the\n                    donor of a gift may “understand fully the implications of a proposed\n                    transaction, for instance, a substantial gift, and yet still be acting under the\n                    undue influence of another” (at [20]), which would vitiate the gift. Take\n                    the example of a client with a history of mental health problems. If an advocate\n                    and solicitor refuses to act for her, sends her for psychiatric evaluation,\n                    obtains certification of her fitness to understand what she is doing and to\n                    manage her own affairs, and refers her to an independent and qualified third\n                    party for advice, he may well have fulfilled his ethical duties as an advocate\n                    and solicitor, and hence not be liable to disciplinary sanction. Yet it does not\n                    follow that, if the client subsequently applies to set aside the gift, the court\n                    will necessarily hold that he is entitled to retain the gift.",
        "Relationship with the rule prohibiting purchase of client’s\n                assets at an undervalue": "27     It is worth noting that there may be some\n                    overlap between rr 45 and 46 of the Rules. Under r 45, an advocate and\n                    solicitor may purchase goods and assets from his client only at the prevailing\n                    market price or at a reasonable price. He is prohibited, in other words, from\n                    purchasing those goods or assets at an undervalue. However, it is possible to\n                    re-conceptualise a purchase at an undervalue as a purchase at fair value\n                    together with a gift of a refund of part of the purchase price. Hence, if the\n                    purchase is at a significant undervalue, it may be caught by r 46 as well\n                    as r 45.",
        "Facts": "28     We turn now to the facts of the present\n                    case. 29     The respondent was an advocate and solicitor\n                    who practised as sole proprietor under the name M/s James Wan & Co. He\n                    was admitted to the Singapore Bar on 14 October 1970. In the matter out of\n                    which these disciplinary proceedings arose, the respondent’s client was\n                    Madam Chiang Choy Peng (“Mdm Chiang”). She was born on\n                    13 March 1939.",
        "Mdm Chiang’s background": "30     Mdm Chiang became the owner of 18 Maria\n                    Avenue, Singapore 456749 (“the Property”) on 27 January 1961.\n                    Unfortunately, years later, she was found wandering in the streets. She was\n                    referred to Woodbridge Hospital and treated there for schizophrenia. Having\n                    improved with treatment, she was discharged and admitted to the Woodlands Home\n                    for the Aged[note: 1](“the Woodlands Home”) on\n                    11 March 1980. When the Woodlands Home was closed on 28 April 1997,\n                    she was transferred to the Bukit Batok Home for the Aged[note: 2]. 31     On 6 May 1999, the Singapore Land\n                    Registry (“the Registry”) wrote to Mdm Chiang naming her as\n                    the owner of the Property, and requesting that she verify her identity for\n                    purposes of conversion to the new system of land registration[note: 3].\n                    The then-Superintendent of the Bukit Batok Home for the Aged, Mr Yeo Lee\n                    Hock (“Yeo”), helped her to respond, and on 28 April 2000 the\n                    Registry wrote again to Mdm Chiang informing her that a Certificate of\n                    Title over the Property had been issued in her name[note: 4]. They also\n                    informed her that, in order to collect this Certificate of Title, she had to\n                    produce her National Registration Identity Card and the original Deed of\n                    Conveyance. Mdm Chiang was unable to locate the Deed of\n                Conveyance.",
        "The respondent gets involved": "32     The respondent’s involvement began\n                    sometime in March 2001, when Yeo asked him to act for Mdm Chiang. Both Yeo\n                    and the respondent at the material time worshipped at Paya Lebar Methodist\n                    Church. According to Yeo’s file note, he and Mdm Chiang met the\n                    respondent on 17 April 2001[note: 5]. That same day,\n                    Mdm Chiang made a statutory declaration that she had lost or misplaced the Deed\n                    of Conveyance[note: 6]. Regarding Mdm Chiang’s\n                    mental fitness to make this statutory declaration, in a letter from the\n                    Institute of Mental Health (“the IMH”) dated 11 June 2001,\n                    Dr Eu Pui Wai, consultant psychiatrist at Woodbridge Hospital, expressed\n                    his opinion that Mdm Chiang was “mentally fit and capable of making\n                    a Statutory Declaration declaring the loss of a deed of\n                        Conveyance”[note: 7]. This letter was addressed to the\n                    respondent, and was stated to be a response to his “request for a\n                    psychiatric report” on Mdm Chiang.",
        "The respondent instructs Lee Chin Seon": "33     At some point in time, either when he was\n                    first briefed by Yeo or thereafter, the respondent became aware that the\n                    Property was occupied. On 23 April 2001, the respondent wrote to these\n                    occupiers demanding delivery of vacant possession. Their solicitors wrote back\n                    on 30 May 2001 conveying the occupiers’ intention to claim adverse\n                    possession of the Property. The respondent proceeded to brief another advocate\n                    and solicitor, Mr Lee Chin Seon (“Lee”), on\n                    Mdm Chiang’s case. It appears that the respondent and Lee had a\n                    working relationship. The respondent explained that he did so because the matter\n                    was becoming litigious, and he did not handle such litigious matters[note: 8]. Lee\n                    proceeded to take instructions directly from Mdm Chiang. Power of Attorney 34     In a letter to Mdm Chiang dated\n                    20 June 2001[note: 9], Lee noted her “firm\n                    instructions” to execute a Power of Attorney in favour of the respondent,\n                    even though she had children of her own. The letter further noted her\n                    instructions to “dispense with efforts to trace [the] present\n                    whereabouts” of her children, their whereabouts being unknown to her. On\n                    5 July 2001, Lee drew up, and Mdm Chiang signed, a Power of Attorney\n                    giving the respondent a substantial degree of authority to manage her\n                        affairs[note: 10]. In a letter to Mdm Chiang\n                    dated 6 July 2001[note: 11], Lee noted the execution of the Power\n                    of Attorney the previous day. He also purportedly informed her that,\n                    “[a]s advised,” the Power of Attorney “may be revoked at\n                    any time, notwithstanding any provision to the contrary”. Mdm Chiang’s Will 35     In the same letter of 6 July 2001, Lee\n                    noted Mdm Chiang’s “firm instructions” to\n                    “execute a Last Will and Testament” naming the respondent as sole\n                    trustee and beneficiary, “with specific instructions to exclude [her]\n                    children from any distribution from [her] estate”. On 17 July 2001,\n                    Lee drew up, and Mdm Chiang signed, a will making the respondent the sole\n                    trustee and beneficiary of all her assets[note: 12](“the\n                    Will”). In a letter to Mdm Chiang dated 18 July\n                        2001[note: 13], Lee noted the execution of the Will the\n                    previous day. He also informed her that, “[a]s discussed”, the\n                    Will “would only take effect upon [her] demise”, and that she\n                    could revoke it at any time without seeking the consent of the\n                    respondent.",
        "Sale of the Property and Mdm Chiang’s making of the\n                gift": "36     Sometime in October 2001, Lee recovered vacant\n                    possession of the Property on behalf of Mdm Chiang without litigation. On\n                    26 October 2001, the respondent requested for a valuation of the Property\n                    from Colliers Jardine Consultation & Valuation (Singapore) Pte Ltd\n                    (“Colliers Jardine”)[note: 14]. On\n                    2 November 2001, he received a valuation report valuing the Property at\n                        $1,100,000[note: 15]. On 15 November 2001,\n                    Mdm Chiang met the respondent at his office. According to the respondent,\n                    he sent for her so that he could explain the valuation report to her[note: 16]. During this meeting on\n                    15 November 2001, Mdm Chiang signed a letter (“the Gift\n                    Letter”) drafted by the respondent, purportedly on her\n                        instructions[note: 17], stating that she\n                    wished only to keep $500,000 out of the proceeds of the sale of the Property,\n                    and that the respondent could keep any amount in excess of that sum[note: 18].\n                    Yeo witnessed, or purported to witness, the signing of the letter. The Gift\n                    Letter is a critical document in this case, and hence it will be set out in full\n                    at [58] below. 37     The respondent went on to make arrangements\n                    for the sale of the Property. On 25 November 2001, he engaged yet another\n                    advocate and solicitor, Mr Victor Yip Keng Fook (“Yip”) of\n                    M/s Teh Yip Wong & Tan, to handle legal matters pertaining to the sale\n                    of the Property[note: 19]. On 3 December 2001, an option\n                    signed by Mdm Chiang was given for the sale of the Property at\n                        $960,000[note: 20]. The signing of the option was\n                    witnessed by Yip. On 6 December 2001, Yip paid over the option fee of\n                    $9,600 to the respondent by cheque[note: 21]. On\n                    19 December 2001, upon the exercise of the option by the purchaser of the\n                    Property, Yip paid over $86,400 to the respondent, also by cheque[note: 22]. 38     Completion of the sale of the Property took\n                    place on 27 February 2002, and three separate cheques for a total of\n                    $862,224.63 were issued in the respondent’s favour[note: 23]. On the same day, Yip received a letter\n                    signed by Mdm Chiang instructing that all correspondence meant for her be\n                    directed to the respondent instead, the stated reason being that she was leaving\n                    the Bukit Batok Home for the Aged[note: 24]. It is unclear\n                    who prepared this letter. On 6 March 2002, the respondent issued a cheque\n                    for $500,000 in Mdm Chiang’s favour[note: 25].",
        "Investigation and complaint": "39     The unusual nature of this gift only\n                    fortuitously came to light in 2009, when the Auditor-General’s Office\n                    audited the books of the Bukit Batok Home for the Aged and found that\n                    Mdm Chiang had only received $500,000 despite the Property having been sold\n                    at $960,000. This led to an investigation by the Commercial Affairs Division.\n                    The police forwarded a summary of their investigations to the\n                    Attorney-General’s Chambers, which then made a complaint to the Law\n                    Society against the respondent. This led to the present disciplinary\n                    proceedings.",
        "Findings of the Disciplinary Tribunal": "40     Before the Disciplinary Tribunal (“the\n                    DT”), the respondent pleaded guilty to a breach of r 46 of the\n                    Rules. The only matter that remained to be resolved was that of mitigation. As\n                    counsel for the Law Society and counsel for the respondent could not agree on\n                    the facts stated in the respondent’s written mitigation, it was agreed\n                    that the DT would hear evidence and make findings of fact, in what counsel for\n                    the respondent described as a “Newton style hearing”[note: 26]. In the proceedings before the DT, the\n                    Law Society called one witness, Mdm Chiang, while counsel for the\n                    respondent called four witnesses, namely (and in order), the respondent himself,\n                    Yeo, Yip and Lee. 41     There were two agreed issues of fact in\n                    dispute before the DT, as follows[note: 27]: (a)     Did Mdm Chiang know of the\n                        valuation of the Property at $1,100,000? (b)     Did she know that the Property was sold for\n                        $960,000? In the report of the DT (“the\n                    DT Report”), the DT returned a negative answer to both\n                        questions[note: 28]. The DT then concluded that,\n                    although the respondent’s involvement might have started off as an act of\n                    charity towards Mdm Chiang, this eventually became a case in which the\n                    respondent “manipulated” an “apparently indigent old lady,\n                    a former Woodbridge Hospital patient”. The DT further expressed the view\n                    that the respondent’s engaging Yip to handle the sale of the Property was\n                    “obviously done as a smoke screen to cover up the [respondent’s]\n                    role in the sale”. As a result, the DT determined that cause of\n                    sufficient gravity for disciplinary action existed under s 83 of the\n                        Act[note: 29].",
        "Parties’ contentions": "42     Before us, the Law Society simply adopted the\n                    findings in the DT Report[note: 30]. 43     The respondent, on the other hand, disputed\n                    the DT’s findings on the two agreed issues of fact. He disputed the\n                    DT’s conclusion that he had manipulated Mdm Chiang, maintaining\n                    instead that this case involved no more than an “accidental\n                    lapse”, or “oversight”, or\n                        “omission”[note: 31]. On this basis, the respondent’s position\n                    was that no action should be taken under s 83 of the Act, but that, if it\n                    was held that “due cause” under s 83 had been shown, then a\n                    “nominal penalty” would suffice[note: 32]. 44     The respondent’s arguments may be\n                    summarised as follows: (a)     Mdm Chiang’s evidence\n                        before the DT cannot be relied upon because of the incompleteness and\n                        inaccuracy of her memory. This is shown by her inability to recall a number\n                        of events and circumstances which are substantiated by other evidence. Among\n                        other things, Mdm Chiang could not recall having made the Will before\n                        Lee, she could not recall having met Yip at all, and she had difficulty\n                        recognising the respondent when he was pointed out to her while she gave her\n                            evidence[note: 33]. (b)     The DT ignored Mdm Chiang’s concession during\n                        cross-examination that she had seen a copy of the valuation\n                            report[note: 34]. (c)     The DT ignored Yip’s evidence that he had informed\n                        Mdm Chiang that the Property was being sold for $960,000[note: 35].",
        "Issues for determination": "45     We had to determine two issues. First, was the\n                    respondent’s breach of r 46 of the Rules tainted with dishonesty, as\n                    the DT Report concluded? Second, what would be the appropriate sanction\n                    under s 83 of the Act, if any, to impose on the respondent?",
        "Whether the respondent was dishonest": "",
        "The standard of proof": "46     In Singapore, recent decisions of this Court\n                    have affirmed the position that the criminal standard of proof applies in\n                    disciplinary proceedings against advocates and solicitors: seeLaw Society of Singapore v Chiong Chin May Selena[2013]\n                    SGHC 5 at [28];Law Society of Singapore v Ahmad Khalis\n                        bin Abdul Ghani[2006] 4 SLR(R) 308 at [6]. This is also the\n                    position adopted in England: see the Privy Council case (on appeal from Trinidad\n                    and Tobago) ofCampbell v Hamlet[2005] 3 All\n                    ER 1116 at [16]–[21]. Where, as in this case, it is not disputed that\n                    there has been a breach of the Rules, and the issue is simply whether the breach\n                    was tainted with dishonesty, the criminal standard of proof would mean that, if\n                    the respondent is to be punished on the basis that he was dishonest, his\n                    dishonesty must be proved beyond reasonable doubt. 47     However, there are jurisdictions which instead\n                    apply the civil standard of proof in disciplinary proceedings against legal\n                    professionals. In Australia, see for example the New South Wales Supreme Court\n                    case ofJackson (previously known as Subramaniam) v Legal\n                        Practitioners Admission Board2006 NSWSC 1338 at [35] and the\n                    Victoria Supreme Court case ofRe The Legal Profession Act\n                        2004 and Re OG, a Lawyer2007 VSC 520 at [99]. In Hong Kong, this\n                    was the unanimous holding of the Court of Final Appeal inA\n                        Solicitor v The Law Society of Hong Kong[2008] HKCU 393 at\n                    [116]. The civil standard of proof can be expressed as “preponderance of\n                    probability” or “balance of probability”, the terms having\n                    been used interchangeably by Lord Nicholls of Birkenhead inIn re H and others (minors) (sexual abuse: standard of proof)[1996] AC 563. It is capable of a high degree of nuance in the sense that,\n                    notwithstanding that a single standard of proof is applied, the strength of\n                    evidence needed to prove a particular allegation may nevertheless vary according\n                    to the seriousness or gravity of that allegation. In the words of Lord Nicholls\n                    at 586: ... When assessing the probabilities the court will have in mind as a\n                        factor, to whatever extent is appropriate in the particular case, that the\n                        more serious the allegation the less likely it is that the event occurred\n                        and, hence, the stronger should be the evidence before the court concludes\n                        that the allegation is established on the balance of probability. Fraud is\n                        usually less likely than negligence. Deliberate physical injury is usually\n                        less likely than accidental physical injury. A stepfather is usually less\n                        likely to have repeatedly raped and had non-consensual oral sex with his\n                        under age stepdaughter than on some occasion to have lost his temper and\n                        slapped her. Built into the preponderance of probability standard is a\n                        generous degree of flexibility in respect of the seriousness of the\n                        allegation. Although the result is much the same, this does not mean that where a\n                        serious allegation is in issue the standard of proof required is higher. It\n                        means only that the inherent probability or improbability of an event is\n                        itself a matter to be taken into account when weighing the probabilities and\n                        deciding whether, on balance, the event occurred. The more improbable the\n                        event, the stronger must be the evidence that it did occur before, on the\n                        balance of probability, its occurrence will be established. 48     Might it then be argued that this nuanced\n                    civil standard of proof, rather than the criminal standard, should apply in\n                    disciplinary proceedings in Singapore? Of course, no such argument was made\n                    before us, and a disposal of the present case does not require a decision on\n                    this point because, even on the higher standard of proof beyond a reasonable\n                    doubt, we found that the respondent had been dishonest. Given these\n                    considerations, it would not be appropriate to decide on this point here without\n                    the benefit of proper argument; as such, we flag this important issue for closer\n                    consideration in a future appropriate matter. That said, we would venture some\n                    observations, the conclusion of which is that the criminal standard of proof\n                    should continue to apply. 49     The first observation is that, where the\n                    allegations against an advocate and solicitor are of a very serious nature,\n                    there is likely to be little practical difference between the civil and criminal\n                    standards of proof: see the remark of Lord Bingham of Cornhill CJ inB v Chief Constable of Avon and Somerset\n                        Constabulary[2001] 1 WLR 340 at [31]. The more serious the\n                    allegation, the less likely it is that the allegation is true, and the stronger\n                    the evidence required to prove it; where the allegation is very serious,\n                    therefore, the evidence required to prove it on a balance of probability might\n                    be so strong as to pass muster even on the criminal standard of proof beyond a\n                    reasonable doubt. The question of the standard of proof is likely to be most\n                    hotly-contested in cases where the allegations are of greater seriousness, but\n                    it is in precisely those cases that the question is most academic. 50     The second observation is that the criminal\n                    standard of proof also allows a degree of flexibility in its operation, and is\n                    in that regard not much inferior, if at all, to the civil standard. That is to\n                    say, the strength of evidence required to remove all reasonable doubt may also\n                    vary according to the gravity or seriousness of the allegations to be proved.\n                    Compare, for example, an allegation of insurance fraud with an allegation of\n                    murder motivated by a desire to receive insurance monies paid out as a result of\n                    the victim’s death. Proof that the accused purchased an insurance policy\n                    the day before some inexplicable property damage might suffice to prove, beyond\n                    a reasonable doubt, the former allegation. However, proof that the accused\n                    purchased a policy insuring the victim’s life the day before the\n                    victim’s inexplicable death might not similarly prove, beyond a reasonable\n                    doubt, the latter allegation. 51     The third and final observation is that\n                    disciplinary proceedings are more akin to criminal than civil proceedings in one\n                    important respect, which is that, like criminal proceedings, the whole purpose\n                    or object of disciplinary proceedings is to make judgments about a\n                    person’s conduct and/or character. Similar judgments may occur in civil\n                    proceedings – for instance, a defendant might be found to have been\n                    “fraudulent” or “dishonest” – but the\n                    difference is that it is not the purpose or object of civil proceedings to make\n                    such judgments. Rather, the purpose of civil proceedings is, broadly speaking,\n                    to compel or prohibit persons from doing certain thing(s)vis-a-visanother person,eg, to\n                    pay an amount of money. Any judgments as to a person’s conduct or\n                    character in civil proceedings are purely corollary or incidental to that main\n                    purpose – a person is labelled “dishonest” not for its own\n                    sake, but so that the person may be ordered to compensate another person. By\n                    contrast, in criminal and disciplinary proceedings, a person is labelled\n                    “dishonest” for its own sake,ie, so\n                    that the community will be put on notice that this is a dishonest person (or a\n                    person whose specific conduct, whether positive act or omission, was dishonest).\n                    Hence, the criminal standard of proof is perhaps more appropriate than the civil\n                    standard in disciplinary proceedings because it sends the moral message that, if\n                    a person’s conduct or character is to be judged for professional fitness,\n                    it may only be judged if the highest standard of proof has been\n                reached. 52     Accordingly, we needed to be satisfied beyond\n                    a reasonable doubt that the respondent had been dishonest in order to sanction\n                    him on that basis.",
        "The DT Report": "53     As mentioned at [42] above, the Law Society\n                    simply adopted the findings of the DT Report, and did not offer any\n                    additional arguments to support its position that the respondent had been\n                    dishonest. This was unfortunate, because in our view, the DT Report did not\n                    provide sufficient grounds for finding beyond a reasonable doubt that the\n                    respondent had been dishonest. 54     To begin with, the DT Report contains two\n                    misinterpretations in its evaluation of the evidence. The first can be found at\n                    [34] of the DT Report, where the DT quoted an excerpt from Yeo’s\n                    evidence as follows: Q:Did you know at the time when this document was\n                            signed on 15thNovember that a valuation [by\n                            Colliers Jardine] had been obtained? A:No, no idea. Q:No, no, okay. Did you know whether she was informed\n                            that the valuation had been obtained and how much that valuation\n                            show? A:I don’t know whether the lawyer tells her or\n                            not? ... Q:On what occasion would the valuation be\n                            mentioned? A:It was just in the course of---of talking, I mean,\n                            sometime they will just say, ‘Eh, this---this building going to\n                            cost so much, so much.’ I mean--- Q:So it did not refer to a valuation obtained but\n                            just that the house--- A:Ah, house is worth--- Q:---would be worth a million dollars? A:---about a---a million or so. Q:Was it in reference to a valuation or just\n                            ‘Oh, I think the property is worth over a million\n                            dollars’? A:It is just as what you said; the property will be\n                            worth about how much like that. The DT said at [34] that this excerpt from Yeo’s evidence\n                    “suggests that Mdm Chiang was not aware of the valuation”.\n                    However, with respect, we could not see how this excerpt suggests that. All that\n                    this excerpt says is that Yeo did not, and could not, know whether or not the\n                    respondent had apprised Mdm Chiang of the valuation, and that Yeo himself\n                    was not aware that a valuation report had been obtained. It does not necessarily\n                    follow from this that Mdm Chiang was similarly unaware of the\n                valuation. 55     The second instance can be found at\n                    [37]–[38] of the DT Report. The DT quoted at [37] the following\n                    excerpt of Mdm Chiang’s cross-examination by counsel for the\n                    respondent: Q:Now you---I put it to you that you saw this in\n                            Mr James Wan’s office when Mr James---when this report\n                            was prepared, Mr James Wan asked you to go down to his office and\n                            you went down with madam---with Mr Yeo. And it was at that meeting\n                            that Mr Wan showed you the valuation report. Do you remember\n                            this? A:I can’t recall. Q:... And Mr James Wan had told you that the\n                            valuation---according to the valuation report, it was the property---the\n                            value of the property was about $1.1 million. A:I can’t recall. Q:Now at that time you were so happy to get the\n                            property back and you were going to get some money. You told Mr Wan\n                            that you only needed $500,000. Mr Wan can sell the property and\n                            anything over $500,000 he can keep so long as Mr Wan pays himself,\n                            pays the lawyer’s bills, pays the---the---the agent---the\n                            agent’s bills, pays the valuer’s bills. ... ... A:I did not say so much things. The DT went on to say at [38] that the respondent’s case as\n                    suggested by counsel in the above excerpt was inconsistent with the\n                    respondent’s own evidence under cross-examination by counsel for the Law\n                    Society in the following excerpt: Q:... I put it to you that you did not inform\n                            Mdm Chiang that the sale price of the property was $960,000.\n                            ... A:That’s not true. Q:And why is that not true? A:I spoke---I relay the message through\n                            Mr Richard Yeo [referring to Mr Yeo] whom I always\n                            com---communicate. ... Q:... do you know whether Mr Yeo did or did not\n                            convey what you told him to do? A:I believe Mr Yeo would have conveyed to him\n                            [sic]. With respect, we could not see where the inconsistency lies. In\n                    the former excerpt, the respondent’s case as suggested by counsel was that\n                    he had personally informed Mdm Chiang of the Property’s valuation at\n                    $1,100,000. In the latter excerpt, the respondent’s evidence was that he\n                    had conveyed the Property’s selling price of $960,000 to Mdm Chiang\n                    through an intermediary, that is, Yeo. One excerpt pertains to the manner in\n                    which Mdm Chiang was informed of thevaluation, while the other excerpt pertains to the manner in\n                    which she was informed of theselling price.\n                    Therefore, we did not think that there was any material inconsistency between\n                    the two excerpts. 56     The evaluation of evidence spans just seven\n                    paragraphs at [34]–[40], and the bulk of the text consists of quotations\n                    from the transcript of proceedings before the DT, which means that the\n                    DT’s own reasoning was fairly sparse. Given all this, it would be unsafe\n                    to find that the respondent was dishonest on the basis of the DT Report\n                    alone, as the Law Society, in effect, urged us to do. Plainly, the DT must have\n                    thought that this was an obvious case of dishonesty, and that the facts would\n                    speak for themselves. In the final analysis, we agreed with the DT’s\n                    conclusion, although this agreement followed our own detailed evaluation of the\n                    evidence. We now turn to this evaluation.",
        "Evaluation of the evidence": "The valuation report and the 15 November 2001 meeting 57     As narrated above at [36] above, the\n                    respondent requested for a valuation report from Colliers Jardine on\n                    26 October 2001. A week later, he received that report valuing the Property\n                    at $1,100,000. On 15 November 2001, about two weeks after receiving the\n                    report, he met Mdm Chiang at his office. On his own evidence, he was the\n                    one who called for the meeting in order to explain the valuation report to her.\n                    However, Mdm Chiang said in her evidence that she could not recall having\n                    been informed of the valuation of the Property[note: 36]. We\n                    reproduce an excerpt to that effect from her cross-examination by counsel for\n                    the respondent[note: 37]: President:Can you recall if the\n                                            valuation of the property at 1.1 million was ever shown\n                                            to you?Wong:I think she had already\n                                            said, “Yes.”President:Never mind. We want\n                                            to---Wong:We confirm again. Very good,\n                                            your Honour.A:Your Honour, I have not\n                                            heard of such a matter.President:Forgot?Witness:I have not heard of---heard\n                                            of this.President:The amount of 1.1\n                                            million?Witness:No, your\n                                        Honour.   Yet as the respondent pointed out[note: 38], there is a portion of Mdm Chiang’s\n                    cross-examination which seems to suggest that she did see the valuation\n                        report[note: 39]: Q:Right. And on---the valuation report was prepared\n                            and this can be found at page 37 to 48 of the---red bundle. So at page\n                            37, it’s the picture you see at photograph of your former house at\n                            18 Maria Avenue. A:Yes. Q:Do you remember seeing this document? A:Yes. I---I saw it before. However, I\n                            can’t---I couldn’t recall. In all likelihood, however, what Mdm Chiang remembered having\n                    seen was not the valuation report but the photograph on the cover page of the\n                    valuation report[note: 40]. This is evident from a subsequent part\n                    of her cross-examination[note: 41]: Q:Mdm Chiang, can I refer you\n                                            back to page 37 to 48? Do you ever remember seeing this\n                                            document? This is a valuation\n                                    report.A:I did recall seeing this\n                                            photograph on page 37.Advocate:Can you show her\n                                            the---the---the report itself?\n                                    Thanks.A:I couldn’t recall even\n                                            if I have seen this document.QRight.Advocate:In---AI can’t\n                                        recall.Advocate:Even if she didn’t see\n                                            the whole document, was it highlighted to her at page 43\n                                            that the valuation of the property was 1.1\n                                            million?Interpreter:Yes, your\n                                        Honour.Witness:I have no such impression,\n                                            your Honour.   58     Yeo’s evidence is that, while he brought\n                    Mdm Chiang to the respondent’s office for their meeting on\n                    15 November 2001, he remained outside the respondent’s office during\n                    the meeting, and was thus not privy to what transpired between the respondent\n                    and Mdm Chiang. Hence it might appear that the question of whether the\n                    respondent informed Mdm Chiang of the valuation of the Property comes down\n                    to the respondent’s word against Mdm Chiang’s. However, this is\n                    not the case. The meeting of 15 November 2001 produced a document, namely,\n                    the Gift Letter. The respondent’s evidence is that he drafted this letter,\n                    and Mdm Chiang agreed to its contents[note: 42]; on his\n                    evidence, therefore, the Gift Letter accurately represents the understanding\n                    between him and Mdm Chiang. Given the importance, and brevity, of the\n                    letter, we set out its contents in full[note: 43]: Mr James Wan James Wan & Co 60 Albert Street #09-10 Albert Complex Singapore 189969 Dear Sirs Re: No. 18 Maria Avenue Singapore I wish to thank you for helping me to recover [the Property]. In view of the fact that the house is in a dilapidated condition and that\n                        a large portion of the land at the back is on a slope of about 60 feet\n                        higher than the front and also due to the slump in the property market in\n                        Singapore I’m agreeable and confirm to accept as full payment to me a\n                        sum of Dollars Five hundred thousand only ($500,000.00) if you can manage to\n                        sell it. Since you have not charged me for your legal fees. I hereby agree and\n                        confirm that you may keep any amount above $500,000.00 as a reward for\n                        helping me in recovering No. 18 Maria Avenue which I had little hope of\n                        getting it back since it has been occupied by some strangers for more than\n                        20 odd years. You are also responsible to clean the house and pay the arrears of\n                        property tax or other relevant fees including housing agents’ fees in\n                        selling the property and [Lee’s] legal fees. 59     In the second paragraph, the opening words\n                    “[i]n view of” indicate a causal connection between, on one hand,\n                    the Property’s disadvantageous characteristics and the property market\n                    slump, and, on the other, Mdm Chiang’s willingness to accept just\n                    $500,000 from the sale proceeds as full payment. Making explicit this unsaid\n                    causal connection, the full line of reasoning proceeds thus: (a)     ‘In view of the\n                        Property’s disadvantageous characteristics and the property market\n                        slump, I am not hopeful of getting a good price for the Property, perhaps\n                        not very much more than $500,000, and therefore I am willing to accept just\n                        $500,000 from the sale proceeds’. We concluded from\n                    this that the Gift Letter unequivocally records Mdm Chiang’s belief that\n                    the sale of the Property would fetch a sum barely in the excess of $500,000. As\n                    such, the Gift Letter strongly suggests that the respondent did not, in fact,\n                    inform Mdm Chiang that the Property had been valued at\n                $1,100,000. 60     However, the respondent’s case is that\n                    he did show Mdm Chiang the valuation report, except that he informed her\n                    thereafter “that the Property was unlikely to fetch S$1.1 million\n                    because it was in a dilapidated condition”[note: 44].\n                    This was the position taken in a letter dated 16 June 2011 from counsel for\n                    the respondent to the Inquiry Committee constituted under s 85(10) of the\n                    Act to investigate the complaint against the respondent. The respondent further\n                    claimed in evidence that, although he had the valuation report in hand, he\n                    nonetheless believed that the sale of the Property would fetch less than\n                        $1,100,000[note: 45]. The\n                    respondent’s defence, in other words, is that he told Mdm Chiang to\n                    expect the selling price of the Property to fall significantly short of the\n                    valuation, and that he himself honestly believed this to be the\n                case. 61     However, we did not believe that the\n                    respondent honestly expected that the Property’s selling price would fall\n                    significantly short of the valuation. His own evidence, concerning the events\n                    leading up to the sale of the Property, establishes that he did not hold such an\n                    expectation. An excerpt from his testimony on being cross-examined by counsel\n                    for the Law Society speaks for itself[note: 46]: Witness:Yes, I appointed two housing\n                                            agent whom I think was reliable. ... The first time,\n                                            there was only one offer, about 650,000. I advertised\n                                            again. Also, no good response at all. Then I\n                                            offered---advertised again the third time. Then this\n                                            agent came back---came to me, say, “I’m so\n                                            and so, I saw your advert, I want to---I’ve got\n                                            someone who is interested”, you know. I say,\n                                            “Okay, how much is your client prepared to\n                                            buy?” He gave me about 800 over thousand dollars.I told him, “The valuation\n                                                is 1.1. You have to---you know, I can’t sell\n                                                you at that price.”So I think a\n                                            couple of days back or a couple of days later, he called\n                                            me back, you know.He offered 900. I\n                                                said, “Cannot. I won’t be able---I\n                                                won’t sell.”So this thing\n                                            went on a few more days. Then he came back, offered 960,\n                                            you know. Then over this period of time I was thinking I\n                                            have appointed two agent. None of them came back with\n                                            any offer at all. I advertised three times. This is the\n                                            highest, you know. So I decided to\n                                    sell.[emphasis\n                                        added]   62     On the respondent’s own case, he\n                    represented to Mdm Chiang that the Property was unlikely to fetch\n                    $1,100,000. On the basis of the Gift Letter, he must have represented to her\n                    that it would not fetch much more than $500,000. Since his own belief was that\n                    he could get a selling price which was at least close to $1,100,000, he must\n                    have made those representations without an honest belief in the truth of their\n                    contents. This means that he must have positively misled Mdm Chiang as to\n                    the expected selling price of the Property, so that she would be willing to keep\n                    just $500,000 and make a gift of the remainder of the sale proceeds to\n                    him. 63     In light of the foregoing analysis, simply by\n                    considering what happened during the 15 November 2001 meeting between the\n                    respondent and Mdm Chiang as evidenced by the Gift Letter, we had no doubt\n                    that the respondent was plainly dishonest. The respondent believed, on the basis\n                    of the valuation report which he had requested, that the sale of the Property\n                    would fetch a sum in the region of $1,100,000. Yet, it is clear from the Gift\n                    Letter that Mdm Chiang believed that the sale of the Property would fetch\n                    little more than $500,000. On that basis, she was willing to make a gift to the\n                    respondent of all the sale proceeds in excess of that amount. We saw just two\n                    possible explanations for this state of affairs: either he kept the valuation\n                    report from her, or he showed her the report but represented to her, contrary to\n                    his own belief, that the valuation was not an accurate reflection of the\n                    expected selling price. Either way, the only inference we could draw was that,\n                    at the meeting of 15 November 2001, the respondent misled Mdm Chiang\n                    into believing that the Property’s selling price would barely exceed\n                    $500,000, so as to induce her into making a gift to him of all the sale proceeds\n                    above $500,000. This sufficed to satisfy us, beyond a reasonable doubt, that the\n                    respondent was dishonest. Lack of attendance notes from the 15 November 2001\n                meeting 64     At this juncture, we wish to highlight the\n                    respondent’s failure to take any attendance notes at the 15 November\n                    2001 meeting with Mdm Chiang or, indeed, at anytime. We do so in order to\n                    emphasise, as we have done so before, that it is an exercise in precaution and\n                    prudence to maintain contemporaneous attendance notes, even in routine matters:Lie Hendri Rusli v Wong Tan & Molly Lim (a\n                        firm)[2004] 4 SLR(R) 594 at [71]. While it is\n                    uncontroversial that a failure to maintain attendance notes is not a breach of\n                    an advocate and solicitor’s professional dutiesper\n                        se, it is well-established that the lack of attendance notes may\n                    lead to adverse inferences being drawn against the advocate and solicitor who\n                    fails to keep these attendance notes: see the decision of this court inLaw Society of Singapore v Tan Phuay Khiang[2007] 3 SLR(R) 477 at [82], [85]. Such adverse inferences may be drawn\n                    against an advocate and solicitor not only in disciplinary proceedings, but also\n                    in civil proceedings where he is a witness, including civil proceedings to which\n                    he is not a party: see the Court of Appeal decisionLow Ah\n                        Cheow and others v Ng Hock Guan[2009] 3 SLR(R) 1079 at\n                    [38]–[40]. 65     In the present case, we did not hesitate to\n                    draw an adverse inference against the respondent from his failure to keep\n                    attendance notes of the 15 November 2001 meeting. This inference was that,\n                    contrary to what he claimed, he had not in fact apprised Mdm Chiang of the\n                    valuation of the Property at that meeting. 66     Looking at the evidence in totality, our view\n                    as to the respondent’s dishonesty was further reinforced. As we put to\n                    counsel for the respondent when he appeared before us, there were only two\n                    possible characterisations of the respondent’s conduct: either it was\n                    utterly incompetent, or it was manipulative and therefore dishonest. It could\n                    not have been incompetence, because this would be incompetence of an\n                    extraordinary scale that we could not reasonably attribute to a senior member of\n                    the legal profession. We would have difficulty believing that the greenest of\n                    advocates and solicitors could be capable of such incompetence, let alone an\n                    advocate and solicitor of over 30 years’ standing, as the respondent was\n                    at the material time. 67     We turn now to consider the rest of the\n                    evidence from which we drew our inferences of the respondent’s deplorable\n                    conduct. Mdm Chiang’s mental health 68     Mdm Chiang’s history of mental\n                    health problems is undoubted. On the respondent’s own evidence, he was\n                    aware of this from around the time that he met her, which would have been around\n                    April 2001[note: 47]. His knowledge of\n                    her mental health history prompted him to request for a psychiatric report from\n                    IMH. Subsequently, however, when Mdm Chiang made him the gift of the\n                    Property’s sale proceeds less $500,000, he took no such precautionary\n                    steps. He knew that, the Property having been valued at $1,100,000, she might be\n                    giving away as much as $600,000. Further, he was aware that the IMH report,\n                    which certified her fitness to execute a statutory declaration, was confined\n                    merely to Mdm Chiang’s fitnessto execute a\n                        statutory declarationto receive a title document pertaining to\n                    property belonging to her. He must have known that her fitnessto give away potentially $600,000was an entirely\n                    different matter. From the report, he would further have been aware that she\n                    continued to receive “maintenance anti-psychotic medication, thioridazine\n                    50 mg ON”, meaning that, although the IMH report stated that she was\n                    “in remission of her mental illness”, she had by no means fully\n                    recovered, and there remained the risk of her mental difficulties overwhelming\n                    her once more. Despite all this, he made no attempt to confirm\n                    Mdm Chiang’s mental fitness to make such a significant gift and refer\n                    her to an independent third party for advice. He simply accepted the purported\n                    gift. 69     The respondent argued that Mdm Chiang\n                    appeared to him, and to everyone else, to be mentally healthy[note: 48]. He further argued that\n                    Mdm Chiang had been very insistent that he accept the gift[note: 49]. However, notwithstanding this\n                    assertion, it was clear to us that any reasonable advocate and solicitor in the\n                    respondent’s position would have been far more circumspect. After all, the\n                    respondent stood to receive as much as $600,000, which would have been even more\n                    than the $500,000 she was getting. It is inconceivable that an advocate and\n                    solicitor with as many years’ experience as the respondent could have\n                    overlooked the need to take any precautions at all in relation to ascertaining\n                    Mdm Chiang’s mental health and her capacity to make a gift as\n                    distinct from receiving a benefit. Even if the gift was a free exercise of\n                    Mdm Chiang’s will, it is implausible that his failure to send her for\n                    psychiatric re-evaluation, and to refer her to an independent third party for\n                    advice, could have been a mere “accidental lapse” or\n                    “oversight” or “omission”. We found his claim that\n                    the need for these precautions simply “slipped [his] mind” –\n                    that it was but an “error of [his] judgment”[note: 50]– to be teetering on the edge of\n                    absurdity. Having immense difficulty in believing that the respondent was guilty\n                    only of incompetence – however grave that incompetence might be – we\n                    were constrained to find that something rather more sinister was\n                afoot. The Power of Attorney 70     The Power of Attorney executed by\n                    Mdm Chiang granted the respondent very extensive powers to manage\n                    Mdm Chiang’s affairs. We set out just a few of these powers to\n                    provide an idea of how extensive they were: 1.To negotiate and\n                            purchase property or properties in the Republic of Singapore\n                            (hereinafter called “the premises”) in my sole name or\n                            jointly ... and in connection therewith to sign any option to purchase\n                            ... and to sign contracts relating to the purchase of the premises\n                            ... 2.To raise and borrow from\n                            any financial institution or Bank sums of money which the Attorney may\n                            think fit to borrow for the purpose connected with the purchase of the\n                            premises and on such terms and on the security of the premises as the\n                            Attorney shall think fit ... 3.To mortgage charge pledge or otherwise deal with the premises or any\n                            part thereof as he may think fit\n                            ... 4A.To apply to the Central\n                            Provident Fund Board ... for release of my CPF monies standing to my\n                            credit in the fund for all or any of the following\n                        purposes: (i)for payment, either full or partial, to the\n                                vendors towards the purchase of the premises; (ii)for repayment or periodic payments ...\n                                towards the repayment of any loan taken by the Attorney to finance\n                                or re-finance the purchase of the premises; (iii)for payment of legal fees, costs or other\n                                expenses incurred for the purchase of the premises ... Mdm Chiang requested the respondent’s\n                    assistance in recovering and selling the Property. It may have made sense for\n                    her to grant him powers to facilitate his performance of that request, but the\n                    powers in this Power of Attorney clearly went beyond that. Indeed, many of the\n                    powers therein, such as those listed in this excerpt, were not powers in\n                    relation to the Property at all. Rather, they were powers to purchase other\n                    properties – including even the power to apply Mdm Chiang’s CPF\n                    monies, which would otherwise be used to support her in her old age, towards the\n                    purchase of those properties – and subsequently to deal with these\n                    purchased properties. We found it disturbing that so wide a Power of Attorney\n                    was drawn up by Lee in response to what was a fairly limited request by\n                    Mdm Chiang. 71     Granted, the respondent might not have been\n                    involved in the execution of the Power of Attorney, because it appears that Lee\n                    drew up the document for Mdm Chiang. We were willing to give him the\n                    benefit of the doubt that the Power of Attorney was executed without his\n                    prompting, as he says it was[note: 51]. Yet the respondent did not deny that the\n                    document was subsequently brought to his attention[note: 52]. The evidence does not indicate exactly when\n                    it was brought to his attention, but it could not have been very long after the\n                    Power of Attorney was executed. Upon learning that unnecessarily extensive\n                    powers had been bestowed upon him, any reasonable advocate and solicitor would\n                    have asked questions at once. He would at least have ascertained from\n                    Mdm Chiang that she did indeed intend to confer all those powers upon him.\n                    Further, he should have advised her that there was no need for such a\n                    comprehensive suite of powers for the comparatively simple task of recovering\n                    and selling the Property, and that it was possible, if she so desired, to draw\n                    up a more restricted Power of Attorney. At the minimum, he ought to have sought\n                    confirmation from Lee that Mdm Chiang understood what she was doing. He\n                    might have asked for a psychiatric re-evaluation of\n                Mdm Chiang. 72     Regrettably, the respondent did nothing. Under\n                    cross-examination, he agreed that it was an extensive Power of Attorney, but\n                    said that, to him, the Power of Attorney was “an ordinary\n                        thing”[note: 53], and that “a\n                    normal full Power of Attorney includes all these points”[note: 54]. He said that the content of the\n                    document was a matter “between her and the person who prepare the Power\n                    of Attorney”[note: 55]. Again, we found it\n                    difficult to believe that an advocate and solicitor of the respondent’s\n                    experience could have been so remiss as to have done nothing. Once more, we were\n                    led towards the conclusion that this indicated something more troubling than\n                    mere incompetence. Mdm Chiang’s Will 73     We set out here the material portions of the\n                    Will: 3.Subject to\n                            payment of all my debts and funeral and testamentary expenses, I hereby\n                            give to the [respondent] all other assets to be acquired between the\n                            making of this Will and my death, including any assets ... over which I\n                            may have a general power of appointment or disposition by Will and which\n                            may fall into my estate to be administered ... For the purpose of\n                            clarification, I hereby declare that the residual of my estate shall\n                            include ... all my rights title and interest in [the\n                        Property]. 4.For the avoidance of\n                            any doubt, I hereby confirm that I have taken into consideration the\n                            fact that the following persons are my children, and the same\n                            notwithstanding, I hereby declare and direct that the following persons\n                            ... shall not be entitled to any share or distribution to any of the\n                            assets howsoever falling into my estate: a)    Tan Zi Wei, son b)    Tan Su Lian, daughter c)    Tan Siu Chin, daughter d)    Tan Wei Chang, son 74     The respondent claimed that he was not aware\n                    of the existence and the contents of the Will until it was brought to his\n                    attention many years later during police investigations in 2009[note: 56]. However, we found it very difficult\n                    to credit the respondent with truthfulness in this instance. According to Lee,\n                    his bill for all his work done for Mdm Chiang was paid by the\n                        respondent[note: 57]. Lee also said that\n                    he put up a “detailed bill”[note: 58]. We had no doubt that this “detailed\n                    bill” (which was never produced) would have included Lee’s work in\n                    drawing up the Will. At the very latest, therefore, the respondent would have\n                    known of the existence of the Will when he paid Lee’s bill, which would\n                    have been shortly after receiving the proceeds from the sale of the Property. In\n                    fact, we had little doubt that the respondent knew about the Will even earlier\n                    than that. From the outset, Lee must have expected payment for his services, and\n                    he must have looked to the respondent for such payment, given\n                    Mdm Chiang’s apparent impecunious state. Consequently, he must have\n                    informed the respondent of the services that he rendered to Mdm Chiang. We\n                    had little doubt that when Lee apprised the respondent of the existence of the\n                    Will, he would also have apprised him of its contents, since it named the\n                    respondent as sole trustee and beneficiary. 75     Yet even assuming that the respondent only\n                    learnt about the Will after receiving the proceeds from the Property’s\n                    sale at the end of February 2002, it is striking that he did absolutely nothing\n                    about it thereafter. The Will did not merely grant the respondent some share in\n                    Mdm Chiang’s assets. On the contrary, not only did it name him as\n                    sole beneficiary of all her assets, but it also specifically excluded all her\n                    children from any share in those assets. Even though Mdm Chiang might have\n                    been very grateful to the respondent for agreeing to help her to recover the\n                    Property, any reasonable advocate and solicitor in his position would have\n                    thought the response to be somewhat disproportionate to the gratitude. A\n                    reasonable advocate and solicitor would, as a result, at least have sought\n                    confirmation from Mdm Chiang that her intentions remained as embodied in\n                    the Will. He would at least have checked with Lee that Mdm Chiang knew what\n                    she was doing. He would then have arranged a psychiatric re-evaluation of her\n                    mental fitness to give away, upon her demise, all that she had in the world. An\n                    advocate and solicitor would have to be grossly incompetent not to take these\n                    basic precautionary measures. Again, we had much difficulty believing that the\n                    respondent, with his ample experience, could have been capable of such glaring\n                    inadvertence and are led towards the conclusion that, instead, foul play was\n                    involved. The Property’s selling price 76     While the DT addressed the question of whether\n                    Mdm Chiang knew that the Property was being sold for $960,000, in our view,\n                    the more pertinent question was what steps the respondent took to inform her of\n                    the Property’s selling price. On his evidence, he did not at any point\n                    attempt to inform Mdm Chiang personally, but instead informed Yeo,\n                    intending that Yeo should then convey the message to Mdm Chiang[note: 59]. He said further\n                    that, having engaged Yip to handle the conveyance of the Property, he assumed\n                    that Yip would also have informed her of the Property’s selling\n                        price[note: 60]. 77     Any reasonable advocate and solicitor,\n                    however, would have tried to inform Mdm Chiang personally that the Property\n                    was going to be sold for $960,000. He would have understood that this was a\n                    critical piece of information which Mdm Chiang should be apprised of. And\n                    it does not seem to have been too difficult to arrange a personal meeting with\n                    Mdm Chiang – after all, the respondent managed to arrange such a\n                    meeting on 15 November 2001. We could not fathom why the respondent did not\n                    likewise meet Mdm Chiang personally to convey to her the Property’s\n                    selling price, but instead went through an intermediary. Once more, we found it\n                    very difficult to believe that this was mere incompetency as opposed to a lack\n                    of honesty. The respondent’s instruction of Lee and Yip 78     It seemed odd to us that there were a total of\n                    three advocates and solicitors working on a matter as simple as\n                    Mdm Chiang’s as the work could have easily been handled by a single\n                    advocate and solicitor. The respondent explained that he instructed Lee because,\n                    the occupiers of the Property having claimed adverse possession, the matter was\n                    straying into unfamiliar litigious territory which he did not feel able to deal\n                    with. His explanation for instructing Yip in the conveyance of the Property was\n                    that he wanted to give Yip some business, since Yip had just started his own\n                        practice[note: 61]. 79     We did not find his explanations convincing.\n                    In relation to instructing Lee, the curious aspect of his explanation is that,\n                    by 2001, the doctrine of adverse possession had already been abolished for\n                    around seven years. It could not have afforded the Property’s occupiers\n                    any defence to Mdm Chiang’s claim for vacant possession, which means\n                    that the dispute would not have gone to litigation. The respondent’s\n                    explanation as to why he instructed Yip is even more suspect, because Yip in his\n                    evidence flatly rejected that explanation as untrue[note: 62]: Q:Okay, I only mentioned that\n                                            because we were told that this particular conveyance\n                                            was, so to speak, passed on to you because you were just\n                                            starting.A:Not\n                                    true....President:Then, the impression is\n                                            that---Hassan:Yes.President:---they wanted to help\n                                            you---Hassan:That’s right,\n                                            yes.President:---professionally.Witness:Not\n                                    true.President:They give you\n                                            business.Witness:Not true. I would not need\n                                            this kind of a help, you know what I mean? I had my own\n                                            practice, it was thriving.   We were therefore unable to see any reason why the respondent\n                    instructed Yip instead of handling the conveyance himself apart from the reason\n                    offered by the DT that the respondent wanted to get the transaction some\n                    distance away from himself so as to hide his involvement in it. Mdm Chiang’s letter to Yip directing correspondence to the\n                respondent 80     On 27 February 2002, the day on which\n                    completion of the sale of the Property took place, a letter was sent to\n                        Yip[note: 63], purporting to be from Mdm Chiang. The\n                    letter read as follows: Please send all correspondences to me to Mr James Wan at\n                        the address below: 60 Albert Street #09-10 Albert Complex Singapore\n                            189969I shall be leaving this present address.Please do not send any correspondences to my present address\n                        forthwith.We were somewhat bewildered by this letter. First, since completion of\n                    the sale of the Property had taken place, there seemed to be no prospect of\n                    further correspondence being sent to Mdm Chiang. Second, Mdm Chiang\n                    did not, in fact, leave the Bukit Batok Home for the Aged until much later,\n                    sometime in 2012. It was Yeo who left the Home in December 2001. Keeping the\n                    rest of the evidence in mind, we strongly suspected that this letter did not\n                    originate from Mdm Chiang, and that the purpose of the letter was to\n                    prevent any material incriminating the respondent from coming into\n                    Mdm Chiang’s possession.Our finding on whether the respondent was dishonest81     We did not hesitate to find that the\n                    respondent had been dishonest. We would have found him dishonest solely on the\n                    basis of what transpired at the 15 November 2001 meeting between him and\n                    Mdm Chiang, as evidenced by the contents of the Gift Letter. In addition,\n                    the totality of the evidence pointed to his dishonesty. Taken together with a\n                    few other suspicious and poorly-explained circumstances, the overall picture\n                    that emerged was unambiguously that of manipulation of Mdm Chiang by the\n                    respondent.82     Like the DT, we were of the opinion that in\n                    the initial stages, the respondent might have become involved out of a sense of\n                    charity towards Mdm Chiang. However, we had no doubt that this charity\n                    subsequently gave way to a desire to enrich himself financially at her expense\n                    by taking advantage of her mental frailty and lack of sophistication to secure\n                    almost half of the proceeds from the sale of the Property, as well as\n                    entitlement to all her assets upon her demise. We do not make any findings on\n                    the extent to which Lee and Yip were involved in the respondent’s\n                    manipulation of Mdm Chiang, if at all, because those issues were not before\n                    us. Be that as it may, we feel constrained to observe that the conduct of Lee,\n                    at least, raised serious questions calling for an explanation.Conclusion83     Having found that the respondent was dishonest\n                    in breaching r 46 of the Rules, we were of the view that he was no longer fit to\n                    practise as an advocate and solicitor. Accordingly, we ordered that he be struck\n                    off the roll. We also awarded costs to the Law Society on a standard basis, to\n                    be taxed if not agreed.84     We conclude by emphasising that an advocate\n                    and solicitor who receives a significant gift from a client should be aware\n                    that the circumstances in which a gift is made will attract intense and detailed\n                    scrutiny if and when the propriety of the gift comes into issue. Prudent\n                    advocates and solicitors should therefore shun situations where even the\n                    appearance of having taken advantage of a client may later be called into\n                    question. It is only through close adherence to both the letter and spirit of\n                    the stipulated ethical constraints that legitimate concerns relating to the\n                    receipt of significant gifts may be dissolved.[note: 1]Record of Proceedings Vol 1 at\n                        48.[note: 2]Record of Proceedings Vol 1 at\n                    101.[note: 3]Record of Proceedings Vol 1 at 38.[note: 4]Record of\n                                Proceedings Vol 1 at 41.[note: 5]Record of\n                                Proceedings Vol 1 at 43.[note: 6]Record of Proceedings Vol 1 at\n                                50.[note: 7]Record of Proceedings Vol 1 at\n                                48.[note: 8]Record of Proceedings Vol 2 at 50; Record of Proceedings Vol\n                                3, Day 4, Page 73 at lines 13-18.[note: 9]Record of Proceedings Vol 1 at\n                                47.[note: 10]Record of Proceedings Vol 1 at\n                                51-59.[note: 11]Record of Proceedings Vol 1 at\n                                60.[note: 12]Record of\n                                Proceedings Vol 1 at 61-63.[note: 13]Record of Proceedings Vol 1 at\n                        64.[note: 14]Record of\n                                Proceedings Vol 1 at 65.[note: 15]Record of Proceedings Vol 1 at\n                                66-76.[note: 16]Record of Proceedings Vol 3, Day 4, Page 100 at lines\n                                2-8.[note: 17]Record of Proceedings Vol 3, Day 4,\n                                Page 79 at lines 13-15.[note: 18]Record of Proceedings Vol 1 at 77.[note: 19]Record of Proceedings Vol 2 at\n                                85.[note: 20]Record of Proceedings Vol 1 at\n                                114-117.[note: 21]Record of\n                                Proceedings Vol 1 at 118.[note: 22]Record of Proceedings Vol 1 at\n                    120.[note: 23]Record of Proceedings Vol 1 at\n                        122-127.[note: 24]Record of\n                                Proceedings Vol 1 at 128.[note: 25]Record of\n                                Proceedings Vol 1 at 78.[note: 26]Vol 3, Day 1, Page 3 at lines 4-6; Day 2, Page 5 at line\n                                21.[note: 27]Record of\n                                Proceedings Vol 3, Tab 1, at para\n                    32.[note: 28]Record of Proceedings Vol 3, Tab 1, at\n                                paras 34-40.[note: 29]Record of Proceedings Vol 3, Tab 1, at paras\n                                41-42.[note: 30]Applicant’s Written Submissions at paras\n                        14-17.[note: 31]Respondent’s Written Submissions at para\n                        27.[note: 32]Respondent’s Written Submissions at para\n                        58-59.[note: 33]Respondent’s Written\n                                    Submissions at paras 43-48,\n                    50.[note: 34]Respondent’s Written\n                                    Submissions at para 30,\n                    51.[note: 35]Respondent’s Written Submissions at para 29,\n                                    49.[note: 36]Record of\n                                Proceedings Vol 3, Day 4, Page 36 at lines 18-21; Page 37 at lines\n                                2-5; Page 38 at lines 7-16, 21-29.[note: 37]Record of Proceedings Vol 3, Day 4,\n                                Page 38 at lines 7-16.[note: 38]Respondent’s Written Submissions at para\n                        30.[note: 39]Record of Proceedings Vol 3, Day 4,\n                                Page 36 at lines 22-27.[note: 40]Record of Proceedings Vol 1 at\n                                66.[note: 41]Record of Proceedings Vol 3, Day 4,\n                                Page 38 at lines 17-29.[note: 42]Record of\n                                Proceedings Vol 3, Day 4, Page 79 at lines 13-15; Page 80 at lines\n                                27-32; Page 81 at lines 1-6.[note: 43]Record of\n                                Proceedings Vol 1 at 77.[note: 44]Record of\n                                Proceedings Vol 1 at 83-87, paras 21-22.[note: 45]Record of Proceedings Vol 3, Day 4,\n                                Page 84 at lines 7-8.[note: 46]Record of\n                                Proceedings Vol 3, Day 4, Page 88 at lines\n                        10-28.[note: 47]Record of Proceedings Vol 3, Day 4,\n                                Page 72 at lines 23-26.[note: 48]Record of Proceedings Vol 3, Day 4, Page 82 at lines\n                                22-26.[note: 49]Record of Proceedings Vol 3, Day 4, Page 85 at lines\n                                10-16.[note: 50]Record of Proceedings Vol 3, Day 4, Page 83 at line\n                                29.[note: 51]Record of\n                                Proceedings Vol 3, Day 4, Page 74 at lines\n                        30-32.[note: 52]Record of\n                                Proceedings Vol 3, Day 4, Page 76 at lines\n                        12-20.[note: 53]Record of Proceedings Vol 3, Day 4,\n                                Page 76 at lines 21-22.[note: 54]Record of Proceedings Vol 3, Day 4, Page 77 at line\n                                12.[note: 55]Record of Proceedings Vol 3, Day 4,\n                                Page 77 at line 20.[note: 56]Record of Proceedings Vol 3, Day 4, Page 98 at lines\n                                25-29.[note: 57]Record of Proceedings Vol 3, Day 5,\n                                Page 62 at lines 17-18.[note: 58]Record of\n                                Proceedings Vol 3, Day 5, Page 62 at lines\n                        13-14.[note: 59]Record of Proceedings Vol 3, Day 4, Page 94 at lines 6-18;\n                                Page 95 at lines 3-29.[note: 60]Record of Proceedings Vol 3, Day 4, Page 89 at lines\n                                23-26; Page 90 at lines 1-7.[note: 61]Record of Proceedings Vol 3, Day 4,\n                                Page 90 at lines 22-32; Page 91 at lines\n                        15-18.[note: 62]Record of Proceedings Vol 3, Day 5, Page 48 at lines 21-32;\n                                Page 49 at lines 1-4.[note: 63]Record of Proceedings Vol 1 at\n                        128.",
        "Our finding on whether the respondent was dishonest": "81     We did not hesitate to find that the\n                    respondent had been dishonest. We would have found him dishonest solely on the\n                    basis of what transpired at the 15 November 2001 meeting between him and\n                    Mdm Chiang, as evidenced by the contents of the Gift Letter. In addition,\n                    the totality of the evidence pointed to his dishonesty. Taken together with a\n                    few other suspicious and poorly-explained circumstances, the overall picture\n                    that emerged was unambiguously that of manipulation of Mdm Chiang by the\n                    respondent. 82     Like the DT, we were of the opinion that in\n                    the initial stages, the respondent might have become involved out of a sense of\n                    charity towards Mdm Chiang. However, we had no doubt that this charity\n                    subsequently gave way to a desire to enrich himself financially at her expense\n                    by taking advantage of her mental frailty and lack of sophistication to secure\n                    almost half of the proceeds from the sale of the Property, as well as\n                    entitlement to all her assets upon her demise. We do not make any findings on\n                    the extent to which Lee and Yip were involved in the respondent’s\n                    manipulation of Mdm Chiang, if at all, because those issues were not before\n                    us. Be that as it may, we feel constrained to observe that the conduct of Lee,\n                    at least, raised serious questions calling for an explanation.",
        "Conclusion": "83     Having found that the respondent was dishonest\n                    in breaching r 46 of the Rules, we were of the view that he was no longer fit to\n                    practise as an advocate and solicitor. Accordingly, we ordered that he be struck\n                    off the roll. We also awarded costs to the Law Society on a standard basis, to\n                    be taxed if not agreed. 84     We conclude by emphasising that an advocate\n                    and solicitor who receives a significant gift from a client should be aware\n                    that the circumstances in which a gift is made will attract intense and detailed\n                    scrutiny if and when the propriety of the gift comes into issue. Prudent\n                    advocates and solicitors should therefore shun situations where even the\n                    appearance of having taken advantage of a client may later be called into\n                    question. It is only through close adherence to both the letter and spirit of\n                    the stipulated ethical constraints that legitimate concerns relating to the\n                    receipt of significant gifts may be dissolved.  [note: 1]Record of Proceedings Vol 1 at\n                        48. [note: 2]Record of Proceedings Vol 1 at\n                    101. [note: 3]Record of Proceedings Vol 1 at 38. [note: 4]Record of\n                                Proceedings Vol 1 at 41. [note: 5]Record of\n                                Proceedings Vol 1 at 43. [note: 6]Record of Proceedings Vol 1 at\n                                50. [note: 7]Record of Proceedings Vol 1 at\n                                48. [note: 8]Record of Proceedings Vol 2 at 50; Record of Proceedings Vol\n                                3, Day 4, Page 73 at lines 13-18. [note: 9]Record of Proceedings Vol 1 at\n                                47. [note: 10]Record of Proceedings Vol 1 at\n                                51-59. [note: 11]Record of Proceedings Vol 1 at\n                                60. [note: 12]Record of\n                                Proceedings Vol 1 at 61-63. [note: 13]Record of Proceedings Vol 1 at\n                        64. [note: 14]Record of\n                                Proceedings Vol 1 at 65. [note: 15]Record of Proceedings Vol 1 at\n                                66-76. [note: 16]Record of Proceedings Vol 3, Day 4, Page 100 at lines\n                                2-8. [note: 17]Record of Proceedings Vol 3, Day 4,\n                                Page 79 at lines 13-15. [note: 18]Record of Proceedings Vol 1 at 77. [note: 19]Record of Proceedings Vol 2 at\n                                85. [note: 20]Record of Proceedings Vol 1 at\n                                114-117. [note: 21]Record of\n                                Proceedings Vol 1 at 118. [note: 22]Record of Proceedings Vol 1 at\n                    120. [note: 23]Record of Proceedings Vol 1 at\n                        122-127. [note: 24]Record of\n                                Proceedings Vol 1 at 128. [note: 25]Record of\n                                Proceedings Vol 1 at 78. [note: 26]Vol 3, Day 1, Page 3 at lines 4-6; Day 2, Page 5 at line\n                                21. [note: 27]Record of\n                                Proceedings Vol 3, Tab 1, at para\n                    32. [note: 28]Record of Proceedings Vol 3, Tab 1, at\n                                paras 34-40. [note: 29]Record of Proceedings Vol 3, Tab 1, at paras\n                                41-42. [note: 30]Applicant’s Written Submissions at paras\n                        14-17. [note: 31]Respondent’s Written Submissions at para\n                        27. [note: 32]Respondent’s Written Submissions at para\n                        58-59. [note: 33]Respondent’s Written\n                                    Submissions at paras 43-48,\n                    50. [note: 34]Respondent’s Written\n                                    Submissions at para 30,\n                    51. [note: 35]Respondent’s Written Submissions at para 29,\n                                    49. [note: 36]Record of\n                                Proceedings Vol 3, Day 4, Page 36 at lines 18-21; Page 37 at lines\n                                2-5; Page 38 at lines 7-16, 21-29. [note: 37]Record of Proceedings Vol 3, Day 4,\n                                Page 38 at lines 7-16. [note: 38]Respondent’s Written Submissions at para\n                        30. [note: 39]Record of Proceedings Vol 3, Day 4,\n                                Page 36 at lines 22-27. [note: 40]Record of Proceedings Vol 1 at\n                                66. [note: 41]Record of Proceedings Vol 3, Day 4,\n                                Page 38 at lines 17-29. [note: 42]Record of\n                                Proceedings Vol 3, Day 4, Page 79 at lines 13-15; Page 80 at lines\n                                27-32; Page 81 at lines 1-6. [note: 43]Record of\n                                Proceedings Vol 1 at 77. [note: 44]Record of\n                                Proceedings Vol 1 at 83-87, paras 21-22. [note: 45]Record of Proceedings Vol 3, Day 4,\n                                Page 84 at lines 7-8. [note: 46]Record of\n                                Proceedings Vol 3, Day 4, Page 88 at lines\n                        10-28. [note: 47]Record of Proceedings Vol 3, Day 4,\n                                Page 72 at lines 23-26. [note: 48]Record of Proceedings Vol 3, Day 4, Page 82 at lines\n                                22-26. [note: 49]Record of Proceedings Vol 3, Day 4, Page 85 at lines\n                                10-16. [note: 50]Record of Proceedings Vol 3, Day 4, Page 83 at line\n                                29. [note: 51]Record of\n                                Proceedings Vol 3, Day 4, Page 74 at lines\n                        30-32. [note: 52]Record of\n                                Proceedings Vol 3, Day 4, Page 76 at lines\n                        12-20. [note: 53]Record of Proceedings Vol 3, Day 4,\n                                Page 76 at lines 21-22. [note: 54]Record of Proceedings Vol 3, Day 4, Page 77 at line\n                                12. [note: 55]Record of Proceedings Vol 3, Day 4,\n                                Page 77 at line 20. [note: 56]Record of Proceedings Vol 3, Day 4, Page 98 at lines\n                                25-29. [note: 57]Record of Proceedings Vol 3, Day 5,\n                                Page 62 at lines 17-18. [note: 58]Record of\n                                Proceedings Vol 3, Day 5, Page 62 at lines\n                        13-14. [note: 59]Record of Proceedings Vol 3, Day 4, Page 94 at lines 6-18;\n                                Page 95 at lines 3-29. [note: 60]Record of Proceedings Vol 3, Day 4, Page 89 at lines\n                                23-26; Page 90 at lines 1-7. [note: 61]Record of Proceedings Vol 3, Day 4,\n                                Page 90 at lines 22-32; Page 91 at lines\n                        15-18. [note: 62]Record of Proceedings Vol 3, Day 5, Page 48 at lines 21-32;\n                                Page 49 at lines 1-4. [note: 63]Record of Proceedings Vol 1 at\n                        128."
    }
}