{
    "case_title": "The “Turtle Bay”",
    "ncitation": "[2013] SGHC 165",
    "coram": "Belinda Ang Saw Ean J",
    "sections": {
        "Introduction": "1       The plaintiff as registered mortgagee\n                    (“the Bank”) of theTurtle Bayand\n                    theTampa Baycommenced Admiralty in Rem\n                    Nos 37 and 44 of 2013 (collectively, “the ADM Actions”) and\n                    arrested theTurtle Bayand theTampa Bay(collectively, “the Vessels”) in\n                    Singapore on 29 January 2013 and 5 February 2013 respectively. 2       The ADM Actions were commenced after the\n                    defendant shipowner had gone into liquidation in Germany. I should imagine that\n                    the effect of the defendant’s insolvency on the ADM Actions would be\n                    governed by German insolvency law. As to whether there were any insolvency\n                    issues arising under German law from the defendant’s liquidation, none\n                    were identified and explained in the Bank’s affidavits. The principles inIn re Aro[1980] Ch 196 followed inThe Oriental Baltic[2011] 3 SLR 487,The Hull 308[1991] 2 SLR(R) 643 andThe\n                        Convenience Container[2007] 4 HKLRD 575 that deal with the\n                    commencement ofin remproceedings either before\n                    and after the insolvency of a defendant came to mind, and I had wondered whether\n                    those cases differed from the facts of the present case before me. Be that as it\n                    may, in the affidavits supporting the arrest of the Vessels, the Bank disclosed\n                    that the German insolvency administrator was aware of the Bank’s intention\n                    to enforce the mortgages and gave written consent to the direct sale of the\n                    Vessels which the Bank intended “to carry out after arresting the\n                        [Vessels]”.[note: 1] 3       It was not surprising that with the liquidation\n                    of the defendant shipowner, no appearance was entered by the latter to the ADM\n                    Actions. The Bank duly filed two applications for default judgment (one for each\n                    of the Vessels) on 26 February 2013. On the same day, the Bank separately\n                    applied for a sale of each of the Vessels (together, “the Sanction\n                    Applications”). By prayer 1(a) of both the Sanction Applications, the\n                    Bank sought the court’s approval or confirmation of a private direct sale\n                    of theTurtle Bayand theTampa\n                        Bayon the terms of two contracts dated 5 February 2013 and 9\n                    February 2013 respectively (ie, after the arrest\n                    of each Vessel) that were entered between the Bank and a named buyer for a\n                    specified price each (“the Direct Private Sale”).[note: 2]On 26 February\n                    2013, the Bank was seeking judicial approval of a private salependente lite, but that was no longer the position after\n                    default judgment was obtained on 15 March 2013. Strictly speaking, the Sanction\n                    Applications were for orders approving the Direct Private Sale after\n                    judgment.",
        "The Sanction Applications": "4       The Sanction Applications were initially listed\n                    for hearing on 15 March 2013, but they were adjourned for the Bank’s\n                    lawyers to conduct further research on the law. 5       At the adjourned hearing on 5 April 2013,\n                    counsel for the Bank, Mr Mark Tan (“Mr Tan”) sought to justify the\n                    Bank’s case by distinguishing the steps taken by the Bank to arrange the\n                    Direct Private Sale from the settled proposition of law that any attempt to\n                    arrange a private sale of an arrested vessel after the court has commissioned\n                    the Sheriff to appraise and sell the vessel constituted contempt of court\n                        (The APJ Shalin[1991] Lloyd’s Rep 62;The Jarvis Brake[1976] 2 Lloyd’s Rep\n                    320). 6       I did not accept this distinction as a proper\n                    justification. Although a party is clearly in contempt of court if it arranges a\n                    private sale after the court commissions the Sheriff to sell a vessel, it does\n                    not necessarily follow that this party isneverin\n                    contempt of court if it arranges a direct sale before the court so commissions\n                    the Sheriff. Much depends on the circumstances of the case. For instance, a sale\n                    could potentially constitute contempt of court in the light of evidence that\n                    impropriety had occurred in connection with the sale to the possible detriment\n                    ofin remcreditors of the arrested vessel. In my\n                    view, it made no difference to the legal enquiry that a direct sale of an\n                    arrested vessel was made expressly subject to the court’s\n                approval. 7       Mr Tan’s submissions did not deal squarely\n                    with the fundamental issue at hand. He did not address the legal basis of the\n                    Bank’s Sanction Applications. The concern of this court was that the Bank\n                    was essentially seeking the court’s approval or confirmation of the Direct\n                    Private Sale (see [3] above) so as to attract the effect of a judicial sale in\n                    respect of the Vessels. The main issue was under what principles, circumstances\n                    and conditions should the court sanction the Direct Private Sale that was\n                    entered between the Bank and the named buyer in order to suit its own purposes,\n                    and turn it into an admiralty judicial sale (ie, a\n                    judicial sale madespecificallypursuant to the\n                    court’sadmiraltyjurisdiction)? In doing\n                    so, the court would be plainly departing from the normal order that the Sheriff\n                    sells a vessel by appraisement, advertisement and inviting bids to purchase the\n                    vessel: see Order 70 of the Rules of Court (Cap 322, R 5,\n                    2006 Rev Ed) (“the RSC”). 8       As this court saw it, simply because mortgagee\n                    banks (as arresting parties) have in the past applied for and obtained orders\n                    that sanctioned the private direct sales of arrested vessels would not be of\n                    assistance as they were not conclusive of the matter. It would be misguided to\n                    think that from those instances there now existed in Singapore an established\n                    practice of the court, in exercise of its admiralty jurisdiction, to sanction\n                    private direct sales of arrested vessels as judicial sales. 9       The Sanction Applications were dismissed on 26\n                    April 2013. I gave brief oral grounds for refusing the Sanction Applications. I\n                    had then indicated to Mr Tan that I would publish full written grounds in due\n                    course. I am grateful to Mr Tan for subsequently drawing to my attention the\n                    recent English decision ofBank of Scotland plc v The Owners\n                        of the MV “Union Gold”[2013] EWHC 1696\n                        (“The Union Gold”) where the\n                    Bank of Scotland plc sought orders of sale of four vessels to named purchasers\n                    at named prices. I will comment onThe Union Goldin due course.",
        "Distinction between a private sale and an admiralty judicial\n                sale": "10     I begin with the distinction between a private\n                    sale and a judicial sale of a vessel. A private sale of a vessel between the\n                    vendor and purchaser transfers title in the vessel to the purchaser, subject to\n                    thein remliabilities existing at the time of the\n                    sale and delivery of the vessel. Naturally, as a condition of the sale, the\n                    vendor would have to warrant that the vessel was unencumbered and that there\n                    were no existing debts or liabilities whatsoever. Typically, the vendor would\n                    provide an indemnity that was counter secured by a guarantee. 11     In contrast with a private sale, an admiralty\n                    judicial sale gives the purchaser a clean title to the vessel that is free from\n                    all liens and encumbrances (The Tremont(1841) 1\n                    Wm Rob 163;The Acrux[1962] 1 Lloyd's Rep 405 at\n                    409 and more recently inThe Cerro Colorado[1993]\n                    1 Lloyd's Rep 58 at 60, 61 and Ryan J inReadhead and Others\n                        v Admiralty Marshal, Western Australia District Registry and\n                        Others(1998) 87 FCR 229 at 242F). In other words, the admiralty\n                    judicial sale extinguished allin remclaims that\n                    were attached to the vessel prior to the sale and the vessel was no longer\n                    subject to arrest by virtue of those claims. The upshot of this should enable\n                    the Sheriff to sell an arrested vessel at the market price of the vessel rather\n                    than at a “forced sale” price. 12     This unique and important legal consequence of\n                    an admiralty judicial sale is an ancientin remdoctrine recognised in most admiralty jurisdictions. William Tetley QC inMaritime Liens and Claims(1st Ed, Business\n                    Law Communications Ltd, 1985) traced this doctrine at pp 468, 470-471: As Brown D.J. said in theThe\n                            Trenton[4 F. 657 at p. 663]: No one could possibly know the value of his purchase, for no one could\n                            foresee the amount of claims that might be made against the vessel in\n                            other countries. The finality and integrity of the judicial sale and the validity of the\n                        new title of ownership are therefore essential to the full realization of\n                        the maritime lien. … All jurisdictions have recognized the importance of the principle that the\n                        judicial sale of a ship be final and that the purchaser receive a clear\n                        title, free of all charges whatsoever. An early explicit statement is found in the Ordonnance de la Marine of\n                        1681 at Book I, Title XIV, art. 1:1 … … All ships and other vessels may be arrested and disposed of\n                            under law; and all privileges and hypothecs will be purged by the decree\n                            which will be made in the following form. The leading English judicial statement is by Dr. Lushington\n                        inThe Tremont[(1841) 1 W. Rob. 163 at p.\n                        164] who, in referring to the Admiralty Court, said: The jurisdiction of the Court in these matters is confirmed by the\n                            municipal law of this country and by the general principles of the\n                            maritime law; and the title conferred by the Court in the exercise of\n                            this authority is a valid title against the whole world, and is\n                            recognized by the Courts of this country and by the Courts of all other\n                            countries. The same principle had been enunciated in earlier decisions, includingThe Flad Oyen[(1799) 1 C. Rob. 134 at p.\n                        138] andThe Helena[(1801) 4 C. Rob. 3], and\n                        has been followed in subsequent judgments such asCastrique v. Imrie[(1869-70) L.R. 4 H.L. 414] andThe Ruby[[1898] P. 52]. The integrity and finality\n                        of the foreign judicial sale has been upheld in France, in the U.S. and in\n                        Canada. An equally famous dictum is of Brown D.J. inThe Trenton[4 F. 657 at p 659] In short, the doctrine that the sale of a vessel by a court of\n                            competent jurisdiction discharges her from liens of every description,\n                            is the law of the civilized world. 13     Dr Lushington’s statements inThe Tremontare fundamental to admiralty judicial sales.\n                    Indeed, many legal systems continue to give effect to admiralty judicial sales\n                    of foreign courts as a matter of comity. This recognition of the legal\n                    consequences of an admiralty judicial sale is important to a purchaser who\n                    intends to register the vessel in a different jurisdiction. 14     In the present case, it was reasonable to\n                    presume that as in any private sale, the Bank’s named buyers required the\n                    warranty and indemnity mentioned in [10] above. It would also not be surprising\n                    to find the Bank unwilling to be so bound. The best commercial solution would be\n                    to seek the court’s approval of a private sale to obtain the advantages\n                    that an admiralty judicial sale would conferie,\n                    clean title of the Vessels.",
        "Principles and effect of an admiralty judicial sale": "15     As stated, an admiralty judicial sale gives to\n                    the purchaser title to the vessel that is free from all liens and encumbrances.\n                    The legal premise and effect of an admiralty judicial sale that confers on the\n                    purchaser clean title of the vessel is that existing maritime claims of allin remclaimants against the vessel are\n                    transferred to the sale proceeds of the vessel (The\n                        Acrux[1962] 1 Lloyd's Rep 405 at 409). Suchin remclaimants include persons that may not have filedin remwrits or caveats against release, but\n                    have an interest in the vessel and sale. It is worth noting that the existing\n                    maritime claims ofin remclaimants against the\n                    vessel are divested by the judicial sale in proceedings to which these claimants\n                    are not a party to and in which they may well have no notice of. While these\n                    maritime claimants are nonetheless allowed to participate in the sale proceeds,\n                    this concomitant transfer of maritime claims (and priority) from the vessel to\n                    the proceeds of sale in court is theraison\n                        d’etreof the principle that a judicial sale is for the\n                    protection and benefit of all persons interested in theres; it is not only for the interest of the arresting party\n                    alone. 16     As William Waung J inDen\n                        Norske Bank ASA v Owners of the ship “Margo L”[1997] HKEC 767 (“The Margo L”)\n                    opined: The role of the Admiralty Court is to ensure that any sale of the vessel\n                        is effected in such a way as to protect all Admiralty claimants not merely\n                        the Plaintiff who arrested the ship or who requested ex parte the Admiralty\n                        Court to sell the ship or who has obtained ex parte a very large judgment\n                        (which can be set aside when contested by interested competing claimants) or\n                        who has a high priority claim. The best way (which is also the normal way)\n                        that the Admiralty Court ensures protection for all Admiralty claimants is\n                        by insisting upon the sale of the ship being done by all the well tried out\n                        method of appraisement and sale by public tender. 17     To protect the interests of all persons within remclaims against the vessel including the\n                    defendant shipowner, the court has to have entire control over the sale process\n                    thereby safeguarding the propriety and integrity of the sale process and,\n                    ultimately, instilling confidence and standing of the judicial sale from this\n                    jurisdiction. To this end, there are comprehensive procedures in O 70 for a\n                    court ordered judicial sale to be carried out by the Sheriff pursuant to a\n                    commission for appraisement to ascertain the value of the vessel, by the\n                    placement of advertisements and invitation to submit bids for the purchase of\n                    the vessel. 18     Once the Sheriff is commissioned to appraise\n                    and sell the vessel, he is under a duty to first appraise the vessel to\n                    ascertain the value. The Sheriff would be assisted by professional and\n                    experienced appraisers who as court-appointed appraisers have to act faithfully\n                    and impartially. The amount of the appraised value is kept confidential so as\n                    not to affect the price at which bids are received. Ordinarily, the Sheriff\n                    would accept the highest bid price unless it is below the appraised value. When\n                    the court is asked to exercise its discretion to approve a judicial sale where\n                    the highest bid price is below the appraised value, the Sheriff hands over the\n                    confidential appraisement report of the court-appointed appraiser in a sealed\n                    envelope for the court’s consideration. At no point in time would the\n                    amount of the appraisal be revealed to the public. In doing so, the integrity of\n                    the judicial sale process is preserved. 19     The duty of the Sheriff is to realise the\n                    highest price from the sale for the benefit of all interested parties (The Silia[1981] Lloyd’s Rep 534 at 535;The Margo L). InThe Honshu\n                        Gloria[1986] 2 Lloyd's Rep 63, Sheen J found that the Admiralty\n                    Marshal was entitled to obtain the services of a classification society prior to\n                    the commission of sale in order to retain the vessel in class to achieve the\n                    highest price for the vessel. Similarly, inThe Westport (No\n                        2)[1965] 1 Lloyd's Rep 549, the Admiralty Marshal was permitted\n                    to arrange for repairs to the feed-water pump of the vessel in order to ensure\n                    that the vessel could be sold as a going concern at a higher\n                price. 20     The placing of advertisements not only\n                    publicise the sale to a wider audience interested in bidding for the vessel to\n                    obtain the best possible bid price, but they also serve to notify the sale to\n                    all others interested in the vessel so that they can come forward and establish\n                    their maritime claims. These interested parties include other claimants that may\n                    not have issuedin remwrits or filed caveats\n                    against release but have an interest in the vessel and sale. 21     Finally for the sake of completeness, in\n                    relation to the rights ofin remclaimants against\n                    the vessel that have been transferred to the sale proceeds by virtue of the\n                    judicial sale, there is a comprehensive procedure in the RSC for the priority of\n                    these claims to be determined and for the distribution of the sale proceeds\n                    among all who come forward and establish their maritime claims within a\n                    specified time (see O 70 r 21(2)). The proceeding is entirelyin rem, and it binds the world.",
        "Court’s discretionary power to order a judicial sale": "22     The power of the court to sell a vessel under\n                    arrest after judgmentin remis obtained against\n                    that vessel is well established. I have referred to the court’s discretion\n                    with respect to the confirmation of judicial sales, in particular, where the\n                    highest bid price received by the Sheriff was below the appraised value (see\n                    [18] above). In one sense, such an application to sell below the appraised value\n                    is illustrative of the function of a judicial sale in which two competing\n                    concerns in a judicial sale are balanced: that of accepting the highest bid\n                    price at a fairly conducted Sheriff’s sale on the one hand, and weighing\n                    that concern against the purpose to be achieved by a judicial sale, which is to\n                    benefit all persons interested in thereson the\n                    other (see [15]-[17] above) . There is no doubt that the court has discretion to\n                    refuse to confirm a judicial salebelowthe\n                    appraised value where the disparity between the highest bid price and the\n                    valuation of the court-appointed appraiser is so great as to possibly result in\n                    a sale that is relatively cheap and, on its face, prejudicial to the otherin remcreditors and the defendant shipowner.\n                    The unfettered discretion to refuse the bid price could be exercised even in the\n                    absence of evidence suggesting that the sale was conducted unfairly or that a\n                    higher realisable sale price was possible. 23     Notably, a party seeking to obtain the\n                    court’s sanction of a private direct sale is essentially departing from\n                    the comprehensive procedure in the RSC. Therefore, any substitute method of sale\n                    (and its propriety) would have to be weighed against the purpose to be achieved\n                    by a judicial sale order granted in the normal way. More often than not, the\n                    substitute method of sale, for example, a court sanctioned private sale (as was\n                    the case here), is advanced for the applicant’s own purpose and benefit\n                    and isprima facieunfair. 24     InInternational Marine\n                        Banking Co v Dora [No. 2][1977] 1 FC 603 at [7]\n                        (“The Dora”), the plaintiff\n                    applied for the private sale of the vessel and submitted that the sale price of\n                    CAD 5.9 million was the best price obtainable. The Canadian court refused to\n                    allow the sale after examining sale process. In doing so, it held at\n                    [17]: Accordingly I am not prepared to approve the procedures followed either as\n                        being a satisfactory substitute for what might have been prescribed by the\n                        Court had an application been made, or as calculated to achieve the best\n                        price obtainable. The fact of the matter, as I view it, is that the\n                        procedure is one prescribed by the plaintiff as satisfactory for its own\n                        purposes and the proposed sale which has resulted from it is not a sale by\n                        the Court at all but a sale by the plaintiff for which it now seeks the\n                        endorsement of the Court to give the transaction the appearance of a sale by\n                        the Court. I would not, therefore, be prepared to grant the order sought\n                        even if I were satisfied that the 5.9 million price is as high as any price\n                        likely to be obtained on a sale by the Court. 25     Similarly, inThe Margo\n                        L, the plaintiff bank applied to sell the vessel to a buyer found\n                    by the plaintiff, and at a specified price. Waung J noted that a private sale at\n                    a pre-determined price to a named purchaser was not generally the accepted way\n                    to sell the vessel for the best possible price. In that case, he considered the\n                    valuation certificates produced by the plaintiff bank to show that a proper\n                    appraisement of the vessel in question had been done and held: In this case, Den Norsk Bank which is a ship finance specialist is asking\n                        the Court (as it has done repeatedly on a number of occasions) to depart\n                        from the normal mode of sale and to allow its proposed purchaser Hudson to\n                        buy the Vessel at US$3.4 million. In support of this application, the Bank\n                        relies on three brief Valuation Certificates from three valuers who valued\n                        the Vessel at respectively US$2.5 million, US$2.75 million and US$3.2\n                        million. Unfortunately as often happens in this sort of maritime valuation\n                        of ships, no detailed analysis was shown in these Valuation Certificates as\n                        to the factors and reasons which led to these valuations being given and in\n                        the absence of analysis and reasons, there can be no proper weighing of the\n                        strength of any of these Valuation Certificates or why one should be\n                        preferred over the other or why any one should be accepted. This most\n                        unsatisfactory nature of the valuations of the Vessel is however only one\n                        aspect of why the Court cannot allow private sale. 26     As I see it, these two decisions resonate with\n                    our admiralty jurisprudence and reflect the court’s concern with a\n                    substitute method of sale (see [23] above). In this case, the Bank, as mortgagee\n                    in possession, wanted the court’s sanction of the Direct Private Sale to\n                    obtain the perceived advantages of both judicial and private sales for its own\n                    benefit. The divergence in the interest of the Sheriff acting pursuant to a\n                    commission for appraisement and sale and such a party must necessarily require\n                    the court to exercise caution when dealing with this sort of hybrid sale\n                    application and to carefully scrutinise each application. 27     Recently, Teare J inThe\n                        Union Goldheld that as a matter of general principle the court\n                    should not order a sale to a buyer found by the arresting party notwithstanding\n                    that the proposed price appeared to be at or about the market value of the\n                    vessel. InThe Union Gold, the applicant mortgagee\n                    bank arrested four small cargo vessels on 24 May 2013, and thereafter applied\n                    for an order that they be soldpendente liteto\n                    named buyers at named prices. The defendant shipowner owed the mortgagee bank\n                    EUR 4.5 million on a loan that was secured by mortgages over three of those four\n                    vessels (the three vessels wereUnion Emerald,Union SilverandUnion\n                        Gold). In addition, the aggregate debt of EUR 13.5 million was\n                    separately secured by a mortgage on the fourth vessel (Union\n                        Pluto). Besides the bank, there were other creditors within remclaims against the vessels. The bank\n                    had received an offer to purchase all four vessels at various prices which\n                    either exceeded the highest valuations obtained by the bank or were within the\n                    range of the valuation. For example, the bank received an offer of EUR 329,000\n                    which was in excess of the bank’s valuation ofUnion\n                        Pluto. I will come to the facts of the fourth vessel,Union Pluto, in due course. 28     Teare J had a number of concerns with the\n                    mortgagee bank’s application for a direct sale. First, the private direct\n                    sale was without the usual appraisement conducted by the Admiralty Marshal.\n                    Second, seeking the court’s approval of a sale to a named buyer at a named\n                    price had the effect of asking the court to appraise the value of the vessels\n                    and in the course of this revealed the valuations obtained by the bank to\n                    potential buyers. This contrasted with the usual case where the vessel is\n                    appraised by the Admiralty Marshal and the appraised value is kept confidential.\n                    Third, the direct sale to the named buyer would do away with the need to\n                    advertise the sale and invite offers to buy the vessels. In fact, the court was\n                    simply asked to approve a sale to a buyer found by the bank, and there was a\n                    risk that the vessels would not be sold at the best possible price. All those\n                    concerns strongly suggested to Teare J that it would be wrong in principle to\n                    depart from the usual order that the Admiralty Marshal sell the vessels by\n                    appraisement, advertisement and inviting bids for the vessels. As it was\n                    important that the reputation of the Admiralty Court for impartiality for\n                    judicial sale of vessels not be tarnished in any way, Teare J’s concern\n                    was that acceding to the bank’s application might give the impression that\n                    the Admiralty Marshal was acting for a particularin\n                        remclaimant and the defendant shipowner. With all these\n                    concerns, Teare J refused the bank’s application that the first three\n                    vessels be sold to named buyers at named prices. 29     I am in agreement with Waung J inThe Margo Land Teare J inThe Union\n                        Goldthat where a court is asked to depart from the normal course\n                    of commissioning the Sheriff to appraise and sell the vessel, the applicant has\n                    to identify the existence of “powerful special\n                        features” or “special\n                        circumstances” before the court will be prepared to make\n                    the order that is sought. 30     InBank of Scotland v\n                        “Nel” (The)(1997) 140 FTR 271, a vessel was loaded\n                    with 34,398 tonnes of sulphur that was to be carried from British Columbia to\n                    Tunisia when it was arrested. The mortgagee was concerned that the sulphur would\n                    cause severe corrosion damage to the vessel and the possibility of off-loading\n                    the sulphur was considered but found to be very expensive. The mortgagee found a\n                    purchaser who would carry the cargo to its destination and was willing to pay\n                    20% above the valuations prepared by shipbrokers. Although the Canadian court\n                    noted that the mortgagee was acting purely out of self-interest, in allowing the\n                    private sale, it acknowledged (at [15]): In the present instance, the sale may well suit the Plaintiff's purposes,\n                        but there are also broader common purposes including the ability to obtain\n                        proper value for a vessel that is at present apparently seaworthy but if\n                        left for a number of weeks, to accomplish a court ordered sale, might\n                        develop corrosion damage, become suspect as to condition and seaworthiness\n                        and thus be difficult to sell at a good price. Moreover, any buyer would\n                        likely insist that the cargo be off-loaded, a large expense coming out of\n                        the sale price, for no knowledgable (sic) buyer would be interested in a\n                        ship loaded with a cargo of sulphur say three or four months old or with\n                        trying to deliver that cargo by a voyage through a tropical or subtropical\n                        climate, with the prospect of adding to the corrosion damage which would\n                        almost certainly have begun. 31     InThe Union\n                        Gold, Teare J agreed to the bank’s application to sell the\n                    fourth vessel,Union Pluto, to a buyer found by\n                    the bank and at a named price as there were “special\n                        circumstances” pertaining to the fourth vessel that\n                    warranted such an order. There was evidence that a prompt sale was crucial to\n                    preserving a long-term contract which provided business for this vessel. If the\n                    long-term contract was lost (and there was evidence that it was at risk of being\n                    lost), then jobs of 21 persons including crew and shore-based personnel would be\n                    lost. The fourth vessel was also an old ship that was unlikely to attract\n                    buyers. Besides, the named buyer was in a position to retain and operate the\n                    long-term contract, and if that contract was lost, the named buyer was not\n                    likely to buy the fourth vessel. All these matters persuaded Teare J that,\n                    exceptionally, there was a need for a prompt sale and hence it was appropriate\n                    to grant the order sought. 32     These two cases illustrate what might\n                    constitute “powerful special\n                    features” or “special\n                        circumstances”. In the final analysis, much will depend on\n                    the facts of each case. Cogent evidence of exceptional circumstances must be\n                    adduced by a party seeking judicial confirmation of a private direct\n                    sale.",
        "Decision": "33     The concerns expressed by Teare J inThe Union Gold(see [28] above) featured equally in the\n                    present case. As such, I too share the same concerns as Teare J and I adopt them\n                    for their relevance and applicability with the same force and effect to the\n                    facts of the Sanction Applications. On the evidence, it was clear that the\n                    Direct Private Sale was a private arrangement that the Bank had entered with a\n                    named purchaser for a named price to suit its own purposes. In fact, the\n                    intention to sell the Vessels to the named buyer at a named price was present\n                    before proceedingsin remwere commenced (see [2]\n                    above). Such a sale cannot be lightly sanctioned as a matter of admiralty\n                    jurisprudence. At the risk of repetition, the purpose to be achieved by an\n                    admiralty judicial sale is to protect the rights of and benefit all interested\n                    persons, not just the rights and interests of the arresting party and the\n                    defendant shipowner. 34     The affidavit evidence filed in support of the\n                    Sale Applications did not show, and hence, did not support a departure from the\n                    normal sale order for the Sheriff to sell the Vessels by appraisement,\n                    advertisement and invitation to submit bids to purchase the\n                vessel. 35     Notably, the Bank’s affidavit sworn by\n                    one of its officers disclosed a short one page memorandum summarizing the\n                    processes taken by its appointed shipbroker as evidence of the steps that it\n                    took to bring each of the Vessels to the market and the process by which the\n                    eventual proposed purchaser was selected. The memorandum states that the Bank\n                    has been “aggressively marketing the Vessels on a\n                        global basis to ensure all potential buyers were aware that the Vessels were\n                        for sale”.[note: 3]Given that the Bank is trying to\n                    persuade the court to depart from the normal course of commissioning the Sheriff\n                    to appraise and sell the Vessels, leaving aside the lack of any\n                        “powerful special features” or\n                        “special circumstances” for the\n                    moment, one would have expected the Bank to provide more detailed evidence of\n                    the steps it had taken to bring the sale of the arrested vessel to the attention\n                    of the market at large. 36     Furthermore, based on the two valuations\n                    provided by the Bank, the price offered by each of the named purchaser was not\n                    significantly higher than the appraised values. It was not enough to simply\n                    state that the highest amounts that other potential buyers on the market were\n                    willing to pay for the Vessels were below the appraised values. There was also\n                    scant information about the other serious bidder who the Bank’s\n                    shipbrokers said it considered. 37     Finally, the Bank pointed to the estimated\n                    weekly expenses of maintaining the Vessels. In fact, this seemed to be the main\n                    justification put forward for the private sale. While they were not\n                    insignificant, having regard to the potential value of the Vessels, I was of the\n                    opinion that these expenses do not constitute “powerful special features” or “special circumstances” that justify the court departing\n                    from the usual course of ordering the appraisement and sale of the\n                    Vessels. 38     In the present case, just because no other\n                    claimants within remclaims against the Vessels\n                    have stepped forward was not a reason for this court to approve the Direct\n                    Private Sale as an admiralty judicial sale. As mentioned, the priority of\n                    competingin remclaims to the proceeds from the\n                    sale of an arrested vessel is a matter for consideration after the vessel has\n                    been sold and the sale proceeds paid into court. Accordingly, I refused the\n                    Bank’s applications to sanction the Direct Private Sale of the Vessels as\n                    an admiralty judicial sale. Instead, I granted the alternative prayer for the\n                    Vessels to be appraised and sold by the Sheriff.  [note: 1]Dr Clemens Hillmer’s Affidavit\n                                sworn on 28 January 2013 (ADM 37/2013) at [27] & Exhibit\n                                “CH-12” at p 270; Dr Clemens Hillmer’s Affidavit\n                                sworn on 28 January 2013 (ADM 44/2013) at [27] & Exhibit\n                                “CH-12” at p\n                270. [note: 2]Ute Haverkamp 2ndAffidavit (ADM\n                                37/2013) at Exhibit UH-15 at p 12); Ute Haverkamp\n                                    2ndAffidavit (ADM 44/2013) at\n                                Exhibit UH-15 at p 12). [note: 3]Ute Haverkamp\n                                    2ndAffidavit, at Exhibit\n                                UH-14."
    }
}