{
    "case_title": "Chang Mui Hoon\n      v\n      Lim Bee Leng",
    "ncitation": "[2013] SGHCR 17",
    "coram": "Colin Seow AR",
    "sections": {
        "Introduction and brief procedural history": "1       On 7 September 2009, a road traffic accident\n                    (“the accident”) occurred between a motor vehicle bearing\n                    registration plate number SFL5663U (“SFL5663U”) and another motor\n                    vehicle bearing registration plate number SFH303M (“SFH303M”)\n                    along the Pan Island Expressway. The plaintiff, Ms Chang Mui Hoon (“the\n                    Plaintiff”), was then sitting in the front passenger seat of SFL5663U.\n                    SFH303M, which collided into the rear of SFL5663U, was at the material time\n                    driven by Ms Lim Bee Leng (“the Defendant”). 2       The Plaintiff commenced a suit against the\n                    Defendant on 8 March 2011. On 25 January 2012, interlocutory judgment\n                    (“the consent judgment”) was entered by consent in favour of the\n                    Plaintiff. The Notice of Appointment for Assessment of Damages No 46 of 2012\n                    (“NA 46/2012”) was filed on 27 September 2012, after which NA\n                    46/2012 came up for hearing before me from 1 October 2012 to 4 October 2012, at\n                    the end of which it became part heard. The hearing of the evidence eventually\n                    concluded on 15 January 2013, and parties’ closing written submissions and\n                    reply submissions were tendered and exchanged by 7 March 2013 and 15 March 2013\n                    respectively. In the meantime, however, an application to amend what was by then\n                    the Statement of Claim (Amendment No 3) was taken out by the Plaintiff on 13\n                    March 2013 and it came up for hearing on 2 May 2013 (“the SOC amendment\n                    hearing”) whereupon it was partially granted. With the leave of this\n                    court, the parties later exchanged further consequential closing written\n                    submissions for NA 46/2012 on 23 May 2013. Having read and considered all the\n                    written submissions tendered in respect of NA 46/2012, I now deliver my judgment\n                    with my reasons.",
        "The claims": "3       The Plaintiff’s claim for general damages\n                    is in respect of a whiplash injury to her neck, alleged post-traumatic stress\n                    disorder and alleged depression which the Plaintiff claims she suffered as a\n                    result of the accident. The Plaintiff had earlier in the course of proceedings\n                    also claimed damages for alleged injury to her back (in particular, injury to\n                    her lumbar spine). However, this claim was abandoned at the SOC amendment\n                    hearing before me on 2 May 2013 (see [2] above). The Plaintiff has also claimed\n                    general damages for future medical expenses and loss of earning\n                capacity. 4       The Plaintiff’s claim for special damages\n                    includes medical expenses, maid expenses, transport expenses and pre-trial loss\n                    of income. I now deal with each of these categories of claims\n                below.",
        "General damages": "Whiplash injury on the Plaintiff’s cervical spine 5       There is no dispute that the Plaintiff sustained\n                    whiplash injury on her neck (ie, the cervical\n                    spine) as a result of the accident. The only dispute before me was the severity\n                    of the whiplash injury. 6       The Plaintiff’s case is that she sustained\n                    a “Grade 2” whiplash injury under the Quebec Severity\n                    Classification of Whiplash Associated Disorders (“the Quebec Severity\n                        Classification”),[note: 1]and seeks damages in the sum of\n                    $35,000. The Defendant, on the other hand, argues that the Plaintiff’s\n                    whiplash injury is merely a “Grade 1” injury warranting a\n                    significantly smaller sum in damages. For completeness, the Quebec Severity\n                    Classification is set out below: THE QUEBEC SEVERITY CLASSIFICATION OF\n                                        WADGRADECLINICAL PRESENTATION0No neck symptoms, no physical\n                                        signs1Neck pain, stiffness or tenderness only,\n                                            no physical signs2Neck symptoms and musculoskeletal\n                                            sign(s)3Neck symptoms and neurological\n                                            signs4Neck symptoms and fracture or\n                                            dislocation   7       According to the Quebec Severity Classification,\n                    the expression “musculoskeletal signs” means a “decrease in\n                    the range of motion and point tenderness”, and the expression\n                    “neurological signs” means a “decrease or absence of deep\n                    tendon reflexes, weakness and sensory deficits”.[note: 2] 8       In support of the Plaintiff’s claim for a\n                    “Grade 2” whiplash injury, Dr Chang Wei Chun (“Dr\n                    Chang”), an orthopaedic surgeon, was called to give expert evidence on\n                    the extent of the Plaintiff’s whiplash injury. According to Dr Chang, he\n                    had examined the Plaintiff on 1 June 2011 whereupon he observed restrictions in\n                    the movements of the Plaintiff’s cervical spine.[note: 3]Dr Chang explained that he\n                    had arrived at the opinion that the Plaintiff’s whiplash injury was a\n                    “Grade 2” injury because in an earlier medical report dated 22\n                    October 2009[note: 4](prepared by another\n                    orthopaedic surgeon named Dr David Wong Him Choon (“Dr Wong”) who\n                    examined the Plaintiff around two and a half weeks after the accident), Dr Wong\n                    had recorded that the Plaintiff had complained of “pain radiat[ing] down\n                    the right shoulder and upper limb as well as the interscapular region”.\n                    This, Dr Chang explained, would have placed the Plaintiff’s whiplash\n                    injury under “Grade 3” according to the Quebec Severity\n                    Classification since there were manifestations of “neurological\n                    signs” beyond just pain and restriction of movement in the\n                    Plaintiff’s neck (see table at [6] above). However, Dr Chang also noted\n                    that by the time he examined the Plaintiff on 1 June 2011, these neurological\n                    symptoms were no longer present. Taking the middle ground between a\n                    “Grade 1” whiplash injury (based on Dr Chang’s examination\n                    of the Plaintiff on 1 June 2011) and a “Grade 3” whiplash injury\n                    (which Dr Chang derived from Dr Wong’s medical report dated 22 October\n                    2009), Dr Chang concluded that the most appropriate classification for the\n                    Plaintiff’s whiplash injury in the circumstances would be “Grade\n                        2”.[note: 5] 9       Dr Chang’s conclusion is disputed by the\n                    Defendant. The Defendant’s expert witness, Dr Teh Peng Hooi (“Dr\n                    Teh”), a consultant orthopaedic surgeon, gave evidence that the\n                    Plaintiff’s whiplash injury was a mild one at “Grade 1”\n                    under the Quebec Severity Classification. In arriving at this opinion, Dr Teh\n                    relied on,inter alia, a report of the\n                    Plaintiff’s medical examination conducted at Raffles Hospital several\n                    hours after the accident happened where the examining doctor, Dr Raj\n                    Jayarajasingam (“Dr Raj”), stated the following\n                        observations:[note: 6] I saw [the Plaintiff] in our Accident and Emergency Department, Raffles\n                        Hospital on 07thSeptember 2009. She said she had been in a road traffic accident earlier that day. She\n                        said she had some neck and left face pain. Clinically examination unremarkable. X-ray of her face and neck C spine was normal. … [emphasis added] 10     Dr Teh explained that had the Plaintiff indeed\n                    sustained a “Grade 2” whiplash injury from the accident, Dr Raj\n                    would not have simply recorded a finding of “[c]linically examination\n                    unremarkable” which, contrary to Dr Chang’s dismissal of that\n                    statement for being “subjective”,[note: 7]meaningfully indicated that there were no remarkable symptoms insofar as the\n                    Plaintiff’s neck was concerned at the time of the medical\n                        examination.[note: 8]Dr Teh in his evidence also gave his\n                    medical opinion that in order for one to be able to fully assess the severity of\n                    any physical injury, medical examination of the injury has to be conducted\n                    within a “window of opportunity” of no more than two to three days\n                    after the injury was sustained:[note: 9] … When you assess an injury, invariably most time the window of\n                        opportunity for knowing the seriousness of the condition after an injury, I\n                        would say is within 2-3 days at the most. That is the best window of\n                        opportunity to know what damage has been done and what injury was sustained.\n                        … Accordingly, Dr Teh averred that Dr Raj’s medical report (see\n                    [9] above) would provide the most accurate account of the extent of the\n                    Plaintiff’s neck injury, and that all other accounts given by the\n                    Plaintiff’s medical experts, including that of Dr Chang’s, were\n                    unreliable because the medical examinations conducted by those experts all took\n                    place several months after the date of the accident.[note: 10] 11     With regard to the allegedneurologicalsymptoms which the Plaintiff has complained of (see\n                    [8] above), Dr Teh was of the view that those symptoms were attributable to a\n                    pre-existing degenerative condition known as cervical spondylosis[note: 11]and further added that the neck pain complained\n                    of was and continues likely to be of a psychological origin instead – a\n                    medical condition referred to as somatoform disorder.[note: 12]This latter assertion echoes the findings in\n                    a medical report dated 15 August 2011 prepared by the Defendant’s other\n                    expert witness, Dr Calvin Fones Soon Leng (“Dr Fones”), who is a\n                    consultant psychiatrist.[note: 13] 12     Having considered the evidence before me, I am\n                    of the view that the Plaintiff has suffered a “Grade 1” whiplash\n                    injury under the Quebec Severity Classification. I accept that Dr Raj’s\n                    medical report (see [9] above), given its contemporaneity vis-à-vis the time of\n                    the accident, cannot simply be dismissed as being “subjective” or,\n                    to use some of Dr Chang’s harsher words, to be considered “not\n                    worth the paper it is written on”.[note: 14]By\n                    comparison, all other accounts given by the Plaintiff’s expert witnesses\n                    (in particular Dr Chang’s account) and documented in their medical\n                        reports,[note: 15]insofar as any part thereof is being\n                    relied upon by the Plaintiff to prove that she has sustained a “Grade\n                    2” whiplash injury is concerned, carry substantially less weight in that\n                    same regard, because those accounts arose from medical examinations of the\n                    Plaintiff which took place long after – in the order of months – the\n                    accident happened.Apropos, it is worth mentioning\n                    that Dr Chang’s medical examination of the Plaintiff took place more than\n                    one and a half year after the accident took place (see [8] above). 13     With regard to Dr Wong’s medical report\n                    dated 22 October 2009, some additional observations need to be made other than\n                    that Dr Wong’s medical examination of the Plaintiff took place around two\n                    and a half weeks (see [8] above) after the accident (ie, around six times more than the “window of\n                    opportunity” as explained above would allow). Dr Wong had earlier deposed\n                    to an affidavit of evidence-in-chief as one of the Plaintiff’s expert\n                    medical witnesses for the proceedings. However, according to the\n                    Plaintiff’s counsel, Mr Andrew Hanam (“Mr Hanam”) on the\n                    first day of the hearing, Dr Wong had declined in the last minute to attend the\n                    court proceedings to give evidence.[note: 16]As it\n                    turned out, Dr Wong was the owner of SFH303M (see [1] above) and was sitting in\n                    the front passenger seat of SFH303M when the accident happened.[note: 17]As a result of Dr Wong’s\n                    refusal to attend the proceedings, Dr Wong’s affidavit of\n                    evidence-in-chief containing his medical report dated 22 October 2009 was\n                    expunged from the Plaintiff’s Bundle of Affidavits pursuant to O 38 r 2(1)\n                    of the Rules of Court (Cap 322, R 5, 2006 Rev Ed) which lays down the general\n                    rule that a deponent’s affidavit of evidence-in-chief shall not be\n                    received in evidence if he or she fails to attend trial.[note: 18]On that basis, Dr Chang’s evidence,\n                    insofar as his reliance has been placed on Dr Wong’s medical report dated\n                    22 October 2009, has been disregarded. In any event, the Defendant’s\n                    counsel, Mr Niru Pillai (“Mr Pillai”), has also brought this\n                    court’s attention to a letter dated 14 March 2011 which he received from\n                    Mr Hanam’s firm stating,inter alia, that\n                    “[the Plaintiff] takes the position that [Dr Wong’s] report is\n                    unreliable, may be tainted with bias, and is not admissible”.[note: 19] 14     I should also add, however, that even if Dr\n                    Wong’s medical report dated 22 October 2009 were to be admitted and\n                    considered, I would have been inclined to accept that the Plaintiff’s\n                    complaint(s) of persistent pain in her neck was not a result of\n                    “neurological symptoms” manifesting from her whiplash injury but\n                    was likely instead due to some form of somatoform disorder as suggested by Dr\n                    Teh and Dr Fones (see [11] above; but for which no award would be made given\n                    that the Plaintiff’s belated attempt to amend her pleadings to include a\n                    claim for somatoform disorder was rejected in the SOC amendment hearing (see [2]\n                    above), with no appeal arising therefrom), although I would not take the further\n                    view that the same complaint(s) of pain could also be explained away with\n                    cervical spondylosis. This means that one of the fundamental bases for Dr\n                    Chang’s ‘middle ground’ approach (see [8] above) in arriving\n                    at a “Grade 2” whiplash injury would have been seriously flawed in\n                    any case. 15     In assessing the appropriate sum to be awarded\n                    to the Plaintiff for her “Grade 1” whiplash injury, I have\n                    considered the precedents as set out inAssessment of\n                        Damages: Personal Injuries and Fatal Accidents(LexisNexis,\n                        2ndEd, 2005) at pp 206-214 and I note that,\n                    historically, the damages awarded for whiplash injuries tend to be from $5,000\n                    upwards depending on the severity of the injury in each particular case.\n                    However, I am also mindful that the precedents cited therein may now be of more\n                    limited guidance today than they were in the past given that these cases were on\n                    average decided close to a decade ago. The courts have taken economic realities\n                    such as monetary inflation into account when making awards in assessment of\n                    damages proceedings (see,eg,Tan Siew Bin Ronnie v Chin Wee Keong[2008] 1 SLR(R) 178\n                        (“Tan Siew Bin Ronnie”) at\n                    [18]), and in principle I see no reason to do otherwise in the present\n                    case. 16     At the same time, I also note that there are\n                    three relatively recent road traffic accident cases involving whiplash injuries\n                    that are of useful guidance in the present case. InTan Siew\n                        Bin Ronnie(see [15] above), Chan Seng Onn J upheld an assistant\n                    registrar’s award of $24,000 to the plaintiff for whiplash injury to the\n                    cervical spine with residual disabilities such as frontal headaches, neck\n                    stiffness and occasional bouts of vertigo (seeTan Siew Bin\n                        Ronnieat [4]). InClark Jonathan Michael v\n                        Lee Khee Chung[2010] 1 SLR 209 (“Clark Jonathan Michael”), Judith Prakash J\n                    declined to interfere with an assistant registrar’s award of $25,000 to\n                    the plaintiff for whiplash injury involving long-lasting effects such as neck\n                    pain, headaches, tinnitus and numbness of the arm (seeClark\n                        Jonathan Michaelat [26]). That award of $25,000, it should be\n                    added, included damages for the plaintiff’s “losses due to one year\n                    delay in graduation” (seeClark Jonathan\n                        Michaelat [2]). InMenjit Singh s/o Hari\n                        Singh v Ong Lay Peng[2012] SGHC 11 (“Menjit Singh”), the plaintiff who suffered a relatively\n                    uncomplicated whiplash injury was awarded $12,000 for pain and suffering (seeMenjit Singhat [13]). 17     Having reviewed the case authorities, I find\n                    that the Plaintiff’s whiplash injury in the present case is more elaborate\n                    than that inMenjit Singh. However, I am unable to\n                    reach the further conclusion that the whiplash injury in the present case is as\n                    severe as that in eitherTan Siew Bin RonnieorClark Jonathan Michael. In my view, a fair and\n                    reasonable award in the circumstances of the present case would accordingly be\n                    $16,000. Post traumatic stress disorder and depression suffered by the\n                Plaintiff 18     The Plaintiff is also seeking general damages\n                    in the sum of $50,000 for post-traumatic stress disorder (“PTSD”)\n                    and $10,000 for depression arising from the accident. In particular, the\n                    Plaintiff complains that she has,inter alia, now\n                    become fearful with headaches and giddiness whenever she is sitting in a motor\n                    vehicle, has trouble sleeping and has become easily irritable ever since the\n                    accident happened. The Defendant does not dispute that the Plaintiff is\n                    suffering from PTSD and depression. Instead, the Defendant is arguing that the\n                    quantum of damages sought by the Plaintiff is excessive. 19     The evidence given by the Plaintiff’s\n                    medical witness on her PTSD and depression are as follows. In a medical report\n                    dated 5 April 2011,[note: 20]Dr Clarice Hong Pei Hsia (“Dr\n                    Hong”), a consultant psychiatrist who treated the Plaintiff for her\n                    psychiatric ailments after the accident, stated that the Plaintiff was suffering\n                    from PTSD and “severe depression requiring pharmacotherapy and\n                        psychotherapy”.[note: 21]Referring to what is known as the\n                    DSM-IV Diagnosis Criteria for PTSD[note: 22](“DSM-IV Criteria”), Dr\n                    Hong gave her opinion in court that the Plaintiff’s PTSD was at a\n                    “severe” level as at January 2011, but that her PTSD had since\n                    improved to a “moderate” level by February 2012 with some residual\n                        symptoms.[note: 23]This, Dr Hong explained deductively,\n                    would mean that the Plaintiff’s PTSD prior to January 2011 after the\n                    accident might be even worse than “severe” under the DSM-IV\n                        Criteria.[note: 24] 20     The Defendant’s medical expert, Dr Fones\n                    (introduced earlier in [11] above), disagreed with Dr Hong’s assessment of\n                    the Plaintiff’s PTSD and depression. In his assessment using the DSM-IV\n                    Criteria, Dr Fones placed the Plaintiff in the category of “mild”\n                    for her PTSD. Dr Fones also assessed the Plaintiff’s depression to be\n                    “moderate”. In his medical report dated 28 October 2011, Dr Fones\n                        wrote:[note: 25] … Overall, the PTSD symptoms have subsided in intensity and frequency over\n                        time, such that [the Plaintiff] presently just manages to satisfy the\n                        threshold criteria for PTSD. The severity of PTSD is mild, although she\n                        continues to be troubled by continued symptoms and related avoidance and\n                        thus has Chronic PTSD. … … [The Plaintiff] had a moderate level of severity of her\n                        depression. While it is understandable how she tends to attribute all her present\n                        problems and symptoms to the accident more than 2 years ago, it is likely\n                        that a combination of factors have contributed to her stressful emotional\n                        state that precipitated and continues to maintain her symptoms. The PTSD,\n                        depression and comorbid somatoform pain disorder have combined to\n                        significantly affect her psychosocial and occupational functioning. The\n                        nature of her various symptoms and their progression however, make it\n                        difficult to conclude unequivocally that there was direct causation from the\n                        accident to fully account for all her present symptoms. … Dr Fones also stated in his medical report that he did not consider\n                    the Plaintiff’s psychiatric conditions to be permanently disabling at all,\n                    and estimated that recovery “could span 2-3 years”.[note: 26] 21     An explanation of the varying degrees of PTSD\n                    and its associated estimated awards is provided inGuidelines\n                        for the Assessment of General Damages in Personal Injury Cases(Academy Publishing, 2010) (“Guidelines for the\n                        Assessment of General Damages in Personal Injury Cases”)\n                    at pp 27-28: B. POST-TRAUMATIC STRESS DISORDER\n                            (“PTSD”) PTSD is a severe anxiety disorder that develops after exposure to a\n                        traumatic event. Formal diagnostic criteria (DSM-IV and ICD-9) require the\n                        symptoms to last more than one month and there is significant impairment in\n                        all aspects of a person’s life. Some of the symptoms include: -    Recurrent flashbacks; -    Persistent nightmares; -    Avoidance; -    Hyperarousal,etc a)Severe     $25,000–$50,000 In cases where the person suffers from severe PTSD, the effects are\n                        debilitating. He is unable to cope with daily life due to recurrent\n                        flashbacks and he is also tense and angry (hyperarousal) despite treatment.\n                        As a result, he is unable to gain employment. Prognosis is poor and the\n                        symptoms are likely to persist on a long-term basis. b)Moderately\n                                severe     $10,000–$25,000 This category is distinct from (a) above because of better prognosis.\n                        However, the effects are still likely to cause significant disability for\n                        the foreseeable future and the chances of the person being employed in his\n                        pre-trauma job is low. c)Moderate     \n                                $4,000–$10,000 Recovery in cases of moderate severity is good. Although there are\n                        symptoms still persisting on a long-term basis, the person is able to cope\n                        with the demands of daily life and is likely to gain employment. However, he\n                        may not be able to cope with the demands of his pre-trauma occupation and\n                        may only be capable of a job that is less stressful. d)Minor     $2,000–$4,000 Full recovery is achieved within one or two years with only minor symptoms\n                        still persisting. Prognosis is good. 22     Having regard to the guidelines above, I am\n                    unable to accept that the Plaintiff has suffered “severe” PTSD as\n                    a result of the accident. The main symptoms experienced by the Plaintiff in the\n                    present case are that she has become fearful with headaches and giddiness\n                    whenever she is sitting in a motor vehicle, has trouble sleeping and has become\n                    easily irritable ever since the accident happened (see [18] above). There is\n                    nothing seriously debilitating in these symptoms experienced by the Plaintiff,\n                    and neither was there any evidence positively establishing that the\n                    Plaintiff’s prognosis is poor. According to Dr Fones in his medical report\n                    dated 28 October 2011, he stated:[note: 27] I would not consider any of [the Plaintiff’s] psychiatric conditions\n                        to be permanently disabling at all, although the protracted duration of her\n                        symptoms would predict a recovery that could span 2-3 years. Her continued\n                        efforts at trying to regain her previous level of social and occupational\n                        functioning and participation in therapy would be very helpful in achieving\n                        good recovery, which I believe to be possible. 23     Dr Hong in her oral evidence may not have\n                    concurred with Dr Fones on his estimated timeframe for the Plaintiff’s\n                        recovery,[note: 28]but this was only because Dr Hong\n                    preferred to take a relatively noncommittal view that there is generally no\n                    rough timeframe that can be ascribed to a person’s recovery from\n                        PTSD.[note: 29]This cannot be taken to mean that Dr Hong\n                    was asserting that the Plaintiff’s recovery in the present case would take\n                    an indefinite or extraordinarily long period of time. In any case, it is also\n                    noted that Dr Hong agreed with Mr Pillai during cross-examination that the\n                    conclusion of the present legal proceedings would provide a major relief for the\n                    Plaintiff as regards her PTSD:[note: 30] Q:    If [the Plaintiff] sought treatment, as recommended\n                            by you and Dr Fones, would you agree with him that the condition --- the\n                            therapy she needs is about 2 years? A:    I can’t agree with the duration because I\n                            can’t qualify and quantify a time when a person can get better. I\n                            can also add that she has been very stressed by the legal\n                            proceedings. Q:    Would the end of the legal proceedings bring\n                            closure to one major stressful aspect of PTSD? A:    Theoretically, yes. 24     Based on the evidence discussed above, I am of\n                    the view that the Plaintiff’s PTSD falls more appropriately within\n                    somewhere between a high “moderate” and a low “moderately\n                    severe” category instead (see [21] above). 25     Turning now to the Plaintiff’s\n                    depression, it is again apposite to refer toGuidelines for\n                        the Assessment of General Damages in Personal Injury Casesat pp\n                    25-27 which states as follows: A.GENERAL PSYCHIATRIC DISORDERS This section covers psychiatric conditions not provided for specifically\n                        in the sections below. There is a myriad of psychiatric conditions that\n                        could result from experiencing a traumatic event,eg, depression, avoidant phobias, anxiety attacks,etc. They range in severity too, with the most\n                        severe psychiatric conditions debilitating a person to the extent that he is\n                        unable to cope with the activities of daily life. The factors to be taken into account in valuing claims of this nature are\n                        as follows: i)The person’s ability to cope with life and\n                            work in general as compared to his or her pre-trauma\n                        state; ii)The effect on the person’s relationships\n                            with family, friends and those with whom he or she comes into contact\n                            with; iii)Whether the person is suicidal as a result of his\n                            or her psychiatric condition; iv)Whether medical help has been\n                        sought; v)The extent to which treatment would be\n                            successful; vi)The extent to which medication affects the\n                            person’s work and social life; vii)Whether the person adheres faithfully to\n                            counselling sessions and takes his or her medication; viii)The risk of relapse in the future;\n                        and ix)The chances of full recovery in the\n                        future. a)Severe     $25,000–$55,000 The person suffers from marked problems with respect to factors (i) to\n                        (vi). Despite treatment, the prognosis remains very poor as the person is\n                        unlikely to be able to return to employment permanently or even take charge\n                        of his daily affairs. b)Moderately\n                                severe     $8,000–25,000 There are significant problems associated with factors (i) to (vi) above\n                        but the prognosis will be much more optimistic than in (a) above. However,\n                        the person may still have long-term problems coping with the stressors of\n                        work life and the demands of social life thus preventing a return to\n                        pre-trauma employment. He is however, able to perform the activities of\n                        daily life independently. c)Moderate     $3,000–$8,000 In cases of moderate severity, the person experiences problems associated\n                        with factors (i) to (vi) above. However, he shows marked improvement with\n                        treatment. Prognosis is good for this category. d)Minor     $1,000–$3,000 In this category, full recovery is achieved within a short period of time\n                        and the risk of relapse in the future is small. The person is able to return\n                        to previous employment with little or no residual disabilities. The level of\n                        the award takes into consideration the relatively short length of the period\n                        of disability and the extent to which daily activities and sleep were\n                        affected. 26     Similarly, I do not agree that the\n                    Plaintiff’s depression falls within the “severe” category.\n                    In my judgment, the Plaintiff’s depression can at most be placed at a low\n                    “moderately severe” category under the general guidelines as set\n                    out above. Taking into account that there is some overlap between the\n                    Plaintiff’s PTSD and depression, I will award the Plaintiff $20,000 for\n                    all the psychiatric conditions that she has suffered as a result of the accident\n                        (ie, $12,000 for PTSD, $10,000 for depression,\n                    and applying a discount of $2,000 for the overlap). In arriving at this figure,\n                    I have also considered the cases ofPang Koi Fa v Lim Djoe\n                        Phing[1993] 2 SLR(R) 366 andGoh Eng Hong v\n                        Management Corporation of Textile Centre and another[2003] 1\n                    SLR(R) 209 which were cited to me by Mr Hanam, and I do not find that the\n                    Plaintiff’s psychiatric condition as gleaned from the evidence in the\n                    present case is as severe and elaborate as those that featured in those two\n                    cases. Future medical expenses 27     The Plaintiff has put in a claim of $16,406.40\n                    for future medical expenses for her whiplash injury, PTSD and depression. More\n                    specifically, the claim is $12,000 for psychotherapy and $4,406.40 for\n                    chiropractic treatment.[note: 31]Mr Pillai has argued for the\n                    Defendant that no award should be made under this category of claim because\n                    there is a lack of cogent evidence to support the claim. 28     It is true, as pointed out by Mr Pillai in his\n                    submissions, that the Plaintiff’s own witness, Dr Hong, did not in her\n                    medical report fully address the issue of future treatment for the\n                    Plaintiff’s PTSD and depression, for example the nature of the treatment,\n                    the duration for which the treatment is required, the number of sessions that\n                    the Plaintiff should undergo, and the costs involved.[note: 32]All that was stated in Dr Hong’s\n                    medical report dated 5 April 2011 was as follows:[note: 33] … [the Plaintiff] will need to recuperate from the Post traumatic\n                        Stress disorder she is currently suffering from. A time frame is difficult\n                        to ascertain. … The cost can be computed only if I am able to estimate the time\n                        frame [the Plaintiff] requires to restore her former self. 29     However, the Plaintiff is not basing her claim\n                    of $12,000 on Dr Hong’s medical report. Instead, the Plaintiff is relying\n                    on Dr Fones’ medical report dated 28 October 2011 which stated as\n                        follows:[note: 34] … I opine that [the Plaintiff] would continue to benefit from\n                        regular psychotherapy in addition to medication. She had described her\n                        treatment sessions as ‘just chit-chat’. I had advised that if\n                        she wanted to overcome her PTSD symptoms, particularly the residual\n                        avoidance, she should consider engaging in specific targeted treatments like\n                        cognitive behavioural therapy (CBT), especially exposure therapy, or\n                        Eye-movement desensitization response (EMDR). I advised that she should\n                        discuss the treatment plan with her psychiatrist [ie, Dr Hong] but cautioned that her motivation to\n                        participate in treatment would be crucial for optimal response. …Her treatments would ideally be about once a month and is\n                            estimated to cost $150-300 a session. It is estimated that she may need\n                            about 2 years of therapy and medication costing up to $6,000 a\n                            year. [emphasis added] 30     Dr Fones may be the Defendant’s witness,\n                    but I know of no authority (nor have I been cited any by Mr Pillai) which\n                    precludes the Plaintiff in the present case from relying on evidence which has\n                    been volunteered by the Defendant’s witness regarding the\n                    Plaintiff’s future medical treatment for her psychiatric conditions. In\n                    any case, the court is entitled to look at all the evidence presented to it\n                    before making its judgment as to whether any award ought to be made in the case.\n                    I therefore allow the Plaintiff’s claim of $12,000 for future medical\n                    expenses in relation to her PTSD and depression. 31     Moving on to the Plaintiff’s claim of\n                    $4,406.40 for chiropractic treatment, the Plaintiff has arrived at this sum by\n                    relying on Dr Chang’s medical report dated 10 April 2012 where he\n                    stated: FUTURE MEDICAL\n                            TREATMENT Long-term treatment would essentially be pain medications and muscle\n                        relaxants as and when required. [The Plaintiff] found TCM treatment helpful when she was in Singapore.\n                        [The Plaintiff has migrated to Canada in October 2011.] In Vancouver she found chiropractic treatment beneficial.Hence, it would be reasonable for her to have four sessions a\n                            month of such treatment for an arbitrary 12 months. The cost would be\n                            what she has been paying [in Canada]. [emphasis added] 32     I note that this particular aspect of Dr\n                    Chang’s evidence was not challenged by Mr Pillai during Dr Chang’s\n                        cross-examination.[note: 35]However, two observations need to\n                    be made. Firstly, Mr Hanam has taken the cost of the Plaintiff’s\n                    chiropractic treatment in Canada to be C$75 per session before applying a\n                    currency conversion rate of 1.224 Singapore Dollars is to 1 Canadian Dollar to\n                    arrive at the sum of $4,406.40 (ie, C$75 x 1.224 x\n                    4 x 12).[note: 36]This is not an accurate calculation.\n                    According to the receipts of the Plaintiff’s chiropractic treatment in\n                    Canada which were tendered in court, the cost per session of those treatments\n                    was not consistently at C$75. In fact, out of the four receipts which were\n                    tendered, three were charged at C$50 each while only one was charged at\n                        C$75.[note: 37]In the\n                    circumstances, the appropriate cost per session should instead be the average of\n                    those four individual sums. This comes down to around C$56 per\n                session. 33     Secondly, Dr Chang’s recommendation that\n                    the Plaintiff should undergo four chiropractic treatment sessions per month for\n                    a duration of twelve months was made apparently on the basis that the Plaintiff\n                    has suffered a “Grade 2” whiplash injury under the Quebec Severity\n                    Classification. As I have found earlier, the Plaintiff’s whiplash injury\n                    should more appropriately be classified as “Grade 1” under the\n                    Quebec Severity Classification (see [12] above). A discount should therefore\n                    correspondingly be applied in calculating the final sum to be awarded for the\n                    Plaintiff’s future chiropractic treatment. In the circumstances of the\n                    present case, I am of the view that a fair and reasonable discount to be applied\n                    would be to halve Dr Chang’s recommended twelve-month duration for the\n                    Plaintiff’s future chiropractic treatment, while maintaining Dr\n                    Chang’s recommendation of four sessions per month. The end result would be\n                    a total sum of around $1,645 (ie, C$56 x 1.224 x 4\n                    x (12 ÷ 2)). For the avoidance of doubt, the same currency\n                    conversion rate which Mr Hanam has adopted in his calculation (see [33] above)\n                    was similarly applied in my calculation here. 34     Accordingly, I award the Plaintiff $1,645 for\n                    future medical expenses in respect of her whiplash injury. Loss of earning capacity 35     The Plaintiff is presently 43 years old and\n                    married with two children – a son of around 11 years old and a daughter of\n                    around 13–14 years old as at the date of this judgment. Her highest\n                    academic qualification is the GCE ‘O’ Level which she attained in\n                    secondary school, and her last full-time occupation was an assistant ticketing\n                    manager at a travel agency, earning around $2,744 a month. In 2005, she resigned\n                    and became a full-time housewife because she wanted to look after her children\n                    and also because she claimed she had problems with her domestic worker who had\n                    to be terminated.[note: 38]She\n                    has not had any permanent employment since, save for some occasional freelance\n                    ticketing services which she rendered from time to time to another travel agency\n                    for a small unspecified fee. She claims it was always her intention to return to\n                    the workforce once her children are old enough to look after themselves, and\n                    that she had intended to start a small dog grooming business and work as a dog\n                    groomer as she enjoys being with and looking after dogs.[note: 39] 36     In the proceedings, the Plaintiff has not\n                    pursued any claim for loss of future earnings. Instead, the Plaintiff is\n                    claiming $55,000 for future loss of earning capacity. In written submissions, Mr\n                    Hanam explained as follows:[note: 40] 22.    The Plaintiff was not employed at the time of the\n                            assessment but this by itself does not prevent the Plaintiff from\n                            claiming for loss of earning capacity. [citesNg Chee\n                                Wee v Tan Chin Seng[2013] SGHC 54 at [68]] 23.    There is clear evidence from Dr Fones that the\n                            Plaintiff is at a disadvantage in the open employment market due to her\n                            mental condition, namely PTSD and depression, which were caused by the\n                            accident. Dr Fones said … that due to PTSD and depression, the\n                            Plaintiff’s perceived pain was an impediment to her conducting\n                            herself maximally leading to her reluctance to actually look for a job.\n                            Dr Fones said it would take 2 years of therapy for the Plaintiff to\n                            recover. The Plaintiff’s inability to get a job is due to the PTSD\n                            and depressed state which in turn were caused by the\n                        accident. 24.    The Plaintiff’s evidence was that she\n                            intended to return to the workforce once her son turned 8 years of age.\n                            That is not an unusual situation with many mothers joining or re-joining\n                            the workforce once they have more time on their hands. Further the\n                            Plaintiff previously did in fact work, stopping work only because her\n                            children needed her and not because she did not want to\n                        work. 25.    From the evidence of the Defendant’s own Dr\n                            Fones, after 2 years of therapy, the Plaintiff should be able to re-join\n                            the workforce. How should the Plaintiff be compensated for the next 2\n                            years? According to the Defendant she should be given no or nominal\n                            damages for loss of earning capacity. This cannot be right. The\n                            Plaintiff was put into a state that at least for the next 2 years, the\n                            Plaintiff will be at a disadvantage in the open employment market\n                            because of her PTSD and depression both sustained because of the\n                            accident. The Court has to take a figure in the round but some Judges\n                            have found it useful to use a multiplier and multiplicand method to\n                            arrive of [sic] the figure. This would be a more scientific figure. The\n                            Plaintiff will be out of income for the next 2 years as she undergoes\n                            therapy. The sums that she was content to earn are what a dog groomer in\n                            Canada would earn (lowest 5% of incomes in Canada) and we have provided\n                            what their figures are based on data from the Canadian Government. This\n                            is reliable evidence and the Defendant has not provided any contrary\n                            evidence. … 30.    The figures from the Canadian government show that\n                            a dog groomer earns S$2,241 per month. Multiply this by the 2 years that\n                            the Plaintiff would need to fully recover, the sum is $53,784. Our claim\n                            for $55,000 for loss of earning capacity is not unreasonable based on\n                            the medical evidence of incapacity, the average monthly earnings and the\n                            Plaintiff’s evidence of wanting to be a dog groomer.\n                            … For completeness, it is apposite to mention that Mr Hanam arrived\n                    at the sum of $2,241 with the help of certain statistics and data that he\n                    obtained from a website named ‘Service Canada’ which is maintained\n                    by the government of Canada.[note: 41] 37     I pause at this juncture to mention one other\n                    aspect of the evidence which the Plaintiff has presented in respect of her\n                    claim. In the proceedings, the Plaintiff called her cousin, Ms Ho Chui Yan\n                    (“Ms Ho”), a pet stylist in Singapore, to give evidence as a\n                    factual witness on the salary she (Ms Ho) earns a month, as well as what pet\n                    stylistsin Singaporegenerally earn every\n                        month.[note: 42]Insofar as the Plaintiff’s claim for future loss of earning capacity is\n                    concerned, Ms Ho’s evidence is in any case of no consequence because the\n                    Plaintiff is no longer living in Singapore since she has already migrated to\n                    Canada in October 2011. 38     Coming back to Mr Hanam’s reliance on\n                    ‘Service Canada’ to support the Plaintiff’s claim, Mr Pillai\n                    has highlighted to this court a disclaimer found on the same website which\n                        states:[note: 43] Some of the information and services found on this Web site have been\n                        provided by external sources. Service Canada is not responsible for the\n                        accuracy, reliability or currency of the information or services provided by\n                        external sources. Users wishing to rely upon this information or services\n                        should consult directly with the appropriate source. 39     Just so to address any intention the Defence\n                    may have in seeking to exclude any statistics or data found in the website, I do\n                    not think that the existence of such a disclaimer in the present case\n                    necessarily precludes any reliance by the Plaintiff on the information in the\n                    website for the purposes of the current proceedings. The disclaimer seeks to\n                    disclaim ‘Service Canada’ from any potential liability for putting\n                    up those statistics and data on its website. The purpose for which the\n                    disclaimer was made in the website is quite obviously different from that which\n                    the Defence is presumably asserting in drawing this court’s attention to\n                    the disclaimer. 40     In submissions, Mr Pillai also argued that\n                    given that the Plaintiff has not been working for close to five years as at the\n                    date of the accident (see [35] above), she has “no competitive edge which\n                    would have been lost as a result of any residual deficit suffered from the\n                    injury sustained in the accident”.[note: 44]I do not agree with this contention. Given\n                    the Plaintiff’s age and academic qualifications (see [35] above), I find\n                    it difficult to accept that the Plaintiff’s “competitive\n                    edge” in the employment market is, as Mr Pillai would have suggested,\n                    totally non-existent to begin with. As noted earlier, the Plaintiff still\n                    rendered occasional freelance ticketing services for a travel agency over the\n                    years as a housewife. The Plaintiff, in my opinion, is still relevant in terms\n                    of the basic skills required of her in order to compete in the general job\n                    market. 41     Moving on, I agree with Mr Hanam’s\n                    submission that Dr Fones did mention that the Plaintiff’s PTSD, depression\n                    and, to a limited extent, somatoform disorder, is an impediment to her\n                    functioning maximally:[note: 45] Q:    The Plaintiff has not looked for a job in Canada\n                            since migrating in October 2011. Would this ---- would the somatoform\n                            disorder have contributed toward her reluctance to look for a\n                            job? A:    Yes. Q:    Can you elaborate please? A:    Together with the PTSD and depression, her\n                            perceived pain would to her be an impediment to conducting herself\n                            maximally, or rather functioning maximally. This would have led to her\n                            reluctance to actually look for a job. I however felt that it is\n                            primarily the avoidance that stems from her PTSD and depressed state\n                            that contributes more to her reluctance. Q:    As opposed to the somatoform\n                        disorder? A:    Yes. 42     However, I am doubtful whether this, as a\n                    matter of evidential proof, necessarily translated into the Plaintiff actually\n                    suffering a reduction of her “competitive edge” in the employment\n                    market which is compensable by way of damages for loss of earning capacity. Dr\n                    Fones’ allusion to the Plaintiff experiencing an\n                    “impediment” and not being able to “function\n                    maximally” must be understood in the context of the question that was\n                    asked of him,vizwhat caused the\n                    Plaintiff’sreluctance to look for a jobin\n                    Canada after the accident? An impediment causing a person’s reluctance to\n                    seek gainful employment and an impediment adversely affecting that\n                    person’s “competitive edge” in the job market ought\n                    conceptually be distinguished, and for good reason – the former may call\n                    forloss of future earningsto be used as the\n                    proper measure of damages to be awarded (which is not pleaded here), while the\n                    latter (if proven) is more appropriately compensated by way of awarding damages\n                    forloss of earning capacity. Conceptually\n                    speaking, Mr Hanam’s computation of the sum of $55,000 as gleaned from\n                    [36] above is therefore faulty because he was actually building a case for loss\n                    of earning capacity with a claim for loss of future earnings which the Plaintiff\n                    has not pleaded at all. As Judith Prakash J observed inClark\n                        Jonathan Michael(see [16] above) at [91]: 91    … the approach taken [in respect of damages\n                            for loss of earning capacity] … where the award was made by\n                            ascertaining, in so far as it was possible, the earnings foregone per\n                            month because of the injuries suffered by the plaintiff and multiplying\n                            that by the length of time the plaintiff was expected to work for, is\n                            … not very satisfactory as it makes the award akin to an award\n                            for loss of future earnings. … I therefore reject Mr Hanam’s computation of $55,000 as\n                    damages for the Plaintiff’s future loss of earning capacity. 43     Nevertheless, given my finding that the\n                    Plaintiff has suffered a high “moderate” to low “moderately\n                    severe” form of PTSD and at most a low “moderately severe”\n                    level of depression (see [24] and [26] above) requiring two years of\n                    psychotherapy (see [29]-[30] above), as well as my finding that the Plaintiff\n                    has suffered whiplash injury requiring six months’ worth of future\n                    chiropractic treatment (see [33] above), I am prepared to independently find on\n                    irresistible inference that there is some extent of temporary (since there are\n                    nopermanentdisabilities in the present case)\n                    weakening of the Plaintiff’s “competitive edge” in the job\n                    market while she is en route to full recovery, which ought to be compensated\n                    with damages. Having said that, I wish to however also state that while some\n                    time allowance may be given to the Plaintiff to cope with her injuries, any\n                    furthersubstantialdelay occasioned by the\n                    Plaintiff’s continuedreluctanceto seek\n                    re-employment is likely to be unreasonable. Time is that wherein there is\n                    opportunity, but opportunity is that wherein there is no great time.[note: 46]The Plaintiff must endeavour\n                    to pick herself up swiftly and seize every opportunity to move on with her life\n                    as soon as possible. 44     In assessing the appropriate damages, I am\n                    mindful again of Judith Prakash J’s holding inClark\n                        Jonathan Michaelat [91] which states: 91    … The assessment for damages for loss of\n                            earning capacity can be an exercise in speculation as often the court\n                            does not know the extent to which a plaintiff will be disadvantaged by\n                            his disabilities if he has to seek a new position. In the end, it is\n                            clear from the cases that the assessment is a rather rough and ready one\n                            which really reflects the amount that the particular court thinks is\n                            reasonable in the particular circumstances to compensate the particular\n                            plaintiff for the disadvantage he has been put into in the job market by\n                            his disabilities. 45     I find that an award in the sum of $12,000\n                    would fairly and reasonably compensate the Plaintiff for her future temporary\n                    loss of earning capacity in the present case.",
        "Special damages": "Pre-trial loss of income 46     The Plaintiff is claiming a total sum of\n                    $49,092 for pre-trial loss of income comprising $22,200 for the period covering\n                    17 February 2011 to 30 September 2011 (the “pre-migration loss of\n                    income”) and $26,892 for the period covering 10 October 2011 to 30\n                    September 2012 (the “post-migration loss of income”). In this\n                    regard, it will be recalled that the Plaintiff has migrated together with her\n                    family to Canada in October 2011 (see [37] above). 47     The Plaintiff, as mentioned earlier, has been\n                    a full-time housewife since 2005 with no significant income (see [35] above). In\n                    court, she explained that she had planned to resume working life as a dog\n                    groomer by starting a small dog grooming business after her son reached eight\n                    years old and finished his primary one education in school (ie, sometime in the beginning of 2011).[note: 47]Referring to Ms Ho’s evidence (see [37]\n                    above) that she (Ms Ho) earned around $3,000 a month as a pet stylist in\n                    Singapore, Mr Hanam submitted that this would similarly have been a reasonable\n                    monthly income that the Plaintiff could have earned but for the injuries she\n                    suffered from the accident. Accordingly, Mr Hanam argued that the multiplicand\n                    for computing the Plaintiff’s pre-migration loss of income should be\n                    $3,000. As to the multiplier, Mr Hanam pointed out that in furtherance of her\n                    plan to be a dog groomer, the Plaintiff had in late 2010 signed up for a dog\n                    grooming certification course which she completed on 16 February\n                        2011,[note: 48]but unfortunately she\n                    was unable to bring the plan to fruition as she was medically advised against\n                    working as a dog groomer as it was considered to be too physically demanding in\n                    light of her whiplash injury.[note: 49]Taking the\n                    date of the certification as well as the time the Plaintiff eventually migrated\n                    to Canada into account, Mr Hanam obtained a multiplier of 7.4 months, thereby\n                    arriving at a total claim of $3,000 x 7.4 = $22,200 for the Plaintiff’s\n                    pre-migration loss of income. 48     With regard to the Plaintiff’s\n                    post-migration loss of income, Mr Hanam adopted the figure of $2,241 which he\n                    derived from the ‘Service Canada’ website (see [36] above) as the\n                    multiplicand. Taking into account the Plaintiff’s migration as well as the\n                    time this current proceedings came up for hearing, Mr Hanam computed a figure of\n                    12 months as the multiplier, thereby giving the sum of $2,241 x 12 = $26,892 for\n                    the Plaintiff’s post-migration loss of income. 49     The Defendant, on the other hand, submitted\n                    that no award for pre-trial loss of income should be made at all. The following\n                    objections were raised in submissions:[note: 50] (a)     the Plaintiff was not earning any\n                        income at the time of the accident, and it was therefore impossible to allow\n                        any award for pre-trial loss of income; (b)     the Plaintiff in obtaining a dog grooming\n                        certificate was far from sufficient to support and prove her claim for\n                        pre-trial loss of income; (c)     Ms Ho’s evidence on her own salary was not\n                        supported by any documentary evidence; (d)     it is unreasonable to assume that the Plaintiff would\n                        immediately set up a dog grooming business the moment she arrived in Canada\n                        in October 2011; and (e)     it would be presumptuous to think that the Plaintiff would have\n                        succeeded in her dog grooming business in any case. 50     As I understand it, objection (a) was premised\n                    on the proposition that an award for pre-trial loss of income is by way ofspecial damageswhich must be put to strict\n                    proof (cfMichael F Rutter,Handbook on Damages for Personal Injuries and Death in Singapore and\n                        Malaysia(Butterworths Asia, 2ndEd,\n                    1993) at pp 195-196). The Plaintiff, in Mr Pillai’s submissions, has\n                    failed to discharge her burden of strict proof as there was no and there could\n                    not have been any evidence of the Plaintiff’s monthly income at the time\n                    of the accident as she was then a full-time housewife for almost five\n                    years. 51     On this point, I find one particular\n                    Australian commentary on the principles of assessment of damages to be worthy of\n                    note and which I shall quote at length. In Harold Luntz,Assessment of Damages for Personal Injury and Death: General\n                        Principles(LexisNexis Butterworths, 2006) (“Assessment of Damages for Personal Injury and Death: General\n                        Principles”) at pp 89-92, the author wrote: Calculation of\n                        damages Traditional distinction 6.2    InPaff v Speed[(1961) 105 CLR 549 at 558-559],\n                            Fullagar J referred to the fact that in cases concerning the award of\n                            damages at common law for personal injuries the ‘orthodox\n                            direction’ to the jury ‘begins … by drawing and\n                            explaining a distinction between “special damages” and\n                            “general damages”. His Honour continued: Special damages are awarded in such cases in respect of monetary loss\n                            actually suffered and expenditure actually incurred. Their two\n                            characteristics are (1) that they are assessed only up to the date of\n                            verdict, and (2) thatthey are capable of precise\n                                arithmetical calculation or at least of being estimated with a close\n                                approximation to accuracy. The familiar examples are\n                            medical and surgical fees paid or payable, ambulance and hospital\n                            expenses, and loss of income. Where the plaintiff has been employed at a\n                            fixed wage or salary, his loss of income can commonly be calculated with\n                            exactness. Where the plaintiff has not been employed, but is, for\n                            example, a professional man, his monetary loss can be estimated without\n                            difficulty by reference to his past earnings. In a high proportion of\n                            cases the amount of the ‘special damages’ is agreed between\n                            counsel for the plaintiff and counsel for the defendant. ‘General damages’ on the other hand are, of their very\n                            nature, incapable of mathematical calculation, and (although the\n                            expression is apt to be misleading) commonly very much ‘at\n                            large’. They are at large in the sense that a jury has, in serious\n                            cases, a wide discretion in assessing them. Also general damages may be\n                            assessed not with reference to any limited period, but with reference to\n                            an indefinite future. Damages may be awarded for ‘pain and\n                            suffering’, and such damages are assessable for past, present and\n                            future pain and suffering. But here calculation is obviously impossible,\n                            and damages for pain and suffering should clearly be regarded as\n                            ‘general’ and not ‘special’ damages. In fact,\n                            the question of general damages is generally, I think, put to a jury\n                            under three heads – (1) ‘economic loss’, (2) loss of\n                            ‘amenities’ or ‘enjoyment of life’, and (3) pain\n                            and suffering. … 6.4    The [Australian] High Court has repeatedly\n                            preferred to describe the loss sustained by a person who is unable to\n                            earn in consequence of injuries as ‘loss of earning\n                            capacity’, rather than ‘loss of earnings’. The High\n                            Court has nevertheless insisted that loss of earning capacity does not\n                            attract an award of damages except in so far as it is or may be\n                            productive of economic loss.The question has arisen\n                                whether it is appropriate to apply the distinction between\n                                ‘special’ and ‘general’ damages as described\n                                by Fullagar J in 6.2 to loss of earning capacity that is productive\n                                of economic loss up to the date of the trial and loss of earning\n                                capacity that may be productive of future economic\n                            loss. InArthur Robinson (Grafton) Pty Ltd v\n                            Carter[(1968) 122 CLR 649 at 658 [(a case where the\n                        plaintiff was employed at the time of the accident)]] Barwick CJ thought it\n                        illogical that wages that would have been earned between receipt of the\n                        injury and the date of the trial are treated as special damages. He also\n                        thought that it would be better that they not be so treated because this\n                        would emphasise that loss of earning capacity rather than loss of earnings\n                        is what is to be compensated. The Full Court of Victoria [inFreudhofer v Poledano[1972] VR 287 (FC)] disagreed,\n                        finding justification for the practice in the fact that the date of the\n                        verdict, not the date of the injury, is the proper date for the assessment\n                        of damages and, at that date, the court must not speculate when it\n                        knows. Although it is true that we can never be certain that if the injury had\n                        not occurred, the plaintiff would have received the earnings on which the\n                        claim for lost earning capacity is based, we can be relatively more certain\n                        with regard to those to the date of trial. While we cannot be certain that\n                        there would not have been some other injury precluding the plaintiff from\n                        earning, we can at least be sure, if such be the case, that the employer is\n                        still in business, that workers in similar positions have not been laid off,\n                        that wage-rates are as claimed, that the plaintiff has been able to earn\n                        certain amounts despite the injury, and so on. All this is necessarily\n                        speculative with regard to the future, though the degree of speculation\n                        needed may vary from case to case. It is true that in some cases what the plaintiff would\n                            have earned to the date of the trial is as doubtful as what would have\n                            been earned after that date; or the defendant shows that despite the\n                            injury the plaintiff could have resumed the former employment. In such\n                            cases there may be little advantage in making a division between loss of\n                            earning capacity as part of special damages and loss of earning capacity\n                            as part of general damages; it should all be dealt with as part of\n                            general damages. But where they are capable of being estimated with a\n                            close approximation to accuracy, and so long as these damages are\n                            treated as earnings-related by the courts, damages for loss of earning\n                            capacity up to the date of verdict should be regarded as\n                            special. 6.5One danger from the practice of\n                                treating pre-trial loss of earning capacity as a matter for special\n                                damages is that a plaintiff who is unable to prove with precision\n                                the earnings lost up to the date of the trial may wrongly be denied\n                                any compensation for loss of earning capacity during that period,\n                                whereas the law is clear that the court must estimate the loss of\n                                earning capacity as best it can in the\n                            circumstances. Another danger, to the opposite effect, is that proof\n                            of precise figures could implant in the minds of a jury the idea that\n                            the earnings would definitely have been received and so make the jury\n                            forgetful of contingencies to which such earnings were\n                            subject. Since, however, many matters are no longer uncertain\n                        at the date of the trial, contingencies should not be taken into account in\n                        the same way with regard to past loss as to future loss. It is enough if the\n                        jury is reminded of some of the chances that might have prevented the\n                        plaintiff from earning the wages. In most cases where it is possible to\n                        treat pre-trial loss of income as part of special damages, the allowance for\n                        such contingencies need be small. The contrary danger is that failure to\n                        allocate pre-trial and post-trial loss of earning capacity to special and\n                        general damages respectively may lead to the pre-trial loss being\n                        overlooked. … [emphasis added] 52     The law is thus not so rigid – nor\n                    should it be – such that all claims tending to assume the character of\n                    seeking pre-trial loss of income must be shoehorned as claims for special\n                    damages (for which there must be strict proof). It cannot be taken for granted\n                    that all claims of such character are “capable of being estimated with a\n                    close approximation to accuracy”, although instances of such incapability\n                    are quite uncommon in practice. What this means is that when a claim is made by\n                    a plaintiff seeking compensation for pre-trial income that he asserts he could\n                    have earned but for his injuries suffered from the accident,and what the plaintiff would have actually earned is as doubtful as what\n                        would have been earned post-trial, it is to be preferred that\n                    pre-trial loss ofearning capacityattractinggeneraldamages and not pre-trial loss ofincomeattractingspecialdamages be used as the proper measure of damages for the\n                    purposes of assessment. This is, however, not to say that the former approach\n                    must invariably prevail where the plaintiff was not employed at the time of the\n                    accident; Fullagar J’s example of the professional man quoted above at\n                    [51] would attest to that. The court’s evaluation at the end of the day\n                    must depend on the factual matrices of each and every case. 53     In the present case, the proper measure of\n                    damages to be applied in respect of the Plaintiff’s claim for pre-trial\n                    earnings-related loss should be the Plaintiff’s pre-trial loss ofearning capacityattractinggeneraldamages. As compared to what she could earn post-trial,\n                    I find it equally if not more doubtful what the Plaintiff, having been a\n                    housewife for almost five years at the time of the accident, would actually have\n                    earned during the period leading up to the date of trial. The fact that the\n                    Plaintiff has obtained a dog grooming certificate sometime after the accident\n                    does not in any way alter my analysis because the Plaintiff has pitched her\n                    claim as one seeking income that she would otherwise have been able to earnby way of setting up a dog grooming business.\n                    In other words, the claim, properly characterised, is for loss of pre-trialbusinessearnings, not loss of pre-trial wages\n                    that she would have earned as an employee in the job market. There is no\n                    business without any commercial risks, and there is no guarantee of success in\n                    business. To assess and award the Plaintiff special damages under the rubric of\n                    pre-trial loss of income using the method that Mr Hanam has adopted (see\n                    [47]-[48] above) would be tantamount to making the Defendant insure the\n                    Plaintiff against all risks of business failure in the dog grooming business\n                    that she had intended to start, and that cannot be right. This is precisely what\n                    the learned author inAssessment of Damages for Personal\n                        Injury and Death: General Principleswould have cautioned against\n                    in the light of his warning against the danger that “proof of precise\n                    figures could implant in the minds of a jury the idea that the earnings would\n                    definitely have been received and so make the jury forgetful of contingencies to\n                    which such earnings were subject” (see [51] above). 54     Having determined that the proper measure of\n                    damages under the present category of claim should be general damages for\n                    pre-trial loss of earning capacity, the question is what amount, if at all,\n                    should be awarded to the Plaintiff. A claim for loss of earning capacity is a\n                    claim seeking compensation for the weakening of the “competitive\n                    edge” in the open employment market which a plaintiff has suffered as a\n                    result of his or her injury arising from the accident. The evidence of Ms Ho and\n                    the data from ‘Service Canada’ which at best only tend towards\n                    provingpre-trial loss of income, do not assist\n                    the Plaintiff in this regard. The Plaintiff’s proposed sum of $49,092 (see\n                    [46] above) is therefore rejected. 55     Again having regard to Prakash J’s\n                    holding inClark Jonathan Michaelat [91] (see\n                    [44] above), I will award the Plaintiff a sum of $10,000 for her pre-trial loss\n                    of earning capacity which is to be added to the general damages that I have\n                    assessed earlier in [45] above. Pre-trial medical expenses 56     The Plaintiff has put in a claim for pre-trial\n                    medical expenses for the treatment of her whiplash and psychiatric injuries.\n                    Copies of the billing receipts were tendered in court as proof and, with the\n                    help of a table prepared by Mr Hanam,[note: 51]it became apparent that\n                    many of the receipts billed to the Plaintiff contained lump sum charges forbothneck and back medical treatment without\n                    any specific apportionment of charges between the two types of treatment. Given\n                    that the Plaintiff has abandoned her claim for the alleged back injury (see [3]\n                    above), it follows that such amounts which were incurred by the Plaintiff for\n                    the treatment of her alleged back injury should be excluded. In that respect, Mr\n                    Pillai has suggested that it would be fair that a 50 percent reduction be\n                    applied to those unapportioned bills. I agree.[note: 52] 57     Mr Pillai further argued that the bills\n                    charged for epidural injections administered on the Plaintiff should be totally\n                    excluded as those treatments were unnecessary. I disagree as I consider them to\n                    be reasonable avenues of treatment that the Plaintiff was entitled to explore in\n                    the circumstances at the time, although I would apply a 25 percent discount to\n                    the bills associated with those epidural injections[note: 53]as the evidence showed that for each\n                    of those sessions, three injections were administered to the Plaintiff’s\n                    neck while one injection was administered to the Plaintiff’s\n                        back.[note: 54] 58     Based on the foregoing reasoning, I arrived at\n                    the sum of around $59,613 in my calculation. 59     Mr Pillai has also raised an issue of double\n                    recovery in the sense that some of the medical expenses which the Plaintiff has\n                    incurred might be or have been covered by her own insurance policy.[note: 55]I do not think I need to delve into this\n                    issue in great detail other than to refer to a passage in Harvey McGregor,McGregor on Damages(Sweet & Maxwell,\n                        18thEd, 2012), pp 1384-1385, which\n                    states: As early as 1874 it was decided inBradburn v G.W.\n                            Ry[(1874) L.R. 10 Ex. 1] that, where the claimant had taken\n                        out accident insurance, the moneys received by him under the insurance\n                        policy were not to be taken into account in assessing the damages for the\n                        injury in respect of which he had been paid the insurance moneys. This\n                        decision has withstood time and is solidly endorsed at House of Lords level\n                        byParry v Cleaver[[1970] A.C. 1], not only\n                        by the majority who relied upon it by analogy but also by the minority who\n                        sought to distinguish it, and more recently by Lord Bridge speaking for the\n                        whole House inHussain v New Taplow Paper\n                            Mills[[1988] A.C. 514 at 527G] and inHodgson v Trapp[[1989] A.C. 807 at 819H], and by Lord\n                        Templeman similarly inSmoker v London Fire\n                            Authority[[1991] 2 A.C. 502 at 539B-F]. The matter is\n                        clearly now incontrovertible. The argument in favour of non-deduction is\n                        that, even if in the result the claimant may be compensated beyond his loss,\n                        he has paid for the accident insurance with his own moneys, and the fruits\n                        of this thrift and foresight should in fairness enure to his and not to the\n                        defendant’s advantage. 60     This position has been adopted by our Court of\n                    Appeal inThe “MARA”[2000] 3 SLR(R)\n                    31 at [28] (see alsoSeagate Technology Pte Ltd and another v\n                        Goh Han Kim[1994] 3 SLR(R) 836 at [47] and [51]). I therefore\n                    dismiss Mr Pillai’s argument on double recovery. 61     Accordingly, I will allow an award of $59,613\n                    to the Plaintiff as special damages for medical expenses she has incurred prior\n                    to the commencement of the proceedings. Maid/domestic helper expenses 62     The Plaintiff is also seeking $9,646 for maid\n                    expenses for the period between April 2010 and September 2011. In her affidavit\n                    of evidence-in-chief, the Plaintiff stated as follows:[note: 56] Due to the pain that I was experiencing to my back and neck, I could not\n                        do the housework and had to employ a maid to do the housework. The monthly\n                        salary for the maid was $340 for April 2010 with the worker’s levy of\n                        $170 per month except for April 2010 which was $150. Between April 2010 to\n                        September 2011 I incurred $9,646: a)    Agency Fees\n                            -     $\n                            376 b)    Salary\n                            -     $\n                            6,210 c)    Levy\n                                -$\n                                3,060 $ 9,646 63     However, the documents produced by the\n                    Plaintiff do not tally with the sum of $9,646 claimed by the\n                        Plaintiff.[note: 57]In\n                    fact, the documents only went so far as to show that the Plaintiff had employed\n                    a maid for the period of April 2010 to November 2010. Documentary evidence for\n                    the alleged period of December 2010 to September 2011 was completely absent. No\n                    attempts were made to reconcile the figures presented in the Plaintiff’s\n                    affidavit of evidence-in-chief (see [62] above) with the documents produced by\n                    the Plaintiff. 64     In any case, I find that there is no merit in\n                    the Plaintiff’s claim for maid expenses. Claims for maid/domestic helper\n                    expenses are not uncommon where domestic helpers are employed for the care and\n                    well-being of tortious victims who have suffered serious and often permanent\n                    disabilities, and even so the court has on occasion applied a discount to such\n                    claims to take into account such other concurrent services which the domestic\n                    helpers would provide to assist in the victim’s household chores (see,eg,Toon Chee Meng Eddie v\n                        Yeap Chin Hon[1993] 1 SLR(R) 407 at [38]). In the present case,\n                    the maid expenses were incurred not to provide any direct care to the Plaintiff\n                    for her own well-being, but to assist in the household chores for her entire\n                    family in lieu of her.[note: 58]Cases such as the present one fall\n                    within a penumbral class where the court is entitled to exercise its own\n                    judgment, based on the particular facts of each case, as to whether the expenses\n                    incurred in the hiring of the domestic helper is truly and fairly a necessity\n                    arising from the accident/tort which ought in law be compensated by way of\n                    damages (see,eg,Tan Juay Mui\n                        (by his next friend Chew Chwee Kim) v Sher Kuan Hock and another (Liberty\n                        Insurance Pte Ltd, co-defendant; Liberty Insurance Pte Ltd and another,\n                        third parties)[2012] 3 SLR 496 at [55]-[58]). Here, I am unable\n                    to find that such necessity truly and fairly existed in the circumstances. Given\n                    that (a) the Plaintiff has a history of once hiring a maid prior to the\n                        accident,[note: 59](b) the\n                    Plaintiff did not engage a maid until around seven months after the accident\n                    happened, and (c) the Plaintiff agreed in cross-examination that the hiring of\n                    the maid was for the benefit of her entire family,[note: 60]I find on balance that the\n                    employment of the domestic helper from April 2010 to September 2011 was borne\n                    more likely out of convenience and/or factors that are not inextricably linked\n                    to the accident instead. I therefore reject this category of claim in its\n                    totality. 65     Before leaving this category of claim, I will\n                    add in passing that nowhere in the Plaintiff’s statement of claim or her\n                    written submissions has she framed any claim for pre-trial loss ofhousekeeping capacitywhich, if the English authority ofDaly v General Steam Navigation Co Ltd[1981]\n                    1 WLR 120 were to be applied, would probably constitute a claim undergeneraldamages for pain and suffering and loss of\n                    amenities. There is therefore no reason for me to assess any damages as\n                    such. Transport expenses 66     In submissions, the Plaintiff has also put in\n                    a claim of $3,500 for transportation expenses.[note: 61]However, this claim was totally devoid of any\n                    elaboration in the submissions. Neither was there any evidence presented in\n                    court to support this particular claim. The claim is therefore dismissed for\n                    failure of proof.",
        "Conclusion": "67     In conclusion, the following award is made in\n                    favour of the Plaintiff in the present case: General\n                    damages Pain and suffering:Whiplash\n                                                injury$16,000PTSD and\n                                                depression$20,000$36,000Loss of future earnings (pre-trial and\n                                            future):$22,000Future medical\n                                    expenses:$13,645   Special\n                    damages Pre-trial medical\n                                    expenses:$59,613   Total General + special\n                                    damages:$131,258   68     Interest is to be applied at half of 5.33% on\n                    special damages from the date of service of the writ to the date of judgment,\n                    and at 5.33% on general damages for pain and suffering from the date of service\n                    of the writ to the date of judgment. The usual consequential orders are to\n                    apply. 69     I will hear parties on the issue of\n                    costs.  [note: 1]PA206. [note: 2]PA206. [note: 3]PB202. [note: 4]PB33. [note: 5]Notes of Evidence (2 October 2012), pp\n                                47-48. [note: 6]PA121. [note: 7]Notes of\n                                Evidence (2 October 2012), p 47. [note: 8]Notes of Evidence (16 January 2013), p\n                                6. [note: 9]Notes of\n                                Evidence (16 January 2013), p 5. [note: 10]Ibid. [note: 11]Notes of Evidence (16 January 2013), p\n                        3. [note: 12]Notes of Evidence (16 January 2013), pp\n                        11-12. [note: 13]DA20-21. [note: 14]Notes of\n                                Evidence (2 October 2012), p 51. [note: 15]For eg,\n                        PA30-31. [note: 16]Notes of\n                                Evidence (1 October 2012), pp 4-5. [note: 17]Ibid. [note: 18]Notes of Evidence (1 October 2012), p\n                        6. [note: 19]DB49; Notes of Evidence (1 October 2012), p\n                        4. [note: 20]Notes of Evidence (3 October 2012), p\n                                16. [note: 21]PA220. [note: 22]D6 and\n                                D7. [note: 23]Notes of Evidence (3 October 2012), pp\n                                21-22. [note: 24]Notes of Evidence (3 October 2012), p\n                                30. [note: 25]DA20-21. [note: 26]DB23. [note: 27]DA23. [note: 28]Notes of Evidence (3 October 2012), p\n                                29. [note: 29]Notes of Evidence (3 October 2012), p\n                            30. [note: 30]Notes of\n                                Evidence (3 October 2012), p 29. [note: 31]Plaintiff’s Reply Submissions,\n                                paras 18-21. [note: 32]Defendant’s Written Submissions, para\n                            121. [note: 33]PA220. [note: 34]DA23. [note: 35]Plaintiff’s Reply Submissions,\n                                para 20. [note: 36]Plaintiff’s Reply Submissions, para\n                            21. [note: 37]P8; PA129-131, 134. [note: 38]PA116. [note: 39]PA116-117. [note: 40]Plaintiff’s Reply Submissions, paras 22-25,\n                        30. [note: 41]PB137. [note: 42]PA140. [note: 43]Notes of Evidence (2 October 2012), p\n                                31; D1. [note: 44]Defendant’s Written Submissions, paras\n                        145-146. [note: 45]Notes of Evidence (4 October 2012), p\n                                22. [note: 46]Adapted fromHippocrateswhose\n                                quote originally read: “Time is that wherein there is\n                                opportunity, and opportunity is that wherein there is no great\n                                time”. [note: 47]Notes of Evidence (2 October 2012), p\n                        22. [note: 48]PB81. [note: 49]Notes of\n                                Evidence (2 October 2012), p 27. [note: 50]Defendant’s Written Submissions, pp\n                        41-43. [note: 51]P4-8 (but\n                                note that the Plaintiff has withdrawn the claim under Items 14 and\n                                31 in the table). [note: 52]This 50%\n                                reduction is accordingly applied to Items 24-25, 27, 29-30, 32,\n                                35-39, 41, 44-45, 48, 51, 53, 55-57, 59-63, and 65-70 of the table\n                                at P4-8. For Item 43, the receipt at PB83 shows that $882 was billed\n                                for MRI of the Plaintiff’s back. This sum was disregarded in\n                                my calculation, and the 50% reduction was applied to the remainder\n                                before applying GST. For Item 50, however, the receipt at PB91 shows\n                                that $882 was billed for MRI of the Plaintiff’s neck. This sum\n                                was therefore allowed, and the 50% reduction was only applied to the\n                                remainder before applying GST. For Items 54 and 72, copies of the\n                                receipt cannot be found in the bundles tendered in court. These\n                                claims are therefore rejected. (Note: Items 40, 42, 45, 49, 52, 58,\n                                64 and 71 have been clarified by Mr Hanam to be bills for\n                                psychiatric treatment and not for neck or back treatment. These\n                                claims were allowed on that\n                basis). [note: 53]These are Items 26, 28, 33, 34, 46 and 47 in the table at\n                                P4-8. [note: 54]Notes of Evidence (3 October 2012), pp\n                            13-14. [note: 55]Defendant’s Written Submissions, pp\n                            50-55. [note: 56]PA53. [note: 57]P9-13. [note: 58]Notes of Evidence (2 October 2012), p\n                                33. [note: 59]Ibid. [note: 60]Ibid. [note: 61]Plaintiff’s Closing Submissions, p\n                        42."
    }
}