{
    "case_title": "Goh Liang Yong Jonah and another\n      v\n      Heng Kuek Hoy and another",
    "ncitation": "[2013] SGHC 203",
    "coram": "Belinda Ang Saw Ean J",
    "sections": {
        "Background": "2       The plaintiffs are husband and wife, and are the owners of the Property. Sometime in early November 2011, D1’s nephew, Heng Kwok Siong (“Heng”), viewed the Property that was put up for sale. At all material times, Heng was acting on D1’s behalf and he dealt with the plaintiffs and gave instructions to D1’s solicitors in respect of the sale and purchase of the Property. 3       Arising from the negotiations, the plaintiffs granted D1 an Option to Purchase the Property at the price of $1,850,000 (“Option”) in exchange for D1’s payment of the option fee of $18,500 on 16 November 2011. The Singapore Law Society’s Conditions of Sale 1999 (“the Conditions”) were incorporated as terms of the Option. D1 exercised the Option on 29 November 2011 with a payment of $74,000.[note: 1]The total payment of $92,500 (representing 5% of the purchase price) was the deposit for the Property (“the Deposit”). According to the Option, the completion of the sale and purchase of the Property was set to take place on 17 January 2012 (“the January Completion Date”), seven weeks after the exercise of the Option. 4       Subsequently, on 12 January 2012, the parties mutually agreed to defer completion from the January Completion Date to 23 March 2012 (“the March Completion Date”).[note: 2]At that stage, Heng requested permission to move into the Property as he and his family, which included D1, required a place to reside. The plaintiffs agreed, and on 18 January 2012, D1 signed a document entitled “Letter of Indemnity and Undertaking” (“the Letter of Indemnity”)[note: 3]that set out the conditions for occupying the Property. 5       On 19 March 2012, D1’s solicitors wrote to the plaintiffs’ solicitors to postpone completion from the March Completion Date to 30 May 2012. Apparently, D1 required more time to obtain financing to purchase the Property. After some negotiations, the parties agreed to reschedule completion to 25 June 2012 (“the June Completion Date”) on condition that an amount of $120,000 be paid to the plaintiffs. The sum of $120,000 comprised of: (a)     $18,000, as discounted rental of the Property for the period of 24 March to 25 June 2012 (“the three-month rent”) at $6,000 per month; and (b)     $102,000, as further deposit towards the purchase price of the Property. Furthermore, D1 agreed to the immediate release of 4% of the purchase price (ie, $74,000) held by the stakeholder to the plaintiffs.[note: 4] 6       Unfortunately, the cheque for $120,000 issued by Heng on behalf of D1 was dishonoured. Heng issued another cheque for $100,000, thereby leaving $20,000 outstanding. The plaintiffs understood that $82,000 was an additional deposit, while $18,000 was the three-month rent.[note: 5]I should mention that the plaintiffs are not suing for this shortfall of $20,000. 7       On the day of the June Completion Date, D1’s solicitors wrote to the plaintiffs’ solicitors asking for a further rescheduling of completion to 29 June 2012 (“the extended June Completion Date”). The plaintiffs’ solicitors replied on the same day agreeing to the extension, subject to D1 paying charges that included the plaintiffs’ bank’s processing charges, accrued interest and prepayment fee (collectively, “the charges”).[note: 6] 8       On the day of the extended June Completion Date, D1 again requested the completion date to be postponed, this time to 6 July 2012. After a few rounds of letters and negotiations, both parties agreed to complete on 6 July 2012 (“the July Completion Date”) and that D1 would pay a further deposit of $110,000. These conditions were subject to the plaintiffs now bearing all the charges, and D1 paying late completion interest and rental at $7,500 per month from 26 June 2012 up to and including the July Completion Date.[note: 7]D1 paid the agreed sum of $110,000 on 3 July 2012. Apart from the three-month rent, D1 had thus paid the plaintiffs $284,500 which was made up of the Deposit and the two additional deposits (“the Additional Deposits”). 9       On 4 July 2012, D1 again requested that completion be postponed to 10 July 2012. The next day, the plaintiffs rejected the request, stating:[note: 8] If completion does not take place on 6 July 2012, our clients will serve twenty-one (21) [days’] notice to complete. 10     On 9 July 2012, the plaintiffs’ solicitors, Vision Law LLC (“Vision Law”) gave D1 notice to complete the sale of the Property within 21 days of the date of service of the notice.[note: 9]During this 21-day period, D1 kept asking to reschedule the completion date and made repeated requests to the plaintiffs to waive late completion interest. The requests were rejected by the plaintiffs,[note: 10]and on 30 July 2012, the 21-day period for completion expired. 11     On 3 August 2012, Vision Law wrote to D1’s solicitors, Prestige Legal LLP (“Prestige Legal”), rescinding the Option and forfeiting all monies and deposits previously paid. They demanded that D1 immediately vacate the Property and hand over possession of the Property.[note: 11]D1 was also instructed to return all title deeds to the plaintiffs and withdraw any registered caveats lodged against the Property.[note: 12]Through their solicitors, the plaintiffs repeated their demands in another letter sent on 13 August 2012,[note: 13]but there was no indication of D1 acceding to the demands. 12     Subsequently, there was a series of correspondences between the solicitors where the completion of the sale and purchase was purportedly deferred to 24 September 2012.[note: 14]The plaintiffs asked for $22,500 as rental of the Property for the period of 26 June to 23 September 2012, and $19,635.52 as 50% of the late completion interest, which D1 replied to with a request to waive the sums.[note: 15]Upon receiving this letter, the plaintiffs rejected the requests, and reiterated the demands made in the 3 August and 13 August 2012 letters.[note: 16] 13     On 24 October 2012, Prestige Legal, on behalf of D1, wrote to Vision Law asking for the return of $149,864.48. The sum was the Additional Deposits less the rental of the Property for the period of 26 June to 23 September 2012 and 50% of the late completion interest.[note: 17]The plaintiffs did not respond to the letter. On 9 November 2012, the plaintiffs were informed that D1 was no longer in occupation of the Property and was prepared to return the keys to the Property to the plaintiffs. However, it was not true that D1 had vacated the Property and P1 had photographic evidence to prove otherwise. A subsequent letter from D1 demanded the return of $149,864.48 for the vacation of the Property.[note: 18]The plaintiffs did not respond to this letter either. Between 21 and 27 December 2012, the plaintiffs repeated their demands made on 3 August 2012.[note: 19]In response, D1 continued to request a postponement of completion to 8 January 2013.[note: 20]This request was rejected by the plaintiffs who then filed OS 58/2013. 14     Ultimately, this was a case where a normal sale and purchase of a piece of property, which should have been completed in seven weeks, turned awry resulting in several changes to the date of completion over a period of eight months. To exacerbate the matter, the completion never came about and the plaintiffs were unable to recover possession of the Property as D1 had refused to move out. Even after OS 58/2013 was filed on 21 January 2013, and as late as 6 May 2013, D1, Heng and his other family members were still in occupation of the Property. Before the adjourned hearing of OS 58/2013 on 31 July 2013, D1 handed over the keys to the Property on 17 June 2013.",
        "The plaintiffs’ applications in OS 58/2013": "15     In OS 58/2013, the plaintiffs sought orders for,inter alia: (a)     vacant possession of the Property (“Issue 1”); (b)     late completion interest (“Issue 2”); (c)     rent, at $7,500 a month, from 26 June 2012 to the date of vacant possession (“Issue 3”); and (d)     forfeiture of $284,500 paid to the plaintiffs as deposit (“Issue 4”). 16     At the second hearing before me on 6 May 2013, counsel for D1, Mr Kanthosamy Rajendran (“Mr Rajendran”), stated that he would not be making submissions on the application for a declaration rescinding the Option and for the withdrawal of the caveats. He accepted that the plaintiffs’ were not legally obliged to sell the Property to D1 after the latter failed to complete within the 21 days’ notice given by the plaintiffs. As such, I declared that:[note: 21] (a)     the Option for the sale and purchase of the Property was rescinded on 3 August 2012 owing to the failure of D1 to complete the purchase within 21 days of the last date fixed for completion of the said sale and purchase,ie, 6 July 2012. I also ordered that: (a)     D1 withdraws Caveat No IC/681130K within three days from 16 May 2013; (b)     the second defendant withdraws Caveat No IC/817125H within 14 days from 16 May 2013; (c)     if the defendants failed, refused or neglected to withdraw the said caveats as ordered, the Registrar of the Supreme Court be empowered to sign the withdrawal of caveat on behalf of D1 and/or the second defendant. 17     It is convenient to also mention here that I made no order relating to Issue 2.[note: 22]This claim for late interest was given up by the plaintiffs after Mr Rajendran pointed out that the interest was not recoverable since it did not fall within the scope of condition 8.1 of the Conditions. 18     The adjourned hearing on 31 July 2013 proceeded on the other remaining issues which I now turn to.",
        "The contested issues": "",
        "Issue 1": "19     Counsel for the plaintiffs, Mr A Thamilselvan (“Mr Thamilselvan”), had in OS No 58 of 2013, sought vacant possession of the Property within seven days of any order made, and for leave to issue a writ of possession against D1 in the event D1 did not give up vacant possession of Property as ordered.  As stated, the keys to the Property were returned only on 17 June 2013. 20     Nonetheless, D1 argued that the court should exercise its equitable jurisdiction to make an order for the plaintiffs to perform the contract. Mr Rajendran relied onPacific Rim Investments Pte Ltd v Lam Seng Tiong and another[1995] 2 SLR(R) 643 (“Pacific Rim”) in support of D1’s argument. In that case, the Court of Appeal had observed at [60] that an equitable jurisdiction existed to grant relief against forfeiture in the face of a breach of a provision of which time is of the essence. However, the court noted that such a jurisdiction would only be exercised in exceptional circumstances where the case revealed elements of unconscionability and injustice. In that case, the respondents had entered into a sale and purchase agreement with the appellant for a piece of property. The completion did not take place as the appellants terminated the agreement on the ground that the respondents had failed to pay the interest owed due to a late payment of an instalment. On the facts, the court found that the appellants were not entitled to treat the agreement as having been repudiated by the respondents’ failure to pay the interest as the non-payment of interest was not a basis for the repudiation. The court also noted at [61] that even if the appellant was entitled to treat the agreement as having been repudiated, it would have been unconscionable if relief against forfeiture of the agreement was not granted. This was because the court found that the appellants would sell the property at a huge windfall, and the breach by the respondents was a failure to pay a sum of less than $1,000 and was trivial in the face of the financial loss and sums already paid by the respondents prior to the termination. 21     Mr Rajendran’s reliance onPacific Rimfor an order that the plaintiffs perform the Option was a non-starter. Mr Rajendran had earlier conceded that the Option was rescinded, and as such he did not object to an order to this effect on 6 May 2013 (see [16] above). It is therefore inexplicable how the equitable relief against forfeiture of an agreement can be invoked to apply to a situation where there was no longer a live contract to speak of. Besides, it should be remembered that the plaintiffs’ demands for vacant possession of the Property were made pursuant to the terms of the Letter of Indemnity.[note: 23]In the premises, Issue 1 was decided in the plaintiffs’ favour.",
        "Issue 3": "22     The plaintiffs’ claim for unpaid rental of the Property was made pursuant to cl 5.1 of the Letter of Indemnity that D1 had signed on 18 January 2012 when she was permitted to enter into possession of the Property. The relevant parts of the Letter of Indemnity are set out below: 5.    If for whatsoever reason the sale and purchase of the Property is not completed on the Completion Date (as defined in the duly exercised Option to Purchase between the Vendor and me/us), I/we FURTHER JOINTLY AND SEVERALLY UNDERTAKE to forthwith unconditionally: 5.1    Deliver vacant possession and all keys to the Property to the [plaintiffs], failing which I/we agree to pay the [plaintiffs] a monthly rental of $7,500.00 per month in addition to late completion interest and/or damages pursuant to the duly exercised Option to Purchase the Property; … 23     The plaintiffs stated that they were not claiming rent for the period of 17 January to 23 March 2012 as the parties had mutually agreed to extend the completion date from the January Completion Date to 23 March 2012. Subsequently, the plaintiffs requested D1 to pay rent from 24 March 2012 onwards. The plaintiffs thus obtained $18,000 as the three-month rent. From 26 June 2012 onwards, D1 did not pay rent for the Property. The current claim was for the period of 26 June 2012 to 17 June 2013, which amounted to $88,000. Presumably rent was computed up to and inclusive of 17 June 2013 since the keys to the Property were only returned on that date. 24     Mr Rajendran argued that it was wrong to claim both rent as well as a forfeiture of the deposit and that the plaintiffs had to elect one or the other. According to Mr Rajendran, the claim for rent was in reality a claim for damages under common law. Furthermore, the claim for forfeiture of the deposit was under condition 29.8 of the Conditions (“condition 29.8”) (the subject of Issue 4 below as well), and condition 29.8 could not be read to allow for a claim for damages under both common law and the Conditions. 25     The relevant portions of condition 29.8 read as follows: 29.8  If the Purchaser does not comply with the terms of an effective notice served by the Vendor under this Condition, then the following terms apply: … (c)    without prejudice to any other rights or remedies available to him at law or in equity, the Vendor may – i)    forfeit and keep any deposit paid by the Purchaser; and ii)    resell the property whether by auction or by private agreement without previously tendering a Conveyance to the Purchaser. 26     Mr Rajendran relied onHarris Hakim v Allgreen Properties Ltd[2001] 3 SLR(R) 148 (“Harris Hakim”) for the interpretation of the words “without prejudice to any other rights or remedies available to [the Vendor] at law or in equity” in condition 29.8(c) to mean that options are available to the vendor at law or in equity. The Court of Appeal stated at [26] that the vendor would have to elect in the following manner: (a)    treating the contract as still subsisting and pursuing a claim for specific performance and damages in addition or in lieu thereof, or (b) treating the contract as having been repudiated and (a) claiming unliquidated damages at large for loss of bargain and breach of contract, or (b) claiming the amounts under paras (b) and (c) of [condition 29.8]. 27     While I accepted that the plaintiffs would not be allowed to claim damages under both the common law and the Conditions, I disagreed with Mr Rajendran that the claim for rent here was a claim for damages for the repudiation of the Option. I agreed with Mr Thamilselvan that the claim for rent was made under a separate contractual arrangement, namely the Letter of Indemnity, which was unaffected by the repudiation of the Option as the Letter of Indemnity operated as a separate agreement for payment of rent. My view is reinforced by the fact that cl 6 of the Letter of Indemnity specifically stated that: I/We CONFIRM that I/we am/are occupying the Property during the said period as a TENANT AT WILL. 28     What D1 was in effect arguing was that she could stay at the Property rent-free whether or not the sale and purchase of the Property was completed: if she had completed the purchase, she would only have to pay late completion interest; and if she did not complete the purchase, she would not have to pay anything for her period of stay. This could not be correct. The January Completion Date had been rescheduled, by a mutual agreement, to 23 March 2012 while D1 was in possession of the Property on 18 January 2012. As such, from 18 January to 23 March 2012, if the sale and purchase was completed, the matter would have ended there. However, if it was not completed on 23 March 2012, then from 24 March 2012 onwards, D1 would in effect be renting the Property until the time of actual completion. 29     It was clear from the Letter of Indemnity that the plaintiffs would be entitled to rental independent of whether or not the sale and purchase of the Property was completed. I also noted that D1 had legal representation throughout the entire process and would have been advised on what she was signing,ie, the legal effect of the Letter of Indemnity on her status as a tenant rather than as a purchaser. By the Letter of Indemnity, parties had wanted to treat rent under the Letter of Indemnity and payments made towards the purchase price as separate matters. It is patently clear that the circumstances ofHarris Hakimwere different from the current facts. As stated, there were two distinct agreements between the plaintiffs and D1, one being the exercised Option which was a sale and purchase agreement, and the other being the Letter of Indemnity which was a rent agreement. 30     In the premises, the plaintiffs’ claim for the unpaid rent from 26 June 2012 to 17 June 2013 was valid, and I accordingly ordered D1 to pay the plaintiffs rental in the sum of $88,000 pursuant to cl 5.1 of the Letter of Indemnity.[note: 24]",
        "Issue 4": "31     I now come to the plaintiffs’ claim to retain the total sum of $284,500 being the Deposit and the Additional Deposits pursuant to condition 29.8. The plaintiffs argued that the Additional Deposits were further deposits D1 had agreed to pay for postponing the completion of the sale and purchase of the Property. The Deposit and Additional Deposits fell within the meaning of condition 29.8(c)(i), and the plaintiffs were thus entitled to forfeit and keep any deposit paid by D1. In response, D1 argued against the characterisation of the Additional Deposits as deposits and for relief from forfeiture if they were found to be so. D1 argued that the plaintiffs were only entitled to forfeit the Deposit of $92,500, but not the Additional Deposits as the Deposit was defined in the Option as being 5% of the purchase price, and that there was no agreement to forfeit the Additional Deposits. Instead, the Additional Deposits were payments in advance which could not be forfeited. Furthermore, D1 argued that if the Additional Deposits were deposits as characterised under  common law, it would be unconscionable to forfeit the Additional Deposits. 32     The first query was whether the Additional Deposits were deposits or advance payments, as the latter would not fall within the category of forfeitable deposits being neither designed nor intended to secure performance (seeLim Lay Bee and another v Allgreen Properties Ltd[1998] 3 SLR(R) 1028). 33     The Option and the Letter of Indemnity themselves did not define a “deposit” or provide for the additional payment of deposits except for condition 29.8(c)(i) which stated that the purchaser was entitled to forfeit “any deposit” in a case of non-compliance with the notice to complete (see above at [25]). Be that as it may, the wording of condition 29.8(c)(i) could be construed to envisage, by implication, the payment of further deposits and their forfeiture. In the circumstances, the plaintiffs relied upon other contemporaneous documents that would shed light on how the Additional Deposits came to be paid by D1, and what they were. In doing so, the nature and purpose of the Additional Deposits had to be gathered from the intention of the parties expressed in the agreement, and this was to be objectively ascertained (seeLee Chee Wei v Tan Hor Peow Victor and others and another appeal[2007] 3 SLR(R) 537 (“Lee Chee Wei”) at [85]). 34     The nature of a deposit was considered over a century ago inHowe v Smith(1884) 27 Ch. D 89. Bowen LJ said at 98: … Without going at length into history, or accepting all that has been said or will be said by the other members of the Court on that point, it comes shortly to this, that a deposit, if nothing more is said about it, is, according to the ordinary interpretation of business men, a security for the completion of the purchase? But in what sense is it a security for the completion of the purchase?It is quite certain that the purchaser cannot insist or abandoning his contract and yet recover the deposit, because that would be to enable him to take advantage of his own wrong. … [emphasis added] Fry LJ in the same case put the matter in the following manner at 101–102: … It is not merely a part payment, but is then also an earnest to bind the bargain so entered into, and creates by the fear of its forfeiture a motive in the payer to perform the rest of the contract. … Furthermore the earnest did not lose that character because the same thing might also avail as part payment. … … [T]he expression used in the present contract that the money is paid “as a deposit and in part payment of the purchase-money,” relates to the two alternatives, and declares that in the event of the purchaser making default the money is to be forfeited and that in the event of the purchase being completed the sum is to be taken in part payment. The above principles were referred to and applied inLee Chee Weiat [84]. See also Edwin Peel,The Law of Contract(Sweet & Maxwell, 13th Ed, 2011) (“The Law of Contract”) at paras 20-148 and 20-150; Michael Furmston (Gen Ed),Butterworths Common Law Series – The Law of Contract(LexisNexis, 4th Ed, 2010) at para 8.135. 35     G P Selvam J inTriangle Auto Pte Ltd v Zheng Zi Construction Pte Ltd[2000] 3 SLR(R) 594 (“Triangle Auto”) accepted at [9] that in order to take effect as a deposit, the sum in question had to be a reasonable sum to be considered as earnest money (see also at [12]): …A deposit in a sale and purchase contract, if nothing more is said about it, is a security for damages for breach of contract. If the seller has not suffered any damage he must return it to the depositor. If, however, the contract provides that the deposit is to be forfeited to the seller upon breach by the purchaser,and provided the amount of deposit is customary or moderate, the seller is entitled to retain it even if he suffered no loss. The deposit is considered asearnest money. … [emphasis added] 36     The contemporaneous evidence showed that the plaintiffs had consistently maintained in their letters to D1’s solicitors, Prestige Legal, that the Additional Deposits were “further deposits”[note: 25]and were meant to secure D1’s express interest in completing the purchase of the Property. The plaintiffs requested the first Additional Deposit after D1 wanted a postponement of the March Completion Date for another one and a half months. There were multiple requests for postponements subsequently, which the plaintiffs acceded to, but on condition that a second Additional Deposit be given, and D1 paid it on 3 July 2012. By 30 July 2012, D1 had failed to complete the sale and purchase despite being given 21 days’ notice to do so. It can be seen that not only did D1 delay the completion by some four months, D1 had also stayed at the Property for close to seven months by the time the 21-day notice had expired. All this time, D1 reiterated her desire to acquire the Property. Therefore, the only way to assure the plaintiffs that she would complete the sale and purchase was to make payments towards the purchase price by way of the Additional Deposits. 37     Significantly, it was not disputed that D1, through her solicitors, had accepted that the Additional Deposits were indeed further deposits. The payments were negotiated by her solicitors and at all material times she had legal advice on the matters. On the facts of the present case, it was open to the parties to agree terms which included the payment of further deposits in respect of the postponements sought from time to time, and there was no reason why the parties should not be held to their bargain when the sale and purchase and subsequent negotiations were clearly and formally laid out in the Letter of Indemnity and the legal correspondences. 38     Prestige Legal, as the correspondences showed, had no misgivings that the payments were in the nature of further deposits. On 4 July 2012, Prestige Legal wrote to the plaintiffs’ solicitors, Vision Law, to set out D1’s deposit payments to date:[note: 26] We note that our client has paid your clients’ the following to-date: (a)    5% deposit amounting to $92,500; (b)    further deposit of $100,000.00 paid on 23 March 2012; and (c)    further deposit of $110,000.00 paid on 3 July 2012. I noted that the three sums listed in the communications were all stated as “deposits”. Prestige Legal made no distinction between deposit (a) and the other deposits (b) and (c) even though Prestige Legal (and hence D1) were clearly aware that deposit (a), which was the 5% deposit under the Option, could be forfeited in the event of a failure to complete. I also noted that there was no qualification to the deposits (b) and (c) to negate the application of the common law position (seeThe Law of Contractat para 20-148). As such, the deposits (b) and (c) were irrecoverable. For completeness, I should mention that according to the plaintiffs, there was an error in item (b). The amount of the deposit should have been recorded as $82,000 instead of $100,000. 39     I stress that there was no financial incentive for the plaintiffs to be locked into an agreement which had become protracted by delays in completion, and above all rendered uncertain by constant extensions. As prescribed by the Conditions (see condition 29.3), the plaintiffs could have served a notice to complete on 24 March 2012, rescinded the agreement much earlier and put the Property up for sale while still retaining the Deposit. The only reason why they did not do so was because D1 had agreed to put up further deposits for the extensions of time granted. The Additional Deposits were earnest monies that expressed D1’s interest and were what the plaintiffs were relying on as D1’s assurance to complete. It could not be that the plaintiffs only wanted to hold the monies that would have to be returned back to D1 later, without any cost to D1, even though she was the cause of the delay and failure to complete the sale and purchase. Therefore, the contemporaneous documents and the actions of the parties revealed that the parties had always treated the Additional Deposits as deposits. 40     I now come to a related query. I had to determine on the facts whether the Additional Deposits were reasonable. If the Additional Deposits were not reasonable deposits, a subsidiary question raised by D1 would have to be considered and answered: whether the unreasonable deposits should be subject to the court’s equitable power to relieve against forfeiture (seeTriangle Autoat [12]). 41     The Additional Deposits totalled $192,000 which was about 10.3% of the purchase price. The Additional Deposits were paid on top of the initial 5% deposit. However, the circumstances in which the Additional Deposits were paid were unique to the facts of this case. The Additional Deposits were made to buy D1 an extra four months of time, up to the end of July, and were thus a moderate and reasonable earnest amount to pay for such an extension. I should add that even after the Additional Deposits were paid, D1 still could not complete and as late as September 2012, she was still asking for time to complete in January 2013. Eventually, the plaintiffs filed OS 58/2013 against D1 due to D1’s intransigence in the whole matter. 42     In my view, the size of the Additional Deposits (not just in terms of amount but also the fact that it comprised 10.3% of the purchase price) was reasonable in the circumstances to provide an assurance to the plaintiffs that D1 would complete. 43     It was disclosed that Heng had difficulties securing sufficient financing for D1 to pay the purchase price in March 2012.[note: 27]However, this could not be a reason for the Additional Deposits to be treated as advance payments that had to be returned if there was no completion. I reiterate that D1 could not have expected to delay completion over such a long period without paying some money for it. Having had the assistance of Prestige Legal throughout the entire process, D1 would have understood that the plaintiffs were entitled to rescind the agreement once the 21 days’ notice had expired and forfeit any deposits paid. She could have repudiated the Option and limited forfeiture to the Deposit, but she chose to agree to the plaintiffs’ conditions in return for time to complete the sale and purchase. 44     The Additional Deposits, on a proper analysis, were reasonable deposits and forfeitable because there was nothing contradicting the common law position in the Option, the Letter of Indemnity and correspondences evidencing the agreements to pay Additional Deposits. Consequently, on the interpretation of “any deposit” in condition 29.8(c)(i) (and this interpretation complements the common law position on deposits (see [34] above), the Additional Deposits could be forfeited. This does not detract from the fact that the Additional Deposits would have been treated as part payments towards the purchase price only if the sale and purchase was completed. 45     I thus concluded that the plaintiffs were entitled to retain the sum of $284,500 pursuant to condition 29.8(c)(i). For the sake of argument, even if a contrary interpretation of the effect of condition 29.8(c)(i) is taken, the Additional Deposits could be forfeited applying common law principles. 46     Given my decision that the Additional Deposits were reasonable deposits, there was no evidence of unconscionability in this case. As such, the subsidiary question in [40] did not arise.",
        "Costs": "47     As for costs, after the 6 May 2013 hearing, I ordered D1 to pay the second defendant the costs of OS 58/2013 fixed at $1,800 plus reasonable disbursements, which should include costs of the withdrawal of the second defendant’s caveat. After the 31 July 2013 hearing, I ordered D1 to pay the plaintiffs costs fixed at $8,000.  [note: 1]Plaintiffs’ bundle of affidavits (“PBA”), pp 21, 25. [note: 2]PBA, p 11, para 12; Heng’s affidavit, 19/03/13, pp 14-15. [note: 3]PBA, pp 42-43. [note: 4]Ibid. [note: 5]PBA, p 14, para 24; Heng’s affidavit, 19/03/13, p 24. [note: 6]Heng’s affidavit, 19/03/13, pp 27-29. [note: 7]PBA, pp 48-51; Heng’s affidavit, 19/03/13, pp 36-37. [note: 8]PBA, p 53. [note: 9]PBA, p 55. [note: 10]Heng’s affidavit, 19/03/13, pp 45-50. [note: 11]PBA, p 56. [note: 12]PBA, pp 62-67. [note: 13]Heng’s affidavit, 19/03/13, p 53. [note: 14]Heng’s affidavit, 19/03/13, pp 54-58. [note: 15]Heng’s affidavit, 19/03/13, p 59. [note: 16]Heng’s affidavit, 19/03/13, p 60; PBA, p 58. [note: 17]PBA, p 57. [note: 18]PBA, p 61. [note: 19]PBA, pp 69, 71, 73. [note: 20]PBA, pp 70, 72. [note: 21]ORC 3368/2013, orders 1-4. [note: 22]ORC 5547/2013, order 1. [note: 23]PBA, p 43, cl 5.1. [note: 24]ORC 5547/2013, order 2. [note: 25]Heng’s affidavit, 19/03/13, pp 19, 25, 35, 40. [note: 26]Heng’s affidavit, 19/03/13, p 38. [note: 27]Heng’s affidavit, 19/03/13, p 3, para 7."
    }
}