{
    "case_title": "Australian Timber Products Pte Ltd\n      v\n      A Pacific Construction & Development Pte Ltd",
    "ncitation": "[2013] SGHC 56",
    "coram": "Woo Bih Li J",
    "sections": {
        "Introduction": "1       This case concerned a dispute relating to the enforceability of an adjudication determination made under s 17 of the Building and Construction Industry Security of Payment Act (Cap 30B, 2006 Rev Ed) (“the Act”). The plaintiff, Australian Timber Products Pte Ltd (“ATP”), had obtained an adjudication determination in its favour (“the Adjudication Determination”) and, subsequently, an Order of Court to enforce that determination as a judgment debt against the defendant, A Pacific Construction & Development Pte Ltd (“APCD”). APCD then applied to court to set aside both the Adjudication Determination and the Order of Court. After hearing both parties, I dismissed APCD’s application. These are my reasons for doing so.",
        "Facts": "2       There was a project to build some Housing and Development Board flats and facilities in Punggol West (“the Project”). On 29 July 2009, APCD appointed ATP under a letter of award to carry out the supply, delivery and installation of parquet flooring and timber skirting for the Project (“the Letter of Award”). ATP accepted the appointment on 1 October 2009 under a sub-contract (“the Sub-Contract”). It is common ground that the provisions of the Act apply to the Sub-Contract. 3       On 23 December 2011, ATP sent via registered mail, facsimile and email what it stated to be “Progress Claim No. 9” to APCD’s representatives (“Progress Claim No 9”). This was a claim for APCD to pay ATP a sum of $427,373.61. However, APCD did not make a payment response within the meaning of the Act. ATP therefore served a notice of intention to apply for adjudication on APCD on 16 January 2012. The next day, ATP served Adjudication Application No SOP/AA004 of 2012 on APCD. 4       An adjudication hearing on 3 February 2012 was thereafter convened, where the adjudicator heard arguments from both parties. The adjudicator later issued the Adjudication Determination on 21 February 2012. In his determination, the adjudicator found that Progress Claim No 9 was a valid “payment claim” within the meaning of the Act. APCD was therefore to pay ATP the sum of $427,373.61, adjudication costs of $535, and the adjudicator’s fee of $8,125 plus goods and services tax at 7%. 5       APCD did not pay these amounts to ATP, leading the latter to file Originating Summons No 210 of 2012 on 8 March 2012 to obtain leave of court to enforce the Adjudication Determination as a judgment debt. An assistant registrar granted ATP leave on 15 March 2012 (“the AR’s order”). However, APCD then applied on 2 April 2012 to set aside both the Adjudication Determination and the AR’s order. This was the application that came before me.",
        "APCD’s arguments": "6       APCD initially relied on two arguments, at the first tranche of the hearing, as to why the Adjudication Determination and the AR’s order should be set aside: (a)     first, Progress Claim No 9 was not a “payment claim” within the meaning of the Act, and, hence, the adjudicator had no jurisdiction to deal with this claim; and (b)     secondly, in so far as Progress Claim No 9 included a claim for payment for certain variation works carried out (“the Variation Works”), that claim had been made out of time.[note: 1] 7       However, by the time of the second tranche of the hearing, the Court of Appeal had delivered its judgment inLee Wee Lick Terence (alias Li Weili Terence) v Chua Say Eng (formerly trading as Weng Fatt Construction Engineering) and another appeal[2013] 1 SLR 401 (“Chua Say Eng”). APCD then informed me at the second tranche of the hearing that it was abandoning its second argument in view of the decision inChua Say Eng. I needed therefore only to rule on APCD’s remaining contention. 8       It was submitted by APCD that Progress Claim No 9 was not a valid “payment claim” under the Act for the following reasons: (a)     ATP had not intended for Progress Claim No 9 to be a payment claim under the Act;[note: 2] (b)     there were significant differences in wording between ATP’s previous eight progress claims and Progress Claim No 9;[note: 3] (c)     Progress Claim No 9 was addressed to APCD’s directors, project manager and project director, whereas earlier progress claims had previously been sent to Ms Julia Koh (“Ms Koh”);[note: 4] (d)     ATP had already made a progress claim for certain work done up to 25 November 2011, thus it was inconsistent for ATP to have also made Progress Claim No 9 to claim payment for work done in November 2011;[note: 5] (e)     ATP had unilaterally increased the price of timber skirting;[note: 6] (f)     the Variation Works were actually rectification works for which ATP could not claim payment from APCD under the Sub-Contract;[note: 7]and (g)     Progress Claim No 9 did not contain sufficient details of the Variation Works for which payment was claimed.[note: 8]",
        "The statutory framework as explained inChua Say Eng": "9       Before examining APCD’s contentions, I need to consider the decision inChua Say Eng. That case is, of course, not only binding on me; it also seeks to lay down the proper approach to be taken by the courts and adjudicators when dealing with disputes under the Act and its subsidiary legislation. 10     I begin therefore by summarising the relevant holdings inChua Say Eng. First, the only functions of an adjudicator are to: (a) decide whether the adjudication application in question was made in accordance with ss 13(3)(a)–13(3)(c) of the Act; and (b) determine the adjudication application under s 17(2) of the Act (Chua Say Engat [64]). 11     Secondly, the court in a setting-aside action is not to review the merits of the adjudicator’s decision. The court does, however, have the power to decide whether the adjudicator was validly appointed. If there is no payment claim or no service of a payment claim, the appointment of the adjudicator will be invalid, and the resulting adjudication determination would be null and void (Chua Say Engat [66]). 12     Thirdly, even if there is a payment claim and service of that payment claim, the court may still set aside the adjudication determination on the ground that the claimant, in the course of making his adjudication application, has not complied with one (or more) of the provisions under the Act which is so important that it is the legislative purpose that an act done in breach of the provision concerned should be invalid. A breach of such a provision would result in the adjudication determination being invalid (Chua Say Engat [67]). While the Court of Appeal only referred inChua Say Engto a provision under the Act, I am of the opinion that this does not exclude the possibility that a provision in the Building and Construction Industry Security of Payment Regulations (Cap 30B, Rg 1, 2006 Rev Ed) (“the SOPR”) can also fall within such a category. 13     I am also guided by another principle laid down inChua Say Eng(at [78]): if a purported payment claim satisfies all the formal requirements in s 10(3)(a) of the Act and reg 5(2) of the SOPR, it is a valid payment claim. 14     It is with this backdrop in mind that I turn to examine APCD’s contentions.",
        "Analysis": "",
        "ATP did not intend for Progress Claim No 9 to be a “payment claim” under the Act": "15     Relying onSungdo Engineering & Construction (S) Pte Ltd v Italcor Pte Ltd[2010] 3 SLR 459 (“Sungdo”), APCD argued that in order for a document to amount to a “payment claim” under the Act, it had to be intended to be such by the claimant and this intention had to be communicated to the respondent. According to APCD, therefore, Progress Claim No 9 did not amount to a “payment claim” under the Act for two reasons: (a) the text of Progress Claim No 9 itself failed to indicate that it was a “payment claim” under the Act; and (b) the attached cover letter (“the cover letter”) merely stated that Progress Claim No 9 was for APCD’s “perusal and evaluation”.[note: 9] 16     I was bound by the decision inChua Say Engto say that this argument must fail. Chan Sek Keong CJ stated there (at [74] and [76]) that: 74    …[W]e do not agree with the decision inSungdoif it means that, in the absence of express words to the contrary, the claimant’s subjective intention is relevant to determining whether the claim he has served on the respondent is a payment claim. It seems to us that the legislated formal requirements for payment claims are designed to ensure that specified items of information are made available to the respondent before the claimant’s rights under the Act are engaged.The emphasis is therefore not on the claimant’s intention but on the respondent being given notice of certain information about the claim… … 76    We recognise that, from a potential respondent’s perspective, these safeguards do not offer the same protection as a legislative requirement that payment claims state that they are made under the Act.However, since Parliament has deliberately omitted this requirement, a respondent should treat every claim submitted by a claimant that satisfies the requirements of the Act as a payment claim and respond accordingly. [emphasis added] 17     Consequently, in determining whether Progress Claim No 9 was a payment claim under the Act, I put aside ATP’s subjective intention and focussed instead on whether Progress Claim No 9 fulfilled the formal requirements set out in the Act and the SOPR.",
        "Progress Claim No 9 was worded differently from ATP’s previous eight progress claims": "18     It was next contended by APCD that there were stark differences between the wording of Progress Claim No 9 and that of the previous eight progress claims made by ATP. The earlier claims had all ended off with a claim for payment (“your early remittance will be very much appreciated”),[note: 10]whereas Progress Claim No 9 was only expressed to be for APCD’s “perusal and evaluation”.[note: 11] 19     As regards APCD’s argument that this linguistic variation rendered Progress Claim No 9 no longer a “payment claim” under the Act, I bore in mind that a purported payment claim was valid if it satisfied all the formal requirements in s 10(3)(a) of the Act and reg 5(2) of the SOPR (see [13] above). Having perused these requirements for myself, I did not observe any statutory imperative on the claimant to stateexpresslythat he was making a claim for payment. The fact that Progress Claim No 9 was expressed to be for APCD’s “perusal and evaluation” was neither here nor there. In my view, this alone did not make Progress Claim No 9 any less a payment claim than the previous eight progress claims made by ATP. APCD did not suggest that it had not responded to Progress Claim No 9 because it had genuinely believed that that was not a payment claim. It seemed to me that APCD had accepted that Progress Claim No 9 was a payment claim, but, subsequently, it served APCD’s purpose to try to be technical and rely on some minor differences in wording to contend otherwise.",
        "Progress Claim No 9 was not addressed to the person who had previously been the recipient of ATP’s earlier progress claims": "20     APCD then claimed that Progress Claim No 9 was addressed to the wrong person. Here, it is necessary to have regard to s 10(1) of the Act, which dictates the categories of persons on whom a payment claim may be served. That section reads as follows: 10.—(1) A claimant may serve one payment claim in respect of a progress payment on — (a)    one or more other persons who, under the contract concerned, is or may be liable to make the payment;or (b)    such other person as specified in or identified in accordance with the terms of the contract for this purpose. [emphasis added] 21     In this case, Progress Claim No 9 was addressed to APCD’s directors, project manager and project director. APCD did not deny that these persons, or at least some of these persons, were in a position to respond to the claim. It argued, however, that Progress Claim No 9 should have been addressed to Ms Koh, who had been the recipient of the previous eight progress claims made by ATP. 22     According to APCD, Ms Koh was the head of its Quantity Surveying (“QS”) department. Since cl 10.8 of the Letter of Award (“cl 10.8”) stated that all claims were to be sent to APCD’s head office and addressed to APCD’s Quantity Surveyor, Ms Koh was the proper addressee of any payment claim. ATP countered this by alleging that Ms Koh was only APCD’s contracts manager, and not the head of APCD’s QS department. 23     I did not need to resolve this particular factual dispute as to Ms Koh’s position in APCD because it seemed to me that even if Ms Koh was the head of APCD’s QS department, she wasbut oneof the persons on whom Progress Claim No 9 could be served. The wording in s 10(1) of the Act is clear: a payment claim can be addressed to a person specified in the contract for this purpose (here, APCD’s Quantity Surveyor under cl 10.8)orto a person who is or may be liable to make the progress payment in question. Given that APCD was not contending that the only person liable to make the progress payments under the Sub-Contract was its Quantity Surveyor, I could see no contravention of the requirements of s 10(1) of the Act.",
        "Various arguments on the merits": "24     As mentioned above, APCD also submitted that Progress Claim No 9 was not a valid “payment claim” under the Act because: (a)     ATP had already made a progress claim for certain work done up to 25 November 2011, and it was thus inconsistent for ATP to have also made Progress Claim No 9 to claim payment for work done in November 2011; (b)     ATP had unilaterally increased the price of timber skirting; and (c)     the Variation Works were actually rectification works for which ATP could not claim payment from APCD under the Sub-Contract. 25     In my view, all these points went to the merits of the dispute between APCD and ATP. They raised questions which, while no doubt of importance to the parties, remained firmly within what the Court of Appeal deemed inChua Say Eng(at [64]) to be the other half of an adjudicator’s remit – namely,the adjudicator(and not the court) is to determine the adjudication application, including, in particular, theadjudication amountto be paid by the respondent to the claimant (see s 17(2)(a) of the Act). 26     Indeed, a closer examination of the scheme of the Act lends support to the point that APCD’s arguments here were not properly for my consideration. Pursuant to s 11(3)(c) of the Act, any allegation by the respondent which would affect the determination of the adjudication amount (eg, that the claimant was double-claiming, that the contract price was unilaterally increased by the claimant, or that the work done was not something for which payment could be claimed under the contract) should be contained in a payment response. This appears to be so central a pillar of the Act’s adjudication mechanism that the adjudicator cannot consider such allegationsat allunless they are included in a payment response (s 15(3)(a) of the Act). Given this statutory impetus on a respondent to raise his objections to the adjudication amount in a particular fashion and the serious consequences visited on the respondent for failing to do so, I did not see why the court should now intervene to consider APCD’s protestations, whether presented as outright attacks on the validity of Progress Claim No 9 or more subtly disguised as objections to jurisdiction. 27     I consequently rejected APCD’s arguments in this respect.",
        "Progress Claim No 9 did not contain sufficient details of the Variation Works for which payment was claimed": "28     Finally, APCD sought to draw my attention to how Progress Claim No 9 was defective for failing to contain sufficient details of the Variation Works for which payment was claimed. 29     I have already mentioned (at [13] above) that a purported payment claim satisfying all the formal requirements in s 10(3)(a) of the Act and reg 5(2) of the SOPR is a valid payment claim. However, this doesnotmean that a purported payment claim which fails to meet some of these formal requirements is necessarily an invalid one. The nature of this inquiry was adverted to by the Court of Appeal in the following terms (Chua Say Engat [31]): In the first situation [of a payment claim which is in form a payment claim but not intended to be such, and therefore does not have the effect of a payment claim], a payment claim has not come into operation as a payment claim.In the second situation [of a payment claim which is in form a payment claim and is intended to be such, but which does not satisfy all the requirements of the Act], a payment claim operates as a payment claim but it is defective for non-compliance with the requirements of the Act.The first situation goes to the validity of the appointment of the adjudicator.The second situation goes to the validity of the adjudication determination.[emphasis added] 30     In my view, therefore, the two-step analysis proceeds as follows. If a purported payment claim complies with s 10(3)(a) of the Act and reg 5(2) of the SOPR, it is a valid payment claim and no further question arises as to its validity, although an argument based on estoppel against the claimant can still be made (Chua Say Engat [33], [73] and [78]). If, however, the purported payment claim does not comply with these statutory provisions, it is not necessarily rendered invalid and the adjudication determination is not automatically invalidated. The court should instead proceed to examine whether any of the provisions which were not complied with was so important that it was the legislative purpose that an act done in breach of the provision should be invalid, so that non-compliance with such a provision would invalidate the adjudication determination (Chua Say Engat [67]). 31     I note that there is a decision which appears to suggest a contrary position, that is, that a purported payment claim’s non-compliance with the formal requirements necessarily renders that claim an invalid one. InHon Industries Pte Ltd v Wan Sheng Hao Construction Pte Ltd[2011] SGHC 247 (“Hon Industries”), the “Quantity” and “Unit Price” columns in one of the purported payment claims had been left empty. Given, therefore, that there was no breakdown of the work done and no particularisation of the description, quantity, quantum and unit price of each item of work, Eunice Chua AR found (at [30]) that the claim was invalid for failing to comply with reg 5(2)(c) of the SOPR. 32Hon Industries, being decided prior to the Court of Appeal’s decision inChua Say Eng, did not have the benefit of the views of the Court of Appeal. As I mentioned above, those views suggest that a payment claim is not automatically invalidated for non-compliance with the formal requirements in the Act and the SOPR. Rather, the court should proceed to examine whether the particular provision breached was so important that it was the legislative purpose that an act done in breach of that provision should be invalid. The arguments 33     APCD’s position was that out of the $427,373.61 claimed in Progress Claim No 9, $226,580.32 was for the Variation Works. It alleged that other than very brief and general remarks, ATP did not provide sufficient details of the Variation Works nor supporting documents as to the quantities, rates and calculations submitted. Instead, ATP only indicated lump sum amounts for the Variation Works without showing how they had been derived,ie, there was no breakdown of the quantities, rates and calculations. 34     On the other hand, ATP pointed out that this objection was never raised in a payment response or before the adjudicator. As regards APCD’s failure to mention the objection in a payment response, ATP submitted that s 15(3) of the Act operated to preclude APCD from raising the point before the adjudicator and, now, the court. ATP further submitted, as regards APCD’s lack of mention of the objection before the adjudicator, that APCD was now estopped from raising the objection before me on the authority ofRN & Associates Pte Ltd v TPX Builders Pte Ltd[2012] SGHC 225. 35     ATP’s argument in the alternative was that even if the court were now minded to review APCD’s objection, sufficient details had been provided in Progress Claim No 9. APCD’s failure to raise its objections in a payment response and before the adjudicator 36     I first address ATP’s argument that because APCD did not object to the adjudicator regarding the lack of detail in Progress Claim No 9, APCD was now estopped from raising that objection before me. In my view, this argument was not persuasive given the holding inChua Say Eng(at [64]) that there are only two matters properly within an adjudicator’s remit: (a) to decide whether the adjudication application in question was made in accordance with ss 13(3)(a)–13(3)(c) of the Act; and (b) to determine the adjudication application under s 17(2) of the Act. The formal validity of a payment claim under s 10(3) of the Act is thereforenota matter on which an adjudicator is entitled to decide; and in this regard, it would be superfluous to raise for the adjudicator’s consideration any objection to validity stemming from the lack of detail in a purported payment claim. No question of any estoppel can arise, given that the adjudicator cannot decide on the point even if it is brought up for his consideration. 37     Should the underlying dispute proceed to adjudication, therefore, the adjudicator ought ordinarily to make his decision on any purported payment claim that is brought before him, and if the details therein are insufficient to allow him to make a determination in the claimant’s favour, the claimant only has himself to blame. If, however, the adjudicator does make a determination in the claimant’s favour, the respondent is entitled to make good his contentions regarding the invalidity of the payment claim at the setting-aside stage. I would emphasise though that a respondent should not on this account raise plainly unmeritorious objections before the court. These will be disposed of with the customary alacrity. 38     ATP’s second preliminary argument was that APCD’s objection to the lack of detail in Progress Claim No 9 was not made in a payment response. As to this argument, I repeat my view in an earlier case that a respondent’s failure to raise in a payment response his objections relating to the alleged invalidity of a payment claim doesnotnecessarily preclude him from challenging the validity of that claim in a setting-aside action (JFC Builders Pte Ltd v LionCity Construction Co Pte Ltd[2012] SGHC 243 at [35]–[41];cfa respondent’s failure to raise in a payment response allegations which would affect the determination of the adjudication amount (see [26] above)). 39     That said, I do not disagree with the Court of Appeal’s suggestion inChua Say Eng(at [65]) that a respondent should state as soon as possible in a payment response his objections to the validity of a payment claim. In fact, that may ordinarily be the most practical way for respondents to raise such objections (see alsoClarence Street Pty Ltd v Isis Projects Pty Ltd(2005) 64 NSWLR 448 (“Isis Projects”) at [31];Nepean Engineering Pty Ltd v Total Process Services Pty Ltd (In Liq)(2005) 64 NSWLR 462 (“Nepean”) at [35]). But all this is quite different from saying that such objectionsmustbe included in a payment response or be thrown out otherwise. Indeed,ifa payment claim is eventually found to be invalid, it cannot be said to have been a “payment claim” under the Act; and it is then difficult to see how any payment response made to such a payment claim can be a legitimate one, given that it cannot properly “identify thepayment claimto which it relates” [emphasis added] (s 11(3)(a) of the Act). I do not think, therefore, in the absence of express compulsion by the Act, that a payment response must inevitably issue to identify aninvalidpayment claim to which it relates. 40     The preceding paragraph should not be taken by respondents to support any practice of raising plainly unmeritorious objections to the validity of a payment claim in a bid to bypass the statutory requirement of making a payment response. I would stress again that the courts will not look benignly upon any deliberate and unnecessary frustration of the Act’s mechanisms, and, for my part, I think that any such instance will be subjected to the appropriate costs order at the very least. 41     There is a further reason why it seems to me that the court at the setting-aside stage should ordinarily be entitled to review the validity of a payment claim, namely, that this is a matterwhich would potentially affect the jurisdictional substratum of an adjudication determination. The decision inChua Say Engis instructive in this respect. The Court of Appeal there had to address an issue framed in the following terms (at [39]): [W]e would agree with Lee J’s holding inSungdothatifthe validity of a payment claim or the service of a payment claim goes to the competence of an adjudicator to hear and determine an adjudication, such issues must be subject to review by the court. The critical word in Lee J’s ruling is “if”, and it gives rise to the question: “Does the non-compliance with the requirements of the Act go to the competence of an adjudicator?”Hence, the critical question is whether an invalid payment claim or an invalid service of a valid payment claim, as distinguished from a non-existent or inoperative payment claim or a payment claim which has not been served on the respondent at all, goes to the validity of an adjudicator’s appointment and his competence to adjudicate a payment claim.[emphasis in original in italics; emphasis added in bold] As mentioned, the Court of Appeal answered the question thus: it was only if any of the statutory provisions not complied with in the course of making an adjudication applicationwas so important that it was the legislative purpose that an act done in breach of the provision should be invalid, that the resulting adjudication determination would also be rendered invalid and be set aside by the court (Chua Say Engat [67]). For convenience, I shall hereafter term such a provision a “legislatively important provision”. 42     In my view, if a payment claim doesnotcomply with a legislatively important provision in the Act or the SOPR, the resulting invalidity of the adjudication determination is premised on the absence of jurisdiction necessary to support the making of the determination in the first place. This is apparent from the way the Court of Appeal inChua Say Engderived the concept of a legislatively important provision in the first place. 43     InChua Say Eng, the Court of Appeal had occasion to review certain Australian authorities, most notably,Chase Oyster Bar Pty Ltd v Hamo Industries Pty Ltd(2010) 78 NSWLR 393 (“Chase Oyster”).Chase Oysterwas a decision on the New South Wales Building and Construction Industry Security of Payment Act 1999 (Act 46 of 1999) (“the NSW Act”). Spigelman CJ, Basten JA and McDougall J all agreed that the breach of a legislatively important provision in the NSW Act would go to thejurisdictionof the person or body exercising the power or authority to adjudicate on the payment claim dispute in question (Chase Oysterat [37]–[38], [96] and [166]). 44Chase Oysterwas cited approvingly inChua Say Eng, where the Court of Appeal held that non-compliance with a legislatively important provision in the Act would invalidate the resulting adjudication determination. 45     I was therefore persuaded that the Court of Appeal, by enunciating the need to inquire into whether a particular provision in the Act was a legislatively important provision, was in fact endorsing the conceptual divide between matters which went to jurisdiction and those which did not. 46     Therefore, since APCD’s objection was that Progress Claim No 9 lacked sufficient detail as required under s 10(3) of the Act and reg 5(2) of the SOPR, it was possible that the court might need to consider whether any of these statutory provisions was a legislatively important provision (see [30] above). Since this inquiry went to the jurisdiction of the adjudicator, it would also be proper for a court having supervisory jurisdiction to conduct the inquiry notwithstanding that the objection was not taken in a payment response or before the adjudicator. 47     I therefore rejected ATP’s preliminary arguments that APCD was not entitled to raise the objection relating to the lack of detail in Progress Claim No 9 before me. Did Progress Claim No 9 comply with s 10(3)(a) of the Act and reg 5(2) of the SOPR? 48     The first step of the test stated at [30] above required me to consider if Progress Claim No 9 fulfilled the formal requirements in s 10(3)(a) of the Act and reg 5(2) of the SOPR (collectively referred to hereafter as “the Singapore provisions”). 49     Section 10(3) of the Act reads as follows: 10.—(3) A payment claim — (a)    shall state the claimed amount, calculated by reference to the period to which the payment claim relates; and (b)    shall be made in such form and manner, and contain such other information or be accompanied by such documents, as may be prescribed. As for reg 5(2) of the SOPR, that provision states as follows: 5.—(2) Every payment claim shall — (a)    be in writing; (b)    identify the contract to which the progress payment that is the subject of the payment claim relates; and (c)    contain details of the claimed amount, including — (i)    a breakdown of the items constituting the claimed amount; (ii)   a description of these items; (iii)   the quantity or quantum of each item; and (iv)   the calculations which show how the claimed amount is derived. 50     Given that there has not been much judicial consideration of these provisions, it may be helpful to first set out a brief discussion of the requirements therein. (1)   The provenance of the Singapore provisions 51     The Act is stated to be “modelled after similar legislation in other countries such as Australia, [the] UK and New Zealand”, and its features “have been adapted to suit local conditions and have taken the stakeholders’ suggestions and views into account” (Singapore Parliamentary Debates,Official Report(16 November 2004) vol 78 at col 1112 (Cedric Foo Chee Keng, Minister of State for National Development) (“the Parliamentary Debates”)). 52     Despite this statement, however, the exact provenance of the Singapore provisions is still not entirely clear. I note that they are worded differently from their Antipodean counterparts. For example, s 13(2) of the NSW Act lays down the following formal requirements for a payment claim in New South Wales: 13 (2)    A payment claim: (a)    must identify the construction work (or related goods and services) to which the progress payment relates, and (b)    must indicate the amount of the progress payment that the claimant claims to be due (the claimed amount), and (c)    must state that it is made under [the NSW] Act. 53     In Victoria, s 14(2) of the Building and Construction Industry Security of Payment Act 2002 (Act 15 of 2002) (“the Victorian Act”) states as follows: 14 (2)    A payment claim— (a)    must be in the relevant prescribed form (if any); and (b)    must contain the prescribed information (if any); and (c)    must identify the construction work or related goods and services to which the progress payment relates; and (d)    must indicate the amount of the progress payment that the claimant claims to be due (the “claimed amount”); and (e)    must state that it is made under [the Victorian] Act. To date, there has apparently been no form or information prescribed under ss 14(2)(a)–14(2)(b) of the Victorian Act. 54     The closest in terms of similarity of expression to the Singapore provisions may be s 20(2) of the New Zealand Construction Contracts Act 2002 (Act 46 of 2002) (“the NZ Act”). That section provides as follows: 20 (2)    A payment claim must— (a)    be in writing; and (b)    contain sufficient details to identify the construction contract to which the progress payment relates; and (c)    identify the construction work and the relevant period to which the progress payment relates; and (d)    indicate a claimed amount and the due date for payment; and (e)    indicate the manner in which the payee calculated the claimed amount; and (f)    state that it is made under [the NZ] Act. 55     Having reviewed the relevant statutes in other jurisdictions, it seems to me at first blush that the Singapore provisions are the product not of unthinking duplication, but of considered adaptation instead. While they are unmistakeably inspired by their earlier Australian and New Zealand equivalents, they appear to be uniquely worded. If this is correct, any judicial utterances on the Australian and New Zealand provisions, while of some relevance to the interpretation of the Singapore provisions, must be read with these linguistic variations in mind. (2)   Some Australian decisions 56     It is therefore useful (subject to the caveat in the preceding paragraph), in understanding how the Singapore provisions are to be properly interpreted, to look at some Australian cases which have expounded on the formal requirements for a payment claim. 57     InMultiplex Constructions Pty Ltd v Luikens[2003] NSWSC 1140 (“Multiplex Constructions”), Palmer J observed (at [76]) of the operation of the NSW Act that: A payment claim and a payment schedule are, in many cases, given and received by parties who are experienced in the building industry and are familiar with the particular building contract, the history of construction of the project and the broad issues which have produced the dispute as to the claimant’s payment claim.A payment claim and a payment schedule must be produced quickly; much that is contained therein in an abbreviated form which would be meaningless to the uninformed reader will be understood readily by the parties themselves. A payment claim and a payment schedule should not, therefore, be required to be as precise and as particularised as a pleading in the Supreme Court.Nevertheless, precision and particularity must be required to a degree reasonably sufficient to apprise the parties of the real issues in the dispute.[emphasis added] This passage was cited approvingly by Mason P inIsis Projects(at [31]). 58     Subsequently, Hodgson JA discussed inNepean(at [34] and [36]) the requirement for a payment claim to “identify the construction work … to which the progress payment relates” in s 13(2)(a) of the NSW Act (see [52] above): 34In my opinion, a document which purports to be a payment claim does not fail to be a payment claim, within the meaning of the [NSW] Act, merely because it can be seen, after a full investigation of all the facts and circumstances, not to successfully identify all the construction work for which payment is claimed.This could be the case, for example, if there is some typographical omission or other error in relation to one of a large number of items included in the claim; and the question whether or not the other party, by reason of its knowledge of the project, would have been able to fill in or correct that error could be one depending on a great deal of evidence concerning the circumstances of the case. In my opinion, it is inconceivable that it was the intention of the legislature that the existence of a payment claim under the [NSW] Act should depend on that kind of consideration. … 36That is, I do not think a payment claim can be treated as a nullity for failure to comply with s 13(2)(a) of the [NSW] Act, unless the failure is patent on its face; and this will not be the case if the claim purports in a reasonable way to identify the particular work in respect of which the claim is made. [emphasis added] 59     In the same case, however, Santow JA stated his differing views on the issue (at [47]–[48]): 47    … I respectfully disagree that a payment claim cannot be treated as a nullity “unless the failure is patent on its face”. 48    I acknowledge that the law does regularly employ the concept of reasonableness … But here, consistent with the object of the [NSW] Act and the means for its achievement,I consider that there must be sufficient specificity in the payment claim for its recipient actually to be able to identify a “payment claim” for the purpose of determining whether to pay, or to respond by way of a payment schedule indicating the extent of payment, if any.Nepean needs to be in a position to determine in meaningful fashion whether to make payment, or else dispute it with reasons so as in that case to permit adjudication of the dispute, utilising the summary procedures under the [NSW] Act. Those requirements underlying s 13(2)(a) are satisfied in my view by a relatively undemanding test, though still one with some content; one which recognises the mandatory character of s 13(2)(a) signalled by the word “must”.It is that “the relevant construction work (or related goods and services) must be identified sufficiently to enable the respondent to understand the basis of the claim”[Coordinated Construction Co Pty Ltd v Climatech (Canberra) Pty Ltd[2005] NSWCA 229 at [25]].This moreover is an objective not subjective test, taking into account the background knowledge each of the parties derive from their past dealings and exchange of documentation … [emphasis added] 60     Finally, Finkelstein J’s elaboration on s 14 of the Victorian Act (the relevant part of which is found at [53] above) inProtectavale Pty Ltd v K2K Pty Ltd[2008] FCA 1248 is worth quotingin extenso(at [10]–[12]): 10    It is necessary to decide whether the invoice meets the requirements of s 14.The test is an objective one; that is, it must be clear from the terms of the document that it contains the required information:Walter Construction Group Ltd v CPL (Surry Hills) Pty Ltd[2003] NSWSC 266 at [82]. But the terms must be read in context. Payment claims are usually given and received by parties experienced in the building industry who are familiar with the particular construction contract, the history of the project and any issues which may have arisen between them regarding payment. Those matters are part of the context:Multiplex Constructions[2003] NSWSC 1140 at [76]. 11The manner in which compliance with s 14 is tested is not overly demanding:Leighton Contractors Pty Ltd v Campbelltown Catholic Club Ltd[2003] NSWSC 1103 at [54] citingHawkins Construction (Aust) Pty Ltd v Mac’s Industrial Pipework Pty Ltd[2002] NSWCA 136 at [20] (“[The requirements for a payment claim] should not be approached in an unduly technical manner … As the words are used in relation to events occurring in the construction industry, they should be applied in a commonsense practical manner”);Multiplex Constructions[2003] NSWSC 1140 at [76] (“[A] payment claim and a payment schedule must be produced quickly; much that is contained therein in an abbreviated form which would be meaningless to the uninformed reader will be understood readily by the parties themselves”);Minimax Fire Fighting Systems Pty Ltd v Bremore Engineering (WA Pty Ltd)[2007] QSC 333 at [20] (“The Act emphasises speed and informality. Accordingly one should not approach the question whether a document satisfies the description of a payment schedule (or payment claim for that matter) from an unduly critical viewpoint”). 12    Nonetheless a payment claim must be sufficiently detailed to enable the principal to understand the basis of the claim. If a reasonable principal is unable to ascertain with sufficient certainty the work to which the claim relates, he will not be able to provide a meaningful payment schedule. That is to say, a payment claim must put the principal in a position where he is able to decide whether to accept or reject the claim and, if the principal opts for the latter, to respond appropriately in a payment schedule:Nepean Engineering Pty Ltd v Total Process Services Pty Ltd (in liq)(2005) 64 NSWLR 462, 477;John Holland Pty Ltd v Cardno MBK (NSW) Pty Ltd[2004] NSWSC 258 at [18]–[21]. That is not an unreasonable price to pay to obtain the benefits of the statute. [emphasis added] 61     In some Australian states, therefore, where the relevant statute sets out ageneralrequirement that the payment claim should identify the construction work to which the progress payment relates, the courts appear to have imposed a test to determine compliance with this formal condition which is not overly demanding of claimants: that is, whether, on an objective (but not unduly technical or critical) view, the payment claim was sufficiently detailed to enable the respondent to understand the basis of the claim. 62     As I have already noted though, the wording of the Singapore provisions is unlike that of the equivalent sections elsewhere. The most striking difference is reg 5(2)(c) of the SOPR, which actuallyspells out the type and extent of detaila payment claim under the Act should include. 63     Be that as it may, some of the judicial pronouncements in Australia which I have discussed above are relevant in Singapore as well. It is correct that the courts should utilise an objective lens in checking that the statutory criteria have been met; and it is also sensible to bear in mind that actors in the construction industry often operate on tight deadlines and do not always communicate ideally in a formal manner (see alsoChua Say Engat [75]). (3)   Were the statutory criteria for validity fulfilled here? 64     With this brief discussion of the Singapore provisions in place, I turn to examine if the requirements in these provisions were fulfilled here. As mentioned, APCD argued that the Variation Works for which payment was claimed were insufficiently detailed in Progress Claim No 9. 65     Progress Claim No 9 apparently comprised the cover letter (as defined at [15] above) and some supporting documentation, which I shall hereafter refer to as “the supporting documentation”. The parties proceeded on the basis that Progress Claim No 9 included both the cover letter and the supporting documentation. The germane portions of the cover letter read as follows:[note: 12] Attn: Mr. Yao, Mr. Yang, Mr. Yee & Mr. Khoo RE: SUBCONTRACT DATED 29 JULY 2009 FOR SUPPLY, DELIVERY & INSTALLATION OF TIMBER FLOORING AND SKIRTING INCLUDING VARNISH TO ALL 503 UNITS … (SUB-CONTRACT NO. PGW/S8) FOR PROPOSED NEW ERECTION OF PUBLIC HOUSING DEVELOPMENT COMPRISING 6 BLOCKS OF 16-STOREY RESIDENTIAL BUILDING (TOTAL 503 UNITS), 1 BLOCK OF PRECINCT PAVILION & 1 BLOCK MULIT-STOREY [SIC] CAR PARK AND ESS AT PUNGGOL WALK (PUNGGOL WEST C17) Dear Sirs, We refer to the above-mentioned project, and we submit to you herewith our Progress Claim No. 9 for our work carried out between 17 February 2011 and 25 November 2011, amounting toSingapore dollars Four Hundred Twenty Seven [Thousand] Three Hundred Seventy Three and Cents Sixty One (with GST). We enclosed [sic] herewith our supporting documentation for your perusal and evaluation. [emphasis in bold in original] 66     As intimated by the last paragraph of the cover letter, some 23 pages of supporting documentation relating to the Variation Works were appended to Progress Claim No 9. One of these pages is reproduced below:[note: 13] RE:    CLAIM FOR VARIATION WORKS AT BLOCK 270B worked [sic] done between 17 Feb 2011 to 25 November 2011 ItemDescription of worksUnitQuantityRateAmount8abVariation Works No: 08HDB-BIT inspection …Parquet flooring chipped / scrathed [sic] / dented during HDB-BIT inspection. All floors listed below will be rectified accordingly with re-sanding the affected areas and re-polish complete with application of putty, sealer and final coatings.a. level 09-235, mainbedroomParquet skirting remove, re-installed due to wall misalignment, chipped / cracked / scratched complete with putty an [sic] application of final coat.a. level 09-231, living roomsumsum$ 259.54$ 237.72TO GENERAL SUMMARY$ 497.26   The other pages containing details of the Variation Works were similar to the page I have reproduced here, in so far as the columns titled “Quantity” and “Rate” were all left blank. 67     I therefore had to examine Progress Claim No 9 for compliance with the formal requirements in the Singapore provisions. Looking at the requirements in s 10(3)(a) of the Act first, these were satisfied by the cover letter. The claimed amount was stated there in bold letters, and it was calculated by reference to the period of 17 February 2011 to 25 November 2011. 68     The cover letter also showed that regs 5(2)(a)–5(2)(b) of the SOPR were complied with, as Progress Claim No 9 was obviously in writing and its captioned title clearly identified the Sub-Contract as the contract to which the claimed payment related. 69     With respect to regs 5(2)(c)(i)–5(2)(c)(ii) of the SOPR, the supporting documentation showed that these statutory requirements were fulfilled. Like the page reproduced at [66] above, the other pages of the supporting documentation relating to the Variation Works contained a breakdown and description of the items constituting the claimed amount. 70     Finally, regs 5(2)(c)(iii)–5(2)(c)(iv) of the SOPR require a payment claim to contain details of the quantity of the items constituting the claimed amount, as well as details of the calculations showing the derivation of the claimed amount. I have already mentioned that the columns titled “Quantity” and “Rate” in the supporting documentation were left blank. On an objective view, therefore, it was not possible to conclude that there was any detail as to the quantity of the items claimed and the calculations going to the derivation of the claimed amount. These particular formal requirements were thereforenotfulfilled by Progress Claim No 9. 71     To summarise, therefore, Progress Claim No 9 met the formal requirements in s 10(3)(a) of the Act and regs 5(2)(a), 5(2)(b) and 5(2)(c)(i)–5(2)(c)(ii) of the SOPR, but it did not satisfy the requirements in regs 5(2)(c)(iii)–5(2)(c)(iv) of the SOPR. Were regs 5(2)(c)(iii)–5(2)(c)(iv) of the SOPR legislatively important provisions? 72     I have already mentioned (at [30] above) that a purported payment claim which fails to meet the formal requirements in the Singapore provisions is not necessarily rendered invalid. Whether it is indeed invalid depends on the result of the second step of the test stated in that same paragraph. In this case, therefore, having found that Progress Claim No 9 (in so far as it claimed payment for the Variation Works) failed to fulfil the requirements in regs 5(2)(c)(iii)–5(2)(c)(iv) of the SOPR, I proceeded to consider whether  these provisions were legislatively important,ie, whether they were so important that it was the legislative purpose that an act done in breach of them should be invalid. 73     The entire concept of adjudication under the Act stems from a desire to facilitate the cash flow of contractors in the construction industry. As the Court of Appeal noted inChua Say Eng(at [3]), the adjudication procedure allows a person to claim payment for particular classes of work done or goods and services supplied. To initiate that procedure, a contractor must first obtain the right to seek adjudication by serving a payment claim in the prescribed form on the customer. 74     On one view, the existence of a payment claim with the necessary details may be one of the foundational requirements to be fulfilled before the adjudication procedure can even get off the ground. This appears to be the position in some Australian states. Basten JA opined that s 13(2) of the NSW Act (see [52] above) imposed mandatory requirements with respect to the making of payment claims (Coordinated Construction Co Pty Ltd v Climatech (Canberra) Pty Ltd[2005] NSWCA 229 at [44]). Similarly, Vickery J thought that the predecessor of s 14(2)(c) of the Victorian Act (see [53] above) was a basic and essential requirement of the legislation (Gantley Pty Ltd v Phoenix International Group Pty Ltd[2010] VSC 106 at [131]). 75     It seems to me that a number of considerations ought to influence the determination of whether a particular provision of the Act or the SOPR is a legislatively important provision. These considerations would include the overarching purpose of the Act, the degree of difficulty in ascertaining compliance with that provision, the fact that curial intervention is permitted in the Act’s adjudication mechanism, and the practical realities of the construction industry and its operation. I hasten to add that this is not an exhaustive list. 76     The purpose of the Act was stated in the Parliamentary Debates to be as follows: The [Act] will create a more conducive operating environment and a level playing field for all parties in the industry. … [It] will preserve the rights to payment for work done and goods supplied of all the parties in the construction industry.It also facilitates cash flow by establishing a fast and low cost adjudication system to resolve payment disputes.… [B]y upholding the rights of any party in the industry to seek payment for work done or goods supplied, [the Act] will help to deter and weed out the practice of delaying or withholding payment without valid reasons.The speedy and low cost adjudication process will expedite the resolution of genuine payment disputes so that cashflow will not be disrupted.…[The Act’s] mission and purpose [is to facilitate] smooth and prompt cash flow.[emphasis added] It is clear from this excerpt that the Act (and the adjudication mechanism found therein) is designed to facilitate the smooth and prompt cash flow of contractors in the construction industry. The statutory requirements to be fulfilled by a payment claim must therefore be viewed with this legislative purpose in mind. 77     Having regard to the purpose of the Act, I was of the view that on the facts before me, where a payment claim omitted the required details under regs 5(2)(c)(iii)–5(2)(c)(iv) of the SOPR, the breach of those provisions wouldnotrender the payment claim an invalid one. 78     Progress Claim No 9 was found wanting in detail with respect to regs 5(2)(c)(iii)–5(2)(c)(iv) of the SOPR. But this claimdidfulfil the requirements in s 10(3)(a) of the Act and regs 5(2)(a), 5(2)(b) and 5(2)(c)(i)–5(2)(c)(ii) of the SOPR. Ordinarily, a respondent receiving a payment claim with some, but not all, of the details required under reg 5(2)(c) of the SOPR will have enough information at his disposal to decide on his next course of action. In this case, APCD could have issued a payment response denying that the Variation Works were done and/or stating that there was insufficient information relating to the Variation Works. Put in another way, the lack of detail here did not in itself prejudice APCD in that it did not preclude a response from APCD. It was under these circumstances that I did not think that it was the legislative purpose to invalidate Progress Claim No 9 for failing to comply with regs 5(2)(c)(iii)–5(2)(c)(iv) of the SOPR. 79     I note separately that APCD could possibly have sought clarification on Progress Claim No 9 from ATP under s 12(4)(a) of the Act during the dispute settlement period (as defined in s 12(5) of the Act). APCD did not appear to have done this. 80     To hold Progress Claim No 9 invalid for breaching regs 5(2)(c)(iii)–5(2)(c)(iv) of the SOPR would not appear to be consonant with the ideals and purpose of the Act. It would be all too easy to invalidate a payment claim for a lack of detail. In my view, the requirement to provide details in a payment claim is to facilitate the implementation of the adjudication scheme in the Act, but not to trip up claimants. It seems to me that the requirements to state the quantity of each item claimed and the calculations showing how the claimed amount is derived are only a guide for the claimant, since there are conceivablyotherimportant details to be submitted in a payment claim which are not expressly stated in reg 5(2)(c) of the SOPR. One example would be the location of the work done. It is pertinent to note here that reg 5(2)(c) of the SOPR states that details “including” [emphasis added] the ones stipulated therein should be set out in a payment claim. The details to be provided are therefore in no way exhaustively set out in reg 5(2)(c) of the SOPR. In view of this, it would seem incongruous that an omission to state, say, the quantity of the items claimed is fatal to the validity of a payment claim, whereas an omission to state the location where the work was done would not be fatal. It might be argued in response that the details expressly stipulated in reg 5(2)(c) of the SOPR have been legislatively determined to be more important and therefore warrant a difference in treatment. While I agree that the four limbs of that provision may arguably be said to have set out the more important details, I was not convinced, having regard to the important fact that the Legislature made the list set out in that provision only aninclusivelist, that a failure to state the details in regs 5(2)(c)(iii)–5(2)(c)(iv) of the SOPR would invalidate a payment claim. Accordingly, ATP’s omission to provide some of the statutorily-required details in the case before me did not invalidate Progress Claim No 9. 81     In the circumstances of this case, therefore, I found regs 5(2)(c)(iii)–5(2)(c)(iv) of the SOPR not to be so important that it was the legislative purpose that an act done in breach of these provisions should be invalid. Progress Claim No 9 was therefore not an invalid payment claim, and the Adjudication Determination could not be set aside on this ground.",
        "Conclusion": "82     For all the reasons detailed above, I dismissed APCD’s application to set aside the Adjudication Determination and the AR’s order, with costs fixed at $13,000 against APCD plus reasonable disbursements to be agreed or fixed by the court.  [note: 1]Defendant’s Submissions (“DS”) at paras 42–47. [note: 2]DS at paras 48–49. [note: 3]DS at para 52. [note: 4]DS at paras 53–54. [note: 5]DS at paras 55–58. [note: 6]DS at paras 59–61. [note: 7]DS at para 40. [note: 8]DS at paras 28–39. [note: 9]Plaintiff’s Bundle of Cause Papers, p 118. [note: 10]DS at para 52. [note: 11]Plaintiff’s Bundle of Cause Papers, p 118. [note: 12]Plaintiff’s Bundle of Cause Papers, p 118. [note: 13]Plaintiff’s Bundle of Cause Papers, p 129."
    }
}