{
    "case_title": "Li Weiming and other matters\n      v\n      Public Prosecutor",
    "ncitation": "[2013] SGHC 69",
    "coram": "Chao Hick Tin JA",
    "sections": {
        "Introduction": "1       These three criminal revision applications were\n                    filed pursuant to s 404 of the Criminal Procedure Code 2010 (Act 15 of\n                    2010) (“CPC 2010”) by three petitioners seeking the revision of\n                    orders made by the District Court on 23 November 2012. The underlying legal\n                    dispute revolved around the Prosecution’s discovery obligations under the\n                    Criminal Case Disclosure Conference (“CCDC”) regime introduced by\n                    the CPC 2010. In particular, it pertained to the extent to which the summary of\n                    facts in the disclosed Case for the Prosecution had to contain particulars\n                    “in support of” the charge.",
        "The parties to the dispute": "2       The 1st petitioner, Mr Li Weiming (alias\n                    Stephen), was an employee of ZTE Corporation (“ZTE”) in 2006 and\n                    was ZTE’s chief representative for Brunei, Papua New Guinea and the South\n                    Pacific Islands from 2010.[note: 1]ZTE is\n                    headquartered in Shenzhen, the People’s Republic of China, and is a large\n                    vendor of information technology (“IT”) and telecommunications\n                        equipment.[note: 2]Sometime in 2010, ZTE was awarded a project worth US$35m as the main contractor\n                    for an ambitious community college project in Papua New Guinea. The project\n                    envisioned the creation of a virtual university network anchored by 89 community\n                    colleges throughout the country.[note: 3]All three petitioners were\n                    involved in the discussions which led to the award of the project to\n                ZTE. 3       The 2nd petitioner, Ms Lim Ai Wah, is the\n                    director of Questzone Offshore Pte Ltd (“Questzone”), a British\n                    Virgin Islands company of which she is the sole member apart from her sister,\n                    Ms Lim Swee Kheng, who is a nominal director.[note: 4]Questzone was allegedly set up for the sole\n                    purpose of receiving commission payments from ZTE arising from the award of the\n                    community college project in Papua New Guinea.[note: 5] 4       The 3rd petitioner, Mr Thomas Philip\n                    Doehrman, is Ms Lim Ai Wah’s husband. He assists the Papua New Guinea\n                    government under a trust for the community college project (“the ITE\n                        trust”).[note: 6]Together with the 2nd petitioner, he is\n                    also a director of Quest Petroleum (Singapore) Pte Ltd (“Quest\n                    Petroleum”), which provides consultancy, natural resource, IT and mining\n                    services to foreign companies.[note: 7]Quest Petroleum was created in the late 1990s\n                    when the 3rd petitioner began to conduct business in Papua New\n                        Guinea.[note: 8]",
        "The charges": "5       Each of the petitioners faces six charges. These\n                    consist of a single charge under s 477A read with s 109 of the Penal\n                    Code (Cap 224, 2008 Rev Ed) (“Penal Code”), and five\n                    charges under s 47(1)(b) of the Corruption,\n                    Drug Trafficking and Other Serious Crimes (Confiscation of Benefits) Act\n                    (Cap 65A, 2000 Rev Ed) (“CDSA”). 6       The charge under s 477A of the Penal Code\n                    (“s 477A PC”) relates to an alleged conspiracy between the\n                    petitioners to issue an invoice dated 15 July 2010 that “falsely\n                    purported to seek payment to Questzone as a sub-contractor under a fictitious\n                        sub-contract”.[note: 9]This invoice was\n                    issued by Questzone to ZTE. The CDSA charges pertain to five separate payments\n                    made by Questzone to the petitioners out of the proceeds gained from the\n                    s 477A PC offence.",
        "The prelude to the present applications": "7       The Case for the Prosecution in respect of the\n                    charges brought against each of the petitioners was filed and served on\n                    13 September 2012. Each Case for the Prosecution contained the relevant\n                    charges, a list of witnesses, a list of exhibits, statements from the petitioner\n                    charged and a summary of facts. 8       The summary of facts for the s 477A PC\n                    charge replicated the charge apart from additional details as to the events\n                    which followed from the alleged offence. It stated that sometime in July 2010,\n                    the 2nd petitioner passed the allegedly falsified invoice dated 15 July\n                    2010 to the 1st petitioner in Singapore, which the 1st petitioner then forwarded\n                    to ZTE’s Singapore branch office. Further:[note: 10] … On or about 31 July 2010, having approved the payment of\n                        US$3.6 million to Questzone in accordance with the Invoice and the\n                        fictitious contract between ZTE and Questzone, ZTE effected the said payment\n                        of US$3.6 million through its Hong Kong subsidiary, ZTE (HK) Limited\n                        via a telegraphic transfer to Questzone’s Standard Chartered Bank\n                        Account (account number: [xxx]) in Singapore (“the Questzone\n                        account”). 9       Each of the summaries of facts for the remaining\n                    five charges under the CDSA was completely identical to the corresponding\n                    charge, and included no additional particulars. 10     On 11 October 2012, each of the\n                    petitioners brought an application under s 162(b) read with s 169(2) of the CPC 2010 seeking either a\n                    discharge not amounting to an acquittal (“DNAQ”) or an order for\n                    further particulars. Each application was predicated upon the\n                    Prosecution’s purported failure to comply with the requirements of\n                    s 162 of the CPC 2010 in its disclosed summary of facts. The further\n                    particulars sought related to three key issues: (a)     the party whom the petitioners had\n                        allegedly conspired to defraud; (b)     the reasons why the sub-contract between ZTE and\n                        Questzone was allegedly fictitious; and (c)     details of the alleged conspiracy between the\n                        petitioners. 11     The applications were dismissed by the\n                    District Court, albeit with an acknowledgement that valid issues had been raised\n                    which should be dealt with by the trial judge. This led to the\n                    petitioners’ present applications to the High Court for a revision of the\n                    District Court’s order. 12     After hearing submissions from the respective\n                    parties, I ordered further particulars in relation to issues (a) and (b) as\n                    stated in [10] above, but not in relation to issue (c). I now offer the\n                    reasons for my decision.",
        "The relevant legal provisions": "13     The rules governing the CCDC procedure are set\n                    out in s 162 of the CPC 2010, which provides that: Contents of Case for the\n                            Prosecution 162.    The Case for the Prosecution must\n                            contain — (a)    the charge which\n                                the prosecution intends to proceed with at the trial; (b)a summary of the facts in support of the\n                                    charge; (c)    a list of the\n                                names of the witnesses for the prosecution; ... [emphasis added] 14     Illustration (b) to s 162 offers an example of the application of\n                    s 162 to charges involving conspiracy. However, it will be seen that while\n                    this illustration is not precisely on point as far as issues (a) and (b) as\n                    stated in [10] above are concerned (see [32] below), it is clearly germane to\n                    issue (c) as stated in [10] above. Illustration (b) reads as follows: (b)Ais charged\n                            with conspiracy to cheat together with a known person and an unknown\n                            person. The summary of facts should state — (i)    when and where the conspiracy took place;\n                                and (ii)   who the known conspirators were and what they\n                                did. 15     15 It should also be noted that the\n                    requirement of a summary of facts for the Prosecution is only applicable for\n                    cases heard in the Subordinate Courts. When a case is to be tried in the High\n                    Court, the committal hearing procedure applies and no summary of facts needs to\n                    be tendered after the committal of the accused for trial, although\n                        s 188(4)(l) of the CPC 2010 requires all\n                    written statements which will be used as evidence to be disclosed to the\n                    Defence.",
        "Background to the CCDC regime": "16     The CCDC regime was brought into being by the\n                    CPC 2010, which ushered in a new era of pre-trial criminal discovery. At the\n                    second reading of the Criminal Procedure Code Bill 2010 (Bill 11 of 2010),\n                    which was eventually enacted as the CPC 2010, the Minister for Law,\n                    Mr K Shanmugam (“the Minister”), offered the following\n                    exposition on the objectives of the new disclosure procedure (seeSingapore Parliamentary Debates, Official Report(18 May 2010) vol 87 at col 487): Disclosure is familiar to lawyers operating within the common law system.\n                        In civil proceedings, the timely disclosure of information hashelped parties to prepare for trial and assess their cases more\n                            fully. Criminal cases can benefit from the same\n                            approach. However, discovery in the criminal context would\n                        need to be tailored to deal with complexities of criminal practice, such as\n                        the danger of witnesses being suborned. To this end, Part IX of the Bill introduces a formalised framework\n                        obliging the prosecution and the defence to exchange relevant information\n                        about their respective cases before trial. This will introducegreater transparency and consistency to the pre-trial\n                            process. ... The framework has a number of safeguards to try and prevent abuse. The\n                        sequential nature of the process protects the interests of [the] prosecution\n                        and [the] defence. The onus is on the prosecution to set out its case first,\n                        with the accused’s statements that it is relying upon. The provision\n                        of all statements after the defence case is filed cuts down on opportunities\n                        to tailor evidence. At the same time, if either party refuses to file its\n                        case, or files an incomplete case, or advances an argument at trial\n                        inconsistent with its previously filed case, the Court may draw any\n                        inference it deems fit. In addition, where the prosecution fails to comply\n                        with its obligations, the Court may order a discharge not amounting to an\n                        acquittal. This approach tries to ensure thatparties\n                            take discovery seriously. [emphasis added] 17     I have quoted these comments of the Ministerin extensobecause they offer the context\n                    within which to interpret the requirement in s 162(b) of the CPC 2010 that the summary of facts in the Case for the\n                    Prosecution should be “in support of the charge”. It is trite that\n                    the court should interpret a provision of a written law in a manner which\n                    promotes the purpose or object underlying that written law (see s 9A of the\n                    Interpretation Act (Cap 1, 2002 Rev Ed) andPublic\n                        Prosecutor v Low Kok Heng[2007] 4 SLR(R) 183 at\n                    [39]–[49]). The Minister’s comments reveal unequivocally that the\n                    CCDC regime was intended to precipitate a sea change in the criminal discovery\n                    process, with the tide shifting towards greater transparency and parity between\n                    the parties so as to help them prepare for trial. The requirement for a summary\n                    of facts in the Case for the Prosecution is one element in this climactic\n                    change. It is also noteworthy that the Case for the Prosecution is served before\n                    the Case for the Defence, and, significantly, the CPC 2010 does not extend the\n                    discretion to opt out of the CCDC process to the Prosecution. The Case for the\n                    Prosecution therefore sets the tone both practically and figuratively for the\n                    entire CCDC regime. 18     As I see it, the express requirement that a\n                    summary of facts be included in the Case for the Prosecution must have beenfor a purpose. It is a basic premise of\n                    statutory interpretation that Parliament does nothing in vain. This was applied\n                    by the English Court of Appeal as a “presumption” inHalki Shipping Corporation v Sopex Oils Ltd[1998]\n                    1 WLR 726 at 749 and as a “rule” inRegina\n                        v Richmond upon Thames London Borough Council, Ex parteWatson; Regina v Redcar and Cleveland Borough Council,\n                    Ex parteArmstrong; Regina v Manchester City\n                        Council, Ex parteStennett; Regina v Harrow\n                        London Borough Council, Ex parteCobham[2001] QB 370 at 385. The same proposition has also been\n                    expressly applied by our High Court inWong Seng Kwan v\n                        Public Prosecutor[2012] 3 SLR 12 at [42] and [51] andRamanathan Yogendran v Public Prosecutor[1995] 2 SLR(R) 471 (“Ramanathan”). In the latter case, Yong Pung How CJ\n                    stated at [72] that: … [T]he approach suggested by the Prosecution accords with the\n                        accepted principles of statutory construction (seeCraies, Statute Law(7th Ed, 1971)). A purposive\n                        approach to construction will be adopted where the meaning of the provision\n                        is not plain or is ambiguous. This approach embraces the maxim,ut res magis valeat quam pereat– words should\n                        be construed so as to give a sensible meaning to them. The courts should\n                        desist from treating words as surplusage or void. ... 19     F A R Bennion, the learned\n                    author ofBennion on Statutory Interpretation: A\n                        Code(LexisNexis, 5th Ed, 2008) (“Bennion”), at p 1000, offers the following\n                    guidance: Futile or pointless\n                        resultParliament does nothing in vain, a principle\n                        also expressed aslex nil frustra facit(the\n                        law does nothing in vain). It is an old maxim of the law thatquod vanum et inutile est, lex non requirit(the law\n                        does not call for what is vain and useless). Or as it is put in another\n                        form:lex non praecipit inutilia(the law does\n                        not demand the doing of useless things). ‘The law never compels a\n                        person to do that which is useless and unnecessary.’ Through the\n                        inevitable limitations of language, it sometimes nevertheless happens that,\n                        in the events that have occurred in the instant case, the literal meaning of\n                        the enactment seems to demand the doing of something that would be futile or\n                        pointless. Here the court will strive to find a more sensible\n                        construction. 20     The court would be remiss to treat the summary\n                    of facts in the Case for the Prosecution in a manner which relegates it to\n                    redundancy. The converse, however, also holds true – the summary of facts\n                    ought not to be invested with a significance which oversteps the intentions of\n                    Parliament in introducing the CCDC regime. A balance must be found between these\n                    two extremes, bearing in mind that the object of the CCDC regime is to\n                    facilitate the trial such that the accused will know the case which he has to\n                    meet, and such that the Prosecution will not be caught off-guard by the defence\n                    which the accused will raise. To this end, I would think that at the very least,\n                    the summary of facts should not be crafted in such a way, or contain only such\n                    barest of facts, as to leave the opposing party or parties vulnerable to being\n                    taken by surprise at the trial.",
        "Consequences of non-compliance with the CCDC regime": "21     Section 169 of the CPC 2010 expressly\n                    stipulates that: 169.—(1) The court\n                        may draw such inference as it thinks fit if — (a)    the prosecution\n                                fails to serve the Case for the Prosecution on the accused or the\n                                defence fails to serve the Case for the Defence after the Case for\n                                the Prosecution has been served on him; (b)    the Case for the\n                                Prosecution or the Case for the Defence does not contain any or any\n                                part of the items specified in section 162 or 165(1),\n                                respectively; or (c)    the prosecution\n                                or the defence puts forward a case at the trial which differs from\n                                or is otherwise inconsistent with the Case for the Prosecution or\n                                the Case for the Defence, respectively, that has been\n                            filed. (2)    If the prosecution fails to serve the Case for the\n                            Prosecution in respect of any charge which the prosecution intends to\n                            proceed with at trial within the time permitted under section 161\n                            or the Case for the Prosecution does not contain any or any part of the\n                            items specified in section 162, a court may order a discharge not\n                            amounting to an acquittal in relation to the charge. 22     It was argued by the petitioners that in\n                    omitting to provide particulars on key issues, the Prosecution had effectively\n                    failed to disclose “part ofthe [summary of\n                    facts]” [emphasis added] for the purposes of ss 169(1)(b) and 169(2). 23     The Prosecution’s response thereto\n                    consisted of three interconnected arguments. First, it was contended that the\n                    disclosed summary of facts did comply with the requirements of s 162 of the\n                    CPC 2010. Second, even if there had been non-compliance with s 162, the\n                    court did not have any jurisdiction to order further particulars. Third,\n                    recourse for any breach of the Prosecution’s discovery obligations should\n                    be left to the trial judge, who could draw the necessary adverse inferences in\n                    accordance with s 169. 24     I will first address the second and third\n                    arguments of the Prosecution as they are more closely related. Section 404\n                    of the CPC 2010 empowers the High Court to revise orders made at any\n                    CCDC: 404.—(1) The High Court may, on\n                        its own motion or on the application of the Public Prosecutor or the accused\n                        in any criminal case disclosure conference, call for and examine the record\n                        of any criminal case disclosure conference held under Part IX or X\n                        before a Magistrate, a District Judge, the Registrar of the Subordinate\n                        Courts or the Registrar of the Supreme Court to satisfy itself as to thecorrectness, legality or propriety of any\n                        order recorded or passed at the criminal case disclosure conference, and as\n                        to the regularity of the criminal case disclosure conference. … [emphasis added] 25     I note that while the order which was the\n                    subject of the present criminal revision applications was not madeatorduringa CCDC, it\n                    was nevertheless made at a hearing of applications brought under\n                        ss 162(b) read with 169(2) of the CPC\n                    2010. Such applications should be regarded as a continuation of the CCDC. It\n                    would run contrary to the spirit of s 404 to say that an order made upon\n                    such applications would not fall within the scope of the High Court’s\n                    revisionary powers as such applications are very much part and parcel of the\n                    CCDC process. I should mention that although this specific point was not taken\n                    by the Prosecution, I thought I should nevertheless allude to it. In this\n                    regard, I would reiterate the legal adage that the court should look at\n                    substance rather than form, a principle which has been applied across a wide\n                    range of cases (seeThe “Andres\n                        Bonifacio”[1993] 3 SLR(R) 71 at [42],Panwah Steel Pte Ltd v Koh Brothers Building & Civil\n                        Engineering Contractor (Pte) Ltd[2006] 4 SLR(R) 571 at\n                    [19],Lock Han Chng Jonathan (Jonathan Luo Hancheng) v Goh\n                        Jessiline[2008] 2 SLR(R) 455 at [36] andAng Tin Yong v Ang Boon Chye and another[2012] 1 SLR 447\n                    at [15]) and which should be all the more important in the context of criminal\n                    procedure, like the CCDC, to ensure a fair trial. I would also add that s 6\n                    of the CPC 2010 provides for “such procedure as the justice of the case\n                    may require” to be adopted where no special provision has been made as\n                    regards any matter of criminal procedure – although I do not think that\n                    any such innovation is necessary in the present case. 26     In the present case, two sub-sections of\n                    s 404 of the CPC 2010 are particularly relevant: … (3)    On examining a record under revision in this\n                            Division [ie, Division 4 of\n                            Part XX of the CPC 2010], the High Court mayaffirm, vary or set asideany of the orders made by the\n                            Magistrate, District Judge, Registrar of the Subordinate Courts or\n                            Registrar of the Supreme Court, as the case may be, who presided over\n                            the criminal case disclosure conference. ... (5)    Where a case is revised under this Division, the\n                            High Court must certify its decision or order to the Magistrate,\n                            District Judge, Registrar of the Subordinate Courts or Registrar of the\n                            Supreme Court, as the case may be, who recorded or passed the order at\n                            the criminal case disclosure conference and that Magistrate, District\n                            Judge, Registrar of the Subordinate Courts or the Registrar of the\n                            Supreme Court, as the case may be,must make the\n                                requisite orders to give effect to the decision or\n                            order. [emphasis added] 27     Read in conjunction, ss 404(3) and 404(5)\n                    clearly demonstrate that the consequences of non-compliance as prescribed in\n                    s 169 cannot be exhaustive. A narrow reading would unduly constrict the\n                    revisionary jurisdiction of the High Court, which is widely framed under\n                    s 404(3). The phrasing of s 404(5), which expressly binds the\n                    presiding judicial officer to give effect to the High Court’s order, also\n                    militates against limiting the High Court’s powers to just the remedies\n                    available to the presiding judicial officer under s 169. 28     Second, the argument that any recourse for a\n                    lack of particulars should be deferred to the trial judge also detracts from the\n                    purpose of pre-trial criminal discovery. This is particularly so because the\n                    ability of the trial judge to draw adverse inferences will be frustrated or\n                    considerably hampered if the disclosed summary of facts is so bare that the\n                    Defence cannot contend that the Prosecution has done what\n                        s 169(1)(c) of the CPC 2010 proscribes,\n                    namely, put forward at the trial a case which “differs from or is\n                    otherwise inconsistent with” the Case for the Prosecution that was filed.\n                    It would be difficult, in these circumstances, to draw any adverse inference\n                    from an omission in the Case for the Prosecution. This will not be fair to the\n                    Defence. Moreover, the difficulty of drawing an adverse inference will\n                    effectively place the trial judge in the invidious position of having to choose\n                    between either the drastic option of ordering a DNAQ so as to hold the\n                    Prosecution to its discovery obligations, or making no order to penalise the\n                    Prosecution for non-compliance with the same. Should these be the only\n                    meaningful options available to the court, then curial supervision over the CCDC\n                    process would be rendered anaemic and the stated objective of greater\n                    transparency would be thwarted. In any event, it seems to me to be reasonable\n                    for a court which intends to order a DNAQ to offer the Prosecution a final\n                    opportunity to meet its discovery obligations. This would not be possible if\n                    s 169 is taken as exhaustive of all the remedies which a court can order\n                    for non-compliance with the CCDC regime. 29     If, as the Minister said, parties are to\n                    “take discovery seriously” (see [16] above), then the court must\n                    be involved at the preliminary stages to ensure that the CCDC regime is\n                    effective in helping parties to prepare for trial. Taking the provisions in\n                    Parts IX and XX of the CPC 2010 in their totality, it can be seen that the\n                    invocation of the High Court’s revisionary power in s 404 (which\n                    falls under Part XX of the CPC 2010) serves to facilitatecompliancewith the criminal discovery process, whilst\n                    s 169 (which falls under Part IX of the CPC 2010) provides for the\n                    consequences which flow from parties’non-compliancewith the same. Effect must be given\n                    to both ss 169 and 404, and they must be construed harmoniously. Such an\n                    approach is exemplified by the decision of the Court of Criminal Appeal inPublic Prosecutor v Kwan Richard[1968–1970] SLR(R) 846, where the court was presented with three\n                    ostensibly mismatched provisions relating to the jurisdiction of a\n                    Magistrate’s Court to try an offence under s 420 of the Penal Code\n                    (Cap 119, 1955 Rev Ed) (“the 1955 Penal Code”), which\n                    offence was punishable with imprisonment of up to seven years as well as with\n                    fine. In gist, s 9(1)(a) of the Criminal\n                    Procedure Code (Cap 132, 1955 Rev Ed) (“the CPC 1955”)\n                    limited a Magistrate’s Court’s criminal jurisdiction to offences for\n                    which the maximum imprisonment term did not exceed three years and offences\n                    which were punishable only with fine, whilst s 10(1) provided that\n                    “[s]ubject to the other provisions of this Code”, the same court\n                    could try offences by reference to the eighth column of Schedule A to the\n                    CPC 1955, which column included the offence under s 420 of the 1955 Penal\n                    Code. At the same time, s 11 of the CPC 1955 stipulated that the Public\n                    Prosecutor’s written authorisation was required for a Magistrate’s\n                    Court to try an offence which was triable only by a District Court under\n                    s 10. 30     The accused argued that ss 9 and 10 of\n                    the CPC 1955 were irreconcilable in relation to the offence under s 420 of\n                    the 1955 Penal Code, and that the authorisation of the Public Prosecutor under\n                    s 11 of the CPC 1955 was required before a Magistrate’s Court would\n                    have the jurisdiction to try him for that offence. Upon the Prosecution’s\n                    application, the question of whether a Magistrate’s Court had jurisdiction\n                    to try an offence under s 420 of the 1955 Penal Code without the\n                    authorisation of the Public Prosecutor under s 11 of the CPC 1955 was\n                    reserved for the Court of Criminal Appeal’s decision. The court held (at\n                    [11]) that: It is said that s 9(1)(a) and\n                        s 10[(1)] in so far as they confer jurisdiction on a Magistrate’s\n                        Court are irreconcilable. We do not agree and in our judgment they are\n                        reconcilable if s 9(1)(a) is construed as\n                        a provision which deals with the general jurisdiction of a\n                        Magistrate’s Court in regard to all offences under any written law in\n                        force for the time being and s 10[(1)] is construed as a provision\n                        which deals with Penal Code offences only and specifically sets out the\n                        court or courts which has or have jurisdiction in respect of each Penal Code\n                        offence. 31     In adopting such an approach, the court sought\n                    to apply all the relevant provisions in a complementary and harmonious fashion\n                    guided by the purpose of the statute. A similar ethos is also discernible in\n                    Yong Pung How CJ’s decision inRamanathanat [72] (see [18] above) and the Court of\n                    Appeal’s decision inQuek Hock Lye v Public\n                        Prosecutor[2012] 2 SLR 1012 at [29]. In addition, helpful\n                    guidance can also be found inBennionat\n                    p 559: Theut res magisprinciple\n                        requires inconsistencies within an Act to be reconciled. Blackstone\n                        said: ‘One part of the statute must be so construed by another, that\n                            the whole may, if possible, stand:ut res magis\n                                valeat quam pereat.’ The principle also means that,if the obvious intention\n                            of the enactment gives rise to difficulties in implementation, the court\n                            must do its best to find ways of resolving these. [emphasis added] 32     In my opinion, the omission of key particulars\n                    would constitute a failure to provide “part of the [summary of\n                    facts]” for the purposes of ss 169(1)(b) and 169(2) of the CPC 2010. The Prosecution cannot claim that\n                    it has complied with s 162(b) so long as it\n                    has merely nominally included a summary of facts, as s 162(b) expressly imposes a substantive requirement that the\n                    summary of facts be “in support of the charge”. It is a trite\n                    proposition that a charge must contain all the essential ingredients of the\n                    alleged offence so as to give the accused person notice and a chance to defend\n                    himself (seeAssathamby s/o Karupiah v Public\n                        Prosecutor[1998] 1 SLR(R) 1030 at [9]). This entails that\n                    the charge must contain particulars relating to the time and place of the\n                    alleged offence, as well as the person or thing against whom or in respect of\n                    which the alleged offence was committed (see s 124 of the CPC 2010). If\n                    necessary, the charge must also contain details as to how the alleged offence\n                    was committed (see s 125 of the CPC 2010). The summary of facts tendered by\n                    the Prosecution should therefore reinforce the particulars already contained in\n                    the charge, and offer further notice and clarity of the case which the Defence\n                    is to answer. It follows that in most cases, the summary of facts will have to\n                    elaborate on rather than replicate the charge. In this regard, it appears that\n                        Illustration (b) to s 162 of the CPC\n                    2010 (see [14] above) is of limited help in the specific context of the present\n                    s 477A PC charge against each of the petitioners.\n                        Illustration (b) represents the minimum\n                    content to be contained in a summary of facts where s 109 of the Penal Code\n                    (“s 109 PC”) is engaged, and does not offer further guidance\n                    as to what else is to be included. In the present case, details as to where and\n                    when the alleged conspiracy occurred, who the known conspirators were and what\n                    they did –viz, the minimum details required by\n                        Illustration (b) – were already\n                    contained in the s 477A PC charge against each petitioner. It is\n                        Illustration (a) to s 162 of the CPC\n                    2010, instead, which is more useful in relation to the primary s 477A PC\n                    charge, as distinct from the secondary liability imposed by s 109 PC.\n                        Illustration (a) to s 162 of the CPC\n                    2010 states that: (a)Ais charged with theft of a shirt from a shop. The\n                            summary of facts should state the facts in support of the charge, for\n                            example, thatAwas seen taking a shirt in\n                            the shop and putting it into his bag, and thatAleft the shop without paying for the\n                        shirt. 33     This clearly demonstrates that the summary of\n                    facts must present a more complete picture of the primary offence in order to be\n                    “in support of the charge”.",
        "The particulars sought by the petitioners": "",
        "Nature of the offence under s 477A PC": "34     In order to determine whether the summary of\n                    facts tendered by the Prosecution in this case operated “in support\n                    of” the s 477A PC charge faced by each of the petitioners, the\n                    nature of the alleged offence is critical. It is an essential ingredient of the\n                    s 477A PC offence that the accused possessed the “intent to\n                    defraud”. The Explanation in s 477A PC stipulates that: Explanation—. —It shall be\n                        sufficient in any charge under this section to allege a general intent to\n                        defraud without naming any particular person intended to be defrauded, or\n                        specifying any particular sum of money intended to be the subject of the\n                        fraud or any particular day on which the offence was committed.",
        "Details of the party intended to be defrauded and the sub-contract\n                between ZTE and Questzone": "35     I note that inPhang Wah\n                        and others v Public Prosecutor[2012] 1 SLR 646\n                        (“Phang Wah”) at [61], Tay Yong\n                    Kwang J observed that: ... [T]he explanatory note to s 477A makes it clear that it is\n                        sufficientto assert a general intent to\n                            defraudwithout naming any particular person intended to be\n                        defrauded or specifying any particular sum of money intended to be the\n                        subject of the fraud ... [emphasis added] 36     InPhang Wah,\n                    the dispute centred on whether the accused knew how much he would gain by his\n                    deception, and not on the identity of the party deceived. The considerations are\n                    different in the latter case, and a more nuanced approach might be called for.\n                    The explanatory statement in s 477A PC undoubtedly serves to cover cases\n                    where the deception is directed indiscriminately at the general public. The\n                    paradigm case would perhaps be the falsification of company accounts to create a\n                    misleading picture of the company’s health to public investors. Counsel\n                    for the petitioners also suggested the example of Internet scams which are\n                    directed towards web users at large. The present case could not be said to be\n                    even remotely similar to such situations. The petitioners were alleged to have\n                    falsified an invoice which was issued to a company with whom they had prior\n                    dealings. In the case of the 1st petitioner, that company was the company which\n                    employed him. It was evident that the allegedly falsified invoice dated\n                    15 July 2010 was not purely speculative. Indeed, the summary of facts did\n                    not state that the petitioners had falsified that invoice with a general intent\n                    to defraud (as would be the case in a public scam). However, it was also silent\n                    as to the person or entity deceived. 37     The summary of facts was also equally silent\n                    as to how and why the sub-contract between ZTE and Questzone was fictitious.\n                    Presumably, the alleged falsity of the invoice dated 15 July 2010 was\n                    predicated on the alleged “fictitiousness” of the sub-contract, so\n                    that the two matters were interlinked. It was peculiar that according to the\n                    charge and the summary of facts, a false invoice had been issued pursuant to a\n                    fictitious sub-contract where the recipient of the invoice knew, and was known\n                    by, the issuer. This suggested that the person defrauded was a third party to\n                    the transaction. In the course of oral submissions before me, the Prosecution\n                    stated that the defrauded party could be either ZTE or the Papua New Guinea\n                    government. The Prosecution’s written submissions before me also revealed\n                    allegations that Questzone had been set up as a shell company to perpetuate the\n                    conspiracy. It was apparent that the Prosecution did have a factual gap which it\n                    needed to plug in its summary of facts. At para 5 of the\n                    Prosecution’s written submissions, it was stated that the\n                    petitioners: … came up with a scheme to set up a shell company, [Questzone],\n                        which purported to invoice ZTE for various sub-contracted works ... In\n                        reality, no sub-contracted works were carried out by Questzone and the\n                        invoices submitted by Questzone were falsified documents. At para 41 of the same submissions, the Prosecution averred that\n                    from a review of the petitioners’ statements: … [I]t can be seen that [the petitioners] were all party to an\n                        agreement to get money from ZTE via an invoice from a shell company,\n                        Questzone; and that the invoice would falsely represent to ZTE that payment\n                        was due under a contract between ZTE and Questzone when the alleged contract\n                        was no more than a fiction. … These were factual propositions which supported the s 477A PC\n                    charge by offering forensic details of the alleged deception, and they should\n                    have been included in the Case for the Prosecution. Intent to defraud 38     Section 477A PC is derived from the\n                    equivalent provision in India’s Penal Code (Act No 45 of 1860).\n                    Although s 477A PC has remained substantively unchanged since the enactment\n                    of our Penal Code, the core concept of “intent to defraud” has not\n                    received much analysis in our courts. The usual approach has been to adopt the\n                    meaning ascribed to the phrase in other areas of the law. For example, inGoh Kah Heng (alias Shi Ming Yi) v Public Prosecutor and\n                        another matter[2010] 4 SLR 258 (“Goh Kah Heng”), Tay Yong Kwang J agreed at [42] with\n                    the approach adopted inPublic Prosecutor v Chow Wai\n                        Lam[2006] SGDC 1 at [47]–[52]. The latter case related to\n                    “intent to defraud” in the context of s 406(c) of the Companies Act (Cap 50, 1994 Rev Ed).\n                    The parties have also citedLaw Society of Singapore v\n                        Nor’ain bte Abu Bakar and others[2009] 1 SLR(R) 753,\n                    in which the Court of Three Judges stated that: 44    ... InSeet Soon Guan v Public Prosecutor[1955] MLJ\n                            223 at 225, Buhagiar J, after examining the local and Indian cases\n                            and also the Indian and Malay States’ contract legislation, held\n                            (at 228) that a person would have acted fraudulently or with intent to\n                            defraud under the Malaysian equivalent of s 25 of the Penal Code\n                            if: ... he acts with the intention that some person be deceived and by\n                            means of such deception that either an advantage should accrue to him or\n                            injury, loss or detriment should befall some other person or\n                            persons. 45    The same meaning is given to the definition in the\n                            Penal Code (Act No 45 of 1860) (India) by the Indian Supreme Court\n                            inS P Chengalvaraya Naidu v\n                                JagannathAIR 1994 SC 853.\n                        … Section 25 of the Penal Code sets out the meaning of the term\n                    “fraudulently”, and provides that “[a] person is said to do\n                    a thing fraudulently if he does that thing with intent to defraud, but not\n                    otherwise”. 39     In the present case, the meaning of the phrase\n                    “intent to defraud” must be interpreted within the specific\n                    context of s 477A PC, and must also take cognisance of the effect of the\n                    explanatory statement in that section. The difficulty with the exposition in the\n                    cases cited above is that these cases adopt a general analysis that does not\n                    contemplate the possibility of an amorphous intent to defraud, which scenario is\n                    specifically catered for in s 477A PC. 40     In contrast, the Indian courts have developed\n                    a more detailed jurisprudence on the particular meaning to be ascribed to the\n                    phrase “intent to defraud” in the context of their equivalent of\n                    s 477A PC. InSHarnam Singh v The StateAIR 1976 SC 2140\n                        (“Harnam Singh”), the Indian\n                    Supreme Court held that the words “intent to defraud” contained\n                    two elements – deceit and injury: 18.    ... The Code does not contain any precise and\n                            specific definition of the words “intent to defraud”.\n                            However, it has been settled by a catena of authorities that\n                            “intent to defraud” contains two elements viz., deceit and\n                            injury. A person is said to deceive another when by practising\n                            “suggestio falsi”or “suppressio veri”or both he intentionally induces another\n                            to believe a thing to be true, which he knows to be false or does not\n                            believe to be true, “Injury” has been defined in\n                            Section 44 of the Code as denoting “any harm whatever\n                            illegally caused to any person, in body, mind, reputation or\n                            property.” 19.    The burden of [the appellant’s\n                            counsel’s] argument is that the prosecution had not established\n                            these elements beyond reasonable doubt. It is maintained that there was\n                            no ‘deceit’ because the appellant did not conceal the fact\n                            that he was making the entries meant for the 10th January on the\n                            11th January. In this connection, reference has been made to the\n                            endorsements and the entries on the Forwarding Notes relating to these\n                            goods, which were manifestly made on the 11th. It is further submitted\n                            that there wasno intent to cause wrongful gain or\n                                wrongful loss to any person either in particular or in\n                                general, and consequently the second element necessary to\n                            constitute a fraudulent intention did not exist. [emphasis added] 41     The cited passage makes it clear that the\n                    Prosecution must prove an intention to mislead as well as an intention to injure\n                    the interests of “any person either in particular or in general”\n                    (seeHarnam Singhat [19]). Section 477A PC\n                    does not contemplate a stand-alone offence for the wilful creation of a false\n                    document. As the learned authors ofRatanlal &\n                        Dhirajlal’s The Indian Penal Code(V R Manohar\n                    gen ed) (LexisNexis, 33rd Ed, 2010) put it at p 987: ... Though to come under the mischief of this section the entries have to\n                        be made ‘wilfully’ i.e., intentionally or deliberately, yet from\n                        the mere fact that the entries were made wilfully, it does not follow that\n                        the entries were so made “with intent to defraud” within the\n                        meaning of s. 477A [of the Indian Penal Code]. 42     The learned authors also offer insight into\n                    the legislative purpose of the Indian equivalent of s 477A PC at\n                    p 986: COMMENT.—This section refers to acts\n                        relating to book-keeping or written accounts. It makes the falsification of\n                        books and accounts punishable even though there is no evidence to prove\n                        misappropriation of any specific sum on any particular occasion. 43     This coheres with the account given in\n                    C K Thakker & M C Thakker,Ratanlal\n                        & Dhirajlal’s Law of Crimes: A Commentary on the Indian Penal\n                        Code, 1860(Bharat Law House, 26th Ed, 2007) at vol 2,\n                    p 2638: 3. Object.—This section was introduced\n                        by Act III of 1895, section 4. It is intended to meet a glaring\n                        defect in the law which was proved to exist inShama\n                            Churn Sen’scase, in which a man was charged with\n                        defrauding a bank to the extent of three lakhs of rupees. He was acquitted\n                        because it could not be shown that the three lakhs ha[d] been abstracted\n                        upon any one particular occasion or in any particular sum. The present\n                        section is intended to meet such cases and to make the falsification of\n                        books punishable even though no particular sum of money or particular\n                        occasion can be shown. It is, with some verbal alterations, the same in\n                        substance, as section 1 of the Falsification of Accounts Act,\n                        1875. 44     It would therefore appear that the practical\n                    emphasis of s 477A PC was placed more on relieving the Prosecution from\n                    having to prove a particular sum which had been misappropriated or a particular\n                    occasion on which money had been misappropriated, and less on not having to name\n                    the particular person intended to be defrauded. 45     It follows from these considerations that\n                    where a s 477A PC charge is involved, the Prosecution must present a\n                    specific case as to the nature of the accused’s fraudulent intention,\n                    including the person who was the object of the fraudulent intention, and cannot\n                    hide behind the explanatory note in s 477A PC to avoid taking a position.\n                    Equally, it is no answer to say that the petitioners in this case had intended\n                    only to gain an advantage for themselves, as this begs the question of whether\n                    such gain was obtained by a general deception or at the expense of a particular\n                    person or entity. In the present case, it appeared from the s 477A PC\n                    charge against each petitioner and the materials before the court that the\n                    alleged deception was intended to cause a wrongful gain or a wrongful loss in\n                    relation to a specific person or entity. Notably, as mentioned at [36] above,\n                    the Prosecution didnottake the position that the\n                    petitioners had acted with a general intent to defraud. That was not what each\n                    s 477A PC charge stated. The Prosecution’s refusal to specify the\n                    target of the petitioners’ alleged deception rested upon a conviction that\n                    it was, in any event, notlegally obligedto do\n                        so:[note: 11] ... [Section] 477A must be interpreted in light of the Explanation,\n                        which clearly states that a general intent to defraud suffices in the\n                        formulation of the charge, without naming any particular person intended to\n                        be defrauded. This being the case, it follows ineluctably that the Summary\n                        of Facts in support of the charge need not indicate any particular person\n                        intended to be defrauded. 46     The Indian authorities demonstrate that this\n                    conviction is mistaken. The wording of the explanatory statement in s 477A\n                    PC indicates that a person could be guilty of a charge under that section even\n                    though he does not have a specific individual or entity as the target of his\n                    fraud; it would suffice if he has a general intention to defraud. The\n                    explanatory statement should not be taken as providing a categorical general\n                    exemption from having to specify the particular individual or entity intended to\n                    be defrauded. In the present case, the Prosecution still had to specify whether\n                    each of the petitioners had acted with a general intention to defraudora particular intention directed at particular\n                    parties. If it was the latter, then those parties (whether persons or entities)\n                    had to be identified. However, and more importantly in the instant matter, it\n                    was not the Prosecution’s case that each of the petitioners had acted with\n                    a general intent to defraud. Indeed, there was no such assertion in each\n                    s 477A PC charge of a general intention to defraud on the part of each of\n                    the petitioners. 47     In the light of the foregoing analysis, it was\n                    clear to me that further particularisation of the party whom the petitioners had\n                    allegedly conspired to defraud, as well as of the allegedly\n                    “fictitious” sub-contract between Questzone and ZTE, had to be\n                    provided. Without such particulars, the Prosecution’s summary of facts\n                    could not be viewed as being “in support of” the specific\n                    s 477A PC charge faced by each of the petitioners. 48     As an aside, I would underscore the fact that\n                    without such particulars, the petitioners’ position would be prejudiced as\n                    they would be vulnerable to surprises at the trial. This had already been\n                    rehearsed at the hearing before me, when it was unexpectedly revealed that the\n                    Papua New Guinea government could have been one of the intended targets of the\n                    alleged fraud (see [37] above). Had this transpired at the trial, it would run\n                    counter to the object of the CCDC regime. Moreover, such an eventuality could\n                    likely cause disruption to the trial, which is an outcome that the CCDC regime\n                    was specifically created to prevent from happening. The evidence which an\n                    accused person will adduce and/or the witnesses whom he will call will depend on\n                    the case which he has to meet. For instance, if the Prosecution’s case was\n                    that the victim of the fraud was the Papua New Guinea government, then the\n                    evidence which each of the petitioners would adduce (including the witnesses\n                    whom each of them would call) could be very different. 49     I would further add that prejudice to the\n                    petitioners could surface evenbeforethe trial.\n                    In accordance with s 163 of the CPC 2010, the petitioners will each have to\n                    file a Case for the Defence after the further CCDC which is fixed not earlier\n                    than seven days from the date on which the Case for the Prosecution is filed\n                    (see s 161(4) of the CPC 2010). Section 165(1)(a) requires the petitioners to furnish “a summary of the\n                    defence to the charge and the facts in support of the defence”. To comply\n                    with their discovery obligations, the petitioners will have tospeculateabout what the Prosecution’s case would\n                    be and craft a summary of their defence in line with this. In doing so, they may\n                    have little option but to reveal where they expect their criminal liability to\n                    lie, and thereby jeopardise their privilege against self-incrimination. The CCDC\n                    regime, which is intended to create greater transparency and parity between the\n                    Prosecution and the Defence, may therefore end up being applied in a way which\n                    worksagainstthe petitioners’ interests.\n                    Our courts must be vigilant to ensure that rules of criminal procedure intended\n                    to introduce fairness into the criminal justice process do not end up being\n                    misapplied in the sense of being administered in a way which actually works to\n                    an accused’s detriment instead. Such vigilance against the misapplication\n                    of criminal procedure is not new to our courts – a similar concern with\n                    rules which were intended to benefit accused persons being used in a manner\n                    which transformed them into a “procedural trap” was also expressed\n                    by Yong Pung How CJ inTay Kok Poh Ronnie v Public\n                        Prosecutor[1995] 3 SLR(R) 545 at [48]. In contrast, it was\n                    not apparent what prejudice – either at or before the trial – would\n                    be borne or suffered by the Prosecution if it had to furnish the additional\n                    particulars set out at [10(a)] and [10(b)] above. There was no danger that\n                    witnesses would be suborned (see the Minister’s comments at [16] above),\n                    and the Prosecution did not allude to any peculiarities or sensitivities which\n                    would be adversely affected by the further disclosure which I\n                ordered.",
        "Details of the alleged\n                conspiracy": "50     The petitioners also sought further details of\n                    the alleged conspiracy between them (see item (c) of [10] above). The\n                    summary of facts replicated the s 477A PC charge in stating that the\n                    conspiracy arose “in mid-2010, in Singapore ... to falsify a paper\n                    belonging to [Questzone] wilfully and with intent to\n                        defraud”.[note: 12]On aprima\n                        facielevel, this fulfilled the key elements of an abetment by\n                    conspiracy, as held inLee Yuen Hong v Public\n                        Prosecutor[2000] 1 SLR(R) 604 at [38]: On a charge of abetment by conspiracy, the Prosecution has to\n                        establish the following elements: (a)    the person abetting must engage, with one or\n                                more other persons in a conspiracy; (b)    the conspiracy must be for the doing of the\n                                thing abetted; and (c)    an act or illegal omission must take place in\n                                pursuance of the conspiracy in order to the doing of that\n                                thing. 51     It is well-established that a conspiracy must\n                    also be founded upon a “meeting of the minds” amongst the\n                    conspirators. Such an agreement can be inferred from circumstantial evidence, as\n                    held inGoh Kah Hengat [40]. The\n                    Prosecution’s contention was that the circumstances which would add flesh\n                    to the bones of the alleged conspiracy in this case were contained in the\n                    petitioners’ statements as disclosed in the Case for the Prosecution. This\n                    was part of a wider proposition that the summary of facts should be read in\n                    conjunction with all the other items in the Case for the Prosecution. In other\n                    words, the adequacy of the Prosecution’s disclosure had to be assessed\n                    holistically. I saw some sense in this. On a purposive interpretation of\n                    s 162 of the CPC 2010, a balance must be struck between guarding against\n                    unwanted surprises at the trial and prematurely compelling parties to commit\n                    themselves to matters of detail. 52     In the present case, the Case for the\n                    Prosecution contained statements which made numerous allusions to meetings\n                    between the petitioners in Singapore in mid-2010. In particular, the 1st\n                    petitioner’s statement contained an account of a weekend discussion with\n                    the 3rd petitioner in April 2010 as well as a country club meeting with both the\n                    2nd and 3rd petitioners in May 2010.[note: 13]The subject discussed during these\n                    meetings was the payment of monies to the petitioners as commission for the\n                    award of the community college project in Papua New Guinea to ZTE. Following\n                    that, there were other occasions on which the petitioners talked about obtaining\n                    money from the ITE trust and how such money should be distributed.[note: 14] 53     Given the disclosure of these circumstances in\n                    the Case for the Prosecution, the petitioners could not claim that they would be\n                    taken by surprise at the trial. The information which they had at their disposal\n                    was more than sufficient to aid in the preparation of their defence in relation\n                    to the various elements of an abetment by conspiracy. Unlike the particulars\n                    sought in relation to the other two points set out at [10] above, the further\n                    information being asked for in terms of the details of the alleged conspiracy\n                    between the petitioners clearly relates to matters of detail which are not\n                    likely to have a substantive impact on the evidence which the petitioners would\n                    have to adduce and/or the witnesses to be called. In this regard, a distinction\n                    must be drawn between particulars which serve to clarify and give notice to the\n                    accused of the essential ingredients of the offence stated in the charge, and\n                    particulars which are not of such a nature. Although it must be acknowledged\n                    that this may prove to be a challenging distinction to draw at times, it is only\n                    the former category of particulars which should be included in a summary of\n                    facts in accordance with s 162 of the CPC 2010. In a broad sense, the\n                    particulars set out in each summary of facts in the present case met the\n                    requirements prescribed in Illustration (b)\n                    to s 162. Each summary of facts set out the time at which and the place\n                    where the conspiracy took place as well as the illegal act which was committed\n                    pursuant to that conspiracy,viz, the creation of\n                    the allegedly falsified invoice dated 15 July 2010. That said, I also note\n                    that the Prosecution did not disclose any particulars beyond the bare minimum\n                    required by Illustration (b) to s 162.\n                    While I had some reservations about the Prosecution’s lack of earnestness\n                    in this regard, I did not think that this would cause undue prejudice to the\n                    petitioners on a holistic assessment of what had been disclosed in the Case for\n                    the Prosecution.",
        "Conclusion": "54     In the premises, I granted the\n                    petitioners’ applications for particulars on the first two points set out\n                    at [10] above relating to, respectively, the identity of the party whom the\n                    petitioners allegedly conspired to defraud and the reasons why the sub-contract\n                    between ZTE and Questzone was alleged to be fictitious. I ordered these\n                    particulars to be furnished within two weeks from 23 January 2013 (I should\n                    add that I subsequently granted a stay of this order on 6 February 2013\n                    pending the Prosecution’s reference to the Court of Appeal on questions of\n                    law of public interest arising from the present applications). The request for\n                    further details of the alleged conspiracy between the petitioners (viz, point (c) of [10] above) was\n                refused.  [note: 1]Statement of Li Weiming recorded on 17\n                                March 2011 at para 2. [note: 2]Statement of Thomas Philip Doehrman\n                                recorded on 16 March 2011 at para 9. [note: 3]Statement of\n                                Thomas Philip Doehrman recorded on 16 March 2011 at paras\n                                4–6. [note: 4]Further\n                                statement of Lim Ai Wah recorded on 18 March 2011 at para\n                            37. [note: 5]Statement of\n                                Lim Ai Wah recorded on 15 March 2011 at para 8; Statement of Thomas\n                                Philip Doehrman recorded on 16 March 2011 at para\n                        8. [note: 6]Statement of Thomas Philip Doehrman\n                                recorded on 16 March 2011 at paras\n                        4–6. [note: 7]Statement of\n                                Lim Ai Wah recorded on 15 March 2011 at para\n                        2. [note: 8]Statement of Thomas Philip Doehrman recorded on 16\n                                March 2011 at para 2. [note: 9]See,eg,\n                                DAC 026705 of 2012. [note: 10]See,eg, the summary of facts for\n                                DAC 026742 of 2012 at\n                    para 3. [note: 11]Respondent’s Submissions at\n                                para 27. [note: 12]See,eg,\n                                the summary of facts for DAC 026742 of 2012 at\n                                para 1. [note: 13]Statement\n                                of Li Weiming recorded on 17 March 2011 at paras\n                            5–11. [note: 14]Ibid."
    }
}