{
    "case_title": "Nim Minimaart (a firm)\n      v\n      Management Corporation Strata Title Plan No 1079 and others",
    "ncitation": "[2013] SGHC 53",
    "coram": "Judith Prakash J",
    "sections": {
        "Introduction": "1       This matter is an appeal against the review of a taxation of a bill of costs in the District Court. 2       There is a long history to this litigation. Certain salient features must be highlighted in order to understand the nature of the arguments before me. The appellant, Nim Minimaart, which is a firm owned by one Mr Sambasivam Kunju, was the plaintiff in District Court Suit No 1263 of 2008 (“the DC Suit”). At all material times, Mr Sambasivam Kunju appeared in person. The defendants in the DC Suit (and the respondents in the appeal before me) are the management corporation (“the first defendant”) and the members of the management council of a strata title development which had rented certain premises in the development to the plaintiff for the purpose of operating the business of a mini-supermarket. 3       The plaintiff brought the DC Suit in order to obtain specific performance of a particular clause in the licence agreement governing the plaintiff’s use of the premises. The plaintiff’s claim was that he was entitled to be granted an extension of the licence for a period of one year from January 2008 to January 2009. The defendants resisted the claim and the DC Suit came on for trial between 11and 13 March 2009 (“the first trial”). On the last day of the first trial, a consent order (purportedly following from a settlement reached between the parties) was entered. The first trial, accordingly, did not continue. 4       On 21 March 2009, the plaintiff wrote to the Registrar of the District Court asking for a re-trial of the matter. Subsequently, he filed a formal application to set aside the consent order and to obtain a re-trial. This application was dismissed by the Assistant Registrar and the plaintiff’s appeal to the District Judge was also unsuccessful. The plaintiff then appealed to the High Court and this appeal was allowed (see Nim Minimaart (a firm) v Management Corporation Strata Title Plan No 1079 [2010] 2 SLR 1). The consent order was set aside by Steven Chong JC (as he then was) (“the Judge”) and a new trial before a different District Judge was ordered. In relation to costs, the order made was “[t]he parties are to bear their own costs for this appeal and the costs below”. 5       The DC Suit was retried over eight days in December 2010 (“the second trial”). In July 2011, the plaintiff’s claim was dismissed. At a subsequent hearing, the trial judge awarded costs to the defendants. The plaintiff then filed an appeal against the dismissal (District Court Appeal No 27 of 2011). For various reasons, this appeal took some time to be heard and it was not dealt with until 23 October 2012 when it was dismissed by the High Court. It was only after that dismissal that I heard the present appeal in relation to the taxation of costs. 6       In the meantime, the defendants had, on 22 August 2011, filed their bill of costs (“the Bill”). The Bill was taxed by the trial judge in her capacity as Deputy Registrar. The defendants had claimed $55,000 in respect of Section 1 costs but this was reduced to $35,000 upon taxation. The defendants were allowed $1,200 for Section 2 costs, $9,233.60 for Section 3 disbursements on which GST was not chargeable and $1,454.60 for Section 3 disbursements on which GST was chargeable. 7       The plaintiff was not satisfied with the taxation. He applied for a review of the taxing master’s award and the review was heard on 28 December 2011. The grounds on which the plaintiff wanted the award reviewed were the following: (a)     The defendants had been wrongly awarded costs for the first trial in respect of which each party was to bear its own costs; (b)     The defendants had failed to provide sufficient particulars in the bill to support their claim under Section 1 that 280 hours of work had been done; (c)     There were numerous mistakes in the Bill and the defendants had failed to pay $500 in costs awarded to the plaintiff for the amendment of the Bill; (d)     The defendants wrongly claimed disbursements for the first trial and also should not have been allowed $8,202 for using a transcription service; (e)     Moreover, claims for oath fees were wrongly calculated while sums allowed for transport and parking, facsimile, postage and incidentals totalling $750 were excessive; and (f)     The defendants had caused numerous delays (totalling 105 days) in the hearing of the DC Suit. 8       On review, the District Judge (“DJ”) found no reason to disagree with the taxing master’s decision. He dismissed the review with costs which he fixed at $800 inclusive of disbursements. The DJ did not give written grounds of decision. The notes of evidence of the hearing before him record his oral judgment as follows: Court:    Thank parties for their submissions. All things considered, I see no merit in the review and have no reason to disagree with the amounts awarded by the Deputy Registrar. The bill, in my view, complies with the PD and the sum of $35,000 for section 1 would be reasonable. Even if I were wrong in interpreting the High Court order and discount the three days of the initial trial, $35,000 for an 8 day DC trial would still be fair. I also accept the Defendants submissions regarding the GST disbursements and the need for the digital recording, which in my view is a reasonable disbursement. The review is dismissed with costs. Parties to submit on a reasonable amount.",
        "The appeal": "",
        "General principles": "9       On 18 January 2012, the plaintiff filed the present appeal against the DJ’s decision. He wants that decision set aside and for there to be a review of the taxing master’s award on the Bill. 10     The appeal falls under O 55C of the Rules of Court (Cap 322, R 5, 2006 Rev Ed) as it is against the decision of a district judge in chambers. Rule 1 of O 55C provides that appeals shall lie to a judge of the High Court in chambers from any order or decision of a district judge in chambers. Under s 22 of the Supreme Court of Judicature Act (Cap 322, 2007 Rev Ed), all appeals to the High Court in the exercise of its appellate civil jurisdiction are by way of re-hearing but this does not change the essential nature of the case which is an appeal and not a review. 11     It is settled law under the present Rules of Court that when the decision of a taxing master goes up for a review by a more senior judicial officer, the reviewing officer hears the matterde novoand is not bound in any way by the exercise of discretion by the taxing master. He is entitled to substitute his own discretion for that of the taxing master and to change the quantum awarded to such an extent as appears correct to him, although he should give due weight to the taxing master’s decision on quantum: seeTan Boon Hai v Lee Ah Fong and others[2001] 3 SLR(R) 693. 12     The position is different when there is an appeal against the decision made on review. When an appeal is lodged against a judicial decision that has been made in the exercise of a judicial officer’s discretion, in order to overrule that exercise of discretion it must be shown that the judicial officer had erred in principle or had reached a conclusion that is plainly wrong: seeGolden Shore Transportation Pte Ltd v UCO Bank and another appeal[2004] 1 SLR(R) 6 at [44]. In the earlier Court of Appeal case ofLian Soon Construction Pte Ltd v Guan Qian Realty Pte Ltd[1999] 1 SLR(R) 1053, the court observed at [34]: It is trite law that an appeal against the exercise of a judge’s discretion will not be entertained unless it be shown that he exercised his discretion under a mistake of law, in disregard of principle, under a misapprehension as to the facts, or that he took account of irrelevant matters, or the decision reached was “outside the generous ambit within which a reasonable disagreement is possible”. 13     Therefore in deciding this appeal from the DJ’s decision on the review of the taxation award, insofar as that decision was an exercise of discretion, I am not at liberty to interfere with it unless there was a mistake of principle or the DJ took account of irrelevant matters or disregarded relevant matters. Insofar as the decision was based on legal principles, it will not be reversed unless the DJ applied the wrong principles. The plaintiff in his position as appellant before me has, therefore, a heavier burden to discharge than he had during the review.",
        "The plaintiff’s submissions": "14     The arguments made by the plaintiff on appeal were as follows: (a)     The Bill was in the wrong format and did not set out information pertaining to attendance at interlocutory hearings, discovery and costs claimed as shown in the sample Bill of Costs attached to the Practice Directions. (b)     The defendants were not entitled to claim costs for work done for the first trial. (c)     The defendants behaved unreasonably or improperly by failing to enforce an injunction against the plaintiff until three and a half years after it was applied for. (d)     The defendants did not particularise their claim for 280 hours of work done in sufficient detail. (e)     The defendants’ previous solicitor had failed to attend a hearing and thereafter had not appeared. The defendants’ claim for Section 2 costs was shoddy, in the incorrect format, and had insufficient particulars. (f)     The defendants had wasted a total of 105 days by applying for adjournments and delaying the matter. (g)     The plaintiff should not be liable to pay for the use of transcription services. It can be seen that many of these arguments were a rehash of what had been presented to the DJ upon the review. Also, while some of the arguments called for an exercise of discretion first by the Deputy Registrar and then by the DJ, other arguments dealt with matters of principle. I will deal with the appellant’s arguments in turn. Format of the Bill 15     The appellant is a lay person. He may therefore have had the wrong idea regarding the sample Bill of Costs appended to the Practice Directions. He appears to have thought that such sample has to be followed in every detail by a solicitor who is drawing up a bill of costs. However, the sample is not a form which cannot be changed. It indicates certain essential matters which have to be set out but as long as this is done, solicitors have a fair amount of discretion in the details which they chose to include. This must be so because the details of cases vary and following the form to the letter might not result in a bill which sets out the full and proper information which the taxing master needs in any particular case. The DJ was satisfied that the Bill complied with the Practice Directions. Having looked at the sample and the Bill, I agree that the Bill contains sufficient detail to enable the work done to be assessed. To the extent that matters may have been omitted, it would have been the defendants who would have been prejudiced rather than the plaintiff. This is because they had to support their suggested figures and inadequate detailing would have undermined their efforts to do so. In my judgment, there are no serious discrepancies between the sample bill and the Bill. Costs for work done for the initial trial 16     As has been mentioned above at [3], the first trial took place between 11 and 13 March 2009. The plaintiff submitted that the defendants were not entitled to recover costs of these three days. The basis of his argument was as follows: (a)     The settlement recorded after the first trial did not award costs to either party. (b)     In his judgment setting aside the consent order, the Judge had stated that each party was “to bear their costs for this appeal and costs below”. The plaintiff interpreted this as meaning that each party had to bear its own costs in respect of the three hearing days. 17     In relation to the argument in [16(b)], the defendants argued that the order made by the Judge applied only to the costs of the appeal before him and to the costs of the plaintiff’s original application to set aside the consent order. It did not apply to the costs of the three hearing days. As a matter of interpretation, I agree with the defendants that the judgment only dealt with the appeal before the Judge and the decision in respect of which that appeal was brought. The formulation “costs below” when used by an appellate judge refers strictly to the costs of the first instance decision which is being appealed against. It does not refer to any other costs that might be incurred in relation to the proceedings in which the decision was taken. 18     As far as the argument in [16(a)] is concerned, the defendants argued that there was no reason to deprive them, as the winning party, of their costs at the end of the day. Since they had succeeded after the second trial and had re-used the work done for the first trial, costs should be awarded to them. 19     On the review, the DJ appears to have thought that the defendants were entitled to recover the costs of the first trial on the basis of the Judge’s costs order. He said, however, that in any case the sum of $35,000 awarded was fair in the context of an eight-day trial (i.e.the hearing period of the second trial). 20     My view is different. Generally speaking, in relation to specific applications, a party is only entitled to costs when a costs order is made in favour of that party. As far as the first trial was concerned, no costs order was made by the District Judge who heard it because of the consent order that was entered at the end of the third day. That consent order did not provide for either party to bear the costs of the first trial. That consent order ended the first trial and the action at that stage. When the action was resuscitated, the costs of the first trial were not dealt with. As I have said, the order made by the Judge when he allowed the plaintiff’s appeal for a re-trial did not encompass the costs of the first trial. Then came the second trial. That was not a continuation of the first trial but, in my view, a separate and distinct hearing. At the end of the second trial, although arguments were heard from both parties on costs, no specific order regarding the costs of the first trial were made so there was no change in the position. Accordingly, I agree with the plaintiff that, in principle, the defendants were not entitled to include the costs of the first trial in the Bill. I should point out though that I am referring only to the costs incurred in relation to the three days of hearing which basically means the costs of attending the hearing and presenting evidence at it. 21     The DJ held that even if the costs of the first trial were excluded, the amount awarded under Section 1 was reasonable. This is a matter that I consider below. The injunction 22     The plaintiff’s argument that the defendants had behaved unreasonably or improperly by failing to enforce an injunction order against him until three and a half years after it was applied for is an argument that is not relevant to the issue of costs incurred for the action. I therefore say no more about it. Particularisation of claim 23     The plaintiff complained that although the defendants’ solicitors claimed to have spent 280 hours working on this matter, they had not given sufficient details of the work done. I do not agree. The solicitors did not have to say how each of the 280 hours was spent. This is not a requirement of the Practice Directions or the Rules of Court. What they had to do was to give a sufficient description of the work done throughout the course of the case and of the nature of the issues involved so as to justify the assertion that 280 hours were spent. 24     In this regard, the Bill set out sufficient details of the pleadings filed, the nature of the case, the interlocutory applications, the pre-trial conferences, the discovery process and the number of documents disclosed and reviewed and also the preparation for trial and the attendance at trial. As I have stated, the second trial took eight days. The plaintiff called two witnesses while the defendants called ten. The bundles of documents filed by the parties amounted to some 1,348 pages and between them, the parties filed about 90 pages of submissions and relied on 23 authorities. Both a claim and a counterclaim had to be considered. The plaintiff had claimed in excess of $110,000 in damages while the first defendant wanted an injunction. In the light of all this, to claim that 280 hours were spent on the matter is not an excessive claim. 25     The defendants claimed $55,000 for their getting up and trial preparation and attendances. This was taxed down to $35,000. The DJ considered that amount to be fair. I agree. I can find no basis to interfere with that assessment even though I have held that the costs of the three days of the first trial cannot be included in the Bill. Section 2 and Section 3 costs 26     In relation to the Section 2 costs, again the complaint was that the format of the Bill was incorrect and had insufficient particulars. The DJ disagreed. I do not find any reason to reverse that holding. The Bill was a bit messy as some disbursements were cancelled but sufficient particulars of the disbursements were given to enable the taxing master to decide whether or not they were justified. 27     On the disbursements in Section 3 it is my view that two items incurred in relation to the first trial should not have been included in the Bill. These are as follows: (a)     The amount of $11.20 spent on 10 March 2009 in respect of a Request for Subpoena; and (b)     The amount of $34.40 spent on 11 March 2009 in respect of a Subpoena to Testify. Both these items were incurred strictly for the first trial. Since no order was made regarding the costs of the first trial, they were not recoverable. They were not disbursements on which GST is chargeable. The disbursements recoverable must therefore be reduced by the sum of $45.60. Other arguments 28     The complaints about delays and non-attendance are not matters which can have an impact on the assessment of the costs of the action at this stage. If the plaintiff had been adversely affected by any delay or non-attendance at or of any particular hearing, he should have asked for costs of such delay or non-attendance at that stage. Alternatively, he could have asked the trial judge for the costs awarded to be reduced. The purpose of the taxation was to assess the costs that were reasonably incurred by the defendants’ solicitors and in this respect, the delays, if any, caused by the defendants’ solicitors (which the defendants denied) are not relevant unless the judge who heard the action had specifically ordered that the costs payable should be reduced by a certain percentage to reflect the unnecessary prolongation of the matter by the defendants. Indeed, it was the defendants’ case that during the course of the proceedings the plaintiff had made frequent complaints of delay. These, however, did not result in any limitation on the costs recoverable being imposed by the trial judge. 29     The plaintiff also objected to having to pay the costs of the transcription service. This objection would only hold if it was unreasonable for the defendants to have arranged for the transcription service. In this respect, the taxing master (i.e.the Deputy Registrar) who was also the trial judge was in the best position to assess the reasonableness of this service. By allowing this item, the taxing master held that it had been reasonably incurred. The DJ accepted the defendants’ submission that digital recording had enabled the court to proceed more quickly with the trial than usual and agreed with the taxing master that it was a reasonable disbursement. The plaintiff has not shown me that either the taxing master or the DJ erred in principle in the way that they exercised their discretion. Accordingly, this objection cannot be sustained.",
        "Conclusion": "30     Overall, the plaintiff’s appeal has no merits and must be dismissed. The only adjustment that needs to be made to the Bill is the deduction of $45.60 from the Section 3 disbursements. This is a very small sum in the light of the whole bill and my finding on it does not change the fact that the plaintiff’s appeal has, by and large, been unsuccessful. Accordingly, the plaintiff shall pay the costs of the appeal which I fix at $800 inclusive of disbursements."
    }
}