{
    "case_title": "BMJ\n      v\n      BMK",
    "ncitation": "[2014] SGHC 14",
    "coram": "Tan Siong Thye JC",
    "sections": {
        "Introduction": "1       The plaintiff-wife and the defendant-husband were married on 25 October 2000. Arising from this marriage they have two sons, who are currently 11 and 6 years old (hereinafter referred to as “[E]” and “[S]” respectively, and collectively as the children). The husband has another son, (“[T]”), currently aged 1 year and 9 months, from a relationship with his current fiancée. The wife and the children continue to live at the matrimonial home in a condominium named the Sunville.",
        "Divorce proceedings": "2       Sometime in October 2010 the husband moved out of the matrimonial home. On 15 October 2010, the wife filed for divorce on the ground of the husband’s adultery. The husband counter-filed for divorce on the ground of the wife’s unreasonable behaviour. Interim judgment was granted on 18 August 2011. The hearing on ancillary matters was transferred to the High Court as the matrimonial assets exceeded $1.5m.",
        "The interim orders": "3       On 5 October 2011, the wife applied to the Family Court of the Subordinate Courts for interim care and control of the two children. On 29 December 2011, the Family Court made the following interim orders: (a)     Interim joint custody be granted to the wife and the husband; (b)     Interim care and control be granted to the wife; (c)     The husband be granted interim access as follows:- (i)       From 7 pm on Fridays to 8 pm on Saturday; (ii)       First 2 weeks of June 2012 holidays; (d)     The husband shall be responsible for the children completing homework, school work or tuition supplementary assignments relating to Chinese and sciences subjects; (e)     The husband shall pick up and return the children for access at the matrimonial home; (f)     If either party intends to travel with the children overseas during the time with the children, the travelling party is to notify the other parent at least two weeks in advance with details of the itinerary, flights, contact numbers and accommodation; and (g)     The wife shall facilitate the booking of travel arrangement by handing over the children’s passports upon request and the husband shall return the children’s passports when he returns the children after access.",
        "The issues": "4       This court has to consider the following ancillary issues: (a)     Care and control and access to the children; (b)     Maintenance of the children; (c)     Maintenance of the wife; and (d)     Division of the matrimonial assets.",
        "Care and control and access to the children": "5       Both parties rightfully agreed to joint custody of the children. The courts encourage joint parenting; both parents should have a say in the upbringing of their children. It would not be right to exclude any of the parents from the life of the children. Sole custody orders are made only in exceptional circumstances involving abuse of the child (seeCX v CY (minor: custody and access)[2005] 3 SLR(R) 690 at [25] – [29] and [36] – [38]). 6       The parties took diametrically opposite positions with regard to care and control and access. The wife sought sole care and control with the husband being allowed reasonable access, while the husband sought the converse.",
        "Welfare of the child is the paramount consideration": "7       Section 125 of the Women’s Charter (Cap 353, 2009 Rev Ed) makes it abundantly clear that the paramount consideration is the welfare of the child when deciding on the issue of care and control of the child. The Court of Appeal, inIW v IX[2006] 1 SLR(R) 135, has explained that welfare is to be given its widest meaning: 26    It is clear to us that the paramount consideration in every case where custody is in issue is the welfare of the child. That is the immutable principle. The term \"welfare\" should be taken in its widest sense and we do not think it is possible or desirable to define it. In Tan Siew Kee v Chua Ah Boey [1987] SLR(R) 725, Chan Sek Keong JC (as he then was), in reference to the term \"welfare\", said (at [12]): ... It means the general well-being of the child and all aspects of his upbringing, religious, moral as well as physical. His happiness, comfort and security also go to make up his well-being. A loving parent with a stable home is conducive to the attainment of such well-being. It is not to be measured in monetary terms. 27    What would be in the interests of the child must necessarily depend on all the circumstances of the case. The court, where appropriate, will have regard to the factors the wife had mentioned, ie, maintaining status quo, preservation of mother-child bond and that siblings should not be separated. Other factors will include the home environment and care arrangements made for the child, the conduct of the parties and the wishes of the child. We must reiterate that this enumeration is not meant to be exhaustive. The court will have to carry out a balancing exercise to determine, as between the two parents, to whom custody should be given in the best interests of the child. A factor which may be determinant in one case may not necessarily be so in another. So the weight to be given to each factor may vary from case to case. No precise formulation is possible. This is not a scientific exercise but one of judgment. 8       The children in this case are very young. They are only 11 and 6 years old respectively. After October 2010 the interaction between the children and husband became lesser when the latter left the matrimonial home. This arrangement continues when the Family Court gave the wife sole interim care and custody of the two children on 29 December 2011 while the husband was granted limited access.",
        "Who should be granted care and control of the children?": "9       The wife is more involved in the children’s education. She completed 40 hours of volunteer work in St Andrews Junior School to secure [E] a place in that school. She also attends all school meetings such as parent-teacher sessions, meet-the-principal sessions and parent association meetings. She actively seeks developmental opportunities for the children by enrolling them in enrichment classes such as music and golf. She also brings the children to these classes. 10     The husband claimed that the wife had little time for the children. The children were being looked after by a domestic helper. The husband said that he could provide better care to the children, and is able to provide a balance lifestyle to the children inclusive of studies and leisure. His current fiancée is very close to the children and is able to teach them Mandarin. 11     I do not think the husband’s fiancée will be able to replace the wife as the mother to the two children. The former also has to look after her own young son who is less than two years old. This child will require much more care and attention. 12     The wife highlighted specific instances where the husband failed to instil discipline. The husband failed to ensure that the children slept early, and did not tutor the children in their studies. Instead, he indulged them with expensive consumer gadgets and allowed them to play computer games for long periods. These allegations were not rebutted by the husband. 13     I am of the view that it is in the best interests of the children for them to stay with their mother. I agree with the following comments made by the Court of Appeal inSoon Peck Wah v Woon Che Chye[1997] 3 SLR(R) 430 at [45]: The bond between the natural mother and her child is one of the most unexplainable wonders of human nature. … This court would be doing a disservice to justice and humanity if it turned a blind eye to the most fundamental bond of mankind - between a mother and her child, by taking the child away from the mother. 14     I also place particular emphasis that the children have been living with the wife since birth. A change in environment would not be good for the children. I cite with approval the following passage from Khoo Oon Soonet al, Family and Juvenile Court Practice(LexisNexis, 2008) at p 169 (cited inALJ v ALK[2010] SGHC 255 at [35]): The general view is that there should be stability in the lives of the children. Too many changes within a short span of time would be detrimental to their well-being. If a child has been residing with one parent for the greater part of his life,the onus lies on the parent seeking to evoke a change to show that a new environment has advantages that far outweigh the security and stability of preserving the status quo.[emphasis added] 15     Accordingly, I order that the wife be given sole care and control of the children.",
        "Access orders": "16     It is in the best interest and wellbeing of the children that they interact with their father especially during the developmental years. Hence, the husband will be given reasonable access to allow him to bond with his children. I note that the husband has been rather liberal with the children. I would like to state that too much liberty would not be in the best interests of the children. The husband must strike a correct balance between measured discipline and liberated upbringing. 17     The husband requested for access during weekday from 6 pm to 9 pm. The wife is, however, against giving the husband overnight access during regular school weeks unless there are long weekends or short term breaks. She alleges that such overnight access would be harmful and disruptive to the children’s education and well-being. I agree that such access will be disruptive and stressful to the children. I am, nevertheless, allowing the husband to have reasonable daily telephone access to the children to a time not later than 8.30 pm. 18     I also make the following access orders in favour of the husband: (a)     Weekend overnight access from 7 pm on Fridays to 8 pm on Saturdays; (b)     Access during the first two weeks of the June and December school vacations; and (c)     Access during the first half of the short school vacations in March and September; 19     The following interim orders shall be made permanent: (a)     The husband shall be responsible for children completing homework, school work or tuition supplementary assignments relating to Chinese and sciences subjects; (b)     The husband shall pick up and return the children for access at the matrimonial home; (c)     If either party intends to travel with the children overseas during the time with the children, the travelling party is to notify the other parent at least 2 weeks in advance with details of the itinerary, flights, contact numbers and accommodation; and (d)     The wife shall facilitate the booking of travel arrangement by handing over the children’s passports upon request and the husband shall return the children’s passports when he returns the children after access.",
        "Maintenance of the children": "20     Section 69(4) of the Women’s Charter lists the factors to be considered in an order for maintenance: (4)    The court, when ordering maintenance for a wife or child under this section, shall have regard to all the circumstances of the case including the following matters: (a)    the financial needs of the wife or child; (b)    the income, earning capacity (if any), property and other financial resources of the wife or child; (c)    any physical or mental disability of the wife or child; (d)    the age of each party to the marriage and the duration of the marriage; (e)    the contributions made by each of the parties to the marriage to the welfare of the family, including any contribution made by looking after the home or caring for the family; (f)    the standard of living enjoyed by the wife or child before the husband or parent, as the case may be, neglected or refused to provide reasonable maintenance for the wife or child; (g)    in the case of a child, the manner in which he was being, and in which the parties to the marriage expected him to be, educated or trained; and (h)    the conduct of each of the parties to the marriage, if the conduct is such that it would in the opinion of the court be inequitable to disregard it.",
        "Children’s expenses": "21     The wife provided a detailed account of the children’s expenses. I list the breakdown for [E]: ExpenseMonthly Figure ($)Schooling112School Extra-curricular Activity (Badminton)50Enrichment and tuition452Golf235Other interests (story books, assessment books, games,etc)63Allowance66Entertainment and eating out310Clothing and footwear83Food and groceries180Insurance200Medical38Dental483Supplements33Spectacles40Transport160Grooming10Others (birthday gifts for friends, school parties,etc)17Child’s birthday83Vacation115Total2730   22     The breakdown for [S] is as follows: ExpenseMonthly Figure ($)Schooling400Enrichment and tuition182Golf132Other interests (story books, assessment books, games,etc)63Entertainment and eating out310Clothing and footwear33Food and groceries180Insurance200Medical42Dental25Supplements33Transport80Grooming10Others (birthday gifts for friends, school parties,etc)17Child’s birthday83Vacation115Total1905   23     The expenses appear to be reasonable, save for [E]’s dental expenses, which are a costly $5796 per year and comprise of orthodontic braces. The orthodontic braces should be a one-off expense. Hence, I shall revise the dental expenses to about $100 a month. 24     The total figure after the revision is therefore $4252 a month. I also take notice of the fact that this figure is incomplete because it does not take into account the portion of the household expenses attributable to the children; these household expenses total $2181.00. The children’s portion of the household expenses should be about $1454. The total expenses for the children would be about $5706. 25     The husband estimated the total expenditure of the children to be $3000, and offered to pay 60% of that amount (ie$1800). However, he was unable to provide the financial details of his children’s expenses. Perhaps, this is because he is not deeply involved in the affairs of the children.",
        "Determination of the children’s maintenance": "26     In determining the amount of maintenance that ought to be paid, the parties’ respective earning capacities would also have to be considered. The wife is an Interactive Marketing Manager at 3M and is earning $10,625.35 a month (excluding transport allowance). The husband is the Vice President (global IT) of Hoya Medical Singapore and is earning $22,917.00 a month (excluding transport allowance). The husband is therefore earning slightly more than double of what the wife is earning. 27     I am of the view that the husband should bear a much higher portion of the children’s expenditure due to his markedly higher earning capacity. The wife is also responsible for the day-to-day care and management of the children. Furthermore, the wife is only seeking a nominal maintenance order of $1 from the husband. Bearing all of the circumstances in mind, I order a monthly sum of $4,000 to be paid for the maintenance of both children.",
        "Arrears in maintenance": "28     The wife alleged that the husband has failed to pay maintenance since February 2011. The husband argued that he has been paying for the school fees, kindergarten fees, air-conditioner servicing for the matrimonial home and property tax even after leaving the matrimonial home in October 2010. The maintenance order shall take effect from February 2011, less sums paid by the husband (with documentary proof) towards the children’s expenses during the relevant period.",
        "Maintenance of the wife": "29     The wife sought a maintenance order of $1 because she wants to preserve her right to seek a variation of the maintenance order if there is a material change in circumstances in the future. The husband urged the court not to grant her any maintenance as she is well-educated with a high-paying and stable job. 30     Under s 113 of the Women’s Charter, the court has the power to make a maintenance order in the wife’s favour. Section 113 states:- 113.  The court may order a man to pay maintenance to his wife or former wife — (a)    during the course of any matrimonial proceedings; or (b)    when granting or subsequent to the grant of a judgment of divorce, judicial separation or nullity of marriage. 31     I shall grant the wife a nominal maintenance order of $1 with effect from the date of this judgment. There is no reason to deprive the wife of the right to ask for a variation in the future if there are a material change of circumstances.",
        "Division of the matrimonial assets": "32     The fundamental principle underlying the division of matrimonial assets is stated in s 112(1) of the Women’s Charter: The court shall have power, when granting or subsequent to the grant of a judgment of divorce, judicial separation or nullity of marriage, to order the division between the parties of any matrimonial asset or the sale of any such asset and the division between the parties of the proceeds of the sale of any such asset in such proportions as the courtthinks just and equitable.[emphasis added] 33     Section 112(2) of the Women’s Charter, in turn, lists a number of non-exhaustive factors that the court is to take into account in the division of matrimonial assets: (a)    the extent of the contributions made by each party in money, property or work towards acquiring, improving or maintaining the matrimonial assets; (b)    any debt owing or obligation incurred or undertaken by either party for their joint benefit or for the benefit of any child of the marriage; (c)    the needs of the children (if any) of the marriage; (d)    the extent of the contributions made by each party to the welfare of the family, including looking after the home or caring for the family or any aged or infirm relative or dependant of either party; (e)    any agreement between the parties with respect to the ownership and division of the matrimonial assets made in contemplation of divorce; (f)    any period of rent-free occupation or other benefit enjoyed by one party in the matrimonial home to the exclusion of the other party; (g)    the giving of assistance or support by one party to the other party (whether or not of a material kind), including the giving of assistance or support which aids the other party in the carrying on of his or her occupation or business; and (h)    the matters referred to in section 114(1) so far as they are relevant.",
        "Broad brush approach": "34     The division of matrimonial assets is not a formal and mathematical exercise. For instance, V K Rajah J (as he then was) inNI v NJ[2007] 1 SLR(R) 75 held (at [18]) that: The division of matrimonial assets is a subject to be approached with a certain latitude; it calls for the application of sound discretion rather than a purely rigid or mathematical formula. All relevant circumstances should be assessed objectively and holistically. Generally speaking, however, when a marriage ends a wife is entitled to an equitable share of the assets she has helped to acquire directly or indirectly. 35     The non-mathematical nature of the enquiry is consonant with the broad-brush approach to the division of matrimonial assets. The Court of Appeal, inBCB v BCC[2013] 2 SLR 324 at [10], has recently reaffirmed the broad-brush approach to give the court the flexibility to pursue a just and equitable outcome: The broad-brush approach is particularly apposite because, in the nature of things, an approach that is rooted in the forensic search for the actual financial contributions of the parties towards the acquisition of the assets will inevitably fail to adequately value the indirect contributions made towards the other expenses that are incurred in the course of raising a family and will also be a heavily fact-centric exercise. Moreover, these facts will typically not be borne out by contemporaneous records, as underscored by the courtin Soh Chan Soon v Tan Choon Yock[1998] SGHC 204 at [6] (cited by this court in [NK v NL[2007] 3 SLR(R) 743]).The broad-based approach also avoids what this court has described as an otherwise fruitless \"mechanistic accounting procedure reflected in the form of an arid and bloodless balance sheet\" that \"would be contrary to the letter and spirit of the legislative scheme\" underlying s 112(seeNK v NLat [36], an observation which was most recently referred to by this court inAYQ v AYR[2013] 1 SLR 476 at [18]). Indeed, such a broad yet principled approach enables us to strike a balance between the search for a just and principled outcome in each case and the need to remain sensitive to the nuances of each fact situation we are confronted with. We pause to note - parenthetically - that this is why the Singapore courts have avoided extreme points of departure. For example,this court has held that there is no starting point, presumption or norm of an equal division of matrimonial assets, a holding that is wholly consistent with the legislative background which resulted in s 112 and its concomitant broad-brush approach (see, for example, the decision of this court inLock Yeng Fun v Chua Hock Chye [2007] 3 SLR(R) 520at [50]-[58]). Another example - to be considered in a moment - is the fact that the court will take into account both direct as well as indirect contributions by both parties to the marriage. [emphasis added in bold and italics]",
        "Application of the broad-brush approach": "36     In light of broad-brush approach, there is no starting point of equal division of matrimonial assets. The court will have to analyse all the circumstances, including the direct and indirect contributions of both parties. 37     In this case it is not disputed that the husband made significant direct financial contributions in the acquisition of their matrimonial assets in the course of their 13 years marriage. The parties however differed over the indirect contributions of the wife. The husband argued that the wife had not made substantial indirect contributions. The family had a maid all along, and the children were also in childcare. There was even a second maid for a period of time when [S] was born. The wife did not take any breaks (save for initial periods of maternity leave) from her job to take care of the family. The husband also complained of a lack of intimacy and love after the birth of [S]. The wife, on the other hand, pointed out that she had to look after the children and manage the household. She also dutifully stuck to her job for the sake of stability (in contrast to the husband who switched jobs a few times). She had to take a Singapore-based job to look after the children as the husband had a regional job that required extensive travelling. The wife was also unable to pursue a Master in Business Administration. The wife also said that she had made several indirect financial contributions, such as loans to the husband in the early years of their marriage and a contribution to the down-payment and furniture of their first matrimonial flat. 38     The courts have always acknowledged indirect contributions. The Court of Appeal, inAYQ v AYR and another matter[2013] 1 SLR 476 at [23], held that indirect contributions should be quantified with the full benefit of hindsight, and in a broad manner that does not narrowly focus on specific classes of assets: The court's assessment of a spouse's indirect contribution should thus be performed with retrospective lenses, looking back and fully appreciating the entire context and circumstances of the marriage. It should not be done in a time-specific manner,ie, assessing the extent of indirect contributions of a spouse as at that specific point in time when a particular matrimonial asset was acquired. Further, this assessment should not be done in a blinkered fashion where the court focuses on each individual class of assets and decides the weightage of a spouse's indirect contribution as regards that particular asset class, resulting in a situation where varying weights are accorded for indirect contributions in different matrimonial asset classes. This approach would accord with the view of the marital enterprise being a partnership of efforts of both spouses and that, during the course of marriage, the spouses contribute to the betterment of it in ways that they can without consciously accounting with mathematical precision as regards the quantum and type of their respective contributions. I fully agree. Marriage is a unique marital partnership in which parties do not indulge in “accounting with mathematical precision” during the blissful period of their marriage. Marriage is a joint enterprise; indirect contributions should not be filtered through a fine-toothed comb and must be looked at in a broad manner in order to derive a just and equitable outcome. 39     I also agree with the following passage from Debbie Ong Siew Ling & Valerie Thean, “Family Law”, (2005) 6 SAL Ann Rev 259 at para 13.31  (cited byBCB v BCCat [11]): It could be contended that in most cases where one party experiences great financial success, the other often bears a heavy burden in respect of the children and home; in some cases this entails the sacrifice of any potential for career development. Non-financial contributions are impossible to measure, and success on that front, intangible and difficult to define. It is hoped that this would not stand in the way of courts according due regard to the fact that the financial aspect is but one facet of the many demands that husband and wife must have weathered if a family has had many years together. In this case it is evident that the wife made greater indirect contributions to the marriage (see [37] above).",
        "Matrimonial assets of the parties": "40     I now turn to the matrimonial assets to be divided. The following condominiums were held in the parties’ joint names: AssetValue in $Sunville781,763.88(1,065,000.00 less outstanding loan of 283,236.12)City Regency298,690.12(713,000.00 less outstanding loan of 414,309.88)Total1,080,454.00   The wife had the following assets in her sole name: AssetValue in $Insurance13,020.00Unit Trusts101,576.37Bank Accounts43,996.49CPF Ordinary65,926.17CPF Special90,135.69CPF Medisave40,037.06Total354,691.78   The husband had the following assets in his sole name: AssetValue in $The Bayshore249,086.80(900,000.00 less outstanding loan of 650,913.20)Property in New Zealand94,500(309,000.00 less outstanding loan of 214,500.00 after conversion to SGD)Bank Accounts110,515.39Insurance280,387.90Securities33,225.58iFast Holdings71,975.29Forex Capital Markets7,935.45(after conversion to SGD)CPF Ordinary62,373.75CPF Special40,037.06CPF Medisave73,869.78CPF Investments70,915.15Vehicle(BMW X1)140,000.00Sub-total1,234,822.15Liabilities (loans)-282,942.13Total951,880.02   The total value of matrimonial assets is therefore $2,387,025.80. 41     It was undisputed that the husband had made greater direct financial contributions. The only direct financial contributions made by the wife were towards the matrimonial home in the Sunville. In this regard, there was some dispute over what the exact contributions were. The wife said that she contributed 40%, while the husband said that the wife had contributed only 34%. I note that the husband’s breakdown included a 10% deposit and stamp duty, while the wife’s breakdown did not. The husband’s breakdown is thus more accurate, and I took the wife to have contributed 34% to the matrimonial property.",
        "Drawing of adverse inference": "42     Both parties alleged that the other had not made full and frank disclosure of the assets, and urged the court to draw an adverse inference against the other. The law on drawing adverse inferences is succinctly stated in the Court of Appeal case ofKoh Bee Choo v Choo Chai Huah[2007] SGCA 21 at [28]: We consider that the trial judge was correct in rejecting the Wife’s plea to do so. It is well established that in order for a court to draw an adverse inference, there must, in the first place, be some substratum of evidence that establishes aprima faciecase against the person against whom the inference is to be drawn. In addition, it must be shown that the person against whom the inference is to be drawn has some particular access to the information he is said to be hiding (perhaps because it is peculiarly within his knowledge). In other words, the court’s ability to draw an adverse inference does not and cannot displace the legal burden of proof that continues to lie with the plaintiff, or, as in this appeal, the Wife. 43     The wife is relying on the following evidence: (a)     The husband’s declared bank accounts currently show a minimal balance. The bank statements disclosed pursuant to a discovery application show that the husband had significant funds in his accounts and he has failed to properly account for the various transfers and payments out of these bank accounts; (b)     The husband had failed to state the current estimated value of a particular land banking investment with Walton International, taking the position that the value or selling price will be determined when a sale takes place; (c)     The husband contributing $120,000 to the construction of a house in Sri Lanka, which he claims is for his old mother. The husband has resisted attempts to seek more information about the property and its value; (d)     The husband had failed to account for profits made from trading in securities; (e)     The husband had also failed to account for rental income from the properties in his sole name. 44     The husband averred that the wife leads a frugal lifestyle and is not in debt, unlike him. The husband submitted that it was unbelievable that she had so little in her bank accounts. 45     The husband merely made a bare assertion that the wife had not fully disclosed her assets, and could not point to any evidence indicating that this was the case. I am of the opinion that the wife has been forthright in disclosing her assets and means. No adverse inference shall be drawn against the wife. 46     On the other hand, the husband was evasive and could not explain a number of bank transactions (which he has personal knowledge of). The wife had to take out a discovery application to force the husband to disclose certain assets. The wife could also point to the Walton International investment, which the husband could not value, and the Sri Lanka house, which the husband did not provide more information on. InNK v NL[2007] 3 SLR(R) 743, the Court of Appeal did not increase the notional amount of assets in the non-disclosing party’s name, but instead increased the proportion of assets given to the other party (see particularly at [62]): In the circumstances, it might be more just and equitable (not to mention, practical) to order a higher proportion of the known assets to be given to the wife. This would also give effect (albeit in a more general fashion) to the adverse inference which this court has drawn against the husband. I intend to take the same approach.",
        "Apportionment of the matrimonial assets": "47     The Court of Appeal, inBCB v BCC, also undertook an exhaustive inquiry into cases where the marriages were ten years or longer, the couple had children, both parties were working and where the husband had greater direct financial contributions than the wife. Andrew Phang Boon Leong JA, also relied on an empirical study by Lim Hui Min entitled “Matrimonial Asset Division: The Art of Achieving a Just and Equitable Result” inSAL Conference 2011: Developments in Singapore Law between 2006 and 2010, Trends and Perspectives(Yeo Tiong Min, Hans Tjio & Tang Hang Wu gen eds) (Academy Publishing, 2011) at pp 191 – 243. The following passage (at [101] of the essay) was cited by the Court of Appeal (at [13]): It appears that when the husband has greater direct financial contributions to the matrimonial assets than the wife, who is an 'ordinary' working mother, the wife will get about 40% of the pool of matrimonial assets, which will be more than her direct financial contributions. 48     I would like to emphasise that this observation is premised on anempiricaldata. I am mindful that there is no starting point, presumption or norm for the division of matrimonial assets (see also [35] and [36] above). Every case must be looked at on its merits and unique circumstances. However, the conclusions of other cases may be useful insofar that there are commonalities between the facts of the decided cases and the facts of the case at hand. I shall not repeat the analysis of the case law inBCB v BCC, but suffice to say, the cases cited by Lim Hui Min suggest a range between 35% to 45% in favour of the wife. 49     The learned counsel for the wife suggested that a 50-50 split of all matrimonial assets would be just and equitable. However, he submitted that the wife would be content for the matrimonial home at the Sunville to be transferred to her for no cash consideration and no CPF refunds to the husband’s CPF account (including interest), and for the husband to settle the outstanding loan in respect of the matrimonial home. In return the wife would forego all claims over the other assets. In this way the children would continue to have a stable roof over their heads and grow up in familiar surroundings. 50     The husband submitted that the City Regency and The Bayshore should remain in his sole name because the wife had not made any financial or non-financial contributions to both properties. This argument is not tenable as these properties were purchased by the husband during the marriage. Section 112(10) of the Women’s Charter makes it clear that any assets acquired during the marriage by one or both parties are to be considered as matrimonial property. Additionally,AYQ v AYRmakes it clear that contributions should be considered in a holistic manner, and cannot be considered in isolation with respect to particular classes of assets. Both the City Regency and the Bayshore are thus to be included in the pool of matrimonial assets. 51     The wife wanted the Sunville matrimonial home to be transferred to her with the husband paying the outstanding loan. She would then relinquish all other claims. This would result in the wife obtaining 59.5% of the matrimonial assets (ie, [$1,065,000 + $354,691.78] ÷ $2,387,025.80). This is excessive, especially considering that the wife had only directly contributed 34% to the matrimonial home. 52     I am inclined to the wife’s contention that the matrimonial home should be transferred to her sole name so that she may continue to raise the children in a familiar environment. I therefore, order the husband to transfer the Sunville to the wife’s sole name, with the husband being responsible for the requisite refunds to his CPF account. However, the wife is to be responsible for paying up the rest of the outstanding loan. The City Regency is to be transferred to the husband’s sole name. All other assets shall remain in either the wife’s or the husband’s sole name, as the case may be. This would have the result of the wife obtaining 47.6% of the matrimonial assets (ie, [$781,763.88 + $354,691.78] ÷ $2,387,025.80). 53     I acknowledge that this 47.6% figure is slightly higher than the 35% – 45% range thatBCB v BCCand the empirical study conducted by Lim Hui Min have uncovered. However, the cases cited in both are distinguishable on the basis that those cases did not involve material non-disclosure of assets. I have already found that the husband did not make full and frank disclosure of his assets, and that this warrants an increase in the proportion of assets given to the wife (see [46] above). Taking all of the circumstances of the case into account, including in particular the indirect non-financial contributions of the wife, the material non-disclosure of the husband, and the salutary need for raising the two young children in a stable environment (that is, the Sunville condominium) which they have resided in since birth, I am of the opinion that a 47.6%-52.4% split between the wife and husband would be just and equitable.",
        "Conclusion": "54     In summary, I make the following orders: (a)     The husband and wife will have joint custody of the children; (b)     The wife will have sole care and control of the children. With regard to the husband’s access: (i)       The husband is to have weekend overnight access from 7 pm on Fridays to 8 pm on Saturdays; (ii)       The husband is to have access during the first two weeks of the June and December school vacations; (iii)       The husband is to have access during the first half of the short school vacations in March and September; (iv)       The husband will be responsible for children completing homework, school work or tuition supplementary assignments relating to Chinese and sciences subjects; (v)       The husband will pick up and return the children for access at the matrimonial home; (vi)       If either party intends to travel with the children overseas during the time with the children, the travelling party is to notify the other parent at least 2 weeks in advance with details of the itinerary, flights, contact numbers and accommodation; and (vii)       The wife will facilitate the booking of travel arrangement by handing over the children’s passports upon request and the husband will return the children’s passports when he returns the children after access. (c)     The husband will pay to the wife $4000 monthly in maintenance for the children. This order will take retrospective effect from February 2011, less any sums paid by the husband (with documentary proof) towards the children’s expenses during the period of February 2011 to the date of this judgment; (d)     The husband will pay the wife $1 monthly in maintenance for the wife from the date of this judgment; (e)     The total monthly maintenance of S$4,001.00 is to be credited to the wife’s POSB Savings Account; (f)     Within 6 months of this judgment, the husband shall transfer (other than by way of sale) all his rights, shares and interests in the cash consideration and no CPF refunds to be made to the husband’s CPF account. The wife shall bear all the expenses for the transfer. The wife shall bear the outstanding mortgage loan; (g)     Within 6 months of this judgment, the wife shall transfer all her rights, shares and interests in the property at St Michael’s Road City Regency Singapore to the husband’s sole name with no cash consideration. The husband shall bear all the expenses for the transfer. The husband shall bear the outstanding mortgage loan; (h)     This order is made subject to the Central Provident Fund Act (Cap. 36) (“CPF Act”) and the subsidiary legislation made thereunder. The CPF Board shall give effect to the terms of this order in accordance with the provisions of the CPF Act and the subsidiary legislation made thereunder; (i)     The Registrar is empowered to execute, sign, or indorse all necessary documents relating to matters contained in this order on behalf of either party should either party fail to do so within seven days of written request being made to the party; (j)     Each party to retain all other assets in their own name; (k)     The parties, including the CPF Board, shall be at liberty to apply for further directions or orders generally. 55     There will be no order as to costs."
    }
}