{
    "case_title": "Goh Eileen née Chia and another\n      v\n      Goh Mei Ling Yvonne and another",
    "ncitation": "[2014] SGHC 3",
    "coram": "Quentin Loh J",
    "sections": {
        "Introduction": "1       This is a dreadful family dispute which should not have reached the courts for resolution. Unfortunately two separate mediation sessions, the second of which was very kindly undertaken by retired High Court judge Mr Kan Ting Chiugratisand at very short notice, failed. What lay at the heart of this family dispute is the title to a Housing and Development Board (“HDB”) flat at Block 337, Clementi Avenue 2 (“the Clementi flat”), which I am told is worth about $700,000. A one-quarter share would amount to $175,000 and a one-third share would amount to some $233,000. The Plaintiffs, who had added the Defendants as joint tenants in the title of their Clementi flat, want this set aside. 2       After hearing the evidence lasting 17 days over three tranches of hearing dates and after considering the submissions of the parties, I dismissed the entirety of the claim on 16 October 2013 with brief reasons. The plaintiffs have appealed against my decision and I now set out the grounds of my decision.",
        "The parties": "3       The second plaintiff in this action is the late Mr Goh Chin Chye Dennis, deceased, (“Dennis Goh”), and the first plaintiff is his wife Mrs Goh Eileen née Chia Yoke Mui Eileen (“Mrs Goh”); I will refer to Dennis Goh and Mrs Goh collectively as “the Plaintiffs”. Their eldest daughter Ms Goh Mei Ling Yvonne (“Yvonne”) is the first defendant and their other daughter Ms Goh Meich’ang Yvette, (“Yvette”) is the second defendant. The defendants will be referred to collectively as “the Defendants”. Dennis Goh and Mrs Goh also have two sons, Mr Goh Wai Mun Eric, the eldest son (“Eric”), and Mr Goh Evan Wyming (“Evan”). This action was commenced in the names of Dennis Goh and Mrs Goh against Yvonne and Yvette on 1 June 2012. Eric and Evan are not parties to the action. However the Defendants have consistently claimed that their brothers, Eric and Evan, and Eric’s wife Penelope Wee Phui Leong (“Penny”), are the real litigants behind this action. 4       On the second last day of the trial, upon certain answers being given by Eric under cross-examination, counsel for the Defendants Mr Alfred Dodwell (“Mr Dodwell”) called for the production of the Plaintiffs’ solicitors’ warrants to act. This was resisted by the Plaintiffs’ solicitors. On the authority ofTung Hui Mannequin Industries v Tenet Insurance Co Ltd and others[2005] 3 SLR(R) 184 that a lawyer who receives a request to disclose his warrant to act should do so as a matter of course, I ordered the production of the Plaintiffs’ solicitors’ warrants to act. On the following morning, the last day of the trial, only one warrant to act dated 26 January 2012 was produced and it was signed by Eric (“the Warrant to Act”). There were no warrants to act signed by Dennis Goh or Mrs Goh. The terms of the Warrant to Act, unfortunately I say, because I suspect it was a standard Rodyk & Davidson LLP (“Rodyk”) form, made it very clear that Eric was the client. I allowed a redacted form of the Warrant to Act to be admitted into evidence. 5       Dennis Goh was a well-known and respected teacher for many years at the Anglo Chinese School. He was also a prominent figure in the Singapore Scout Movement having contributed, I was told, in no small measure to its growth. He had built up a considerable group of fans comprising loyal ex-students and ex-Scouts; they obviously held him in high esteem and he was much loved by them. When the originating summons was filed on 1 June 2012 (which was subsequently converted to the present writ action), he was already 93 years old. Mercifully, he passed away at the age of 94 on the 5 March 2013, about one month and three weeks before the hearing commenced and did not have to witness the proverbial washing of his family’s dirty linen in public. Mrs Goh continued the action in her personal capacity and also in her capacity as executrix of the estate of the late Dennis Goh, deceased. 6       Mrs Goh is 92 years old and wheelchair bound. She was a homemaker. Eric is 69 years old, works as a teacher, and is married to Penny, the human resources director at Nanyang Polytechnic, and they live in Pine Grove. Evan is 65 years old, was married and lives in Bedok. Yvonne, aged 63, is the third child in the family and married to one Andrew James Ross; they live in Hertfordshire, England. The youngest child of the family, Yvette, aged 53, is single, used to live in Vancouver, Canada and lives in London, England. 7       The Plaintiffs worked hard, lived modestly and saved as much as they could. They managed to purchase a landed property, No 1 Sennett Close, which became the family home. It subsequently had to be sold to settle some of the resultant debts of Eric’s business failure. The Plaintiffs then purchased the Clementi flat in or around May 1992 which was registered in their names as joint tenants. 8       Dennis Goh retired in due course. The sons worked in Singapore. The daughters went abroad and settled there.",
        "The present claim": "9       The seeds of discord were sown on 31 December 2009 when the Plaintiffs applied to add the Defendants’ names to the title of the Clementi flat as joint tenants. Just over two months later, the application was approved by the HDB and the Plaintiffs executed the HDB Transfer form on 12 March 2010 adding the Defendants’ names on the title as joint tenants (“the Transfer”); the Transfer was duly registered by the HDB. Eric and Evan did not know of this change in title to the Clementi Flat. Approximately one year and seven months after the Plaintiffs executed the HDB Transfer, around October or November 2011, Evan found out about the addition of his sisters’ names onto the title from Mrs Goh. He told Eric about it shortly thereafter. There was a family meeting on 20 December 2011 over the inclusion of the Defendants’ names on the title to the Clementi flat. The meeting was stormy; voices were raised and accusations were made. The originating summons was filed on 1 June 2012, without any prior letter of demand (not that it was a pre-requisite), and service was effected on the Defendants sometime around 3 August 2012. 10     The Plaintiffs essentially sought declaratory orders that the addition of the Defendants’ names as joint tenants to the title of the Clementi flat be set aside and for consequential relief. The Plaintiffs advanced their claim on the following grounds in their Statement of Claim (Amendment No 4) (“Statement of Claim”): (a)     First, it was part of their case that the Defendants harassed and badgered the Plaintiffs to add their names to the title of the Clementi flat; (b)     Secondly, they alleged that the Transfer was procured by the Defendants having exerted undue influence over the Plaintiffs; (c)     Thirdly, that the Defendants exploited the weak health, old age, fragility and lack of resources of the Plaintiffs and coerced the Plaintiffs into signing and submitting the application for transfer of title form (“Application Form”); (d)     Fourthly, they alleged that they were induced by fraudulent misrepresentations made by the Defendants; (e)     Fifthly, they also alleged that the procurement of the Transfer was in the circumstances unconscionable; and (f)     Sixthly, they alleged that the Transfer was executed under a mistake. In the alternative, the Plaintiffs prayed for a declaration that the beneficial interest in the Clementi flat was held in trust by the Defendants for the Plaintiffs because it was never the Plaintiffs’ intention to give any beneficial interest to the Defendants. 11     The prolix Statement of Claim, which was amended four times, also included allegations of Yvonne foisting the Application Form on, and without reading it to, the Plaintiffs, not giving the Plaintiffs any explanation nor opportunity to read the Application Form, not giving the Plaintiffs any advice on the Application Form nor giving them an opportunity to seek legal or financial advice thereon,non est factum, Yvonne standing in a fiduciary position andin loco parentisas the elder daughter, dominating the will of the Plaintiffs, a want of probity on Yvonne’s part and using unfair advantage over the Plaintiffs. The Plaintiffs also alleged a “post-transfer or continuing duty / obligation to inform / advice [sic] / apprise” the Plaintiffs of the consequences of having executed the transfer and in particular to highlight to the Plaintiffs that they could not sell or encumber the Clementi flat without the consent of the Defendants.",
        "My findings of fact and decision": "12     Having considered the evidence, I found that the Plaintiffs had failed to make out the facts and allegations in their pleaded case and their claim was accordingly dismissed. My findings of the salient facts are as follows: (a)     The Defendants, especially Yvonne, flew into Singapore to organise a surprise party for Dennis Goh’s 90th birthday, which fell on 11 December 2009; this was held at a function room at the Anglo Chinese School, Barker Road; many old students, Scouts, friends and family attended this birthday party which was a big success and Dennis Goh was very happy and touched by this event; (b)     In contrast, Eric and Evan played no part in the planning and organisation of this surprise party; Eric only came towards the end of the party whilst Evan came then swiftly left when he saw his ex-partner and the son that she bore him there as well; (c)     One morning, sometime between 27 to 30 December 2009, Dennis Goh spontaneously announced that he wanted “the girls”, who lived overseas, to have a home when they came back to Singapore; he did not want them “sleep[ing] on park benches or under Anderson Bridge when [he] was gone”;[note: 1]Dennis Goh asked and Mrs Goh agreed to her husband’s proposal to include their names in the title to the flat; Dennis Goh then asked Yvonne to go the HDB Clementi office to find out what needed to be done to include their names in the title to the Clementi flat; (d)     There was no harassment, badgering, coercing, exerting pressure or undue influence, or procuring of title under unconscionable circumstances, or any of the other allegations made in the Statement of Claim on the part of the Defendants during this time or at any other relevant time; (e)     Yvonne went to the HDB’s Clementi office and brought back the Application Form; Dennis Goh, Mrs Goh, Yvette and Yvonne then sat at the dining table in the Clementi flat and Yvonne filled up those parts of the form that she could; in doing so she obtained the necessary information and photographs from the aforementioned family members to fill up the Application Form; (f)     On the 31 December 2009, Yvonne and Yvette brought Dennis Goh and Mrs Goh in their wheelchairs to the HDB’s Clementi office where they were attended to by an HDB officer who went through the Application Form with Dennis Goh and Mrs Goh, explained it to them, filled up those parts that were not filled up and attended to the other matters and formalities and otherwise completed it; (g)     I accepted the evidence of the HDB officer who attended to them that Dennis Goh and Mrs Goh understood what they were doing and signed the Application Form willingly; (h)     Yvette left Singapore for England on the same day, Yvonne’s husband and son left Singapore on 19 January 2010 and Yvonne left Singapore on or about 27 January 2010 and did not return until much later on 15 September 2010; (i)     The HDB processed and approved the application and the HDB’s Clementi office drew up the a transfer form for signature (“the Transfer Form”); another HDB officer then went to the Clementi flat on 12 March 2010 to meet the Plaintiffs, and I accepted his evidence that he explained what they were about to do, was satisfied that the Plaintiffs understood what they were doing and duly obtained their signatures and thumb prints on the Transfer Form; the Transfer Form was duly registered by the HDB; (j)     I found that there was no harassment, badgering, coercing, exertion of pressure or undue influence, or procurement of the title under unconscionable circumstances, or any of other allegations made in the Statement of Claim on the part of the Defendants at any material time before or from the time the Defendants left Singapore to 12 March 2010 when the Plaintiffs voluntarily signed the Transfer Form; (k)     I also found that the Defendants did not ask or speak to the Plaintiffs about the Transfer or the addition of their names to the title thereafter; (l)     Dennis Goh and Mrs Goh were not persons who were likely to have been led like sheep as the Plaintiffs’ case suggested; Dennis Goh in particular was an intelligent and educated person who knew the ways of the world and who by all accounts tended to be firm in his own views and in doing what he wanted until old age and infirmity caught up with him; and (m)     Neither Dennis Goh nor Mrs Goh, whether together or individually, told their sons, Eric and Evan, or Penny, what they had done with the title to the Clementi flat; the Plaintiffs could have, but did not, tell or discuss with their sons what they had done with the title to the Clementi flat until one year and seven months later, when Mrs Goh mentioned it to Evan sometime in October or November 2011, almost by the way, which led to Evan telling Eric. 13     I will now explain the reasons for coming to these findings of fact and set out my analysis of the evidence before me.",
        "My analysis of the evidence": "",
        "The evidence of Mrs Goh": "14     Mrs Goh’s affidavit of evidence-in-chief contained the same strong allegations against the Defendants as were contained in the Plaintiffs’ Statement of Claim. Her evidence was that it was Yvonne who had brought up the topic of the Transfer, and that she was “very insistent that it be done immediately”.[note: 2]She said that Yvonne was adamant that her name be included in the title to the Clementi flat because Yvonne was concerned that she “did not have much time left”.[note: 3]She also alleged that Yvonne had badgered and harassed her and Dennis Goh and that she had agreed to take steps to effect the transfer because she “could not take the badgering and harassment, and wanted peace and quiet”.[note: 4] 15     However, when it was suggested to her under cross-examination that it was Dennis Goh who had made the suggestion to include the Defendants’ names on the title to the Clementi Flat (see [12(c)] above), she did not deny this outright. Mrs Goh first claimed she did not hear this being said by him. Upon further questioning, she conceded that she had heard him “mutter” something but she then claimed that she had not been concentrating on what he had said.[note: 5]Ultimately, she did not deny that these words were uttered by Dennis Goh and that he had made such a suggestion, but, when this was put to her, her response to this was to say that Dennis Goh was only joking.[note: 6]She further went on to embellish her evidence by suggesting that their family was fond of joking. She explained that her husband was fond of joking and that they “called each other names and … laughed and [told] funny stories”.[note: 7]This did not square with the events which followed: the Plaintiffs and the Defendants filling in the Application Form together at the dining table in the Clementi flat (see above at [12(e)]); their going to the HDB’s Clementi Office and completing and submitting the Application Form (see above at [12(f)]); the Plaintiffs signing the Transfer Form some three months later when Yvonne and Yvette were not in Singapore (see above at [12(i)]); and then not telling anyone about it for more than a year and a half (see above at [12(m)]). These and her subsequent actions were inconsistent with her explanation that Dennis Goh’s suggestion was only a joke. I further noted that Dennis Goh’s suggestion, that he had wanted his daughters to have a place in Singapore to live in, specifically, “when [he] was gone” [emphasis added], was wholly consistent with what was eventually done, that is, to have the Defendants’ names added as joint tenants to the title of the Clementi flat. 16     I also found that Mrs Goh’s evidence under cross-examination in relation to the allegations that Yvonne had badgered and harassed her into making the Transfer was extremely weak. As I have noted, while on the witness stand, she did not reject the suggestion that it was Dennis Goh’s suggestion to make the Transfer by making any counter-assertion that it was instead procured by badgering and harassment, as was the Plaintiffs’ pleaded case. When counsel for the Defendants questioned Mrs Goh about the alleged badgering and harassment, her answers were somewhat tentative. She was asked whether as a result of such badgering and harassment she had felt pressured and she answered, “No, I will just forgive [Yvonne]”.[note: 8]She subsequently also claimed under cross-examination thatbothYvonne and Yvette were badgering and harassing her.[note: 9]When as a follow up she was asked by counsel what Yvette did, she only said:[note: 10] QOkay. So can you tell this Court what did Yvette tell you to ask you to include her name into the property? AShe said, “Mum, get it over soon, let us put our names in”. QSo she requested to include her name? AYes. QWas she polite or was she harsh? AWell, she was a bit, not really having good manners, doesn’t respect the parent much. QDid this affect you, what she said? ABut what can I say? She is now a grown woman, so I just let it be. QDid it affect you so badly that you had to include her name in the property? ASince she wanted it, I have no say. QWas she badgering you? AAt that moment, not so. QAt that moment, not so, that’s your evidence? AYah. These tentative answers were inconsistent with the strong assertions made in the Plaintiffs’ Statement of Claim and in Mrs Goh’s affidavit of evidence-in-chief that they were badgered and harassed to such a degree that they had felt oppressed, badgered, harassed, coerced, unconscionably persuaded, unduly influenced, induced by fraudulent misrepresentations, misled, forced or otherwise felt compelled to effect the Transfer in favour of the Defendants.",
        "The evidence showing that Dennis Goh and Mrs Goh voluntarily intended the Transfer": "17     After hearing the evidence, I came to the conclusion that Dennis Goh and Mrs Goh had voluntarily intended to add the Defendants’ names to the title of the Clementi flat. This was in stark contrast to the Plaintiffs’ allegations in their Statement of Claim. 18     There were five important aspects of the evidence which supported this conclusion. The attendance at the HDB’s Clementi office on 31 December 2009 19     First, there was the evidence in relation to what transpired when the Plaintiffs and the Defendants went to the HDB’s Clementi office on 31 December 2009. As I have noted, this was when and where the Application Form was completed and submitted. They were attended to by an HDB officer, Ms Amy Koh Siew Leng (“Ms Koh”). I accepted the evidence of Ms Koh that she had explained the form to the Plaintiffs including those parts relating to the reason for the transfer and the manner of holding title,ie, tenancy-in-common or joint tenancy.[note: 11]Ms Koh gave her evidence in a very straightforward and objective manner, without prevarication. She came across as a competent and sincere person. Her evidence was not at all shaken or dented in cross-examination. She testified that it was standard protocol for HDB officers to explain the meaning of any proposed transfer and the implications that would follow.[note: 12]She said that she could still picture the Plaintiffs even though the application took place over three years ago because of their advanced age and the fact that they were in wheelchairs.[note: 13]She was concerned, as she always was, when elderly persons came before her to effect transfers in the title to their flats. Her instructions were clear that if elderly owners seemed unsure or appear pressured to make the transfer, she was not to proceed with the process and instead was to alert her superior.[note: 14]Ms Koh said that the Plaintiffs understood what they were doing and they understood the options.[note: 15]It was only on this basis that she had duly completed and accepted the Application Form. 20     Mrs Goh on the other hand said that she thought that they were only going to the HDB Clementi Office as a New Year’s Eve outing for “merry-making”.[note: 16]She tried to explain that the people around that area knew them well, and so they were there to see them in what she described as “some sort of merry-making, going round”.[note: 17]She also suggested, under cross-examination, that she was a little drunk at that time having been offered an alcoholic beverage by someone at the HDB office.[note: 18]She further added that she did not pay attention to the Application Form that was being filled up because she was “more interested in drinking”.[note: 19]When this evidence was put to her, Ms Koh’s spontaneous reaction was to be taken aback. She then said there certainly no party going on at the HDB’s Clementi Office and no drinks were being served.[note: 20]I accept Ms Koh’s evidence. The signing of the Transfer Form on 12 March 2010 21     Secondly, it is important to note that the submission of the Application Form was only the first stage of the process; after the application for transfer was accepted it had to besubmitted for processing. The transfer application had to be processed and checked for eligibility compliance with HDB rules; it then had to be approved before any transfer could take place. The actual transfer wasexecutedon 12 March 2010. This was some two-and-a-half months after the Application Form was submitted. By this time, both the Defendants were no longer in Singapore. Yvette flew back to England the very evening after they had attended at the HDB’s Clementi office and had completed and submitted the Application Form. Yvonne stayed on and flew back to England on 27 January 2010. 22     The execution of the actual transfer was done before another HDB officer, Mr Chua Peng Kiam (“Mr Chua”), who attended at the Plaintiffs’ flat. Mr Chua, whose evidence I also accepted, was that in accordance with HDB’s standard protocol, he explained the implications of the Transfer to the elderly couple, and specifically, the meaning of joint tenancy.[note: 21]He observed that despite their old age, Dennis Goh and Mrs Goh were alert.[note: 22]There were no signs that they were unwilling or unsure of what they were executing.[note: 23]Mr Chua’s testimony was not shaken under cross-examination. I did not find that Dennis Goh and Mrs Goh were unaware of or mistaken as to what they were doing when they executed the Transfer. 23     Thirdly, it is important to note that both Defendants were not present when the transfer was executed, having left Singapore some months earlier. There was only Mr Chua, the Plaintiffs and their domestic helper present on that occasion. Therefore, even if the Defendants had previously badgered, oppressed, harassed, coerced, unconscionably persuaded, unduly influenced, induced by fraudulent misrepresentations, misled, forced or otherwise compelled Dennis Goh or Mrs Goh to effect the Transfer in favour of the Defendants, the Plaintiffs were under no such stress or pressure on the day they executed it and included the Defendants’ names onto the title to the Clementi flat. Given the circumstances, I was satisfied and so found that their actions on this date were free and voluntary. I also noted that between the time the two Defendants left for the UK and this date, Dennis Goh and Mrs Goh could have discussed the matter with their sons or an independent advisor, who did not need to be a professional but could just be a friend, if they had wanted to. But it was apparent that they did not even mention what they had done until one year and seven months later in October or November 2011. This suggested to me that they obviously did not feel the need to consult anyone. It also showed that they were not having any second thoughts after they had executed the Transfer. 24     Counsel for the Plaintiffs, Ms Suchitra Ragupathy (“Ms Ragupathy”), sought to rely on a letter sent by the Yvonne to her father, Dennis Goh, on 8 March 2010,[note: 24]in which no mention was made of any “gift”, to show that there was no intention on Mrs Goh’s and Dennis Goh’s part to make the Transfer.[note: 25]Quite the contrary, the lack of any mention of the Transfer in the 8 March 2010 letter, which was only some four days before the execution of the Transfer was scheduled on 12 March, was consistent with and in fact supported the Defendants’ case that they did not badger or harass their parents to make the Transfer. In the 8 March 2010 letter, Yvonne discussed a wide array of matters, but not once did she ask whether the Transfer had been executed, when it was to be done, or whether it would be done.[note: 26]This seemed to me to be in direct contrast to the averments in the Statement of Claim filed by the Plaintiffs and the affidavit of evidence-in-chief of Mrs Goh in which Yvonne was painted as havingcontinuallyandrelentlesslybadgered and harassed her parents. If that was true, then this letter appeared totally out of character. Dennis Goh’s surprise 90th birthday party 25     Fourthly, the decision to add the Defendants’ names to the title to the Clementi flat, the application and the final execution of it all happened shortly after the surprise 90th birthday party for Dennis Goh on 11 December 2009. This was the Defendants’ idea and they flew in from the UK to plan and organise the entire event. Many of Dennis Goh’s old students, Scouts, friends and family attended the surprise party held at a function room at ACS Barker Road. The evidence showed that Dennis Goh was extremely touched by the gesture and was grateful and appreciative of the deed. I was shown a video recording taken at the party, when Dennis Goh was asked to give a speech. His impromptu address was given coherently, he appeared very pleased and in high spirits and expressed his delight and gratitude to everyone who attended the party. 26     In contrast to the efforts of the Defendants, Dennis Goh’s two sons Eric and Evan took almost no part at all. Not only were they not involved in the planning and organising of the event, but they were hardly present that evening. On Evan’s part, he clarified that he was at the party, but was only there at the start of the event; he admitted that he swiftly absented himself when he saw his ex-partner and the son she bore him present at the party as well.[note: 27]On the other hand, while on the witness stand, Eric insisted that he was present at the party. He, however, could not rebut the evidence of the other persons at the party that he had only turned up at the end of the party. Yvonne testified that Eric and his wife Penny had “reluctantly turned up only at the end of the party and stood by the door like a couple of strangers”,[note: 28]while Prof Tan Yew Lee Kevin (“Prof Tan”) (whose evidence I will consider is greater detail below at [30]et seq), a friend of Dennis Goh who was also at the party, likewise testified that “Eric and his wife showed up almost towards the end of the celebrations and lurked uncomfortably near the exit”.[note: 29]Eric was shown video footage from the event and was asked to identify himself to show that he was, as he had insisted, present for a large part of the party, but he was ultimately unable to do so[note: 30]although I accept that he and Penny were there when a family photograph was taken. Mrs Goh agreed that Eric and Evan took no part in planning and organising the surprise party; she explained that they were busy with work and that they had to protect their “rice bowl”.[note: 31] 27     It was in the aftermath of this happy occasion for Dennis Goh, planned and organised by his daughters, that the decision was made to effect the Transfer in their favour. This supports the view that Dennis Goh had intended the Transfer and that he had decided to do so out of his own free will and Mrs Goh also agreed with Dennis Goh to do so. 28     Further, the evidence showed that after the party, Yvonne and her family left Singapore for a holiday in Siem Reap and only returned to Singapore on Boxing Day,ie, 26 December 2009.[note: 32]This long period of absence just before the Application Form was completed and submitted to the HDB further weighed against the allegations made in the Statement of Claim and in Mrs Goh’s affidavit of evidence-in-chief that there was a continual and persistent campaign of harassment and badgering of the Plaintiffs by Yvonne leading up to steps finally being taken to effect the Transfer. Dennis Goh’s relationship with his sons 29     Fifthly, the evidence before me showed that Eric and Evan had already obtained a share of Dennis Goh’s moneys in the past. As I have mentioned above, the Plaintiffs sold their landed property at No 1 Sennett Close to settle debts which had resulted from the failure of Eric’s business. This amounted to some $120,000. Eric repaid his father part of it over the years;[note: 33]and the outstanding sum of $20,016.18 was “written off” by Dennis Goh.[note: 34]Further, Dennis Goh had given Evan “blank cheques” to pay for his apartment and Evan had taken some $130,000 from his father; Mrs Goh had also given Evan $50,000 to renovate his apartment.[note: 35]These amounts were evidenced in an “IOU” which was found with the belongings of Dennis Goh after he passed away. Dennis Goh had also previously paid off a substantial debt owed by Evan to his employers when he was in the UK; this was not denied by Evan.[note: 36]Finally, although Eric consistently maintained while on the stand that he had not mismanaged Dennis Goh’s or Mrs Goh’s moneys left to him to manage, and this was not an issue that I had to decide, it remained a fact that the moneys were in effect in his control. Evan also held $100,000 of Mrs Goh’s moneys, purportedly for him to “invest at [his] discretion”.[note: 37]Eric held Mrs Goh’s monies and used it to invest in shares. It continued to be the case that Eric and Evan managed Mrs Goh’s finances. 30     I also heard evidence from Prof Tan. Prof Tan worked on a book on the Scout movement in Singapore some time in 1997 and through this came to know Dennis Goh. He got along well with Dennis Goh and came to admire and respect him. He would meet him monthly for lunch, although this eventually stopped when Dennis Goh’s health started to deteriorate.[note: 38]It is important to note that Prof Tan did not know the Defendants, and so really had no reason to be partial to any one side of this fractured family. Ms Ragupathy tried to suggest otherwise by raising Prof Tan’s involvement in a separate application which he and one Lucy Theodas Xia Yun Xin (“Lucy Theodas”), the Plaintiffs’ niece, had made earlier in 2013 under the Mental Capacity Act (Cap 177A, 2010 Rev Ed) (“MCA”) to be appointed joint deputies to manage the personal welfare, property and affairs of Dennis Goh. Prof Tan explained that he had made the application out of concern for the welfare of Dennis Goh, having been contacted by Lucy Theodas and having learned of the state which Dennis Goh was in (which I explain below).[note: 39]Ms Ragupathy continued to suggest that the MCA application was taken out for a collateral purpose, pointing out that the application was taken out very shortly before the first tranche of hearing dates for this present suit.[note: 40]Prof Tan maintained that the application was taken out because he was genuinely concerned about the welfare of Dennis Goh. Prof Tan came across to me as genuine; there was nothing to suggest that what he did was not well-meaning and otherwise than out of a real concern for a friend. I certainly found that he had no ulterior motive and nothing to gain. There was a point in the cross-examination when Prof Tan’s annoyance showed through, but I found that this was justified as Ms Ragupathy had passed certain personal comments about Prof Tan which were unrelated to the present proceedings and Prof Tan had good cause to be annoyed.[note: 41]However Prof Tan did not waver in his evidence. 31     Prof Tan testified as to the relationship between Dennis Goh and his sons. His testimony was based on what Dennis Goh had told him over the years during their lunch meetings. The evidence of Prof Tan was hearsay evidence, but the Plaintiffs did not object to it. In any event, I was myself satisfied that Prof Tan’s evidence was admissible under s 32(j) of the Evidence Act (Cap 97, 1997 Rev Ed) in that the statements of Dennis Goh to him were statements of a person who was no longer alive. 32     Prof Tan testified that it was apparent from his conversations with Dennis Goh that he had felt that his sons had taken a lot from him already.[note: 42]Prof Tan’s evidence of what Dennis Goh had told him corroborated the evidence that Dennis Goh had sold off the Sennett Close property to bail Eric out of his business debts.[note: 43]He was also told that Evan had taken a lot of money from him,[note: 44]and that he was then still giving Evan money to pay for the property he had purchased.[note: 45]Prof Tan was told by Dennis Goh that he was disappointed in having repeatedly to bail his sons out of their financial difficulties; Dennis Goh described Evan as someone who “could not be trusted with money” and who “always wheedles money out of his mother”,[note: 46]and Eric as “the conniving one”.[note: 47]Prof Tan’s account of what Dennis Goh had told him about his sons corroborated and confirmed the other evidence before the court that Dennis Goh’s sons had already obtained significant amounts of money from him. There was therefore good reason that he might want to provide for his daughters; there was good reason for him to make the Transfer. In doing so I have not ignored the evidence that Dennis Goh and Mrs Goh had also helped their daughters monetarily in the past. 33     I would however note that Prof Tan’s evidence merely provided the backdrop and showed the parties’ relationship, thus confirming my conclusions, which I would have reached even if Prof Tan’s evidence had been put to one side.",
        "The other corroborative evidence – the lead up to the suit": "The timing of the present suit 34     The timing of the present suit and the lead up to it was also, to my mind, telling. After the execution of the transfer in March 2010, things lay undisturbed for more than a year and a half. In October 2011, Evan found out about the transfer.[note: 48]He then informed his brother Eric about it.[note: 49]They were furious. There were several altercations between Yvonne and her brothers as a result of which the brothers demanded that she and Yvette remove their names from the title deed to the flat. These culminated in a family meeting on 20 December 2011 over the dining table of the Clementi flat to discuss the matter. Yvonne and Yvette, their brothers Eric and Evan, and the Plaintiffs were present at this meeting. Notably, it was not disputed that Dennis Goh, although present, was “asleep” throughout this meeting. Even Evan testified that it was Eric who took charge of the meeting, and he conceded also that Mrs Goh did not say very much.[note: 50]The only instance which Evan could remember of Mrs Goh saying anything was when she nodded in agreement when asked by Evan to confirm his comment that she had found Yvonne assertive and domineering;[note: 51]it was Eric and Evan who took the initiative at this meeting and Mrs Goh did not herself say anything significant. It was not Dennis Goh and Mrs Goh who were demanding that the daughters remove their names from the deed, but instead, it was Eric and Evan who were the most vocal. The meeting started off calmly, but ended with voices being raised. Yvonne was questioned by Eric as to the Transfer and when she only answered that their parents could have informed the sons but chose not to, Eric was not satisfied and started calling her a liar.[note: 52]The meeting ended with Eric calling Yvonne “a cheat, a liar, and a thief”. 35     Indeed, it was Yvonne’s testimony that until the papers for the present action were served on her and Yvette, neither of their parents had ever asked them to remove their names.[note: 53]No doubt after the action was commenced, Mrs Goh did on occasion tell the daughters to remove their names, but as I will explain, this should be seen in the context of the circumstances at that point. The parties who were to gain from the present litigation 36     Mrs Goh claimed that she wanted the transfer to be set aside because she wanted to be able to deal with the Clementi flat as she wished, for example, if she wished to sell it at some later stage. There was, however, no suggestion that she needed to do so, or that should the need arise, Yvonne and Yvette would not consent to a sale if it was in Mrs Goh’s best interests. In fact, the addition of their names to the title to the Clementi flat as joint tenants did not impinge on Mrs Goh’s right to live in the Clementi flat. Indeed, the only persons who stood to gain from this action were Eric and Evan, who would each inherit a share of the Clementi flat upon their mother’s passing if the daughters were removed as joint tenants. 37     In reality, it was Evan who some time in 2010 or 2011 suggested selling the Clementi flat and to have Mrs Goh move to a smaller flat nearer to him.[note: 54]When confronted with this fact on the witness stand, Mrs Goh remained protective of Evan, and could only say that this was a suggestion which had not materialised.[note: 55]In contrast, Yvonne and Yvette stated while on the witness stand that their intention was not to sell the Clementi flat as they wanted their mother to continue to live in it, believing that it would not be in her welfare to move to a new place to live in her advanced age.[note: 56]This assertion in court was also consistent with what they had previously told Mrs Goh in private conversation (which were also recorded for these proceedings).[note: 57]Whilst on the stand, Eric protested that Yvonne had also previously suggested that Dennis Goh and Mrs Goh move out of the Clementi flat and live at another place.[note: 58]Eric produced emails between Dennis Goh and Yvonne which he had found with Dennis Goh’s other possessions after the latter passed away.[note: 59]In an email dated 6 October 2007, Yvonne suggested to Dennis Goh that there might come a time when they would have to move out and to let the flat out for additional income.[note: 60]This did not detract from my conclusions. It was evident that Yvonne was speaking of this as something which might have to be done if absolutely necessary; in other words, this was a possibility that was contemplated by Yvonne in 2007 but there was no suggestion that there was any necessity thereafter to sell the flat, nor was there any evidence of any later intention to do so. 38     I also note that Mrs Goh did not have any pressing need to sell or encumber the flat for funds. One room was tenanted out and she kept the rental for her own use. There was also evidence that Dennis Goh’s room was also to be rented out in the near future and again Mrs Goh would keep the rental for her own use. There was clear evidence of a settled practice of Mrs Goh’s medical and other expenses, including the costs of the maid, being shared between the four children. Lucy Theodas’ evidence 39     Lucy Theodas is the niece of the Plaintiffs and the cousin of the Defendants and their brothers Eric and Evan. Lucy Theodas’ evidence, which she gave for the Defendants in this action, came in the form of tape and video recordings of conversations with Mrs Goh. She had, since the commencement of the present action, taken it upon herself to make secret tape and video recordings of conversations with Mrs Goh, with the avowed intention of “fighting for the truth to prevail”; she said that she was uninterested in taking sides and a neutral party to this litigation.[note: 61] 40     Having heard and observed Lucy Theodas under cross-examination, I found that she was an honest person who was quite appalled that her aunt was involved in litigation and also at the legal costs that were being incurred in her aunt’s name. There was a touch of self-righteousness to her evidence but on the whole I found her to be well-intentioned and well-meaning. She had a strong sense of what was right and what was wrong. She clearly only had her aunt’s welfare at heart and had nothing to gain in this dispute. There was clear evidence that she had visited her aunt, brought her food and cared for her welfare. She had made her own inquiries and had concluded that Eric and Evan were behind the litigation; she then set about trying to get the proof. Based on her conversations with Mrs Goh, she had concluded that Mrs Goh was not the one who had commenced the suit, which was why she had begun taping the conversations and recording the incidents. It was therefore not surprising she found herself on the side of Yvonne and Yvette. 41     On 4 February 2013, Lucy Theodas made a recording of the following conversation with Mrs Goh:[note: 62] [Mrs Goh]:Because I want the family to be united …[Yvette]:You want the family to be united. Is that right? But now the family is divided because you never rang and spoke to us. And you know, there could have been a conversation about this before these court proceedings.[Yvonne]:Who decided to take, to go to court? To go to the lawyers? Was it you?…Was it you who decided to take the daughters to court?[Mrs Goh]:Am I capable?[Yvonne]:Well, you can answer yes or not. Was it you mother? We want to know, because we, you know, we are very upset about it.[Mrs Goh]:So now can you take …?[Yvette]:No we can’t do anything now ma.[Yvonne]:Yes. So did you take us to court? Did you?[Mrs Goh]:No. …[Yvonne]:You didn’t? So can you tell me who started this please?[Mrs Goh]:Of course the two boys lah.   42     Next, on 12 February 2013, Lucy Theodas made this recording:[note: 63] [Lucy Theodas]:Aunty, it is very obvious to you the way [Eric] behave.[Mrs Goh]:Yes we know he’s been always like that.[Lucy Theodas]:But you have to stop him this time. If you don’t stop him, the whole family is split up. You suffer, they suffer. You are the matriarch of the family, you have to make a stand.[Mrs Goh]:He’s … an elderly man. I can’t say anything.Yvonne:You are elderly mother. Eric is not elderly. You’re still his mother …[Mrs Goh]:But will he listen to me? All the while he doesn’t listen to me.[Lucy Theodas]:But then why should you have to listen to him? Are you going to continue to sign documents? Aunty, tell me?[Mrs Goh]:It’s very hard to say.[Lucy Theodas]:No you cannot speak in riddles. You must say yes or no.[Mrs Goh]:Even if I say no he will still do it.[Lucy Theodas]:How? He will force your hand?[Mrs Goh]:I don’t know. He hasn’t done it.[Yvette]:So you can phone your lawyers. You can tell them …[Lucy Theodas]:… that you don’t want to do it. You don’t have to tell him.Ask him to bring the lawyers. And you tell the lawyers in the face that you’re not going to sign any more documents. Then you don’t have to face Eric. You are facing your lawyers so to speak.[Mrs Goh]:I don’t have the nerve to do that because I depend on them to feed me.   43     The Defendants sought to rely on this exchange to show that it was not Dennis Goh and Mrs Goh who wanted to have the Defendants remove their names from the title to the Clementi flat, and that it was their brothers who were behind this litigation. This is an issue to which I will return in some detail, below, but for the present purposes, this is relevant to Mrs Goh’s motivation for being involved in the present litigation. 44     From perusing these recordings, it appeared to me that Mrs Goh had found herself in a difficult position caught in the middle of the dispute between her daughters and her sons. This was especially so given that the Defendants were away from Singapore for the most part of the year as they lived in England, and it was her sons in Singapore whom she relied on for her needs and to look after her. Furthermore, Penny looked after the accounts and the splitting of Mrs Goh’s expenses between the four children. 45     There was evidence, as Ms Ragupathy has pointed out in her written closing submissions, of other recordings made by the Defendants in which Mrs Goh sang a completely different tune. In those recordings she was heard to insist rather strongly that the Defendants remove their names from the title to the Clementi flat because, she said, it was not her and Dennis Goh’s intention that the Clementi flat was to go to the Defendants after they had passed away, rather than to all four of their children.[note: 64]In addition to this, I would further add that by the time of the hearing of the evidence in this suit, Mrs Goh herself stated on the first day of the trial: “I want my flat back”.[note: 65]In this regard, it could be suggested that perhaps Lucy Theodas’ selection of recordings was someone selective and biased towards the Defendants. 46     However, Mrs Goh’s prevarication and uncertainty over her true reasons for being involved in this litigation across different conversations at different instances, and also in respect of whether she truly intended to sue the Defendants, served as evidence supporting of the Defendants’ case theory that the present litigation was brought not because of the truth of the allegations made in the Statement of Claim, but rather, for the benefit of and at the behest of Eric and Evan. 47     Mrs Goh was in a vulnerable position. She is wheelchair bound and depended on others to get around and certainly would have accepted whatever assistance her four children gave her. There was clear evidence that the daughters looked after her well so long as they were in Singapore, but they were not in Singapore for the greater part of the year. On a daily basis, she depended more on her sons and Penny. By this I do not mean that they gave her exemplary levels of care. There was evidence of cursory visits. I also noted that Dennis Goh was in an alarming physical condition towards the end of his life: he was covered in bed sores and the clear evidence of neglect, as witnessed by Dr Lim Yun Chin (“Dr Lim”), was undeniable. I have considered the possibility that Mrs Goh may have thought that as the dutiful housewife she had to go along with her husband’s suggestion to put the daughters’ names on the title, and that with his passing, she felt free to express some preference for her sons. I have noted above Prof Tan’s evidence that Dennis Goh felt that Evan had a way of persuading his mother to part with her money to him. But even if that was the case, having voluntarily made the Transfer at the time that she did, she could not later change her mind. However, in weighing all the evidence, I still came round to the conclusion that she was but a pawn in Eric’s and Evan’s plan to recover the flat, brought about by their extreme annoyance in finding out that they had been excluded from a share. I thought that Mrs Goh was now caught in the middle of the fight between the siblings. In the position she was in, Mrs Goh had little choice but to take the path of least resistance by allowing the action to proceed. 48     Ms Ragupathy also questioned the motives of Lucy Theodas for her involvement in the present action. She submitted that Lucy Theodas was an “agent provocateur” and that “[t]he only explanation for Lucy [Theodas] having done all this is clearly a long waited [sic] moment ofschadenfreudeafter the Goh family had snubbed her family when they did not even attend the funeral of her late father”.[note: 66]I rejected the accusation ofschadenfreude. Lucy Theodas came across to me on the witness stand as genuine and as someone who honestly believed that she was taking the right course to right what she perceived as an injustice. Even if Ms Ragupathy could paint Lucy Theodas as appearing somewhat self-righteous in her involvement in this litigation, I was of the view, from observing her demeanour on the witness stand, that there was nothing sinister in her actions in this litigation. In any event, aside from repeatedly questioning the discourtesy inherent in making secret recordings of private conversations, Ms Ragupathy could not really make any inroads into the veracity and truth of Lucy Theodas’ evidence or make any argument that it should be excluded for any reason. The first doctor’s evidence 49     In the preparation for this action, in March 2012, Evan engaged Dr Tian Cheong Sing (“Dr Tian”), a consultant psychiatrist at the Psychiatric & Behavioral Medicine Clinic at Mt Elizabeth Medical Centre, to assess the mental capacity of Dennis Goh, whose mental state had previously started to deteriorate and who was suffering from hallucinations. Dr Tian was asked by the Plaintiffs’ solicitors, Rodyk, to prepare a report as to whether Dennis Goh was, at the material time of the Transfer, capable of knowing the consequences of his decision.[note: 67]Dr Tian produced a report stating that he was unable to answer that question because Dennis Goh had not been assessed at that material point in time,ie, when the Transfer was applied for and executed in 2009 and 2010.[note: 68]Dr Tian, however, reported that at the time of examination in March 2012, Dennis Goh was not suffering from any abnormalities of mind. 50     Interestingly, Dr Tian testified, from his contemporaneous clinical notes, that he was told by Dennis Goh that he had made the transfer in 2010 because he was then “on the female side” (that is, his daughters) and had thought that his sons had deserted him and so did not include them.[note: 69]He then said that he wanted to change his decision so that it would be “a four-sided inheritance”.[note: 70]This supports my conclusion that Dennis Goh had fully intended the transfer and its consequences. It was only at a subsequent point in time that he changed his mind and it should be noted that that only occurred after his sons had found out about the inclusion of their sisters’ names in the title. This also served to displace the allegations that the Defendants had badgered and harassed their parents or had exercised undue influence over them. Dennis Goh made the transfer on his own volition and for his own reasons. Dr Tian’s evidence suggested that Dennis Goh then changed his mind, but that alone was not sufficient reason to revoke the Transfer which had been previously executed freely and voluntarily. It is clear that gifts cannot be revoked “simply because the donors wish they had not made them and would like to have back the property given”:perLindley LJ inOgilvie v Littleboy(1896–97) 13 TLR 399 at 400, affirmed (1899) 15 TLR 294: see also Tang Hang Wu, “Restitution for Mistaken Gifts”, (2004) 20 JCL 1. The New South Wales Court of Appeal case ofAboody v Ryan[2012] NSWCA 395 is also clearly distinguishable on the facts as there the donor was clearly under an obsession that a Labor Government would stop his war pension and take away his property and therefore made an improvident immediate transfer of his property to one daughter and her husband to prevent this state of affairs coming about. I have considered the Australian authorities set out inAboody v Ryanon the principles in respect of relief against unconscionable dealings and found them of little assistance due to the different facts of those cases. As Allsop P stated (at [63]): A number of considerations are important to recognise. First, as Fullgar J inBlomley v Ryan[(1956) 99 CLR 362] at 405 and Mason J inAmadio[(1983) 151 CLR 447] at 461-462 said, there is an underlying general principle, the applications or exemplifications of which are impossible to describe fully. Thus, one should always be careful not to dwell over-technically or textually on individual expressions of general principle of normative values rooted in the remedying of injustice. It is general principle, not a precisely expressed rule, that operates. … 51     It was significant that Dennis Goh did not tell Dr Tian that he had been badgered or pressured or misled or harassed into including the daughters’ names in the title. In contrast, Dr Tian recorded Evan telling him, before the start of the interview with Dennis Goh, that the “2 sisters came to visit the parents. Bamboozled them into putting their names in the HDB lease.”[note: 71]I found it likely that Dennis Goh was being pressured or induced by his sons to revoke the addition of their sisters’ names to the title when infirmity had already taken hold of him. The second doctor’s evidence 52     The picture painted by the evidence before me suggested that this was a family which lived in some degree of fear of the eldest son, Eric. Dr Lim, a specialist psychiatrist and another independent professional, made a house call to attend to Dennis Goh on 7 February 2013. This was an independent professional who had no reason at all to take sides. He recounted his observations of the family at this first and only time when he attended to Dennis Goh. 53     Dr Lim found Dennis Goh on his bed in his bedroom and described what he saw as follows: “an emaciated, cachectic, decrepit, elderly man in a somewhat foetal position with severe muscle atrophy and contractures of all limbs”.[note: 72]He was also found with a huge 4 by 5cm bed sore on the sacral region which had eaten all the way to the bone; Dr Lim could see the sacral bone which was exposed and the sacral sore was inflamed and abscessed.[note: 73]There were also other sores on Dennis Goh and Dr Lim observed that the room smelt of urine.[note: 74]He observed that Dennis Goh’s urinal was not fitted properly and that was causing urine to spill.[note: 75]The photograph of the sacral bed sore that had eaten to the bone was, to say the least, quite disturbing. I pause to note that when the court interpreter saw the photographs of Dennis Goh’s sores, she could not help the tears that kept flowing as she tried to keep her composure. I found Evan’s ingenuous explanation of how nothing could be done once the bed sore started as the flesh was eaten up from below before it broke out on the surface and Penny’s insistence that Dennis Goh wasvery wellcared for and everything that could be done was done, self-serving to the point of callousness. 54     Dr Lim explained to Mrs Goh that her husband was likely to die of scepticaemia and might require hospitalisation in his current state; however, despite the grave medical condition Dennis Goh was in, Mrs Goh “visibly demonstrated fear” at making the decision to seek proper medical help for her husband by sending him to the hospital without her son’s approval.[note: 76]Dr Lim observed that whenever Lucy Theodas, who was also present, tried to talk to her to refer Dennis Goh to the hospital and that that would have been in his best interest, she would reply, “What about brother”.[note: 77]In Dr Lim’s expert opinion, Mrs Goh appeared to have been struggling to make up her own mind.[note: 78] 55     Dr Lim’s evidence of what he observed during two striking instances when the telephone in the flat rang is very telling. He explained:[note: 79] AYour Honour, er, at that time when I saw the patient, that I interviewed Mrs Goh, there were two incidents of major concern for me, and why I feel that I need to make a concomitant assessment of Mrs Goh. The first, when I explained to her that we are dealing with a medical emergency, I could see that apprehension, the fear in her eyes, indicating to me she is ambivalent or she’s struggling. Number two, in the course of the conversation, the phone---the house phone ring, and the---it’slike a scene in the movie, everybody froze and just looked at the phone. This is what---and---and they were---and that was the---the---the scenario. And she was---she---I thought she was petrified, she was looking left and right. And it happened twice, Your Honour. So I came to this conviction is that---Court:What---the phone rang twice?Witness:Twice. Ring and nobody moved.Court:So it stopped?Witness:Stopped and then it ring again.And she was petrified, and she was looking around and---and---and nobody, everybody was looking at the phone.[emphasis added in italics and bold italics]   56     On both occasions, nobody moved; everybody waited until the telephone had stopped ringing.[note: 80]Dr Lim explained that it was apparent to him that everyone had thought that it was Eric who was calling because when the phone rang, Mrs Goh uttered his name and then stopped and looked around and everyone else then stared at the phone until it stopped ringing.[note: 81]All this astonished Dr Lim, who testified that this was something he could not forget, because it was as though he had found himself caught in “a snapshot in [a] movie”.[note: 82]This was a remarkable and telling account from a professional person who did not know any of the family members and was visiting the flat for the first time. 57     Although he was asked to visit the Clementi flat to assess the mental state of Dennis Goh for the purpose of the pending MCA application, because of what he observed, which he described as being “major concern[s]”, Dr Lim felt that it was necessary to make a concomitant assessment of Mrs Goh.[note: 83]It was therefore in this context that he came to the conclusion that Mrs Goh was fearful of her son Eric. 58     These observations of Dr Lim, an independent third party, as to the dynamics of the family were significant. Although his expert psychiatric assessment extended only to Mrs Goh, his factual observations were relevant to understanding the family. This was a family which lived in fear of Eric. It corroborated Dennis Goh’s characterisation of Eric to Prof Tan as “the conniving one.” I was therefore satisfied that there was some truth in the suggestion that Mrs Goh was pressured into taking the position she did. After all, her daughters lived overseas and it was her sons who were in Singapore. She depended on them for her well-being when her daughters were not in Singapore, and it was probable that as a result, they yielded a considerable amount of influence over her. Mrs Goh allegedly kept from communicating with the Defendants 59     Yvonne and Yvette complained, through counsel, that since the commencement of this action, Mrs Goh had been moved to Eric’s residence, and had in fact been kept from making any communication with the Defendants. I understood that there was a pending application in the Family Courts touching upon this issue, and because this was not in issue in the present case, I will say no more about it.",
        "The true parties to this action": "60     For the reasons stated above, I came to the conclusion that there was more than a strong suspicion that there was some truth in the case put forth by the Defendants that their siblings, Eric and Evan, and Eric’s wife Penny, were the main driving forces behind this suit. Pursuant to this belief, Mr Dodwell repeatedly made clear his intention to seek costs against these three non-parties in the event the Defendants succeeded in defending the present claim. Eric, Evan, and Penny were all subpoenaed by the Defendants to give evidence at this trial. Eric’s and Penny’s involvement 61     I now turn to consider Penny and Eric’s involvement in the present legal proceedings. 62     Eric and Penny took broadly similar positions as regards their degree of involvement in the current legal proceedings. Both admitted that they continued to receive emails and legal documents as well as liaised with the Plaintiffs’ solicitors following the initial engagement of the lawyers.[note: 84]However they insisted that they only did so on the Plaintiffs’ behalf: in their own words they were “a reader or mouthpiece”,[note: 85]a “touch point”[note: 86]or a “post office … liaison person”.[note: 87] 63     At this juncture, I think it pertinent to note Eric’s evasiveness and prevarication even on the simple issue of whether he had received and read the affidavits of evidence-in-chief filed in these proceedings. Initially, Eric categorically stated that he had not been given any affidavits in relation to this case.[note: 88]When pressed on why he had earlier referred to documents in “somebody’s affidavit”, Eric claimed that this was raised in a discussion with his wife.[note: 89]Finally, when warned about the possible consequences of perjuring himself on the stand and asked to confirm his earlier answer, Eric turned evasive and gave a series of non-answers before he finally claimed that he could not remember.[note: 90]A few days after this exchange, Eric completely changed his tune again and admitted to having received and read the affidavits of evidence-in-chief to his mother in order to assist her in these proceedings.[note: 91]I further observe that all of this came hot on the heels of his confident pronouncements at the start of his cross-examination that “… this suit has got nothing to do with me nor my wife”.[note: 92]I found that Eric’s constant and furious backpedalling seriously undermined the credibility of his evidence. 64     This aside, subsequent incidents at trial also cast serious doubt on Eric and Penny’s assertions. It emerged during trial that Eric had with him on the stand, as anaide memoire, a clear box folder containing a bundle of papers with post-it notes on which comments were written.[note: 93]Amongst the papers were emails and letters exchanged between Dennis Goh and the Defendants. When questioned, Eric stated that Penny had compiled the papers in the clear box folder and had written the comments on the post-it notes; he also averred that the correspondence was extracted from the bundles of documents tendered to court.[note: 94]Having had sight of these papers, I pointed out to Eric the lack of page numbers on them (which would have been present had they been copied from court bundles). He thereupon admitted that the clear box folder not only contained extracts of affidavits and bundles of documents tendered to court but also documents which had been sent by the Plaintiffs’ lawyers in the course of legal proceedings.[note: 95]Penny subsequently confirmed that she had collected the documents from Dennis Goh’s files in the Clementi flat and personal computer, compiled them and written the post-it notes.[note: 96] 65     Neither Eric nor Penny was able to offer a satisfactory explanation as to why they had taken the steps they did. For instance, Penny initially sought to explain that these documents contained information relevant to Dennis Goh’s medical condition and then professed ignorance when I pointed out that some of the documents pertained to email exchanges with her sisters-in-law (ie, the Defendants) which were completely unrelated to Dennis Goh’s medical condition.[note: 97]It was clear to me that both Eric and Penny were gathering evidence in order to refute or undermine the Defendants’ claims. This was highly unusual for self-proclaimed uninterested parties allegedly serving as mere conduits of information to the Plaintiffs. 66     I was further of the view that Eric had somehow kept himself informed of what had transpired at the trial despite having been served a subpoena and knowing that Penny and Evan were later to take to the witness stand. 67     First, in order to buttress his assertion that Mrs Goh had confirmed that she had wanted the Defendants’ names off the deed, Eric referred to a conversation between one Mr Hsieh Fu Hua (“Mr Hsieh”) and Mrs Goh which he claimed was mentioned in Lucy Theodas’ affidavit.[note: 98]When it was pointed out to him that the name of Mr Hsieh was not mentioned in Lucy Theodas’ affidavit but instead in emails which had been tendered to court as exhibits in the course of her cross-examination, Eric was quick to change his evidence and stated instead that he had read it in a “loose leaf document” during one of the intervals when the court was in recess[note: 99]and that he had used the term “affidavit” generically.[note: 100]Subsequently, when it was pointed out to him that there was no mention of that particular exchange between Mrs Goh and Mr Hsieh, Eric made a 180-degree-turn again and claimed that he had witnessed the exchange in his own home.[note: 101] 68     Secondly, Eric sought to adduce photographic evidence to counter accusations levelled against him by Yvette that he had neglected to bring Dennis Goh to an important Scout’s event to receive a gold medal from Senior Minister Mr Goh Chok Tong after promising him that he would do so and that this had left Dennis Goh crying.[note: 102]This was an accusation levelled only when Yvette took the witness stand and there was no mention of it in her affidavit of evidence-in-chief or the affidavits of evidence-in-chief of the other witnesses. Eric thus should not have had knowledge of this. Yet he was able, even before coming to court to give evidence, to prepare evidence to counter these allegations. Again, far from being a disinterested and passive conduit of information for Mrs Goh, Eric ensured that he followed the present proceedings with keen interest and had in fact taken active steps to find evidence to counter the Defendants’ case. 69     Both Penny and Eric did not deny that they had paid moneys for the litigation and this was borne out by a withdrawal of $60,500 from their United Overseas Bank Joint Account No XXX-XXX-806-1 on 19 March 2013.[note: 103]Penny however elaborated later that she had paid the initial litigation fees first but only because Mrs Goh was waiting for some cash from the sale of her shares to pay her back and thereafter the rest of the litigation fees were paid by remittances from Mrs Goh’s bank account.[note: 104]This was also Mrs Goh’s evidence when I questioned her.[note: 105]However I also observed that when probed further by me, Mrs Goh admitted that she never asked how much Rodyk was charging her and also did not know how much had been incurred so far.[note: 106]I also note that her evidence that she had repaid Penny was at odds with her conversations with Lucy Theodas, where she repeatedly emphasised that she could not afford a lawyer in early 2013 (these conversations being in the recordings made by Lucy Theodas).[note: 107] 70     As noted above, a startling revelation was made on the last day of trial when Ms Ragupathy was only able to produce a Warrant to Act signed by Eric on 26 January 2012 and confirmed she had no warrants to act from either Dennis Goh or Mrs Goh. Eric subsequently confirmed that he had paid the deposit for the lawyers and had received advice in relation to the Warrant to Act that he signed.[note: 108]It suffices to note that this was weighty evidence of Eric’s links to the present proceedings. 71     For the abovementioned reasons, I was not convinced that Eric and Penny were, as they claimed, mere conduits of information and communications between Mrs Goh and her lawyers. Evan’s involvement 72     I found that Evan, on the other hand, was a rather more passive participant in the present suit. Evan gave evidence that he was not in the loop with regards the emails from Rodyk.[note: 109]This was confirmed by both Eric and Penny.[note: 110]Instead, he would only be copied into the emails when they were relevant to him.[note: 111]There was also no evidence that Evan had any interactions with the Plaintiffs’ lawyers beyond what was stated above or when he brought the Plaintiffs to the offices of Rodyk. There was also no evidence that he paid any of the litigation bills. The application in Summons No 4389 of 2013 73     After the evidence was completed and the trial was concluded, the Defendants took out Summons No 4389 of 2013 seeking to strike out the action brought in the name of Dennis Goh. A short five page affidavit (with supporting exhibits) was filed in support of the application. I directed that the application was to be dealt with by counsel in their final written submissions, as that relatively short affidavit did not, in my judgment, meet the high threshold necessary for a striking out. I therefore made no order on Summons No 4389 of 2013. I indicated, however, that this would not foreclose any arguments the Defendants might wish to make in respect of the costs of the present writ action being borne by a non-party.",
        "Conclusion": "74     Having found that the Plaintiffs’ allegations of fact had not been made out, I dismissed their claim against the Defendants. 75     I directed that I would hear the parties on costs. I further directed that if Mr Dodwell was going to seek an order that the costs of these proceedings are to be borne by Eric and/or Penny and/or Evan, he was to serve a copy of the brief oral grounds of decision I had handed down on 16 October 2013 on them and their solicitors and that he should give them notice of the date fixed for the parties to be heard on costs.  [note: 1]NE 17.07.2013 72/5–72/18. [note: 2]Eileen Goh’s AEIC at para 21. [note: 3]Eileen Goh’s AEIC at para 22. [note: 4]Eileen Goh’s AEIC at para 23 and 28. [note: 5]NE 26.04.2013 49/27–49/30, 51/19–51/30. [note: 6]NE 26.04.2013 49/40–50/19. [note: 7]NE 26.04.2013 49/22–23. [note: 8]NE 29.04.2013 54/30–31. [note: 9]NE 02.05.2013 2/21–26. [note: 10]NE 02.05.2013 2/27–3/10. [note: 11]NE 03.05.2013 72/7–73/15. [note: 12]NE 03.05.2013 72/13–73/15. [note: 13]NE 03.05.2013 76/9–76/21. [note: 14]NE 03.05.2013 74/17–74/31, 99/31–100/10. [note: 15]NE 03.05.2013 76/26–77/3. [note: 16]NE 26.04.2013 66/27–/66/29. [note: 17]NE 26.04.2013 66/30–67/3. [note: 18]NE 26.04.2013 65/10–65/8. [note: 19]NE 26.04.2013 66/5–66/8. [note: 20]NE 03.05.2013 99/26–99/30. [note: 21]NE 09.05.2013 29/28–31/24. [note: 22]NE 09.05.2013 35/13–37/2. [note: 23]NE 09.05.2013 37/12–37/31. [note: 24]Yvonne Goh’s AEIC at p 158. [note: 25]NE 18.07.2013 29/8–30/6. [note: 26]NE 18.07.2013 30/6–30/14. [note: 27]NE 07.08.2013 94/5–95/24. [note: 28]Yvonne Goh’s AEIC at para 22. [note: 29]Kevin Tan’s AEIC at para 5. [note: 30]NE 05.08.2013 80/30–82/31. [note: 31]NE 26.04.2013 37/30–38/20. [note: 32]NE 18.07.2013 10/9–10/10. [note: 33]2nd Supplementary Bundle of Documents Produced by Goh Whye Mun Eric at pp 2–4. [note: 34]NE 05.08.2013 7/7–8/2; 2nd Supplementary Bundle of Documents Produced by Goh Whye Mun Eric at p 2. [note: 35]NE 07.08.2013 82/29–83/9. [note: 36]NE 07.08.2013 84/6–84/25. [note: 37]Yvonne Goh’s AEIC at p 191. [note: 38]Kevin Tan’s AEIC at para 5. [note: 39]NE 07.08.2013 115/10–115/28, 124/6–124/10. [note: 40]NE 07.08.2013 128/18–130/20. [note: 41]NE 07.08.2013 118/17–120/7, 159/28–160/11. [note: 42]Kevin Tan’s AEIC at para 11. [note: 43]Kevin Tan’s AEIC at para 10. [note: 44]Kevin Tan’s AEIC at para 9. [note: 45]Kevin Tan’s AEIC at para 11. [note: 46]Kevin Tan’s AEIC at para 9. [note: 47]Kevin Tan’s AEIC at para 10. [note: 48]NE 07.08.2013 70/23–72/14. [note: 49]NE 07.08.2013 72/15–72/17. [note: 50]NE 07.08.2013 79/23–80/4. [note: 51]NE 07.08.2013 79/32–80/12. [note: 52]NE 07.08.2013 74/5–74/20. [note: 53]NE 17.07.2013 89/5–89/13. [note: 54]NE 07.08.2013 70/31–71/30. [note: 55]NE 29.04.2013 80/24–81/2. [note: 56]NE 17.07.2013 87/25–15; NE 18.07.2013 41/16–41/23, 42/12–42/13; NE 23.07.2013 45/8–45/26, 59/8–59/17. [note: 57]See,eg, Yvette Goh’s AEIC at para 28(a)(ii). [note: 58]NE 06.08.2013 68/9–68–11. [note: 59]Exhibit D-21. [note: 60]Exhibit D-21(6). [note: 61]Lucy Theodas’ AEIC at para 15. [note: 62]Lucy Theodas’ AEIC at p 48. [note: 63]Lucy Theodas’ AEIC at p 53. [note: 64]Plaintiffs’ Closing Submissions at paras 162–168. [note: 65]NE 26.04.2013 27/13. [note: 66]Plaintiffs’ Closing Submissions at para 179. [note: 67]Tian Cheong Sing’s AEIC at TCS-2. [note: 68]Tian Cheong Sing’s AEIC at TCS-1. [note: 69]NE 30.04.2013 24/11–25/6. [note: 70]NE 30.04.2013 24/22–24/26. [note: 71]NE 30.04.2013 43/7–43/30. [note: 72]Lim Yun Chin’s AEIC at p 13. [note: 73]Lim Yun Chin’s AEIC at p 13; NE 10.05.2013 5/2–9/15. [note: 74]NE 10.05.2013 5/16–5/23. [note: 75]NE 10.05.2013 43/2–44/2. [note: 76]Lim Yun Chin’s AEIC at p 14; NE 10.05.2013 13/25–14/21. [note: 77]Lim Yun Chin’s AEIC at p 15. [note: 78]Lim Yun Chin’s AEIC at p 14. [note: 79]NE 10.05.2013 21/6–21/22. [note: 80]NE 10.05.2013 29/1–29/9. [note: 81]NE 10.05.2013 58/7–58/14. [note: 82]NE 10.05.2013 24/15–24/17. [note: 83]NE 10.05.2013 21/1–21/8. [note: 84]NE 05.08.2013 73/8–73/11; NE 07.08.2013 49/9–50/3. [note: 85]NE 05.08.2013 14/29. [note: 86]NE 05.08.2013 15/21– 5/31. [note: 87]NE 07.08.2013 55/12. [note: 88]NE 23.07.2013 129/12–129/17. [note: 89]NE 23.07.2013 129/18–129/22. [note: 90]NE 23.07.2013 129/26–130/22. [note: 91]NE 05.08.2013 11/13–11/17, 14/11–15/2. [note: 92]NE 23.07.2013 126/24–126/25, 127/5. [note: 93]NE 05.08.2013 69/27–69/29, 70/12–70/21. [note: 94]NE 05.08.2013 69/30–70/1. [note: 95]NE 06.08.2013 24/5–24/18. [note: 96]NE 07.08.2013 64/7–65/5. [note: 97]NE 07.08.2013 64/29–64/31. [note: 98]NE 05.08.2013 99/27–99/29. [note: 99]NE 06.08.2013 29/9–30/31. [note: 100]NE 06.08.2013 41/10–41/17. [note: 101]NE 06.08.2013 39/3–40/4. [note: 102]NE 23.07.2013 71/26–72/26. [note: 103]2nd Supplementary Bundle of Documents Produced by Eric Goh at p 73. [note: 104]NE 07.08.2013 56/7–56/14. [note: 105]NE 09.05.2013 21/26–21/30. [note: 106]NE 09.05.2013 21/21–22/3. [note: 107]Lucy Theodas’ AEIC pp 70, 80 and 90. [note: 108]NE 07.08.2013 27/15–27/20. [note: 109]NE 07.08.2013 69/32–70/2. [note: 110]NE 05.08.2013 73/6–73/7; NE 07.08.2013 49/23–49/28. [note: 111]NE 07.08.2013 50/6–50/11."
    }
}