{
    "case_title": "AOF\n      v\n      ACP and another",
    "ncitation": "[2014] SGHC 99",
    "coram": "George Wei JC",
    "sections": {
        "Introduction": "1       This case concerns the application by the plaintiff wife (“the Plaintiff”) in respect of ancillary matters arising out of the divorce with the defendant husband (“the Defendant”). Given that both parties had declared the value of the matrimonial assets as exceeding $1.5m, the hearing of the ancillary matters was transferred to the High Court. The matter first came before me on 8 October 2013 and an adjournment was granted for parties to forward to the Supreme Court their respective affidavits in relation to the ancillary matters. The hearing eventually took place on 17 December 2013 and I reserved judgment upon the conclusion of the hearing.",
        "The proceedings below": "2       Divorce proceedings were commenced by the Plaintiff on 8 March 2011 on the grounds of adultery by the Defendant with the Co-Defendant. The Defendant did not contest the divorce and interim judgment was granted on 13 May 2011. 3       On 12 April 2011 (shortly before the interim judgment was granted), the learned District Judge, Mr Edgar Foo Mau Peng, made an interim order granting care and control of the child to the Defendant, with the Plaintiff having supervised access in accordance with certain terms set out in the interim order.The Plaintiff subsequently appealed to the High Court in Registrar’s Appeal Subordinate Courts No 69 of 2011 (“RAS 69/2011”) where she sought care and control of the child. On 9 September 2011, Philip Pillai J granted the Plaintiff and the Defendant joint custody of the child. Nevertheless, care and control of the child was to remain with the Defendant. Revised provisions were also set out in detail as regards the issue of interim access by the Plaintiff. This included obligations imposed on both parties to ensure that the child complied with the court-ordered access arrangements. Parties were also given liberty to apply to court in the event of non-compliance with the interim order. 4       At the ancillary proceedings before this court, the Plaintiff has sought care and control of the child and for a division of the matrimonial assets, details of which are set out below. In addition, she has also sought an order for nominal maintenance of $1 per month for herself.[note: 1]In response, the Defendant disputes the need for nominal maintenance and argues that a clean break would be appropriate on the facts of the present case.[note: 2]The Defendant has in turn sought an order that the Plaintiff contributes $1,000 per month towards the child’s savings account, which will be set aside as savings for the child’s future.[note: 3]",
        "The parties’ marriage": "5       The parties were married on 16 March 1997. Given that the interim judgment was granted on 13 May 2011, the length of the marriage was approximately 14 years. The only child of the marriage was 12 years old at the time of the ancillary proceedings.[note: 4]",
        "The Defendant’s employment": "6       At the time when the child was born, the Defendant was working as an IT Manager at the Royal Bank of Scotland (“RBS”).[note: 5]Sometime in April or May 2008, the Defendant’s employment with RBS was terminated.[note: 6]Thereafter, the Plaintiff asserts that the Defendant undertook some contract work with Merrill Lynch from December 2008 to October 2009, as well as with the Australian and New Zealand Banking Group from November to December 2009.[note: 7]It appears that the Defendant may also have undertaken some freelance work in Johor Bahru, Malaysia in May 2008. 7       I note that the evidence as to the extent and nature of the Defendant’s employment and income after leaving RBS in April or May 2008 until his declared present employment as a Project Manager with [B] Pte Ltd is far from clear. 8       Nevertheless, it appears that between 1 January 2010 and 31 December 2011, the Defendant may have been unemployed given that he had declared his income as being $1, as reflected in his IRAS Notice of Assessment for both 2011 and 2012.[note: 8]That said, it is not disputed that the Defendant has now secured employment as a Project Manager with [B] Pte Ltd with a gross monthly salary of $12,000.[note: 9]It is not, however, immediately clear as to when he secured this position.",
        "The Plaintiff’s employment": "9       During the course of the marriage, it appears that the Plaintiff was working for a bank in Singapore. In fact, the Plaintiff states in her affidavit that she is presently working as a Product Controller in the position of an Assistant Vice President at [C].[note: 10]She has declared a monthly gross income of $9,083.33, while her monthly take-home pay, inclusive of bonuses and commission, was said to be $7,866.[note: 11]In support of her declarations, the Plaintiff has exhibited payslips for the months of December 2011 to February 2012, together with an IRAS Notice of Assessment dated 3 June 2011.[note: 12]In addition, it is noted that the Plaintiff has also included in her Bundle of Authorities and Documents a copy of her latest employment contract with [D] dated 5 June 2013.[note: 13]This contract states that, as from 2 September 2013, the Plaintiff was to be employed by [D] as an Assistant Vice President (Product Control) with a basic annual salary of $70,000. The contract also makes reference to her eligibility for an annual discretionary variable incentive award. 10     It appears that the Plaintiff worked in Singapore throughout the entire marriage. On this basis, the Plaintiff asserts that she had been able to look after the child and the parties’ matrimonial home with the assistance of a domestic helper.[note: 14]",
        "The matrimonial assets": "11     With reference to the written submissions and affidavits, it appears that the parties purchased two real properties during the course of their marriage. The first is an HDB flat at [address redacted] (“the HDB Property”). This property is held by the parties jointly and the Plaintiff has described it as the HDB matrimonial home. It is not clear from the evidence before me as to when exactly the HDB Property was acquired, although it seems likely to have been sometime in 1997. The second property is a private apartment at [address redacted] (“the Private Property”). The Private Property was purchased in November 2001 at the price of $844,823.[note: 15]The parties moved into the Private Property towards the end of 2004. The parties’ intention was to rent out the HDB Property and apply the rental proceeds towards the repayment of the mortgage for the Private Property. 12     Towards the end of 2008, the parties decided to move out of the Private Property into a rented accommodation at [address redacted] (“the Rented Apartment”). It appears that this was about the time when the Defendant’s employment with RBS was terminated. According to the Plaintiff, the parties had been facing problems in their relationship and the idea behind the move was to lease out the Private Property and for the parties to have a fresh start in the Rented Apartment.[note: 16]In addition, the Plaintiff asserts that the parties agreed to use the rental proceeds from the Private Property to offset the rent for the Rented Apartment.[note: 17]Subsequently, the Plaintiff terminated the lease for the Rented Apartment as she had problems paying the rent, as well as the monthly mortgage instalments for the Private Property.[note: 18]According to the Plaintiff, this was because the Defendant had failed to hand over the rental proceeds for both the HDB Property and the Private Property.[note: 19]Thereafter, the Plaintiff moved back to her parents’ home. 13     As regards the division of matrimonial assets, the Plaintiff has sought the following orders: (a)     for the HDB Property to be divided on a 60:40 basis in her favour,[note: 20]and (b)     for the Private Property to be divided on a 90:10 basis in her favour.[note: 21] 14     With regard to the assets in each party’s sole name, both parties agree that each is to retain such assets which are in their individual names, including but not limited to:[note: 22] (a)     money in their own bank accounts; (b)     money in their respective CPF accounts; (c)     insurance policies; and (d)     motor vehicles. 15     As for all other matrimonial assets held in their joint names, the Plaintiff has asked for these assets to be divided equally.[note: 23]The Plaintiff has also asked for the Defendant’s name to be removed as the nominated beneficiary in four insurance policies.[note: 24] 16     The Defendant, on the other hand, has prayed for a division of the HDB Property on a 80:20 basis in his favour.[note: 25]As regards the Private Property, the Defendant has sought a division on a 50:50 basis.[note: 26]",
        "Care, control and access of the child": "17     Before moving on to the issue of the division of matrimonial assets, I will first deal with the Plaintiff’s request for care and control of the child to be awarded to her. 18     It will be recalled that on 9 September 2011, at the hearing of RAS 69/2011, Pillai J granted interim care and control of the child to the Defendant, with detailed conditions governing the Plaintiff’s right of access. The Plaintiff asserts that the proceedings arose from the fact that the child was taken away from her by the Defendant on 13 April 2010.[note: 27]This was about a year before divorce proceedings were commenced and well before the interim order was made. The circumstances in which the child was taken away in April 2010 are unclear. Nonetheless, it is undisputed that ever since they were separated, the Plaintiff has had very little contact with the child. Notwithstanding the interim access order in the Plaintiff’s favour, it appears that the child has been very reluctant to see the Plaintiff even though she is keen to see the child. The Defendant states that he has no objections at all to the Plaintiff having access in accordance with the interim order granted by Pillai J.[note: 28]The only problem is that the child refuses to see the Plaintiff. 19     In these circumstances, the Plaintiff obtained further directions from Pillai J on 6 February 2012 for the Defendant to deliver the child to the Plaintiff for access on 8 February 2012 and 15 February 2012, with access thereafter as per the interim order dated 9 September 2011. Unfortunately, on the day ordered for the commencement of access, the child handed the Plaintiff a police report made by him in which he stated that he did not want to see the Plaintiff.[note: 29]The police report was made at 11.32pm on [date redacted] at [location redacted] and was signed by the child.[note: 30]It states in no uncertain terms that the child did not wish to see his mother. Nevertheless, the circumstances in which the child, then aged 11, had made the police report are unclear. There is also no other evidence explaining the circumstances in which the report was made by the child. 20     Whilst the Plaintiff has sought an order for care and control of the child, she has stated in her written submissions that in the event the court is not minded to grant the order, she is praying for access to be granted on the same terms set out in the interim order dated 9 September 2011.[note: 31] 21     The Defendant has sought an order for care and control to remain with him on the grounds that this is in the best interests of the child. Whilst he is ready and willing to comply with the access order in favour of the Plaintiff, he underscores that the child is unwilling to see the mother.[note: 32]In his written submissions, the Defendant asserts that the child is well-adjusted, well looked after and doing well in school.[note: 33]In fact, at the hearing before me on 17 December 2013, counsel for the Defendant tendered the child’s 2013 PSLE certificate, showing an aggregate score of 260 with A* grades for English, Mathematics and Science. Even though the PSLE certificate had not been exhibited in the Defendant’s earlier affidavits, counsel for the Plaintiff did not object to the certificate being tendered to the court. 22     The evidence as set out in the affidavits on the child’s relationship with his parents is sparse. It is noteworthy that notwithstanding the assistance of the domestic helper, the Plaintiff was the parent who had looked after the child for many years since his birth. It is not immediately apparent from the affidavits as to why the District Judge or Pillai J ordered interim care and control to the Defendant. Nevertheless, it is clear that Pillai J took into account the fact that the child was unwilling to see the Plaintiff. To this end, it was stated unequivocally that the parties were to ensure the child complied with the stipulated access and that the child’s views were not to override the interim order. It is also pertinent to note that the interim order provided that the child was to be taken for counselling before the commencement of access and that both the Plaintiff and the Defendant were to attend a parenting workshop without the child. Similar provisions were also present in the learned District Judge’s order. 23     Notwithstanding these circumstances, it must be acknowledged that the paramount consideration is the best interests of the child. The son is now almost 13 years of age and he has not seen his mother for more than three years. Thus, it is very natural that the Plaintiff finds the current state of affairs to be distressing. Nevertheless, I do not see any basis for disturbing the status quo provided by the interim order. In this regard, continuity is a factor that may be taken into account by the court in determining what would be in the best interests of the child. In the Court of Appeal decision ofWong Phila Mae v Shaw Harold[1991] 1 SLR(R) 680, the parents had been embroiled in multiple acrimonious disputes over the custody of their children. In deciding that the children were best served by allowing the existing arrangement to continue, Chao Hick Tin J (as he then was) made the following observations (at [27]): ... We noted that by the time the matter came up for hearing before the learned judge, the children had all been placed in schools here and were in the course of settling down in their studies. We did not think that the exercise of the discretion by the learned judge was wrong considering all the circumstances. When the appeal came up before us more than a year later, all the more so we did not feel inclined to alter the order of things which alteration we thought was likely to cause the children emotional stress and affect their studies. On the facts of the present case, it appears that the child has settled down in his current living environment and there is no evidence before this court that his well-being is compromised in any way. Moreover, the child also happens to be performing well academically. To that end, given the state of the relationship between the child and the Plaintiff, I am not convinced that a sudden change in living arrangements would be in the child’s best interests. Contrary to that, it may even result in a certain degree of emotional stress if the situation is not handled in a delicate and appropriate manner. On this basis, I am of the view that care and control of the child should remain with the Defendant. 24     As regards the question of access, I am mindful of the child’s strong resistance to seeing his mother. It is, however, also accepted that the Plaintiff is the mother of a teenage son and that she should have access to her child. Even though relations between the Plaintiff and the child appear to be very strained, it must be in the child’s interest that all attempts are made to preserve or repair the mother-child relationship. In any event, s 125(2) of the Women’s Charter (“the Act”) clearly states that: In deciding in whose custody a child should be placed, the paramount consideration shall be the welfare of the child andsubject to this, the court shall have regard – (a)to the wishes of the parents of the child; and (b)to thewishes of the child, where he or she is of an age to express an independent opinion. [emphasis added] In this respect, the wishes of the child aresubject tothe overriding consideration of what would be in the best interests of the child. The paramount consideration of the welfare of the child must also be taken into account when determining whether “a parent deprived of custody” is to have “right of access to the child at such times and with such frequency as the court may consider reasonable” (see s 126(2)(d) of the Act). 25     In the recent High Court decision ofABW v ABV[2014] SGHC 29, Judith Prakash J highlighted the importance of allowing the non-custodial parent to have access to the child (at [25]): ... This type of access is necessary to preserve and maintain the ties of affection between the child and the non-custodial parent and it is an important part of the welfare principle. The courts have observed that a child who understands that both his parents have custody of him and continue to be involved in his life is likely to feel more secure and that the same surely applies to access orders as well (seeBG v BF[2007] 3 SLR(R) 233 at [13]). In the same judgment, Andrew Ang J noted that as far as possible, “a child should be allowed to interact with both parents, so that despite the breakdown in relations between the parents, he is assured, to the greatest extent possible, of a normal family life with two parents”. On the facts of the present case, I am of the view that denying the Plaintiff access to the child cannot be said to be in the child’s best interests as that would be akin to a complete alienation of the child from his mother. 26     Accordingly, I grant access on the same terms as ordered by Pillai J in RAS 69/2011. For the avoidance of doubt, in view of the police report and the apparent strength of the child’s views, the commencement of access will, as before, begin after the Defendant has taken the child for further counselling. I implore both the Plaintiff and the Defendant to put aside their differences so as to enable the child to continue maintaining a healthy and positive relationship with both parents, despite the breakdown in marital relations.",
        "Division of the parties’ matrimonial assets": "27     I will move on to address the issue of how the parties’ matrimonial assets ought to be divided. In this respect, I will first consider the parties’ declared assets and means, the direct financial contributions to the HDB Property and the Private Property, and the indirect contributions towards the marriage. After doing so, I will then evaluate what would be a just and equitable distribution of the matrimonial assets based on a holistic assessment of the above-mentioned factors.",
        "Plaintiff’s declared assets and means (apart from the HDB Property and the Private Property)": "28     At the outset, I note that there is considerable dispute between the parties as to the rental proceeds from the HDB Property and the Private Property. This will be dealt with separately below. 29     As at the date of the hearing, the Plaintiff lists the following as her assets:[note: 34] (a)     Motor vehicle: (i)       Fiat 500 Lounge 1.4A, with an estimated value of $65,000 as at 27 February 2012. The outstanding amount under the hire purchase agreement was $67,529.15 as at 9 December 2011. (b)     Insurance policies: (i)       AIA 21-Year Special Modified Anticipated Endowment, with an insured amount of $15,000 and a surrender value of $9,834.71; (ii)       AIA Financial Guardian Basic, with an insured amount of $25,000 and a surrender value of $6,631.87; (iii)       AIA Prime Life (AB), with an insured amount of $100,000 and a surrender value of $15,841.93; (iv)       AIA Hospitalisation, with an insured amount of $12,500 and no surrender value; (v)       NTUC Income IncomeShield (Plus Rider), which is essentially a hospitalisation plan for the Plaintiff’s mother that has no surrender value; (vi)       NTUC Income (Growth), with an insured amount of $19,920 and a surrender value of $15,333.89; and (vii)       Prudential PruEduSave for the child, with an insured amount of $38,000 and a surrender value of $12,041.36. (c)     Shares: (i)       4,000 shares of Frasers Commercial Trust, with an estimated value of $2,960 as at 31 December 2011. (d)     Bank accounts: (i)       OCBC Savings, with a balance of $1,003.61 as at 21 February 2012; (ii)       DBS Cashline, with an outstanding loan amount of $14,561 as at 10 February 2012; (iii)       OCBC SRS, with a balance of $7,266.46; and (iv)       OCBC Savings jointly held with the child, with a balance of $2,332.03. (e)     CPF account balance as at 25 February 2012: (i)       Ordinary Account: $19,089.39; (ii)       Medisave Account: $41,000; and (iii)       Special Account: $71,166.96. 30     In her affidavit of assets and means, the Plaintiff also sets out her liabilities as follows:[note: 35] (a)     $359,524.49 owing to DBS Bank Ltd, being the outstanding mortgage loan on the Private Property as at 3 August 2011; (b)     $67,529.15 owing to Standard Chartered Bank, being the outstanding car loan as at 9 December 2011; (c)     $13,884 owing to Koh Sing Wai Jason, being the personal loan by the Plaintiff’s brother to her for settling the outstanding loan amount upon sale of the Defendant’s car; (d)     $5,723.18 owing to the MCST of the Private Property, being the outstanding MCST fees as at 31 December 2011; and (e)     $48,499 owing to Segeram & Co, being the outstanding legal fees as at 29 February 2011.",
        "Defendant’s declared assets and means (apart from the HDB Property and the Private Property)": "31     In his affidavit of assets and means, the Defendant has declared his assets as follows:[note: 36] (a)     Motor vehicle: (i)       Nissan Cefiro, with an estimated scrap value of $16,000 as at 2 February 2012. The outstanding amount under the hire purchase agreement was $15,000. (b)     Insurance policies: (i)       NTUC Income Umbrella, with no surrender value and the insured amount is indicated as “N.A.”; (ii)       NTUC Enhanced IncomeShield, with no surrender value and the insured amount is indicated as “N.A.”. The beneficiary is the child; (iii)       AXA Private Motor, with no surrender value; (iv)       NTUC Dependant’s Protection, with an insured amount of $7,850 and no surrender value; (v)       NTUC Foundation, with an insured amount of $150,000 and $20,000 for the Child Plus Rider. The surrender value is $18,441.97 as at 2 February 2012. The beneficiary is the child. (vi)       NTUC Growth, with an insured amount of $24,390 and a surrender value of $20,117.75 as at 2 February 2012; (vii)       NTUC IncomeShield Enhanced Preferred with no surrender value and the insured amount is indicated as “N.A.”. The beneficiary is stated to be the child; and (viii)       NTUC IncomeShield Enhanced Preferred with no surrender value and the insured amount is indicated as “N.A.”. The beneficiary is stated to be the child. (c)     Bank accounts: (i)       Account (name of bank not provided) jointly held with the Plaintiff, with a balance of $10; (ii)       Account (name of bank not provided) jointly held with the Co-Defendant, with a balance of $1,300; (iii)       DBS Savings Plus, with a balance of $67.92 as at 30 September 2011; and (iv)       UOB Uniplus, with a balance of $517.14 as at 31 October 2011. (d)     CPF account balance as at 31 December 2011: (i)       Ordinary Account: $10,904.55; (ii)       Medisave Account: $40,736.26; and (iii)       Special Account: $61,833.95. (e)     Others: (i)       Membership with The Legends Gold & Country Club Resort Bhd (Malaysia) valued at $5,000. 32     The Defendant has also declared numerous debts and liabilities as follows:[note: 37] (a)     $25,000 owing to one Yap Guek Hoon, being a personal loan to the Defendant; (b)     $15,000 owing to Thong Lee Trading (Pte) Ltd , being the outstanding car loan; (c)     $5,482.85 owing to OCBC Bank, being the outstanding amounts for 2 Robinson credit cards; (d)     Amounts owing to UOB Bank: (i)       $15,195.12, being the outstanding amount for the CashPlus Overdraft account; and (ii)       Various credit card debts for the sums of $2,622.24, $1,608, $0.18, $447.71, $3,259.81, $2,277.54 and $4,151.25 as at 20 October 2011; and (e)     Amounts owing to DBS Bank: (i)       $19,504.95, being the outstanding amount for the Cashline account as at 9 November 2011; and (ii)       Various credit card debts for the sums of $9,446.30 and $163 as at 12 October 2011.",
        "Defendant’s financial position": "33     As a whole, the evidence on the Defendant’s assets and means is sparse. Whilst I accept that it is the current earnings of the Defendant that are of immediate relevance, the dearth of evidence as to his earnings before the commencement of his current employment does have a bearing on the court’s assessment of his ability to have financially contributed to the mortgage repayments and other household expenses in the preceding years prior to the breakdown of the marriage. This is especially so bearing in mind the Plaintiff’s assertion that she was the primary breadwinner of the family from around April and May 2008 up to the breakdown of the marriage.[note: 38] 34     I also note that the Plaintiff had obtained an Order for Discovery/Interrogatories dated 9 January 2013, requiring the Defendant to disclose his payslips for December 2011, January 2012 and February 2012, or alternatively, provide evidence that he was paid on a project basis. In addition, the Defendant was ordered to provide his IRAS Notices of Assessment for 2010, 2011 and 2012.[note: 39]To this end, the Plaintiff highlights in her written submissions that the Defendant responded as not having payslips for the months in question as he was paid on a project basis. No other information appears to have been given in respect of the nature of his project work. 35     The Plaintiff further asserts that the Defendant has not been forthcoming in disclosing his true income for 2011 and 2012. It will be recalled that the Defendant’s IRAS Notices of Assessment for these years reflected a declared income of $1. That said, it later transpired from the Defendant’s affidavit dated 9 October 2012 that he was working for Lee Kee Industries (M) Sdn Bhd during the period between January 2010 and March 2011.[note: 40]Further, the Defendant’s CPF statements indicated that he was in fact receiving income for seven months in 2011 and eight months in 2012. On the basis of the evidence provided by the Defendant, it is not possible to conclusively determine the true state of the Defendant’s earnings for the period between 2008 and 2012. Nonetheless, it is clear that the Defendant is currently drawing a decent salary. It is likely that he did have some earnings in 2010 and before, whether in Singapore or Malaysia. The scale of those earnings is, however, unclear. 36     The Plaintiff has also asserted in her written submissions that the Defendant was not truthful when he declared in his first affidavit of assets and means that he did not own any shares. Subsequently, in his affidavit dated 9 October 2012, the Defendant disclosed ownership of shares in “Lantrovision” and “Mirach Ener”.[note: 41]The Plaintiff also asserts in her written submissions that the Defendant stated in his response to her request for interrogatories that he had ceased trading shares since 2009. However, the Plaintiff states in her affidavit that she had discovered documents at the Rented Apartment which indicated that the Defendant had been trading shares up to as late as April 2010.[note: 42]These documents, which were exhibited by the Plaintiff in her affidavit, relate to contract statements in the Defendant’s name from the Central Depository for shares in “Lantrovision”, “UPP”, “Yangzijiang”, “Mirach Ener”, “Rafflesedu” and “Genting SP”. 37     Indeed, it is noted that the Plaintiff has also claimed in her affidavit that she had helped the Defendant repay his personal loans and debts when he sustained losses from his stock-trading activities in 1997 and 1998.[note: 43]Whilst the Defendant accepts that he did invest in the stock market and that losses were sustained in 1997 and 1998, he denies that the Plaintiff had provided any financial assistance.[note: 44] 38     Turning to the Defendant’s bank accounts, it is noted that the Plaintiff had made a request for particulars relating to three of his accounts, namely: (a)     a UOB joint account with the Co-Defendant covering the period from the opening of the account to 15 May 2012; (b)     a DBS account in relation to the period between 1 June 2009 and 15 May 2012; and (c)     a UOB account in relation to the period between 1 June 2009 and 15 May 2012. In his reply affidavit, the Defendant declined to provide these particulars on the basis that the request was “oppressive”.[note: 45]The Defendant further added that whilst he was a joint account holder, his money was not deposited into the said accounts, save for the UOB account into which he had deposited his salary. That said, I also note that the UOB and the DBS accounts were joint accounts held with the Plaintiff. In this respect, it is likely that the Plaintiff would also have access to the bank statements that she had requested from the Defendant.",
        "Rental proceeds for the HDB Property and the Private Property": "39     Considerable dispute has arisen over the rental proceeds from the HDB Property and the Private Property. For this reason, it is necessary to set out the positions adopted by the parties in some detail. It will be recalled that the Plaintiff gave evidence that the parties moved out of the HDB Property and into the Private Property sometime in 2004 ([11] above). The parties’ intention was to rent out the HDB Property and use the rental proceeds to pay the mortgage instalments for the Private Property. In this regard, the Plaintiff asserts that the Defendant was fully in charge of executing the plan[note: 46]— the rent was to be received by the Defendant and then used to meet the mortgage instalments and expenses in relation to the Private Property. In support of her assertion, the Plaintiff exhibited the tenancy agreements in respect of the HDB Property that were signed by the Defendant. 40     Subsequently, it is the Plaintiff’s evidence that the parties decided to move out of the Private Property and into the Rented Apartment. The reason given by the Plaintiff was that the parties’ relationship had encountered problems whilst they were living in the Private Property and it was thought that a move to new premises might provide a fresh start for both parties.[note: 47]To that end, the Plaintiff states that she began renting the Rented Apartment in November 2008. The Private Property was to be rented out and the rental proceeds would then be used to pay for the rental of the Rented Apartment. In this regard, the Plaintiff asserts that the Defendant was solely in charge of the rental of the Private Property.[note: 48] 41     Furthermore, the Plaintiff’s case is that from early 2010, the Defendant stopped using the rental proceeds from the HDB Property to pay the mortgage instalments of the Private Property.[note: 49]In this respect, she asserts that the Defendant kept the rental income to himself from this time onwards. As a result, the mortgagee bank, DBS, began sending letters of demand for the arrears.[note: 50]Copies of these letters of demand were exhibited by the Plaintiff in her affidavit. 42     The Plaintiff also asserts that the Defendant kept the rental proceeds from the Private Property to himself. As a result, she claims that she had to pay the rent for the Rented Apartment amounting to $3,400 per month out of her own income. She also had to pay the arrears and mortgage instalments, as well as the MCST charges, for the Private Property. Given that she could not afford to continue shouldering such a heavy financial burden, the Plaintiff proceeded to terminate the rental agreement and she has since moved in with her parents. For the sake of completeness, it is noted that the Plaintiff has stated in her affidavit that she has been renting out the Private Property from March 2012.[note: 51] 43     On the other hand, the Defendant did not make any reference to the rental of the HDB Property and the Private Property in his first affidavit of assets and means. In his second affidavit filed on 6 May 2013, the Defendant, in referring to an earlier affidavit, states that the Private Property was rented out since November 2008 and that the rental proceeds had been used to pay the rent for the Rented Apartment.[note: 52]The Defendant adds that he never agreed to rent out the Private Property. The Defendant states that in or around November 2008, he was retrenched and had no income.[note: 53]The Defendant also asserts that at that point in time, the parties had already separated and the child was staying with him. Nothing was said about the rental proceeds in relation to the HDB Property. 44     Thereafter, the Defendant agreed in his third affidavit that both properties were rented out “even before the breakdown on [sic] of the marriage (i.e. May 2010)”.[note: 54]In this regard, the Defendant asserts that prior to the breakdown of the marriage in May 2010, the Plaintiff was well aware that the rental proceeds from both the HDB Property and the Private Property were used to pay the monthly payments (mortgage instalments and rent) in relation to the Private Property and the Rented Apartment.[note: 55]The Defendant also states that he continued with this practice up to April 2010. 45     With regard to the period from May 2010 onwards, the Defendant’s explanation is that he has been using the rental proceeds from the HDB Property amounting to $2,100 per month to meet his daily living expenses, the child’s living expenses and to pay the rent for the Rented Apartment where the Plaintiff had been then staying.[note: 56]The Defendant states in his third affidavit that he has collected some $75,600 between May 2010 and May 2013. 46     As regards the Private Property, the Defendant accepts that he collected rent for the period between May 2010 and October 2010 amounting to the sum of $18,000, as opposed to the figure of $72,000 alleged by the Plaintiff.[note: 57]No rent was collected for November and December 2010 as the tenants had moved out without making payment for those two months. The security deposit was then forfeited. The Defendant asserts that the Private Property was left vacant for the whole of 2011. It was only rented out again from January 2012 by the Plaintiff. The Defendant asserts that the total rent received by the Plaintiff from the Private Property as at 8 July 2013 (ie, the date the third affidavit was filed) was $64,800.[note: 58]On the other hand, he claims that the total rent he has received from the HDB Property and the Private Property was $93,600 (specifically $75,600 and $18,000 respectively). Of this, some $49,500 was used by the Defendant during his period of unemployment between May 2010 and July 2011 to meet both the child’s and his expenses, as well as to pay the rent for the Rented Property. That being so, he claims that the total rental proceeds he has collected, which is presumably the remaining amount after deduction of all outgoings, is $44,100. 47     Much has been made by the Plaintiff of the Defendant’s reluctance and failure to provide discovery of the rental agreements. The Defendant’s explanation is simply that he no longer has possession of the same as these documents were handed over to the Plaintiff. The Plaintiff also disagrees with the quantum of the rental proceeds received by the Defendant. In this regard, the Plaintiff asserts in her written submissions that the Defendant received the following amounts: $237,600 for the HDB Property and $116,400 for the Private Property. That said, it is apparent that some of the differences can be attributed to the fact that the Defendant’s figures are premised on rental proceeds received after May 2010, whereas the Plaintiff’s figures date back much further to 2007. It will be recalled that the Defendant’s explanation for giving figures from May 2010 is that this was the time when the parties’ marriage broke down. Prior to that, the rental proceeds had been applied towards the mortgage instalments as agreed by the parties. In this regard, I am of the view that the Defendant’s evidence is to be preferred as the Plaintiff has also acknowledged the fact that she only took over payment of the mortgage instalments for the Private Property in June 2010.[note: 59]In any event, the relevance of how the rental proceeds were dealt with will be considered under the issue of direct financial contributions to both properties, which I shall now turn to.",
        "Direct financial contributions to the HDB Property": "48     I now proceed to deal with the issue of direct financial contributions by each party to the HDB Property. At the outset, I note that both parties have tendered their respective CPF statements in support of the CPF contributions they have made with regard to the HDB Property. On this basis, without taking in account the accrued interest, I accept that the CPF contributions by the Plaintiff and the Defendant as at 29 May 2013 are $148,662 and $334,182.44 respectively. 49     With regard to the cash contributions to the HDB Property, the Plaintiff asserts that the sum of $81,100 was paid by both parties equally.[note: 60]On the other hand, the Defendant disagrees with the Plaintiff’s account and claims that the entire cash component was paid out from his earnings along with some financial assistance from his parents.[note: 61]Regrettably, the Defendant has not tendered any evidence to support his assertion that the Plaintiff did not make any cash contributions at all. On this basis alone, I am not inclined to accept the Defendant’s account of events. Furthermore, the Plaintiff has tendered a HDB extract which stated that the cash contributions towards the initial capital payment were $39,500 and $38,900 by the Defendant and the Plaintiff respectively. It bears noting that these sums did not take into account the cash deposit that was paid earlier. 50     Therefore, on a balance of probabilities, I am of the view that the Plaintiff’s evidence is to be preferred and that both parties had contributed equally, at least in terms of their cash contributions. Apart from the CPF contributions and the initial capital payment, both parties also claim to have made financial contributions towards various household expenses, including payment for the renovation, utility bills, telephone charges, property tax and conservancy charges. While it is accepted that renovations of a substantial nature may add lasting value to a property, I note that no evidence has been adduced as to the nature of the renovations undertaken by the parties. With regard to the other household expenses, I am of the view that it would be more appropriate to take these payments into account when determining the indirect contributions of each party towards the marriage. In summary, I find that the direct financial contributions in relation to the HDB Property are as follows: Plaintiff (Wife)Defendant (Husband)CPF$148,662[note: 62]$334,182.24[note: 63]Cash$40,550$40,550Total$189,212$374,732.24Percentage33.6%66.4%",
        "Direct financial contributions to the Private Property": "51     Moving on to the issue of direct financial contributions to the Private Property, I note that both parties have also tendered their CPF statements in support of the CPF contributions that they have made. Without taking into account the accrued interest, I find that the CPF contributions by the Plaintiff and the Defendant are $75,000 and $9,858.40 respectively. 52     With regard to the cash contributions towards the Private Property, there is significant dispute over the Plaintiff’s direct financial contributions. In brief, the Plaintiff claims that she has contributed a total sum of $168,004.74, which includes the following payments: Payment to developer$84,482.30[note: 64]Payment for stamp fee$13,962.90[note: 65]Payment for first six months of MCST charges$1,587.60[note: 66]Payment for survey fees$391.94[note: 67]Mortgage repayments$67,580[note: 68]Total$168,004.74   To this end, the Plaintiff has tendered copies of the sale and purchase agreement, cheques and bank statements as supporting evidence.[note: 69] 53     The Defendant strenuously disputes the sums put forth by the Plaintiff. At the outset, the Defendant claims that the initial payment of $84,482.30 was paid out of their joint account and that the Plaintiff has “deliberately omitted to provide [the] page showing the account holders’ name”.[note: 70]After considering the evidence that has been placed before me, I am not convinced that there is any merit in the Defendant’s assertion that the initial payment was paid out of the parties’ joint account. In her second affidavit, the Plaintiff has tendered copies of the cheques for the payment of the sums of $84,482.30, $1,587.60 and $391.94 (for the initial down payment, MCST charges and survey fees respectively).[note: 71]The account number that is machine printed on all three cheques tallies with the account number for the joint account held by the Plaintiff and the child.[note: 72]The same account number was also found in the Defendant’s second affidavit, in which he asserted that the joint account held by the Plaintiff and the child consisted of cash gifts that the child had received over the years.[note: 73]To that end, the Plaintiff’s evidence is to be preferred and I do not accept the Defendant’s allegation that the Plaintiff had “deliberately omitted to provide [the] page showing the account holders’ name”. The bank account out of which the payments had been made was clearly not a joint account held by the Plaintiff and the Defendant. It was a joint account that was held by the Plaintiff and the child. 54     The Defendant’s second main objection is with regard to the Plaintiff’s contributions towards the mortgage repayments amounting to $67,580. In this respect, the Defendant highlights that the mortgage repayments of $2,100 per month from January 2012 were funded out of the rental proceeds of $3,600 per month that the Plaintiff was receiving then.[note: 74]On this basis, the Defendant asserts that the Plaintiff’s contributions towards the mortgage repayments should be $39,900, as opposed to $67,580. After considering the evidence placed before me, I am of the view that the Defendant’s objections are valid. It bears noting that the Plaintiff has, in calculating the direct financial contributions made by both parties, excluded the Defendant’s mortgage repayments prior to June 2010.[note: 75]This was on the basis that the prevailing arrangement was for the rental proceeds from the HDB Property to be used to pay the mortgage repayments for the Private Property. In the same vein, the Plaintiff cannot now claim the mortgage repayments that were paid out of the rental proceeds as her sole financial contributions. In fact, the Plaintiff has, in her third affidavit, accounted for the rental proceeds of the Private Property by deducting the mortgage repayments made between March 2012 and May 2013.[note: 76]These mortgage repayments amounted to a total sum of $30,470.[note: 77]Therefore, I am of the view that the Plaintiff’s direct financial contributions in relation to the mortgage repayments should be limited to $39,900. The mortgage repayments that were paid out of the rental proceeds should not be taken into account for the purposes of determining the Plaintiff’s direct financial contributions. 55     Similar to the HDB Property, I am of the view that it would be more appropriate to consider the parties’ claims of having paid the renovation expenses, MCST charges, utilities bills and property tax at the stage of determining their respective indirect contributions to the marriage. On this basis, the Plaintiff’s contribution of $1,587.60 towards the first six months of MCST charges should also be excluded. In summary, I find that the direct financial contributions in relation to the Private Property are as follows: Plaintiff (Wife)Defendant (Husband)CPF$75,000[note: 78]$9858.40[note: 79]Cash$138,737.14*-Total$213,737.14$9858.40Percentage95.6%4.4%   *This is after deduction of the first six months of MCST charges and the mortgage repayments that were paid out of the rental proceeds. 56     In arriving at these figures, I note that the differences in quantum are relatively insignificant in the greater scheme of things. In any event, the ratios put forth by the parties are not that far off from one another as both parties are at least in agreement that the Plaintiff’s financial contributions far exceeds that of the Defendant’s, reflected as follows: Plaintiff (Wife)Defendant (Husband)Plaintiff’s Written Submissions96.55%3.44%Defendant’s Written Submissions92%8%Court’s Findings95.6%4.4%   57     In this regard, it bears emphasising that the division of matrimonial assets is not a simple mathematical exercise. In fact, the court is to be guided by a holistic assessment of the circumstances of the case in arriving at the likely financial contributions of each party. A precise mathematical account would be an exercise in futility given the conflicting positions taken by both parties and the state of documentary evidence in this case. To this end, the slight differences between the ratios set out above are not likely to bear much significance, especially after taking into account the indirect contributions of each party towards the marriage.",
        "Indirect contributions of the parties": "58     The Plaintiff’s indirect contributions are said to fall under three main categories: (a)     taking care of the child for a period of some nine years, including payment of the child’s educational expenses; (b)     payment of the costs of hiring a domestic helper; and (c)     financial assistance rendered to the Defendant in 1997 and 1998 when he incurred heavy losses from his stock-trading activities. 59     With regard to the first category, the Plaintiff claims that from the son’s birth in 2001 until April 2010, she was “effectively” the sole parent looking after the son.[note: 80]For instance, she states that from 2005 to 2007, the Defendant travelled extensively for work. After termination of his employment with RBS in April or May 2008, it was said that he undertook freelance work in Johor Bahru, which required him to stay in Johor Bahru during weekdays. The Plaintiff has also pointed out that whilst the Defendant subsequently held some contract jobs in Singapore, it was the Plaintiff who had to shoulder the family and household expenses. Indeed, it bears repeating that the Defendant’s IRAS Notices of Assessment for YA 2011 and 2012 reveal that he had declared his income as $1 for both years. As noted earlier, it is apparent that the Plaintiff also worked during those years ([35] above). That said, she asserts that she could take care of the family as her work was based in Singapore.[note: 81]All in all, the Plaintiff claims to have spent $35,000 for the son’s education expenses, $31,000 for the services of a domestic helper and $100,000 towards groceries.[note: 82] 60     In so far as assistance to the Defendant is concerned and apart from her financial assistance in respect of the losses incurred by him from his stock-trading activities, the Plaintiff also asserts that she paid for the family and household expenses and provided financial assistance in respect of the hire-purchase payments of his motor vehicle during his period of unemployment.[note: 83] 61     On the other hand, the Defendant claims that he was solely responsible for the payment of the household bills, family expenses and car petrol during the subsistence of the marriage. He also claims to have fetched the son from school on a daily basis and that he was responsible for all the grocery expenses. He adds that he has provided solely for the son’s needs.[note: 84]Furthermore, the Defendant goes on to state that the Plaintiff did not help him during the period of 2008 to 2009 since their marriage had already broken down in 2007.[note: 85]Prior to 2008, he claims to have been well-remunerated and to have paid all the household expenses, including the domestic helper’s salary, as well as the son’s education expenses.[note: 86] 62     With regard to the parties’ conflicting evidence as to their contributions to the household expenses, it would be useful to refer to Leong Wai Kum,Elements of Family Law in Singapore(Lexis Nexis, 2nd Ed, 2013) (“Elements of Family Law”), where the author acknowledged at p 526 that sometimes (as in the present case), each party will give a different story to the court on the process of acquisition of the property. In such cases, even when applying a broad-brush approach, the court would still have to make a finding on whose version is more credible on the whole. Whilst this can be quite difficult even in the case of direct financial contributions, it is often times even more contentious in the case of indirect contributions, whether financial or otherwise. 63     Coupled with the fact that ancillary proceedings are based solely on the parties’ affidavits and accompanying exhibits, the court must therefore exercise even more caution when assessing the creditability of the parties’ evidence. That said, in the present case, given that the Defendant’s income and employment appear to have been meagre or sporadic since around 2008 until his present job as an IT Manager, I accept the Plaintiff’s evidence that she shouldered the bulk of the family expenses from around 2008 onwards. In so far as the earlier years are concerned, I note that in 1997 and 1998, the Defendant was also in financial difficulties due to losses incurred on the stock market and that the Plaintiff very likely played the role of the primary breadwinner of the family during these years. Beyond that, whilst the evidence is conflicting, I accept that both parties had made contributions towards the family and general household expenses. 64     To be clear, whilst it appears that the child was generally well-provided for in terms of his educational expenses, the question as to who was responsible for the child’s expenses and general household expenses prior to 2008 is very much in dispute. As noted above, it seems likely that the Plaintiff had to shoulder the financial burden after April 2008 when the Defendant lost his job at RBS ([63] above). Whether the Defendant was the main financial provider of the family before 2008 is disputed. It however does seem clear that at least from April 2010 onwards when the parties separated and the child began staying with the Defendant, the Defendant has thereafter been responsible for the child’s expenses and day-to-day welfare. In this regard, the Defendant highlights the fact that the Plaintiff’s relationship with the child has broken down and he has also given evidence that the child prefers to stay with him. Indeed, it will be recalled that the child has refused to see the Plaintiff even in respect of the court-ordered access. This is a most unfortunate state of affairs. Nevertheless, without additional evidence as to what has led to this unhappy state of affairs, I am unable to draw any inference as to whether the Plaintiff has neglected her duties as a mother during the subsistence of the marriage. In the light of the above, whilst the Defendant has care and control of the son since April 2010, I accept that the Plaintiff did make substantial indirect contributions prior to that time with regard to the son’s daily needs and expenses as well as the general household expenses. Beyond this, it is not possible or necessary to arrive at a precise determination of these contributions.",
        "The court’s decision on the division of matrimonial assets": "65     Section 112(1) of the Act provides that the court shall have power, when granting or subsequent to the grant of a judgment of divorce, to order the division between the parties of any matrimonial asset or the sale of any such asset and the division between the parties of the proceeds of the sale of any such asset in such proportions as the court thinks just and equitable. 66     Section 112(2) of the Act goes on to direct the court to have regard to all the circumstances of the case, including the following matters: (a)     the extent of the contributions made by each party in money, property or work towards acquiring, improving or maintaining the matrimonial assets; (b)     any debt owing or obligation incurred or undertaken by either party for their joint benefit or for the benefit of any child of the marriage; (c)     the needs of the children (if any) of the marriage; (d)     the extent of the contributions made by each party to the welfare of the family, including looking after the home or caring for the family or any aged or infirm relative or dependant of either party; (e)     any agreement between the parties with respect to the ownership and division of the matrimonial assets made in contemplation of divorce; (f)     any period of rent-free occupation or other benefit enjoyed by one party in the matrimonial home to the exclusion of the other party; (g)     the giving of assistance or support by one party to the other party (whether or not of a material kind), including the giving of assistance or support which aids the other party in the carrying on of his or her occupation or business; and (h)     the matters referred to in s 114(1) so far as they are relevant. 67     Section 114(1) of the Act, which is referred to in s 112(2), provides that in determining the amount of maintenance to be paid by a man to his wife or former wife, the court shall have regard to all the circumstances of the case, including the following matters: (a)     the income, earning capacity, property and other financial resources which each of the parties to the marriage has or is likely to have in the foreseeable future; (b)     the financial needs, obligations and responsibilities which each of the parties to the marriage has or is likely to have in the foreseeable future; (c)     the standard of living enjoyed by the family before the breakdown of the marriage; (d)     the age of each party to the marriage and the duration of the marriage; (e)     any physical or mental disability of either of the parties to the marriage; (f)     the contributions made by each of the parties to the marriage to the welfare of the family, including any contribution made by looking after the home or caring for the family; and (g)     in the case of proceedings for divorce or nullity of marriage, the value to either of the parties to the marriage of any benefit (for example, a pension) which, by reason of the dissolution or annulment of the marriage that party will lose the chance of acquiring. 68     InNK v NL[2007] 3 SLR(R) 743, Andrew Phang JA opined at [41] that: … the social policy underscored by the division of matrimonial assets, the joint product of a marital partnership, is just as important as the final award. The language of a power to “divide” says to the whole society that the law acknowledges the equally important contributions of the homemaker to the partnership of marriage and its acquisition of wealth. 69     As this court observed inSim Kim Heng Andrew v Wee Siew Gee[2014] 1 SLR 1276, Prof Leong Wai Kum comments at p 505 ofElements of Family Lawthat three defining principles govern the court’s power to divide matrimonial assets, namely (a) any asset acquired during the marriage (rather than just the matrimonial home) is liable to division; (b) the power is to be exercised in broad strokes (rather than by a misguided attempt at mathematical precision); and (c) the aim of the court is to reach a fair and reasonable division of the assets between the spouses. 70     In particular, the adoption of a broad-brush approach is not inconsistent with a structured approach towards the court’s assessment and exercise of judicial discretion. Indeed, the latter approach was endorsed by the Court of Appeal inATT v ATS[2012] 2 SLR(R) 859. Under this structured approach, the first step is to delineate the pool of matrimonial assets to be divided between the parties. Thereafter, the court is to assess the value of the pool such that the court’s deliberations can be made with reference to a working quantum. Following this, the third step is to consider all the circumstances of the case, including but not limited to the specific factors identified in s 112(2) of the Act, paying particular attention to the direct financial contributions as well as the indirect non-financial contributions of each party. Chao Hick Tin JA further explained at [15] of the decision that the court may then proceed to consider what is the most effective way of achieving the desired division on the basis of the determined proportion.  It is suggested that the desirability of a clean break will be one factor to be considered at this stage. 71     The foregoing elucidation set out inATT v ATSon the proper approach to be taken in the exercise of judicial discretion does not mean that the same approach must be followed in all cases. With respect, Chao JA rightly emphasised at [15] of the decision that the approach described did “not represent a hard and fast procedure which the court must adhere to in every case involving a division of matrimonial assets, even where it would be manifestly iniquitous or inconvenient to do so”. 72     Returning to the present case, the court has been asked to apply its power of division in respect of two matrimonial properties, namely the HDB Property and the Private Property. It is not in doubt that both properties were acquired during the subsistence of the marriage and are thus matrimonial assets. In her Declaration of Value of the Matrimonial Assets dated 30 July 2013, the Plaintiff has estimated the gross values of the HDB Property and the Private Property to be $435,000 and $1,250,000 respectively.[note: 87]In contrast, the Defendant has estimated the gross values to be $480,000 and $1,300,000 respectively.[note: 88]Whilst there are small differences between the parties’ estimates, nothing of significance turns on this. In any event, I am of the view that the better approach is to assess the division of the two properties as a whole after determining the total direct financial contributions by each party towards both properties. InAYQ v AYR and another matter[2013] 1 SLR 476, the Court of Appeal, in referring to its earlier observations inNK v NL, held unequivocally that: ... by theirvery nature, indirect contributions are part of the very warp and woof of theentiremarriage and must therefore be reflected consistently throughout each class of assets. To hold otherwise would, in our view, be contrary to this approach and would invariably lead to undesirable anomalies. ... [emphasis in original] In this regard, the Court of Appeal also noted that pursuant to the “global assessment methodology”, the role of indirect contributions would, of course, be taken into account and, by the very nature of the methodology itself, only once at that. With this in mind, I am of the view that on the facts of the present case, it would be more appropriate for both properties to be taken into account together for the purposes of dividing the matrimonial assets. 73     With reference to [50] and [55] above, the direct financial contributions (including both CPF and cash contributions) to both properties are as follows: Plaintiff (Wife)Defendant (Husband)HDB Property$189,212$374,732.24Private Property$213,737.14$9858.40Total$402,949.14$384,590.64Percentage51.2%48.8%   74     As already explained above, while I am of the view that both parties have made indirect financial contributions towards the marriage, on a balance of probabilities, it is likely that the Plaintiff’s non-financial contributions outweigh those of the Defendant’s. On that basis, taking into account all relevant considerations, and specificallybothdirect and indirect contributions, I am of the view that a just and equitable division of both properties would be in the ratio of 65:35 in the Plaintiff’s favour. 75     At this juncture, it bears noting that both parties have prayed for the HDB Property and the Private Property to be sold and for the proceeds to be divided in the relevant proportions. In this regard, I also note that both properties are not occupied by either party as both the Plaintiff and the Defendant have moved in with their respective families. Therefore, the most effective way of achieving the desired division on the basis of the determined proportion would be for both properties to be sold and for the remaining proceeds, after deducting the necessary expenses and settling the outstanding mortgage, to be divided in the ratio of 65:35 in the Plaintiff’s favour. 76     With regard to the assets in each party’s sole name, both parties have agreed that each is to retain the assets in their individual names, including but not limited to: (a)     money in their own bank accounts; (b)     money in their respective CPF accounts; (c)     insurance policies; and (d)     motor vehicles. Taking into account the value of these assets and the division in relation to the HDB Property and the Private Property, I am of the view that this arrangement is reasonable and I so order. 77     As regards all other matrimonial assets held in their joint names, the Plaintiff has requested that these be divided equally. The Plaintiff has also asked that the Defendant’s name be removed as the nominated beneficiary in four separate insurance policies. I am of the view that these arrangements are appropriate in light of the circumstances and I so order.",
        "Maintenance for the wife": "78     The Plaintiff has sought an order for nominal maintenance of $1 per month for herself. The Defendant disputes the need for nominal maintenance and asks for a clean break between the parties. Given that both parties are working and that the Plaintiff has been supporting herself for quite some time, this court agrees that substantial maintenance is not appropriate in this case. Indeed, taking into account the division of both the HDB Property and the Private Property as set out above, and the fact that the Plaintiff is relatively young and appears to have good career prospects, no order as to maintenance is to be made in the Plaintiff’s favour.",
        "Maintenance for the child": "79     The Defendant has sought an order that the Plaintiff contributes $1,000 per month towards the child’s savings account, which will be set aside as savings for the child’s future. 80     The power to award maintenance for children is encapsulated in s 127 of the Act, which provides that “[d]uring the pendency of any matrimonial proceedings or when granting or at any time subsequent to the grant of a judgment of divorce, judicial separation or nullity of marriage, the court may order a parent to pay maintenance for the benefit of his child in such manner as the court thinks fit”. 81     Earlier, I have arrived at the decision to award care and control of the child to the Defendant. The Plaintiff argues in her written submissions that the Defendant’s request for $1,000 per month is not based on the child’s day-to-day needs, but relates instead to the accumulation of savings for the child’s future.[note: 89]To this extent, the Defendant has also stated that his claim for maintenance of the child relates to contributions towards the son’s future.[note: 90]In addition, it has been pointed out that the Defendant’s current income is sufficient to meet the son’s needs and that in so far as future educational expenses are concerned, the Plaintiff has been and is still paying premiums on an insurance policy for the son’s education. In these circumstances, no order as to maintenance for the child will be granted. To this end, I note that should there be a material change of circumstances in the future, there is always the possibility of making a further application in relation to the maintenance for the child.",
        "Other prayers": "82     For the sake of completeness, I note that the Plaintiff and the Defendant have also sought a variety of other orders in their written submissions, namely: (a)     By the Plaintiff: (i)       division of the rental proceeds received and kept by the Defendant and for these to be paid out of the Defendant’s share of the sale proceeds for the two real properties;[note: 91] (ii)       payment of costs in relation to the outstanding cost orders granted in the favour of the Plaintiff but not yet satisfied by the Defendant;[note: 92]and (iii)       an order for the Defendant to transfer to the Plaintiff 50% of the total sum of $27,000 which the Defendant had earlier transferred from the parties’ joint POSB account to his personal DBS account.[note: 93] (b)     By the Defendant: (i)       an order for the Plaintiff to return certain items to the child, namely:[note: 94] (A)       electric piano; (B)       bicycle; (C)       Nintendo Wii; and (D)       Nintendo DS (Blue). 83     As regards the Plaintiff’s claim for the rental proceeds, I have already taken the parties’ dispute into account in assessing their respective direct financial contributions. As for the outstanding costs orders, I see no reason why there is a need for another order to be granted over and above the existing orders. If the Defendant refuses to make payment even after repeated demands, the Plaintiff may proceed to enforce the outstanding costs orders against the Defendant. With respect to the Defendant’s transfer of money from the parties’ joint account, the circumstances in which this was done are unclear.[note: 95]In the circumstances, I am of the view that the requested order is inappropriate. 84     Finally, in the case of the Defendant’s prayer for the return of the child’s belongings, given that care and control of the child has been granted in favour of the Defendant, I am of the view that this is an appropriate arrangement and I so order.",
        "Conclusion": "85     In summary, the orders to be granted are set out as follows: (a)     Both the HDB Property and the Private Property are to be sold within six months of the date of judgment. Both the Plaintiff and the Defendant are to have joint conduct of the sale. The costs and expenses of the sale and all outstanding liabilities in relation to the properties, including but not limited to the outstanding mortgage and other outstanding MCST or conservancy charges, are to be paid out of the sale proceeds. The net proceeds are to be divided in the ratio of 65:35 in favour of the Plaintiff. Both parties are to refund from their respective shares of the net sale proceeds all CPF monies, together with the accrued interest, to their respective CPF accounts. (b)     Each party is to retain all other assets in their sole names, including but not limited to: (i)       money in their own bank accounts; (ii)       money in their respective CPF accounts; (iii)       insurance policies in their own names; and (iv)       motor vehicles in their own names. (c)     All other matrimonial assets which are held in the parties’ joint names are to be divided equally. (d)     The Defendant’s name is to be removed as the nominated beneficiary in four insurance policies, namely: (i)       L519579255; (ii)       L519591262; (iii)       L531691470; and (iv)       L531903139. (e)     No order for maintenance is granted in favour of the Plaintiff. (f)     No order for maintenance is granted in relation to the child. (g)     Both parties are to have joint custody of the child. (h)     Care and control of the child is granted to the Defendant. (i)     The Plaintiff is to have access to the child on the same terms as set out in the interim order made by Pillai J in RAS 69/2011. The date of commencement of the court-ordered access will be the first Wednesday after the date of judgment. This is subject to the requirement that the parties are to agree and arrange for counselling for the child before access is to commence, as provided in the interim order made by Pillai J. (j)     Both parties are to attend the parenting workshop under “Project Impact” without the child. (k)     Both parties have the liberty to apply to court in respect of any non-compliance by either party with the access order granted above. (l)     The Plaintiff is to return the following items to the child: (A)       electric piano; (B)       bicycle; (C)       Nintendo Wii; and (D)       Nintendo DS (Blue). 86     In the circumstances, the court orders the Defendant to pay the Plaintiff costs of the ancillary proceedings. Costs are to be agreed or taxed.  [note: 1]Plaintiff’s Written Submissions dated 7 October 2013 (“PWS”) at p 6, para 21. [note: 2]Defendant’s Written Submissions dated 7 October 2013 (“DWS”) at p 12, para 33. [note: 3]DWS at p 12, para 32. [note: 4]PWS at p 1, para 4; DWS at p 1, para 3. [note: 5]Plaintiff’s 2nd Affidavit for Ancillary Matters Hearing dated 11 April 2013 (“PAM-2”) at p 26, para 60. [note: 6]Plaintiff’s 1st Affidavit for Ancillary Matters Hearing dated 16 March 2012 (“PAM-1”) at p 15, para 22(b). [note: 7]PAM-2 at p 26–27, para 60. [note: 8]Defendant’s Affidavit for Summons Hearing (Divorce) dated 9 October 2012 at pp 22–23. [note: 9]Defendant’s 1st Affidavit for Ancillary Matters Hearing dated 20 March 2012 (“DAM-1”) at pp 1–2, paras 2–3. [note: 10]PAM-1 at pp 1–2, paras 2–3. [note: 11]PAM-1 at pp 1–2, para 3. [note: 12]PAM-1 at pp 21–24. [note: 13]Plaintiff’s Bundle of Authorities and Documents at pp 118–123. [note: 14]PAM-1 at p 16, para 22(d). [note: 15]PAM-2 at p 133. [note: 16]PAM-1 at p 11, para 21(c)(ii). [note: 17]PAM-1 at p 12, para 21(c)(iii). [note: 18]PAM-1 at p 13, para 21(c)(vi). [note: 19]PAM-1 at p 12, para 21(c)(iv)–(v). [note: 20]PWS at p 26, para 73. [note: 21]PWS at p 27, para 76. [note: 22]PWS at p 27, para 77; DWS at p 2, para 8. [note: 23]PWS at p 27, para 78. [note: 24]PWS at p 28, para 79. [note: 25]DWS at p 11, para 28. [note: 26]DWS at p 11, para 28. [note: 27]PWS at p 4, para 9; PAM-1 at p 18, para 27. [note: 28]DWS at p 2, para 6. [note: 29]PAM-2 at p 4, para 9. [note: 30]PAM-2 at p 70. [note: 31]PWS at p 4, para 10. [note: 32]DWS at p 2, para 6. [note: 33]DWS at p 2, para 5. [note: 34]PAM-1 at pp 3–6, paras 8–13. [note: 35]PAM-1 at pp 8–9, para 19. [note: 36]DAM-1 at pp 3–6, paras 8–15. [note: 37]DAM-1 at pp 7–8, para 19. [note: 38]PAM-1 at p 15, para 22(b). [note: 39]PAM-2 at pp 4–5, para 12; PAM-2 at p 49. [note: 40]Defendant’s Affidavit for Summons Hearing (Divorce) dated 9 October 2012 at p 8. [note: 41]Defendant’s Affidavit for Summons Hearing (Divorce) dated 9 October 2012 at p 28. [note: 42]PAM-2 at p 17, para 44. [note: 43]PAM-1 at pp 14–15, para 22(a). [note: 44]Defendant’s 2nd Affidavit for Ancillary Matters Hearing dated 6 May 2013 (“DAM-2”) at p 4, para 18. [note: 45]Defendant’s Affidavit for Summons Hearing (Divorce) dated 9 October 2012 at p 6, para 10. [note: 46]PAM-1 at p 11, para 21(c)(i)(3). [note: 47]PAM-1 at p 11, para 21(c)(ii)(2). [note: 48]PAM-1 at p 12, para 21(c)(iii)(2). [note: 49]PAM-1 at p 12, para 21(c)(iv)(1). [note: 50]PAM-1 at p 12, para 21(c)(iv)(2). [note: 51]PAM-1 at p 14, para 21(c)(xi). [note: 52]DAM-2 at pp 2–3, para 8. [note: 53]DAM-2 at p 4, para 17. [note: 54]Defendant’s 3rd Affidavit for Ancillary Matters Hearing dated 8 July 2013 (“DAM-3”) at p 2, para 5. [note: 55]DAM-3 at p 2, para 5. [note: 56]DAM-3 at p 2, para 6. [note: 57]DAM-3 at pp 2–3, para 7. [note: 58]DAM-3 at p 3, para 8. [note: 59]DAM-2 at pp 9–10, para 20. [note: 60]PWS at pp 6–8, para 22. [note: 61]DWS at p 5, para 13(a). [note: 62]DAM-3 at p 29. [note: 63]Defendant’s Affidavit for Summons Hearing (Divorce) dated 9 October 2012 at p 17. [note: 64]PAM-2 at p 20, para 52(a). [note: 65]PAM-2 at p 20, para 52(a). [note: 66]PAM-2 at p 20, para 52(a). [note: 67]PAM-2 at p 20, para 52(a). [note: 68]PWS at pp 8–10, para 23. [note: 69]PAM-2 at pp 113–139. [note: 70]DWS at p 7, para 15. [note: 71]PAM-2 at p 138. [note: 72]PAM-1 at p 6, para 12. [note: 73]DAM-2 at p 2, para 6. [note: 74]DWS at pp 7–8, para 16. [note: 75]PWS at p 10, para 23(g). [note: 76]Plaintiff’s 3rd Affidavit for Ancillary Matters Hearing dated 10 June 2013 (“PAM-3”) at p 7, para 11(d). [note: 77]PAM-3 at p 7, para 11(d). [note: 78]DAM-3 at p 30. [note: 79]Defendant’s Affidavit for Summons Hearing (Divorce) dated 9 October 2012 at p 15. [note: 80]PWS at p 12, para 25. [note: 81]PWS at pp 10–12, para 24. [note: 82]PWS at pp 12–13, paras 26–28. [note: 83]PWS at pp 13–14, paras 30–33. [note: 84]DAM-1 at p 8, para 22. [note: 85]DAM-2 at p 4, para 19. [note: 86]DAM-2 at p 5, para 22. [note: 87]Plaintiff’s Declaration of the Value of Matrimonial Assets dated 30 July 2013. [note: 88]Defendant’s Declaration of the Value of Matrimonial Assets dated 26 July 2013. [note: 89]PWS at pp 5–6, paras 14–19. [note: 90]DWS at p 12, para 32. [note: 91]PWS at pp 21–22, paras 61–62. [note: 92]PWS at p 22, para 63. [note: 93]PWS at p 22, para 64; DAM-2 at p 19, paras 49–50. [note: 94]DWS at p 11, para 31. [note: 95]DAM-3 at pp 3–4, paras 11–12."
    }
}