{
    "case_title": "Poh Cheng Chew\n      v\n      K\nP Koh & Partners Pte Ltd and another",
    "ncitation": "[2014] SGHC 20",
    "coram": "Lionel Yee JC",
    "sections": {
        "Background facts": "2       The\nFirst Defendant is an architecture and engineering firm, whereas the\nSecond Defendant is a building contractor (collectively, “the Defendants”).\nMr Koh Kok Peng (“Koh”) is a professional engineer and the principal\npartner in the First Defendant; Koh also runs the Second Defendant. 3       On\nor about 8 April 2010, the Plaintiff engaged the Defendants to carry\nout additions and alterations (“the A&A Works”) to the Property.\nThe First Defendant provided consulting engineer services for the\nA&A Works whereas the Second Defendant carried out the A&A\nWorks. A quotation issued on 21 June 2010 (“the 21 June Quotation”)\nstated the contract price for the A&A Works as $367,800.[note: 1]Subsequent\namendments to the scope of works in the 21 June Quotation were made\nin a revised quotation attached to a letter from the Second Defendant\nto the Plaintiff dated 20 August 2010 (“the Revised 21 June Quotation”).[note: 2]The\ncontract price, however, remained unchanged and it is not disputed\nthat the Plaintiff has made full payment of the contract price for\nthe A&A Works.[note: 3] 4       A\ndispute arose between the parties regarding the A&A Works. The Plaintiff,\nalleging that the A&A Works were defective and incomplete, commissioned\ntwo companies to prepare reports on the A&A Works. The first\nreport dated May 2011 was done by Building Appraisal Pte Ltd (“Building\nAppraisal”) and described defects in the A&A Works (“the Building\nAppraisal Report”).[note: 4]The second report dated January\n2012 was done by Lee Consultants and identified the discrepancies\nbetween the actual “as-built” work on site and the approved plans\nfor the A&A Works (“the Lee Consultants Report”).[note: 5]For\nease of reference, I will refer to the Building Appraisal Report\nand the Lee Consultants Report collectively as “the Consultants’\nReports”. 5       On\n8 February 2012, the Plaintiff through his solicitors issued a letter of\ndemand to the First Defendant, claiming a sum of $111,330 asinter aliacompensation for defective\nworks done to the Property.[note: 6]On the same date, the Plaintiff’s\nsolicitors wrote to the Professional Engineers Board (“PEB”), making\na complaint against the First Defendant and Koh and requesting the\nPEB to investigate the matter and take necessary action against\nKoh.[note: 7]It appears that the Plaintiff\nalso wrote to the Building and Construction Authority (“BCA”) on\n20 February 2012 making a complaint against Koh.[note: 8] 6       The\ndispute was resolved through mediation on 12 March 2012 and the\nSettlement Agreement was entered into between the Plaintiff and\nthe Defendants. Pursuant to the Settlement Agreement, a professional\nengineer was to be appointed to set out the scope and specifications\nof works required to rectify the defects (“the Rectification Works”),\nprepare and call for a tender for the said works, and evaluate the\ntenders and award the contract. The scope and specifications of\nthe Rectification Works were to be “based on” the Consultants’ Reports\nand were to be set out “on the basis of the most efficient manner\nto rectify the defects so as to ensure that the works comply with\nthe required statutory regulations and are of a standard commensurate\nwith the price paid by the [Plaintiff] for the original works”.[note: 9] 7       Under\nthe Settlement Agreement, the Defendants were to pay: (a)     the\nfees of the professional engineer; (b)     the\ncosts of the Rectification Works; (c)     the\ncosts of 2 “Somerset” service apartments of 3 bedrooms each (or\nequivalent) and the costs of storage of the Plaintiff’s chattels\nfor the duration of the Rectification Works; and (d)     $20,000\nto the Plaintiff as compensation for moving and costs. As for the Plaintiff, he was to refrain from filing any complaints (presumably\nagainst Koh or the Defendants) with the PEB. 8       Pursuant\nto the Settlement Agreement, the Defendants duly paid the Plaintiff\n$20,000 as compensation for moving and costs and Mr Chan Yaw Fai\n(“Chan”) was appointed as the professional engineer. 9       Chan\nquoted a lump sum of $88,000 for his fees, which was to be paid progressively\nin instalments.[note: 10]Chan’s appointment on these terms\nwas confirmed in a letter from the Plaintiff’s solicitors dated\n19 March 2012.[note: 11]Subsequently there was some discussion\nbetween the parties regarding Chan’s fees, which the Defendants\nfelt were too high. Around the end of March 2012, the Defendants’\nsolicitor at that time, Mr Low Chai Chong (“Low”), wrote to the\nPlaintiff’s solicitors stating that Chan’s quotation was far too\nhigh and seeking the Plaintiff’s consent for Koh to contact Chan\nto see if Chan could “give a discount” and also to clarify Chan’s\nscope of works.[note: 12]The Plaintiff had no objections. 10     On\n28 March 2012, Koh, together with Mr Freddie Chia (“Chia”), another\npartner in the First Defendant, met with Chan to discuss his fees (“the\n28 March 2012 Meeting”). There is some disagreement as to what transpired\nat that meeting but what is not disputed is that after the meeting, Chan\nagreed to give Koh what was in effect a discount of $8,000 on his fees.[note: 13]The\nDefendants subsequently paid Chan $19,260, this sum being the first\ninstalment of his fees, and Chan returned $8,000 in cash to the Defendants.[note: 14] 11     Chan\nconducted site visits to the Property on 3 and 4 April 2012.[note: 15]He produced a set of tender\ndocuments for the proposed Rectification Works (“the Tender Document”),\nwhich he forwarded to the parties for their comments.[note: 16]A\nfew amendments were made to the Tender Document pursuant to some\ncomments from the Plaintiff, to which the Defendants did not object.[note: 17]On\n10 May 2012, Chan sent out invitations to tender to various contractors.\nA site show-round of the Property (“the First Site Show-round”)\nwas conducted by Chan on 17 May 2012. The first tender was opened\non 31 May 2012 and four contractors submitted tenders based on the\nTender Document as follows: (a)     Winning\nFlag Enterprise Pte Ltd (“Winning Flag”) at $188,800; (b)     Builders\nAlliance Pte Ltd (“Builders Alliance”) at $210,350; (c)     Effulgent\nBuilder & Marketing Pte Ltd (“Effulgent”) at $542,318; and (d)     Crystallite\nConstruction & Engineering Pte Ltd (“Crystallite”) at $623,500. 12     Initially,\nChan called for a tender interview with only the two higher bidders,\nEffulgent and Crystallite. However, after objections from the Defendants,\nall four tenderers were invited for a tender interview.[note: 18]Three were\ninterviewed on 19 June 2012 whereas one (Builders Alliance) failed\nto turn up for the tender interview. The three tenderers were then\nasked to go for another site show-round on 21 June 2012 (“the Second\nSite Show-round”). Either during the tender interview or the Second\nSite Show-round, Chan handed a two-page questionnaire relating to\ncertain items in the Tender Document (“the Tender Questionnaire”)\nto each contractor.[note: 19] 13     The\nsecond tender was then opened on 26 June 2012. The revised bids were\nas follows: (a)     Winning\nFlag at $498,000; (b)     Effulgent\nat $542,318; (c)     Crystallite\nat $566,200. 14     On\n6 July 2012, Chan awarded the contract for the Rectification Works\nto Crystallite for $498,000.[note: 20]The Defendants were dissatisfied\nwith Chan’s decision and did not make any further payment to the\nPlaintiff under the Settlement Agreement. After unsuccessful further\nmediation, the Plaintiff commenced the present suit on 16 August\n2012. On the same date, the Plaintiff filed a complaint to the PEB\nagainst Koh by way of a statutory declaration.[note: 21]It\nis not in dispute that the Rectification Works have never started.",
        "The pleadings": "15     The\nPlaintiff pleaded that he had suffered loss and damage as a result of\nthe Defendants’ breach of the Settlement Agreement and thus claimed the\nfollowing sums from the Defendants:[note: 22] (a)     $718,476.80,\nmade up as follows: (i)       $74,900 being Chan’s outstanding fees (inclusive of goods and\nservices tax (“GST”)); (ii)       $532,860 being the costs of the Rectification Works (inclusive\nof GST); (iii)       $96,000 being the rental already incurred for two Sentosa Cove\napartments for four months;[note: 23] (iv)       $14,716.80 being storage costs for four months; (b)     Rental\nof $24,000 per month (being the average rental for two “Somerset”\nservice apartments) for four months being the duration of the Rectification\nWorks to be carried out;[note: 24]and (c)     Storage\ncosts of $3,679.20 per month from October 2012 until the completion\nof the Rectification Works. 16     The\nDefendants denied that the Plaintiff was entitled to any payment and\nprayed for orders that Chan’s appointment as professional engineer under\nthe Settlement Agreement and the award of the contract to Crystallite\nbe set aside.[note: 25]The\nthrust of the Defendants’ argument on this point was that Chan was\nnot independent and was controlled by or acting under the influence\nof the Plaintiff and/or his agents, and had also materially departed\nfrom his instructions in awarding the tender to Crystallite. The\nDefendants further prayed for a declaration that the Settlement\nAgreement had been repudiated or terminated, alleging that the Plaintiff\nhad breached: (1) the fundamental term that he refrain from filing a\ncomplaint to the PEB; and (2) the implied term that he (and/or his\nagents) would not interfere with or exert any influence over the\nprofessional engineer in the course of his work. 17     Alternatively,\nthe Defendants’ case was that the Plaintiff (by himself and/or through\nhis agents) had conspired with Chan tointer\naliafix Chan’s fees at the unreasonable amount of $88,000,\nincrease the scope and specifications of the Rectification Works\nbeyond that prescribed in the Consultants’ Reports, and award the\ncontract to a higher bidder instead of to Winning Flag following\nthe first tender on 31 May 2012.[note: 26] 18     The\nFirst Defendant therefore counterclaimed the sum of $35,260 from\nthe Plaintiff, comprising: $20,000 paid to the Plaintiff as compensation\nfor moving and costs under the Settlement Agreement; and $11,260\nbeing the net amount paid to Chan for the first instalment of his fees.\nThe First Defendant also counterclaimed $4,000 being the outstanding professional\nfees due in relation to additional works on the Property allegedly\ncarried out by the Defendants between July 2010 and April 2011 (“the\nAdditional Works”). The Second Defendant counterclaimed the sums of\n$136,650 and $9,565.50 (being GST on the sum of $136,650) for the Additional\nWorks, as well as damages to be assessed in relation to the Plaintiff’s\ncomplaint to the PEB. 19     The\nparties agreed to bifurcation of the counterclaim.",
        "Issues": "20     Briefly,\nthe issues to be determined in this case are as follows: (a)     Whether\nChan’s appointment and the award to Crystallite should be set aside; (b)     Which\nparty is in breach of the Settlement Agreement and what amount of\ndamages is due to that party; (c)     Whether\nthe Plaintiff and Chan had conspired to injure or cause loss to\nthe Defendants; and (d)     Whether\nthe Defendants are entitled to their respective counterclaims against\nthe Plaintiff.",
        "The witnesses": "21     It\nis useful at the outset to introduce the witnesses and set out a\nfew observations on the reliability of their oral testimonies. 22     There\nwere five witnesses for the Plaintiff, comprising: (1) the Plaintiff;\n(2) the Plaintiff’s wife, Madam Kok Lai Mooi (“Madam Kok”); the Plaintiff’s\ntwo adult stepsons, (3) Dallan Cheah (“Dallan”) and (4) Dallon Cheah\n(“Dallon”); and (5) Chan. At all material times, Madam Kok, Dallan, and\nDallon lived in the Property with the Plaintiff, although Dallan\nand Dallon frequently travelled overseas. 23     The\nPlaintiff was generally unreliable as a witness and his testimony was\nnot very useful. He frequently testified that he was ignorant of\nmatters since he had left it to Madam Kok and his stepsons to deal\nwith Koh and the A&A Works.[note: 27]Nevertheless,\nsince the rest of the evidence was consistent with the Plaintiff’s\ntestimony that he had little personal involvement in matters relating\nto the A&A Works or the Settlement Agreement, I found no need\nto draw any adverse inference (as submitted by the Defendants) against\nthe Plaintiff as a witness. 24     I\nfound Madam Kok, Dallan, and Dallon to be generally forthright and\ncredible witnesses. The testimonies of Madam Kok and Dallan were particularly\nrelevant as they seemed to be the ones who were the most acquainted\nwith Koh, Chan, and the works to be done on the Property. I noted\nhowever that Madam Kok occasionally had some difficulty recalling certain\nevents that had taken place, for example in relation to what she\nhad told or shown Chan during his site visits to the Property. 25     As\nfor Chan, while I did not doubt his general honesty as a witness, his\ntestimony should be treated with circumspection since he appeared\nto be rather confused and forgetful at times. For example, Chan\ngave several different explanations of how he had arrived at his\nprofessional fees of $88,000 but also candidly admitted that his\nexplanations were not consistent with his affidavit of evidence-in-chief\n(“AEIC”).[note: 28] 26     There\nwere six witnesses for the Defendants: (1) Koh; (2) Mr Abishek Murthy\n(“Murthy”), the Defendants’ expert witness; (3) Mr Wee Yong Ping (“Wee”),\na project manager of Winning Flag; (4) Ms Sim Mui Ling (“Mui Ling”),\na director of the Second Defendant; (5) Low, the Defendants’ former solicitor;\nand (6) Chia, a partner and director of the First Defendant. 27     Koh\nwas the key witness for the Defendants and was generally forthright\nin his testimony. For instance, Koh admitted that the Second Defendant\nwas related to and managed by him.[note: 29]He\nalso readily admitted that the A&A Works had been defective\nand not up to standard.[note: 30]However,\ncertain parts of his testimony were of doubtful credibility, in particular\nhis testimony relating to his suspicions about Chan’s partiality toward\nthe Plaintiff at various junctures, which was not consistent with\nhis surprisingly passive stance throughout the process. 28     Murthy,\nthe Defendants’ expert witness, was a professional engineer. He\nrendered an expert report on a number of matters relevant to the present\ndispute, including whether the quantification of the Rectification Works\nin the final tenders submitted by the tenderers took into account works\nwhich exceeded the scope of the rectification works covered by the Consultants’\nReports and/or reflected the most efficient manner of rectification.",
        "Whether Chan’s appointment and\nthe award to Crystallite should be set aside": "29     The\nfirst issue is whether Chan’s appointment under the Settlement Agreement\nand/or the award to Crystallite should be set aside. 30     Parties\nrightly agreed that Chan’s appointment as the professional engineer\nunder the Settlement Agreement was a form of expert determination.[note: 31]Expert\ndetermination as a mode of dispute resolution was explained by Chan\nSeng Onn J inThe Oriental Insurance Co Ltd\nv Reliance National Asia Re Pte Ltd[2009] 2 SLR(R) 385\n(“Oriental Insurance”) at [25] as\nfollows: (d)    Expert\ndetermination – parties appoint their own expert to consider the\ndisputed issues and make a binding decision, without necessarily\nhaving to conduct a full enquiry following the usual adjudicatory\nrules,eg, rules of court in litigation,\nformal arbitration rules and general rules of natural justice. The\nrole of the expert is to undertake an investigation of the facts\nand to determine a dispute using his own expertise. His power and\njurisdiction is derived solely from the terms of the contract. 31     In\nthis case, it was clearly envisaged by the parties in the Settlement Agreement\nthat a professional engineer would be appointed as an expert to determine\nthe scope and specifications of the Rectification Works as well\nas award the tender for the Rectification Works. The question, however,\nis when one is entitled to set aside the appointment of the expert\nor a decision of the expert. It should be noted that the setting\naside of an expert’s appointment is a distinct issue from the setting\naside of the expert’s decision or determination.",
        "Setting aside of Chan’s appointment\nas professional engineer": "32     The\nfoundation of expert determination is the law of contract. The starting\npoint for ascertaining the validity of an expert’s appointment is therefore\nthe contract itself. In this case, the Settlement Agreement provided\nfor the appointment of an expert as follows: 3.Both\nParties shall endeavour to agree on the appointment of Lee Hon Leong\nas Professional Engineer (the “PE”)\nby 5pm on 13 March 2012. 4.Failing the agreement in paragraph\n3 above, each party shall identify 3 Professional Engineers and\nsubmit their names to the Mediator by 14 March 2012, who shall thereafter\nappoint the PE from amongst the 6 named Professional Engineers who\nare willing and able to act by 15 March 2012. 5.If none of the 6 named Professional\nEngineers are willing and able to act then, despite the failure\nof the Parties to agree to the appointment of Mr. Lee Hon Leong,\nMr. Lee Hon Leong shall be appointed to act as the PE. [emphasis in bold in original] 33     What\nhappened in this case was that since Mr Lee Hon Leong was not available\nto act, the Plaintiff and the Defendants nominated six professional engineers.[note: 32]Out\nof these six names, the mediator, Mr Chow Kok Fong (“the Mediator”),\nchose to appoint Chan.[note: 33] 34     I\ndo not see any reason for setting aside Chan’s appointment in this case.\nThe Defendants did not contend that Chan’s appointment was not in accordance\nwith the provisions of the Settlement Agreement. Nor did the Defendants\ncontend that Chan was in a position of conflict of interest in that\nhe had prior dealings with any interested party, as was the issue\ninHSBC Institutional Trust Services (Singapore)\nLtd (trustee of Starhill Global Real Estate Investment Trust) v\nToshin Development Singapore Pte Ltd[2012] 4 SLR 738\n(“HSBC v Toshin”). Rather, the Defendants’\ncase was that Chan’s appointment should be set aside solely because\nhe acted in a biased manner and chose to align his interests with\nthose of the Plaintiff.[note: 34]To\nmy mind, these concerns do not relate to the circumstances of Chan’s appointment.\nThey are more relevant to the issue of whether Chan acted properly\nin making his determinations under the Settlement Agreement.",
        "Setting aside of Chan’s award\nto Crystallite": "35     I\nthen consider the question of whether the Defendants are entitled\nto an order that Chan’s award of the contract for the Rectification\nWorks to Crystallite should be set aside on the grounds that: (1)\nChan acted in bad faith or in a fraudulent or biased manner; or\n(2) Chan had materially departed from the scope of his instructions\nas set out in the Settlement Agreement.[note: 35] 36     As\na general rule, the only grounds for challenge of an expert’s determination\nare as follows: (a)     material\ndeparture from instructions; (b)     manifest\nerror; or (c)     fraud,\ncollusion, partiality and the like. SeeOriental Insurance([30]supra) at [47]. 37     It\ncan thus be seen that the grounds for challenge of an expert’s determination\nare narrow and the court will not interfere with the expert’s decision\nsave in situations where intervention is necessary to uphold the parties’\ncontractual bargain. As stated by V K Rajah J (as he then was) inEvergreat Construction Co Pte Ltd v Presscrete Engineering\nPte Ltd[2006] 1 SLR(R) 634 (“Evergreat”)\nat [34]: … An expert’s decision can be set aside\non the basis of fraud or partiality. Beyond that it is probably\ncorrect to say that only a breach of an expert’s terms of appointment\nwould suffice to set aside his decision. Errors of fact or law will\nnot vitiate an award if the expert acts within his contractual mandate. … Material departure from instructions 38     I\nwill start by considering the latter of the two bases relied upon\nby the Defendants to set aside Chan’s award of the contract to Crystallite.\nOn what constitutes a material departure from instructions, the\nfollowing passage by Dillon LJ inJones v Sherwood\nComputer Services plc[1992] 1 WLR 277 at 287 (cited\nwith approval inOriental Insuranceat\n[48] andEvergreatat [40]) bears\nrepeating: On principle, the first step must be to\nsee what the parties have agreed to remit to the expert, this being,\nas Lord Denning M.R. said inCampbell v. Edwards[1976]\n1W.L.R 403, 407G, a matter of contract. The next step must be to\nsee what the nature of the mistake was, if there is evidence to\nshow that.If the mistake made was that the\nexpert departed from his instructions in a material respect—\ne.g. if he valued the wrong number of shares, or valued shares in\nthe wrong company, or if, as inJones (M.)\nv. Jones (R.R)[1971] 1W.L.R 840, the expert had valued\nmachinery himself whereas his instructions were to employ an expert\nvaluer of his choice to do that — either party would be able to\nsay that the certificate was not binding because the expert had\nnot done what he was appointed to do. [emphasis added in bold] 39     The\nfirst step is thus to ask: what did the parties agree to remit to Chan\nunder the Settlement Agreement? Clauses 6 to 10 of the Settlement Agreement\nset out the duties of the professional engineer (“PE”) as follows:[note: 36] 6.The\nPE shall conduct a joint site visit by 16 March 2012 and by 19 March\n2012 set out the scope and specifications of the rectification works\nbased on the 2 reports, namely the reports of Lee Consultants and\nBuilding Appraisal Pte Ltd, on the basis of the most efficient manner\nto rectify the defects so as to ensure that the works comply with\nthe required statutory regulations and are of a standard commensurate\nwith the price paid by the Claimants for the original works (the\n“Rectification Works”). 7.The scope and specifications of works\nprepared by the PE will be reviewed by both Parties within 3 days\nof the presentation of the same to the Parties. 8.Any disagreement on the PE’s scope\nand specification for the Rectification Works shall be referred\nback to Mr. Chow Kok Fong for an evaluation which shall be binding\non the Parties. 9.The PE shall take into account the\nfeedback of both Parties [ie, the Plaintiff\nand the Defendants] together with Mr. Chow Kok Fong’s binding evaluation\nand produce a final set of specifications, drawings and all other\ncontract documents necessary to call for a tender for the Rectification\nWorks. The PE shall then proceed to call for tenders from at least\n3 contractors. 10.The PE will evaluate the tenders and\naward the contract on the basis of the most reasonable quote received,\ntaking into account all the circumstances and not just price alone. [emphasis in bold in original] 40     The\nexcerpt above shows that the parties agreed to remit three major decisions\nto Chan as the professional engineer under the Settlement Agreement: (a)     Determination\nof the scope and specifications of the Rectification Works. This\nwas to be done based on the Consultants’ Reports and on the basis\nof the most efficient manner to rectify the defects so as to ensure\nthat the works complied with the required statutory regulations\nand were of a standard commensurate with the price paid by the Plaintiff\nfor the A&A Works. (b)     Calling\nfor tenders for the Rectification Works from at least 3 contractors. (c)     Evaluation\nand award of the contract for the Rectification Works. This was\nto be done on the basis of the most reasonable quote received, considering\nall the circumstances and not just price alone. 41     Chan\nwas informed of his duties and the scope of his work through a letter\nfrom the Plaintiff’s solicitors dated 16 March 2012 which was copied to\nthe Defendants’ solicitors.[note: 37]The scope of his work described\nin that letter was not the same as that stated in the Settlement\nAgreement. This, however, is immaterial because Chan confirmed that\nhe was eventually furnished with a copy of the Settlement Agreement\nafter the 28 March 2012 Meeting with between himself, Chia and Koh\n(see [10]supra) and before his\nsite visits to the Property on 3 and 4 April 2012[note: 38]and\nneither party contended that Chan was not bound to comply with the\nrelevant provisions of the Settlement Agreement pertaining to his\nwork. 42     Having\nestablished the instructions that were given to Chan under the Settlement\nAgreement, the second step is to inquire into the nature of the mistake.\nIf the mistake made constitutes a material departure from instructions,\nthen the expert’s decision is not binding. As to the test of materiality,\nany departure from instructions must generally be regarded as material\nunless it can truly be characterised as trivial orde\nminimisin the sense of it being obvious that it could\nmake no possible difference to either party; moreover, once a material\ndeparture from instructions is established, the court is not concerned\nwith its effect on the result:Veba Oil Supply\n& Trading GmbH v Petrotrade Inc[2002] 1 All ER 703\nat [26], cited with approval inOriental Insuranceat\n[57]. Put another way, a departure from instructions must be considered\nmaterial unless the departure can be characterised as trivial orde minimiswhen analysed with respect\nto the instructions and that end result, even if shown not to be\nsignificantly different, must still be set aside as it is a nullity\nand not binding:Oriental Insuranceat\n[84]. 43     A\ndistinction should be drawn between mistakes made by the expert and\na departure from instructions. InNikko Hotels\n(UK) Ltd v MEPC plc[1991] 2 EGLR 103 (“Nikko\nHotels”), Knox J expressed this distinction using the\nanalogy of answering the right or wrong question (at 108): The result, in my judgment, is that if\nparties agree to refer to the final and conclusive judgment of an\nexpert an issue which either consists of a question of construction\nor necessarily involves the solution of a question of construction,\nthe expert’s decision will be final and conclusive and, therefore, not\nopen to review or treatment by the courts as a nullity on the ground\nthat the expert’s decision on construction was erroneous in law,\nunless it can be shown that the expert has not performed the task\nassigned to him.If he has answered the right\nquestion in the wrong way, his decision will be binding. If he has\nanswered the wrong question, his decision will be a nullity.[emphasis\nadded in bold] 44Nikko Hotelswas applied shortly thereafter\nby Paul Baker QC inPontsarn Investments Ltd\nv Kansallis-Osake-Pankki[1992] 1 EGLR 148, where he\nstated at 151: … The fact that he may be patently wrong\ndoes not mean that he has not done what he was appointed to do nor\nthat he has asked himself the wrong question. To take any other\nview would lead to the sort of refined arguments such as have been\ndeployed here and go a long way to emasculate the requirement that\nthe decision of the expert, as a matter of contract between the\nparties, be final and binding. Thus, the advantages of cost, speed\nand finality would be seriously diminished. Therefore, where the expert has not departed from his instructions\nand has asked the right questions, his decision cannot be challenged\non the ground that he made a mistake, even if he subsequently admitted\nthe mistake. 45     I\ncome now to the facts of the present case. The Defendants alleged that\nChan materially departed from his instructions in the following\nways: (a)     Chan\ndid not base the scope and specifications of the Rectification Works\nsolely on the Consultants’ Reports.[note: 39] (b)     Chan\nexpanded the scope and specifications of the Rectification Works\nafter the Tender Document was finalised.[note: 40] (c)     Chan\ndid not ensure that the defects would be rectified according to\nthe most efficient manner.[note: 41] (d)     Chan\nfailed to ensure that the standard of the Rectification Works was\ncommensurate with the price paid by the Plaintiff for the original\nA&A Works.[note: 42] 46     The\nfirst point to consider is whether Chan was entitled to go beyond the\nscope of the Consultants’ Reports in preparing the scope and specifications\nof the Rectification Works. The Plaintiff’s position was that Chan\nwas entitled to do so as clause 6 of the Settlement Agreement (see\n[39]supra) did not contain the\nterms “solely” or “only” and such terms should not be implied into\nthe Settlement Agreement.[note: 43]The\nDefendants however contended that as a matter of contractual interpretation\n(as opposed to the implication of terms), the parties’ objective\nintention was that clause 6 of the Settlement Agreement should be\nread as including the terms “solely” or “only”.[note: 44] 47     The\nDefendants’ main argument was that its interpretation of clause\n6 of the Settlement Agreement was supported by the background facts leading\nup to the conclusion of the Settlement Agreement, namely that the Plaintiff’s\nclaims at the mediation on 12 March 2012 were based solely on the\nfindings in the Consultants’ Reports.[note: 45]The\nDefendants cited the following passage fromZurich\nInsurance (Singapore) Pte Ltd v B-Gold Interior Design & Construction\nPte Ltd[2008] 3 SLR(R) 1029 (“Zurich Insurance”)\nat [132]: The extrinsic evidence in question is admissible\nso long as it is relevant, reasonably available to all the contracting\nparties and relates to a clear or obvious context … However, the\nprinciple of objectively ascertaining contractual intention(s) remains\nparamount. Thus, the extrinsic evidence must always go towards proof\nof what the parties, from an objective viewpoint, ultimately agreed\nupon. … 48     The\nPlaintiff however pointed out thatZurich Insurancealso cautioned\nthat extrinsic evidence should only be employed to illuminate the contractual\nlanguage and not as a pretext to contradict, vary, add to, or subtract\nfrom the terms of a written contract, the applicable test being whether\nthe alternative interpretation falls within the scope of meaning\nthat the contractual words could bear (seeZurich\nInsuranceat [122]–[123], [132]). The Plaintiff thus\nsubmitted that to ask the court to read the words “only” or “solely”\ninto clause 6 would be to effectively re-write the Settlement Agreement\nand it was impermissible to rely on extrinsic evidence for such\npurposes.[note: 46] 49     The\ndispute here is primarily over the proper interpretation of the instructions\ngiven to the professional engineer in the Settlement Agreement.\nAs such, there is a preliminary issue as to whether the court (instead\nof the expert) has jurisdiction to decide such questions of interpretation:\nsee,eg,Norwich\nUnion Life Assurance Society v P&O Property Holdings Ltd[1993]\n1 EGLR 164;Mercury Communications Ltd v Director\nGeneral of Telecommunications and another[1996] 1 WLR\n48. While this issue was not raised by the parties, I consider this\nto be the applicable position in the present case in the absence\nof any indication that the parties intended to remit such questions\nto the professional engineer. In any case, the parties appeared\nto have proceeded on the basis that questions of interpretation\nshould be decided by the court. 50     In\nmy judgment, Chan’s instructions under the Settlement Agreement\ndid not restrict him to the scope of the Consultants’ Reports in preparing\nthe scope and specifications of the Rectification Works. The plain language\nof the clause 6 of the Settlement Agreement merely provided that Chan\nwas to “set out the scope and specifications of the rectification\nworks based on” the Consultants’ Reports. Looking at the Settlement\nAgreement in its entirety, it appears that the parties intended\nto give the professional engineer a measure of discretion in preparing\nthe scope of the Rectification Works. For example, as pointed out\nby the Plaintiff, clauses 7 and 8 of the Settlement Agreement provided\nthat parties could review the scope and specifications prepared\nby the professional engineer and any disagreement would be referred\nback to the Mediator for a binding evaluation.[note: 47] 51     In\nfairness to the Defendants, there is some merit in the point that\nthe Settlement Agreement was concluded in the context of the Plaintiff’s\nletter of demand dated 8 February 2012 and the Plaintiff’s summary\nof claim provided for the purposes of the mediation on 12 March\n2012, both of which were based solely on the findings in the Consultants’\nReports.[note: 48]While the Consultants’ Reports\nwere obviously intended to be the main reference point for the professional\nengineer in determining the scope of the Rectification Works, I\nnevertheless find that clause 6 of the Settlement Agreement cannot\nbe given the restrictive interpretation that was suggested by the\nDefendants, given the nature of the professional engineer’s role\nin the Settlement Agreement. Koh himself conceded in cross-examination that\nin certain circumstances, the professional engineer might be justified\nin going beyond what was specified in the Consultants’ Reports:[note: 49] Witness…Technical\nworks are very different from, er, legal works. Earlier question,\n“solely” and “only”,actually, technical work, certain\ntime, there is reason to give ourself---to involve slightly more\nthan what they specify.It’s perfectly correct. I think\nnobody should say it is not correct. Even though I’m a witness here,\nthis may be prejudiced against me, I’m telling you the truth. [emphasis\nadded in bold]   In a similar vein, Low, the Defendants’ former solicitor,\nstated his understanding of the professional engineer’s role under\nthe Settlement Agreement as follows:[note: 50] AYour\nHonour, my recollection of the drafting of the settlement agreement\nwas just---it became clear, after meeting both sides, to Mr Chow\nthat it was not going to be possible to come to a settlement with a\nfinal figure. … And along the line, er, there was a suggestion that, “Let’s\nleave it to an independent party to assess the works based on the two\nreports that have been submitted. And which form the basis of the claim\nand the mediation”. So that proposal was agreed to in principle. …[I]t was clear in my mind that the whole basis of\nthe settlement was to use those two reports, give it to a PE and\nsee what he comes up with. … [emphasis added in bold] 52     Following\nfrom the discussion above, I am of the opinion that Chan did not\nmaterially depart from his instructions by including in the scope and\nspecifications for the Rectification Works other works which were\nnot stated in the Consultants’ Reports. 53     Similarly,\nI am not satisfied that Chan materially departed from his instructions\nby expanding the scope and specifications of the Rectification Works\nafter the Tender Document was finalised. The Defendants submitted\nthat Chan did so through the issuance of the Tender Questionnaire\nto the tenderers and that this was impermissible under the Settlement\nAgreement which did not envisage changes being made to the scope\nand specifications of the Rectification Works once the Tender Document\nwas finalised.[note: 51]The\nPlaintiff, on the other hand, submitted that the Tender Questionnaire\nwas part of the tender exercise that Chan was engaged to conduct\nand was merely intended to clarify the scope of works covered by\nthe tenderers.[note: 52]While\nit is true that the Settlement Agreement did not expressly allow\nfor changes to be made to the Tender Document once it was finalised,\nit also gave the professional engineer a measure of discretion and\nautonomy in preparing the relevant documents and conducting the\ntender process. In this context it cannot be said that Chan, by\nissuing the Tender Questionnaire in the course of the tender process, had\nnot done what he was appointed to do. 54     As\nregards the Defendants’ last two points that Chan failed to ensure that\nthe defects would be rectified according to the most efficient manner and\nthat the standard of the Rectification Works was commensurate with the\nprice paid by the Plaintiff for the original A&A Works, these\narguments were essentially based on the expert opinion of Murthy,\nthe Defendants’ expert witness, that Chan’s method of rectification\nand scope of works in the Tender Document was neither the most efficient\nnor of a standard commensurate with the price of the A&A Works.\nThe Defendants were essentially saying that Chan had answered the\nright question in the wrong way and not that he had answered the\nwrong question. According to the authorities cited above, while\nthis may constitute an error on the part of the expert, it does\nnot constitute a departure from instructions. 55     I\nshould add that these conclusions do not, however, detract from\nthe established principle that Chan, as a professional and as an\nexpert, owes duties of reasonable skill and care to both parties\nand will be liable in damages should he be negligent in carrying\nout his duties: seeCampbell v Edwards[1976]\n1 WLR 403 (“Campbell v Edwards”)\nat 407. This is the safeguard which the law gives to parties when\nthey appoint an expert:Holland House Property\nInvestments Limited v Crabbe[2008] CSIH 40 at [6]. But\nthis is a separate issue from that of setting aside his expert determination. Fraud, collusion, and partiality 56     I\nturn then to the other basis on which the Defendants challenged Chan’s\naward, namely that he acted in bad faith or in a fraudulent or biased manner.\nMany authorities have made general statements to the effect that an\nexpert’s determination will not be binding in the event of fraud, collusion,\npartiality, and so on. A classic example is Lord Denning MR’s speech\ninCampbell v Edwards(see [55]supra) at 407: “If there were fraud or\ncollusion, of course, it would be very different. Fraud or collusion unravels\neverything.” InBaber v Kenwood Manufacturing\nCo Ltd and Whinney Murray & Co[1978] 1 Lloyd’s Rep\n175, Lawton J said at 181: “What is not acceptable is the risk of\nthe expert being dishonest or corrupt.” These last two statements\nwere reviewed inEvergreat, where\nRajah J opined at [29] that: “In the absence of fraud or any corrupt\ncolouring of the [expert’s] determination, there is neither liberty\nnor latitude to interfere with or rewrite the parties’ solemn and\nconsidered contractual bargain”. Perhaps the most comprehensive\ndescription of this category of vitiating factors was given inOriental Insurancewhere Chan J referred\nat [47] to: “fraud, corruption, collusion, dishonesty, bad faith,\nbias or the like”. 57     In\nthis case, the parties were in agreement that Chan had the duty\nto act as an independent and impartial expert under the Settlement Agreement.[note: 53]The\nDefendants however submitted that the Plaintiff had influenced or\ninterfered with Chan’s work under the Settlement Agreement and/or\nthat Chan was biased and partial towards the Plaintiff throughout the\ntender process, such that Chan and the Plaintiff were colluding\nto obtain the best possible outcome for the Plaintiff to the Defendants’ detriment.[note: 54]The\nDefendants highlighted the following factors:[note: 55] (a)     Chan\nhad inflated his fees; (b)     Chan\nconsidered the Plaintiff to be his client and saw himself as the\nPlaintiff’s professional engineer; (c)     Chan\nwas of the opinion that the Rectification Works had to be carried\nout to the Plaintiff’s satisfaction; (d)     Chan\nhad increased the scope of the Rectification Works on the instruction\nof the Plaintiff and/or his representatives; (e)     Chan\nadvocated the Plaintiff’s interpretation of the Settlement Agreement\nalthough he had no part in drafting it; (f)     Chan\nchastised the Defendants for not voicing out their objections to\nthe scope and specifications of the Tender Document; (g)     Chan\nunfairly disfavoured Winning Flag and Builders Alliance just because\nthey were the tenderers nominated by the Defendants. 58     Since\none of the grounds of challenge raised by the Defendants is that of\nbias and partiality, I should say a few words about the applicable\ntest for partiality in the context of an expert determination. In\nEngland, the test is one of actual bias and not apparent bias: seeMacro and others v Thompson and others (No. 3)[1997]\n2 BCLC 36 (“Macro v Thompson”) at\n65;Bernhard Schulte GmbH & Co KG v Nile\nHoldings Ltd[2004] EWHC 977 (Comm) at [98]; John Kendall,\nClive Freedman & James Farrell,Expert\nDetermination(Sweet & Maxwell, 4th Ed, 2008) (“Expert Determination”) at para 14.11.4. The\nrationale for this rule was articulated by Robert Walker J inMacro v Thompsonat 65 as follows: … [W]hen the court is considering a decision\nreached by an expert valuer who is not an arbitrator performing\na quasi-judicial function,it is actual partiality,\nrather than the appearance of partiality that is the crucial test.Otherwise\nauditors (like architects and actuaries) who have a long standing professional\nrelationship with one party (or persons associated with one party)\nto a contract might be unduly inhibited in continuing to discharge their\nprofessional duty to their client, by too high an insistence on\navoiding even an impression of partiality. … [emphasis added in\nbold] 59     In\nSingapore, however, it appears that this point is not yet settled.\nInHSBC v Toshin(see [34]supra), which concerned allegations of\nbias against licensed valuers appointed pursuant to the lease agreement\nbetween the landlord appellant and the tenant respondent, the respondent\nargued before the Court of Appeal that at law, actual bias (and\nnot apparent bias) was required to challenge an expert’s appointment\n(at [28]). The Court of Appeal did not express a final view on this\nquestion as it decided that the issue of bias (whether actual or\napparent) did not even arise in that case (HSBC\nv Toshinat [58]). It is similarly not necessary for\nme to decide this question since the parties did not raise it and\nin any event, the Defendants seemed to have proceeded on the basis\nof actual bias rather than apparent bias. This issue therefore remains\nto be decided in a future case with the benefit of submissions from\ncounsel. 60     I\nnow come to the Defendants’ allegations of bias and collusion against\nChan. Dealing first with the alleged inflation of Chan’s fees, the Defendants’\nposition was essentially that Chan’s fees had been controlled by the\nPlaintiff. It was suggested that Chan seemed to have no idea as\nto how his fees were computed and that he had given a quote for\nhis fees at $88,000 even before he had reviewed the Consultants’\nReports or inspected the Property.[note: 56]More\nsignificantly, the Defendants alleged that at the 28 March 2012\nMeeting between Koh, Chia and Chan (see [10]supra),\nChan had admitted or agreed that: (1) he did not quote a fee of\n$88,000; (2) he had no control over his fees; (3) his fees were\nusually only between $15,000 and $18,000; and (4) the Plaintiff\nwas out to “destroy” Koh.[note: 57] 61     Having\nconsidered the evidence before me, I was not persuaded that Chan’s\nfees had been controlled by the Plaintiff. The Defendant’s version\nof what transpired at the 28 March 2012 Meeting was supported by\npurely oral accounts from Koh and Chia which, on a closer examination,\ndid not unequivocally point to the Plaintiff being in control of\nChan’s fees. For instance, both Koh and Chia stated that Chan did\nnot say who had control over his fees.[note: 58]Chia\nalso clarified that Chan did not specifically say that the Plaintiff\ntold Chan that he was out to destroy Koh.[note: 59]I have\nalso taken into account the fact that Koh’s credibility as a witness\nwas uneven (see [27]supra). As\nfor Chia, his recollection of events has to be treated with some circumspection.\nHe appeared to be unable to recall anything about the meeting other\nthan the conversation he recounted in his affidavit[note: 60](which would\nhave taken only a few minutes) even though this meeting, according to\nhim, lasted 45 minutes[note: 61].\nFurther, Koh and Chia’s accounts were disputed by Chan, who denied\nthat he had told Koh and Chia that the figure of $88,000 was not\nhis or that the Plaintiff was out to destroy Koh; Chan also said\nthat there had been no mention during the meeting of his usual fees\nbeing between $15,000 and $18,000.[note: 62]As\nfor the basis of Chan’s fees, Chan did admit that his fees of $88,000\nwere not based on the Consultants’ Reports since he had only received\nthemafterhe first gave his quote\nto the Plaintiff’s solicitors.[note: 63]As\nhighlighted by the Defendants, Chan also seemed unsure as to the\nbreakdown of his fees.[note: 64]However,\nthis is not sufficient to prove that the Plaintiff or his agents\nhad manipulated Chan in the setting of his fees. The burden of proof\nthat this had taken place lay with the Defendants and, in my judgment,\nthey have not discharged it. 62     The\nDefendants’ point that Chan considered the Plaintiff to be his client\nand saw himself as the Plaintiff’s professional engineer is not,\nin and of itself, sufficient proof of bias on his part. Chan’s role\nas the professional engineer under the Settlement Agreement is similar\nto that of a certifier under a construction contract whereby a contractor’s\nentitlement to be paid is predicated on the issuance of a certificate\nby the certifier. It is settled that the fact that a certifier under\na construction contract is appointed by the employer is an unavoidable\npotential incidence of the contractual relationship and does not\ndisqualify him from making a decision under the contract:Expert Determinationat para 14.11.2. 63     The\ncase ofAmec Civil Engineering Ltd v Secretary\nof State for Transport[2005] 1 WLR 2339 (“Amec”) provides a good illustration of\nthis.Amecconcerned a dispute resolution\nclause in a construction contract which provided that any dispute\nor difference was to be referred to and settled by the engineer\nwhose decision was to be final and binding subject to arbitration\nproceedings being brought within a certain time. One of the issues\nbefore the court was whether the engineer’s decision under the contract\nwas vitiated for procedural unfairness because a parallel claim\nwas also being brought by the respondent against the engineer in\nrespect of the subject matter of his decision. The majority of the\nCourt of Appeal held that in the circumstances, the engineer had\nconsidered the matter properly and sufficiently; the fact that an\nequivalent claim was brought against the engineer did not disqualify\nthe engineer from giving a valid decision under the dispute resolution\nclause since such a conflict of interest was an unavoidable potential\nincidence of the contractual relationship between the parties:Amecat [52]. 64     It\nhas been observed that a certifier or professional consultant in\na construction contract is often called upon to perform two different\ntypes of duties: (1) in issuing certificates which determine the\ncontractor’s entitlement to be paid or deciding controversial matters\nsuch as valuation, he must act fairly and exercise his own judgment\nobjectively; (2) in other matters, he is the agent of the owner\nand must look after the interests of the owner in the project: see\nChow Kok Fong,Law and Practice of Construction Contracts\nVol 1(Sweet & Maxwell Asia, 4th Ed, 2012) at para\n8.42;Hudson’s Building and Engineering Contracts(Nicholas\nDennys QCet aleds) (Sweet &\nMaxwell, 12th Ed, 2010) at para 4–037. 65     The\ndual function of an architect in a building contract was noted by Lord\nReid inSutcliffe v Thackrah[1974]\nAC 727 (“Sutcliffe”) at 737: … It has often been said, I think rightly,\nthat the architect has two different types of function to perform.In many matters he is bound to act on his client’s\ninstructions, whether he agrees with them or not; but in many other matters\nrequiring professional skill he must form and act on his own opinion. Many matters may arise in the course of\nthe execution of a building contract where a decision has to be\nmade which will affect the amount of money which the contractor\ngets. Under the R.I.B.A. contract many such decisions have to be\nmade by the architect and the parties agree to accept his decisions. For\nexample, he decides whether the contractor should be reimbursed\nfor loss under clause 11 (variation), clause 24 (disturbance) or\nclause 34 (antiquities); whether he should be allowed extra time\n(clause 23); or when work ought reasonably to have been completed\n(clause 22). And, perhaps most important, he has to decide whether\nwork is defective. These decisions will be reflected in the amounts\ncontained in certificates issued by the architect. The building owner\nand the contractor make their contract on the understanding that\nin all such matters the architect will act in a fair and unbiased\nmannerand it must therefore be implicit in the owner’s\ncontract with the architect that he shall not only exercise due\ncare and skill but alsoreach such decisions\nfairly, holding the balance between his client and the contractor. [emphasis added in bold] 66     InHiap Hong & Co Pte Ltd v Hong Huat Development\nCo (Pte) Ltd[2001] 1 SLR(R) 458, the Court of Appeal\ncitedSutcliffewith approval, making\nthe following observations (at [15]–[16]): 15    It\nis settled law that an architect under a building contract is not\nan arbitrator. But he has a dual function. In the words of Lord\nReid inSutcliffe v Thackrah[1974]\nAC 727 at 737; [1974] 1 All ER 859 at 863: In many matters he is bound to act on his\nclient’s instructions, whether he agrees with them or not; but in\nmany other matters requiring professional skill, he must form and\nact on his own opinion. 16    It\nis equally settled law that an owner and a contractor would have made\ntheir contract on the understanding that in all matters where the architect\nhas to apply his professional skill and judgment, the architect\nwill act in a fair and unbiased manner in applying the terms of\nthe contract. Such matters will include the issue of certificates\nfor payments and the grant of extension of time. While an architect\nunder such a contract is the employer’s agent, in the exercise of\nhis functions requiring skill and judgment, he must act fairly and\nprofessionally and neither party should seek to unfairly or unduly\ninfluence him in the discharge of those functions. 67     I\nregard the above authorities to be applicable to the present case. Chan\ncannot be regarded as independent because he is employed by the Plaintiff.\nChan’s general function was to act on behalf of the Plaintiff, for example\nin supervising the Rectification Works and liaising with the relevant\nauthorities to regularise all drawings, submissions and construction\nworks on site.[note: 65](While these functions were set\nout in the letter from the Plaintiff’s solicitors dated 16 March\n2012 and not the Settlement Agreement itself, I note that the Settlement\nAgreement did not prohibit Chan from undertaking such responsibilities\nand in any event, the letter from the Plaintiff’s solicitors dated\n16 March 2012 was copied to the Defendants’ solicitors at that time\nand no objections to it were ever raised by the Defendants.[note: 66])\nHowever, in those parts of Chan’s duties which allocated decision-making\nfunctions to him, he was required to act professionally, honestly\nand impartially in discharging those functions as opposed to favouring\nthe interests of the Plaintiff: seeScheldebouw\nBV v St. James Homes (Grosvenor Dock) Ltd[2006] EWHC\n89 (TCC) at [34]–[35]. 68     Chan’s\ndecision-making functions under the Settlement Agreement included\nsetting out the scope and specifications of the Rectification Works, conducting\na tender for the Rectification Works and evaluating and awarding\nthe tender. The parties must have intended that Chan was to discharge\nthese functions in a fair and unbiased manner, without preferring the\ninterests of either the Plaintiff or the Defendants. Indeed, the\nentire purpose of Chan’s appointment under the Settlement Agreement\nwas to provide a fair and neutral way of rectifying the defective\nA&A Works. 69     The\nreal question is therefore whether Chan acted impartially in drawing\nup the scope and specifications of the Rectification Works and in his\nconduct of the tender process, or whether he favoured the interest\nof the Plaintiff in doing so. 70     On\nthe evidence before me, I consider that Chan did favour the interest\nof the Plaintiff in carrying out his duties under the Settlement Agreement\nand accordingly failed to act impartially in that regard. I agree with\nthe Defendants that this was evident from the fact that: (1) Chan\nwas of the mentality that the Rectification Works had to be carried\nout to the Plaintiff’s satisfaction; and (2) Chan had increased\nthe scope of the Rectification Works on the request of the Plaintiff\nand/or his representatives. 71     In\nmy judgment, Chan acted in the way he did due to the mistaken view\nthat he was to act as the Plaintiff’s agent in setting out the scope\nand specifications of the Rectification Works and in conducting\nthe tender for the Rectification Works. 72     That\nChan had misdirected himself is evident from his understanding that\nthe Rectification Works had to be carried in a manner which, in\neffect, only took into account the interests of the Plaintiff and\ndid not take into account the Defendants’ interests. In his AEIC,\nChan repeatedly stated that as the professional engineer, he had\nto ensure that the Rectification Works were carried out “to the\nsatisfaction of the Plaintiff”.[note: 67]Chan\nfurther explained in his AEIC that it was with this understanding\nthat he had prepared the Tender Document “which provided a comprehensive\nlist of rectification works that [he] deemed were necessary”.[note: 68]Chan\nalso explained that the Tender Questionnaire which reminded the\ncontractors that their quotes should include the cost of full reinstatement\nin the event that the replacement works could not match the existing\nfinishes was acceptable because it was the professional engineer’s\nresponsibility to “ensure that the Plaintiff is satisfied with the\nend product”.[note: 69]Chan subsequently in\ncross-examination retracted his statements somewhat by saying that\nonly some items had to be rectified to the Plaintiff’s satisfaction while\nmost of the other works had to be rectified to his own satisfaction.[note: 70]Nevertheless,\nit was clear from his testimony that he had confused his general\nfunction as the Plaintiff’s professional engineer with his special function\nunder the Settlement Agreement to act impartially and fairly in determining\nthe scope of the Rectification Works and awarding the contract on\nthe basis of the most reasonable quote received. 73     Chan’s\nmistaken view of his role under the Settlement Agreement was also\nevident from the way that he allowed additional works to be included in\nthe Rectification Works to be paid for by the Defendants on the instruction\nof the Plaintiff and/or his representatives. One example of this relates\nto an abrupt drop in the floor level at the entrance to the karaoke room\non the third floor of the Property. Chan’s finalised Tender Document required\nthe contractor to “cut-down 50mm drop at entrance to [the karaoke\nroom]” and Chan testified that he had envisaged that this would involve\ncreating a ramp at the entrance.[note: 71]However,\nhe did nothing when, during the Second Site Show-around, Madam Kok\nasked the contractors to adopt what was a significantly costlier\nremedy of removing the entire raised platform of the room.[note: 72]On\nthe stand, he accepted that these were additional rectification\nworks that had to be paid for separately by the Plaintiff but when\nhe was questioned as to how he envisaged this would be done, he\ngave an unconvincing explanation that he would issue a variation order\nto remove this item and reduce the awarded contract sum subsequently.[note: 73]This\nexplanation was probably an afterthought given the complete absence\nof any contemporaneous supporting documents and the fact that this\nintended course of action was never referred to in either his lengthy\nAEIC or the affidavits of any other witnesses. 74     The\nlast point of note relates to the Defendants’ submissions that Chan\nunfairly disfavoured Winning Flag and Builders Alliance simply because\nthey were the tenderers nominated by the Defendants. It was not disputed\nthat Winning Flag and Builders Alliance were the Defendants’ nominated\ncontractors. Chan’s evidence was that he had found their quotations\ntoo low to carry out the job properly and that, after a telephone conversation\nwith Koh, he had realised that Koh was behind their tenders since\nhe had recommended them as contractors.[note: 74]Chan took this as a factor against\ntheir bids for the following reason:[note: 75] ASo\nthe---the purpose of that is---is, he---he want to submit a---a\nlow tender so---because the money come out his pocket. So it will---he would\nprobably do it as cheap as possible again. 75     In\nmy judgment, if Chan’s testimony is correct, he cannot be faulted for\ntaking into account the fact that Winning Flag and Builders Alliance were\ncontractors nominated by Koh as a factor against them, especially since\nKoh was clearly an interested party insofar as he was the one responsible\nfor paying for the Rectification Works. Nevertheless, while Chan\nmay be have been rightly suspicious of the competence and reliability of\nWinning Flag and Builders Alliance, his evaluation of the tenderers\ndid not seem to have taken into account the interests of the Defendants\nat all but were based on the Plaintiff’s interests as the building\nowner. In fact, under cross-examination, Chan admitted that his\nfirst evaluation report dated 8 June 2012 which evaluated the tenders\nreceived from the first tender exercise was not objective[note: 76]and contained\ncriticisms of Winning Flag and Builders Alliance that were not fair[note: 77]. 76     In\nre-examination, Chan attempted to explain that he had not in fact understood\nthe meaning of “not objective” and that he had only agreed with counsel\nfor the Defendants, Mr Derek Kang (“Mr Kang”), that he was not objective\nbecause “I’m a bit confused”.[note: 78]However,\nI found his claim of ignorance incredible. First, from what I observed\nto be his command of the English language in the witness box, it\nwas highly unlikely that he did not understand the meaning of “not\nobjective”. Second, he had in fact answered other questions in the\ncourse of his oral testimony confirming his duty to be “objective”\nin preparing the Tender Document[note: 79]and\nin assessing the tenders[note: 80].\nThird, at yet another point in his testimony, he had contrasted the\nobjectivity with which he evaluated the second round of tenders\nwith the lack of thereof in the first round:[note: 81] QWould\nyou agree with me that because of the way you had evaluated Winning\nFlag for the second tender, you were also not fully objective for\nthe second tender? AI disagree. QI put it to you that you were not fully\nobjective for the two tenders and you were unfair to some of the\ncontractors for the two tenders because you had allowed yourself\nto be influenced by the plaintiff or his representatives. AI disagree. QAre you able today to give us the explanation\nthat you were not able to give us on Friday as to why, by your own\nadmission, you had not been objective for the first tender? If you\nmaintain your position, you can tell us. But you can’t explain,\nyou can tell us. AI was not objective in the---on the\nfirst---first relation. In the second one, I think, er, I’m very\nfair. 77     I\nwas also not convinced by the somewhat strained distinction sought to\nbe made by counsel for the Plaintiff, Mr Eric Chew (“Mr Chew”),\nin re-examination (which Chan agreed with) that Chan had merely\nbeen “agreeing with Mr Kang’s feeling that it’s not fair” and was\n“not saying that [Chan] had not been fair”.[note: 82] 78     Therefore,\nhaving concluded that Chan failed to act impartially and fairly\nas between the parties due to his own mistaken notion of his functions under\nthe Settlement Agreement, his award of the contract to Crystallite must\nbe set aside.",
        "Breach of the Settlement Agreement": "79     The\nquestion then is what effect the setting aside of Chan’s award to Crystallite\nhas on the Settlement Agreement. 80     The\nusual consequence of a successful challenge to an expert’s determination\nis that it is a nullity and does not bind any of the parties:Oriental Insuranceat [84]. Usually, the\ncourt will direct that the expert come to a new decision in accordance\nwith the instructions as clarified by the court:Expert\nDeterminationat para 14.18.3. For example, inOriental Insurance, the expert was found\nto have materially departed from his instructions such that it amounted\nto a manifest error. Chan J thus remitted the determination to the\nexpert for his re-consideration and provided the expert with a detailed\ncomputation guide (Oriental Insuranceat [223]–[225]).\nHowever, the courts have also substituted alternative machinery\nfor the contractual machinery in appropriate cases. For example, inMacro v Thompson(see [58]supra) the court considered that a revaluation\nby the expert auditor would be inappropriate given his lack of expertise\nin the relevant area and directed that new valuations be conducted. 81     In\nthe present situation, the way forward is obstructed by the fact\nthat there are allegations on both sides that the other party is\nin repudiatory breach of the Settlement Agreement. First, there\nis the Defendants’ argument that they were entitled to terminate\nthe Settlement Agreement because the Plaintiff had breached an implied\nterm in the Settlement Agreement not to interfere with or influence\nthe professional engineer in his course of work. Second, there is\nthe Plaintiff’s claim that the Defendants failed to comply with\nthe Settlement Agreement by refusing to pay for Chan’s fees and\nthe costs of the Rectification Works. Third, there is the Defendants’\nargument that the Plaintiff breached a fundamental term of the Settlement\nAgreement by filing a complaint to the PEB on 16 August 2012 (see\n[14]supra).",
        "Implied term not to interfere\nwith the expert’s independence": "82     It\nwas not in dispute that there was an implied term in the Settlement Agreement\nthat the parties would not seek to interfere with the professional engineer’s\nindependence or influence the professional engineer in his course\nof work.[note: 83]The\ndispute is over whether the Defendants have adduced sufficient evidence\nof unlawful influence or interference by the Plaintiff in Chan’s\nwork. 83     In\nmy judgment, there is insufficient evidence of such unlawful influence\nor interference in this case. I have already found that there is\nno evidence that the Plaintiff and/or his agents had controlled\nChan’s professional fees (see [61]supra).\nI have also found at [71] above that any bias or partiality towards\nthe Plaintiff on the part of Chan was because he had misconstrued\nhis role under the Settlement Agreement and not because the Plaintiff\nhad acted improperly. 84     The\nonly evidence of any “interference” with Chan’s work was that Madam\nKok had brought Chan around the Property during his site visits on\n3 and 4 April 2012 to point out some defects which were not contained in\nthe Consultants’ Reports, and that she had made some requests for additional\nrectification works to Chan and/or the potential contractors during\nthe First and Second Site Show-rounds.[note: 84]However, I do not regard the Settlement\nAgreement as prohibiting any communication between the Plaintiff\nand his family members and the professional engineer or would-be contractors\nwho came to inspect the Property which they were unfamiliar with\nand which the Plaintiff and his family were living in. It would\nhave been reasonable to expect some communication to take place\non those occasions and if the parties intended to prohibit this,\nthe Settlement Agreement would have stated it explicitly. In this\nregard, I note that Koh, on behalf of the Defendants, had himself\nmade a telephone call to Chan on either 6 or 7 June 2012 regarding\nChan’s evaluation of the tenders received from the first tender\nexercise.[note: 85]While\nthe contents of the telephone conversation were disputed, what was\nnot in dispute was the fact that there were communications between\nKoh and Chan which were initiated by Koh and which did not involve\nthe Plaintiff. 85     The\nissue is therefore whether Madam Kok’s conduct in communicating\nwith Chan and/or the potential contractors went beyond what was\nacceptable and amounted to an improper attempt to influence Chan\nor interfere with his independence. 86     There\nis nothing to suggest that Madam Kok knew that she was pointing\nout defects to Chan which were not in the Consultants’ Reports or that\nshe was trying to get Chan to include in the Rectification Works additional\nworks that should not have been the Defendants’ responsibility. As\nI have stated above at [24], Madam Kok was an honest and candid witness.\nAt that time, she was living in a house that had numerous defects\nas a result of the Defendants’ failure to carry out the A&A\nWorks properly. In those circumstances, it is understandable that\nshe would have been eager to point out all the defects to Chan during\nhis visits to the Property. Her primary goal was to get her house\nfixed and knowing that Chan was supposed to be the professional,\nshe would not have been particular about whether or not a specific\ndefect was within the scope of the original A&A Works and Consultants’\nReports. There is no evidence of any impropriety on her part or\nthat her actions, from an objective point of view, were the type\nof actions which would have impaired Chan’s ability to independently determine\nthe issue in exercise of his professional judgment. 87     As\nfor the communications made by Madam Kok during the First and Second\nSite Show-rounds relating to certain things to be done on the Property,\nChan characterised these as “requests”[note: 86]and there is no evidence\nthat any of these “requests” were made in a manner which would have\nimpaired Chan’s professional judgment in assessing whether they should\nbe properly acceded to. More detailed testimony of these “requests” was\ngiven by Wee, a project manager of Winning Flag and a witness for\nthe Defendants, but the reliability of his testimony is doubtful.\nFirst, in Wee’s AEIC, it was unclear whether the requests came from\nDallan, Dallon, Madam Kok or Chan.[note: 87]Second, in Wee’s oral\ntestimony, he did not appear entirely sure about the attribution\nof instructions to Madam Kok.[note: 88]Third,\nhis recollection of almost everything which he said he was told\nto do during either the First or Second Site Show-rounds or the\nTender Interview was, according to him, based upon “impressions”\nhe had which were unconfirmed.[note: 89]Moreover,\nin the one instance where he did go into some detail explaining\nthe basis of his “impression”, which was in relation to an alleged\ninstruction by either Dallan or Dallon to replace the glass panels\nin the lift instead of re-using them, his explanation was quite\nunconvincing:[note: 90] AEr,\nthe actual wording by---I don’t remember the actual wording. Er, what\nI was given was the impression that---because I---I, er, I cannot remember\nthe actual wordings said during the tender, the second tender showround.\nBut we were given the impression because they asked something like,\n“You think you can---you think that, er, by---by shifting in, er,\nyou think that you can still reuse back or not?” That’s what they\nsay, something like that. The tonality is that, er, once it’s been\ntaken outright, it, er, cannot be reused back, what. That’s our impression.\n… 88     Similarly,\nthere was no or (for the reasons set out above) insufficient evidence\nthat the Plaintiff, Dallan or Dallon had made improper attempts\nto influence Chan or interfere with his independence. Chan may have expanded\nthe scope and specifications of the Rectification Works beyond the\nConsultants’ Reports or even after the Tender Document was finalised but\nthis in itself is not proof that the Plaintiff and/or his agents\nacted in breach of the obligation under the Settlement Agreement\nnot to interfere with Chan’s independence. I should also reiterate\nthat my finding is not that Chan acted fraudulently or in collusion\nwith the Plaintiff and/or his agents, but that he acted on a mistaken\nview as to his proper function under the Settlement Agreement.",
        "Defendants’ failure to pay and\nPlaintiff’s complaint to the PEB": "89     A\nbrief chronology of events is useful here. Chan awarded the contract\nfor the Rectification Works to Crystallite on 6 July 2012 and the letter\nof award was copied tointer aliaLow,\nwho was the Defendants’ solicitor at that time.[note: 91]In\nan e-mail dated 6 July 2012, Low wrote to Chan to inform him that\nthe Defendants had “serious reservations on the award of this contract,\nand the events leading to the award” and to reserve the Defendants’\nrights pending fuller instructions.[note: 92]The Plaintiff’s solicitor, Mr Chew,\nreplied via an e-mail dated 12 July 2012, asking for further details of\nthe Defendants’ “reservations” and informing Low that the Plaintiff would\nnot hesitate to commence legal action if the Property was not rectified\nspeedily.[note: 93]On the same date, Mr Chew sent a letter\non behalf of the Plaintiff to the Defendants demanding payment of\nthe contract sum for the Rectification Works, the balance of Chan’s\nfees, as well as rental and storage expenses which the Plaintiff\nhad proceeded to incur (having informed the Defendants of these\nexpenses via an earlier letter but apparently receiving no response\nfrom the Defendants).[note: 94]On 20 July 2012, Low wrote to\nMr Chew, setting out certain areas of concern and requesting mediation\npursuant to clause 14 of the Settlement Agreement, which stipulated\nthat any disputes arising from the agreement had to be referred first\nto the Mediator for further mediation before any legal action was commenced.[note: 95]There\nwas then some further discussion between the parties regarding the\nfurther mediation, which eventually took place before the Mediator\non 6 August 2012. The further mediation session was unsuccessful.\nOn 16 August 2012, the Plaintiff commenced the present suit and\nalso filed a complaint to the PEB. 90     The\nissue is whether the Defendants were in repudiatory breach of the Settlement\nAgreement by refusing to pay the balance of Chan’s fees and the costs\nof the Rectification Works. In the light of my decision to set aside Chan’s\naward of the contract to Crystallite on the grounds that Chan had not\nacted impartially in the discharge of his responsibilities, this\nclaim cannot succeed. As regards the balance of Chan’s fees, this\nwas to be paid on or after his completion of Tender Document at\nthe earliest[note: 96]and the preparation of that document\nwas tainted by his lack of impartiality. 91     I\nthen turn to consider the Defendants’ argument that the Plaintiff breached\na fundamental term of the Settlement Agreement by filing a complaint\nto the PEB, contrary to his obligations under clause 12 of the Settlement\nAgreement which provided as follows: 12.This settlement agreement represents a full and final settlement\nof all claims the [Plaintiff] has or may have against the [Defendants].\nThe [Plaintiff]shall not file any complaints\nwith the Professional Engineers Boardand shall forthwith\ninform the Building and Construction Authority that the matter has\nbeen resolved and another Professional Engineer will be taking over\nthe conduct of the matter. [emphasis added in bold] 92     Much\nwas made by the Defendants of the importance to them of the Plaintiff\nrefraining from making such a complaint and the fact that all the parties\nwere aware of this before and during the negotiations leading to\nthe Settlement Agreement. The Defendants alleged that the Plaintiff\nhad, in fact, used the threat of a complaint to drive a hard bargain\nduring the negotiations. However, I do not need to make a determination\non whether the obligation not to complain to the PEB was a fundamental\nterm of the contract. This is because, in my judgment, clause 12\nof the Settlement Agreement, insofar as it seeks to prohibit the\nPlaintiff from making a complaint to the PEB, is illegal and unenforceable\nbecause it allows a professional engineer to effectively contract\nout of regulatory oversight of his professional conduct by the PEB\nunder the Professional Engineers Act (Cap 253, 1992 Rev Ed) (“the\nProfessional Engineers Act”). 93     The\nDefendants’ arguments on this point were fivefold.[note: 97]First,\nthey submitted that the Plaintiff had not pleaded that clause 12\nof the Settlement Agreement was contrary to public policy. I am\nnot persuaded by this argument. The unenforceability of a particular\ncontractual term on public policy grounds cannot be dependent on\nthe pleadings of the parties. Public policy considerations are,\nby their very nature, overriding factors which the court has to\ntake into account regardless of the positions which the parties may\ntake. As Lindley LJ stated inScott v Brown,\nDoering, McNab & Co[1892] 2 QB 724 at 728: “It matters\nnot whether the defendant has pleaded the illegality or whether\nhe has not. If the evidence adduced by the plaintiff proves the\nillegality the Court ought not to assist him.” 94     The\nsecond contention of the Defendants was that there was nothing in\nthe Professional Engineers Act or the relevant subsidiary legislation\nthat compelled any person to file a complaint to the PEB under any circumstances,\nunlike in s 424 of the Criminal Procedure Code (Cap 68, 2012 Rev\nEd) (“CPC”) which imposed a duty to give information of certain offences.\nAn agreement not to make a report in relation to an offence set out\nin s 424 of the CPC would thus be unenforceable because it would\nbe an agreement to resile from a legal duty or obligation. The Defendants\nthus submitted that in the absence of any legal duty or obligation\nto report any act or offence to the authorities, an agreement not\nto report such an act or offence was enforceable. Third, the Defendants\nargued that clause 12 of the Settlement Agreement was akin to a\ncompromise by a party not to commence legal proceedings against\nanother party in exchange for adequate compensation, which was valid\nand enforceable. Fourth, the Defendants also likened the obligation\nin clause 12 to an agreement not to volunteer to give evidence,\nwhich was upheld in the English case ofBarrett v\nUniversal-Island Records Ltd & Ors[2006] EWHC 1009\n(Ch) (“Barrett”). Finally, the Defendants\nhighlighted that public policy also required that contracts freely\nentered into be upheld. 95     I\naddress the second and last points raised by the Defendants first.\nAs I understand it, the Defendants’ argument on the second point\nwas essentially that because the Professional Engineers Actallowsfor complaints to be made to the\nPEB but does notcompelcomplaints\nto be made, it would not be contrary to the said Act for parties\nto contract out of their rights to complain against a professional\nengineer to the PEB. The fallacy of this argument is clearly demonstrated\nby the well-known case ofJohnson v Moreton[1980]\nAC 37 (“Johnson v Moreton”) where\nthe House of Lords held that a particular statutory provision in\nrelation to agricultural holdings gave a tenant an option to serve\na counter-notice in response to a notice to quit served on him by\nhis landlord and that the words and policy of that statute made\nit clear that the tenant could not by agreement exclude his right\nto serve a counter-notice under that statutory provision. Simply because\nthe Professional Engineers Act does not impose a duty on persons to\nmake complaints but allows for complaints to be made is thus not conclusive;\nthe essential inquiry is parliamentary intention and the purpose of\nthe statute. As for the Defendants’ last point on freedom of contract, while\nthis general principle cannot be denied, this is not the end of\nthe inquiry. Indeed, inJohnson v Moreton,\nLord Hailsham of St Marylebone noted the maxim that a person may\nrenounce a right which exists solely for his own use or benefit\nbut that the key to the interpretation of this maxim was in determining\n“whether the particular liberty or right conferred by the statute\nor rule of law is entirely for the benefit of the person purporting\nto renounce it. If there is a public as well as a private interest\na contrary Latin maxim applies” (at 58). 96     As\nregards the remaining submissions of the Defendants, these submissions\noverlook the fact that the legislative intent of the Professional Engineers\nAct is to make an engineer accountable for his professional conduct\nnot only to his client but also to a statutory body whose functions include\nthe maintenance of standards of professional conduct and ethics\nof the engineering profession (see s 6(d)).\nThis reflects the wider public interest which is to prevent misconduct\non the part of those who hold themselves out to the public at large\nas professional engineers. 97     I\nnote that the Defendants have attempted to draw an analogy between\nclause 12 of the Settlement Agreement and contracts not to commence\nlegal proceedings or not to give evidence which have been held to\nbe valid. The examples raised by the Defendants are instances of contracts\nto stifle a prosecution or contracts that tend to oust the jurisdiction\nof the courts, and the Defendants are right to point out that the prohibition\nonly applies to contracts which adversely affect thepublicinterest; it does not affect a\ncontract in which the relevant offence or wrong is essentially a\nmatter ofprivateinterest. Hence\nthe distinction drawn between contracts stifling the prosecution\nof compoundable offences (which are not opposed to public policy)\nand contracts which pertain to non-compoundable offences (which\nare illegal and against public policy): seeAJT\nv AJU[2011] 4 SLR 739 at [20]. The rationale for this\nis that conduct which tends to undermine the wider public interest\nshould be left to the administration of the law and not to private\nindividuals. As Cotton LJ observed in the English Court of Appeal\ndecision ofWindhill Local Board of Health\nv Vint(1890) 45 Ch D 351 at 363: … [T]he court will not allow as legal any\nagreement which has the effect of withdrawing from the ordinary\ncourse of justice a prosecution when it is for an act which is an\ninjury to the public. It would be the case of persons taking into\ntheir own hands the determining what ought to be done; and that\nought not to be taken into the hands of any individuals … but ought\nto be left to the due administration of the law, and to the Judges,\nwho can determine what in the particular case ought to be done.\nI think it goes beyond saying, that in the particular case there\ncan be or cannot be any evil to the public; but you are taking the\nadministration of the law, and the object which the law has in view, out\nof the hands of the judge and putting it into the hands of a private individual.\nThat to my mind is illegal. 98     I\ndo not however think that the examples raised by the Defendants assist\nthem in the present case. Unlike the CPC which classifies certain offences\nas compoundable, there is no provision in the Professional Engineers\nAct which allows professional engineers to release or exempt themselves\nfrom disciplinary proceedings by paying compensation. In any case,\nclause 12 of the Settlement Agreement seeks to prohibit all complaints to\nthe PEB without drawing any distinction between minor and serious forms\nof misconduct. I note moreover that the complaint which the Plaintiff\nlodged to the PEB allegedinter aliathat\nKoh “[w]as both the qualified person supervising the additions and\nalterations … and the builder of the said works” and that he had\n“[d]emolished part of the pile cap without confirming the structural\nintegrity of the same”.[note: 98]These are serious allegations as they\npertain to a conflict of interest on the part of Koh in the discharge\nof his duties as a professional engineer as well as the safety of\ncertain works undertaken by him. Misconduct of this character can hardly\nbe regarded as a matter which can be excluded from oversight by\nthe PEB by an agreement between private parties. 99     It\nshould be noted that there is a difference between the situation where\na contracting party undertakes not to file a complaint in future\nand a complainant undertaking to write to a disciplinary body already\nseised of jurisdiction informing that body that he is desirous of\nwithdrawing his complaint or that the parties have amicably settled\nthe matter. The difference lies in the effect of the contractual\nundertaking on the statutory regime governing the professional’s\nconduct. In the latter situation, unless the relevant legislation\nprovides otherwise, the disciplinary proceedings already commenced\nare not affected by the subsequent withdrawal of the initial complaint:\nseeManjit Singh s/o Kirpal Singh and another\nvAttorney-General[2013]\n4 SLR 483 at [5] on similar disciplinary proceedings against solicitors\nunder the Legal Profession Act (Cap 161, 2009 Rev Ed). It will then\nbe up to the disciplinary body to determine how it will dispose\nof the matter, taking into consideration the information it has\nreceived from the complainant. Accordingly, I would have had no\ndifficulty upholding that portion of clause 12 which required the\nPlaintiff to “forthwith inform the Building and Construction Authority\nthat the matter has been resolved and another Professional Engineer\nwill be taking over the conduct of the matter”. By contrast, the\noffending portion of clause 12 of the Settlement Agreement imposes\nan unqualified prohibition on making complaints to the PEB. While\na complaint to the PEB under the Professional Engineers Act can\nbe made by persons other than the client of the professional engineer,\nit has to be borne in mind that a large proportion of instances\nof misconduct by professional engineers will only be brought to\nthe attention of the PEB through complaints from their clients.\nTo allow a professional engineer to enter into a contract with his\nclient to prohibit the client from lodging any complaint to the\nPEB would significantly curtail the extent to which the professional\naccountability envisaged by the Act can be achieved. Even if there\nwas a countervailing public policy consideration in allowing business\nto be transacted freely and in upholding commercial bargains (as was\nalluded to inBarrett), this would\nbe outweighed by the need to uphold professional accountability\nin the present situation. 100    Since\nthis part of the clause is illegal and unenforceable, it follows\nthat the Plaintiff cannot be regarded to have acted in breach of\nit. I should, however, add that my finding of illegality does not\nrender the entire Settlement Agreement void because the offending\nportion of clause 12 can be severed from the rest of the agreement.\nThis is because I do not regard the Plaintiff’s obligation in the\noffending portion as constituting the whole of his consideration\nfor the Settlement Agreement. The fact that the Plaintiff entrusted\na determination of exactly how much he would be paid for the Rectification\nWorks to an independent third party is, on its own, sufficient consideration\non his part. The failure of consideration therefore does not stand\nin the way of the doctrine of severance applying in this case. The\nrequirement that the court must be able to run a “blue pencil” through the\noffending portion without altering the meaning of or rendering senseless\nthe rest of clause 12 of the Settlement Agreement (seeMan Financial (S) Pte Ltd (formerly known as E D\n& F Man International (S) Pte Ltd) v Wong Bark Chuan David[2008]\n1 SLR(R) 663 at [127]) in order for this doctrine to apply would\nalso clearly be satisfied in this case.",
        "Damages": "101    It\nfollows that neither party can be said to be in breach of the Settlement\nAgreement, let alone in repudiatory breach of it. What has taken place\ninstead is that Chan’s award of the tender to Crystallite has been\nset aside through no fault of either party. Although the Settlement\nAgreement did not expressly provide for what would happen in this\nsituation, I cannot imagine that the parties would have contemplated\neither: (a) that the entire Settlement Agreement they had reached\nthrough mediation would simply unravel and they would be left to\npursue their original claims against each other; or (b) that the\nmatter could be remitted to the same professional engineer who had\nbeen found to have acted partially for a fresh, impartial determination.\nThe essence of the contractual bargain between the parties was that\nthe Defendants would pay the Plaintiff the reasonable costs of rectification\nworks with a neutral third party determining the scope of the rectification\nworks and the costs of such works being primarily determined by\nthe tender process carried out by that neutral third party. If the\nparties had, at the time of the negotiations, applied their mind\nto the present scenario, they would in all likelihood have said,\n“he must be replaced” and a replacement professional engineer appointed\nin a similar manner. I therefore find that there would have been\nan implied term in the Settlement Agreement to that effect. 102    I\nshould add that even if I were wrong about there being such an implied\nterm in the Settlement Agreement, the court does have the power substitute\nalternative machinery for the contractual machinery in appropriate\ncases (see [80]supra). InMacro v Thompson(see [58]supra), Walker J accepted that in that\ncase the circumstances justified an order for new valuations done\nby a different expert, although he cautioned that this was not a\ngeneral rule (at 69): … The decision of the House of Lords inSudbrook Trading Estate Ltd v Eggleton[1982]\n3 All ER 1, [1983] 1 AC 444 establishes or clarifies the principle\nthat where contractual machinery for the ascertainment of value\nis frustrated, the court has jurisdiction to resolve the difficulty\nby prescribing alternative machinery,provided\nthat the contractual machinery(for instance, the nomination\nof a single expert valuer)was not an essential\nand indispensable part of the contractual bargain. …\nIn this case, therefore, without laying down any general rule, I\nconclude that the court can and should provide alternative machinery.\n[emphasis added in bold] 103    The\nproviso above that the contractual machinery must not be an essential\nor indispensable part of the contractual bargain does not, in my judgment,\napply to prevent the court from substituting alternative machinery\nin the present case. As I have indicated at [101] above, the contractual\nbargain in this case was that the Defendants would pay the Plaintiffs\nthe reasonable costs of rectification works, the scope and costs\nof which would be determined by a neutral professional engineer\nand a tender process undertaken by him. It was not important to\nthe parties that Chan in particular had to be appointed as the professional\nengineer. This was not like the case where, for example, the agreement\nwas to sell at a price fixed by a valuer who was named, or who,\nby reason of holding some office such as the auditor of a company\nwhose shares were to be valued, would have special knowledge relevant\nto the question of value, in which case the prescribed machinery\nmay well be regarded as essential:Sudbrook\nTrading Estate Ltd v Eggleton[1983] 1 AC 444 at 483–484.\nRather, what was important to the parties in this case was simply\nthat the professional engineer be neutral and qualified for the\ntask. There is thus no reason why another professional engineer\nshould not be appointed in the proper manner to undertake the relevant\ntasks under the Settlement Agreement. 104    The\nonly gaps which need to be filled are the deadlines for the appointment\nof the replacement professional engineer and for the work to be\ncarried out by him upon his appointment. In this vein, I note that\nthe Settlement Agreement envisaged short timelines. I therefore\ndirect as follows: (a)     The\nparties shall, within one week of the date of this judgment submit\nthree names to the Mediator, who shall thereafter appoint the Professional\nEngineer from among the names submitted to him within a further\none week thereafter. If the Mediator fails to appoint a Professional\nEngineer by then, either party is at liberty to apply to the court\nto make the appointment. (b)     The\nappointed Professional Engineer shall act in accordance with clauses\n6–10 of the Settlement Agreement, save that the joint site visit\nreferred to in clause 6 shall be undertaken within one week of his appointment\nby the Mediator or the court and the scope and specifications of\nthe rectification works to be prepared pursuant to clause 6 is to\nbe set out within one week of the said site visit. 105    The\nDefendants are under an obligation to pay to the Plaintiff the costs\nset out in clause 11 of the Settlement Agreement resulting from\nthis new appointment with the following qualifications: (a)     The\npayment of $20,000 as compensation for moving and costs need not\nbe paid as the Defendants have already paid this sum; and (b)     As\nfor the fees of the replacement professional engineer which the\nDefendants have to pay to the Plaintiff, credit is to be given for\nthe $11,260 which had been paid earlier by them as the first instalment\nof Chan’s fees. From the documents, it is clear that the contract\nof appointment of Chan as the professional engineer pursuant to\nwhich his fees were payable was one to which only the Plaintiff\nand Chan were parties and to which the Defendants were strangers.\nIt will thus be for the Plaintiff to claim such refund from Chan\nof the fees which have been paid by the Defendants on the Plaintiff’s\nbehalf although I express no view as to the extent of his legal\nentitlement to do so; (c)     For\nthe avoidance of doubt, the “duration of the Rectification Works”\nin clause 11(c) of the Settlement Agreement is to be regarded as\nreferring to the duration of the Rectification Works as determined by\nthe replacement professional engineer. The Plaintiff cannot claim against\nthe Defendants for the rental and storage costs which he has already\nincurred given that these were referable to the duration of the work\nto be done pursuant to the tender award which I have set aside. As\nto whether the Plaintiff may claim these costs from Chan under the contract\nbetween them, this is not an issue which is before me in the present\ncase. These observations also apply with respect to any liability\nincurred by the Plaintiff pursuant to the contract which Chan awarded\nto Crystallite.[note: 99]",
        "Alleged conspiracy between Chan\nand the Plaintiff": "106    While\nthe Defendants initially pleaded both lawful and unlawful conspiracy,\nonly unlawful conspiracy was pursued in their written submissions.\nThe alleged unlawful means was the Plaintiff’s breach of the Settlement\nAgreement. 107    The\nDefendants’ claim on conspiracy failsin liminesince\nI have found that there was no evidence of collusion on the part\nof Chan and the Plaintiff and/or his agents.",
        "The Defendants’ counterclaims": "108    To\nrecapitulate, the First Defendant counterclaimed the sum of $35,260\nfrom the Plaintiff comprising: $20,000 paid to the Plaintiff as compensation\nfor moving and costs under the Settlement Agreement; $11,260 being\nthe first instalment of Chan’s fees; and $4,000 being the outstanding\nprofessional fees due in relation to the Additional Works. The Second\nDefendant counterclaimed the total sum of $146,215.50 (including GST)\nfor the Additional Works, as well as damages to be assessed in relation\nto the Plaintiff’s complaint to the PEB. 109    In\nthe light of my earlier findings, it is clear that the only items\nin the Defendants’ counterclaims that remain to be considered relate\nto the Additional Works. 110    The\nDefendants’ case was that the Additional Works had taken place between\nJuly 2010 and April 2011. There were no quotations, invoices or other\ndocumentation for the Additional Works, which Mui Ling said were undertaken\nbased on trust between the parties.[note: 100]Nevertheless,\nthe Defendants submitted that the Second Defendant had clearly mentioned\nits intention to claim for the costs of these Additional Works in\nthe Defendants’ summary of facts which was submitted prior to and\nfor the purpose of the mediation.[note: 101] 111    I\nfind that the Defendants are not entitled to their counterclaims\nin respect of the Additional Works. It was expressly stated in the\nSettlement Agreement that “[t]he Parties wish to enter into this\nSettlement Agreement to achieve a full, final and complete settlement\nof all claims, issues and/or disputes (actual or potential, present\nor future) among them in respect of the Contract”, the “Contract”\nbeing the contract for the A&A Works.[note: 102]The\nDefendants’ counterclaim would have been part of the claims which were\nthe subject of the compromise under the Settlement Agreement. The reference\nto them in the Defendants’ summary of facts puts beyond doubt the\nfact that the Additional Works were covered by the mediation and\nthe Settlement Agreement. The parties had, in my judgment, agreed\nthat all claims or disputes would be superseded by the Settlement\nAgreement which would now encompass the parties’ entire agreement\nas to matters arising out of the A&A Works.",
        "Conclusion": "112    While\nthe Plaintiff did not succeed in any of his claims, the Defendants\nonly succeeded in their claim to set aside the award of the contract\nto Crystallite by Chan. However, a significant part of the proceedings\nconcerned the evidence pertaining to this issue. In the circumstances,\nI order the Plaintiff to pay to the Defendants half of the Defendants’\ncosts, to be agreed or taxed.  [note: 1]ABD 7–8. [note: 2]ABD 14–16. [note: 3]ABD\n17; Transcript of Evidence dated 20 November 2013 at p 35. [note: 4]ABD\n31–168. [note: 5]ABD 169–275. [note: 6]ABD\n278–286. [note: 7]ABD\n276–277. [note: 8]ABD 320. [note: 9]ABD 313. [note: 10]ABD\n330–331. [note: 11]ABD\n332. [note: 12]ABD\n341, 343. [note: 13]Transcript of Evidence\ndated 14 November 2013 at p 94; DW1 AEIC at para 54. [note: 14]ABD 345–348. [note: 15]ABD 349–351; PW5 AEIC\nat para 31. [note: 16]ABD 373-413. [note: 17]ABD 428–430, 434. [note: 18]ABD 604. [note: 19]PW5\nAEIC at para 109; DW3 AEIC at para 11. [note: 20]ABD\n665–669. [note: 21]ABD 753–754. [note: 22]BOP\n8–9 (Writ of Summons at paras 15–17). [note: 23]Transcript\nof Evidence dated 26 September 2013 at p 24. [note: 24]Transcript\nof Evidence dated 26 September 2013 at pp 24–25, 27–28. [note: 25]BOP\n147 (Defence and Counterclaim (Amendment No. 3) at para 26). [note: 26]BOP\n139 (Defence and Counterclaim (Amendment No. 3) at para 10). [note: 27]Transcript\nof Evidence dated 20 September 2013 at pp 19–20, 30–31. [note: 28]Transcript\nof Evidence dated 14 November 2013 at pp 54–56. [note: 29]Transcript\nof Evidence dated 20 November 2013 at p 48. [note: 30]Transcript\nof Evidence dated 20 November 2013 at pp 56, 67. [note: 31]Defendants’ Closing\nSubmissions dated 13 December 2013 at para 137; Plaintiff’s Reply\nSubmissions dated 27 December 2013 at para 117. [note: 32]ABD 318–319. [note: 33]ABD\n323–324. [note: 34]Defendants’\nClosing Submissions dated 13 December 2013 at paras 178–179. [note: 35]Defendants’\nClosing Submissions dated 13 December 2013 at para 138. [note: 36]ABD 313. [note: 37]ABD\n325–327. [note: 38]PW5 AEIC at para 18;\nTranscript of Evidence dated 14 November 2013 at pp 101–102. [note: 39]Defendants’\nClosing Submissions dated 13 December 2013 at paras 149–160. [note: 40]Defendants’\nClosing Submissions dated 13 December 2013 at paras 161–163. [note: 41]Defendants’\nClosing Submissions dated 13 December 2013 at paras 164–167. [note: 42]Defendants’\nClosing Submissions dated 13 December 2013 at paras 168–171. [note: 43]Plaintiff’s\nClosing Submissions dated 13 December 2013 at para 66. [note: 44]Defendants’ Closing\nSubmissions dated 13 December 2013 at para 149; Defendants’ Reply\nSubmissions dated 27 December 2013 at para 10–11. [note: 45]Defendants’\nClosing Submissions dated 13 December 2013 at para 153; Defendants’\nReply Submissions dated 27 December 2013 at para 12. [note: 46]Plaintiff’s\nReply Submissions dated 27 December 2013 at paras 129–130. [note: 47]ABD 313. [note: 48]ABD\n278–286, 291–302; Transcript of Evidence dated 24 September 2013\nat p 19. [note: 49]Transcript of Evidence\ndated 21 November 2013 at p 58. [note: 50]Transcript\nof Evidence dated 28 November 2013 at pp 60–61. [note: 51]Defendants’\nClosing Submissions dated 13 December 2013 at para 162. [note: 52]Plaintiff’s\nReply Submissions dated 27 December 2013 at paras 18–19, 21. [note: 53]Defendants’ Closing\nSubmissions dated 13 December 2013 at para 144; Plaintiff’s Reply\nSubmissions dated 27 December 2013 at para 117. [note: 54]Defendants’ Closing\nSubmissions dated 13 December 2013 at paras 172–173. [note: 55]Defendants’ Closing\nSubmissions dated 13 December 2013 at paras 174, 176. [note: 56]Defendants’\nClosing Submissions dated 13 December 2013 at paras 193–197. [note: 57]Defendants’\nClosing Submissions dated 13 December 2013 at para 198. [note: 58]Transcript\nof Evidence dated 26 November 2013 at pp 4–5; Transcript of Evidence\ndated 28 November 2013 at pp 80–81. [note: 59]Transcript of Evidence\ndated 28 November 2013 at p 82. [note: 60]DW6 AEIC at paras 6–11. [note: 61]Transcript\nof Evidence dated 28 November 2013 at p 87. [note: 62]Transcript\nof Evidence dated 14 November 2013 at p 93. [note: 63]Transcript\nof Evidence dated 14 November 2013 at p 52. [note: 64]Defendants’\nClosing Submissions dated 13 December 2013 at para 195; Transcript\nof Evidence dated 14 November 2013 at pp 56–57. [note: 65]ABD\n325–326. [note: 66]ABD 325–327. [note: 67]PW5\nAEIC at paras 45, 78.5, 93.4, 110.2, 122.6. [note: 68]PW5 AEIC at para 45. [note: 69]PW5\nAEIC at para 110.2. [note: 70]Transcript of Evidence\ndated 15 November 2013 at pp 7–9. [note: 71]ABD\n389; Transcript of Evidence dated 19 November 2013 at p 67. [note: 72]PW5 AEIC at paras 112–113. [note: 73]Transcript of Evidence\ndated 15 November 2013 at pp 13–14, 32–34. [note: 74]PW5\nAEIC at paras 91, 93; Transcript of Evidence dated 15 November 2013 at\npp 76–77. [note: 75]Transcript\nof Evidence dated 15 November 2013 at p 76. [note: 76]Transcript of Evidence\ndated 15 November 2013 at p 111. [note: 77]Transcript of Evidence\ndated 18 November 2013 at p 12. [note: 78]Transcript\nof Evidence dated 19 November 2013 at p 55. [note: 79]Transcript\nof Evidence dated 14 November 2013 at p 114. [note: 80]Transcript\nof Evidence dated 14 November 2013 at p 84. [note: 81]Transcript of Evidence\ndated 18 November 2013 at pp 60–61. [note: 82]Transcript of Evidence\ndated 19 November 2013 at p 58. [note: 83]Plaintiff’s\nClosing Submissions dated 13 December 2013 at para 145. [note: 84]PW5\nAEIC at paras 77, 112–114; Transcript of Evidence dated 18 November 2013\nat p 23. [note: 85]PW5\nAEIC at para 91; DW1 AEIC at paras 79–83. [note: 86]PW5\nAEIC at paras 112–114. [note: 87]DW3\nAEIC at paras 38–39. [note: 88]Transcript\nof Evidence dated 27 November 2013 at pp 147–148. [note: 89]Transcript\nof Evidence dated 27 November 2013 at pp 129–132. [note: 90]Transcript\nof Evidence dated 27 November 2013 at p 130. [note: 91]ABD 665–669. [note: 92]ABD\n670. [note: 93]ABD\n678. [note: 94]ABD\n679–681. [note: 95]ABD 694–695. [note: 96]ABD\n331. [note: 97]Defendants’ Further\nSubmissions dated 23 January 2014. [note: 98]ABD\n756. [note: 99]Plaintiff’s\nReply Submissions dated 27 December 2013 at paras 204–205. [note: 100]Transcript\nof Evidence dated 28 November 2013 at pp 28–29. [note: 101]Defendants’\nReply Submissions dated 27 December 2013 at para 110; ABD 307–308. [note: 102]ABD 312."
    }
}