{
    "case_title": "Ang Pek San Lawrence\n      v\n      Singapore Medical Council",
    "ncitation": "[2014] SGHC 241",
    "coram": "Sundaresh Menon CJ; \n      Andrew Phang Boon Leong JA; \n      Judith Prakash J",
    "sections": {
        "Introduction": "1       This is an appeal by Dr Ang Pek San Lawrence (“the appellant”) against the decision of a Disciplinary Committee (“the DC”) constituted by the Singapore Medical Council (“the respondent”). The DC convicted the appellant of professional misconduct under s 45 of the Medical Registration Act (Cap 174, 2004 Rev Ed) (“the Medical Registration Act”) for his failure to make arrangements to ensure that a neonatologist would be present at or placed on standby for the delivery of a patient’s baby on 23 September 2009 despite the fact that there were certain clinical indicators which, in the DC’s view, suggested the need for such arrangements to be made. The DC’s orders included one that suspended the appellant from practice for three months. In this appeal, the appellant seeks to set aside his conviction; in the alternative, he seeks to set aside or reduce the period of suspension from practice as well as the costs ordered against him. For the purposes of this appeal, the applicable version of the Medical Registration Act is that which was in force as at 23 September 2009 (the date of the incident complained of), and we shall hereafter refer to that version of the Medical Registration Act as “the MRA”.",
        "Background facts": "2       The appellant is a registered medical practitioner and a registered obstetrician and gynaecologist. A complaint was brought by a patient of the appellant (“the complainant”) in respect of his management of her labour and the delivery of her second child on 23 September 2009. 3       The appellant had managed the complainant’s first pregnancy in 2007. The baby on that occasion had been delivered pursuant to an emergency Caesarean section operation. There were no other complications. The complainant returned to the appellant when she became pregnant with her second child, requesting that he manage her second pregnancy. She wished to have a natural delivery for this second delivery. This is referred to as a vaginal birth after Caesarean (“VBAC”) procedure. The appellant discussed the risks of the procedure with the complainant and offered her a delivery by Caesarean section instead. However, the complainant was firm in her wish to proceed with the attempted VBAC procedure. 4       The complainant went into labour on 23 September 2009 and was admitted to Thomson Medical Centre at 2.38pm. The appellant attended to the complainant and performed an amniotomy at around 3.40pm. The amniotomy revealed moderate meconium-stained liquor. The appellant again offered the complainant a delivery by Caesarean section, but the complainant maintained her wish for a VBAC procedure. 5       The appellant left Thomson Medical Centre at around 4.00pm and attended to some other patients. At 6.30pm, one of the ward nurses contacted the appellant and updated him on the complainant’s condition. Specifically, the appellant was informed that the cardiotocography (“CTG”) trace of the baseline foetal heart rate was around 160bpm to 165bpm, and that the complainant had a temperature of 37.3°C. Between 6.30pm and 8.15pm, the CTG trace showed an increase in the baseline foetal heart rate to 165bpm, but this was not specifically communicated to the appellant during that period. 6       The events that took place between 8.15pm and just after 9.03pm, when the complainant’s baby was delivered, are of particular significance in this appeal for reasons that will become evident. From the record of proceedings and the DC’s written decision dated 22 November 2013 (“the GD”), we set out below the relevant chronology and the accompanying clinical indicators: (a)     After 8.15pm, the CTG trace of the baseline foetal heart rate increased to more than 180bpm. (b)     The appellant returned to Thomson Medical Centre at about 8.15pm. (c)     The appellant could not immediately attend to the complainant as he had a patient in the next delivery room. (d)     The appellant was updated on the complainant’s condition while he was attending to the other patient. (e)     At about 8.30pm, the appellant attended to the complainant. At that time, the complainant’s temperature had risen to 37.8°C and the CTG trace of the baseline foetal heart rate remained above 180bpm. (f)     The appellant ordered that intravenous antibiotics be administered to the complainant at around 8.30pm. (g)     He then attended to his other patient and delivered her baby at about 8.43pm. (h)     At that time, the appellant requested that Dr Keoy Soo Hin (“Dr Keoy”), a neonatologist, be called to attend to the baby he had just delivered. The appellant was not aware then that Dr Keoy was unavailable and that the latter had made arrangements for Dr Adeline Wong (“Dr Wong”), a paediatrician, to cover his cases. (i)     After 8.40pm, the CTG trace of the baseline foetal heart rate of the complainant’s baby reached nearly 220bpm, this being the maximum heart rate that a CTG trace was capable of measuring. (j)     The appellant returned to attend to the complainant and made the decision to commence the delivery of the complainant’s baby at about 8.50pm as the complainant was fully dilated. (k)     The appellant annotated “NRFS” for non-reassuring foetal status in the delivery notes before commencing the delivery. (l)     The complainant’s baby was successfully delivered at 9.03pm with the assistance of forceps. (m)     From the time the appellant commenced the delivery until the time the complainant’s baby was delivered, the appellant did not ask for a neonatologist to be present. In his testimony, the appellant said that it had slipped his mind to specifically ask that a neonatologist be present at the delivery suite. However, he also explained that he was conscious of the fact that he had requested that Dr Keoy be called to attend to the baby in the next delivery room, and he thought that this would be the quickest and, in the circumstances, a suitable way to ensure that the complainant’s baby received the appropriate specialist care at the earliest opportunity. (n)     Shortly after the delivery, the complainant’s baby cried once and then stopped crying. Dr Wong, who was then in the adjoining delivery room, was called by a nurse to attend to the complainant’s baby. She did so within one to two minutes of the delivery and successfully resuscitated the baby. 7       In the event, and most unfortunately, the complainant’s baby developed congenital E. coli septicaemia and congenital pneumonia, and required emergency care. The baby was initially warded at Thomson Medical Centre, and was subsequently transferred to KK Women’s and Children’s Hospital. He was hospitalised for about five months. It must be noted that based on the evidence, the baby’s condition was causally unconnected to anything which the appellant had done or had omitted to do. 8       The complainant filed a complaint against the appellant. The complaint was reviewed by the respondent’s Complaints Committee, which dismissed the complaint and concluded that a formal inquiry was not required. The Complaints Committee, after considering “all the circumstances of the complaint and the information submitted”, including the expert opinion of Prof Sir S Arulkumaran (“Prof Arulkumaran”), Head of Obstetrics and Gynaecology at St George’s Hospital, London, concluded (among other things) that:[note: 1] (a)     the poor outcome of the baby’s birth and the baby’s eventual diagnosis were unrelated to the appellant’s management of the complainant’s pregnancy; (b)     the fact that the baby had passed moderate meconium-stained liquor did not warrant changing the delivery management plan by embarking on an emergency Caesarean section operation; (c)     the actions taken by the appellant based on the clinical indicators and the CTG trace were appropriate; and (d)     it was not necessary to have a neonatologist placed on standby in the circumstances. 9       The Complaints Committee did, however, advise the appellant to communicate better with his patients. 10     The complainant appealed to the Minister for Health for a formal inquiry to be conducted. This eventually led to the DC issuing a notice of inquiry to the appellant to answer four charges, although it is not known on what grounds the complainant’s appeal was acceded to. The four charges against the appellant were as follows: (a)     The first charge (“the First Charge”) alleged the gross mismanagement of the complainant, in that the appellant failed to carry out a proper assessment of her within a reasonable time during her labour. (b)     The second charge (“the Second Charge”) alleged that the appellant failed to inform the complainant of and/or failed to sufficiently explain to her the possible risks and clinical indicators associated with the meconium-stained liquor revealed during the amniotomy, and thereby failed to provide adequate information for the complainant to make informed choices about her further medical management. (c)     The third charge (“the Third Charge”) alleged that the appellant failed to act in the best interests of the complainant by failing to arrange for another obstetrician to take over the management of the complainant “when [he was] not available to do so”. (d)     The fourth charge (“the Fourth Charge”) alleged that the appellant failed to act in the best interests of the complainant by failing to arrange for a neonatologist to be present at or placed on standby for the delivery of the complainant’s baby despite the presence of meconium-stained liquor accompanied by suspected foetal compromise. The appellant contested all four charges. 11     The following experts were called to give evidence at the inquiry: (a)     Dr Annapoorna Venkat (“Dr Venkat”), the respondent’s obstetrics and gynaecology (“O&G”) expert; (b)     Prof Ho Lai Yun (“Prof Ho”), the respondent’s neonatology expert; (c)     Assoc Prof Mary Rauff (“Assoc Prof Rauff”), the appellant’s O&G expert; (d)     Prof Arulkumaran, the appellant’s O&G expert; (e)     Assoc Prof John Tee (“Assoc Prof Tee”), the appellant’s O&G expert; (f)     Assoc Prof Lee Jiun (“Assoc Prof Lee”), the appellant’s neonatology expert; and (g)     Dr Low Kah Tzay (“Dr Low”), the appellant’s paediatrics expert.",
        "The DC’s decision": "12     The DC issued its written decision in the GD on 22 November 2013. It dismissed the first three charges, but convicted the appellant of the Fourth Charge. 13     Before we turn to the DC’s treatment of the Fourth Charge, it would be useful to briefly note the carefully reasoned basis upon which the DC dismissed the first three charges. 14     As noted above, the First Charge alleged a failure to “carry out a proper assessment of the [complainant] within a reasonable time during her labour”. This charge was vague, to say the least, but some particulars then set out the following material averments: (a)     the complainant had opted for a VBAC procedure; (b)     the complainant went into labour; (c)     an amniotomy carried out at around 3.40pm revealed meconium-stained liquor, a known complication usually associated with foetal distress; (d)     the appellant left the ward at around 4.00pm and only returned at around 8.30pm; and (e)     during the intervening period, the CTG trace revealed tachycardia (ie, an elevated or accelerated heart rate), “periods of reduced variability” and a baseline foetal heart rate of around 160bpm to 165bpm. 15     There was a conspicuous absence in the First Charge of any averment of what a “proper assessment of the [complainant]”, which the appellant had allegedly failed to carry out, would have entailed. The DC dismissed the First Charge, noting that what the appellant had done – namely, monitoring the complainant’s labour through the ward nurses – was not inconsistent with the standard of management that was called for in the circumstances that prevailed until 6.30pm. Moreover, the appellant had advised the complainant to abandon the VBAC procedure, but she had refused. The DC held that while the complainant’s slight fever of 37.3°C and the CTG trace of a baseline foetal heart rate of around 160bpm to 165bpm had been conveyed to the appellant, it was reasonable for him to conclude that these clinical indicators stemmed from the administration of the epidural anaesthesia. In addition, with regard to the CTG trace, the DC accepted the experts’ view that the baseline foetal heart rate of around 160bpm to 165bpm did not indicate that the complainant’s baby was hypoxic. (Hypoxia refers to the state of being deprived of adequate oxygenation.) The DC thought the appellant “could have done better” by returning to personally check on the complainant, but was satisfied that his failure to do so did not amount to professional misconduct. 16     Turning to the Second Charge, the crux of this charge was an alleged failure on the part of the appellant to inform the complainant of and/or sufficiently explain to her the potential risks associated with the moderate meconium-stained liquor found during the amniotomy done at around 3.40pm. Aside from this, the other relevant particulars were similar to those set out for the First Charge. 17     The DC dismissed the Second Charge, noting that there were two types of risk at play. The first and more direct one primarily concerned the complainant and her intention to undertake a VBAC procedure. It was not disputed that this particular risk had been adequately explained to the complainant, who had nonetheless chosen to proceed with her preferred course of action. The second pertained to the risk of the baby contracting Meconium Aspiration Syndrome or “MAS”. The DC noted that the discovery of moderate meconium-stained liquor was not relevant to the first risk, but could possibly be relevant to the second risk, although that was a low risk. The DC concluded that in all the circumstances, there was no need to alter the plan for the management of the complainant, and therefore, there was no basis to find professional misconduct. It should be noted that the evidence in this case indicated that: (a)     the complainant’s baby never contracted MAS; (b)     the appellant did advise the complainant to consider delivery by Caesarean section after the amniotomy was performed, but she declined; and (c)     the clinical indicators available from the CTG trace up to 6.30pm did not suggest that the baby was in distress on account of the presence of moderate meconium-stained liquor. 18     In these circumstances, the DC was undoubtedly correct in dismissing the Second Charge, even though the appellant might fairly have been counselled to improve his communications with his patients since, as he accepted, he did not specifically draw the complainant’s attention to the low risk of MAS after the amniotomy was performed. 19     The Third Charge was directed at the appellant’s failure to arrange for another obstetrician to take over the management of the complainant when he himself was “not available to do so”. The only material particular furnished aside from those already mentioned was that the appellant should have attended to the complainant no later than 6.30pm. 20     The DC dismissed this charge, noting that it had earlier found that: (a) there was no reason to change the management plan of the complainant as late as 6.30pm; (b) the nurses were monitoring the complainant sufficiently; and (c) the appellant planned to be back at around 8.00pm. The DC thus found that the conduct complained of in the Third Charge did not amount to professional misconduct. 21     Against that background, we turn to the Fourth Charge, which reads as follows: That you,DR ANG PEK SAN LAWRENCE, are charged that on 23 September 2009, you failed to act in the best interests of your patient, [the complainant], and her foetus, in that you did not arrange for a neonatologist to be present at or to be put on standby for the [complainant’s] delivery despite the presence of meconium-stained liquor accompanied by suspected foetal compromise. PARTICULARS a.    On 23 September 2009, the [complainant] went into labour. b.    At around 3.40pm, you carried out an amniotomy on the [complainant], which revealed meconium-stained liquor. c.    Meconium aspiration syndrome is a known complication associated with meconium-stained liquor, which is usually related to foetal distress. d.    From around 5.40pm to around 9.00pm, the CTG revealed non-reassuring foetal heart rate patterns such as foetal tachycardia and reduced variability. e.    The [complainant’s] delivery commenced at about 8.50pm. f.    At all material times, you did not arrange for a neonatologist to be present at or to be on standby for the [complainant’s] delivery. g.    Given the development of the [complainant’s] and [the] foetus’ medical condition from particulars (b) to (d) above (“Medical Condition”), there were potential risks and complications that [might] arise during the [complainant’s] delivery. and that in relation to the facts alleged you have been guilty of professional misconduct under section 45(1)(d) of the Medical Registration Act (Cap. 174) (2004 Rev. Ed.). [underlining and emphasis in bold in original] 22     The Fourth Charge consists of one central averment, namely, that the appellant failed to arrange for a neonatologist to be present at or placed on standby for the delivery of the complainant’s baby. This duty was said to rest on two specific grounds, namely, “the presence of meconium-stained liquor accompanied by suspected foetal compromise”. These grounds were elaborated upon in the particulars in paras (b) to (d) of the Fourth Charge, of which the material particulars were those in para (d) concerning the CTG trace between around 5.40pm and around 9.00pm, which “revealed non-reassuring foetal heart rate patterns”. The particulars in paras (b) and (c), which pertained to the presence of meconium-stained liquor, did not and could not in themselves have added very much since the DC had found, in dismissing the Second Charge, that the risk of the complainant’s baby contracting MAS was low and there was no need to change the delivery management plan as at 6.30pm. Of course, the presence of meconium-stained liquor remained relevant in that the appellant should have been conscious of it, but this factor evidently did not trigger any duty on the appellant’s part, up to the time he returned to Thomson Medical Centre at around 8.15pm, to arrange for a neonatologist to be present at or placed on standby for the delivery of the baby. 23     In keeping with this, the DC noted that at the time of the incident, there was some divergence in the guidelines of the relevant institutions as well as in medical publications as to whether a neonatologist ought to be present or placed on standby in cases where there was moderate meconium-stained liquor. The DC held that in the absence of clear guidelines, a medical practitioner in the appellant’s shoes ought to have taken into account all the relevant considerations and then managed the patient in accordance with good clinical practice to achieve the best outcome. 24     The DC noted that for the purposes of the Fourth Charge, there was no distinction between a paediatrician trained in neonatal resuscitation and a neonatologist as either would have been capable of resuscitating a newborn baby (the term “paediatrician” as used hereafter in this judgment should be understood in this context). The DC concluded that in all the circumstances, and based on the presence of a number of clinical indicators, a neonatologist ought to have been standing by or present at the time of the delivery of the complainant’s baby. 25     The clinical indicators which the DC considered material were as follows. First, the CTG trace showed an increase in the baseline foetal heart rate to 165bpm between 6.30pm and 8.15pm, then to more than 180bpm after 8.15pm, and to nearly 220bpm after 8.40pm. The DC placed some reliance on what it thought was the view of one of the appellant’s experts, Assoc Prof Rauff, who said that she would have required a neonatologist to be present or placed on standby when the baseline foetal heart rate exceeded 180bpm at about 8.30pm. 26     Second, there was the presence of moderate meconium-stained liquor. The DC mentioned this, although it did not explain what this pointed to, and merely stated that it was a factor that should have been taken into account. 27     Third, the appellant had written “NRFS” on the delivery notes. It should be noted that based on the evidence, and as stated above at [6(k)], this was done immediately before the appellant commenced the delivery of the complainant’s baby at about 8.50pm. Taken together, the DC considered that these were indicators of a “high-risk delivery” which required a neonatologist to be called. 28     The DC also considered the appellant’s actions, noting that he had been away from the complainant for 4 hr 15 min from around 4.00pm and only returned to Thomson Medical Centre at around 8.15pm. His attention immediately after his return was diverted to another patient, and he could only assess the complainant at about 8.30pm. By that time, the complainant had a fever of 37.8°C. Furthermore, as the appellant was conducting an instrument-assisted delivery, this made it, in the DC’s view, all the more pressing for either a paediatrician or a neonatologist to be present at or standing by for the delivery. 29     Lastly, the DC noted that the complainant’s baby was in distress after the delivery and required resuscitation. In the DC’s view, the fact that Dr Wong was in the adjoining delivery suite and was called upon to perform the resuscitation was a purely “fortuitous” intervention. The DC also considered it unsatisfactory that the appellant was confused as to whether it was Dr Wong or Dr Keoy who would be attending to the complainant’s baby. The appellant, the DC held, should have allowed for time to brief Dr Wong on the complainant’s situation. The DC noted that the appellant had relied on the proximate presence of Dr Wong in the adjoining delivery room and considered that insufficient. Rather, it held, a neonatologist ought to have been in the delivery room “ready to resuscitate the baby upon delivery, because in a delivery like the present case, the need for resuscitation was beyond a mere possibility” (at [38] of the GD). 30     The DC accordingly found the appellant guilty of the Fourth Charge on the grounds that he ought to have appreciated the necessity for a neonatologist to be present at or placed on standby for the delivery of the complainant’s baby. The appellant’s failure to ensure that a neonatologist was present or placed on standby amounted, in the DC’s view, to professional misconduct. After considering various factors, the DC held that the appropriate sanctions were a three-month suspension from practice, a censure and a written undertaking by the appellant not to engage in the conduct complained of or any similar conduct. The DC also ordered the appellant to pay 60% of the costs of the proceedings, including the costs of the respondent’s counsel and the legal assessor, as well as 75% of the disbursements. 31     The appellant appealed against his conviction as well as the orders relating to his suspension from practice and costs. We deal with the appellant’s conviction first.",
        "The appeal against conviction": "32     Under s 46(8) of the MRA, the High Court shall accept as final and conclusive any finding of a Disciplinary Committee relating to any issue of medical ethics or standards of professional conduct, unless such finding is, in the opinion of the High Court, “unsafe, unreasonable or contrary to the evidence”. As explained inLow Cze Hong v Singapore Medical Council[2008] 3 SLR(R) 612 (“Low Cze Hong”) at [39]–[40], this requires the High Court to make the following findings before it can intervene: (a)     there is something clearly wrong either: (i)       in the conduct of the disciplinary proceedings; and/or (ii)       in the legal principles applied; and/or (b)     the findings of the Disciplinary Committee are sufficiently out of tune with the evidence to indicate with reasonable certainty that the evidence has been misread. 33     Furthermore, in the area of assessing expert evidence, as the Disciplinary Committee is “a specialist tribunal with its own professional expertise and understands what the medical profession expects of its members”, the High Court should be slow to overturn the Disciplinary Committee’s findings (seeGobinathan Devathasan v Singapore Medical Council[2010] 2 SLR 926 (“Gobinathan”) at [29]). However, the High Court should not give undue deference to the views of the Disciplinary Committee and thereby render its own powers nugatory (seeLow Cze Hong at [42]). 34Having considered the record of proceedings and the submissions that were made, we are satisfied that the conviction of the appellant on the Fourth Charge is unsafe, unreasonable and contrary to the evidence as the DC: (a)failed to determine the requisite standard of conduct to which the appellant was to be held or from which his departure could be considered sufficiently serious to amount to professional misconduct; (b)failed to explain its reasons for preferring certain medical opinions over others in the face of conflicting medical opinions on key issues; (c)took into account facts that went beyond the ambit of the Fourth Charge; and (d)made at least two factual findings that were contrary to the evidence. 35We elaborate on each of these grounds below.",
        "The requisite standard of conduct": "36     After the DC’s analysis of the four charges, the DC stated the following conclusion on the appellant’s conduct before proceeding to consider the appropriate sentence (at [39] of the GD): 39.    We would add that in the course of our deliberations, we had received legal advice on the meaning of the term “professional misconduct” and its relation to negligent acts. We had read various extracts from the case ofLow Cze Hong v Singapore Medical Council[2008] 3 SLR(R) 0612 andGan Keng Seng Eric v Singapore Medical Council[2011] 1 SLR 0745 in respect of the relevant thresholds. It is our view that in the circumstances, the [appellant] ought to have appreciated the necessity for a neonatologist, and his failure to ensure the attendance of a neonatologist, or to put one on standby to assist him amounted to professional misconduct. We accordingly find him guilty of the Fourth Charge and invite his Counsel to address us in mitigation. 37     The decision of this court inLow Cze Hongis significant because after a careful survey of the authorities, this court laid down the following criteria for assessing whether there has been professional misconduct by a medical practitioner (at [37]): In summary ... professional misconduct can be made out in at least two situations: first, where there is an intentional, deliberate departure from standards observed or approved by members of the profession of good repute and competency; and second, where there has been such serious negligence that it objectively portrays an abuse of the privileges which accompany registration as a medical practitioner ... 38     We pause to reiterate our observations inLee Kim Kwong v Singapore Medical Council[2014] 4 SLR 113 (“Lee Kim Kwong”) at [42]–[43] on the importance of drawing a distinction between the two limbs of professional misconduct delineated inLow Cze Hong: 42    … [W]e think that a distinction ought always to be drawn in individual cases between the two limbs of professional misconduct inLow Cze Hong. … 43    … We are of the view that, for clarity of analysis, the distinction should always be drawn in future cases. This would facilitate comparison of like cases with like: cases under the first limb would draw from sentencing precedents in which that particular limb was invoked, as would similarly be the approach for cases under the second limb. In the criminal law there is a general boundary drawn between intentional wrongdoing and negligent wrongdoing. So should it be in the medical disciplinary context. 39     In the present case, it is not apparent from the GD which limb ofLow Cze Hongthe DC addressed its mind to since this is not stated anywhere in its analysis of the four charges against the appellant. It is not disputed that the burden of proof was on the respondent, and the DC had to satisfy itself that this burden had been discharged beyond reasonable doubt (see, for example,Lee Kim Kwongat [12] and [42] as well asGobinathan at [61]–[62]). Specifically, the DC had to make the following findings before it could hold that the respondent had proved its case against the appellant beyond reasonable doubt: (a)     If the DC was proceeding under the first limb ofLow Cze Hong, it had to determine: (i)       what the applicable standard of conduct was among members of the medical profession of good standing and repute in relation to the question of whether arrangements should have been made for a neonatologist to be present or standing by at the time of the delivery of the complainant’s baby; (ii)       if the applicable standard of conduct did indeed require the appellant to make the aforesaid arrangements, at what point in time such duty crystallised; and (iii)       that the appellant’s conduct constituted an intentional and deliberate departure from the applicable standard of conduct. (b)     Alternatively, if the DC was proceeding under the second limb ofLow Cze Hong, it had to find that: (i)       there was serious negligence on the part of the appellant in not making arrangements for a neonatologist to be present at or placed on standby for the delivery of the complainant’s baby; and (ii)       such negligence objectively constituted an abuse of the privileges of being registered as a medical practitioner. 40     Under each limb ofLow Cze Hong, there are discrete elements that have to be proved by the respondent. Undoubtedly, these set out high thresholds that have to be crossed before a conviction can be sustained. These requirements are different from and also more exacting than those applicable to establishing civil liability both in terms of the standard of misconduct that must be shown as well as the burden of proof that must be discharged. In our judgment, those prosecuting disciplinary proceedings against medical practitioners should assist future Disciplinary Committees by: (a) specifying in the charge the precise allegation that is being made against the medical practitioner concerned; and (b) specifically setting out or indicating which limb ofLow Cze Hongis being invoked, so that there is clarity as to the case that the medical practitioner must meet as well as the issues and the relevant evidence that the Disciplinary Committee should consider. 41     In the present case, it is not evident from the GD that in relation to the Fourth Charge, the DC applied itself to these issues. In this regard, the terms of [39] of the GD, which we have reproduced above (at [36]), are simply insufficient for this purpose. It is therefore unsurprising that the appellant made the point that the DC failed to identify the requisite standard of care against which his conduct at the material time was being assessed. 42     The DC found, on the basis of various risk factors which it identified, that the complainant’s pregnancy was a “high risk pregnancy”, and as a result, a neonatologist ought to have been called or placed on standby for the delivery of the complainant’s baby. This is evident from the manner in which the DC listed various risk factors at [34] of the GD, concluding that “in the circumstances, a neonatologist ought to be called on the basis of [those] factors”. 43     The amalgamation of risk factors as the basis of the appellant’s conviction is also evident from the following passage from [43(d)] of the GD: … [T]he present case is one where there are manyred flags that should have alerted the [appellant] to the necessity for a neonatologist, as we had set out above in these Grounds i.e., the fact that the [complainant] was undergoing VBAC, there was moderate meconium stained liquor, maternal fever requiring intravenous antibiotics, pathological CTG tracings and instrument delivery. [emphasis added] 44     On appeal, the respondent submitted that the DC had adopted a yardstick that was described as the “fundamental principles of good clinical practice in the best interests of the [p]atient”,[note: 2]and referred to [34(a)] of the GD, which states: … In the absence of clear guidelines, a medical practitioner in the [appellant’s] shoes ought to take into account all these considerations and then manage the patient with good clinical practice safely … to achieve the best outcome. … 45     In fairness to the DC, we do not think this was articulated as the relevant standard of conduct. Rather, this was put forward in the context of a discussion on the significance that ought to have been placed on the presence of moderate meconium-stained liquor. On that issue, the DC noted the absence of a consensus amongst the experts, but went on to say that the fact that there was such staining was something which the appellant had to keep in mind and consider, and then manage the complainant in accordance with good clinical practice. This statement was little more than a truism and shed little (if any) light on whether and, if so, how the appellant had failed to meet the requisite standard of conduct. 46     No explanation was furnished as to what “good clinical practice” meantin these circumstances. The words “good clinical practice” may be found in the respondent’s Ethical Code and Ethical Guidelines, and to that extent, apply generally to all medical practitioners. The phrase does not tell us much, if anything, about the standard of appropriate practice or the specific duty in the circumstances that would have required the appellant to arrange for a neonatologist to be present or standing by during the delivery of the complainant’s baby. Given that the essence of the Fourth Charge was that the appellant breached his duty by failing to have a neonatologist present or placed on standby, it was necessary for the DC to establish, first, how and when such a duty arose, and, second, whether the appellant’s failure to discharge that duty was a deliberate and intentional departure from the applicable standard of conduct (if the first limb ofLow Cze Hongwas being invoked) or amounted to serious negligence of sufficient gravity to objectively indicate an abuse of the privileges of registration as a medical practitioner (if the second limb ofLow Cze Hongwas being invoked). 47     Returning to the DC’s focus on “red flags” in the GD, these “red flags” seemed to be derived from the opinions of the respondent’s experts, Dr Venkat and Prof Ho. They consisted of various clinical indicators, on the basis of which it was suggested that a neonatologist should have been present at or placed on standby for the delivery of the complainant’s baby. 48     Dr Venkat based her opinion on the fact that there was meconium-stained liquor and an abnormal CTG trace that led to an instrument-assisted delivery.[note: 3]She thought that the appellant should have intervened at around 6.50pm at the latest because the complainant’s baby was in foetal distress by then.[note: 4]She stated that if she had read the CTG trace, she would have performed a Caesarean section on the complainant by 6.30pm,[note: 5]and based on the clinical indicators, a neonatologist should have been present at the delivery of the baby.[note: 6]Prof Ho, the other expert called by the respondent, pointed to various factors that he considered “red flags” for the delivery. These included the VBAC procedure, the moderate meconium-stained liquor, the maternal fever and the abnormal foetal heart rate patterns at 6.30pm and 8.00pm.[note: 7]He considered that the complainant’s pregnancy was a “high risk” one, and accordingly, a neonatologist should have been placed on standby for the delivery of the baby in anticipation of the need for “a more aggressive approach to neonatal resuscitation”.[note: 8] 49     In our view, the factors that Dr Venkat and Prof Ho relied on could not have stood as legitimate bases for convicting the appellant of the Fourth Charge, given the DC’s findings and conclusion in respect of the first three charges. In particular, the following findings by the DC on those three charges are significant: (a)     the finding in relation to the Second Charge that there was no cause to change the delivery management plan upon the discovery of moderate meconium-stained liquor in the amniotomy done at around 3.40pm; (b)     the finding in relation to the Third Charge that there was no reason to change the delivery management plan at any point in time up to 6.30pm; and (c)     the finding in relation to the First Charge and the Third Charge that the nurses were monitoring the complainant sufficiently, and that the requirement of “close monitoring” did not mean that the appellant had to be physically present and personally attending to the complainant at any point in time up to 6.30pm. 50     Although the first three charges pertained to different aspects of the appellant’s management of the complainant’s labour and the baby’s delivery, specific findings had been made in relation to the very same clinical indicators upon which the appellant’s conviction of the Fourth Charge was based. In addition, findings had also been made as to how the appellant should have responded to those clinical indicators until 6.30pm. The DC found that the baseline foetal heart rate of around 160bpm to 165bpm in the CTG trace as at 6.30pm did not indicate hypoxia or foetal distress, and could be attributed to other factors. This, coupled with the complainant’s temperature of 37.3°C (which likewise could be attributed to other factors such as the epidural anaesthesia) and the moderate meconium-stained liquor, did not, in the DC’s judgment, require a change in the appellant’s assessment of the complainant’s condition or his management plan for the delivery. Rather, these only called for closer monitoring of the complainant, and as we have observed, the DC thought it was sufficient in this regard for the appellant to depend on the nurses (see [14], [16], [24] and [27] of the GD). Additionally, the DC did not take issue with the management of the complainant between 6.30pm and 8.15pm, other than to observe that there was an increase in the baseline foetal heart rate to 165bpm. Indeed, the DC found as a fact that the appellant first learnt of the baby’s tachycardia and the baseline foetal heart rate only at around 8.30pm (see [34(d)] of the GD). The DC’s reasoning in respect of the Fourth Charge should thus have focused on the position after 8.15pm when the appellant returned to Thomson Medical Centre and attended to the complainant shortly thereafter at around 8.30pm. Instead, the DC took the clinical indicators and opinions put forward by Dr Venkat and Prof Ho in respect of an earlier period (namely, the period up to 8.15pm) – for which the DC had concluded that no change in any aspect of the appellant’s conduct was required – and then inexplicably relied on them to find that a neonatologist ought to have been called at some point after 8.15pm. 51     Moreover, Prof Ho’s concern about the VBAC procedure being a “red flag” for the delivery was a point that the DC had specifically considered in dismissing the Second Charge (see [17] above). It is not clear how the fact that the delivery was to be a VBAC procedure would have impacted on the complainant’s baby and thus required a neonatologist to be present at or placed on standby for the delivery. 52     There were other difficulties with adopting an approach that relied on the aggregation of supposed “red flags”, and we shall touch on these difficulties elsewhere in this judgment. For present purposes, our focus is on the fact that most of the “red flags” had already been considered and regarded by the DC as not requiring any change in the management of the delivery of the complainant’s baby. The only new input was the baseline foetal heart rate, which had increased further after 8.15pm. If the DC considered that this fact specifically required that a neonatologist be called to be on standby for or present at the delivery, then it was incumbent on the DC to state this clearly and identify the point in time at which the duty to call for a neonatologist arose (presumably, this duty would have arisen at about 8.30pm when the appellant became aware of the latest CTG trace); the DC would also have to explain its basis for holding that this duty arose. 53     The timing is a critical point because for the misconduct alleged in the Fourth Charge to come within either limb ofLow Cze Hong, there not only had to be a failure on the appellant’s part to comply with the applicable standard of conduct; it was also necessary for the respondent to show that any failure on the appellant’s part was either so serious as to be a deliberate and intentional departure from that standard (if the respondent was relying on the first limb ofLow Cze Hong), or so negligent as to amount to an abuse of the privileges of registration as a medical practitioner (if the respondent was relying on the second limb ofLow Cze Hong). The DC’s basis for making such findings would have had to be clearly and expressly spelt out. These considerations were especially important in this case because, assuming that the duty to call for a neonatologist crystallised at about 8.30pm, the appellant’s alleged breach of this duty had to be assessed in the light of the fact that by about 8.43pm, he had asked for a neonatologist to be called to attend to the baby of his other patient (see [6(h)] above), and by around 8.50pm, he had commenced the delivery of the complainant’s baby (see [6(j)] above). 54     Nowhere in the GD did the DC address itself to any of the above considerations. In our judgment, this was a fatal flaw in the DC’s reasoning. 55     The DC’s failure to identify precisely what it was that constituted the applicable standard of conduct from which the appellant allegedly departed in relation to the Fourth Charge may be contrasted with its approach in dealing with the first three charges. In respect of the First Charge, the DC explicitly stated at [11] of the GD that in its view, the standard of obstetric care that was called for upon moderate meconium-stained liquor being detected at around 3.40pm was close monitoring of the complainant’s labour. It then went on to consider whether what the appellant in fact did in the circumstances was inconsistent with that standard, and found that not to be the case. 56     In respect of the Second Charge, the DC specifically stated that the “key question” was whether the discovery of moderate meconium-stained liquor would require any change in the plans for the intended VBAC procedure. After considering the evidence of the experts, the DC concluded that there was no need for any alteration, although the complainant needed to be closely monitored (at [21] of the GD). The appellant again had not breached the applicable standard of conduct. The DC then considered (at [23] of the GD) the separate question of the duty to specifically explain to the complainant the “low” risk of MAS, and concluded that while it would have been “the ideal practice” to provide an explanation, the appellant’s failure to do so did not amount to professional misconduct. Hence, the appellant was acquitted of the Second Charge. 57     As for the Third Charge, the DC applied its mind to the specific question of whether, by 6.30pm, the appellant ought to have made arrangements for another obstetrician to take over the management of the complainant given her temperature, the baseline foetal heart rate readings in the CTG trace and the earlier discovery of moderate meconium-stained liquor. It concluded that there was no such duty upon the appellant because the CTG trace and other clinical indicators “did not demand the personal attendance of the [appellant], but [only] closer monitoring of the [c]omplainant” (see [27] of the GD). 58     In contrast, the Fourth Charge was not analysed in the same reasoned manner. The DC dealt with the Fourth Charge after having already made the following findings in relation to the first three charges: (a)     there was no occasion to alter the plan for the management of the complainant as at 6.30pm, and even as at 8.15pm; (b)     there was no need to engage another obstetrician to handle the management of the complainant as at 6.30pm; (c)     the complainant needed closer monitoring, but it was reasonable for the appellant to rely on the ward nurses for this purpose, and there was no need for him to attend to the complainant personally between 6.30pm and his intended return to Thomson Medical Centre at about 8.00pm; and (d)     the ward nurses did not apprise the appellant of any change in any of the available clinical indicators between 6.30pm and 8.15pm, or possibly 8.30pm. 59     Given these findings, it was incumbent on the DC to specify in relation to the Fourth Charge: (a)     whether, after the appellant returned to Thomson Medical Centre at about 8.15pm, there arose a duty on him to arrange for a neonatologist to be present at or placed on standby for the delivery of the complainant’s baby; and (b)     if such a duty arose: (i)       when and on what basis it arose; and (ii)       whether and, if so, on what basis the appellant’s failure to discharge that duty constituted professional misconduct within the meaning of either limb ofLow Cze Hong. 60     There may well be significant practical difficulties in finding the precise answers to the questions we have outlined above, but it was nevertheless the responsibility of the respondent to lead evidence addressing these matters, and the responsibility of the DC to evaluate that evidence and then come to a conclusion. This was no more than what had been done for the first three charges. 61     As we have noted above, the DC’s failure to analyse the Fourth Charge in the aforesaid reasoned manner was in itself a fatal flaw in reasoning which was sufficient to warrant setting aside the appellant’s conviction of that charge.",
        "Conflicting expert evidence": "62     We turn to the second difficulty which we have with the DC’s decision on the Fourth Charge (see [34(b)] above). As mentioned earlier, there was a conflict in the expert evidence in several respects. In these circumstances, the DC was obliged to consider and explain its reasons for preferring one view of the experts over another. This, it failed to do. There were two key issues in relation to which there was conflicting expert evidence, namely: (a) whether the clinical indicators signified “suspected foetal compromise”; and (b) whether there was a duty to call for a neonatologist to be present at or placed on standby for the delivery of the complainant’s baby given the presence of moderate meconium-stained liquor as well as suspected foetal compromise (assuming that was found to be the case). Establishing “suspected foetal compromise” 63     In respect of the issue of foetal distress (used interchangeably with “foetal compromise” by the experts and the DC, and likewise by us in this judgment), the GD stated (at [34(e)]) that there was “clearevidence of f[o]etal distress” [emphasis added] based on the CTG trace at 8.30pm, which showed “pathological” tachycardia exceeding 180bpm. However, the expert evidence was in fact divided on whether the clinical indicators then were sufficient to constitute clear evidence of foetal distress. 64     Dr Venkat’s evidence was thatanydeviation from a normal, reactive CTG trace would be construed as an indication of foetal compromise and would require close vigilance.[note: 9]She testified that actual foetal distress was evidenced by the CTG trace sometimebefore8.15pm as the baseline foetal heart rate had increased to 200bpm (cfthe DC’s finding at [34(b)] of the GD that the baseline foetal heart rate exceeded 180bpm onlyafter8.15pm), and the appellant should have returned to review the complainant before that.[note: 10]She also believed that the CTG trace pointed to the complainant’s baby being hypoxic.[note: 11] 65     Prof Ho adopted a much narrower view of foetal distress by focusing on hypoxic-ischaemic changes in the foetus.[note: 12]He opined that classical indicators of foetal distress were a non-reactive CTG trace, coupled with a reduction in baseline variability and prominent decelerations.[note: 13]On this basis, foetal distress was not evident from the CTG trace because it did not indicate hypoxic effects on the complainant’s baby.[note: 14] 66     Assoc Prof Rauff’s evidence was that the main concern with foetal distress was hypoxia.[note: 15]Signs of foetal distress included decreased variability with variable or late decelerations, and these signs were not present in this case.[note: 16]Tachycardia alone, Assoc Prof Rauff testified, did not mean that there was hypoxia. Instead, hypoxia would be diagnosed only if there was tachycardia coupled with decelerations in the baseline foetal heart rate.[note: 17]So while tachycardia could be a possible sign of hypoxia and some foetal distress, it was not conclusive by any means and the attending obstetrician should keep monitoring for other signs.[note: 18] 67     Prof Arulkumaran’s view, too, was that if there was foetal distress, this would manifest itself not only in tachycardia, but also in repeated decelerations which were usually “atypical variable or late decelerations”.[note: 19]He stated that hypoxic tachycardia “usually show[ed] marked reduction in baseline variability and prominent decelerations”.[note: 20]He also opined that most cases involving meconium-stained liquor were not associated with foetal distress.[note: 21]He added that the Fourth Charge was incorrect in stating that the presence of meconium-stained liquor would usually suggest foetal compromise, and, indeed, this much was also accepted by Dr Venkat.[note: 22] 68     On the question of tachycardia as an indication of foetal distress, Assoc Prof Tee said as follows in his testimony:[note: 23] Q:Would you agree that when there’s foetal distress, the neonatologist should be called on standby? A:That would depend on the description of the foetal distress because the term “foetal distress” is a very general term and you should qualify exactly what is the concern. Q:Foetal distress in terms of tachycardia of 180 beats of more. A:That’s not an indication to call for a neonatologist or to immediately deliver the baby. [emphasis added] 69     With regard to the presence of moderate meconium-stained liquor, Assoc Prof Lee said that while this was a non-specific sign of foetal distress, it was also common in uncompromised labours.[note: 24]Assoc Prof Lee testified that as a neonatologist, he would rely on the attending obstetrician to interpret the CTG trace and inform him if he needed to be on standby, but a neonatologist would not be called because of tachycardia alone.[note: 25] 70     It is clear from this summary of the expert opinion that there were significantly differing views as to what clinical indicators would establish suspected foetal distress. Only Dr Venkat opined that an increase of the baseline foetal heart rate to 200bpm was to be equated with foetal distress (see [63] above). The DC appeared to have adopted her position without a further discussion of why it did so, and seemingly also overstated the point (see [34(e)] of the GD). The other experts had, in fact, generally concurred that suspected foetal distress could not be inferred solely from tachycardia or an increase in the baseline foetal heart rate shown in the CTG trace. Indeed, the other experts seemed more concerned with other clinical indicators, with several of them emphasising decelerations and baseline variability as key clinical indicators in establishing whether or not the complainant’s baby was hypoxic or suffering from foetal compromise (which, they found, he was not). 71     Prof Arulkumaran also pointed out the danger of interpreting the CTG trace by only considering tachycardia at the relevant time and was critical of Dr Venkat’s interpretation in this respect:[note: 26] … So if you take isolated parameters and tried to make conclusions, that means you are not considering the entire pathophysiology or the entire clinical picture in making a diagnosis or coming to a management conclusion. 72     In these circumstances, it was incumbent on the DC to explain why it preferred Dr Venkat’s opinion (namely, that tachycardia was to be equated with suspected foetal distress) when there was substantial evidence to the contrary. This, the DC did not do. 73     Additionally, there was some controversy as to what was meant by a “pathological” baseline foetal heart rate, a term used in the guidelines of the UK-based National Institute of Health and Clinical Excellence,[note: 27]which are recognised in Singapore. Based on these guidelines, a “pathological” baseline foetal heart rate trace is a trace with two or more features classified as non-reassuring, or one or more features classified as abnormal. The baseline foetal heart rate of more than 180bpm after 8.15pm in this case was an abnormal feature, and thus meant that the CTG trace of that heart rate was pathological. The appellant’s experts said that the baseline foetal heart rate had to be considered alongside other clinical indicators in the CTG trace such as baseline variability and decelerations before it was reasonable to infer foetal compromise, and that absent such accompanying clinical indicators, there was no particular significance in describing a baseline foetal heart rate as “pathological”. According to the appellant’s experts, a pathological baseline foetal heart rate on its own did not establish foetal distress or require any immediate intervention,[note: 28]especially given that the complainant was almost fully dilated by the time the baseline foetal heart rate reached the elevated levels recorded after 8.15pm.[note: 29]This point was also relevant to the view of the appellant’s experts that a baseline foetal heart rate, whether or not pathological, was not in itself sufficient to indicate suspected foetal distress; various other clinical indicators had to be considered as well. According to the appellant’s experts, a pathological baseline foetal heart rate also did not entail that an obstetrician had to intervene surgically.[note: 30]When asked what an obstetrician should do when a baseline foetal heart rate was considered “pathological”, Prof Arulkumaran said that the obstetrician would have to consider the actual factors causing this “pathological” feature and to what degree it varied from the accepted norms:[note: 31] Yes. Anything more than 180[bpm] will be classified as pathological. But to look at the seriousness of the trace, then one should look at the baseline variability, and here the baseline variability appears to be satisfactory. 74     Prof Arulkumaran went on to explain that in the present case, the progressive increase in the baseline foetal heart rate recorded in the CTG trace could be attributed to a rise in the complainant’s temperature or a foetal infection, and that so long as there were no repeated decelerations, it would not point to the complainant’s baby being hypoxic. In this instance, the complainant did indeed have a temperature; accordingly, it was not surprising that the baseline foetal heart rate in the CTG trace increased. Prof Arulkumaran testified that if there were no repeated decelerations and if there were segments of accelerations, the baseline foetal heart rate, although pathological, would have had “nothingto do with hypoxia or distress”[note: 32][emphasis added]. 75     Despite the conflicting expert evidence presented to it, the DC concluded (at [34(e)] of the GD) that the “pathological” CTG trace of the baseline foetal heart rate in this case was “clear evidence of f[o]etal distress”. However, this was contrary to the views of several experts. 76     The respondent argued on appeal that the DC’s reference to the CTG trace was not just in relation to tachycardia, but was instead in relation to “the entire CTG pattern”,[note: 33]that is to say, baseline variability, decelerations and accelerations. However, this argument was not supportable on a plain reading of the GD. At various junctures, the DC referred only to “the tachycardia demonstrated on the CTG trace” (see [34(e)] of the GD; see also [34(b)], [34(d)], [34(f)] and [43(d)] of the GD). There were no references to decelerations or baseline variability in relation to the CTG trace. Moreover, as noted above, the view of several of the experts was that there were no such decelerations or baseline variability in the present case. If the DC chose to reject the views of those experts (which it seemingly did), it would have to explain its basis for doing so. There is no trace in the GD of any such explanation. The duty to call for a neonatologist 77     The central concern of the Fourth Charge was whether and, if so, at what point a duty arose on the appellant to arrange for a neonatologist to be present at or placed on standby for the delivery of the complainant’s baby. The DC stated at [34] of the GD that a neonatologist ought to have been called on the basis of a variety of risk factors. We have addressed these risk factors above, and we have also noted that such an approach, which entailed aggregating a cluster of risk factors as giving rise to a duty to call for a neonatologist, was unsatisfactory because it failed to isolate the particular events after 8.15pm which triggered that duty. 78     There is a further point – there was in fact a conflict in the expert evidence as to whether such a duty even arose at all. Only Prof Ho and Dr Venkat were of the view that based on the amalgamation of risk factors, this duty arose. Specifically, Dr Venkat thought that the duty arose by either 6.30pm or, at the latest, 6.50pm (see [48] above). As for Prof Ho, although he did not expressly refer to a specific time at which that duty arose, he said that it arose with the increase in the complainant’s temperature and the CTG trace showing a baseline foetal heart rate of around 220bpm.[note: 34]That would point to the duty having arisen at around 8.40pm. In comparison, Prof Arulkumaran and Assoc Prof Lee were of the view that a neonatologistmighthave had to be called, but only at a later point in time closer to the delivery of the complainant’s baby. 79     According to Prof Arulkumaran, a decision as to whether to expedite the delivery had to be made at 8.15pm, when the baseline foetal heart rate increased to 180bpm[note: 35](cfthe DC’s finding at [34(b)] of the GD that the baseline foetal heart rate was only 165bpm as at 8.15pm). Prof Arulkumaran thought it was acceptable that the appellant allowed the complainant to fully dilate as vaginal delivery was possible shortly thereafter. He said that a neonatologist should have been called in to stand by for the delivery only when the appellant decided to commence the delivery at around 8.50pm.[note: 36]Assoc Prof Lee said that the attending obstetrician should determine whether the maternal fever and the CTG trace as at 8.30pm were caused by the effects of the epidural anaesthesia or by a foetal infection. If it were the latter, then a neonatologist wouldnormallybe called to be on standby.[note: 37]The duty to call for a neonatologist was not, however, an absolute one, and the decision as to whether to call for one depended largely on the individual obstetrician concerned.[note: 38] 80     The other experts thought that there was no necessity for the presence of a neonatologist. Assoc Prof Tee was of the view that a neonatologist might have been “useful” to reduce the effects of meconium aspiration at the time of the delivery, but this was not absolute, and in the event, there was no meconium aspiration in this case.[note: 39]Moreover, he considered that a maternal fever and an abnormal baseline foetal heart rate pattern could require a neonatologist to be summoned onlyafterthe baby concerned was born, and there was no need for this to be done beforehand.[note: 40]Assoc Prof Tee also noted that the various factors present in this case (namely, moderate meconium-stained liquor, a maternal fever, a VBAC delivery and the abnormal baseline foetal heart rate patterns) wereunrelatedfactors, and an accumulation of them did not necessarily present a worse picture necessitating the urgent attendance of a neonatologist. Instead, each factor had to be considered on its own and assessed on that basis.[note: 41]Based on such an analysis of these factors, Assoc Prof Tee did not agree that a neonatologist had to be present or standing by at the commencement of the delivery. 81     Assoc Prof Rauff was of the view that there was no need to place a paediatrician or neonatologist on standby to resuscitate a hypoxic baby as there was no indication of hypoxia in the present case. In any event, not having a neonatologist placed on standby and having one arrive a minute or two after the delivery would not have made a difference to the outcome as the condition of the complainant’s baby was caused by an infection and not hypoxia.[note: 42]This view was also supported by Dr Low, who said that there was no need for a paediatrician to be placed on standby because the baby’s infection could not have been predicted on the basis of the clinical indicators,[note: 43]and that a baby with an infection would have been attended to onlyafterbirth.[note: 44]Dr Low testified that a suspected foetal infection and the presence of clinical indicators such as moderate meconium-stained liquor, a maternal fever of 37.8°C and tachycardia of 200bpm, even if taken together, did not warrant having a neonatologist placed on standby.[note: 45] 82     This is what Dr Low said in this regard:[note: 46] … I mean, with this kind of experience [the appellant] may change his practice, right, but what is the standard of care … … … [W]e see these cases day in, day out, and the standard is that we should attend to the baby after delivery. You know, it’s unfortunate this child suddenly collapsed … but from one case, do we say okay, we change all our practice and say all cases of suspected infection we have to go and stand-by? That will be a lot of standby, you know, for a lot of normal babies. 83     From the foregoing summary of the experts’ opinions, it is evident that there were conflicting views on whether a neonatologist ought to have been placed on standby or required to be present at the delivery of the complainant’s baby. Of course, it was open and, indeed, incumbent on the DC to come to a conclusion as to how this conflict of evidence should be resolved. This would have entailed the DC identifying the points of departure among the various experts’ views and then setting out a reasoned explanation for preferring one view over the others. Significantly, there is no such analysis in the GD. 84     When there is a conflict in medical opinion, the preference of one body of opinion over another should not only be stated, but also explained (seeSmith v Southampton University Hospital NHS Trust[2007] EWCA Civ 387 at [44] in the context of medical negligence). This would apply with even greater force in the context of disciplinary proceedings such as the present proceedings because of the penal sanctions that may be imposed. In our judgment, in failing to address the conflicting expert testimony and explain why it preferred one particular view over the others, the DC erred. On this basis, we find that its decision in respect of the Fourth Charge was contrary to the evidence and wrong in law.",
        "Going beyond the ambit of the Fourth Charge": "85     We come to the third difficulty which we faced with the DC’s decision on the Fourth Charge (see [34(c)] above). This relates to the appellant’s contention that the DC took into consideration factors that went beyond the ambit of the Fourth Charge and relied on facts that it should not have considered. 86     The framing of a charge and the precise wording used are crucial in assessing the case that must be met by the medical practitioner facing the charge (seeHo Paul v Singapore Medical Council[2008] 2 SLR(R) 780 at [9]). The charge should be set out with sufficient clarity and precision, and the facts that the respondent intends to rely on should be particularised. If new facts arise during the inquiry, consideration should be given to whether the charge ought to be amended. At the same time, irrelevant facts that are not helpful to the understanding of the charge or that are not being relied upon by those prosecuting the matter should not form part of the charge. 87     As noted inLim Teng Ee Joyce v Singapore Medical Council[2005] 3 SLR(R) 709 at [26], if, in the course of an inquiry, there emerges certain conduct on the part of the medical practitioner which is not mentioned in the charge but which the Disciplinary Committee tasked with the carriage of the inquiry disapproves of, that conduct would generally not be a ground for imposing any punishment on the medical practitioner. Of course, this is not an absolute rule, and whether or not any punishment should be imposed in such circumstances depends ultimately on whether there has been due process and fairness in the conduct of the inquiry. The real question is whether the medical practitioner was prejudiced or misled by the deficiency in the charge (seeGan Keng Seng Eric v Singapore Medical Council[2011] 1 SLR 745 at [27]) and/or by the attempt to rely on material not mentioned in the charge. 88     In the present case, the appellant was charged under the Fourth Charge with failing to act in the best interests of the complainant in that he “did not arrange for a neonatologist to be present at or to be put on standby for the [complainant’s] delivery” despite the presence oftwo specific factors, namely, moderate meconium-stained liquor and suspected foetal compromise. 89     Against that background, it is useful to set out the whole of [34] of the GD: 34.    It is our view that in the circumstances, a neonatologist ought to be called on the basis of the following factors: a)    We accept that as of the date of the incident, there were some divergences in the relevant institutions’ guidelines/medical publications [as to] whether a neonatologist ought to be required to be put on standby and/or be present in cases where there was meconium-stained liquor or moderate meconium-stained liquor. However, in the present case, it was not just a single factor of the state of the meconium-stained liquor; there were other considerations (i.e. the developing situation closer to the delivery). In the absence of clear guidelines, a medical practitioner in the [appellant’s] shoes ought to take into account all these considerations and then manage the patient with good clinical practice safely … to achieve the best outcome. The decision whether to call a neonatologist was one that the [appellant] had to make when he managed the [c]omplainant’s labour. b)    From 6.30 p.m. to 8.15 p.m., the CTG trace showed an increase of the baseline f[o]etal heartbeat rate to 165 bpm. After 8.15 p.m. the CTG trace showed tachycardia exceeding 180 bpm, from 175 bpm. After 8.40 p.m., the baseline rate was nearly 220 bpm which is the maximum value that could be recorded i.e. the value was literally off the charts. The nature of the CTG trace’s increase in the baseline of the f[o]etal heartbeat was described by Prof Arulkumaran as “pathological”. c)    The [appellant] stated that the records show that he was away for 4 hours and 15 minutes. He left the hospital at 4 p.m. and returned to the delivery suite by about 8.15 p.m. He wanted to assess the [c]omplainant but had to divert to attend to another patient … in an adjoining delivery ward. d)    The evidence was that the [appellant] could only assess the [c]omplainant at 8.30 p.m. and learnt about the CTG trace i.e. he became aware of the f[o]etal’s [sic] tachycardia at that point in time. He also came to be aware of the [c]omplainant’s temperature of 37.8°C, and prescribed the administration of antibiotics (ampicillin) intravenously. e)    On the views offered by the experts, the tachycardia demonstrated on the CTG trace is clear evidence of f[o]etal distress. Dr Mary Rauff described f[o]etal heartbeat exceeding 180 bpm as “pathological”. She agreed that it would have been good for a neonatologist to be on standby, and would call him when the delivery was imminent. Dr Mary Rauff also testified that with the tachycardia as shown on the CTG trace at 8.30 p.m., she would call the neonatologist. f)    We also note that the in the delivery notes, the [appellant] annotated “NRFS” i.e. Non Reassuring F[o]etal Status. This, together with the fact that there was moderate meconium-stained liquor, and the pathological/saltatory nature of the tachycardia as shown on the CTG trace should have prompted the [appellant] to call in a neonatologist to attend the delivery as the indications are that this would be a high-risk delivery. This was not done. g)    Finally, there was much discussion of the evidence in connection with the baby’s APGAR [Appearance, Pulse, Grimace, Activity and Resuscitation] score after birth. The [respondent’s] case was the score recorded was rather optimistic and did not reflect the true condition of the baby when he was delivered. We do not think that the APGAR score is relevant to the Charges against the [appellant]. His conduct is judged against what he faced during his management of the [c]omplainant and her delivery. 90     With regard to [34(a)] of the GD, all that the DC articulated there was simply the normative standard that a medical practitioner should consider all the circumstances and then manage the patient safely. We have commented on this at [45] above, where we observed that this normative standard might well be true, but it said little (if anything) about what specifically it was that the appellant did or failed to do that constituted a serious breach of the acceptable standard of conduct. 91     With regard to [34(b)] of the GD, we have already dealt with this at [63]–[76] above and have nothing further to add. 92     We turn now to [34(c)] of the GD. That sub-paragraph highlighted the fact that the appellant was away from the complainant for 4 hr 15 min. However, the DC did not explain why it mattered that the appellant was away from the complainant for that period of time; neither did it explain why it was material that the appellant, after returning to Thomson Medical Centre at about 8.15pm, attended to another patient before seeing the complainant at about 8.30pm. The Fourth Chargedid notpertain to the appellant’s failure to attend to the complainant during the 15-minute period from around 8.15pm to around 8.30pm. This specific issue was instead particularised in the Third Charge and formed part of the basis of that charge, of which the appellant was acquitted; it was not specifically particularised in the Fourth Charge at all. The DC, in dismissing the Third Charge, said that based on the testimony of the experts, the requisite standard of conduct was such that it did not require the appellant either to find another obstetrician to take over the management of the complainant, or to be present or attend personally to the complainant as at 6.30pm. The DC also specifically noted that the appellant intended to return to Thomson Medical Centre at about 8.00pm, and did not take issue with this in relation to the Third Charge (at [27] of the GD). In a similar vein, in relation to the First Charge (viz, failing to carry out a proper assessment of the complainant within a reasonable time during her labour), the DC found as follows (at [11] of the GD): … We cannot say that the [appellant’s] plan to monitor the complainant through the nurses and then … return later to attend to her was grossly flawed or was inconsistent with the acceptable standard [of] reasonable management. … 93     Furthermore, and as mentioned above at [50], the DC did not take issue with the appellant’s management of the complainant between 6.30pm and 8.15pm. The appellant’s absence from Thomson Medical Centre between around 4.00pm and around 8.15pm was thus entirely irrelevant to the Fourth Charge and should not have been considered at all by the DC. 94     With regard to [34(d)] of the GD, it was not clear whether the DC was taking the appellant to task for not having taken any steps to assess the complainant during the 15 minutes prior to 8.30pm. We note, first, that based on the evidence, the appellant was updated on the complainant’s position between approximately 8.15pm, when he returned to Thomson Medical Centre, and approximately 8.30pm, when he attended to the complainant personally. There is nothing in either the evidence or the DC’s findings which identify anything that transpired during those 15 minutes which required the appellant to specifically andimmediatelyattend to the complainant. 95     We further reiterate what we have said at [49]–[57] above. The effect of the DC’s decision on the first three charges was that the appellant was not culpable for anything done up to 6.30pm; in addition, there was also no criticism by the DC of the appellant’s conduct up to approximately 8.15pm, when he returned to Thomson Medical Centre. 96     Finally, the administration of intravenous antibiotics, which the DC also referred to at [34(d)] of the GD, was an act entirely unrelated to suspected foetal distress and irrelevant to the need to call for a neonatologist. According to the experts, antibiotics were administered because the appellant suspected that there was maternal pyrexia arising from an infection.[note: 47]This meant that the administration of antibiotics was unrelated to the Fourth Charge and should not have been considered by the DC. 97     As for [34(e)] of the GD, we have already examined this at [63]–[84] above. In our judgment, without first resolving the conflicting expert testimony, the DC could not have fairly concluded that there was “clear evidence of f[o]etal distress” at 8.30pm, or that there was a duty on the appellant to call for a neonatologist at that point in time, without resolving the conflicting expert testimony. 98     As to [34(f)] of the GD, there is a reference to the appellant having written “NRFS” for non-reassuring foetal status. The evidence indicated that this was written at about 8.50pm just before the appellant commenced the delivery. Aside from the fact that this was not particularised in the Fourth Charge, it bears noting that if the DC did hold that this was a material fact, then it would suggest thatby 8.50pm, there was a duty to call for a neonatologist to be present at or on standby for the delivery on the basis that there was reason to be concerned about the foetal status. 99     The DC did not frame its analysis in this way; but assuming it did, then it raises the consequent question of whether the decision to immediately commence the delivery at that point without specifically calling for a neonatologist would fall under either limb ofLow Cze Hong.There are three observations we make here: (a)     First, that specific question, namely, the significance of the annotation “NRFS” at about 8.50pm and whether this specifically gave rise to any specific duty before commencing the delivery, was not put to the experts and so was not specifically addressed by the DC in the GD. (b)     Second, the appellant testified that when he commenced the delivery, he had it in mind that he had already asked Dr Keoy to attend to the baby of the patient in the adjoining delivery room. The appellant’s view was that calling for another neonatologist for the delivery of the complainant’s baby would not be helpful or appropriate since this would not result in the complainant’s baby being attended to by that neonatologist any sooner than Dr Keoy (or, as it turned out, Dr Wong, who came in Dr Keoy’s place) could. (c)     Third, the complainant’s baby was delivered 13 or so minutes after the annotation was made and was attended to by Dr Wong within a minute or two. 100    In the circumstances, we see nothing in [34(f)] of the GD that could have legitimately contributed to the appellant’s conviction. 101    There are some further points. In convicting the appellant of the Fourth Charge, the DC also relied on the fact that the appellant was confused as to who would be assisting him, in that he expected Dr Keoy, but it was Dr Wong who turned up instead. The DC thought this resulted in an unsatisfactory state of affairs where the appellant was confused while facing a difficult delivery (see [36] of the GD). We note, first, that any confusion would in fact have occurredafterthe delivery because that was when Dr Wong appeared. Second, the Fourth Charge pertained to the appellant’s failure to have a neonatologist standing by or present at the delivery of the complainant’s baby. The fact that Dr Wong was able to attend to the baby as she was then at a nearby delivery suite seems to us much more relevant than whether or not the appellant was confused as to the identity of the neonatologist or paediatrician who was to assist him with the delivery. 102    Separately, the DC also exceeded the ambit of the Fourth Charge by taking the view that a neonatologist had to be present or placed on standby because, among other things, the appellant was proceeding with an instrument-assisted delivery (at [35] and [43(d)] of the GD). This factor was not particularised in the Fourth Charge. 103    During the proceedings before the DC, Prof Arulkumaran had said that it might have been useful to have a neonatologist placed on standby because, among other things, the delivery was to be an instrument-assisted delivery.[note: 48]What is significant is that this appears to have been no more than a passing remark by Prof Arulkumaran. There was certainly nothing to suggest that because of this factor, a specific duty arose on the appellant to have a neonatologist placed on standby. 104    In keeping with this, it may be noted that the respondent did not rely on this factor at all. This can be seen from the respondent’s submissions for the inquiry below, which, in addressing the Fourth Charge, did not raise the issue of the delivery being an instrument-assisted delivery at all. Likewise, the appellant did not, in his submissions, deal with the significance, if any, of the delivery being an instrument-assisted delivery. In these circumstances, aside from the limited probative value of Prof Arulkumaran’s statement at [103] above, the DC should not have considered that statement in analysing the Fourth Charge. 105    In the circumstances, we find that the DC did impermissibly stray beyond the permitted scope of the particulars stated in the Fourth Charge in relation to the matters set out at [92]–[93], [95]–[96] and [98]–[104] above.",
        "Factual errors": "106    We come to our final difficulty with the DC’s decision on the Fourth Charge (see [34(d)] above). The appellant submitted that the DC erred in material respects in its factual findings. In our judgment, there were indeed at least two factual errors that affected the appellant’s conviction. 107    The DC (at [34(e)] of the GD) referred to Assoc Prof Rauff’s oral testimony that based on the CTG trace suggesting pathological tachycardia at 8.30pm, it “would have been good” to call for a neonatologist to be placed on standby.[note: 49]We have already touched on various aspects of this earlier, but there is yet a further point. This part of Assoc Prof Rauff’s testimony appeared to contradict what she said in her report as well as in other parts of her oral evidence, which was that a neonatologistdid nothave to be called in the circumstances. In her oral evidence, she said thatshewould have asked for a paediatrician to be called before the delivery if there was none around. Significantly, however, she also recognised that a paediatrician might not have been readily available as, Thomson Medical Centre being a private hospital, there might not have been a paediatrician on call. She said that in these circumstances, she would nonetheless have proceeded with the delivery even if no paediatrician were available.[note: 50]Assoc Prof Rauff explained that the main purpose of having a neonatologist present at the delivery would have been to help in resuscitating a hypoxic baby.[note: 51]She went on to say, however, thatthere was no reason in this case to have had a paediatrician placed on standbyas, based on the CTG trace, there was no evidence to suggest hypoxia, and this much appeared to have been accepted by the DC during her testimony.[note: 52]The DC’s reference to a selected portion of Assoc Prof Rauff’s evidence seemed to us, with respect, to be incomplete. Viewed in context, we do not think Assoc Prof Rauff was in fact saying that the appellant was under a duty to have a neonatologist placed on standby based on the CTG trace as at 8.30pm. 108    Second, the DC said that the appellant’s failure to call for a neonatologist was indicative of his “failure to address his mind to the clinical indications when he attended to the [c]omplainant” at approximately 8.30pm (at [35] of the GD). This finding was not supported by the appellant’s evidence, even though he admitted that he had forgotten to call for a neonatologist when he commenced the delivery of the complainant’s baby at about 8.50pm. Significantly, the appellant went on to say that he knew that a neonatologist would imminently arrive.[note: 53]We have already referred to the arrangements which the appellant made for Dr Keoy to check on the baby of the patient in the next delivery room; the appellant was therefore mindful of the fact that Dr Keoy could be called for the delivery of the complainant’s baby if necessary.[note: 54]The appellant said in his testimony that as he was commencing the delivery, he made a mental note to call Dr Keoy to review the complainant’s baby after the delivery.[note: 55]He consistently maintained that it made a difference that in his mind, Dr Keoy was nearby:[note: 56] … What you are telling me is that if I did not deliver [the other] baby, right, would I have called for a paediatrician to stand by for [the complainant’s] baby? And I cannot answer that because I knew that Dr Keoy was going to be on his way ... To me, it was as good as a standby because he would be there within, if not at birth, within minutes of birth. This part of the evidence does not seem to have been considered by the DC. 109    In these circumstances, the DC was not entitled to conclude,merely becausethe appellant did not call for a neonatologist, that he failed to address his mind to the clinical indicators when he attended to the complainant. 110    We therefore hold that these two findings of the DC were contrary to the evidence as they were based on a consideration of only one part of the respective witnesses’ evidence without accounting for other parts of the evidence where these witnesses elaborated on or clarified their statements. In so far as the DC relied on these two findings to convict the appellant of the Fourth Charge, that conviction cannot stand.",
        "Conclusion": "111    For all the reasons stated above, we set aside the appellant’s conviction in relation to the Fourth Charge, and with it, we set aside all the other orders made by the DC. In the circumstances, the question of sentence does not arise at all. For the avoidance of doubt, we should highlight that our decision in this appeal deals solely with the appellant’s conviction of the Fourth Charge. Our decision has no bearing upon the observations made by the DC at [49] of the GD in relation to various aspects of O&G practice and the standards that ought to be followed or applied. 112    Consequently, we set aside all the orders made by the DC in relation to the Fourth Charge, and order that the appellant is to have his costs and disbursements of the inquiry as well as of the proceedings before this court. These costs are to be taxed if not agreed.  [note: 1]Affidavit of Dr Ang Pek San Lawrence, 21 April 2014, Exhibit APS-2. [note: 2]Respondent’s submissions, para 150. [note: 3]Dr Venkat’s report, 2 July 2012, para 24. [note: 4]Dr Venkat’s report, 2 July 2012, pp 16, 19; 10 March 2013, para 5. [note: 5]Notes of Evidence (“NE”), 20 March 2013, p 86. [note: 6]NE, 20 March 2013, pp 26–27. [note: 7]Prof Ho’s report, 6 March 2013, paras 4, 9. [note: 8]Prof Ho’s report, 6 March 2013, para 9. [note: 9]Dr Venkat’s report, 10 March 2013, para 7. [note: 10]Dr Venkat’s report, 2 July 2012, para 20. [note: 11]NE, 20 March 2013, pp 19, 20 and 32. [note: 12]Prof Ho’s report, 25 June 2012, para 5. [note: 13]Prof Ho’s report, 25 June 2012, para 7. [note: 14]Prof Ho’s report, 25 June 2012, para 10. [note: 15]NE, 25 March 2013, pp 112-113. [note: 16]Assoc Prof Rauff’s report, 2 January 2013, paras 15 and 19. [note: 17]NE, 25 March 2013, pp 164-165. [note: 18]NE, 25 March 2013, pp 165-167. [note: 19]Prof Arulkumaran’s report, 23 August 2012, p 5, para 2(e). [note: 20]Prof Arulkumaran’s report, 11 August 2010, pp 9 and 11. [note: 21]Prof Arulkumaran’s report, 23 August 2012, p 10, para 4(c). [note: 22]NE, 20 March 2013, p 205. [note: 23]NE, 21 May 2013, p 89. [note: 24]Assoc Prof Lee’s report, 22 October 2012, paras 14, 40 and 44. [note: 25]NE, 21 May 2013, pp 67-68. [note: 26]NE, 25 March 2013, p 212. [note: 27]Respondent’s Core Bundle, pp 70-71. [note: 28]Assoc Prof Rauff’s report, 2 January 2013, para 20. [note: 29]Prof Arulkumaran’s report, 23 August 2012, p 14. [note: 30]NE, 26 March 2013, pp 98-99. [note: 31]NE, 26 March 2013, p 106. [note: 32]NE, 26 March 2013, pp 116-118. [note: 33]Respondent’s submissions, para 77. [note: 34]NE, 21 March 2013, pp 123–124. [note: 35]Prof Arulkumaran’s report, 11 September 2010, pp 11-12. [note: 36]Prof Arulkumuran’s report, 23 August 2012, p 17 at Item 10; NE, 26 March 2013, p 72. [note: 37]Assoc Prof Lee Jiun’s report, 22 October 2012, para 15. [note: 38]NE, 21 May 2013, pp 78-79. [note: 39]Assoc Prof Tee’s report, 27 December 2012, paras 10 and 16. [note: 40]NE, 21 May 2013, pp 90-91. [note: 41]NE, 21 May 2013, pp 91-94. [note: 42]Assoc Prof Rauff’s report, 2 January 2013, para 20. [note: 43]Dr Low’s report, 31 January 2013, p 12. [note: 44]NE, 21 May 2013, p 179. [note: 45]NE, 21 May 2013, p 191. [note: 46]NE, 21 May 2013, pp 188 and 191. [note: 47]Prof Ho’s report, 25 June 2012, para 10; Prof Arulkumaran’s report, 11 September 2010, p 11; Assoc Prof Lee Jiun’s report, 22 October 2012, para 33. [note: 48]NE, 26 March 2013, pp 71-72. [note: 49]NE, 25 March 2013, pp 138-139. [note: 50]NE, 25 March 2013, pp 161-162. [note: 51]NE, 25 March 2013, p 37. [note: 52]NE, 25 March 2013, pp 163-165. [note: 53]NE, 22 March 2013, pp 218-219. [note: 54]Agreed Bundle of Documents for the Inquiry, p 129, para 63. [note: 55]NE, 22 March 2013, pp 37 and 215. [note: 56]NE, 22 March 2013, p 221."
    }
}