{
    "case_title": "Airtrust (Singapore) Pte Ltd\n      v\n      Kao Chai-Chau Linda",
    "ncitation": "[2014] SGHC 28",
    "coram": "George Wei JC",
    "sections": {
        "Introduction": "1       This is an application for the control and conduct of the proceedings in Suit No 477 of 2012 (“S 477/2012”) to be transferred over and continued thereafter by the Receivers and Managers (“RMs”) of the Plaintiff, Airtrust (Singapore) Pte Limited (“Airtrust”). After hearing the parties, I am dismissing this application in its entirety.",
        "The facts": "2       Airtrust was incorporated in Singapore on 13 July 1972. Its founder, the late Peter Fong (“PF”), is the father of the applicant, Carolyn Fong Wai Lyn (“Carolyn”), who is a director and shareholder of Airtrust. On the other hand, the Defendant, Linda Kao Chai-Chau (“Linda”), was appointed the managing director of Airtrust some time back in 1996. 3       After PF passed away on 25 April 2008, Carolyn took on a more active role in Airtrust’s affairs. Upon doing so, she discovered a potential claim against Linda for breach of fiduciary duty in respect of certain transactions that had been diverted away from Airtrust. Given the fact that Carolyn was only a minority shareholder and did not have effective control over the board of Airtrust, she decided to obtain leave to institute a derivative action on behalf of the company against Linda in respect of those alleged breaches. 4       In Originating Summons No 505 of 2010 (“OS 505/2010”), Carolyn instituted proceedings to obtain leave pursuant to s 216A of the Companies Act (Cap 50, 2006 Rev Ed) (“CA”). At first instance, the High Court ruled in favour of Carolyn (seeFong Wai Lyn Carolyn v Airtrust (Singapore) Pte Ltd and another[2011] 3 SLR 980). In the written judgment, Judith Prakash J acknowledged that there was no dispute that PF had been the controlling mind and will of Airtrust until his demise in 2008 (at [3]). At that point in time, apart from Linda who was the managing director, the Board also comprised Carolyn, Evelyn Ho, Dennis Atkinson, Anthony Stiefel and Chia Quee Khee. Anthony Stiefel was said to be Carolyn’s nominee whilst Evelyn Ho was said to have worked closely with Linda. After reviewing the affidavits and submissions of the parties, Prakash J found that Carolyn had a reasonable basis for a few of the complaints in relation to certain business opportunities and that there was “some semblance of merit” in the potential claims against Linda (at [43]). On this basis, Carolyn was granted leave to commence derivative proceedings on behalf of Airtrust in those areas. The decision of the High Court was subsequently affirmed by the Court of Appeal. Thereafter, the derivative action of S 477/2012, which is controlled by Carolyn, was commenced against Linda. This will be referred to as the “Derivative Action”. 5       On 17 January 2012, Ernst & Young was appointed RMs of Airtrust pursuant to Consent Order No 203 of 2012 (“ORC 203/2012”). Initially, Carolyn had applied for,inter alia, BDO LLP to be appointed as RMs to control and manage the affairs of Airtrust. This was opposed by Linda and in the course of the hearing before Woo Bih Li J, the parties sought an adjournment to explore the opportunity of reaching a mutual agreement on who should be appointed as RMs. This eventually culminated in ORC 203/2012, in which both parties agreed to the appointment of Ernst & Young as the RMs of Airtrust. It bears noting at this juncture that para 3 of ORC 203/2012 stated clearly that: The prosecution of the matters for which leave has been granted by the High Court and the Court of Appeal in OS 505/2010 to the 1stDefendant shall remain with the 1stDefendant … 6       Subsequent to their appointment, the RMs took the view that there was evidence of other diversions of business that were not the subject of the Derivative Action controlled by Carolyn. These transactions were said to have occurred mainlyafterthe death of PF. As a result, the RMs commenced Suit No 1015 of 2012 (“S 1015/2012”) against Linda and 15 others for alleged conspiracy and breach of fiduciary duty. This will be referred to as the “RM Action”. 7       In both the Derivative Action and the RM Action, themodus operandiof the alleged breaches is similar. However, the identified transactions in each suit were different. Nonetheless, the defence run by Linda in both suits is similar — that her actions were undertaken on the directions and with the consent of PF both before and after his demise in 2008. It bears noting that different law firms have been engaged to represent Airtrust in these two actions. 8       In relation to the RM Action, Linda commenced third party proceedings against the estate of PF on 19 April 2013. In response, the RMs made an application to set aside the third party proceedings. After the hearing on 19 July 2013, the learned Assistant Registrar held that Linda was not allowed to bring third party proceedings against the estate of PF in both the Derivative Action and the RM Action. Linda appealed against the decision of the Assistant Registrar and the appeals were heard before me on 2 September 2013 and 11 October 2013. I have allowed Linda’s appeals and the reasons for my decision have been set out in a separate judgment.",
        "The current application": "9       Shortly after the appeals in respect of the third party proceedings were heard, Carolyn took out the current application and this was heard on 4 November 2013. The principal prayer sought by Carolyn was for the control and conduct of the Derivative Action to be continued by the RMs. The alternative prayer was for directions to be given in relation to the conduct of the Derivative Action, in light of the commencement of the RM Action. This includes directions as to representation and funding. 10     In the written submissions tendered by Carolyn, a few points were raised in favour of transferring the control and conduct of the Derivative Action to the RMs. At the outset, it was argued that both the Derivative Action and the RM Action ran parallel to each other and that both actions have been directed to be heard back to back before the same judge. Apart from that, it was also argued that themodus operandiand allegations raised in both actions were identical, save that the specific transactions to which they relate to were different. As mentioned above, the defence raised by Linda in respect of both claims is also similar — that she had acted with the consent and under the directions of the late PF, who was then the Chairman and majority shareholder of Airtrust. 11     Furthermore, Carolyn also advanced arguments in respect of the disadvantages involved with engaging two sets of solicitors for similar proceedings concerning the rights of the same company. First, she raised the danger of a disconnect developing between the different parties prosecuting claims on behalf of Airtrust, such that it would be better for one party, that is, the RMs, to have conduct of both the Derivative Action and the RM Action. In this vein, Carolyn highlighted the conflicting positions adopted by both parties vis-à-vis PF’s status as analter egoof Airtrust — in the RM Action, it wasdeniedthat PF was thealter egoof Airtrust, whereas this point was simplynot admittedin the Derivative Action such that Linda is put to strict proof thereof. Nonetheless, it appears, in both the Derivative Action and the third party proceedings, that PF was at least the controlling mind of Airtrust up until his demise in 2008. 12     Moreover, Carolyn contended that the need to obtain the consent of the RMs in respect of access to the documents of Airtrust has increased the costs and burden on her. Furthermore, Carolyn argued that she has been personally prejudiced in that she “is effectively expending monies (which are substantial) to prosecute the [c]ompany’s claim”. In this respect, it has been further contended that Carolyn has been forced to bear the costs of conducting the Derivative Action without a guaranteed indemnity from Airtrust, even though she only has a 6.2% shareholding in Airtrust and therefore “stands to gain very little personally from even a successful disposal of the matter”. To this end, Carolyn alleges that Linda’s strategy has been to expand the dispute and drive up costs. 13     Furthermore, Carolyn has also pointed to the change in the dynamics of Airtrust in support of her current application. Previously, when Carolyn sought leave to bring the Derivative Action, there was no other representative who was willing or able to prosecute claims on behalf of Airtrust against Linda. This can be contrasted with the present situation where the RMs have been appointed to manage the affairs of Airtrust and to this end, they have taken an independent view that there is evidence in support ofotherclaims for conspiracy and breach of fiduciary duty. Thus, Carolyn contended that it was patently unfair and unjust that she should singlehandedly shoulder the burden when there exists a more economical alternative of letting the RMs conduct the Derivative Action. In this regard, Carolyn has also submitted that Linda will not suffer any prejudice if control of the Derivative Action is handed over to the RMs. On the contrary, she has argued that Linda would benefit from greater clarity and potential costs savings in the event that the RMs control both the Derivative Action and the RM Action.",
        "The issues": "14     Essentially, the application raises the following core issues: (a)     whether control and conduct of the Derivative Action should be transferred to the RMs; and (b)     whether directions for the funding of the Derivative Action should be granted in view of the commencement of the RM Action.",
        "Issue 1: Control and Conduct of the Derivative Action": "15     At the outset, whilst it is acknowledged that the burden of carrying on the Derivative Action does indeed lie solely on Carolyn’s shoulders, this court is bound to comment that this was her decision which she was prepared to fight for even up to the Court of Appeal. Thus, the notion of costs, expenses, time and inconvenience that will accompany the Derivative Action is a fact that Carolyn must have been privy to right from the start. Indeed, any claimant who commences a legal suit will face similar burdens, subject of course to any costs award in her favour should she be successful at trial. Whilst it is true that at the time leave was obtained to commence the Derivative Action, the RMs had not been appointed and Carolyn may have had genuine concerns as to who was to defend Airtrust’s interests given the nature of the allegations against its managing director, it is nevertheless noted that the RMs in this case have not stated whether they are in fact prepared to take over control of and to continue with the Derivative Action. In this regard, Linda has also highlighted the fact that the RMs do not agree that there will be a significant saving of costs if they were to control both actions. This will be elaborated further below. 16     The inconvenience of having to seek the RMs’ consentvis-à-visaccess to the relevant documents of Airtrust is also not a sufficient ground for this court to order the RMs to take over control of the Derivative Action. In this vein, it is noted that Prakash J in OS 505/2010 included an express direction that: [Carolyn] be granted access to the Company’s books, records and documentations to ascertain the full nature and consequences of the breaches of directors’ and fiduciary duties by the Director whether committed solely or in conjunction with any person(s) for the purposes of prosecuting the Company’s claim in this Action. If Carolyn has any misgivings with regard to the access that has been granted to her by the RMs, the more appropriate avenue would be for her to enforce the order granted above by the learned judge. 17     In any case, I would add that in the event the RMs are ordered to take over control of the Derivative Action, it would not be right to order that theymustcontinue with the action if they choose not to do so because, for instance, they take a different view on the alleged transactions. It would be absurd if the RMs were to have conduct of the Derivative Action but still be subject to the direction of Carolyn at the same time. In this regard, it must be emphasised that this court is not saying that there has been any indication that the RMs adopt this view or that Carolyn will seek to “direct” the conduct of the Derivative Action in the background. There is, of course, nothing to stop Carolyn from discontinuing the Derivative Action if she wishes to do so (subject to and in accordance with the applicable provisions and rules). If she does discontinue the action, it would be up to the RMs to take an independent view as to whether there are sufficient grounds to prosecute a claim in respect of those transactions and to then seek leave, if need be, to include those transactions in the ongoing RM Action. In the present circumstances, especially if one takes into account the fact that the RMs have not stated their agreement or desire to take over control of the Derivative Action, I see little merit in the application thus far. 18     In arriving at the decision, this court has also taken into account the point raised by Carolyn that even though themodus operandibehind the complaints in respect of both the Derivative Action and the RM Action is the same or broadly similar, there is a danger of inconsistent positions being adopted by the different parties controlling the two actions. One such area concerns the question as to whether PF was, both in fact and in law, thealter egoor controlling mind and will of Airtrust and the extent to which his consent serves to “protect” Linda from,inter alia, the complaints of breach of fiduciary duties. This clearly is a matter for the relevant parties to resolve. In any case, it is apparent that the two suits concern alleged diversions of business occurring at largely different time periods, includingafterPF’s demise. That being so, it will not necessarily be inconsistent for Airtrust to assert that PF was only thealter egofor some of the time periods in question. In saying this, this court is not commenting on whether PF was thealter egoor controlling mind and will at any particular stage, although it is noted that Prakash J, in granting leave to commence the derivative proceedings against Linda, did state that there was no dispute over the fact that PF was at leastbeforehis demise the controlling mind and will of Airtrust (at [3]). As regards the issue of whether PF’s instructions and personality was such that he continued to be the controlling mind and will of Airtrust evenafterhis demise (possibly through his Estate) was not something that the learned judge had to consider. 19     Moving on, one point which has arisen in the current application concerns whether any of the previous orders made in the course of proceedings have dealt with the issue as to who was to have control of the Derivative Action. The two orders in question are as follows: (a)     ORC 203/2012 dated 17 January 2012: This was the consent order recorded before Woo J to appoint the RMs to take over the management of Airtrust. Paragraph 3 of ORC 203/2012 stated that “[t]he prosecution of the matters for which leave has been granted by the High Court and Court of Appeal in OS 505/2012 to [Carolyn] shall remain with [Carolyn]”. (b)     ORC 4560/2012 dated 29 August 2012: This order of court, also issued by Woo J, referred to ORC 203/2012 and clarified the powers of the RMs so as to enable the RMs “to commence any action against any person or defend any action subject to paragraph 3 of ORC 203”. The order specifically stated that: … for the avoidance of doubt, the Receivers and Managers are granted the power to commence any action against any person or defend any action, butnot to prosecute the matters in paragraph 3 of ORC 203. [emphasis added] 20     In this regard, Linda has submitted that prior to ORC 203/2012, the board of Airtrust (comprising Linda, Carolyn and 3 other directors) were not able to agree on the commencement of legal proceedings against Linda. In these circumstances, Carolyn sought leave to bring derivative proceedings on behalf of Airtrust against Linda in May 2010. Whilst the issue as to whether leave should be granted was before the courts, some other significant events had taken place. The events are set out in the summary below, based on the sequence of events provided in Linda’s written submissions of 1 November 2013: (a)     On 1 June 2010, Carolyn circulated a notice for an extraordinary general meeting (“EGM”) for the consideration of,inter alia, the removal of Linda as the managing director of Airtrust. (b)     On 11 June 2010, Linda responded by bringing Suit No 428 of 2010 against Carolyn and others in which she obtained an injunction to prevent the holding of the EGM. (c)     On 5 January 2012, Carolyn applied, by way of Summons No 49 of 2012 (“SUM 49/2012”), for an order that BDO LLP be appointed to manage the affairs of Airtrust on the basis that the board could not carry out its business given the divisions that had arisen. (d)     On 11 January 2012, the hearing of SUM 49/2012 before Woo J is adjourned to enable the parties to reach a mutual agreement on a draft order for the appointment of the RMs. (e)     On 17 January 2012, the Consent Order, ORC 203/2012, is granted by Woo J whereby Ernst & Young was appointed as the RMs to manage and carry on the business of Airtrust in place of the Board. In this regard, paragraph 3 of the Consent Order stated that the prosecution of the matters for which leave was granted by the High Court and Court of Appeal (ie, the Derivative Action) “shall remain with [Carolyn]”. (f)     On 20 July 2012, Carolyn applied, by way of Summons No 3637 of 2012 (“SUM 3637/2012”), for an order that the RMs be granted leave to institute proceedings against Linda in respect of “such causes of action as the [RMs] may propose” and that the powers of the RMs be “varied and extended to enable them to institute any other or further proceedings as they deem fit”. 21     It appears that SUM 3637/2012 was necessary to clarify the extent to which the RMs were authorized to bring proceedings against Linda. In that application, the question as to whether the RMs should have control over both the Derivative Action and the RM Action was put by Carolyn before Woo J on the basis that it was logical for the RMs to have control of both proceedings in the name of Airtrust. After hearing the arguments from both parties, Woo J agreed that the powers of management of the RMs should include the power to commence proceedings. Nonetheless, the learned judge also expressly set out, in ORC 4560/2012, that this did not include the prosecution of the Derivative Action. 22     In light of the foregoing summary, Linda’s argument is that the application for the transfer of the conduct and control of the Derivative Action to the RMs is an abuse of process and is in any case contrary to the agreement that culminated in the Consent Order appointing the RMs (ie, ORC 203/2012). To this end, it has been argued that the present application amounts to a unilateral attempt to vary the terms of the Consent Order. The Consent Order was said to represent a real contract between Linda, Carolyn and Airtrust. It is said that Linda had agreed to the appointment of the RMs on the basis that the RMs would not be involved in or use the resources of Airtrust to prosecute the Derivative Action. In this regard, reliance has also been placed on the principle that where a consent order represents a “real contract” between the parties and is recorded before the court, the court should only vary or set aside the consent order pursuant to ordinary principles of contract law (seeLow Heng Leon Andy v Low Kian Beng Lawrence (administrator of the estate of Tan Ah Kng, deceased)[2011] SGHC 184,Wiltopps (Asia) Ltd v Drew & Napier and another[1999] 1 SLR(R) 252 andWellmix Organics (International) Pte Ltd v Lau Yu Man[2006] 2 SLR(R) 117). Nevertheless, it is reasonably clear that even in the case of a contractual consent order, the Court retains the residual discretion to vary its terms where this is necessary to prevent injustice. This is especially so where the court is dealing with a “consent unless” order, which if not adhered to, will deprive a party of its rights. 23     In arriving at my decision, I accept that even in the case of a contractual consent order, the Court retains the residual discretion to vary or set aside the terms of the consent order. After all, O 92 r 4 of the Rules of Court (Cap 322, R 5, 2006 Rev Ed) (“ROC”) states that nothing in the ROC “shall be deemed to limit or to affect the inherent powers of the Court to make any order as may be necessary to prevent injustice or to prevent an abuse of the process of Court”. Whether a distinction is to be made between a contractual “consent unless” order and other forms of contractual consent order is not a matter which this court must rule on today. Suffice it to say that in the interests of justice, greater care must be taken in those cases where the court is dealing with a “consent unless” order. Whilst it is not entirely clear as to whether the parties had in fact entered into a contract with a term that the RMs were to be excluded from prosecuting the Derivative Action, the issue of control and conduct of the Derivative Action had been put before Woo J in SUM 3637/2012. Even if the specific issue was not directly raised in the summons itself, it had been dealt with in Carolyn’s skeleton submissions tendered for the purposes of those proceedings. As alluded to above, whilst Woo J had agreed that the RMs’ powers of management should include the power to commence legal proceedings, the learned judge also expressly provided in ORC 4560/2012 that this did not include the prosecution of the Derivative Action. 24     Thus, in respect of ORC 203/2012, Linda has raised the argument that the Consent Order should not be varied save on exceptional grounds as it is effectively a contractual consent order that was agreed upon by all relevant parties. In the case of ORC 4560/2012, arguments have also been made to the effect thatres judicataor issue estoppel applies on the basis that the question of the control and conduct of the Derivative Action had already been addressed and decided by Woo J. 25     In respect of Linda’s arguments, whether or notres judicataor issue estoppel applies is not a matter which must be decided today. The conclusion that this court has arrived at is that even if there exists a discretion (residual or otherwise) to visit or revisit the question of control and conduct of the Derivative Action, it is this court’s decision that Carolyn has not, in any event, made out a case for the order that she now seeks. 26     The reasons are as follows. First, to the extent that the burden of costs incurred is the reason for this application, this court notes that the question of time and expense must have been a factor to which Carolyn would have taken note of when she decided to seek leave in commencing the Derivative Action (together with other factors, such as the apparent strength of the claim). Even if the Derivative Action is for the benefit of Airtrust as a whole, the fact remains that it was Carolyn who decided to undertake the Derivative Action on behalf of Airtrust. Second, the question of costs, including interim payments, was a matter which could have been raised before the court that granted leave to institute the Derivative Action. However, as mentioned above, the order of Prakash J was to reserve the question of costs to the trial judge. That was surely an order that the learned judge was fully entitled to make on the facts of the case. Third, there is insufficient evidence before this court to demonstrate that Carolyn is in a financially strained position so as to affect her ability to continue the prosecution of the Derivative Action. Fourth, the RMs, whilst not taking a position on whether they should take over the control and conduct of the Derivative Action, have clearly stated that there would be no overall cost savings if the current application is to be allowed. This appears to be largely because the solicitors representing Airtrust in respect of the RM Action will not be able to act in respect of the Derivative Action due to issues of conflict, which will be elaborated in detail below. Fifth, if the RMs were required to take control and conduct of the Derivative Action, it would only be right that they should also have the right to decide whether it is in the interests of Airtrust to continue with the suit. Sixth, the dispute between the parties has been dragging on for a considerable length of time now and there will inevitably be further delays if the transfer is granted. In this regard, this court must take into account the fact that further delays may prejudice Linda and possibly even Airtrust. Based on the reasons above, I am not satisfied that the control and conduct of the Derivative Action ought to be transferred to the RMs.",
        "Issue 2: Directions for Funding": "27     I now turn to deal with the question on the costs and expense of conducting the Derivative Action. In her submissions, Linda asserted that this was a matter which had already been addressed by Prakash J when leave was granted to commence the Derivative Action. The learned judge was of the view that the issue of costs in relation to the Derivative Action should be reserved to the trial judge. It bears noting that in that particular hearing before Prakash J, Carolyn had, apart from applying for leave to commence the Derivative Action, also prayed for an order that Airtrust pays costs of the action on an indemnity basis. In her decision, the learned judge only granted the application in part as the prayer for Airtrust to pay costs on an indemnity basis was not granted. Instead, the order was such that the issue of costs “shall be reserved to the trial Judge hearing the action”. 28     In this respect, counsel for Linda has pointed out that s 216A of the CA gives the court power to order the company to pay the complainant costs of the derivative action and/or to pay interim costs of the proceedings pending trial. It was further submitted that followingIntercontinental Precious Metals Inc v Cooke[1994] WWR 66 andJohnson v Meyer[1987] CLD 1400, the relevant factors include: (a)     the financial position of the complainant; (b)     whether the complainant stands to benefit from the action; and (c)     the need to encourage the complainant to conduct the proceedings in a prudent manner. In light of the above, it was submitted that Prakash J had the opportunity to assess these factors but eventually decided to reserve the question of costs to the trial judge. It was also argued that during the appeal on 15 September 2011, the Court of Appeal had affirmed the decision of Prakash J on costs when it ordered: Save as stated here, the Judge’s orders on costs for the proceedings below are to stand. The usual consequential orders are to follow. 29     Whilst counsel for Linda has rightly pointed out that the costs order of Prakash J was affirmed by the Court of Appeal, it is not immediately apparent from the judgment of Prakash J as to whether s 216A(5) of the CA was specifically addressed. Nevertheless, this court notes that there is no evidence that Carolyn is unable to finance the continuation of the Derivative Action to which she sought leave to bring. Furthermore, the question of interim costs was something which Carolyn could have raised earlier (if she did not) at the stage when leave to commence the Derivative Action was being sought. Therefore, I am not satisfied that the question of costs is relevant to the issue of whether an order should be made to transfer control and conduct of the Derivative Action to the RMs. In any event, I am not satisfied that there exist sufficient grounds to disturb or vary Prakash J’s decision to reserve the issue of costs to the trial judge hearing the Derivative Action. 30     Finally, it bears repeating that the solicitors for the RMs have, by a letter dated 19 September 2013, responded to a query from Linda’s solicitors, that if the RMs were ordered to take control of the Derivative Action, the current solicitors would not be able to represent the RMs in prosecuting the Derivative Action on account of a potential conflict of interest. In that eventuality, a different set of solicitors would have to be appointed to act for the RMs if they were required to take control and conduct of the Derivative Action. This would likely involve additional costs being incurred. As for the RMs’ position on whether they should take over control and conduct of the Derivative Action, the RMs responded that they would leave that decision to this court. In saying this, the RMs stress that they were not parties to the consent order, ORC 203/2012, which states that Carolyn was to have control and conduct of the Derivative Action.",
        "Conclusion": "31     Thus, for the reasons set out above, the application is dismissed in its entirety. The usual costs orders apply. Costs for the application are to be agreed or taxed."
    }
}