{
    "case_title": "Muthukumaran s/o Varthan and another\n      v\n      Kwong\nKai Chung and others",
    "ncitation": "[2014] SGHC 204",
    "coram": "Lee Kim Shin JC",
    "sections": {
        "Introduction": "1       The\nmain issue in Originating Summons No 896 of 2013 (“OS 896”) was\nwhether the owners of a two-storey shop-house, which did not have\na staircase built within their unit, had an implied easement of\na right of way over the staircase of the adjacent unit under s 99(1A)\nof the Land Titles Act (Cap 157, 2004 Rev Ed) (“the LTA”). 2       On\n30 June 2014, I dismissed OS 896 because the First and Second Plaintiffs\n(collectively “the Plaintiffs”) had failed to establish that the\nalleged easement was set apart or appropriated on the subdivision\nplan that was submitted to the authorities, as required by s 99(1A)\nof the LTA. I ordered that the Plaintiffs pay the First and Second\nDefendants’ costs, fixed at $10,000 plus reasonable disbursements,\nand the Third Defendant’s costs, also fixed at $10,000 plus reasonable\ndisbursements. I gave the Plaintiffs liberty to apply if complications\narose while building a staircase in their shop-house. 3       The\nPlaintiffs have filed an appeal against my decision. I therefore\nset out the grounds for my decision.",
        "Background": "4       The\nPlaintiffs are the joint registered proprietors of the property known\nas No 21 Madras Street, Singapore (“No 21”). The First and Second Defendants\nhave been the joint registered proprietors of the property known\nas No 23 Madras Street, Singapore (“No 23”) since 16 July 2010.\nThe Third Defendant was the registered proprietor of No 23 from\n1995 to 2010 when it was transferred to the First and Second Defendants. 5       No\n21 and No 23 are part of a row of four two-storey conservation shop-houses\nin the Little India area (these four shop-houses, collectively, “the\nProperties”). The other two Properties in the row are No 17 Madras Street,\nSingapore (“No 17”) and No 19 Madras Street, Singapore (“No 19”). Each\nof the Properties stands on a separate lot and has a separate Certificate of\nTitle. 6       The\nProperties were all originally purchased by the Third Defendant on\n22 November 1993 following a successful tender concluded on 27 August\n1993 with the Singapore Government. The Third Defendant’s undisputed\nevidence was that none of the Properties had a permanent staircase\nat the time the Third Defendant purchased the Properties. Rather, each\nof the Properties only had a bare ladder. 7       In\n1995, the Third Defendant submitted plans to the Building and Construction\nAuthority (“BCA”) and the Urban Redevelopment Authority (“URA”)\nfor approval to carry out Addition and Alteration Works on the Properties.\nThe scope of these works included: (a)     The\nbuilding of two new timber staircases, one being inside No 19 and\nthe other being inside No 23. (a)     I\nshall refer to the staircase inside No 23 as “the No 23 Staircase”. (b)     The\ndemolition of a portion of the firewalls on the ground floor between\nNo 17 and No 19, and on the ground floor between No 21 and No 23,\nto allow access between the units at the ground level. (c)     The\ndemolition of a portion of the firewalls on the upper floor between\nNo 17 and No 19, and on the upper floor between No 21 and No 23,\nto allow access between the units at the upper level. (b)     I\nshall refer to the upper floors of No 21 and No 23 as “No 21A” and\n“No 23A” respectively. 8       The\nplans were approved by the BCA and the URA on 4 May 1995 and 20\nJune 1995 respectively. Thereafter, the Addition and Alteration Works\nwere carried out and completed by the Third Defendant. Notably, No\n17 and No 21 continued to have no staircase access to their upper\nfloors as this was not covered by the scope of the works, but this\nalso meant that No 17 and No 21 retained relatively larger floor\nareas. However, it would appear from the plans that access to No\n21A could be obtained by using the No 23 Staircase and the opening\nbetween No 21A and No 23A created by the demolition of a portion\nof the firewalls separating them. 9       On\n3 June 2004, the Plaintiffs purchased No 21 from the Third Defendant\nfor $435,000. The transfer of No 21 to the Plaintiffs was registered\non 10 November 2004. The Plaintiffs acquired No 21 subject to an\nexisting tenancy agreement. At that time, and sometime until February 2010,\nthe Plaintiffs’ tenant was also occupying No 19. The Third Defendant claimed\nthat when the Plaintiffs purchased No 21, the Plaintiffs were informed\nthat there would be no staircase access to No 21A. Rather, the Plaintiffs\nwould be required to build their own staircase. The Plaintiffs denied\nbeing informed of this. 10     What\ntranspired between 2006 and 2010 was disputed. The Plaintiffs claimed\nthat both they and their tenant were able to use the No 23 Staircase to\ngain access to No 21A without incident during this time. It was\nonly when their tenant moved out in February 2010 that they discovered\nthat the lock on the doorway to the No 23 Staircase had been changed.\nThe Plaintiffs also claimed that they discovered that the opening\nbetween No 21A and No 23A had been boarded up with wooden planks\nand sealed sometime in August 2010. 11     The\nDefendants, on the other hand, claimed that the opening between No\n21A and No 23A had been boarded up since March 2006. It would appear\nthat the Plaintiffs’ tenant in No 21 was able to gain access to\nNo 21A by using the staircase in No 19 (which the tenant was also\noccupying) instead. 12     It\nsuffices to state that there was a flurry of correspondence between the\nPlaintiffs and the Third Defendant between February 2010 and June 2010,\nwith the Plaintiffs asserting their right to use the No 23 Staircase\nand the Third Defendant denying that the Plaintiffs had such a right. 13     On\n19 April 2010, the First and Second Defendants purchased No 23 from\nthe Third Defendant for $640,000. The transfer of No 23 to the First and\nSecond Defendants was registered on 16 July 2010. 14     Shortly\nafter this and sometime in late July or early August 2010, the First\nDefendant received a call from the First Plaintiff. During the call,\nthe First Plaintiff alleged, amongst other things, that the No 23\nStaircase was a common staircase and meant to be shared by the proprietors\nof No 21 and No 23. The First Plaintiff demanded that he be granted\naccess to the No 23 Staircase. The First Defendant refused to accede\nto the First Plaintiff’s demand. 15     On\n5 August 2010, the First Plaintiff wrote to the Singapore Civil Defence\nFire Safety Licensing & Enforcement Unit (“the Civil Defence”)\nto complain that he was unable to access No 21A and was concerned\nabout fire safety issues. The Civil Defence carried out an inspection\nat No 23 on 11 August 2010. They found that the boarding up of the\nopening between No 21A and No 23A was a violation of fire safety\nregulations. 16     On\n13 August 2010, the Civil Defence wrote to the First and Second Defendants\nto inform them that a fine of $500 would be imposed on them. In\nthe same letter, the Civil Defence advised the First and Second Defendants\nto remove the boarding or to apply for approval if they wished to\ncontinue boarding up the opening. On 25 March 2011, the Civil Defence approved\nthe First and Second Defendants’ application for the boarding up of\nthe opening between No 21A and No 23A. 17     On\n12 April 2011, the URA wrote to the First and Second Defendants to\nsay that the URA’s approval ought to have been obtained before the opening\nwas boarded up because No 21 was a conservation building. Nothing\ncame of this letter eventually. The First and Second Defendants did\nnot obtain the URA’s approval. 18     On\n2 August 2013, more than two years after the Plaintiffs last asserted\na right of way over the No 23 Staircase, the First and Second Defendants\nreceived a letter from the Plaintiffs’ solicitors saying that the Plaintiffs\nwould be commencing proceedings against them. 19     On\n8 October 2013, the Plaintiffs filed OS 896 against all three Defendants. 20     Thereafter,\non 10 December 2013, the Plaintiffs’ solicitors wrote to the URA\nto enquire whether the First and Second Defendants had since obtained\nthe URA’s approval to board up the opening. The URA replied on 16\nDecember 2013 to indicate that the First and Second Defendants had not.\nThe URA also stated that they had emailed the First Defendant on\n26 August 2013 to suggest that he resolve the matter of the use\nof the No 23 Staircase with the Plaintiffs first before making a\nsubmission for approval to seal up the opening between No 21A and\nNo 23A.",
        "OS 896": "21     In\nOS 896, the Plaintiffs claimed, in the main, the following reliefs: (a)     A\ndeclaration that by reason of s 99(1A) of the LTA, the Plaintiffs,\nas owners of No 21, were entitled to an easement of a right of way\nover the No 23 Staircase to enable access to No 21A for all purposes\nand reasons. (b)     An\ninjunction restraining the First and Second Defendants from interfering\nwith the Plaintiffs’ reasonable enjoyment of the said right of way\nover the No 23 Staircase. (c)     Damages\nfor losses suffered by the Plaintiffs by reason of all three Defendants\ndenying the Plaintiffs use of the No 23 Staircase to access No 21A. (d)     An\norder that the First and Second Defendants reinstate the opening\nbetween No 21A and No 23A as shown in the plan approved by the URA\non 20 June 1995. 22     The\npivotal issue in OS 896 was whether s 99(1A) of the LTA entitled the\nPlaintiffs to the easement claimed. If it did not, the Plaintiffs’\nclaims for the other reliefs would fall away.",
        "My Decision": "23     Section\n99 of the LTA, insofar as it is material to the case, reads: Implied\neasements for right of way and other rights shown in subdivision plan 99.—(1) Where the competent\nauthority hasapproved the development and subdivision\nof any land comprised in an estatebefore\nor after1st March 1994and the\nsubdivision plan has been submitted to the competent authority,\nthere shall be implied, in respect of each lot of the estate which\nis used or intended to be used as a separate tenement, in favour\nof the registered proprietor of the lot and as appurtenant thereto,\nall the easements referred to in subsection (1A). (1A)  The\neasements which shall be implied under subsection (1) are all such easements\nof way and drainage, for party wall purposes and for the supply\nof water, gas, electricity, sewerage and telephone and other services\nto the lot on,over or under the lands appropriated\nor set apart for those purposes respectively on the subdivision\nplan submitted to the competent authorityrelating to\nthe estate,as may be necessary for the reasonable\nenjoyment of the lot and of any building or part of a building at\nany time thereon. … [emphasis added in bold italics] 24     It\nis evident from the language of s 99(1) and s 99(1A) that these statutory\nprovisions have no application unless the competent authority has approvedboththe development and subdivision of\nthe land over which the easement is claimed. In this regard, the\nsubdivision plan must also be submitted to the competent authority. 25     InManagement Corporation Strata Title Plan No 549 v\nChew Eu Hock Construction Co Pte Ltd[1998] 2 SLR(R)\n934 (“Chew Eu Hock Construction”),\nthe Court of Appeal clarified (at [31]) that s 99(1) of the LTA\ndid not require both development and subdivision approvals to be given\nsimultaneously. Hence, the Court of Appeal held that s 99(1) applied in\nthe case before it even though development approval had been granted almost\n10 years before subdivision approval. Likewise, inCheng-Wong\nMei Ling Theresa v Oei Hong Leong[2006] 2 SLR(R) 637\n(“Oei Hong Leong”), the Court of\nAppeal reiterated (at [47]) that there was no need to show a link\nbetween subdivision approval and development approval before an easement\ncould be implied under s 99(1). 26     On\nthe facts of the present case, I was satisfied that the approvals\nthe Third Defendant received from the BCA and the URA (see [7] above),\nfor the Addition and Alteration Works to be carried out on the Properties,\nfell within the meaning of “development approval” under s 99(1).\nIn this regard, I was guided by the broad definition of “development”\nunder the Planning Act (Cap 232, 1998 Rev Ed) which includes the\n“carrying out of any building, engineering, mining, earthworks or\nother operations in, on, over or under land”. 27     However,\nit was obvious to me that the true disagreement between parties\nconcerned the issue of whether, and more importantly when, subdivision\napproval had been granted in respect of the Properties. 28     Counsel\nfor the Plaintiffs, Mr George Pereira (“Mr Pereira”), submitted\nthat subdivision of the land on which the Properties were situate had\noccurred on 19 June 1997. This wasafterthe\nBCA and URA had approved the Third Defendant’s plans to carry out\nthe Addition and Alteration Works on the Properties. Mr Pereira\nsaid that the present case was akin toChew\nEu Hock Constructionwhere subdivision had occurred after\ndevelopment approval was obtained (see [25] above). To make good these\ncontentions, Mr Pereira referred me to the Certified Plan for Lot\nNo TS 16-881P (ie, the lot on which\nNo 23 was situate) dated 19 June 1997 (“the 1997 CP”). According\nto Mr Pereira, the 1997 CP was the subdivision plan contemplated\nby ss 99(1) and 99(1A) of the LTA. 29     Mr\nPereira’s submissions were untenable on two grounds. First, Mr Pereira\nwas mistaken in his belief that the 1997 CP was the “subdivision plan”\ncontemplated by ss 99(1) and 99(1A) of the LTA. As counsel for the Third\nDefendant, Mr Krishnasamy Siva Sabmo, correctly pointed out, the 1997\nCP was nothing more than a survey which showedpre-existingsubdivided\nlots. It was not a plan submitted to the competent authority for subdivision\napproval. 30     The\nsecond reason, which is related to the first, was that it was plain from\nthe title documents adduced in evidence that subdivision of the\nland into the lots upon which the Properties are currently situate\nhad occurredbeforethe Third Defendant\nbecame the registered proprietor of the Properties. In particular,\nI note that when the Certificate of Title for No 21 was registered\nby the Third Defendants on 4 July 1995, No 21 was already situate\non its present lot, that is, Lot No TS 16-882T. The plan of Lot\nNo TS 16-882T dated 6 July 1994 (“the 1994 CP”) that was annexed\nto the Certificate of Title for No 21 also showed that subdivision\nof the land on which the Properties are situate had occurred by\nthat time. For completeness, I should note that I was also satisfied\nthat the 1994 CP was likewise not the subdivision plan contemplated\nin ss 99(1) and 99(1A) of the LTA. 31     It\nfollowed that the Plaintiffs had failed to produce the approved subdivision\nplan in evidence. In this regard, reference may be made toAndrew JohnHanam\nv Lam Vui and another[2013] 4 SLR 554 (“Andrew John\nHanam”) where Belinda Ang Saw Ean J expressed the view\n(at [29]) that: …[I]n my view, the subdivision planmust be tendered in evidenceif there\nis to be any reliance on an easement that is “appropriated or set\napart” on the subdivision plan … [emphasis added] 32     I\nagree with Ang J’s observations. This flows from the plain language of\ns 99(1A) of the LTA which states that an easement will only be implied “over\nor under the landsappropriated or set apart\nfor those purposes respectively on the subdivision plansubmitted\nto the competent authority [emphasis added]”. 33     The\nimportance of having the subdivision plan produced in evidence is\neven clearer when regard is had to the phrase “appropriated or set\napart for those purposes” under s 99(1A). 34     To\nascertain Parliament’s intent in using this phrase, counsel for\nthe First and Second Defendants, Mr Adrian Wong (“Mr Wong”), referred\nto the Report of the Select Committee on the Land Titles Bill (Parl\n3 of 1993) which was presented to Parliament on 18 August 1993 (“the\nReport”). The Report explained the effect of the proposed cl 99(1)\nof the Land Titles Bill (Bill No 36 of 1992) in the following terms\n(at [23]): Clause 99 seeks to imply certain easements\nin respect of parts of an estatewhere the\napproved subdivision plan for the estate containsa legend indicating those easements and the dominant\nand servient tenements. Examples of such easements are\na right of way, a right to make connections to electrical sub-stations\nand party wall rights. By this approach, there is no need to describe\nthe easements in clause 99 as they would be described in the legend.\n[emphasis added in bold italics and underlined bold italics] 35     The\nproposed cl 99(1) was enacted as s 99(1) of the Land Titles Act (Act\n27 of 1993), which is largelyin parimateriawith the present ss 99(1) and\n99(1A) of the LTA. 36     In\nproviding feedback on the proposed Bill, it would appear that the Singapore\nInstitute of Surveyors and Valuers (“the SISV”) had suggested that\nthe type of easements to be implied should be described within the proposed\ncl 99 instead of being set out in a legend endorsed on the approved\nsubdivision plan. The SISV suggested that because the majority of easements\nwere in respect of roads, electrical substations, septic tanks, drainage\nreserves and party walls, the approval of the use of any lot as\na road, or an electrical subdivision and so forth in the subdivision\nplan should imply an easement for corresponding rights of use. However,\nthe Report, in rejecting this suggestion, states as follows (at\n[24]): The Committee sees some merit in the [SISV’s]\napproach. It is, however,not feasible to\nimply a common set of easements for all developments.\nThe Committee therefore recommends that clause 99 describe the common easementsand these will be implied where indicated in the\napproved subdivision plans. [emphasis added in bold italics] 37     Based\non the relevant Parliamentary material, it was clear to me that for\nan easement to be implied under s 99(1) of the LTA, it had to be\nboth clearly and specifically indicated on the approved subdivision\nplan (in the sense that the subdivision plan must contain a legend\ndescribing the easement and the dominant and servient tenements).\nIn these circumstances, I was of the view that the Plaintiffs’ failure\nto produce the subdivision plan was fatal to its case. 38     Against\nthe view stated above, Mr Pereira submitted that the court was entitled\nto look at the development plans to determine whether an easement\nshould be implied under s 99(1) of the LTA. He pointed out that the\nNo 23 Staircase was drawn on the plans approved by the BCA and the URA.\nMr Pereira cited the Court of Appeal decision inOei\nHong Leongas authority for this proposition. 39     InOei Hong Leong, two bungalows were developed\non an undivided lot of land. When they were developed, access to\nthe public road for one of the bungalows (“No 48”) was only through\na short driveway over the land of the other bungalow (“No 48A”).\nThe lot of land on which the bungalows stood was later subdivided\nand each bungalow then stood on a separate lot of land. When the\nCertificates of Title in respect of the subdivided plots were issued,\nno express easement of way was created. A dispute arose as to whether\nthere was an implied easement of way. 40     In\nthis regard, the subdivision plan inOei Hong\nLeongshowed that the word “Access” was written on the\npart of the approved subdivision plan where the northerly part of\nNo 48 abutted No 48A. The approved subdivision plan, however, did\nnot mark out the land over which the access was to run. However,\nthere were plans annexed to the Certificates of Title for No 48\nand No 48A which marked out the part of No 48A which was to be used\nto give access to No 48. These plans showed that the path over which\nthe easement of way was to run had been marked out when the subdivision\noccurred. In these circumstances, the Court of Appeal held (at [33])\nthat it was permissible to refer to the plans annexed to the Certificates of\nTitle and read them together with the subdivision plan. 41     In\nmy view,Oei Hong Leongdid not\nassist the Plaintiffs’ case. The circumstances inOei\nHong Leongwere unlike those in this case as the approved\nsubdivision plan was adduced in evidence inOei\nHong Leong. Moreover, the subdivision plan showed the\nword “Access” where No 48 abutted No 48A. It was in this context\nthat the Court of Appeal held that it would be permissible to read\nthe subdivision plan together with the other plans attached to the\nCertificates of Title. I did not thinkOei\nHong Leongstood for the proposition that the court was\nentitled to, as Mr Pereira seemed to suggest, disregard the subdivision\nplanaltogetherand consider the\ndevelopment plan instead. 42     Even\nif I were wrong on this, in that the court could consider whether the\nalleged easement was “appropriated or set apart” by only relying\non the development plan, the Plaintiffs’ claim remained untenable.\nIn this regard, I agreed with Mr Wong’s submission that s 99(1A)\nof the LTA did not entitle the Plaintiffs to the easement claimed\nmerely because the No 23 Staircase was drawn on the development\nplan. Instead, keeping with the purposive interpretation of the\nphrase “appropriated or set apart” that was discussed above (at\n[34]–[37]), I was of the view that the development plan had toclearly and specifically indicate that the Plaintiffs\nwere to have a right of way over the No 23 Staircase.\nThis requirement was not satisfied in the present case. 43     For\ncompleteness, I proceed to deal with the parties’ submissions as\nto the meaning of the phrase “necessary for the reasonable enjoyment\nof the lot” under s 99(1A) of the LTA. When parties first appeared\nbefore me, their submissions were made on the footing that s 99(1)\nof the LTA had the effect of implying an easement where this was\nnecessary for the reasonable enjoyment of the land. 44     Mr\nPereira, for example, largely glossed over the requirement under s 99(1A)\nthat the easement be “appropriated or set apart…on the subdivision\nplan submitted to the competent authority”. Rather, he framed the\nissue as whether access to the No 23 Staircase was necessary for\nthe reasonable enjoyment of No 21 and No 21A. 45     Mr\nWong, on the other hand, submitted that the English authorities on\nimplied easements at common law shed light on the meaning of the phrase\n“necessary for the reasonable enjoyment of the lot” under s 99(1A) of\nthe LTA. I was first referred to the rule inWheeldon\nv Burrows(1879) 12 Ch D 31 (“Wheeldon”)\nwhich Thesiger LJ stated as follows (at 49): [O]n the grant by the owner of a tenement\nof part of that tenement as it is then used and enjoyed, there will\npass to the grantee all those continuous and apparent easements\n(by which, of course, I meanquasieasements),\nor, in other words,all those easements which\nare necessary to the reasonable enjoyment of the property granted,\nand which have been and are at the time of the grant used by the\nowners of the entirety for the part granted. [emphasis added] 46     InWheeler and Another v JJ Saunders Ltd and Another[1996]\n1 Ch 19 (“Wheeler”), the English\nCourt of Appeal applied the rule inWheeldonbut refused\nto imply an easement on the facts of the case. In that case, the plaintiffs\nhad bought a house that lay adjacent to a farm. The house and the farm\nwere previously in common ownership. There were two routes of access\nto the house. One entered the property from a road eastward of it. The\nother (referred to as “the south entrance” in the quotation below)\nran over the farm (“the Access Strip”). The defendants, who owned\nthe farm, took the view that the plaintiffs were not entitled to\nuse the Access Strip and obstructed access to it. The plaintiffs\ncommenced proceedings against the defendants claiming they had a\nright of way over the Access Strip. In dismissing the plaintiffs’\nclaim, Staughton LJ held (at 25): For my part, I do not consider that the\nsouth entrance was necessary for the reasonable enjoyment of Kingdown\nFarm House. The east entrance would do just as well. It was said\nto be four inches or 10 centimetres narrower than the south entrance.\nThat was not critical. The gate at the south entrance, which was\nusually shut, shows to my mind that it was not the main entrance\nand was probably only used on rare occasions. I would therefore\nhold, differing from the judge, that Dr. and Mrs. Wheeler acquired\nno right of way through the south entrance. 47     InMoncrieff and Another v Jamieson and Others[2007]\n1 WLR 2620, Lord Neuberger explained why it was important to focus\non the requirements of reasonableness and necessity (at [112]): … Without the necessity, there would be\na danger of imposing an uncovenanted burden on the servient owner,\nbased on little more that sympathy for the dominant owner; without\nthe reasonableness, there would be the danger of imposing an unrealistically\nhigh hurdle for the dominant owner. … 48     Mr\nWong also relied on several Australian authorities where the courts\nhad interpreted s 12(2) of the Subdivision Act 1988 (No 53 of 1988) (Vic)\n(“the ASA”). Section 12(2) of the ASA reads as follows: (2)    Subject\nto subsection (3), there are implied— (a)    over— (i)    all\nthe land on a plan of subdivision of a building; and (ii)   that part of a subdivision which\nsubdivides a building; and (iii)   any land affected by an owners corporation;\nand (iv)   any land on a plan if the plan specifies\nthat this subsection applies to the land; and (b)    for\nthe benefit of each lot and any common property— all easements and rights necessary to provide— … (e)    rights\nof way… if the easement or right is necessary for\nthe reasonable use and enjoyment of the lot or the common property\nand is consistent with the reasonable use and enjoyment of the other\nlots and the common property. 49     InBody Corporate No 413424R v Peter James Sheppard\n& Anor[2008] VSCA 118 (“Sheppard”),\nthe Court of Appeal of the Supreme Court of Victoria considered\nthe meaning of the phrase “necessary for the reasonable use and\nenjoyment of the lot” as contained in s 12(2)(e) of the ASA. There, the\nappellant, who was the body corporate of a residential building,\nbrought an action for a declaration that they were entitled to a\nright of way over a penthouse owned by the respondents. Without\nthe easement, the appellant’s service personnel would have to walk\nup sixteen flights of stairs to gain access to the roof of the apartment\nbuilding. If the appellant was entitled to the easement, then the\nservice personnel would be able to take a lift to the respondents’\napartment on the 14th floor and walk through the respondents’ apartment\nto gain access to the fire stairs leading to the roof. 50     The\ncourt inShepparddismissed the\nappellant’s claim for an easement on the ground that it was notnecessaryfor the reasonable use and enjoyment\nof the common area. Although the alleged easement was apreferablemeans of access, the evidence\nshowed that the service personnel could still carry out their tasks\nadequately without using the easement. Pertinently, the court approved\n(at [81]) the trial judge’s view that: … “[N]ecessary” meant that the easement\nwas essential to achieving the specified function, in the sense\nthat no alternative means of achieving the relevant function was\nfeasible or reasonably available. In determining whether an alternative\nto the easement was reasonably available, all relevant circumstances,\nincluding physical factors, legal restrictions, safety considerations\nand cost should be considered. 51     Based\non parties’ submissions and the authorities cited at the first hearing,\nI directed that parties adduce expert evidence on the issue of whether\na staircase could be built within No 21. A site visit to No 21 and\nNo 23 was also conducted. By the final hearing before me, it was\nno longer in dispute that a staircase could indeed be built. To\nthis end, I was satisfied that an easement of way over the No 23\nStaircase would not have been necessary for the reasonable enjoyment\nof No 21. 52     However,\nupon further reflection on the issue, I took the view that the authorities\ncited to me were not helpful in the interpretation of the phrase “necessary\nfor the reasonable enjoyment of the lot” under s 99(1A) of the LTA. 53     Under\nthe rule inWheeldon, easements\narise under English law by way of necessary implication in the circumstances\nof the case. In this respect, the rule inWheeldonis\nregarded as giving effect to the presumed common intentions of the\nparties: Tan Sook Yee, Tang Hang Wu and Kelvin F K Low,Tan Sook Yee’s Principles of Singapore Land Law(LexisNexis,\n3rd Ed, 2009) at p 635. Section 12(2) of the ASA is similar in that\neasements may be implied over subdivided land where the easement\nis necessary for the reasonable use and enjoyment of the land. Unlike\nthe rule inWheeldon, however, easements\nunder s 12(2) of the ASA are probably better regarded as being grounded\nin public policy than the presumed intentions of the parties. 54     In\ncontrast, the easements implied under s 99(1) of the LTA are of\na fundamentally different kind. As I noted earlier (at [42]), easements\nunder s 99(1) of the LTA arise when they are clearly and specifically\nindicated on the approved subdivision plan. In this regard, the\nterminology of an “implied easement” may be somewhat misleading\nbecause s 99(1) effectively requires parties to have expressly demarcated\nthese easements on the approved subdivision plan. Such easements\nare only “implied” to the extent that they are not expressly granted\nand separately registered under the LTA. 55     It\nfollows that the phrase “necessary for the reasonable enjoyment\nof the lot” under s 99(1A) of the LTA must mean something different\nfrom what is stated in the English and Australian authorities I\nhave referred to above. InAndrew John Hanam,\nreference was made toBoglari v Steiner School\nand Kindergarten[2007] VSCA 58 (“Boglari”)\nwhere the Court of Appeal of the Supreme Court of Victoria considered\nthe meaning of the same phrase in s 98 of the Transfer of Lands\nAct 1958 (No 6399 of 1958) (Vic) (“the TLA”). This provision, which\nis very similar to s 99(1A) of the LTA, reads: 98.\nEasements arising from plan of subdivision The proprietor of an allotment of land shown on an approved\nplan of subdivision or a lot shown on a registered plan shall be\nentitled to the benefit of the following easements which shall be\nand shall be deemed at all times to have been appurtenant to the\nallotment or the lot, namely- (a)all such easements of way and drainage and for party\nwall purposes and for the supply of water gas electricity sewerage\nand telephone and other services to the allotment or the lot on\nover or under the lands appropriated or set apart for those purposes respectively\non the plan of subdivision as may be necessary for the reasonable\nenjoyment of the allotment or the lot and of any building or part\nof a building at any time thereon… (b)    … in all respects as if all such easements\nhad been expressly granted. [emphasis added in bold italics] 56     InBoglari, Neave JA (at [30]) interpreted\nthe phrase “necessary for the reasonable enjoyment of the lot” contained\nin s 98 of the TLA in the following manner: … It seems to me that the statutory requirement\nthat the easement of way be necessary for the reasonable enjoyment\nof the lothas a similar effect to the test which\napplies in determining what amounts to reasonable access to the dominant\ntenement, where the easement of way is created by an express grant, which\ndoes not indicate an access or conclusion point for the easement. [emphasis\nadded] 57     I\nfound Neave JA’s reasoning to be persuasive. Like s 98 of the TLA, the\nphrase “necessary for the reasonable enjoyment of the lot” under\ns 99 of the LTA should similarly be read as imposing limits on the\nuse of the easements implied under that section. In contrast to\nthe position under the common law, s 99 should not be interpreted\nas a basis for implying an easement in the first place. The Plaintiffs’\narguments seeking to establish an easement by way of implication\nunder s 99 of the LTA therefore failed in this regard. 58     Finally,\nI note that thesui generisnature\nof easements implied under s 99 becomes more apparent when regard\nis had to the other provisions of the LTA that concern easements. 59     The\nfirst is s 98 of the LTA. InChew Eu Hock Construction,\nthe Court of Appeal noted (at [29]–[30]) that there was considerable\noverlap between ss 98 and 99 of the LTA and described s 98 as dealing\nwith “subdivisionsimpliciter”.\nIn this regard, s 98 operates to imply a specified set of easements\nwhenever there has been a subdivision of land, without the requirement\nthat the easements be “appropriated or set apart” on the approved\nsubdivision plan. However, it would not have assisted the Plaintiffs\nin the present case because the section does not provide for the implication\nof easements of way. 60     The\nsecond provision is s 97(1) of the LTA which reads: Registration\nnecessary for creation of easements 97.—(1) Aneasement\nshall not be acquired over registered land by long-continued user\nadverse to a proprietor, nor by prescription, nor by any presumption\nof a lost grant, nor by any implication of law except as may be provided\nin this Act; but where an easement is intended to be\ncreated, the proprietor may execute an instrument of grant in the\napproved form, or, if the easement is being created incidentally\nto a transfer or lease, by appropriate words in the transfer or\nlease. [emphasis added] 61     Section\n97(1) is pertinent because it largely abrogates the common law relating\nto easements. This was the view of the Court of Appeal inChew Eu Hock Constructionwhere it held\n(at [41]) that s 97(1) did not permit an easement to be created\nby implication under the rule inWheeler,\nexcept where the easements arose before the land was brought under\nthe LTA. 62     I\nconclude with the observation that counsel in future disputes on easements\nunder Singapore law should be mindful that the common law relating\nto implied easements may not be all that helpful in the interpretation\nof s 99 of the LTA. Primacy should be accorded to the statutory\ntext and context of s 99 and the local authorities interpreting\nthis provision.",
        "Conclusion": "63     For\nthese reasons, I dismissed OS 896 in the terms set out at [2] above."
    }
}