{
    "case_title": "Griffin Travel Pte Ltd\n      v\n      Nagender\nRao Chilkuri and others",
    "ncitation": "[2014] SGHC 205",
    "coram": "Chan Seng Onn J",
    "sections": {
        "Introduction": "1       Griffin\nTravel Pte Ltd (“the Plaintiff”) is a travel agency which provides\ntravel services to the marine, offshore and cruise industries.[note: 1]It has two shareholders:\nGriffin Marine Travel (Cyprus) Limited and Griffin Global Group\nLimited (“GGG”). GGG is wholly owned by Griffin Bidco Limited (“Bidco”).\nBidco is in turn wholly owned by Griffin Global Holdco Limited (“Holdco”).\nThe Griffin group of companies (“the Griffin Group”) consists of\nnumerous entities around the world. For simplicity, I will refer to\neach individual entity based on its geographical location,eg, Griffin India. 2       On\n21 November 2011, the Plaintiff commenced proceedings for numerous\nalleged breaches of duties against some of its former employees (“the\nDefendants”), all of whom had resigned between February and September\n2011. The Defendants are: (a)     Mr\nNagender Rao Chilkuri (“Nagender”); (b)     Ms\nJoanna Kaunang (“Joanna”); (c)     Ms\nLeny Widjaja (“Leny”); (d)     Mr\nPereira Rahul Anthony (“Rahul”); (e)     Ms\nGwee Bee Ting Annie (“Annie”); (f)     Ms\nNg Choo Geok Adella (“Adella”); and (g)     Mr\nNarra Gouri Prasad (“Prasad”). 3       The\nPlaintiff’s principal allegation against the Defendants related\nto their involvement in five new companies (collectively, “the New\nEntities”), which were all set up between February and August 2011.\nThe New Entities are: (a)     Quest\nHorizon Pte Ltd (“Quest Horizon”); (b)     Niado\nTechnology Pte Ltd (“Niado”); (c)     BHEA\nTechnologies (“BHEA Tech”); (d)     Q4T\nManagement Pte Ltd (“Q4T Singapore”); and (e)     Quest\nRightshoring Services Pte Ltd (“QRS”). 4       There\nwas also a sixth company, Q4T Management Pty Ltd (“Q4T Australia”),\nwhich was alleged to be linked to Q4T Singapore but was not classified\nas part of the New Entities by the parties. A table containing the dates\nof incorporation, initial shareholdings and directors of the New Entities\n(and Q4T Australia) is appended to this judgment as Annex 1. 5       The\nkey character in these proceedings was Nagender, the managing director\nof the Plaintiff at the material time. He was slated to become the next\nGlobal chief executive officer (“CEO”) of the Griffin Group, but, according\nto the Plaintiff, was eventually found unsuitable for the role.\nThe Plaintiff contended that Nagender was embarrassed, bitter and\nfull of resentment at this turn of events and devised a “masterplan”\nwhich was calculated to damage the Plaintiff.[note: 2]This\nalleged masterplan involved the incorporation of Quest Horizon and\nQRS with a view to competing with the Plaintiff’s business. Niado,\nBHEA Tech, Q4T Singapore and Q4T Australia were set up to supplement\nthis masterplan. The New Entities were asserted to be part of a\nconglomerate with each performing a different function: (a)     Quest\nHorizon would be the holding company of the conglomerate; (b)     QRS\nwould be the outsourcing arm with branches proposed to be set up\nin various countries such as Thailand, the Philippines and India; (c)     Niado\nwould be the information technology (“IT”) and travel software arm; (d)     Q4T\nSingapore together with Q4T Australia would be the travel arm; and (e)     BHEA\nTech would provide the Customer Relationship Management (“CRM”)\nsupport for the conglomerate. 6       The\nPlaintiff also alleged that Nagender engineered the resignations of\nthe Defendants and co-ordinated the incorporation of the New Entities with\na view to competing with the Plaintiff.[note: 3] 7       While\nthe Plaintiff accepted that no competitive activity actually took place\nwhile the Defendants were employed by the Plaintiff, they argued\nthat this was only because the Plaintiff found out about the masterplan\nbefore the Defendants had the opportunity to put it into motion.[note: 4]The\nPlaintiff submitted that the Defendants’ actions in formulating\nand implementing the alleged masterplan amounted to breaches of\nexpress and implied terms of employment by all of them and/or breaches\nof fiduciary duties by some of them.[note: 5] 8       The\nPlaintiff also asserted a number of other independent breaches which\nwere not related to the alleged masterplan.[note: 6] 9       The\nDefendants, on the other hand, argued that the Plaintiff had “embarked\non a witch hunt against the Defendants”, and, in particular, with a\nview to unlawfully deprive Nagender of the fruits of his service\nto the Plaintiff.[note: 7]Their\ncase was that Nagender genuinely believed that he was still in the\nrunning for the Global CEO position until July 2011, by which time all\nthe New Entities except QRS had already been incorporated. The New Entities\nwere incorporated by persons other than Nagender for reasons unrelated\nto Nagender and his proposed appointment as Global CEO. The New\nEntities would not have competed with the Plaintiff even if they\nhad engaged in their intended businesses. Moreover, even if the\nNew Entities were competing, the Defendants had merely engaged in\npreparatory acts at the material time. They also denied that Nagender\nhad instigated the resignations of the other Defendants.[note: 8] 10     Further,\nNagender, Joanna, Rahul, Annie and Adella had been summarily dismissed\nby the Plaintiff while they were serving their respective periods\nof notice after resigning. They counterclaimed against the Plaintiff\nfor a declaration that they were wrongfully dismissed as well as for\ndamages for wrongful dismissal. 11     As\nfor Nagender, he was a shareholder in Holdco as well as a loan note\nholder in Bidco (both through his investment holding company, Signature\nSparks Pte Ltd (“Signature Sparks”)). The Defendants submitted that\nhe was not only wrongfully dismissed but also unjustifiably classified\nas a “Bad Leaver” by Holdco and Bidco, which had the effect of depriving\nhim of the value of his shares in Holdco and his loan note in Bidco.\nAccordingly Nagender and Signature Sparks counterclaimed against\nHoldco and Bidco for a declaration that Nagender was a “Good Leaver”.\nNagender also sought an order for the fair value of the shares in\nHoldco to be determined and paid by Holdco to Signature Sparks,\nas well as an order that the nominal value of his loan stock plus\naccrued interest be paid by Bidco to Signature Sparks. 12     In\nthis judgment, I am only concerned with the issue of liability. Damages\n(if any) will be assessed at a separate hearing.[note: 9]",
        "Dramatis Personae": "",
        "The Defendants": "13     Nagender,\nbesides being the managing director of the Plaintiff at the material\ntime, was also a director of Holdco and Bidco. He was designated as\nthe next Global CEO of the Griffin Group sometime in late 2009,\na fact which was publicised both within the group as well as to\nthird parties. This decision was later retracted. Nagender resigned\nas managing director of the Plaintiff on 16 August 2011 with his\nagreed last day of employment being 15 January 2012.[note: 10]By\nway of the Plaintiff’s letter dated 21 November 2011, Nagender was\ndismissed from his employment with the Plaintiff on allegations\nof gross misconduct and dishonesty.[note: 11] 14     Joanna\nwas the Plaintiff’s customer service manager at the Plaintiff’s office\nin Perth, Australia. Sometime in July 2011, she returned to Singapore.[note: 12]She assumed the position of acting\ngeneral manager of the Plaintiff upon Nagender’s resignation and\nwas positioned to be the Plaintiff’s new managing director upon\nNagender’s departure. She resigned on 21 September 2011. By way\nof the Plaintiff’s letter dated 21 November 2011, Joanna was dismissed\nfrom her employment with the Plaintiff on allegations of gross misconduct.[note: 13] 15     Leny\nwas an executive director of the Plaintiff. She resigned from her employment\non 2 February 2011. Her last day with the Plaintiff was on 30 June\n2011, and she resigned from the board of directors on the same day.[note: 14] 16     Rahul\nwas the Plaintiff’s manager of operations. He resigned on 22 September\n2011. By way of the Plaintiff’s letter dated 6 October 2011, Rahul was\ndismissed from his employment with the Plaintiff on allegations\nof gross misconduct.[note: 15] 17     Annie\nwas the Plaintiff’s general manager of operations. She resigned on\n12 September 2011. By way of the Plaintiff’s letter dated 6 October\n2011, Annie was dismissed from her employment with the Plaintiff\non allegations of gross misconduct.[note: 16] 18     Adella\nwas the Plaintiff’s director of operations (it must be noted that her\ndesignation as “director” was titular only as she was not a member\nof the Plaintiff’s board of directors). She resigned on 24 August\n2011. By way of the Plaintiff’s letter dated 6 October 2011, Adella\nwas dismissed from her employment with the Plaintiff on allegations\nof gross misconduct.[note: 17] 19     Prasad\nheld the position of “Vice President – Finance” in the Plaintiff. He\nresigned on 1 March 2011.[note: 18]He left the Plaintiff after\nhe finished serving his period of notice on 31 August 2011.[note: 19]Prasad is Nagender’s brother-in-law.[note: 20] 20     To\nput things into context, I set out in Annex 2 of this judgment a timeline\nof the key undisputed events which includes the Defendants’ respective\ndates of resignation.",
        "The witnesses": "21     The\nPlaintiff put forward eight witnesses: (a)     Mr\nAli Hussain (“Ali”), the managing director of the Plaintiff with\neffect from 1 October 2011; (b)     Mr\nGeorge Boyes (“George”), the CEO of GGG (effectively the Global\nCEO of the Griffin Group) at the material time, a director of Holdco\nand Bidco, and a shareholder of Holdco; (c)     Mr\nAgyapal Khuman (“Khuman”), the managing director of Griffin India\nand a director of Holdco and Bidco; (d)     Mr\nMarcus Hebblethwaite (“Marcus”), the chief financial officer (“CFO”)\nof the Griffin Group until his resignation on 27 August 2011[note: 21], a director of Holdco and Bidco, and\na shareholder of Holdco; (e)     Mr\nAlister Beveridge (“Alister”), the chief information officer of GGG; (f)     Mr\nPiyush Shukla (“Piyush”), the financial controller of the Plaintiff\nat the material time; (g)     Mr\nAndy Chua (“Andy”), a director of D’Perception Singapore Pte Ltd\n(“D’Perception”), a renovation contractor; and (h)     Mr\nToh Ching Wah, a director at KPMG Forensic, a division of KPMG Services\nPte Ltd, whose affidavit of evidence-in-chief (“AEIC”) and supplementary\nAEIC were accepted into evidence without cross-examination. 22     All\nthe Defendants gave evidence in court. They also called on the following\npersons to testify: (a)     Ms\nRita Ganes (“Rita”), a former client services manager of the Plaintiff; (b)     Mr\nIndraneel Fuke (“Indraneel”), a director of BHEA Knowledge Technologies\n(P) Ltd (“BHEA India”), an IT firm based in India; (c)     Mr\nAjay Satam Jagannath (“Ajay”), a former employee of the Plaintiff; (d)     Mr\nSandeep Singhania (“Sandeep”), a director of Lantone Systems Pte\nLtd (“Lantone”), a former IT service provider of the Plaintiff; (e)     Mr\nCiocan Cornel (“Cornel”), a director and shareholder of Net Vision\nSEA Pte Ltd (“Net Vision”) who had previously provided software\nservices to the Plaintiff; and (f)     Mr\nTay Tat Hwa, an associate director at KordaMentha Forensic Pte Ltd,\nwhose AEIC and Supplementary AEIC were accepted into evidence without\ncross-examination.",
        "The duties owed by the Defendants\nto the Plaintiff": "23     Before\nI can determine whether the Defendants were in breach of any of\ntheir duties to the Plaintiff, I have to first consider what, exactly,\nthose duties were. In this respect, the Plaintiff and Defendants\ndiffered in many aspects.",
        "Whether the Staff Manual was\nincorporated into the Defendants’ employment contracts": "24     All\nof the Defendants, with the exception of Joanna, had written contracts\nwith the Plaintiff dated 1 January 2009 (“the Employment Contracts”).[note: 22]As\nfor Joanna, the parties were in agreement that from the time that\nshe was posted to Singapore from Perth, there was no written employment\ncontract and that her employment was governed by an implied contract\nof employment.[note: 23] 25     The\nPlaintiff argued that the terms in a document known as the “Staff Manual”\nalso formed part of the Employment Contracts. The Staff Manual consisted\nof the regulations and individual policies which were issued on\n1 June 2002 and amended on 1 July 2002. The Plaintiff argued that\nthe following terms in the “Staff Manual” were expressly and/or\nimpliedly incorporated into the Employment Contracts:[note: 24] Section\n1.1 - Purpose This Staff Manual has been compiled as useful reference material\nfor all staff of Global Marine Travel Services Pte Ltd [the Plaintiff’s\nformer name], hereafter referred as Griffin Travel, and the rules\nand regulations contained herein constitute part of the employment\ncontract. Section\n2.3 - Secondary Employment 1. It is the Company’s policy that the employee upon signing\nthe contract of employment shall commit fulltime service to the\nCompany in order to maintain the highest standard of performance\nand prevent conflict of interest. 2. Written permission from the Company\nis required before any employee can take up part-time or secondary\nemployment or engagement with other companies. 3. In the event, an employee is known to\nhold secondary employment or engagements without prior written approval,\nthe employee shall be liable for disciplinary action. Section\n2.5(1) – Company Premises No employee may indulge in any commercial activity or business\nor utilize any facilities of the Company for private purposes. Section\n2.5(2) – Conflict of Interest No employee is permitted to hold any directorship or formal\npositions in other companies without prior knowledge and written\napproval from the Directors. Furthermore, the holding of any directorship\nor shareholding by the spouse / dependent of an employee in any\ncompanies must be brought to the attention of the Directors if it\nresults in any conflict of interest in connection with the employment\nwith the Company. Section\n2.5(3) – Confidentiality You shall not at any time, during or after the termination\nof employment by the Company, directly or indirectly, divulge to\nthird parties any details of the Company’s business, finance, transactions,\naffairs or dealings confidential to the Company without the expressed\nwritten permission of the Management. The disclosure of such information\nmay lead to disciplinary and legal action. Any information, which the employees may\nobtain from the Company during the term of employment – whether\nor not demonstrated in documents, papers, computer data, contracts\nor agreements – may pertain to commercial or technical secrets of\nthe Company and/or the Company’s principals or customers. The Employees shall not disclose any such\ninformation to any third party or use or duplicate any such information\nfor any purpose other than that for which it was intended. This\nstipulation applies equally to the period following expiration of\nthe employment contract for whatever reason. In case any employee\nviolates this stipulation, the employee shall be responsible for\nthe legal consequences, including payment of compensation for any\nfinancial loss suffered. 26     InStraits Advisors Pte Ltd v Michael Deeb (alias Magdi\nSalah El-Deeb) and others[2014] SGHC 94 at [118] and\n[119], I had the opportunity to sum up the legal position regarding\nthe incorporation of contractual terms thus: 118    I\nbegin by noting that the legal position regarding the incorporation\nof contractual terms in a contract of employment, such as the Employment Agreement\nhere, was well set out by Hobhouse J (as he then was) inAlexander and others v Standard Telephones &\nCables Ltd (No 2)[1991] IRLR 286 after a consideration\nof the relevant case law (at 292–293): The principles to be applied can therefore\nbe summarised.The relevant contract is that\nbetween the individual employee and his employer; it is the contractual\nintention of those two parties which must be ascertained.In\nso far as that intention is to be found in a written document, that document\nmust be construed on ordinary contractual principles. In so far\nas there is no such document or that document is not complete or conclusive,\ntheir contractual intention has to be ascertained by inference from\nthe other available material including collective agreements. The\nfact that another document is not itself contractual does not prevent\nit from being incorporated into the contract if that intention is\nshown as between the employer and the individual employee. Where\na document is expressly incorporated by general words it is still\nnecessary to consider, in conjunction with the words of incorporation,\nwhether any particular part of that document is apt to be a term\nof the contract; if it is inapt, the correct construction of the contract\nmay be that it is not a term of the contract.Where\nit is not a case of express incorporation, but a matter of inferring\nthe contractual intent, the character of the document and the relevant\npart of it and whether it is apt to form part of the individual\ncontract is central to the decision whether or not the inference\nshould be drawn. 119    This\npassage was also cited with approval by Judith Prakash J inABB Holdings Pte Ltd and others v Sher Hock Guan\nCharles[2009] 4 SLR(R) 111 (at [24]). The passage clarifies\nthat whether or not certain terms are incorporated into an employment\ncontract ultimately depends on the intention of the two contracting\nparties. In the particular situation where there is no express incorporation,\nas is the case here, then this contractual intent has to be inferred.\nAn inference that the parties did intend the incorporation of certain\nterms, however, will only be made where the court views them to\nbe “apt to form part of the individual contract”. [original emphasis] 27     Clause\n15 of the Employment Contracts expressly referred to the “Policy\nManual” of the Plaintiff, which the Plaintiff asserted was contained in\nthe Staff Manual.[note: 25]Clause 15 stated as follows:[note: 26] 15.\nCompany Policy This employment agreement (including the initial appointment\nperiod and any subsequent period) shall be governed by the “Policy\nManual” of the Company, which may be amended by the Company from\ntime to time, and which form part of this contract of employment.\nSuch regulations are deemed incorporated into this contract of employment.\nAny employee on application to their immediate manager may see these\nregulations, and the Manager in Singapore holds a copy of the manual. …… It is the responsibility of the Employee\nat all times to be properly aware of any Company policies and procedures\nthat apply to him/her or to his/her job at any time. 28     The\nDefendants submitted that the Staff Manual could not have been incorporated\ninto the Employment Contracts in the first place as the Employment\nContracts expressly excluded the application of such terms. The\nEmployment Contracts contained an entire agreement clause which provided\nfor the replacement and exclusion of all previous employment agreements,\nwhether oral or written.[note: 27]Clause 1 of the Employment Contracts\nstated: 1.\nEmployment This present employment agreement is effective as of 01-Jan-09,\nand replaces any or all other employment agreements, whether oral\nor written. This employment agreement constitutes the entire Agreement\nbetween the two parties, and any or all previous agreements, correspondences\n[sic], negotiations, representations,\nexplanations, statements, promises or guarantees, whether oral or\nwritten, shall be excluded. It is expressly agreed and understood that\nthere are no other verbal agreements or understandings between the\nCompany (any of the Managers, Officers, Agents, representatives\nor Employees of the Company) and the Employee. 29     The\nDefendants also argued that the use of the word “Policy Manual” in\ncl 15 of the Employment Contracts at a time when the Staff Manual\nwas in existence disclosed an intention to do away with the terms\nof the Staff Manual and for employees to be bound by the terms of\na new Policy Manual to be drafted. No such Policy Manual has been\nissued.[note: 28]Moreover, there was no objective\nevidence of any intention to incorporate the Staff Manual. It was\nnever put to any of the Defendants that there was an intention to\nincorporate either of these documents.[note: 29] 30     The\nPlaintiff argued that the material that was purportedly being excluded\nfrom the Employment Contractsviathe\nentire agreement clause had to be expressed very clearly and cl\n1 of the Employment Contracts was not sufficiently clear and unambiguous\nas to exclude the incorporation of the Staff Manual.[note: 30]Moreover,\nthe Defendants led no evidence on any intention to do away with\nthe Staff Manual.[note: 31]Further, reading cl 15 of the Employment\nContracts strictly would lead to ambiguity as there was no “Policy\nManual” in existence. A reasonable person would read the “Policy Manual”\nin cl 15 as referring to the only manual in existence at the time which\nall the parties were aware of,ie,\nthe Staff Manual.[note: 32] 31     In\nmy view, the Staff Manual was not incorporated into the Employment\nContracts, whether expressly or impliedly. Clause 15 did not expressly\nincorporate the Staff Manual as it is clear from the circumstances that\nthe “Policy Manual” was meant to refer to a specific document, even\nif it was not yet in existence. It is significant to note that Leny,\nRahul, Adella and Annie’s previous employment agreements dated 1\nJanuary 2006 expressly referred to the Staff Manual.[note: 33]The reference to “Staff Manual” was\nspecifically amended to “Policy Manual” when the Employment Contracts\ndated 1 January 2009 were entered into some three years later. This\ncould not be a mere typographical error by the Plaintiff. With this amendment,\nI decline to draw the inference that the parties intended the Staff\nManual to continue to govern the terms of their employment as with the\nprevious employment agreements and be incorporated as part of the Employment\nContracts, especially when the entire agreement clause in the Employment\nContracts had expressly excluded the operation of any part of the\nprevious employment agreements. Unlike, for example, inABB Holdings Pte Ltd and others v Sher Hock Guan\nCharles[2009] 4 SLR(R) 111 (“ABB\nHoldings”), the Plaintiff has not been able to establish\nclear evidence of an intention on the part of both parties to have\nthe Staff Manual incorporated into the Employment Contracts. The\nburden to do so rests with the Plaintiff.",
        "Fiduciary duties": "Whether Adella and Prasad were\nfiduciaries 32     The\nPlaintiff claimed that Nagender, Leny, Adella and Prasad all owed fiduciary\nduties to it. It is undisputed that Nagender and Leny were its fiduciaries\nwhile they acted as the Plaintiff’s directors, but the Defendants denied\nthat Adella and Prasad owed the Plaintiff any such duties.[note: 34] 33     Adella\nwas the Plaintiff’s director of operations, and was in Band 4, the\nPlaintiff’s second most senior classification for its employees.\nThe Plaintiff argued that she oversaw the Plaintiff’s operations\nand was effectively in control of the same. She was part of the\nPlaintiff’s senior management team. She was critically involved\nin the negotiations and decision-making process in relation to supplier\ncontracts. The Plaintiff claimed that she had the power to hire\nand fire staff,[note: 35]and that all the operations staff\nin three locations (Bangkok, Perth and Kuala Lumpur) reported to\nher.[note: 36] 34     The\nDefendants denied that Adella was a member of the Plaintiff’s senior\nmanagement team. While she coordinated communications with suppliers\nregarding contracts, she did not have the mandate to make any decision\nas to the terms of such contracts. The Defendants disputed that\nshe had the right to fire staff, and while they accepted that she\nhad the right to hire staff, their position was that she never hired\nanyone without first obtaining Leny and/or Nagender’s approval.[note: 37] 35     As\nfor Prasad, he was the vice-president of finance and effectively\nthe CFO of the Plaintiff. He was also classified in Band 4 and was\nan account signatory. The Plaintiff argued that he was in charge\nof the Plaintiff’s budget and expenditure; moreover he had the power\nto hire staff in the Plaintiff’s finance department.[note: 38] 36     The\nDefendants said that Prasad was not entrusted with powers to approve\nexpenses, nor did he possess the mandate to decide on budgetary allocations,\nbusiness development or infrastructure expansion plans. While he\nwas on the panel for recruitment interviews, the appointment of\nstaff was at the directors’ discretion.[note: 39] 37     To\nbegin, while the relationship of employee and employercanbe a fiduciary one, whether a fiduciary\nrelationship in fact arises will depend on the facts of a particular\ncase (seeQuality Assurance Management Asia\nPte Ltd v Zhang Qing and others[2013] 3 SLR 631 at [25]). 38     In\nthe English High Court decision ofNottingham\nUniversity v Fishel and another[2000] IRLR 471 (“Nottingham University”), Elias J noted\nat [97] that: 97    …\n[I]n determining whether a fiduciary relationship arises in the context\nof an employment relationship, it is necessary to identify with\ncare the particular duties undertaken by the employee, and to ask\nwhether in all the circumstances he has placed himself in a position\nwhere he must act solely in the interests of his employer. It is\nonly once those duties have been identified that it is possible\nto determine whether any fiduciary duty has been breached … 39     The\nabove paragraph was cited with approval by the Court of Appeal inSmile Inc Dental Surgeons Pte Ltd v Lui Andrew Stewart[2012] 4 SLR 308 (“Smile Inc (CA)”) at [52]. The question\nto be asked, therefore, is whether the employee has placed himself\nin a position where he must act solely in the interests of his employer. 40     The\nPlaintiff relied on the cases ofMona Computer\nSystems (S) Pte Ltd v Chandran Meenakumari and another[2011]\n1 SLR 310 (“Mona”) andABB Holdingsto show that both Adella\nand Prasad were fiduciaries. However, the factual matrices in both\nthese cases were rather different from that which is before me. 41     InMona, the plaintiff company was a family\nrun business dealing with software and IT consultancy and development.\nThe employee in question was the brother-in-law of the founding\nmember of the plaintiff. It was a small business and the employee\nwas the plaintiff’s sole full-time employee tasked with the day-to-day\nbusiness operations of the plaintiff. He also managed the plaintiff’s\ncontracts with third parties as well as those between the company’s\nIT personnel and the plaintiff. After the founder died, his wife\nbecame the managing director of the plaintiff. As she was not familiar\nwith the business operations of the plaintiff, she was dependent\non that employee’s experience and knowledge (at [6]). That employee\nalso tacitly admitted that he owed the plaintiff a fiduciary duty.\nIn such circumstances, it is unsurprising that the court found that\nhe was, indeed, a fiduciary of the company. 42     InABB Holdings, one issue was whether the\ndefendant in that case owed fiduciary duties to the second and third\nplaintiffs, which were part of a worldwide group of companies. He\nwas a director of the second plaintiff and clearly owed it fiduciary\nduties. The issue therefore was whether he was a fiduciary of the\nthird plaintiff even though he was not a director of that company.\nHe was initially employed by the second plaintiff but his employment\nwas subsequently transferred from the second plaintiff to the third\nplaintiff with retrospective effect. As president and director of\nthe second plaintiff, he was responsible for the general management\nof the plaintiff as well as the business development, marketing\nand sales of the plaintiffs’ installation materials business in\nthe Asia Pacific region. He also attended high-level meetings where\nthe plaintiffs’ various businesses were discussed. Even though his\ntitle was reduced from that of president to vice president and general\nmanager of “low voltage products” when he was transferred to the\nthird plaintiff, in truth no change took place in his rights and\nprivileges and there were no changes in the terms and conditions\nof his employment. He remained part of the top management. He was\nin a position to hire and fire employees for the third plaintiff.\nAccordingly, he was found to be a fiduciary of the third plaintiff\n(ABB Holdingsat [39]). In comparison,\nAdella and Prasad were clearly not responsible for the general management\nof the Plaintiff’s business nor did they have the power tobothhire and fire. 43     The\nDefendants, on the other hand, argued that the facts inNagase Singapore Pte Ltd v Ching Kai Huat and others[2007]\n3 SLR(R) 265 (“Nagase”) were more\nrelevant. In this case, two of the defendants were employees of\nthe plaintiff company. One defendant, CY, had the designation of\ndirector of a division of the company but this was administrative\nonly and he was not appointed a director of the plaintiff (like Adella).\nAnother defendant, MT was the senior manager of the division. CY had\nthe authority to make on behalf of the plaintiff a new warehousing contract\nwith another company but it was found that MT had no power to contract\nwith third parties on behalf of the plaintiff. Judith Prakash J\nfound that both CY and MT were not, in fact, fiduciaries (at [29]): 29    In\nany case, the evidence does not establish that CY and MT owed a special\nduty of “single minded or exclusive loyalty” to the plaintiff. They\nwere members of the middle management of the plaintiff albeit that\nCY held a fairly senior position. The mere authority to negotiate\ncontracts on behalf of the company or to authorise the payment of\ninvoices would not itself give rise to fiduciary obligations on\nthe part of the officers of the company entrusted with such authority.\nOtherwise, practically every middle level manager and every person\nwith some signing authority in a company’s finance department would\nhave fiduciary duties. In the case of CY, his promotion in 2001\nto director of the division from the post of manager did not change\nthe scope of his duties. He still had to report to Mr Mizumori [CY’s\nimmediate superior] and the board of directors and had to get Mr Mizumori’s\nsanction for many of his decisions. I cannot find a basis to support\nany assertion that by becoming director of the division, CY had\nundertaken specific contractual obligations which had “placed him\nin a situation where equity imposes these rigorous duties in addition\nto the contractual obligations”. CY was not top management and MT’s\nposition, as CY’s subordinate, was even more removed from a situation\nin which fiduciary duties could be imposed. 44     The\nDefendants submitted that Prasad and Adella, as the heads of their\nrespective divisions in the Plaintiff (ie,\nfinance and operations), occupied positions analogous to that of\nCY inNagase.They still had to report\nto Nagender and Leny and had to get Nagender’s and/or Leny’s sanction\nfor many of their decisions. They also argued that the Plaintiff\nhad not adduced any evidence that Prasad or Adella had undertaken\nspecific contractual obligations which placed them in a situation\nwhere equity imposed rigorous duties in addition to their contractual\nobligations, thus the Plaintiff had not discharged its burden of\nproving that Prasad and Adella owed fiduciary duties to it.[note: 40] 45     I\naccept the Defendants’ submissions. Prasad and Adella were in Band 4,\nwhich was merely the second highest classification out of five.\nFor example,Annie(who was Adella’s\nsubordinate[note: 41]) was also\nin Band 4,[note: 42]which indicated to me that Band 4\nwas not a classification reserved for senior management only. While\nAdella was responsible for coordinating communications with suppliers,\nI accept her evidence that she could not make any decision as to\nits terms. The fact that Prasad and Adella were heads of their respective\ndivisions was also inconclusive. InNagase,\nthere were approximately 45 employees working under CY in his division\n(at [19]), but CY was nevertheless found to be part of the middle\nmanagement. Similarly, the mere fact that Prasad was effectively\nthe CFO of the Plaintiff would not,ipso facto,\nmean that he was also a fiduciary (seeShepherd Andrew\nv BIL International Ltd[2003] SGHC 145 at [102]). Despite\nhis position, there is no indication that Prasad had the power to\nmake decisions of a nature that could materially affect the Plaintiff’s\ninterests. I accept his evidence that he had no power to approve\nexpenses or make actual decisions on budgetary allocations.[note: 43]Accordingly, I do not find that Prasad\nand Adella owed the Plaintiff any fiduciary duties. The fiduciary duties owed by\nNagender and Leny 46     It\ntherefore remains for me to consider the scope of the fiduciary duties\nowed by Nagender and Leny to the Plaintiff. In this respect, the Plaintiff\npleaded that the following fiduciary duties were owed to it:[note: 44] (a)     to\nact in good faith and in the best interests of the Plaintiff; (b)     to\nact with honesty and loyalty towards the Plaintiff; (c)     not\nto use their fiduciary position to gain any unauthorised personal\nprofit; (d)     not\nto compete with the Plaintiff; (e)     not\nto place themselves in a position where their duty to the Plaintiff\nand their personal interests may conflict; (f)     not\nto disclose information of concern to the Plaintiff and which was\nrelevant for the Plaintiff to know to third parties; (g)     to\ndisclose to the Plaintiff any potential threat and/or competitive\nrisk posed to its business; (h)     to\nserve the Plaintiff faithfully and dutifully and not to advance or\npromote their own interests or other external interests to the prejudice\nof or contrary to the interests of the Plaintiff; (i)     not\nto obtain for themselves any business advantage that properly belongs\nto the Plaintiff without the consent of the Plaintiff; and/or (j)     to\ninform the Plaintiff of any activity, actual or threatened, which\ncould damage the Plaintiff’s interests. 47     The\nDefendants admitted that Nagender and Leny owed the duties stated\nat (a) to (f), (h) and (i) in the preceding paragraph, but denied\nthat they owed a duty to the Plaintiff to disclose to the Plaintiff\nany potential threat and/or competitive risk to its business (as\nstated at (g) above) and/or to inform the Plaintiff of any activity,\nactual or threatened, which could damage the Plaintiff’s interest\n(as stated at (j) above). 48     The\nPlaintiff relied onABB Holdings,\nwhere Judith Prakash J at [42] found that the fiduciary duties owed\nto a company includes,inter alia,\nthe following: (a)     a\nduty to disclose to the company information which came to the fiduciary\nand which was of concern to the company and was relevant to the\ncompany to know; and (b)     a\nduty to inform the company of any activity, actual or threatened,\nwhich could damage the company’s interests. 49     The\nDefendants sought to persuade me to depart from the position taken\ninABB Holdings.They referred to\nthe High Court decision inSmile Inc Dental\nSurgeons Pte Ltd v Lui Andrew Stewart[2012] 1 SLR 847\n(“Smile Inc (HC)”). There, the court\n(at [194]) consideredBritish Midland Tool\nLtd v Midland International Tooling Ltd and others[2003]\n2 BCLC 523 (“British Midland Tool”)\nandShepherds Investments Ltd and another v\nWalters and others[2007] 2 BCLC 202 (“Shepherds\nInvestments”). The court disagreed withBritish\nMidland ToolandShepherds Investmentsthat\na director has to disclose his intention to compete, and that once\nan intention to compete is formed, a director cannot as a matter\nof law take mere preparatory steps such as the leasing of premises\nand the equipping of the same (at [212] and [213]). The Defendants\nsubmitted that these observations were undisturbed by the Court\nof Appeal inSmile Inc (CA).[note: 45] 50     The\nCourt of Appeal’s analysis on this aspect ofBritish\nMidland Toolwas set out at [75] to [77] of that case: 75    In\nholding the former directors liable, Hart J appeared to propound\na very broad prohibition against potentially competitive behaviour,\nas follows (at [89]): A director who wishes to engage in a competing\nbusiness and not to disclose his intentions to the company ought,\nin my judgment, to resign his office as soon as his intention has\nbeen irrevocably formed and he has launched himself in the actual\ntaking of preparatory steps. 76    The\nAppellant has argued that a similar standard should apply to the Respondent,ie, that the Respondent should have disclosed\nhis intentions to compete with the Appellant. However, we are not\npersuaded by this argument. The crucial question is: What was the\nduty that was breached inBritish Midland Tool([63]supra)? The duty to disclose inBritish Midland Toolwas held to be based\nupon a director’s fiduciary duties, not an employee’s duty of good\nfaith and fidelity. Indeed, Hart J makes it quite clear that (at\n[94]): The employee’s duty of fidelity to his\nemployer, although in some respects similar in content to the director’s\nfiduciary duty to the company and although it is itself sometimes\ndescribed as a fiduciary duty … is by no means identical. Importantly\nit does not include, in the usual case, any prohibition as such\non being in a position where his duty as employee and his self-interest\nmay conflict. 77British Midland Toolis,\ntherefore, good authority centering on the fiduciary duty of a director,\nto act loyally and in the best interests of his principal, and not\nput himself in a position of conflict between his principal’s interests\nand his self-interest.These are considerations that\ndo not apply with equal force in an employee-employer relationship,\nwhich is the situation in the present case. [emphasis added in bold] 51     It\nis axiomatic that a director may in the appropriate circumstances\nbe duty-bound to make disclosures of matters of relevance to the\ncompany. However, as noted by Lewison LJ in the UK Court of Appeal\ninJeremy Michael Ranson v Customer Systems\nplc[2012] EWCA Civ 841 (“Ranson”) (which\nwas not cited to me by the parties), even in the context of the fiduciary\nduties of a director, there is nofree-standingduty\nto disclose. Rather, it is founded on the director’s duty “to act\nin what he in good faith considers to be the best interests of his\ncompany” (Ransonat [52], citingItem Software (UK) Ltd v Fassihi[2004]\nEWCA Civ 1244). 52     I\nrespectfully agree with Lewison LJ’s analysis. To conclude, Nagender and\nLeny did not owe free-standing duties of disclosure to the Plaintiff\nbut that is very different from saying that a failure to disclose\nisnevera breach of fiduciary duty.\nA director can hardly argue that he has upheld his general duty\nof single-minded loyalty if his failure to disclose was motivated\nby bad faith, such as where the director was aware that such non-disclosure\nwould cause harm to the company.",
        "Implied duty of fidelity": "53     The\nPlaintiff pleaded that, as employees of the Plaintiff, all of the Defendants\nwere further subject to implied duties of good faith, fidelity and loyalty\npursuant to which they were required to:[note: 46] (a)     act\nin the best interests of the Plaintiff; (b)     receive\nand obey the instructions of the Plaintiff; (c)     devote\ntheir time and talents to the Plaintiff’s business; (d)     do\ntheir work for the Plaintiff with honesty and integrity; (e)     avoid\nsituations where their personal interests conflict with those of\nthe Plaintiff; (f)     not\nmake preparations during their employment with the Plaintiff and\nusing the Plaintiff’s time and resources with a view to competing\nwith the Plaintiff once their employment was over; and (g)     disclose\nto the Plaintiff any potential threat and/or competitive risk posed\nto the Plaintiff’s business. 54     In\ntheir Defence and Counterclaim, the Defendants admitted that they\nwere subject to implied duties of good faith, fidelity and loyalty\nto the Plaintiff, but they did not admit they owed the duties set\nout at (a) to (e) above. They further denied that they were subject\nto the duties set out at (f) and (g).[note: 47]However, in their closing submissions,\nthe Defendants departed from their pleaded case and argued, on the\nauthority ofCheah Peng Hock v Luzhou Bio-Chem\nTechnology Ltd[2013] 2 SLR 577 (“Cheah\nPeng Hock”), that the implied duties owed are confined\nto implied duties ofmutual trust and confidence,\nrather than implied duties of good faith.[note: 48] 55     InCheah Peng Hock, Quentin Loh J confined\nthe term implied in law to one of mutual trust and confidence. This\nincludes a duty of fidelity,ie,\na duty to act honestly and faithfully (at [55]). As for an implied\nduty of good faith, Loh J noted at [46] that: The danger of implying a duty of good faith\ninto contracts of employment is to introduce a potentially far reaching\nconcept which may impose positive duties and fetters the freedom\nof parties, particularly those of equal bargaining power who are\nnot protected under the Employment Act (Cap 91, Rev Ed 2009) or\nunder the common law, to contract. It will probably also conflict\nwith written terms. 56     I\nnote thatCheah Peng Hockdealt\nwith the issue of the duty owed by anemployerto\nan employee, although the reasoning was of wide application. 57     In\nany case, the Plaintiff readily accepted that it was the implied\nterm of mutual trust and confidence that applied, but argued that\nprevious cases have referred to the said implied duty as the implied\nduty of good faith, fidelity and loyalty, and courts have used the\nterms interchangeably. It submitted that the unlawful conduct in\nthe present case would amount to a breach of the duty of fidelity.[note: 49] 58     Insofar\nas the Plaintiff’s argument related to labels, I agree. What is crucial\nis, after all, thecontentof the\nduty (though of course the use of similar labels for different concepts\nmay be confusing). As stated inAsiawerks Global\nInvestment Group Pte Ltd v Ismail bin Syed Ahmad and another[2004]\n1 SLR(R) 234 at [61], employees are expected to serve their employers\ndiligently, honestly and loyally, but what this duty translates\ninto factually depends on the circumstances, such as the nature\nof the work. For simplicity, I will refer to the implied duty as\nthe implied duty of fidelity. 59     The\nnext issue is whether this implied duty of fidelity permits an employee\nto take preparatory steps with a view to competing with his or her former\nemployer while still in the latter’s employ. The Court of Appeal answered\nthis question in the affirmative inSmile Inc\n(CA)at [65]. Whether or not the steps taken by an employee\ncan be considered as preparatory to future competition, or instead\nconstitute actual competitive activity, turns on the facts of each\nparticular case (Smile Inc (CA)at\n[67]). 60     It\nis a matter of some controversy as to whether “mere” employees have\na duty to disclose to their employer any potential threat and/or competitive\nrisk posed to their employer’s business. To persuade me that they\ndid have this duty, the Plaintiff placed particular reliance on\nthe cases ofUBS Wealth Management (UK) Ltd\nv Vestra Wealth LLP[2008] EWHC 1974 (QB),Kynixa Ltd v Hynes and others[2008] EWHC\n1495 (QB) andQBE Management Services (UK)\nLtd v Dymoke and others[2012] EWHC 80 (QB) (“QBE”). 61     InQBE, a group of employees, led by the\nfirst three defendants (who were senior employees and one of whom\nwas found to owe fiduciary duties to the company), left the plaintiff\ncompany to set up the fourth defendant, to compete with their former\nemployers. This was a case where counsel for the defendants had\nadmitted that two of the defendants had “crossed the line” into\n“impermissible preparations” in certain aspects. The first three defendants\nhad not only recruited their colleagues into their new endeavour,\nbut were also found to have misused confidential information and\nsolicited the company’s clients whilst still employed, and these\nwere all done under the cloak of secrecy. Haddon-Cave J set out\nat [171] to [174] a set of extracts from recent cases in the UK: 171    InShepherd Investments Ltd and Anor v Walters &\nanother[2006] EWHC 836 (Ch), Etherton J. held that when\nformer directors and employees set up a competing business, diverting\nbusiness opportunities and misusing confidential information, they\nhad acted in breach, not only of their fiduciary obligations, but\nalso their implied obligation of fidelity, from the moment that\nthey procured the services of attorneys in the Cayman Islands to\nset up the rival business. On the facts of that case, Etherton J,\nheld that a former employee was also in breach of obligations as\na fiduciary, whether or not he was to be regarded as a director,\nand that he was in breach of his duty of fidelity. 172    InUBS Wealth\nManagement v. Vestra Wealth LLP(supra) Openshaw J. said\nat paragraph 24: I cannot accept that employees, in particular\nsenior managers, can keep silent when they know of planned poaching\nraids upon the company’s existing staff or client base and when\nthese are encouraged and facilitated from within the company itself,\nthe more so when they are themselves party to these plots and plans.\nIt seems to me that that would be an obvious breach of their duties\nof loyalty and fidelity to [their employer]. 173    InKynixia v. Hynes[2008] EWHC 1495 Wyn\nWilliams J. said at paragraph 283: I simply do not see how one can be acting\nas a loyal employee when one knows that three senior employees (including\noneself) may transfer their allegiance to a group of companies which\nincludes a competitor and yet not only fail to divulge that knowledge\nbut also say things which would have the effect of positively misleading\nthe employer about that possibility. 174    InTullett Prebon plc v. BCG Brokers LP[2010]\nIRLR 648 Jack J. said at paragraphs 68-69: [A] desk head must not do anything to assist\nthe recruitment of his desk… Where a desk head decides that he is\nin favour of the recruitment of his desk and thereafter assists\nthe recruitment in such small or large ways as may arise, he is\nin plain breach of his duty: he has crossed the line between observing\nhis duty to his employer and acting in the interest of his employer’s\nrival. 62     In\ncoming to his interpretation of the law, Haddon-Cave J also disagreed\n(at [180] and [181]) with the following passage by Hickinbottom\nJ inLonmar Global Risks Ltd v West[2011]\nIRLR 138 (“Lonmar”) at [151]: … Generally, therefore, an employee is\nunder no obligation to report to his employer his own misconduct\n(Bell v Lever Brothers[1932] AC\n161), or the misconduct of his fellow employees (Sybron\nv Rochem[1983] ICR 801); nor is he under a restraint\nfrom legitimate preparation for himself engaging in future competition\nwith his employer (Tunnard), or\ninforming another employee of his plans to do so and offering him\na potential job in that competitor in the future (Tither\nBarn v Hubbard(EAT/532/89 (Wood J), unreported, 7 November\n1991).If it is not unlawful for an employee\nto inform a fellow employee of plans to set up in competition, and\n(without inciting him to breach his contract with his current employer)\noffer him a job in the future, then the employee to whom such matters\nare confided cannot sensibly be under a general obligation to inform\nhis employer of those plans and offer.[emphasis added\nin bold] 63     In\nmy view, Hickinbottom J’s reasoning inLonmarbetter\naccords with the law as set down inSmile Inc\n(CA), where the Court of Appeal disagreed with the contention\nthat an employee ought to disclose his intention to compete with\nhis employer. In this regard, the Court of Appeal considered the\nduty that was breached inBritish Midland Tooland\nfound that duty was in fact founded upon a director’s fiduciary\nduties, not an employee’s duty of good faith and fidelity. 64     A\ndirector, as a fiduciary, has asingle-mindedduty\nof loyalty to the exclusion of the fiduciary’s own interest. Employees\ndo not ordinarily bear such an onerous obligation. They are expected\nto be loyal to their employer, but as Lewison J explained inRansonat [41], the duty of loyalty in\nthe context of an employee bears the same label but holds a very\ndifferent meaning. The employee’s duty to his employer is “one where\neach party must have regard to the interests of the other, but not\nthat either must subjugate his interests to those of the other”\n(Nottingham Universityat [95]). 65     I\nalso respectfully adopt Quentin Loh J’s pertinent observations inScintronix Corp Ltd (formerly known as TTL Holdings\nLtd) v Ho Kang Peng and another[2013] 2 SLR 633 at [94]\nthat an employee does not normally have a duty to avoidpotentialconflicts of interest: … [T]he duty of fidelity to an employee\ndoes not require the employee to subjugate his own interests to\nthose of his employer and an unforgiving view of conflict in the\nemployment context is difficult to square with this well-established\nposition in law. …An employee is notper sein breach\nof his duty of fidelity merely because he is in a position where\nthere is a potential conflict of interest. I acknowledge\nthat the scope of the duty of fidelity may vary according to the\nseniority of the employment, but I do not think the duty of fidelity\nextends so far as to cover potential, as opposed to actual, dishonest\nor disloyal behaviour. [emphasis added in bold] 66     As\nfar as the duty of disclosure is concerned, Lewison LJ endorsed\n(inRansonat [48] and [54]) the\nstatement inNottingham Universitythat\nthere is no general principle that an employee is bound to inform\nhis employer if and when he is doing outside work in breach of his\ncontract. However, he added (at [55]): 55That is not to\nsay that an employee can never have an obligation to disclose his\nown wrongdoing; but any such obligation must arise out of the terms\nof his contract of employment.Mr Stafford QC took us\non atour d’horizonof cases where\nsuch an obligation (or an analogous obligation) did arise. In Swain\nv West (Butchers) Ltd [1936] 3 All ER 261 the employee manager had\na contractual obligation “to promote, develop and extend the interests\nof the company.” This contractual obligation required him to disclose\nmisconduct by the managing director. In QBE Management Services (UK)\nLtd v Dymoke [2012] EWHC 80 (QB) [2012] IRLR 458 Mr Dymoke’s contract\ncontained obligations to use his best endeavours to promote and protect\nthe interests of his employer, and a further obligation that he\nwould “fully and properly disclose to the Board … all of the affairs\nof the Group of which he is aware.” These obligations meant that\nMr Dymoke had a duty to disclose his own activities in soliciting\nfellow employees to defecten masse, his\nmisuse of confidential material and solicitation of his employer’s customers\nwhile he was still employed. He also showed us different contracts made\nbetween CS and other employees which contained far more restrictive terms\nthan those contained in Mr Ranson’s contract. [emphasis added in bold] 67     If\nan employer wishes to impose a legal burden on an employee to blow\nthe whistle on himself and his colleagues, it should be made crystal clear\nthat he has such an obligation. It would be even better if the employer also\nlaid out the proper steps on how he should discharge this obligation. Moreover,\nI suspect that in many circumstances it may be more efficacious to\nrely on the carrot of incentives rather than the stick of legal\nsanction to induce employees to step forward. 68     In\nmy view, the Plaintiff has not established on the facts that the\nnon-fiduciary Defendants have undertaken, expressly or impliedly,\na contractual duty to report. In such circumstances, they would\nnot be in breach of the implied term of fidelity merely by their\nfailure to disclose any activity, actual or threatened, which could\ndamage their employer’s interests. As stated inLonmarat\n[155]: … [T]he contractual duty of fidelity does\nnot as a general rule incorporate an obligation to report to an\nemployer wrongdoing of employees, let alone conduct falling short\nof wrongdoing which may nevertheless not be in the best interests\nof the employer.",
        "The alleged masterplan": "69     Having\nestablished the scope of the fiduciary duties owed by Nagender and\nLeny as well as the implied duties owed by all the Defendants as\nemployees of the Plaintiff, I turn now to consider whether those\nduties had been breached on the facts of the present case. I begin\nwith the Plaintiff’s principal allegation that there was a masterplan\nlinking all the New Entities together. The Plaintiff argued that\nthe involvement of the Defendants in the New Entities disclosed\nan engineered scheme spearheaded by Nagender, who was able to control\nthe New Entities through (a) the loyalty of the other Defendants\nto him and (b) his wife Kavita Chilkuri (“Kavita”), to incorporate\na group of companies with a view to competing with the Plaintiff’s\nbusiness.[note: 50] 70     The\nPlaintiff has provided an organogram showing the links between the\nNew Entities and the Defendants, which can be found at Annex 3 of\nthis judgment. 71     The\nexistence and scope of the alleged masterplan turned primarily on\nNagender’s alleged motive of wanting to cause harm to the Plaintiff\nas a result of him being spurned as the next Global CEO. Therefore,\nI consider it appropriate to analyse this aspect of the Plaintiff’s\ncase first.",
        "The Global CEO succession and\nNagender’s resignation": "72     Nagender\nhad a 20% shareholding in the Plaintiff in 2008.[note: 51]As part of a corporate restructuring\nexercise to facilitate the partial or full sale of the Griffin Group,[note: 52]Nagender\ntransferred his shares in the Plaintiff to GGG in return for shares\nin GGG (ie, a share swap).[note: 53] 73     In\n2009, the Griffin Group entered into talks with a private equity firm,\nInflexion Private Equity Partners LLP (“Inflexion”).[note: 54]As part of the group’s restructuring,\nthe shares in GGG (including Nagender’s) were acquired by Bidco,\nwhich was in turn a wholly owned subsidiary of Holdco. Inflexion\npurchased 25% of Holdco’s shares.[note: 55]By\na subscription agreement dated 16 December 2009 (“the Subscription\nAgreement”) between Holdco, Bidco and himself, Nagender, subscribed\nthrough his investment holding company, Signature Sparks, to a 9.1%\nstake in Holdco and a £1.6m loan note issued by Bidco.[note: 56] 74     Nagender\nclaimed that he agreed to the share swap and also to the sale of\nthe business on the assurance that he would become the Global CEO after\nthe sale.[note: 57]The Plaintiff denied that\nany such assurance was made.[note: 58]Nevertheless, it was undisputed\nthat George had identified Nagender as the “prime candidate to be\nthe next Global CEO”.[note: 59]Third\nparties were also told that Nagender was to be George’s successor.[note: 60]The plan was for\nLeny to succeed Nagender as managing director of the Plaintiff with\nJoanna as the second-in-command.[note: 61] 75     George\nclaimed that the decision not to appoint Nagender as the next Global\nCEO was reached in early August 2010.[note: 62]At that time, the Griffin Group\nwas considering a merger with VIA, a travel company with a focus on\nthe Nordic countries, and one of the issues being considered was whether\nMr Espen Asheim from VIA would be the Global CEO of the merged entity.[note: 63]George claimed that he first told Nagender\nabout this decision on or around 20 August 2010,[note: 64]but there is no other evidence of such\na conversation. 76     On\n22 or 23 September 2010, Nagender had a heated argument with George\nduring one of the Griffin Group’s board meetings, in which George called\nNagender “obnoxious”.[note: 65]Nagender\nlater called Mr Christian Hamilton (“Christian”) and Mr Gareth Healy\n(“Gareth”) of Inflexion, as well as Mr Dick Porter (“Porter”), who\nwas then the chairman of the Griffin Group, to complain about George’s\nbehaviour. This upset George, who, in an email to Christian and\nGareth, expressed that he was “deeply hurt” by what Nagender did.[note: 66] 77     It\nwas undisputed that Porter told Nagender that the Griffin Group was\ngoing to source for an external candidate for the Global CEO position at\naround the same time.[note: 67] 78     On\n23 September 2010, Nagender sent an email to George, Khuman and\nMarcus, among others, stating that: Events of the past few weeks have not been\npleasant and least decent. While my intention is not to elaborate\non them, it has come to a stage where it is untenable for my continued\ninvolvement with the organisation, under the current circumstances.\nWhile some other discussions have been ongoing without my / everyone’s\ninvolvement, it is timely for me to move on.[note: 68] 79     Nagender\nadmitted that when he sent the email, he wanted to leave the Plaintiff\nentirely.[note: 69]He\nclaimed that the email was not sent in response to his conversation\nwith Porter, but was rather a reaction to a separate dispute relating\nto company matters that culminated in the confrontation with George\nat the board meeting.[note: 70] 80     What\nhappened next that day is disputed, but it would appear that Nagender\nwas placated for the time being. Nagender sent a follow up email stating:\n“As discussed, I agree that it would merit diffusing the current situation.\nLet’s give it a couple of days rest prior to meeting up to discuss and\nbringing the matter to its logical conclusion.”[note: 71] 81     Subsequently,\nGeorge and Nagender met sometime between 6 and 8 October 2010 in\nMumbai, India. Both men left their meeting thinking that the issue\nhad been resolved, but their accounts of what occurred differed materially.\nAccording to George, they came to an agreement that Nagender would\nnot be the Global CEO but instead could take on the position as\nthe regional head of the Griffin Group’s Asia operations.[note: 72]Nagender, in contrast, asserted that\nhe had asked George in no uncertain terms as to whether there was\nany change in the Griffin Group’s plans regarding Nagender’s appointment\nas the Global CEO, to which George’s reply was no.[note: 73] 82     George\nwrote to Christian and Gareth on 7 October 2010, setting out his\naccount of the discussion which he had with Nagender in the following terms: I have had a very lengthy clear out and\ndiscussion with Nagender so things are going back to normality.\nI have one issue still to discuss with him, regarding his position\ngoing forward and the suggestion for Nagenderto\nstart withas a regional head (Asia) with the added responsibility\nof pulling together operations globally.[note: 74] [emphasis added in italics] 83     George\nclaimed that the issue of Nagender’s position going forward was\nfinalised the next morning over breakfast on 8 October 2010.[note: 75]The email above suggests that\nthere was a plan tobeginwith the\npromotion of Nagender to a regional position with added global responsibility.\nTherefore, it is not unreasonable to conclude that, after meeting\nwith George in Mumbai, Nagender might have left with the impression\nthat he was still on track to be the Global CEO, with his proposed\nregional position being only an interim one. If George had told\nNagender in no uncertain terms that he wouldneverbe\nthe Global CEO, I doubt that Nagender would have been so readily\nplacated for normalcy to return. 84     On\n30 October 2010, Christian sent an email to Gareth and the major shareholders\nof the Griffin Group, including Nagender, attaching a powerpoint\npresentation that referred to the succession planning for the managers\nof the Griffin Group. This presentation was made in the context of\nInflexion’s proposal to acquire an additional 25.1% in the Griffin\nGroup (which did not materialise).[note: 76]One of the slides in the presentation\nstated that the recruitment for a new Global CEO would “start immediately\nand that this process would take c. 6-9 months”.[note: 77]Nagender\nstated that this took him by surprise;[note: 78]however,\nhe maintained that the matter was still up in the air,[note: 79]as there was\nstill the possibility that Inflexion’s plans might fall through.\nIf that happened, then with George’s intention to retire and the old\nshareholders remaining in place, Nagender could still be the one\ntaking over the reins.[note: 80] 85     Nagender\nwas outspoken about his disgruntlement at the events that had transpired.\nIn a telephone conversation with Christian on 18 November 2010,\nhe told the latter that he was “very bitter about it”[note: 81]and that\n“[i]f the transition doesn’t happen, the current CEO to the new\nCEO, I’m ready to go”.[note: 82]He also said on the stand that he\nwas “upset at being lied to”.[note: 83] 86     This\nwas followed by an email dated 23 November 2010 from Porter in advance\nof a board meeting on 25 November 2010 in London to the global shareholders,\nwhich stated that: Planning for CEO recruitment will begin\nimmediately. George and Dick will meet Skill Capital to see if it\nis agreed they are presented to the Board as recruitment agency.\nThe understanding is for the process to be open to all from within\nGriffin and additional external candidates will be sought.[note: 84] 87     Sometime\nin November 2010, another heated exchange occurred between George\nand Nagender at a board meeting. Nagender asserted that any change\nin the CEO appointment plans would make his stay in the Griffin\nGroup untenable and he would leave if someone else was appointed as\nthe Global CEO.[note: 85]Subsequently, Bob Westerndarp\n(the head of Griffin US) sent an email to the global shareholders\non 26 November 2010 indicating that the search for a new Global\nCEO needed to start immediately, and that Nagender has “expressed\nthat he has lost interest in the business”.[note: 86] 88     In\nresponse, on 26 November 2010, Nagender sent an email stating: Please do take the necessary action but\nlet me assure you all that I will earn my every cent till the day\nI leave. … Since one of the Shareholders has now formalized this\ndiscussion, it would be appropriate for me to formalize my position\nin terms of my desire to disengage from Griffin. Please advise the due process for me to\ncomply.[note: 87] 89     It\nseems that Nagender was prepared to leave the Plaintiff for good\nat this point, although of course he could later change his mind.\nOn the same day, George replied to Nagender asking him to “please\nrest this”. He also asked Nagender to wait until an upcoming meeting\nin Athens before making any decision.[note: 88]Nagender did not follow up with\nhis resignation threat. 90     At\nthe shareholders’ meeting in Athens, Greece on 12 January 2011,\nit was agreed that the management shareholders would not start the recruitment\nprocess for a new CFO and CEO until the VIA merger discussions were\naborted (or a successful merger negated the need for such recruitment).\nNagender was appointed as the chairman of the management committee\nof the Griffin Group.[note: 89] 91     On\n14 January 2011, George sent Porter an email about a discussion with\nNagender, stating: The meeting went a lot better than I could\never imagine. At least all eight of us discussed the major issues,\nproblems with honesty and openness.Most important\nis Nagender decided to stay. We all agreed that we want\nto start discussions with VIA and I have already spoken to FSN and\nEspen VIA’s CEO and advised also Gareth and Christian. … …[T]he partners have\ndecided not to go ahead at this stage at looking to hire a CEO or\nCFO, instead we will relook at this if the VIA merger for whatever reason\ngets abandoned. …[note: 90] [emphasis added in italics] 92     The\nparties interpreted the events in Athens very differently. According\nto the Defendants, it signalled to Nagender that there remained a\nreal chance that he might be appointed as the Global CEO.[note: 91]George himself\nsaid he had met with Nagender privately and assured him that he still\nhad a role to play within the Griffin Group.[note: 92]George also agreed during cross-examination\nthat the reason Nagender had decided to stay on was that the management\ncommittee had agreed totemporarilyput\non hold the external recruitment of a potential CEO.[note: 93]Notwithstanding this, the Plaintiff\nmaintained that Nagender had not been given any assurances that he\nwas going to be the Global CEO and thestatus\nquoremained.[note: 94]The Plaintiff said that any intention\nto revert to the original plan to make Nagender the next Global\nCEO would have been expressly recorded.[note: 95] 93     Based\non the email of 14 January 2011, it seems clear to me that Nagender’s\nposition as at mid-January 2011 was that he would stay with the Griffin\nGroup and not resign. This change of heart is not surprising as\nhe could probably tolerate thestatus quobut\nnot when someone else was made Global CEO instead of him. That would\nresult in too much of a loss of face for him. 94     In\nFebruary 2011, George and Nagender went to Houston, USA, and Brazil\nto assess the operations of the Griffin entities there and to see\nif any improvements could be made.[note: 96]I accept the Defendants’\nargument that there was no reason for Nagender to be involved in\nany of these tasks, nor would Nagender want to take on any of these\nlarger global roles, if he did not think that he had at least the\nchance of taking over as the Global CEO.[note: 97] 95     On\n24 March 2011, Nagender sent a rather long email to the shareholders\nof the Griffin Group, which contained the following statement: I cannot but help add the issue in terms\nof the way the succession was offered to me and portrayed extensively\nto internal (offices and staff) and externally (Suppliers &\nAirlines) and then changed. This leaves me in a situation nobody\nwishes to be in. Inflexion played a role and definitely other shareholders\ndid. This is a very negative situation both personally & professionally\nfor me. Any changes in the CEOs office will have an impact on my\ndecisions going forward and this is a responsibility the organisation\nhas to understand & accept. Both [I]nflexion and George as CEO\nhave, in their judgement, found me wanting on the step up, which\nI fully respect. However both need to respect my personal &\nprofessional stance on the subject.[note: 98] 96     For\nthe Plaintiff, this was seen as yet another resignation threat,[note: 99]and\nthat the bitter tone was strongly at odds with any belief that Nagender may\nhave on still becoming the Global CEO.[note: 100]The Defendants’ explanation for\nthis email was that Nagender was simply writing down his opinion\non what had not worked for him in the past year.[note: 101] 97     On\n28 March 2011, George replied to Nagender’s abovementioned email\nwith a similarly lengthy response. Of note was the following paragraph: Nagender there was nothing more I wanted\nthen for you to take over from me as CEO. There is no doubt you\nhave an abundance of talent. I accept I made a mistake, I did present\nyou as the person to take over from me in the near future, I said\nthis to Griffin GM’s to Amadeus and to Air France. I did this in\nthe most genuine and spontaneous way because I do believe in you.\nIt was a very painful decision on my part, which I took alone mainly\nfor reasons that I have already touched on in this email.You are not ready to become the global CEO of Griffin…[note: 102] [emphasis added in italics] 98     In\nmy view, this was a clear indication from George that Nagender would\nnot be made the Global CEO. Nagender’s evidence was that this was merely\n“another change in the scenario” and so he decided not to react.[note: 103]It might well be true that\nhe decided not to react immediately. But I believe that from this\npoint onwards, Nagender would have seen clearer signals that he\nmight never be made the Global CEO. George had couched his email\nresponse to Nagender in palatable language that he was “not ready\nto become the Global CEO of Griffin” and perhaps at a later time\nhe might possibly be. However, I am inclined to the view that Nagender\nwould now be seriously considering his own future in the company\nthat he had long worked very hard for. Yet, it is probably premature\nto say that he would haveimmediatelycome\nto a firm decision to leave the company upon learning of George’s\nviews. 99     Sometime\nin May 2011, there was a phone conversation between Porter, Khuman\nand Nagender during which it was explained to Nagender that George\nwished to step down later in 2011 and that a search was beginning\nimmediately for a new, externally sourced CEO to replace him (George).[note: 104]I\nbelieve that this would be a much stronger signal to Nagender because\nthere were now some plans for a definite change in Global CEO with\nGeorge stepping down in a few months’ time. Moreover with a new\nGlobal CEO to be sourced externally, it would be quite untenable\nfor Nagender to stay. I believe Nagender would be pushed hard to\nmake up his mind to resign. I can understand that resignation from\na very senior position in a company that a person had long worked\nfor would be a major and very difficult decision to make. No doubt\nthat person would have to go through some long and hard thinking\nbefore finally reaching a firm decision to quit. 100    On\n9 June 2011, George forwarded to the global shareholders an email he\nhad sent to Gareth on 2 June 2011 admonishing Inflexion for its meddling\nin the business. Interestingly, it contained a line that said that\nthe “activity for recruiting a CEO has to be postponed”.[note: 105] 101    On\n21 and 22 June 2011, Nagender resigned from the board of Griffin India\nand the Griffin Global board respectively. I view them as concrete steps\ntaken by Nagender pursuant to a clear decision to resign which I believe\nmust have been firmed up earlier. This reaction was additionally sparked\nby an email from Marcus attaching notes from a previous discussion[note: 106]and minutes from a global board meeting\non 24 May 2011 in which Nagender was not in attendance. The latter\ncontained the line “Singapore was discussed and an approach agreed”.[note: 107]Nagender apparently\nconsidered “Singapore was discussed” to mean “Nagender was discussed”\nand took umbrage.[note: 108] 102    It\nis not disputed that Marcus called Nagender on 22 July 2011 to notify\nhim of the possible appointment of one Mr Simon Morse as the executive\nchairman of the Griffin Group’s board.[note: 109]Nagender recorded this\nconversation. He asked Lantone to retrieve the recording. Lantone\nthen informed him that there were other phone recordings from the\nPlaintiff’s phone extensions. Nagender asked Lantone to retrieve\nthese files as well. He claimed that it was then that he came across\ncertain conversations between George and Khuman on 20 June and 4\nJuly 2011 which revealed to him “the scale of complicity between\nthese two individuals” and he decided to quit because it “would\nbe untenable to continue working with such manoeuvring occurring\nbehind the scenes”.[note: 110]I think this confirmed\nthe decision that he had already made earlier to quit and a point\nof no return had now been reached for his decision to resign. 103    On\n16 August 2011, Nagender finally acted and tendered his resignation\nas the managing director of the Plaintiff.[note: 111]On\n19 September 2011, he also resigned from the Plaintiff’s board of\ndirectors.[note: 112] Analysis on the Global CEO succession\nissue 104    The\nPlaintiff’s case was that Nagender knew in late 2010 anddefinitelybefore February 2011 (when\nthe first of the New Entities, Quest Horizon, was incorporated)\nthat he was not going to be appointed as the Global CEO.[note: 113] 105    The\nDefendant’s case was that until mid-2011, there was no clear message\nfrom the Griffin Group that Nagender would not be made the Global\nCEO at any time.[note: 114]Moreover, the Defendants asserted\nthat Nagender’s position was that he would only leave the Plaintiff\nwhen he wassurethat he would not\nbe made the Global CEO,[note: 115]and that day only came sometime\nin July 2011. 106    In\nmy view, it is unlikely that Nagender had conceived of a plan for revenge\nas early as February 2011, when he was supposed to have masterminded\nthe setting up of Quest Horizon, which was eventually incorporated\non 21 February 2011. Quest Horizon was allegedly the first of the\nNew Entities which was formed to compete with the Plaintiff. Nagender was\nnever given any conclusive indication that his appointment as the Global\nCEO was definitely off the table at this time. While the events\nof the Athens meeting on 12 January 2011 could not be said to be\na clear indicator that the plan to make him the Global CEO had been\nreinstated, it was an example of the conflicting signals that Nagender\nhad been getting. In fact, Nagender was appointed as the chairman\nof the management committee of the Griffin Group, and George even\nsent an email on 14 January 2011 to tell Porter that Nagender had\ndecided to stay. This was because the management committee had agreed\nto put on hold the external recruitment of a potential CEO. In February\n2011, George and Nagender visited the USA and Brazil to assess the\nGriffin Group’s operations there and establish if improvements could\nbe made. It does not appear to me that Nagender at this point of\ntime was already harbouring a firm intention to resign. Why would\nNagender want to be involved in any of these tasks and take on larger global\nroles if he had already made up his mind to resign at this time?\nGiven Nagender’s personality where he would not hesitate to make\nhis displeasure known, I do not think it is likely that he would\nagree to take on these additional tasks in February 2011. 107    However,\nsubsequently in an email dated 28 March 2011 (see [97] above), George\ntold Nagender that he was not ready to be made the Global CEO. By\nthis time, his relationship with George was already very strained. Furthermore,\nNagender was told by Khuman and Porter sometime in May 2011 that\nthere were plans to search for an external CEO to replace George, who\nwished to step down later in 2011. By now, he had been told by both the\nincumbent Global CEO and the chairman that he would not be stepping up\nto the Global CEO position. Nagender’s resignations from the board\nof Griffin India and the Griffin Global board came swiftly thereafter\non 21 and 22 June 2011 respectively. These resignations from the\ntwo boards indicate to me that Nagender would likely have made up\nhis mind to resign by now. If it were otherwise, why would he resign\nfrom the Griffin India board and the Griffin Global board? However,\nNagender gave a reasonable explanation why he made up his mind to\nresign only in July 2011 (see [102]). I accept Nagender’s evidence\nto mean that, in his mind, his decision to resign had been firmed\nup to the point that he would not change his mind at all whatever\nthe circumstances and even if the Plaintiff were to re-offer him\nthe Global CEO position. He had crossed the Rubicon. 108    Based\non the evidence set out above, I find that Nagender would likely have\nmade a firm decision to quit the Plaintiff sometime between May\nand July 2011. In fact, as my subsequent analysis on one of the\nissues in this case will reveal, this timeframe can probably be\nfurther narrowed to be somewhere between 17 June and July 2011 (see\n[376] below). Although it is not possible to pin-point the specific\ndate at which his resignation decision was finally made, what seems\nclear to me is that, as at February 2011, Nagender hadnotyet made up his mind to resign and\nit is unlikely that he would have started implementing a devious\nmasterplan to undermine the Plaintiff, if there was even one at\nall. One inference is that the earlier planning and eventual incorporation\nof Quest Horizon on 21 February 2011 was more likely the independent\nprivate activity of its shareholders than one involving Nagender\nas the mastermind instigating these shareholders to join him in\nsetting up a conglomerate to be spearheaded by him with Quest Horizon\nas a holding company in order to compete with the Plaintiff. Furthermore,\nI do not believe that any of the other Defendants would have shared\nany of the ill feelings that Nagender harboured, which arose from\nthe Plaintiff’s refusal to appoint him as Griffin’s Global CEO. 109    I\nnow examine the circumstances surrounding the setting up of the New\nEntities.",
        "The setting up of the New Entities": "The Defendants’ evidence on\nQuest Horizon and Niado 110    According\nto the Defendants, the idea for Quest Horizon originated from discussions\nthat Adella had in late 2010 with some of her colleagues, including\nAnnie and Madhu Kumar (“Madhu”), who was the general manager of\nthe Plaintiff’s branch in Perth, Australia until his resignation\non 4 October 2011. Adella had the idea of pooling her money with\nsome of her colleagues to invest in preparation for retirement,\nand one of the investment ideas was to invest in property in Thailand.\nShe also reached out to Nagender, who declined to participate. Instead,\nhe told Adella that he would be happy to give them advice or assistance.[note: 116]Adella said it was Nagender who came\nup with the idea of incorporating a company.[note: 117]Adella also approached\nLeny but she similarly declined as she already had plans to invest\nin her father’s vegetable export business in Medan.[note: 118]In the end, only Joanna, Annie, Madhu\nand Adella decided to participate.[note: 119] 111    In\nJanuary 2011, Leny set up an online discussion group named new-venture-2011@googlegroups.com\n(“the Google Group”). Joanna said she had asked Leny to set up the\nGoogle Group to facilitate communications regarding the incorporation\nof Quest Horizon as Joanna was based in Sydney and Leny was more\ntech savvy than she was.[note: 120]Other\nthan Annie, Joanna, Adella and Madhu, the Google Group also included\nLeny, Prasad and Nagender, even though the three persons had not\nexpressed any interest in investing in Quest Horizon. Leny was a\nmember because she helped set up the Google Group, while Prasad\nand Nagender were added so that their advice regarding matters of\nincorporation could be sought.[note: 121] 112    On\n6 January 2011, Joanna sent an email to the Google Group stating:[note: 122] Hi Nagender, The following has been taken: - Universal Quest - Quest Capital - Quest Group - Quest International - Universal Quest - Quest Company - Venture Quest - Global Quest What about the following: - T-Quest (T-for team) - Cosmic Quest - Quest Horizon Any other input? 113    Nagender\nreplied on the same day saying “Quest Horizon looks good”.[note: 123]As\nto why Nagender’s input on Quest Horizon’s name was sought, Nagender\nsaid he thought that Joanna was merely seeking his opinion out of\ncourtesy.[note: 124]Adella\nalso testified that the future Quest Horizon shareholders had already\ndecided on Quest Horizon as the name for their new enterprise, so\nthe fact that Nagender thought the same way was merely coincidence.[note: 125] 114    The\noriginal idea of purchasing property in Thailand was later abandoned\nafter Adella found out about the restrictions on foreign ownership\nthere.[note: 126]Despite\nthis setback, Madhu, Joanna, Annie and Adella decided to proceed\nwith the pooling of their moneys and the incorporation of Quest\nHorizon in order to be prepared for any investment opportunities\nwhich might arise, although they did not have any firm decision\nas to what they were going to do.[note: 127] 115    On\n21 February 2011, Quest Horizon was incorporated with Annie and\nAdella as directors. There were four shareholders – Joanna (10%), Annie\n(10%), Adella (35%) and Madhu (45%) – and their respective shareholdings\nreflected their contributions. The initial paid up capital was $250,000. 116    Prasad\ndid not end up assisting in the incorporation of Quest Horizon (which\nwas done with the assistance of KhattarWong LLP). However, he helped\nby liaising with IP Consultants Pte Ltd (“IP Consultants”) which Quest\nHorizon had engaged as its corporate secretary.[note: 128] 117    In\nMarch 2011, Quest Horizon email accounts were created for the members\nof the Google Group. Leny (allegedly at Joanna and Annie’s request)\nhad asked Sandeep of Lantone to set up an email domain for Quest Horizon.\nAs for Nagender, they created an account for him out of politeness.[note: 129]Nagender claimed he did not know he\nhad a Quest Horizon email account.[note: 130]Quest Horizon’s email access\nrecords showed that Nagender’s email account was created on 25 March\n2011 and last accessed mere days later on 31 March 2011,[note: 131]indicating\nthat he did not use the email account much, if at all. 118    Quest\nHorizon’s first (and only) corporate investment was in Niado. According\nto the Defendants, the opportunity first came about when Cornel\napproached Nagender with a proposal to collaborate on setting up\na business-to-business booking system relating to travel procurement.[note: 132]By way\nof background, Cornel had known Nagender for a long time.[note: 133]Cornel’s company, Net\nVision, had previously delivered a product named Transocean Reservation\nExchange or “TREX” to the Plaintiff, which was used to meet the\ntravel requirements of one of the Plaintiff’s major customers, Transocean\nInc.[note: 134]Cornel\nand Nagender had a “casual discussion” regarding Cornel’s proposal\nin late 2010, but the main discussion took place sometime in early\nMarch 2011.[note: 135]Cornel\nalso approached Sandeep, who agreed to participate in this venture\nwith a small stake.[note: 136] 119    Cornel\ntestified that Nagender declined his proposal around a week or two\nafter the discussion in early March 2011 without saying why.[note: 137]Nagender\nsuggested that Cornel approach “the ladies” – namely, Joanna, Annie\nand Adella.[note: 138]Cornel\nhad worked closely with the three of them, as well as Leny, while\non the TREX project.[note: 139]Cornel said he decided to\ntalk to them because they had the expertise from a travel agent’s\nperspective, which was the type of input he needed for the project.[note: 140]Cornel stated that\nJoanna, Annie and Adella agreed to his proposal towards the end\nof March 2011.[note: 141]I believe\nthe evidence of Cornel, and in particular, that he had approached\nNagender, who declined to join in the venture. I pause here to observe\nthat if there was a conglomerate spearheaded by Nagender to compete\nwith the Plaintiff in the travel agency business, it would be very odd\nthat he would have allowed the intended holding company of that conglomerate,ie, Quest Horizon – which Nagender was\nsupposed to have a 45% interest with Madhu as his nominee according\nto the Plaintiff (which will be discussed subsequently) – to take\nup a 45% share in Niado, when Nagender showed no interest in the\nproject proposed by Cornel in the first place. 120    Sometime\nin the middle of April 2011,[note: 142]Adella\nand Annie started sourcing for business premises for Niado, as well\nas Quest Horizon.[note: 143]As for why the search started\nso quickly, Cornel’s evidence was that the lease for Net Vision\nwas also expiring. Net Vision therefore needed a space quickly and\nit made sense to get premises together with Niado.[note: 144]The decision to take\ntwo adjacent office units at Changi Business Park (“the Changi Offices”)\nwas made by 25 April 2011.[note: 145]Again,\nI have no reason to disbelieve this part of Cornel’s evidence. 121    Niado\nwas incorporated on 27 April 2011 with a paid-up capital of $80,000,\nand with Annie, Cornel and Sandeep as directors.[note: 146]Quest Horizon\nand Cornel each held 45% of the shares while Sandeep held the remaining\n10%. Cornel testified that the word “Niado” came from the names\nof his two children.[note: 147] 122    During\nthis period, the shareholders of Quest Horizon also injected additional\ncapital into it. According to Joanna, this was for the purpose of defraying\nrental and renovation costs.[note: 148]The share capital of Quest Horizon\nwas therefore increased to $375,000.[note: 149]Later in\nJuly 2011, there were discussions to again increase the share capital\nof the company to $410,000,[note: 150]but this was shelved in favour\nof infusing funds by way of shareholders’ loans instead. 123    On\n31 May 2011, Niado and Quest Horizon signed tenancy agreements for\nthe Changi Offices. Quest Horizon was the named tenant for unit\nno 08-03[note: 151]while Niado was the named tenant\nfor unit no 08-04.[note: 152]The total rent for the Changi Offices\ncame up to a combined $11,323.11 a month.[note: 153] 124    Quest\nHorizon’s unit in the Changi Offices would eventually be shared\nby the following companies: Net Vision, BHEA Tech, EGSoft Pte Ltd\n(“EGSoft”), and Signature Sparks. EGSoft was owned by one of the Defendants’\nex-colleagues, Mr Yashpal Singh. While these parties contributed\nto the rent, Quest Horizon did not charge them a premium. Adella\nexplained that the sharing of premises was merely a means of reducing\nthe rent.[note: 154]I accept Adella’s\nevidence on this point. 125    Leny\nhad an active role in the renovation of the Changi Offices. Leny said\nshe had agreed to help because Madhu and Joanna were in Australia while\nAdella and Annie were busy with the Plaintiff’s work. By this time, Leny\nhad already resigned and was serving the tail end of her notice\nperiod, which meant that she had more time.[note: 155] 126    Adella,\nAnnie and Leny decided to engage D’Perception to assist Quest Horizon\nwith the renovation of the Changi Offices. D’Perception had renovated\nthe Plaintiff’s premises in the past. Leny asked Nagender to put her\nin touch with the firm[note: 156]and Nagender called Andy,\nwho was its owner.[note: 157]Adella said that the cost\nof renovation was about $130,000 to $140,000.[note: 158] Analysis 127    The\nPlaintiff argued that there were numerous suspicious circumstances\nthat gave rise to the inference that Quest Horizon was meant to\nbe much more than a passive investment company:[note: 159] (a)     the\nDefendants had differing views as to why and how Quest Horizon came\nto be formed; (b)     Quest\nHorizon’s activities were inconsistent with a passive investment\nvehicle; (c)     the\nnamed directors and shareholders did not appear to have been the\ndriving force behind Quest Horizon; and (d)     the\nevidence supported the Plaintiff’s case that Quest Horizon was incorporated\nas the holding company in Nagender’s conglomerate of companies. 128    I\nwill not deal in this judgment with each and every one of the numerous\narguments raised by the Plaintiff as I am of the view that the Defendants\nhave given adequate explanations for all that transpired. I will, however,\ncanvass some of the Plaintiff’s more important arguments. 129    Regarding\nthe alleged inconsistencies in the Defendants’ evidence surrounding\nthe formation of Quest Horizon, these were all minor discrepancies\nat best. For example, whether the initial discussion to pool their\nmonies together for investment purposes took place around Adella’s desk\nor in a conference room[note: 160]was immaterial and this is\nthe sort of detail that can easily slip from one’s mind. As for\nthe differences in the Defendants’ accounts of the purpose and idea\nbehind Quest Horizon’s formation, it was merely a case of different\nindividuals using different ways or turns of phrase to express the\nsame thing. For example, Joanna mentioned that the idea of pooling\ntheir savings was “really for growing [their] savings faster”[note: 161]while Leny said it was a way\nto “pool funds together for investment”.[note: 162] 130    The\nPlaintiff also argued that Quest Horizon was not just a passive investment\nvehicle, as a passive investment vehicle would not have selected an\nunestablished start-up like Niado as a major investment. It was\nhardly the type of stable, low-risk investment that people looking\nto safeguard their capital would normally invest in.[note: 163] 131    There\nis nothing out of the ordinary for the shareholders of Quest Horizon\nto select Niado as its major investment. Cornel was a persuasive man\nwho was clearly not short on confidence. He made big promises of\nbig profits – his projected valuation of Niado was a head-turning\n$50m to $100m.[note: 164]While investing\nin Niado was clearly a risk, it was not an uneducated one since\nJoanna, Adella and Annie had worked with Cornel before and knew\nhow well TREX had worked for the Plaintiff. I am not surprised that\nthe shareholders of Quest Horizon would have invested in Niado despite\nit being a start-up company because they shared in Cornel’s vision\nand believed in his promises of high returns at that time. Nagender, however,\nshowed no interest for reasons of his own. It would appear that Niado\nhas remained a struggling start-up and Nagender was wise not to have\ninvested in it. 132    The\nPlaintiff argued that if Cornel so strongly desired the particular expertise\nof Quest Horizon’s shareholders, it was strange that he only required\nAnnie, Adella and Joanna to “answer” his “questions”.[note: 165]I\ndo not find this strange because while Cornel might have the relevant\ndomain knowledge in software development, he needed the users’ input\nand perspective to help him develop the software system. For this,\nAnnie, Adella and Joanna would be capable of providing the necessary\nusers’ input. I accept Cornel’s evidence that he wanted to have\na travel agent’s perspective and answering his questions was really\nall they could do to help. In any event, they would not have the\nfull picture of what was involved in developing the whole system.[note: 166] 133    The\nPlaintiff also raised several points regarding Quest Horizon’s leasing\nof the Changi Offices, which are summarised as follows:[note: 167] (a)     A\npassive investment vehicle would not need any business space of\nits own and the taking of actual office space would mean significant overhead\ncosts. (b)     Niado\nwas not active in 2011 and would not have required such a large\nspace. Quest Horizon also took up office space beyond what Niado\nneeded. (c)     Even\nif the additional space was taken so that Niado could expand, the\nrush to obtain the tenancy of the Changi Offices was inexplicable. (d)     Therefore,\nthe taking of the tenancy wholly for Niado’s benefit was unbelievable.\nThe lease of the Changi Offices must have been for Quest Horizon’s\nown benefit, which does not accord with the stated purpose of Quest\nHorizon being a passive investment company. 134    It\nwas certainly possible for Quest Horizon to have acquired larger premises\nthan it needed for Niado’s future expansion. I also accept Cornel’s explanation\nthat he was also looking for new premises for Net Vision at the same\ntime, which accounted for the hurry. 135    The\nPlaintiff then made a number of arguments that essentially boiled down\nto the unlikelihood of a passive investment company incurring so much\nmoney on overhead costs and on renovation costs relating to the Changi\nOffices, without trying to earn a profit from those sharing the premises.\nMoreover, it appeared that Quest Horizon effectively bore Niado’s\nshare of the rent. It also appeared to bear a number of significant costs\nwhich were not redistributed to the rest of the New Entities, such\nas those in relation to electrical works, fire protection works\nand so on. The Plaintiff further highlighted that Quest Horizon\nhad bought 26 Dell computers which the Defendants claimed were bought\nprimarily for Niado’s usage; yet Cornel had stated that the employees\nof both Net Vision and Niado used their own laptops and not the\nDell monitors.[note: 168] 136    First\nof all, I note that Quest Horizon had carefully apportioned the amounts\nthat each of the entities sharing the premises had to contribute towards\nthe rent and renovation costs.[note: 169]This goes some way towards showing\nthat they were distinct entities that kept their own accounts. For example,\nthere were invoices issued to BHEA Tech for its use of the Changi Offices,\neven though BHEA Tech is said to be a part of Nagender’s purported\nconglomerate.[note: 170]As for why Quest Horizon\ndid not charge a premium to the other companies based there, I accept\nthat it was because Quest Horizon’s shareholders did not view the\nsharing of premises as a money-making venture but rather as a means\nof reducing the rent which Quest Horizon had to pay.[note: 171]It\nis certainly reasonable for them to have felt that making money\nout of close friends and colleagues by charging a premium for the\nspace shared was not an entirely palatable thing to do. 137    Although\nQuest Horizon allowed Niado to use the Changi Offices rent-free,\neven incurring additional costs on Niado’s behalf, this was consistent\nwith it being a shareholder and investor in Niado. I accept the Defendants’\nargument that these expenses were essentially Quest Horizon’s continued\ninvestment in Niado. As for the Dell monitors, they could have been\nintended for Niado’s use, even if the employees never actually used it.[note: 172]Moreover,\nit was Cornel’s evidence that he was putting in long hours at Niado[note: 173]for free.[note: 174]In these circumstances,\nit was only fair for Quest Horizon, as the other major shareholder\nof Niado, to bear a greater share of the resulting expenses, a point\nCornel alluded to during cross-examination.[note: 175]Moreover, if the shareholders\nof Quest Horizon had bought into Cornel’s sales pitch, the amounts\nspent by Quest Horizon were relatively low compared to the potential\ngains. I should also add that, rather strangely, one of the Plaintiff’s\narguments that Niado could not have been merely an investment by\nQuest Horizon was the fact that its shareholders chose not to pumpmoremoney into Niado when they could\nhave.[note: 176]It seems that, for the Plaintiff,\nQuest Horizon was, at the same time, both spending too much and\ntoo little money on Niado. 138    The\nPlaintiff also pointed out that some of the other Defendants were more\nactive in Quest Horizon than its shareholders. For example, even though\nMadhu held 45% of the shares in Quest Horizon, his participation appeared\nto be minimal,[note: 177]while Joanna (a 10% shareholder)\nwas much more involved.[note: 178]The Plaintiff even suggested\nthat Madhu was really a proxy for Nagender, as I have alluded to\nat [119] above.[note: 179] 139    It\nis not unusual for a shareholder’s involvement in a company to be disproportionate\nto his or her shareholding. The Plaintiff’s assertion that Madhu\nwas Nagender’s proxy was not backed up by credible evidence and indeed,\nas the Defendants highlighted, was never even pleaded by the Plaintiff.[note: 180]Madhu’s\nperceived lack of involvement was justified by the fact that he\nwas based in Australia and was thus not in the best position to comment\non many matters. I agree with the Defendants that it is entirely plausible\nfor a shareholder to leave the running of a business to others who are\nbetter placed to do so.[note: 181] 140    Nagender,\nin particular, was singled out for having an “unusual level of involvement\nin Quest Horizon”.[note: 182]For example, the Plaintiff argued that\nit was actuallyNagenderwho chose\nthe Quest Horizon name based on his email exchange with Joanna (see\n[112]–[113] above).[note: 183]There is nothing strange\nat all about Joanna asking Nagender for his opinion or that the\nname Nagender liked (out of three options) also turned out to be\nthe name chosen for the company. People can like the same things. 141    However,\nI found that Nagender’s participation in the renovation of the Changi\nOffices raises more legitimate questions. It was Andy’s evidence that\nwhen Nagender called him to engage D’Perception for the renovation works,\nNagender referred to it as the “QH Project” and that it was a private project\nundertaken by him and Leny. Andy also alleged that Nagender had given\nhim strict instructions that the “QH Project” was not to be mentioned to\nthe Plaintiff and never to be discussed at meetings at the Plaintiff’s office.[note: 184] 142    Andy’s\nimpression that Quest Horizon was a “private project” by Nagender\nand Leny is consistent with an email Andy sent to his employees on\n9 May 2011 which stated:[note: 185] … this project is although by the boss\nof Griffin (our past client), BUT it is not to be associated with\nGriffin as this is a PRIVATE project by Nagendar [sic]\nand Leny and hence to be referred to as QH PROJECT and NOT to be mentioned\nwhen in GRIFFIN and all meetings pertaining to this project is to be\ncarryout OUTSIDE of GRIFFIN premises unless Nagendar arrange to\nbe in his GRIFFIN Office. … 143    The\nway that this email was drafted indicates to me that Nagender had\nimpressed upon Andy that the renovation of the Changi Offices was\nto be kept under wraps. While I accept that this could potentially\nraise an inference that Nagender was more closely associated to\nQuest Horizon than he was willing to reveal, I note that there are\nother possibilities which may affect the strength of the inference\nraised. 144    For\nexample, I note that during cross-examination Andy was unable to\nconfirm whether Nagender did say that hepersonallywanted\nto engage D’Perception. Andy said this impression came from the\nfact that only Nagender had spoken to him at the point.[note: 186]Indeed, Andy readily admitted\nthat he could not say who the “key person” behind the project was.[note: 187] 145    Similarly,\nan email from Andy’s employee with the header “QH Project @ Signature\nPark [sic] for Nagendar [sic]” was sent to Leny and Joanna, and\nalso copied to Nagender, at 11.29am on 9 May 2011.[note: 188]None of\nthe Defendants informed the employee in writing that it was not\nactually Nagender’s project although Leny and Joanna claimed that\nthey had done so orally.[note: 189]However, whether or not\na correction was made orally or even at all was not critical as\nthe failure to do so did not indicate that Joanna, Leny and Nagender\naccepted the email header as accurate. Furthermore, it was such\na minor matter that I would not generally expect any of the Defendants\nto bother to inform the employee to correct the header even if they\nhad found it to be inaccurate. 146    Andy\nalso claimed that he saw Nagender at the Changi Offices during a\nsite visit on 9 May 2011.[note: 190]The Defendants argued that\nAndy could not possibly have seen Nagender because Andy himself\nhad not attended the site visit, according to an email by Andy containing\nthe following final paragraph:[note: 191] P/S: Leny and Joanna – I will be tied up\nthis afternoon but please liaise with Sherine (hp [redacted]), she\nwill assist me to oversee the site marking, thks. 147    While\nAndy conceded during cross-examination that it waspossiblethat\nhe was not actually there,[note: 192]I accept\nthat Andy was likely to have been present. Andy’s recollection regarding\nNagender’s behaviour at the site visit was vivid. This indicated\nthat Nagender gave some input on the renovation of the Changi Offices\nat the beginning. However, it does not appear that his preferences\nwere decisive, as one might expect if he was the mastermind of the\nwhole affair. In any event, I note that Nagender was not copied\non any emails in relation to the renovation after 10 May 2011[note: 193]and Andy also\nagreed that his dealings with Nagender were less after that date.[note: 194] 148    There\nwas also the question of why, if Nagender was not interested in Quest\nHorizon, he was seen multiple times at the Changi Offices, including by\nCornel and Indraneel. I note, however, that Cornel only saw Nagenderafterthe renovations had been completed[note: 195]and Indraneel only recollected\nseeing Nagender there from July onwards.[note: 196] 149    Nagender’s\nactivities in the Changi Offices after June 2011 can be explained\nby the fact that he had apersonaland\nseparate interest in the Changi Offices, as it was his evidence\nthat he had identified it as the possible premises for what he claimed\nto be his wife’s venture (ie, QRS)\nby that date.[note: 197]However, I do find it curious\nwhy Nagender was so involved in the renovation of the Changi Offices\nin early May 2011 when Kavita’s interest in starting a business\n(which later became QRS) began only in late June 2011 apparently.\nThis raises suspicions whether Nagender already had a substantial\nindirect interest in Quest Horizon, perhaps through Madhu, which\nis part of the Plaintiff’s case theory. 150    This\nis certainly not a case where all the evidence clearly points in\none direction, in which case it will be relatively easy to decide.\nWhen the evidence points both ways and where inferences drawn also\npoint in different directions, I have to assess the evidence that\nsupports the Plaintiff’s case on one side and also that in support\nof the Defendants’ case on the other side. I have to carefully weigh\nand consider all the evidence as a whole and make findings of fact\non a balance of probabilities, having regard to the fact that the\nPlaintiff bears the burden to prove its claims. In other words,\nthe issue of whether Nagender had any material involvement in Quest\nHorizon or whether Quest Horizon was part of a conglomerate below\nrequires aglobalappreciation of\nthe case. I will return to this question below at [277]. The Defendants’ evidence on\nBHEA Tech 151    The\nDefendants’ case was that the incorporation of BHEA Tech resulted\nfrom a request in early 2011 by Indraneel and Mr Ram Kumar (“Ram”),\nthe owners of BHEA India, for Nagender’s assistance with the setting\nup of a subsidiary in Singapore.[note: 198]Indraneel’s evidence\nwas that BHEA India had been recently engaged by a new customer\nin Singapore, the Banyan Tree Group, and they needed to have a presence\nin Singapore to facilitate doing business in Singapore.[note: 199] 152    At\nthe time, BHEA India was engaged by the Plaintiff (through Lantone,\nthe Plaintiff’s IT services provider) to customise the Plaintiff’s CRM\nsystem, which was known as SugarCRM.[note: 200]However, in or around July\n2010, the Griffin Group began an initiative to adopt a common CRM system\nacross all the entities in the Griffin Group.[note: 201]Pursuant to this, BHEA India\nwas asked to submit a response to the Request for Proposal (“RFP”).\nIndraneel said that he found the RFP confusing as he had thought that\nthe SugarCRM customisation they had been engaged for was for the entire\nGriffin Group. Nevertheless, BHEA India submitted its response to the\nRFP on 30 March 2011.[note: 202]In any event, BHEA India\ndid not win the tender. On 22 July 2011, the global CRM tender was\nwon by Salesforce, Inc, the vendor of a CRM system known as Salesforce.[note: 203]This\nmeant that the version of SugarCRM the Plaintiff was using would\n(as Nagender admitted) eventually become obsolete.[note: 204] 153    Nagender\nagreed to assist in the incorporation of BHEA Tech since he saw\nno conflict of interest between the Plaintiff and BHEA India.[note: 205]Moreover, Indraneel and Nagender had\nan understanding that if the Plaintiff assisted BHEA India with\nthe incorporation of the Singapore entity, Indraneel would not charge\nthe Plaintiff for most of his subsequent visits to Singapore to\ndiscuss the ongoing implementation of the customised SugarCRM system.[note: 206]During\nthis time, Indraneel also asked Nagender whether he would be interested\nin becoming a shareholder in BHEA Tech. Nagender did not give Indraneel\nan answer immediately.[note: 207] 154    Nagender\nsubsequently instructed Prasad to assist with the incorporation\nof BHEA Tech.[note: 208]In turn, Prasad\nasked Annie and Adella if they were willing to help by acting as\nthe first shareholders and directors of BHEA Tech before BHEA India\ntook over. Annie and Adella agreed. Prasad decided to incorporate\nBHEA Tech using IP Consultants since he had already been in contact\nwith IP Consultants for Quest Horizon matters.[note: 209] 155    In\nlate April 2011, Indraneel told Annie that BHEA India was looking for\noffice premises for BHEA Tech in Singapore, upon which Annie offered to\nshare Quest Horizon’s office premises with BHEA Tech. Indraneel eventually\nagreed as it was cheaper than their other options.[note: 210] 156    BHEA\nTech was incorporated on 27 April 2011 with Annie and Adella as\ndirectors and an initial share capital of $100 in 100 shares solely owned\nby Annie.[note: 211]Indraneel\nsaid this arrangement was temporary as BHEA India needed a local\ndirector on the board of BHEA Tech and he wanted to incorporate\nBHEA Tech quickly to begin business with potential clients in Singapore,\nand the process of collating the necessary documentation from BHEA\nIndia’s shareholders would have taken some time.[note: 212] 157    In\nMay 2011, Nagender finally declined Indraneel’s earlier offer for him\nto invest in BHEA Tech.[note: 213]Nagender told Indraneel\nthat if BHEA India was keen to have a partner in Singapore, he could\napproach Quest Horizon which was looking to invest in business ventures.\nIndraneel and Ram thought it was a good idea as they knew the shareholders\nof Quest Horizon and were going to share premises with Quest Horizon.[note: 214] 158    In\nJune 2011, Ram and Indraneel visited Singapore and held discussions\nwith Joanna. At the meeting, Joanna said that Quest Horizon would\nneed to consider the matter further. Nevertheless, they carried\non the discussions on the assumption that Quest Horizon would subscribe\nto about a 7% stake in BHEA Tech. Prasad assisted in working out\na possible shareholding plan on this basis and it was then circulated\nunder the cover of his email dated 9 June 2011.[note: 215]Ultimately,\nQuest Horizon did not proceed with the proposed investment in BHEA\nTech, which Joanna said was because of fears of conflicts of interest.[note: 216]The Quest Horizon shareholders\ndecided not to proceed with the proposed investment in BHEA Tech,\na decision they came to themselves, without any input from Prasad\nor Nagender.[note: 217]Also in June 2011, Indraneel\nsaid he again approached Nagender (through Prasad) to see if he\nwas interested in investing in BHEA Tech by way of a loan note,\nbut was again rebuffed at the end of that month.[note: 218]I have no reason to disbelieve\nthe evidence of Indraneel. 159    On\n22 August 2011, a resolution was passed for the allotment of 1,900 new\nshares in BHEA Tech to the shareholders of BHEA India.[note: 219]On\n12 September 2011, Annie transferred all her shares in BHEA Tech\nto Indraneel.[note: 220]On\n28 September 2011, Adella resigned as a director from BHEA Tech.[note: 221]Further, on 1 October 2011, Annie\nsought to resign from BHEA Tech but her resignation was not accepted\nby BHEA Tech, which requested that she remain as a local director\nuntil it found a replacement. She remained a director of BHEA Tech\nuntil 15 April 2013.[note: 222]BHEA Tech also shifted out\nof the Changi Offices sometime in March or April 2013.[note: 223] 160    Ultimately,\nAnnie and Adella only acted as nominee directors[note: 224]and were not\npaid any directors’ fees.[note: 225]None\nof the Defendants have any current interest in BHEA Tech. Analysis 161    The\nPlaintiff submitted that the Defendants’ explanations that their involvement\nin BHEA Tech was only to assist in its incorporation and be temporary\ndirectors was completely implausible: (a)     It\nwas incredible that Annie and Adella would have so obligingly involved\nthemselves in BHEA Tech merely on the orders of Prasad, considering\nthat being the director of a company carries with it serious obligations.[note: 226] (b)     When\nthe Plaintiff confronted Annie and Adella with the facts of their\ninvolvement in BHEA Tech, they never said that they had been involved\nin BHEA Tech at the express direction of the Plaintiff.[note: 227] (c)     The\nDefendants had engaged in numerous other activities that went beyond\nassisting in BHEA Tech’s incorporation, such as the fact that Quest\nHorizon considered taking a 7% shareholding in BHEA Tech, and certain\nalleged payments to BHEA India from Quest Horizon and Nagender.[note: 228] (d)     Annie\nand Adella, being senior operations employees of the Plaintiff,\nwere appointed as directors of BHEA Tech instead of someone completely\nuninvolved in the operations of the Plaintiff and its use of CRM\nsystems.[note: 229] (e)     Two\nlocal directors were appointed instead of just one (as required\nby the Accounting and Corporate Regulatory Authority) and Annie\nbecame a shareholder when there is no requirement for a local shareholder;\nand[note: 230] (f)     The\nDefendants used their Quest Horizon emails and/or personal email\naddresses while dealing with BHEA Tech.[note: 231] 162    The\nDefendants had adequate explanations for each of the issues above.\nFor example, there was nothing strange about asking Adella and Annie\nto help, or the fact that they agreed. Certainly, Prasad could have directed\nIndraneel and Ram to a third-party corporate secretary instead of Adella\nand Annie – but that would not have been consistent with the generation\nof goodwill with BHEA India, as the Defendants’ argued.[note: 232]Annie\nbeing the first shareholder was also adequately explained by Prasad being\nproactive and starting the process of incorporation before the exact shareholding\ndetails could be finalised.[note: 233] 163    As\nfor the alleged payments to BHEA Tech, Prasad did use $1,900 of Quest\nHorizon’s funds for the purpose of increasing BHEA Tech’s share capital,\nbut it was clear that it was merely an advance (which of course implies\nthat the sum should be repaid).[note: 234]The Plaintiff had also relied on certain\ninternal accounting related documents that seemed to show that Quest\nHorizon had made other direct payments to BHEA India,[note: 235]but this was\ncontradicted by BHEA India’s accounts which showed that it was Lantone\nthat settled these bills.[note: 236] 164    Nagender\nadmitted that while he did make a number of direct payments to BHEA\nIndia, these were in respect of certain bills owed by the Plaintiff\nthat had been pending for some time. As these sums were in Indian rupees,\nhe remitted them from his own account first, before claiming for reimbursements.[note: 237] 165    As\nto the fact that Quest Horizon considered investing in BHEA Tech,\nthis is a neutral factor. It does not point to BHEA Tech being incorporated\nas part of a conglomerate, and the existence of discussions that\ncame to nought may even point in the opposite direction. 166    Crucially,\nPiyush, a witness for the Plaintiff who had been involved in asking\nBHEA Tech’s company secretary to create necessary resolutions to make\nBHEA India’s directors and shareholders the directors and shareholders\nof BHEA Tech, was certain that the intention was for BHEA Tech to\nbe owned and controlled by the shareholders of BHEA India,[note: 238]and not Nagender.[note: 239]He even said\nhedefinitelyknew that Adella and Annie\nwere involvedpurelybecause there\nwas no local director from BHEA India.[note: 240] 167    On\nthe whole, I believe the evidence given by Indraneel and the Defendants\nin relation to the circumstances surrounding the setting up of BHEA\nTech, and the question of why Adella and Annie were made directors\nof BHEA Tech. I do not accept the submissions of the Plaintiff that\nBHEA Tech was also a part of the alleged conglomerate. The Defendants’ evidence on\nQ4T Singapore and Q4T Australia 168    According\nto Rahul, he learnt in early 2011 that Nagender’s anticipated promotion\nto the Global CEO position might be aborted and that Nagender might\nremain with the Plaintiff in Singapore. Soon after, he found out\nabout Leny’s resignation in February 2011.[note: 241] 169    In\nMay 2011, he heard from Leny that Ali might possibly be placed in charge\nof operations in the Asia Pacific region. This placed further doubts in\nRahul’s mind as to who would be in charge of the Plaintiff in the future.[note: 242]He had worked with Ali previously and\nhad an unhappy experience.[note: 243]Rahul discussed this\nwith Ajay, who was also not fond of Ali.[note: 244]Ajay and Rahul then decided to\nset up their own travel company ahead of tendering their respective\nresignations. Rahul claimed that he had no intention of directly\ncompeting with the Plaintiff. His plan was to set up an office from\nhome and to service a few clients from any industry, whether it\nwas leisure, corporate, marine or offshore.[note: 245] 170    As\nneither Rahul nor Ajay had any prior experience in incorporating a\ncompany, they approached Prasad sometime in May 2011 for assistance. Prasad\nagreed to assist Rahul and Ajay on the condition that he would notify\nNagender of their plans. Rahul and Ajay agreed.[note: 246]Prasad gave evidence that he\nknew that it was wrong for him to help Rahul and Ajay set up a business\nthat dealt with the same core business as his employer, but he justified\nthis by saying that he sensed that the two men were “disturbed” and\nhe wanted to “hold them than allow them to move out”.[note: 247] 171    It\nis unclear how long Rahul and Ajay took to decide to incorporate Q4T\nSingapore. On the stand, Rahul said this decision was made “probably within\na day or two” after hearing from Leny about Ali possibly taking charge\nof operations in the Asia Pacific region.[note: 248]This is consistent\nwith Ajay’s AEIC, which indicated that they came up with a plan\nthe same evening that Rahul talked to him about what he had heard\nfrom Leny, before speaking with Prasad the next day.[note: 249]However, Ajay attempted to resile\nfrom the position in his AEIC during cross-examination when he indicated\nthat there was more than one discussion over two or three days.[note: 250] 172    On\n31 May 2011, Prasad sent IP Consultants an email to request that it\narrange for the incorporation of a new company with the name “Q4T Management\nPte Ltd”.[note: 251]Prasad claimed he meant to copy\nNagender in his email to IP Consultants in order to inform him about\nRahul and Ajay’s plans but inadvertently entered an erroneous email\naddress nxxxxxxxx@gmail.com (“the Disputed Email Address”), which\ndid not belong to Nagender. Nagender’s personal email is “nrxxxxxxxx@gmail.com”\n(with an “r” after “n”).[note: 252]Nagender therefore did\nnot receive this email.[note: 253] 173    Around\nthis time, Ajay contacted his good friend, Ms Apoorva Madhu Vuddandi\n(“Apoorva”), to ask her to incorporate Q4T Australia as a personal\nfavour to him.[note: 254]Apoorva is Madhu’s\ndaughter and a former employee of Griffin Australia. Ajay claimed\nthat he had wanted to set up Q4T Australia because it was cheaper\nto issue some types of tickets from Australia than it was to do\nso in Singapore.[note: 255]Ajay claimed\nhe did this on his own volition without telling anyone else, not\neven Rahul,[note: 256]and Rahul claimed\nthat he only learnt of Q4T Australia’s existence on 1 November 2013\nwhen the company search on Q4T Australia was disclosed.[note: 257] 174    On\n31 May 2011, the application for registration of Q4T Australia as\na proprietary company was made and processed in Australia. Q4T Australia was\nincorporated on the same day, with Apoorva as the sole shareholder and\ndirector.[note: 258] 175    On\n1 June 2011, Prasad sent a follow-up email to IP Consultants, copying\nAnnie and Adella, stating that the business address for Q4T Singapore\nwould be the Changi Offices.[note: 259]His stated reason for using that address\nwas to allow him to monitor all incoming mails to Q4T Singapore.[note: 260]It was to make sure that Rahul and\nAjay did not engage in any activities using Q4T Singapore that might\nbe in conflict with their duties to the Plaintiff. 176    Q4T\nSingapore was incorporated on 23 June 2011 with Rahul and Ajay as\ndirectors each holding 50% of the shares. The paid up share capital was\n$100.[note: 261] 177    Prasad\nclaimed that, on the same day, he approached Adella to discuss the\nissue of Rahul and Ajay incorporating Q4T Singapore.[note: 262]After she heard about this, she told\nPrasad that what Ajay and Rahul had done was not right and that\nthey would have to speak to Nagender about it when he returned to\nSingapore.[note: 263]In the meantime, Adella\nspoke with Rahul about the matter.[note: 264] 178    An\nalleged meeting about Q4T Singapore took place when Nagender returned\nto the office sometime in end June 2011. Nagender, Prasad, Adella,\nRahul and Ajay were involved. Nagender instructed Rahul and Ajay to\nstop all activity.[note: 265]He also instructed Adella\nand Prasad to keep tabs on Rahul and Ajay.[note: 266] 179    It\nwas admitted that no steps were taken to deregister Q4T Singapore after\nthis.[note: 267]Instead,\non 6 July 2011, Prasad sent another email to IP Consultants stating\nthat Q4T Singapore’s mailing address was to be changed to Quest\nHorizon’s office premises.[note: 268]Prasad claimed that this was done\nas a precautionary measure to keep an eye on Q4T Singapore.[note: 269] 180    No\nactivities had ever been carried out under Q4T Singapore. Similarly,\nQ4T Australia was never active and was deregistered on 25 December\n2011.[note: 270] Analysis 181    The\nPlaintiff argued that Q4T Singapore was not just a small-scale business\nfor Rahul and Ajay’s benefit but the travel arm of Nagender’s alleged\nconglomerate.[note: 271]In this regard, the Plaintiff\nrelied on the following arguments: (a)     There\nwere inconsistencies between Rahul and Ajay’s version of events\nin their AEICs.[note: 272] (b)     Q4T\nSingapore and Q4T Australia must have been conceptualised before\nMay 2011 because of the speed of incorporation.[note: 273] (c)     The\nfact that Q4T Australia was even incorporated showed that Q4T Singapore\nwas meant to be established on a bigger scale than a home business.[note: 274] (d)     If\nNagender truly gave firm instructions that Q4T Singapore had to\ncease all operations, the parties involved would have immediately\nderegistered the company.[note: 275] (e)     There\nwas an incident on 25 September 2011 where Rahul visited Nagender\nat his house for dinner and asked Nagender for advice on how to\nplan a budget. Nagender had advised Rahulpriorto being\ninformed that Rahul had resigned.[note: 276]Nagender’slaissez\nfaireattitude in providing his assistance indicated\nthat Q4T Singapore was in fact Nagender’s own brainchild and explained\nwhy Nagender was not surprised that Rahul would ask for his help.[note: 277] (f)     Prasad’s\ninvolvement in Q4T Singapore’s incorporation showed that his involvement\nwas premeditated, as Prasad would not have assisted in the incorporation\nof the company if he had really wanted to stop this travel agency\nfrom starting.[note: 278] (g)     Apoorva’s\ninvolvement in Q4T Australia could not have been mere coincidence,\nsince she is the daughter of Madhu, who is the largest single shareholder\nof Quest Horizon.[note: 279] (h)     The\nfact that Q4T Singapore would potentially share the Changi Offices\nwas another indication of a link.[note: 280] 182    While\nthere were certainly inconsistencies between Rahul and Ajay’s accounts,\nI do not think these differences rendered their evidence entirely unreliable.\nMuch of it related to the different timeframes provided by the two\nindividuals, but it is obviously very difficult for two people to remember\nexactly when certain events took place. Rahul also generally gave more\ndetails of the discussions with Adella and Nagender, but that is\nalso not a material inconsistency. 183    By\nRahul and Ajay’s account, the time between when they began discussing\nQ4T Singapore and the beginning of the incorporation process was\na short one. While the timeframe was short, it was not impossibly\nso, especially when Rahul and Ajay were motivated by their dislike\nfor Ali. In fact, the Plaintiff seems to have exaggerated certain\ndetails to make the timeline seem even tighter than it actually\nwas. For example, in its closing submissions, the Plaintiff said\nthat it was “undisputed” that the decision to incorporate Q4T Singapore\nwas finalised only on 30 May 2011, which would mean that Prasad\nhad written to IP Consultants regarding the incorporation of Q4T\nSingapore the same day that Rahul and Ajay approached him, which\nwould be 31 May 2011.[note: 281]Yet, Ajayexpressly deniedthat\nit had to be 30 May 2011 during cross-examination.[note: 282]Similarly,\nPrasad said that Ajay and Rahul met him a few days before he sent\nthe email.[note: 283]The 30\nMay 2011 date seems to have come from the fact that, after saying\nthat the discussion took place in late May 2011, Ajay agreed to\nthe suggestion by Plaintiff’s counsel during cross-examination that\nlate May would be the “last week of May”, after which counsel stated that\nthe last week of May 2011 started on 30 May (presumably because\nthat was the date of the last Monday of May 2011).[note: 284]However, Ajay subsequently\nclarified that he meant 23 to 31 May 2011.[note: 285]While the week of\n23 May 2011 is technically the penultimate week of May, witnesses\nare not expected to give evidence with such linguistic precision. 184    Similarly,\nAjay had said that he only called Apoorva after finalising the decision\nto incorporate Q4T Singapore. The Plaintiff seized on this point,\nand argued that as Q4T Australia was incorporated on 31 May 2011, Ajay\nmust have either called Apoorva to go ahead on the same day he spoke to\nRahul or very early the next day.[note: 286]But\nthis is again only the case if we accept that the date the decision\nwas made to be 30 May 2011. 185    The\nDefendants argued that Q4T Singapore would not be considered to\nbe competitive with the Plaintiff as the Plaintiff offered specialist\nservices while Q4T Singapore would only have been a generalist travel\nagent. I agree that two companies in a field as broad as the travel\nagency business may not necessarily compete for the same customers.\nTrying to discern the potential customer base of a company that\nultimately existed only in name is a futile exercise with the dearth\nof documentary evidence about the company’s intended purpose. Nevertheless,\nI am inclined to the view that Q4T Singapore would be competitive\nwith the Plaintiff on a very small scale if it remained only a small-scale\nhome-based travel agency. If it expands its travel agency business\ninto more areas in the future as it grows, then it will have the\npotential to compete with the Plaintiff on a bigger scale. 186    The\nPlaintiff questioned the Defendants’ evidence that Nagender had rebuked\nRahul and Ajay for incorporating Q4T Singapore. The Plaintiff argued\nthat if Nagender had really given firm instructions that Q4T Singapore\nwas to cease all operations, the natural reaction would have been for\nall parties involved to immediately deregister the company.[note: 287] 187    While\nI accept that Prasad’s subsequent actions appear to be inconsistent\nwith Nagender’s orders, I do note however that no further steps\nwere taken by Q4T Singapore to carry out its intended business,\nsuch as by applying for the necessary licenses required to carry\nout the business of a travel agent. After weighing the evidence\nfrom several witnesses, I am inclined on balance to believe that\nNagender had reprimanded Rahul and Ajay for incorporating Q4T Singapore. 188    As\nfor the purported dinner on 25 September 2011 at Nagender’s home\nwhere Rahul had asked Nagender for advice on how to prepare budgets,\nit is somewhat surprising that Nagender did not ask why Rahul needed\nto know this before proceeding to advise him. This is especially\nso because Rahul had not yet told Nagender of his resignation[note: 288]and Nagender\nhad also rebuked Rahul for incorporating Q4T Singapore just a few\nmonths ago. Further, doing budgets or financial planning was not\npart of Rahul’s job scope with the Plaintiff. 189    Rahul\nhad allegedly created two spreadsheets based on this discussion named\n“Staffing (NR version) V1” and “Staffing (NR version) V2”, which were\nstored in a folder named “QRS” purportedly because Nagender had explained\nthe concept of budgeting with reference to QRS.[note: 289] 190    It\nseems to me that any discussion would have been more likely to have\nbeen about QRS rather than Q4T Singapore. I think Rahul was not being\nentirely forthright in this aspect of his testimony. While this\ndid not necessarily link Q4T Singapore and QRS together, Nagender\nhad, at the very least, an interest in QRS through his wife Kavita\nand he did not shy away from obtaining the help of the Plaintiff’s\nemployees in furthering that interest (as we shall see). 191    There\nare two final points. The Plaintiff noted that the assistance by Apoorva\ncould not have been coincidental since she was the daughter of Madhu.\nFirst of all, Griffin Australia only had four employees – Madhu,\nhis wife, his daughter and one other employee.[note: 290]If\nAjay had wanted help in setting up a company in Australia, he would\nmost likely have turned to someone he knew, such as a colleague.\nThere is no indication he had other friends in Australia. Three\nout of four people who he could have approached were either Madhu\nhimself or his family members. Moreover, I agree with the Defendants\nthat any inference to be drawn from the assistance of Apoorva is\npurely speculative.[note: 291] 192    Finally,\nthe Plaintiff submitted that Q4T Singapore would potentially share\nbusiness premises at the Changi Offices with the other New Entities. While\nQ4T Singapore’s business address was the Changi Offices, there was no\nallocation of any rent or expenses to Q4T Singapore.[note: 292]It does not appear to\nme that Q4T Singapore had gone beyond mere registration and commenced\ndoing any travel business. The Defendants’ evidence on\nQRS 193    As\nfor QRS, the Defendants’ case was that this was actually Kavita’s company,\nand that none of the Defendants (other than Leny, who only became\na director after she had resigned from the Plaintiff) had any interest in\nit. Insofar as Nagender was concerned, he only took an interest\nin QRS because it was his wife’s company.[note: 293]Nagender\nclaimed that Kavita had formed a desire shortly before Leny’s exit\non 30 June 2011 to enter into a small business venture to occupy\nherself as her two daughters were moving to Australia to pursue\ntheir further education. Kavita had wanted to start a business based\non a concept Nagender had come up with, which was to offer support\nand advisory services to small and medium enterprises, mainly in\nrelation to outsourcing services in other countries. 194    Kavita\napproached Leny for her assistance in June 2011, during a discussion\nwith Nagender and Kavita. As Kavita had never been involved in a\nbusiness, Leny agreed to assist until the end of the year, as she\nintended to return to Medan to assist her father in his vegetable\nexport business at the time.[note: 294]According to Nagender,\nKavita decided to seek Leny’s help as both Kavita and Nagender believed\nthat “spouses should not work together”. Nagender encouraged his\nwife to do so since Leny was exiting the Plaintiff.[note: 295] 195    According\nto Nagender, sometime in June 2011, Piyush and his ex-wife invited\nPrasad, Kavita and Nagender to dinner at his house, where Kavita\ntalked about her desire to go into business. Piyush volunteered\nhis assistance and offered to find out more information for her\nbusiness.[note: 296]At this juncture, I note\nthat this was different from Piyush’s account that it was Prasad\nwho approached him and asked him to assist with work to be done\nfor the New Entities.[note: 297] 196    In\nJuly 2011, Joanna also volunteered to help with incorporation matters\nwhen she learnt about Kavita’s business venture,[note: 298]ostensibly to learn more about how\nto incorporate a company.[note: 299]Joanna\nsaid that it was she who suggested the name “Quest Rightshoring”,\nas they were all in their respective “quests” for success.[note: 300] 197    Nagender\nwas scheduled to go to the Philippines on 19 July 2011.[note: 301]He\nclaimed that, before he left, Kavita told him she wanted to have\nan idea about the rental costs and availability of premises in the\nPhilippines and purportedly asked Nagender and Prasad to help obtain\nthis information for her. 198    Nagender\nclaimed that the reason for the trip to the Philippines was to attend\na client meeting in Manila as well as conduct recruitment interviews together\nwith Joanna and Prasad in Cebu for the Plaintiff and Griffin Dubai.[note: 302]At the time, the Plaintiff was\nsupposedly bidding for a new client, Offshore Marine Services Pty\nLtd (“OMS”), in Australia and if the Plaintiff was to be successful\nin bidding for the project, it would have required a substantial\nincrease in service staff to service OMS.[note: 303] 199    On\n16 July 2011, Prasad sent an email to Colliers International Philippines\n(“Colliers”) requesting for their assistance in identifying potential\noffice space for the new venture’s business use in the Philippines. Again,\nPrasad copied the Disputed Email Address instead of Nagender’s correct\nemail address.[note: 304] 200    On\n21 July 2011, Nagender, Joanna and Prasad interviewed a number of\nprospective recruits in Cebu. During their lunch and tea breaks,\nthe trio visited a number of premises identified by Colliers to\nsee if any of them were suitable. They also met a Filipino lawyer\nto obtain legal advice on incorporation matters in the Philippines.\nThe lawyer referred them to SGV & Co (“SGV”) (an affiliate of\nErnst & Young), to obtain information and clarification on some\ncorporate tax matters. Prasad left Cebu that evening as he was scheduled\nto be on leave from the next day.[note: 305] 201    The\nnext morning, Joanna and Nagender met with SGV while on their way\nto the airport.[note: 306] 202    On\n3 August 2011, QRS was incorporated with Kavita as the sole shareholder\nwith a paid-up capital of $50,000. Leny and Kavita were named as\ndirectors.[note: 307] 203    During\nthis period, advice was also sought from various parties in the Philippines,\nIndia and Thailand relating to the incorporation of entities in those\ncountries. For example, enquiries were made with a tax consulting firm\nin the Philippines.[note: 308]Contact\nwas also made with an Indian corporate secretarial outfit[note: 309]as\nwell as chartered accountants.[note: 310]The general manager of\nthe Plaintiff’s Thailand office, whom the parties referred to as\nCherry, also contacted a Thai law firm on 11 August 2011 seeking advice\nregarding the steps needed to get a business permit in Thailand\nfor QRS, apparently at the request of Piyush.[note: 311]However,\nthe Defendants denied that there were plans to set up a QRS entity\nin Bangkok given that Leny was unaware of any proposed plans or\ndiscussions to set up an office in Bangkok for QRS.[note: 312]Nagender’s\nevidence was that Bangkok had been previously discussed as a possible\nlocation, and based on that discussion, Piyush went ahead to find\nout more, even though nobody asked him to do so.[note: 313]The Defendants\nalso emphasised that, notwithstanding these preliminary steps, QRS\ndid not have an Indian, Philippine or Thai entity set up in 2011.[note: 314] 204    Nagender,\nJoanna and Leny also helped to prepare some marketing material for\nQRS.[note: 315]In September 2011, Leny prepared\nwhat appeared to be a marketing information sheet on QRS titled\n“Benefits.docx” (“the Benefits document”),[note: 316]which she claimed was prepared\nafter a discussion with Kavita.[note: 317]This\ndocument was circulated to Nagender and Joanna separately under\nthe cover of her emails dated 2 September 2011.[note: 318] 205    On\n3 September 2011, Nagender sent an email to Leny with his own write\nup on offshoring strategy.[note: 319] 206    That\nsame Saturday, Leny, Joanna, Nagender and Piyush had a discussion\nabout QRS’s intended business.[note: 320]At\nthe meeting, they jointly created a powerpoint presentation. Thereafter,\nPiyush circulated the finished product to Nagender, Joanna and Leny\nby way of his email dated 3 September 2011.[note: 321]Nagender\nthen amended the powerpoint presentation and sent it to Leny on\n5 September 2011.[note: 322]Leny then revised the presentation\non 7 September 2011 and sent the revised presentation to him.[note: 323] 207    According\nto the Defendants, QRS was not operational in 2011. It only commenced\noperations in 2012, after all the Defendants were no longer employed\nby the Plaintiff.[note: 324]Leny resigned as a director of\nQRS on 16 January 2012.[note: 325]Joanna entered into the\nemployment of QRS as manager around May 2012.[note: 326]On 18 July 2012, Kavita\nceased to be a shareholder and director of QRS and Joanna became\nthe sole shareholder and director of the same. She bought over Kavita’s\nshares for $150,000.[note: 327] 208    QRS\npresently has offices in Singapore, Mumbai and Cebu, with about\n20 staff spread across the three offices.[note: 328] Analysis Whether QRS was Kavita’s project 209    The\nPlaintiff argued that QRS was not Kavita’s project, but actually Nagender’s,\nmainly for the following reasons: (a)     The\nspeed at which Kavita’s idea evolved was implausible. In just one\nmonth, Nagender, Joanna and Prasad were in Cebu looking for premises\nfor QRS, as well as meeting with lawyers and tax advisors.[note: 329] (b)     Kavita\ndid not have the capability to think of and implement QRS’s business\nconcept. She was an air-stewardess turned housewife who was averse\nto emails. Evidence from Leny and Prasad indicated that she was\nnot a business savvy person. There were no emails from Kavita showing\nthat she had ever given any instructions to any of the Defendants\non what needed to be done for QRS, nor was she seen at the Changi\nOffices by Indraneel.[note: 330] (c)     Nagender\nadmittedly came up with the business idea for QRS. He could control\nQRS through his wife. Nagender took the lead during the meeting\nwith SGV. He was also copied, directly addressed or he sent to the\nother Defendants and/or third parties numerous emails relating to\nQRS’s operations. His opinion was also sought with respect to various\nmatters.[note: 331] (d)     Nagender\nconceded during cross-examination that after serving his period\nof notice, he would be willing to be part of the team running QRS.[note: 332] (e)     There\nwas an extract of data found on Joanna’s laptop that appeared to\nbe part of the business plans (or publicity material) for QRS. It\nread “Nagender Chilkuri, Joanna Kaunang and Piyush Shukla. The team\nhas over 50 years of experience in service operations management”.[note: 333] 210    The\nDefendants’ submissions in response were as follows: (a)     It\nwas purely coincidental that Nagender, Joanna and Prasad happened\nto be going to Cebu in July 2011 and decided to assist Kavita during\ntheir spare time there.[note: 334] (b)     The\nmere fact that Kavita was an air stewardess and subsequently a housewife\ndid not mean that she did not have the capability to turn a business\nidea into QRS. The mere fact that she did not like corresponding\nover emails did not mean she was lacked business savviness. Her\nlack of experience was why she needed the assistance of her husband\nand friends to implement her ideas at the detailed level. The fact\nthat Indraneel did not see Kavita at the Changi Offices did not\nmean QRS was not her brainchild. Indraneel was only in Singapore\nabout three to four times during the material period. Since QRS\nwas not doing any actual business at the time, there was less need\nfor Kavita to be at the Changi Offices.[note: 335] (c)     The\nPlaintiff’s assertion that Nagender could control QRS through his\nwife was based on the fact that Prasad assisted Kavita because she\nwas Nagender’s wife – but that did not assist the Plaintiff’s case.\nAll it meant was that Prasad would not help someone he did not know.[note: 336] (d)     It\nwas perfectly logical for Nagender to help Kavita since he is her\nhusband.[note: 337] 211    As\na preliminary point, the Defendants have highlighted that the Plaintiff\ndid not actually plead that NagendercontrolledQRS.[note: 338]I\nwas not minded to exclude the Plaintiff’s arguments on this matter.\nNagender had asserted that he had no interest in QRS and that his\ninvolvement was limited to the provision of advice or comments when\nhe was approached for such advice or views.[note: 339]The Plaintiff was well within its\nrights to test this part of the Defendants’ case. I do not think\nthe Defendants could be said to be prejudiced or taken by surprise.\nIt is also untrue that Nagender had no opportunity to contradict\nthat allegation. While the issue of “control” was never specifically\nput to Nagender, the Plaintiff’s counsel had asked Nagender questions\nto the effect of whether it was true that Kavita was really the\none giving instructions,[note: 340]as\nwell as whether Nagender accepted that his involvement in QRS was\nlimited to the provision of advice or comments.[note: 341] 212    After\nconsidering the parties submissions, I come to the view that it\nis unlikely that QRS was formed by Kavita independently. I note\nthat QRS was by Nagender’s own account conceived in June 2011. By\nthis time, he already had an intention to leave the Plaintiff (see\n[108] above). It was far too coincidental that his wife would have\nthe idea to set up a business at this juncture. The complexity underlying\nQRS’s business model indicated to me that the moving mind behind\nQRS was unlikely to be someone as inexperienced as Kavita. Her lack\nof involvement in comparison to Nagender’s was palpable. The Defendants\nhave not disclosed a single email that originated from Kavita, and\nthe excuse that she did not like to send emails was unconvincing.[note: 342]The evidence showed that\nNagender was one who was giving instructions in relation to QRS.\nIt was far more likely that QRS was Nagender’s brainchild and his\ncompany. He was merely using Kavita as his nominee. Whether QRS was part of a conglomerate\nwith the other New Entities 213    Nevertheless,\neven if Kavita was merely a figurehead, that did not mean QRS was\nnecessarily linked to the other New Entities. I summarise the Plaintiff’s\narguments in this respect: (a)     The\nterms Quest Horizon and QRS were used interchangeably by the Defendants\nwhich indicated that these two entities were part of the same group\nof companies. The Plaintiff referred to a number of emails exchanged\nby Prasad and Joanna with third parties using their Quest Horizon\nemails which gave the impression that Quest Horizon and QRS were\nrelated.[note: 343] (b)     The\nPlaintiff pointed to certain emails that seemed to show that QRS’s\nbusiness was evolving very quickly, indicating that QRS was meant\nto operate on a larger scale than indicated by the Defendants. The\namount of planning showed that such planning must have started significantly\nearlier,ie, in tandem with the\nother New Entities.[note: 344] (c)     The\nPlaintiff also submitted that there was more to the Defendants’\ninvolvement than the mere provision of assistance to Kavita: (i)       Prasad’s involvementviahis\ncommunications with third parties such as Colliers and Indian tax\naccountants and lawyers with respect to various matters indicated\nthat he had a more active role than merely helping Kavita. For example,\nin his 16 July 2011 email to Colliers, Prasad described himself\nas being part of a “newly formed corporate group” setting up a call\ncentre in Cebu.[note: 345]The Plaintiff suggested\nthat Prasad therefore had a “far greater vested interest” in QRS’s\naffairs.[note: 346] (ii)       Joanna took an active role in QRS from the beginning and appeared\nto be privy to more details about QRS’s direction than someone who\nwas simply helping.[note: 347]In a text\nfragment that appeared to be promotional materials for QRS, she\nwas named as part of the team which “has over 50 years of experience\nin service operations management”.[note: 348]The first job she took after\nher dismissal from the Plaintiff was with QRS.[note: 349] (iii)       Leny appeared to be more involved in QRS\nthan a non-executive director would be, such as the fact that she\ndrafted the Benefits document.[note: 350] (d)     Finally,\nthe Plaintiff highlighted that while Nagender had said that he only\nwanted to “rent a seat” in the Changi Offices for his wife,[note: 351]the Benefits document seemed to represent\nthat QRS had access to all the facilities and premises of the Changi\nOffices. The Plaintiff also noted that Leny had not seen it fit\nto check with the major shareholders of Quest Horizon before drafting\nthe Benefits document, and asserted this was because Lenyknewthat Quest Horizon and QRS were actually\npart of the same group of companies.[note: 352] 214    These\nfactors do give rise to a suspicion that Quest Horizon and QRS were\nclosely linked and formed part of one conglomerate. On the other hand,\nwith Prasad and Joanna using the Quest Horizon email addresses and office\naddress to communicate with various external parties, it was unsurprising\nthat the companies were mentioned in the same breath. 215    The\nfact that Prasad, Joanna and Leny all helped out in QRS’s business\nalso did not mean that Quest Horizon was necessarily linked to QRS.\nLeny and Prasad were not shareholders in either Quest Horizon or QRS.\nAlthough Joanna was a shareholder in Quest Horizon, she was not\na shareholder of QRS. I cannot infer much from the non-financial\nassistance being provided by close friends and colleagues to each\nother. Prasad was Nagender’s brother-in-law, and there is nothing\nsurprising about his assistance. There is nothing sinister about\nfriends helping Nagender with his wife’s project (as far as they\nwere aware). 216    To\nsupport its argument that QRS’ business had evolved into “much more\nwithin an extremely short span of time”, the Plaintiff relied on\nthree emails between June to August 2011.[note: 353]However,\nI note that in the Benefits document, which was prepared by Leny\nin September 2011, the only business programmes proposed were still\nonly for home businesses, start-ups, small enterprises and medium-sized\nenterprises.[note: 354] 217    The\nBenefits document does show that there was an intention by QRS to\nhire or rent space in the Changi Offices from Quest Horizon. It\nseems to me that Nagender’s statement that he merely wanted to “rent\na seat” was an understatement.[note: 355]However,\nthe mere fact that there was such an intention does not mean that\nthe two companies were linked. While I accept that it was possible\nthat Nagender could have come up with the concept for QRS prior\nto June 2011, I do not think it would be as early as February 2011\nsince Nagender had not decided to resign at that point. 218    It\nis not disputed that, in drafting the Benefits document, Leny did\nnot think she needed to check with the major shareholders of Quest\nHorizon even though the document stated that QRS would be housed\nin the Changi Offices. The Plaintiff suggested that she did not\ndo so because they were part of the same conglomerate and she knew\nthe Quest Horizon shareholders would not mind.[note: 356]However,\nthe Benefits document was clearly not a finalised piece of work.\nFor example, under the header “Locations”, the Benefits document\nlisted Singapore, Cebu, Mumbai, Kuala Lumpur, Bangkok and Ho Chi\nMinh City, but no QRS offices have ever been set up in Kuala Lumpur,\nBangkok or Ho Chi Minh City. I accept Leny’s evidence that the Benefits\ndocument was actually a draft for discussion.[note: 357]Quite simply, there\nwas no reason for Leny to ask for permission from Quest Horizon’s\nshareholders as to what she could include in a draft meant for internal\ndiscussion.",
        "The Resignations": "219    The\nPlaintiff also pleaded that Nagender had instigated the mass exodus\nof the Defendants to the New Entities as part of his masterplan.[note: 358]I\nnow consider the reasons cited by the Defendants for their resignations. Leny 220    On\n2 February 2011, Leny tendered her written resignation to Nagender.[note: 359]She said she wanted to resign because\nof the following events:[note: 360] (a)     In\nthe middle of 2010, she went through a divorce; (b)     Sometime\nin October 2010,[note: 361]she\nwas hospitalised for stress; (c)     Contrary\nto what she had expected, Nagender was still in Singapore despite\nplans for him to be promoted as the Global CEO, which meant her\nown prospects of becoming managing director of the Plaintiff was\nin jeopardy (and indeed Nagender had informed her near the end of\n2010 that he had his own doubts as to whether he would be promoted);\nand (d)     At\nthe end of her hospitalisation, her parents asked her to go back\nto Medan, Indonesia (her birthplace[note: 362]) to assist her father in his\nbusiness. 221    In\nher resignation letter, she stated that “[she] would like to pursue [her]\ninterest in managing [her] family business and starting [her] own business\nin future”.[note: 363]She claimed that Nagender did not\naccept her resignation and urged her to reconsider. When they spoke\nabout it again later in April 2011, Nagender told her to speak to\nGeorge directly.[note: 364] 222    On\n23 May 2011, she met George in London where she explained why she\nwanted to resign. George wrote to her on 25 May 2011, saying that\nhe was very sad to see her go, but he also completely understood\nand respected the reasons for her decision, and that if he had the\nsame issue he would have done exactly the same.[note: 365] 223    This\nwas Leny’s evidence as to what was said at the London meeting: A:    Your\nHonour, when I spoke to George Boyes, I spoke to him about the time\nspent, and – too much of time spent in the plaintiff time. Basically,\nthat led to my divorce. And he told me that it’s okay, because it’s\nalso his second marriage, he told me that he also divorced before.\nAnd he told me that, “Given the time, you will be able to tide over\nall these things”. So, that was one of the issues that we spoke\nto. Subsequently, I – he asked me as well, “What are you going to\ndo after your resignation?” I spoke – I told him that my father\nwanted me to have a look at the business and see whether if I can take\nover the business in future. But I told him as well, I’m not sure\nwhether it’s something really for me, because I haven’t been in\na different industry. I do not know how will I react to that. So\nhe said, “It’s okay, just go over and do whatever it is, but in\ncase you don’t find it suitable, you can always come back to Griffin\nbecause the door is always open to you”. Q.    So he said, “If I had the same issue”,\nyou are saying that George Boyes is referring to a collection of\nissues that you had raised? Is that your evidence? A.    I would say that.[note: 366] 224    However,\nGeorge said that Leny told him that she wanted to resign to help\nin her father’s business in Indonesia as her father was unwell.[note: 367] 225    At\nthe London meeting, George also agreed to abridge her notice period\nof six months to four months. Leny said she had wanted a shorter period\nbecause she wanted to go back to Indonesia in July 2011. She was being\nvery overworked and only had four to five hours’ sleep a night and her\nfather had asked her to get early leave in order to rest.[note: 368] 226    She\nalso provided a reasonable explanation for why she stayed on after\nJuly 2011, which was that, due to unforeseen circumstances, she\nhad to stay behind to look after her niece. While she still wanted\nto leave at the end of 2011, the initiation of the present lawsuit\nderailed her plans.[note: 369] 227    The\nPlaintiff argued that it was inconsistent for Leny to complain of stress\nand yet at the same time get involved in the renovation of the Changi Offices,\nas well as giving substantial assistance to Quest Horizon, while\nstill juggling her work responsibilities for the Plaintiff.[note: 370] 228    I\naccept the reasons given by Leny for her resignation. Considering her\ndivorce and her hospitalisation, it was not at all unbelievable\nthat she would want a change of scenery in February 2011. I do not\nbelieve that her resignation was linked in any way to an alleged\nmasterplan conceived by Nagender. For completeness, I also note\nthat the Plaintiff did not plead any link between the incorporation\nof the New Entities and Leny’s resignation.[note: 371] Prasad 229    On\n1 March 2011, Prasad tendered his resignation.[note: 372]Prasad’s evidence was that he had orally\ninformed everyone at the Plaintiff that he intended to leave and\nretire from active employment to return to India for good, and he\nhad set his exit date tentatively as sometime in July or August 2011\nto ensure a smooth transition.[note: 373]This was corroborated by\nPiyush, the Plaintiff’s financial controller at the material time,\nwho was being groomed from some point in 2010 to take over from\nPrasad. Piyush said that Prasad had indicated his intention to return\nto India and that the plan was for Piyush to take over. Moreover,\nPiyush was also aware that Prasad was intending to return to India\naround the middle of 2011.[note: 374]Accordingly,\nthere was no reason to link Prasad’s departure with the New Entities. Adella 230    On\n24 August 2011, Adella tendered her written resignation to Nagender.\nAdella was the first of the Defendants to resign after Nagender did.\nShe claimed that she had openly discussed her wish to retire from\nthe Plaintiff since about 2006 when she turned 45 with Nagender\nand George, but Nagender always managed to convince her to stay.[note: 375]However,\nsince Nagender was leaving, there was nothing to hold her back anymore.[note: 376]During a telephone conversation with\nJoanna, George said that he knew that Adella had long wanted to\nretire.[note: 377]In my view, Adella’s wish to retire\nfrom the Plaintiff was a genuine one. Annie 231    On\n12 September 2011, Annie tendered her resignation letter to Joanna\n(who was then taking over Nagender’s role as managing director of the\nPlaintiff).[note: 378]She claimed that she was demotivated\nby the departure of her close colleague Adella. Moreover, she was\nalso concerned about her own ability to work with younger colleagues\nand the fact that she would become Rahul’s subordinate (as Rahul\nwas slated to take over Adella’s position) even though Rahul was\nmore junior than her.[note: 379]This was an understandable\nreason as well. Joanna 232    On\n21 September 2011, Joanna tendered her resignation letter to Marcus,\na director of the Plaintiff.[note: 380]She was earmarked to take\nover Nagender’s role as managing director of the Plaintiff but she\nstated that she was apprehensive as these were big shoes to fill.[note: 381]In essence, her reasons for\nleaving were that she did not have George’s trust and that she felt\nthat she was not ready to step into Nagender’s shoes, at least without\nthe latter’s support and guidance (which she was deprived of when\nGeorge refused to allow Nagender to accompany Joanna to meetings\nwith the Plaintiff’s clients[note: 382]and based on her discussion\nwith Ali and Marcus[note: 383]). 233    The\nPlaintiff argued that if Joanna did not think that she was capable of\nstepping into Nagender’s shoes, it did not make sense for her to subsequently\ntake over QRS, an even more stressful endeavour since QRS was merely\na start-up company with uncertain prospects.[note: 384]On\nthe other hand, there is merit in the Defendants’ contention that\nthe demands of taking over a company like the Plaintiff are very\ndifferent from those of running a small business.[note: 385]I\nalso accept that she could have found it frustrating to be caught\nin the middle of George and Nagender’s political bickering.[note: 386] 234    The\nPlaintiff also argued that Joanna had all the support she needed because\nof a conversation she had with George on 10 September 2011,[note: 387]but\nI do not think a single conversation which occurredpriorto\nthe events that supposedly caused her to doubt George’s goodwill\nis conclusive of whether she was getting the kind of support she\nfelt she needed. Rahul 235    On\n22 September 2011, Rahul resigned. Rahul’s primary reason has been\nalluded to previously: he had a negative experience working for\nAli and did not want to work for Ali again.[note: 388] 236    Rahul’s\nstated desire for leaving was triggered by Ali’s alleged declaration\nthat he would be stepping into Nagender’s shoes. This supposedly\ntook place at a meeting on 19 September 2011[note: 389]involving Ali and Marcus and certain\nother staff from the Plaintiff (but not Joanna[note: 390]). This alarmed Rahul, who\nthen informed Joanna on 22 September 2011 that he intended to resign.\nThat was when Joanna told him that she had tendered her resignation\njust a day earlier and that it was more appropriate for him to speak\nto Ali instead.[note: 391] 237    The\nPlaintiff submitted that Rahul’s assertions were not backed up by evidence.\nIt also appeared to be an afterthought because the point about Ali’s\ncategorical declaration was only added to Rahul’s AEIC in an amendment\nmidway through the trial, even though it was such an important detail.[note: 392]Moreover,\nit was inaccurate since Joanna was the one primed to take over from\nNagender as the managing director of the Plaintiff until her resignation\non 21 September 2011.[note: 393] 238    It\nseemed to me that there is no real inconsistency here. I note that Ali’s\nstated reason for his visit to Singapore on 19 September 2011 was\nto,inter alia, take control of\nthe Plaintiff’s board.[note: 394]I do not think it would\nbe too surprising if Ali did actually make the statement as Rahul\nalleged. Indeed, the very fact that Ali was now in Singapore must\nhave indicated to Rahul that it was very likely that he would become\nthe Plaintiff’s managing director. Whether or not Rahul’s impression\nwas actually accurate is not the point. Piyush’s evidence that the resignations\nwere coordinated 239    According\nto Piyush, there was an incident at Nagender’s house sometime in\nJune or July 2011 where some of the Defendants (Joanna, Adella,\nLeny and Rahul) as well as some of the other employees of the Plaintiff\nwere present. During dinner, Nagender displayed an Excel spreadsheet\non the television screen in the living room. Piyush said Nagender,\nJoanna, Leny, Rahul and Adella appeared to be discussing in private\nthe contents of the spreadsheet. Although he was some distance away,\nPiyush saw some parts of the spreadsheet which had been filtered such\nthat only the names of the Plaintiff’s operations’ team were displayed. It\nalso showed the names of those employees followed by what appeared\nto be their proposed resignation dates and the notice period that\nthey had to serve with the Plaintiff. Piyush said he did not have\na good look at the dates but recalled that they appeared to be in\nthe near future.[note: 395] 240    Nagender\ndenied this by saying he had not hosted any dinner at his house\nas alleged. However, in a lunch gathering in August 2011, he recalled displaying\nan Excel spreadsheet on his television which set out the respective\njoining dates of all the staff in the Plaintiff’s employ for the purpose\nof showing who would be getting long service awards.[note: 396] 241    To\nbegin, the Defendants submitted that Piyush’s evidence should be disregarded\naltogether “because, as a witness, Piyush’s credibility is in tatters”.\nIt was undisputed that Piyush had lied to the Plaintiff’s solicitors\nin their interviews with him on 9 March and 8 August 2012 in numerous ways.[note: 397]The Defendants also alleged\nthat Piyush was motivated by ill-will against Nagender because he\nwas upset with Nagender for supposedly taking Piyush’s ex-wife’s\nside in his divorce.[note: 398] 242    While\nI accept that Piyush could not be regarded as an entirely disinterested\nwitness, I do not think that I should dismiss what he had said entirely.\nEven though he had not been entirely truthful to the Plaintiff’s solicitors\nat an informal meeting, it is a different matter altogether to dissemble\nin a court of law. 243    That\nsaid, Piyush’s evidence regarding the Excel spreadsheet was unreliable.\nBy his own admission, he was some distance away and it did not appear\nthat he had a good look. Although Piyush was some distance away, there\nis no evidence as to whether Piyush had eavesdropped and heard what they\nwere discussing. That could well throw some light on whether the discussion\nwas indeed about the employees’ respective joining dates and long\nservice awards or about proposed resignation dates and notice periods that\nthe employees had to serve with the Plaintiff. There is some merit\nin the Defendant’s argument that it was innately improbable that\na secret plan regarding the poaching of the Plaintiff’s employees\nwould be so carelessly displayed in front of other people who were\nnot part of the plan.[note: 399]",
        "Other evidence": "The owner of the Disputed Email\nAddress 244    One\nissue that cropped up in these proceedings was with respect to a set\nof emails which were copied to the Disputed Email Address(ie, nxxxxxxxx@gmail.com).[note: 400]The\nDefendants’ consistent argument was that these emails never reached\nNagender because it was not Nagender’s actual email address. 245    The\nPlaintiff submitted that Nagender did receive these emails because\nthe Disputed Email Address actually belonged to his daughter.[note: 401]The\nbasis for this argument was an email which was discovered after\n15 January 2014 by the Plaintiff.[note: 402]This was an email “from” the\nDisputed Email Address, dated 12 May 2011. The recipient of the\nemail was Ajay. The first line stated that “[Nagender’s daughter]\nhas shared his/her itinerary with you”.[note: 403] 246    Ajay\nexplained that he had been assisting Nagender and his family with\ntheir account profiles for Singapore Airlines. He said he was the\none who operated Nagender’s daughter’s Krisflyer account (Krisflyer\nis Singapore Airlines’ frequent flyer programme) at the time. He\nhad forwarded the itinerary to himself so he could copy and do the\nsame booking for Nagender’s family.[note: 404]This\nwas done through the Krisflyer website, which had a “share itinerary”\nfunction. In order to share the itinerary, Ajay typed the Disputed\nEmail Address into the website,[note: 405]and got\nit wrong.[note: 406]As to how\nhe got the wrong address, Ajay stated:[note: 407] Q.    How\ncould you have used this email address, [the Disputed Email Address]? A.    In FocalScope, what happens is whenever\nyou put any new email address, it automatically gets saved into\na personal profile. So whenever you put any particular name for\nany particular person, that email address will automatically pop\nup. So what was happening, like others were making mistake, I was\njust copying the same wrong email address from FocalScope and copying\neverywhere. So whenever you type “Nagender”, it will come as his\npersonal Hotmail and Gmail address. So we were picking up the wrong email\naddress from FocalScope and putting it. So when I wanted to share\nthis itinerary of Natasha, I picked up that wrong email address,\nput it there and shared it with [Ajay’s email address], and that\nis how the email shows it has come from [the Disputed Email Address],\nbut the email has actually come from Singapore Airlines, your Honour. 247    FocalScope\nwas the email management system used by the Plaintiff at the time\nand it was developed by Lantone (ie,\nSandeep’s company).[note: 408] 248    The\nPlaintiff argued that Ajay’s explanation was unbelievable as it “cannot\nbe the case that the Plaintiff’s email system allows for the address books\nofallits employees to be automatically\nshared across the company”. Rather, the address books within the\nemail system had to be computer-specific, which meant that if the\nDisputed Email Address was available in the drop-down menu in the\nemail “To:” field, it must be because they had sent an email to\nthat address before.[note: 409] 249    The\nDefendants replied that the Plaintiff had no basis to make that allegation.\nIt had not adduced any evidence on how the FocalScope system works\nor how it retains email addresses.[note: 410] 250    While\nit was obvious that the email dated 12 May 2011 was computer-generated,\nI could not say for sure whether it was technologically possible for\nthe Krisflyer website to send an email from the user’s personal\nemail address. As for how Ajay had put in the wrong email address\nin the first place, I am unprepared to say that Ajay’s evidence\nwas implausible. I also note that Sandeep – the developer of FocalScope\n– was the witness who followed Ajay for cross-examination and no\nquestions in this regard were asked of him. As the Defendants said,\na shared email address book system is potentially very useful. I\nwould accept Ajay’s evidence in this regard. 251    In\nany event, even if I were to draw the inference that the Disputed Email\nAddress must have belonged to Nagender’s daughter, this did not necessarily\nmean that Nagender did in fact receive the emails which were sent\nthere. I note that there were no responses from the Disputed Email Address.\nOn balance, it is probable that he may not have seen these emails. Travel Cue and Connect Group 252    The\nPlaintiff raised a number of assertions in relation to two companies,\nnamely Travel Cue Management Pte Ltd (“Travel Cue”)[note: 411]and Connect Group Pte Ltd (“Connect\nGroup”).[note: 412]Annie, Adella and Leny\nare the shareholders in Connect Group. Connect Group is the majority\nshareholder in Travel Cue, while Rahul is a minority shareholder. Both\ncompanies were set upafterthe\nDefendants had exited the Plaintiff. The Plaintiff submitted that\nthe alleged masterplan had been successfully carried through by\nthe interplay between QRS, Travel Cue and Connect Group, and that\nTravel Cue is “essentially the reincarnation of the New Entities”.[note: 413] 253    However,\nnothing about Travel Cue or Connect Group was pleaded by the Plaintiff.\nThe Defendants therefore strenuously objected to any reference to\nConnect Group or Travel Cue in the Plaintiff’s submissions. It made\nthe following arguments:[note: 414] (a)     Any\nallegation relating to Connect Group involves a separate entity\nfrom the New Entities altogether, and the reliance on the role played\n(if any) by such entity was a material fact which must be pleaded.\nHad the Plaintiff pleaded such allegation relating to Connect Group,\nthe Defendants would have adduced additional evidence relating to\nan entirely discrete set of facts from those adduced at trial. To\nallow the Plaintiff to rely on such an allegation now would severely prejudice\nthe Defendants’ case. (b)     At\nthe Judge’s Pre-Trial Conference on 21 October 2013, the Defendants’\ncounsel had objected to the admission of an “organogram” (which\nhad set out,inter alia, the relationship\nof the Defendants with the New Entities as well as with Travel Cue\nand Connect Group), and the Plaintiff’s counsel had clarified that\nit had no claim which related to Travel Cue and Connect Group. (c)     On\n25 October 2013, the Plaintiff’s solicitors amended the organogram\nby removing references to Travel Cue and Connect Group and re-tendered\nit to the Defendants’ solicitors.[note: 415]This demonstrated that\nthe Plaintiff had accepted the irrelevance of Travel Cue and Connect\nGroup. 254    I\nagree with the Defendants. The Plaintiff’s submissions regarding Travel\nCue and Connect Group required a proper airing at trial and this,\nin turn, would have required both parties to properly prepare their\ncases in advance. The raising of these issues at such a late stage\nwas clearly prejudicial to the Defendants. Most of the evidence\nrelied on by the Plaintiff was elicited from Leny and Rahul in the\ncourse of cross-examination, but the “general rule is that a party\nis bound by his pleadings even if evidence has been given in a trial\nwhich touches on a matter which is not pleaded” (Overseas\nUnion Insurance Ltd v Home and Overseas Insurance Co Ltd[2002] 2 SLR(R) 1\nat [22]). 255    As\nthe Plaintiff did not plead anything in relation to Travel Cue and Connect\nGroup, no evidence was presented to the court by the Defendants on\nthe reasons behind their incorporation, the details of their shareholdings,\ntheir linkages, the nature of their businesses and the extent to\nwhich Nagender, the other Defendants and new shareholders, if any, were\ninvolved in each of these new companies. Without a clear picture\nof the relevant facts and circumstances in relation to these companies,\nI am not in a position to draw any inferences or conclusions in\nany event. Adella’s diary 256    Adella\nhad left her diary (essentially a notebook) behind in the Plaintiff’s\npossession after her resignation, and the Plaintiff referred to various\npages in it which seemed to suggest that the New Entities were linked. 257    I\nbegin with a page where the words “Quest Horizon” were found on the\ntop right corner.[note: 416]In the middle of the page were\ntwo mini flowcharts that appeared to represent corporate structures.\nThe one on the left referred to “JV1” with a vertical line leading\ndownward to the word “Investment”. The one on the right referred\nto “JV2” which had two diagonal lines below, one to “JV1 51%” and\nanother to “Cornel 49%”. The word “IT” was written above JV2. It\nwould appear from this chart that JV1 is actually Quest Horizon\nwhile JV2 is Niado. There were boxes below JV1 and JV2 with a list\nof words. The box below JV1 contained the words “CRM” and “BHEA”. 258    The\nPlaintiff submitted that this tied in with the plan to incorporate BHEA\nTech and have Adella and Annie as directors. It is unclear to me\nhow this inference could be so readily drawn. While the sketchy\ndetails in the mini flowcharts could suggest that JV1 (possibly\nQuest Horizon) and JV2 (possibly Niado) would both be in the “IT”\nbusiness with JV1 taking up 51% in JV2 and Cornel taking up 49%\nin JV2, the words “CRM” and “BHEA” were, however, in a box together\nwith a number of short phrases that appeared to be flight details\n(eg, “SIN HOU 20 Feb”). That box\nwas linked to the box on the right which contained more flight details,\nwith the latest date being “20 Aug”. Adella said she could not really\nremember what they were about, but suggested that perhaps it had\nto do with when BHEA India was coming to Singapore to create CRM.[note: 417]It was more likely that the\nwords “CRM” and “BHEA” were connected to those “flight details” rather\nthan the flowcharts above them. The contents of the two boxes did not\nappear to have anything to do with the flowcharts above them, and\nmay well have been added to the page at a different time. 259    Another\npage in the diary[note: 418]contained the words “Cebu – PZA”\nand “Convert – NR + LW share” (amongst others). Adella again appeared\nto be unsure but she said this page might have been written in February\n2011 when there were plans for the Plaintiff to have a Cebu office.\nAs for the words “Convert – NR + LW share”, she explained that she\nwanted to “convert” Nagender (“NR”) and Leny (“LW”) into joining\nQuest Horizon.[note: 419]The\nPlaintiff claimed that this suggested that alongside Quest Horizon’s\nplans to have a Cebu branch, there was some kind of arrangement\nto either convert Nagender and Leny’s shares or to convert debt\ninto equity.[note: 420]I am not prepared to make such\nspeculative inferences. There is no evidence that Nagender was prepared\nto or had extended any loans to Quest Horizon that could later be\nconverted to equity in Quest Horizon. Furthermore, I am not sure\nwhat the Plaintiff meant when it suggested that there was an arrangement\nto convert Nagender and Leny’s shares, when Nagender did not have\nany shares in Quest Horizon to begin with and when it is completely\nunknown what those shares in Quest Horizon could be converted into. 260    There\nwere also drawings of possible logos for Niado and Q4T on the same\npage in Adella’s diary.[note: 421]One of the issues was whether they\nwere drawn at the same time, or whether the Niado logos were drawn\nin May 2011 and the Q4T logos drawn in September 2011, after Rahul’s resignation.[note: 422]Even though\nthere were blank pages, it was plausible that they could have been\ndrawn at different times. This was more or less a notebook that\nAdella jotted notes in, and she could scribble on any page that\nwas convenient for her at any time. 261    Another\npoint emphasised by the Plaintiff was that there was a single line\nin the diary with the phrase “Quest for Travel JV”.[note: 423]This contradicted\nthe Defendants’ insistence that Q4T actually stood for “Quote for\nTravel”. Adella attempted to explain away this inconsistency by\nsaying that, after Rahul’s resignation, he had told her he did not\nlike the name “Quote for Travel” and so she told him that he could\nuse “Quest for Travel” instead.[note: 424]This,\nhowever, seemed rather implausible. It was more likely an indication\nthat shedidhave the impression\nthat Q4T stood for Quest for Travel. 262    Finally,\none of the pages in the diary listed out 35 names.[note: 425]Next\nto that list of names was another column that with the words “Budget”, “Salary”,\n“Office”, “PUB”, “Misc” and “Logo”. It appeared to be mainly referring\nto the Plaintiff’s operations staff although Piyush, who was from the\nfinance department, was also listed on the page. Many of the names\nhad ticks next to them, while there were a few with question marks.\nAdella could not remember why she wrote this list, or what the ticks\nand question marks signified, although she thought that it might\nrelate to “some events”.[note: 426] 263    The\nPlaintiff submitted that this page suggested that there was some kind\nof plan for a mass resignation of the Plaintiff’s employees. It\nasserted that this page was in fact a “target list” of employees\nwho worked for the Plaintiff and who Adella intended to poach for\nthe new venture.[note: 427]The Defendants’ response was\nsimply that the allegation of such a plan was never put to Adella\nor any of the other Defendants.[note: 428]To be fair to the Plaintiff,\nthe Plaintiff’s counsel did put to Adella that this was a target\nlist and gave Adella the opportunity to explain what the list really\nwas about,[note: 429]even\nif he did not suggest to Adella that they were planning for the\ntargets to resignen masse, which\nis not quite the same thing. 264    Since\nAdella was the head of operations, there was a myriad of reasons why\nshe would have a list of her subordinates, even if it did contain\nthe names of a few persons who were not under her charge. Her failure\nto recollect what it actually was about did not mean this was a\n“target list”. For example, there was no absolute correlation between\nthe ticks and non-ticks with the employees who actually did end\nup working for Travel Cue and those who did not.[note: 430]This list\ncertainly raised some suspicions, but it might not be as damning\nas it first seemed. 265    While\nAdella’s evidence on the various pages in the diary was not always\nclear, I accept that a significant amount of time had passed between the\ntime Adella made these entries and when she took the stand. Some failures\nof memory are expected. After looking at the diary, her evidence that\nshe did not use the notebook from front to back but that she wrote\non any page she flipped to at any point in time[note: 431]was also perfectly plausible. I\nagree with the Defendants that the fact that certain words and phrases\nare found on a single page did not necessarily indicate that those\nphrases are linked.[note: 432]",
        "Deletion of data from laptops": "266    Finally,\nI turn to the Plaintiff’s submission that an adverse inference ought\nto be drawn against the Defendants for the steps taken by Nagender, Joanna\nand Rahul to delete data from their laptops. The Plaintiff had pleaded\nthat these acts in themselves amounted to breaches of contract and duties,[note: 433]which\nI will consider separately, in order to avoid cluttering the analysis\nhere. 267    On\n17 October 2011, the following activities took place on the laptop used\nby Nagender, which had the result of wiping out data from his laptop:[note: 434] (a)     an\noperating system was installed at 1.05am, which resulted in deletion\nof data on the laptop; (b)     two\nseparate Universal Serial Bus (“USB”) devices were connected to\nthe laptop at 2:34am and 2:37am; (c)     a\nprogram from IBM known as “Secure Data Disposal” was accessed and\nexecuted (this program allows users to permanently remove files\nand documents on a hard drive, such that the data on the hard drive\ncannot be recovered) at 6.41am; and (d)     a\ncomputer program known as “SDelete” was accessed and executed (this\nprogram allows users to securely delete files and/or directories\nsuch that the deleted files and/or directories cannot be recovered)\nat 7.09am. 268    On\n6 October 2011, an operating system was installed on Joanna’s laptop\nat around 10.04am.[note: 435] 269    On\n5 October 2011, the following activities took place on the laptop used\nby Rahul:[note: 436] (a)     SDelete\nwas accessed and executed at around 1.41pm; and (b)     an\noperating system was installed at around 6.51pm. 270    With\nrespect to Rahul, it was also discovered,inter\nalia, that the following files were accessed from external\nstorage devices on 25 September 2011 (between 8:56pm and 9:41pm)\nand on 26 September 2011 (between 1:54pm and 4:06pm):[note: 437] (a)     D:\\New\nVenture; (b)     D:\\New\nVenture\\SG Marine.xlsx; (c)     D:\\Griffin\\Business\nPlan\\Productivity; (d)     D:\\New\nVenture\\QRS; (e)     D:\\New\nVenture\\QRS\\Staffing (NR Version) V1.xlsx; and (f)     D:\\New\nVenture\\QRS\\Staffing (NR Version) V2.xlsx. 271    It\nis not disputed that Nagender, Joanna and Rahul took steps to remove\ndata from their laptops.[note: 438]The Defendants argued that they\ndid so to ensure that their personal data was removed from the laptops\nthey were using.[note: 439]Nagender\ndid the acts of deletion himself,[note: 440]while Rahul brought his\nown laptop together with Joanna’s to IBM’s service centre to be reformatted.[note: 441]Rahul also claimed he did not install\nSDelete on his laptop. However, emails from the IBM service centre\nshowed that it was not IBM which installed the software. He had\nno explanation for this.[note: 442]In my\nview, it is more likely that Rahul himself installed and ran the\nSDelete software to clean his laptop of data. 272    Nagender\nand Rahul’s explanations were difficult to accept. I do not think\nit is likely that they would have gone through so much effort merely to\nensure the removal of personal data. I do, however, note that all\nthat was done to Joanna’s laptop was the installation of a new operating\nsystem, which allowed forensic specialists to uncover relevant data\nthat, in the Plaintiff’s own submissions, was crucial to its case.\nThe Plaintiff highlighted the following fragment which appeared\n“to be part of a business plan or some marketing and promotional\nmaterial” and which it argued represented clear statements of intent\nthat the New Entities were intended to compete with the Plaintiff:[note: 443] The company will be developed with a “customer\nservice and satisfaction first” in an effort to build acceptance\nand a positive reputation in the local industry. Nagender Chilkuri, Joanna Kaunang and Piyush\nShukla. The team has over 50 years of experience in service operations\nmanagement… … QRS will leverage the industry knowledge\nof its founding members to provide outstanding service to its customer.\nThe company will initially start with three key locations, Singapore,\nPhilippines and India.[note: 444] 273    The\nPlaintiff argued that, if not for the data destruction on its laptops, it\ncould have obtained more evidence of the alleged plan by the Defendants to\nset up a competing conglomerate.[note: 445]The Plaintiff also emphasised\nthe timing of the deletions, which were done after its forensic\ninvestigators were already in its office.[note: 446]It\nsubmitted that Nagender, Joanna and Rahul’s acts amounted to “a\ncovert action to destroy incriminating evidence” and the court must\ntherefore draw an adverse inference in that regard.[note: 447] 274    While\nsome general adverse inferences may be drawn, I am not prepared\nto draw the specific adverse inference that the Plaintiff had asked for,ie, that there was a masterplan to form\na conglomerate led by Nagender to compete with the Plaintiff, just\nbecause extensive efforts were made to delete data. While I agree\nwith the Plaintiff that the extent to which Nagender and Rahul went\nto wipe clean their laptops evinced that they had something incriminating\nto hide, it does not necessarily lead to an inference that the alleged\nmasterplan must have existed, the evidence of which they were trying\ndesperately to hide. Nagender, Rahul and Joanna might have wanted\nto prevent the Plaintiff from uncovering some of the private matters that\nthey had been attending to during and outside working hours. These activities\nmight or might not suffice for an employee to be summarily dismissed.\nBut they would likely be of such a nature that they would not have\nwanted their employer to discover them. 275    Further,\nthere is some merit in the Defendants’ submission that if this was\nanengineeredscheme to destroy\nevidence, it was strange that Joanna did not take more steps to\nensure the permanent deletion of her data or why Rahul did not run\nSDelete on her computer as well to ensure that the data on the laptops\nof all those supposedly involved together in the alleged masterplan\nwas removed permanently.[note: 448] 276    Ultimately,\nthe actions of Joanna, Rahul and Nagender in deleting data from\ntheir respective laptops were merely one part of the whole mosaic of\nfacts that had to be considered in totality.",
        "Conclusion": "418    With\nrespect to the Plaintiff’s claims: (a)     I\nfind that Nagender is liable to the Plaintiff for (a) his failure\nto disclose his material involvement as the moving spirit behind\nQRS, (b) his unlawful use of Piyush’s services, (c) the payment\nof a bonus to himself without proper approval, (d) his installation\nof SDelete on the Plaintiff’s laptop in breach of cl 17 of his employment\ncontract, and (e) causing the Plaintiff to make payments to Signature\nSparks in respect of the Laguna golf membership. The Plaintiff has\nnot demonstrated that breaches (a), (b) and (d) caused them any\nloss. I order that damages be assessed by the Registrar for breaches\n(c) and (e). (b)     As\nfor the claims against Rahul, Annie and Adella, while they were\nin breach of their contractual duties to the Plaintiff, the Plaintiff has\nnot shown that these breaches caused the Plaintiff any loss, and hence\nnothing needs to be referred to the Registrar for assessment. (c)     I\ndecline to make any declaratory order that Nagender had breached\nhis fiduciary duties or that Rahul, Annie and Adella had breached\nthe terms of their employment contracts with the Plaintiff. The\npower to grant a declaration is discretionary and where the court feels\nthat a declaration will serve no useful purpose, no declaration will\nbe granted (seeLatham Scott v Credit Suisse\nFirst Boston[2000] 2 SLR(R) 30 at [74]). I find this\nto be the case here. (d)     I\ndismiss the Plaintiff’s claims against Prasad, Leny and Joanna. (e)     If\nthe parties do not wish to address the court on costs, I will award\nthe Defendants (except Nagender) costs in respect of the work done\nin defending the Plaintiff’s claim against them, to be taxed if\nnot agreed. Nagender is to pay the Plaintiff costs of the work done\nin relation to the claims made by the Plaintiff against Nagender,\nto be taxed if not agreed. 419    With\nrespect to the counterclaim: (a)     I\nallow Rahul, Joanna, Annie and Adella’s counterclaim for wrongful\ndismissal against the Plaintiff with costs to be reserved to the Registrar.\nDamages are to be assessed by the Registrar. (b)     I\ndecline to exercise my discretion to grant the declaration that the\nPlaintiff’s summary termination of their respective employments is\nwrongful, as it serves no useful purpose. (c)     I\ndismiss Nagender’s counterclaim against the Plaintiff for wrongful\ndismissal as well as Nagender and Signature Sparks’ counterclaim\nagainst Holdco and Bidco. Unless the parties wish to address the\ncourt on costs, I order the Plaintiff’s costs in defending Nagender’s\ncounterclaim, as well as Holdco and Bidco’s costs in defending Nagender\nand Signature Sparks’ counterclaim, to be taxed if not agreed.",
        "Breaches in relation to the\nDefendants’ involvement in the New Entities": "",
        "Breaches in relation to the\nalleged plan to set up the New Entities with a view to competing\nwith the Plaintiff while still employed by the Plaintiff": "297    In\nrelation to this alleged breach (which was asserted againstallthe Defendants), I have already found\nthat it was not proved that there was a masterplan to compete, or\nthat there was a clear link between the resignations and the setting\nup of the New Entities as a conglomerate. 298    Nevertheless,\neven though the New Entities were not intended to be competitive,\nthe Defendants may nevertheless still have been in breach if they\ncould not properly devote their time and talents to the Plaintiff’s business.\nThe Plaintiff accepted that every employee will spend some part\nof their work time to attend to personal issues. Rather, what the\nPlaintiff was concerned with was the degree, extent and motive of\nsuch “personal work”.[note: 468] 299    I\nleave aside the issues relating to the fact that some of the Defendants also\ntook up roles as directors in the New Entities, which I will consider separately. 300    As\nfor the amount of time spent during office hours on the New Entities,\nthe Defendants tabulated the emails related to the New Entities\nto show which were sent during office hours, and which were not.[note: 469]While this\nwas not an entirely unhelpful exercise, it was not the volume of\nemails but the actual amount of working time spent on drafting them\nthat mattered. As the Plaintiff noted, some of the emails had attachments\nwith substantive content that required significant time and effort\nto compile.[note: 470]Moreover, there might\nhave been other emails which were not disclosed or destroyed.[note: 471]The\nDefendants could have also spent time in discussions or on other\nmatters for which there is no documentary evidence. 301    Undoubtedly,\nthe Defendants did spend time during working hours attending to\nmatters relating to the New Entities. Prasad, for example, drafted\nquite a large number of emails, even if they were mostly administrative\nin nature. Nevertheless, I accept that the amount of time spent\nby each of the Defendants on the New Entities was insubstantial compared\nto the time they spent on the Plaintiff’s business. Piyush attested to\ntheir habit of working long hours beyond the normal working hours.[note: 472]More importantly,\nthere was no evidence that any of the Defendants had neglected the\nPlaintiff’s work in any way. Indeed, the Plaintiff’s financial performance\nin 2011 showed an 18.8% growth in revenue from 2010.[note: 473]Even\nif the Defendants did spend some office time working on the New Entities,\nthe Defendants would not be in such gross breach of their duties that\nis sufficient to justify their summary dismissal if they nevertheless made\nup for it by working overtime.",
        "Claims for the trip to Cebu\nin July 2011": "302    The\nPlaintiff alleged that the main purpose of Nagender, Joanna and Prasad’s\ntrip to Cebu in July 2011 was to source for office space in Cebu\nfor Quest Horizon and/or QRS under the pretext of conducting interviews\nfor potential service staff in anticipation of a successful contract\nwith OMS.[note: 474] 303    As\nsuch, the Plaintiff submitted that Nagender, Joanna, and Prasad had\nmisused the Plaintiff’s funds and resources for their own business venture\nin Cebu,viz, QRS and/or Quest Horizon.\nAccordingly, they had unlawfully and dishonestly claimed from the\nPlaintiff reimbursement for expenses incurred on these trips. By\ndoing so, Nagender and Prasad were in breach of their fiduciary\nduties to the Plaintiff and/or their implied duties of good faith\nand fidelity. Joanna was also in breach of her implied duties of good\nfaith and fidelity to the Plaintiff.[note: 475] 304    While\nthe Plaintiff’s original position was thatnointerviews\nwere conducted, this position became untenable after Rahul managed\nto locate some of his email exchanges with the candidates whom Nagender,\nPrasad and Joanna had interviewed on 21 July 2011.[note: 476]According to Rahul, he managed to\nlocate these emails after personally going to Cebu.[note: 477]These emails were exchanged using\nRahul’s email address with the Plaintiff, which meant the Plaintiff\nhad them in its possession but were not disclosed. The Defendants\nalleged that the Plaintiff has been less than forthcoming with its duty\nof disclosure. They also argued that the Plaintiff could not therefore maintain\nits previous stance that it had “no record” of the interview notes or\ninterview plans of 21 July 2011 in Cebu.[note: 478]Notwithstanding\nthe Defendants’ assertions, I am prepared to accept that the Plaintiff\nsimply overlooked the existence of these emails. 305    Although\nno interview notes or plans were disclosed because the Plaintiff’s\npresent human resources manager could not find any records of such\ninterviews, I note that Nagender was very emphatic that they existed.[note: 479]In any event, whether\nor not such notes or plans existed is no longer of crucial importance\nsince it is clear that the interviews had occurred. 306    The\nPlaintiff’s case was that these interviews were only done so that the\nDefendants had a convenient cover story for being in Cebu:[note: 480] (a)     Joanna\nappeared to be “confused” as to the underlying purpose of the trip\nto Cebu as she was unable to state definitively whether they went\nto hire staff in preparation for the OMS tender or for the Plaintiff’s\nproposed service support operations in Cebu. (b)     Prasad\nhad never been involved in the recruitment of staff from the Philippines.\nIt was odd for Prasad to go to Cebu to interview staff who were\nnot being employed for a finance position. (c)     The\nDefendants did not adduce any evidence that the negotiations with\nOMS were at such an advanced stage that there was an urgency to\nget staff from Cebu at such short notice. (d)     The\nemails adduced by Rahul were sent “on or around 18 July 2011” (the\nearliest email disclosed was actually sent on 19 July but Rahul\nindicated that he called the interviewees “sometime around 17 or\n18 July”, although he said that he had actually sent emails even prior\nto that[note: 481]) while\nPrasad’s first email to Colliers arranging for the viewing of premises\nwas dated 16 July 2011. This indicated that the interviews were\narranged only after plans were already made to go to Cebu to view\npremises for QRS. (e)     It\nwas too coincidental that the OMS interviews were to be held at\nthe same time that Kavita required Nagender’s help to find premises\nfor QRS.[note: 482] 307    It\nwas evident that Nagender did go to Manila (his first stop before going\nto Cebu) for the purpose of a client meeting. Rita (the Plaintiff’s former\nclient services manager) accompanied Nagender to Manila and she confirmed\nthe client meeting took place.[note: 483]Rita gave\na reason why Nagender wanted to hire from Cebu instead of Manila.\nApparently, the people of Cebu pronounce English words differently\nfrom those in Manila, which was a “good thing to have” in a travel\nagent.[note: 484]She\ncould have gone with Nagender for the interviews in Cebu but she\nhad other duties to attend to in Manila.[note: 485] 308    Although\nRahul only emailed the interviewees after Prasad’s first email to\nColliers on 16 July 2011, it did not mean that the interviews served merely\nas a cover story. Rahul and Prasad were both dealing with different things.\nIn any event, even from the email to Colliers, it appeared that\nthe trip to Cebu hadalreadybeen\nset:[note: 486] … Me along with two senior management personnel\nare coming to Cebu on 20/21 July. The actual arrival times will\nbe known on Monday 18thJul. … 309    This\nwas consistent with Rahul’s explanation that the interview date was\nset on 21 July 2011 in order to coincide with the scheduled visit\nto Manila (which would explain the apparent “urgency” even if the\nOMS deal was yet to be set in stone).[note: 487]Rahul\nalso explained that he had put out an advertisement that was specific\nto Cebu in July 2011 and had also asked one Louie Dalguntas to suggest\npossible candidates.[note: 488]Such\narrangements would take some time, and would indicate that the intention\nto conduct these interviews was formed before the email to Colliers\nwas sent. 310    As\nfor Prasad, although he was effectively the CFO of the Plaintiff,\nit was his evidence that he was involved in the interview of non-finance\nstaff as well. He had also gone overseas to interview candidates\nin the past, even if he had never gone to the Philippines to do\nso before.[note: 489] 311    In\nshort, the Plaintiff has not established that the real purpose of\nthe trip to Cebu was to advance the Defendants’ agenda at the Plaintiff’s expense.\nAccordingly, the Plaintiff has not shown that Nagender, Joanna and\nPrasad were in breach of their duties to the Plaintiff.",
        "Breaches relating to BHEA Tech": "312    I\nnext have to consider the following issues:[note: 490] (a)     Whether\nAnnie and Adella were in breach of cl 6 of their employment contracts\nby becoming directors of BHEA Tech. (b)     Whether\nAnnie’s shareholding and directorship, Adella’s directorship and\nPrasad’s involvement in setting up BHEA Tech were in conflict with\ntheir employment with the Plaintiff and in breach of their implied\nduty of fidelity. (c)     Whether\nNagender had full knowledge of the above breaches and/or orchestrated\nthe said actions, and was therefore in breach of his implied duty\nof fidelity and/or the following fiduciary duties to the Plaintiff: (i)       to act in good faith and in the best interests of the Plaintiff; (ii)       to act with honesty and loyalty towards the Plaintiff; (iii)       not to compete with the Plaintiff; (iv)       not to place himself in a position where his duty to the Plaintiff\nand his personal interests may conflict; and (v)       to serve the Plaintiff faithfully and dutifully and not to advance\nor promote his own interests or other external interests to the\nprejudice of or contrary to the interests of the Plaintiff. 313    For\nthe sake of clarity, I have excluded from the list of issues above\nthe Plaintiff’s claims relating to the duties that I have found\nwere not owed by the abovementioned Defendants (eg.\nclaims by the Plaintiff in relation to Adella and Prasad’s fiduciary\nduties, as well as claims relating to breaches of terms found in\nthe Staff Manual). 314    I\nfirst consider whether Annie, Adella and Prasad were inactualconflict of interest. The crux\nof the Plaintiff’s argument was based on the fact that at the time\nof BHEA Tech’s incorporation, BHEA India was an IT service provider\nof the Plaintiff, and moreover, BHEA Tech had participated in the\nPlaintiff’s global tender for a new CRM system.[note: 491]As noted\nat [65] above, non-fiduciary employees are not in breach of their\nduty of fidelitymerelybecause\nthey are in a position where there is apotentialconflict\nof interest. The Plaintiff has not shown any specific instance where Prasad,\nAdella and Annie actively preferred BHEA India or BHEA Tech’s interest\nover the Plaintiff’s interest,ie,\ninstances of actual conflict. 315    The\nassistance Prasad rendered clearly did not put him in a position of\nconflict. One must remember that BHEA India was not a competitor,\nbut asupplier. Prasad owed no duties\nto BHEA India or BHEA Tech and had no interest of any kind in those\ncompanies. He did not stand to gain in any way from his assistance.\nThere was no conflict, whether actual or potential. 316    Moreover,\nuntil 22 August 2011, when the shares were allotted to BHEA India’s\nshareholders, BHEA Tech had no legal ties to BHEA India or its shareholders\nwhatsoever. Even after the BHEA India shareholders came in, Annie\ntransferred her shares in BHEA Tech less than a month later, and Adella\nresigned as director about two weeks after that. Annie and Adella were\nunpaid nominal directors with no decision making powers in BHEA Tech.\nSimilarly, they had no say in any decision as to which CRM system the\nPlaintiff should be buying – and certainly not at the global level.\nThey had no pecuniary interest in BHEA India being the Plaintiff’s\nsupplier, and even as directors of BHEA Tech, they never owed any\nduties to BHEA India at all. 317    As\nfor Nagender, he was part of the Plaintiff’s evaluation committee (through\nthe IT steering committee) to decide who would provide the global\nCRM programme,[note: 492]and he\ndid advocate for SugarCRM during the global tender.[note: 493]The\nissue here is whether it was proper for him to have allowed Prasad,\nAnnie and Adella to assist BHEA India in setting up BHEA Tech in\nsuch circumstances. Obviously he would be in breach if he had received\na personal benefit from BHEA India. But here Nagender gained nothing\npersonally from it. At best, Nagender’s assistance might be considered\nanindicatorthat he did have some\nkind of improper interest in BHEA India’s success in the global\ntender, such as a desire to invest in BHEA Tech, but this was not\nestablished by the evidence. Moreover, it is hard to see how his\nadvocacy for SugarCRM was notbona fide–\nif he did not actually think that a customised SugarCRM was a good\nidea, he would not have chosen BHEA India to customise SugarCRM\nin the first place (and it must be noted that BHEA India was engaged\nby the Plaintiff in or about June 2010,[note: 494]which was well before Nagender\nhad any inkling that he would not be the Global CEO). 318    Finally,\ncl 6 of Annie and Adella’s employment contracts states: 6.\nNon-competition The Employee should devote all work efforts exclusively to\nthe Company and furtherance to the interests of the Company [sic]. Any engagement in additional activities\nor secondary employment, no matter if gratuitous or non-gratuitous,\nor any direct or indirect participation in any other enterprise of\nany kind, requires the prior written consent of the Company which\nshall not be unreasonably withheld provided that this additional\nemployment does not constitute an obstacle to the performance of\nthe professional duties and if other justified interests of the\nCompany are not compromised in any possibly [sic]\nway. 319    The\nDefendants argued that cl 6 should be read purposively, in that\nits aim is only to prohibitcompetitiveactivity,\nas seen from the title. I reject this interpretation. In the first\nplace, the plain words of the clause could not bear this interpretation.\nThe whole point of the clause is to ensure that an employee’s engagement\nwith other companies is disclosed so that the Plaintiff may assess\nwhether it would compromise the Plaintiff’s interests; if not, then\nthe Plaintiff shall not unreasonably withhold its written consent. The\nentire second half of the clause would effectively be nullified\nif one were to read down the clause in the way the Defendants proposed. 320    That\nsaid, the circumstances behind Adella and Annie’s directorships were\nunusual. It seems to me that it could not strictly be said that\ntheir assistance to BHEA Tech were activities outside the scope\nof their employment. Their involvement resulted from a request for\nassistance by Prasad, who had been instructed to assist BHEA India\nby Nagender, partly for the reason that the Plaintiff might save\nsome money if Indraneel did not charge the Plaintiff for his subsequent\nvisits to Singapore. Arguably, the directorships would not be caught\nby this clause as they were taken up in “furtherance [of] the interests\nof the [Plaintiff]”. 321    Even\nif I am wrong about this, Adella and Annie’s breaches of cl 6 were\nat best technical. The Plaintiff suffered no loss while Adella and\nAnnie enjoyed no gain.",
        "Adella, Annie and Rahul’s directorships\nin the other New Entities": "322    With\nrespect to Adella and Annie’s directorships in Quest Horizon, Annie’s\ndirectorship in Niado and Rahul’s directorship in Q4T Singapore, they\nwere in breach of cl 6 of their employment contracts by their failure\nto obtain written permission from the Plaintiff. Nevertheless, these\nbreaches did not cause the Plaintiff any provable loss.",
        "Nagender’s failure to disclose\nto the Plaintiff his wife’s directorship in QRS": "323    The\nPlaintiff claimed that Nagender’s failure to disclose to the Plaintiff\nthe fact that Kavita was a director in QRS was a breach of the conflict\nof interest prohibition at section 2.5(2) of the Staff Manual (see\n[25] above) and/or his implied duty of fidelity. Further and/or\nalternatively, he was in breach of his fiduciary duties to act in\ngood faith and in the best interests of the Plaintiff and to act\nwith honesty and loyalty to the Plaintiff. As I have found that\nthe Staff Manual was not incorporated into Nagender’s contract of\nemployment, I only need to consider if he was in breach of his fiduciary\nduties and/or his implied duty of fidelity. 324    To\nbegin, it is not a breach of a director’s fiduciary duties and/or\nan employee’s duty of fidelity if one fails to disclose the directorship\nof one’s spouse in a non-competing company, much less a company\nthat was not even operational. 325    However,\nI have found that it was Nagender who was the true moving spirit\nbehind QRS. In this regard, I would have been prepared to say that Nagender\nwas in breach of cl 6 of his employment contract as this would,\nat the very least, amount toindirectparticipation\nin another enterprise while he was still employed by the Plaintiff,\na fact which he had an obligation to disclose. However, this was\nnot pleaded. Nevertheless, he had not only failed to disclose his\ninterest in QRS, but haddeliberatelytaken\nsteps to prevent the Plaintiff from finding out that QRS was actually\nhis business by using his wife as a smokescreen. The fact that QRS\nwas not competitive was immaterial. He was in breach of his duty\nto act with honesty and loyalty to the Plaintiff.",
        "Unlawful use of Piyush’s services": "326    The\nPlaintiff pleaded that from May to August 2011, Nagender instructed\nPiyush to perform a number of accounting tasks and undertake the\nadministration of logistical matters relating to the New Entities.\nHe was involved in the following areas:[note: 495] (a)     the\nproposed setting up of QRS’s Indian entity; (b)     preparation\nof the revenue model for QRS’s Indian entity; (c)     obtaining\nlegal and tax advice in respect of the setting up of QRS’s Indian\nentity; (d)     filling\nup forms in relation to the incorporation of entities for QRS in\nthe Philippines and Thailand; (e)     the\nsetting up of a branch office for QRS in the Philippines under the\nPhilippines Economic Zone Authority; (f)     processing\npayments in respect of the setting up of QRS’s Philippines entity; (g)     preparing\npresentation slides in respect of promoting / marketing QRS to potential\ncustomers; (h)     seeing\nto the paperwork involved in increasing the share capital for QRS;\nand (i)     preparing\na costs sharing plan between the New Entities as part of a master\nbudget. 327    The\nPlaintiff also pleaded that these activities were undertaken while Piyush\nwas an employee of the Plaintiff and during office hours.[note: 496]As\na fiduciary of the Plaintiff, Nagender had a duty to act in the\nbest interests of the Plaintiff, to serve the Plaintiff faithfully\nand dutifully and not to use the Plaintiff’s resources for his own\npersonal benefit. By instructing Piyush to perform the aforesaid\ntasks, Nagender wrongfully utilised the resources of the Plaintiff.[note: 497]Accordingly,\nNagender’s actions as pleaded above do amount to a breach of his\nfiduciary duties to the Plaintiff and/or his implied duties of fidelity.[note: 498] 328    As\nfor whether Piyush performed the tasks alleged by the Plaintiff,\nthe Defendants’ arguments seems to centre on how the Plaintiff had characterised\nthe activities, without actually showing that work hadnotbeen done. For example, the Defendants\nadmitted that while Piyush did assist in the drawing up of a costs\nsharing plan for the Changi Offices, they argued that it was not\npart of a “master budget” for the entities sharing the premises.[note: 499] 329    The\nDefendants also alleged that Piyush performed these various tasks\non his own volition, without any encouragement from Nagender, Prasad\nor any of the Defendants. In other words, even thoughno one actually asked him to do so, Piyush\nvoluntarily did the following:[note: 500] (a)     sought\nIndian tax advice for the incorporation of a QRS entity in India;[note: 501] (b)     prepared\na revenue model for QRS’s proposed Indian entity;[note: 502]and (c)     provided\ninput on the marketing material for QRS. 330    In\nitself, this is a difficult proposition to accept, although it is\nclear enough why Nagender alleged that Piyush had gone about doing\nall these things on a frolic of his own, in that there was not even\nafriendly requestfrom Nagender\nfor Piyush’s help. It is one thing for colleagues to ask each other\nfor assistance, or even for subordinates to request for the input\nof their superiors, since in such situations there is no risk of\nthere being any abuse of authority. It is different if such a request\ncame from the company’s managing director. Moreover, even though\nNagender did not reply to Piyush’s emails (such as the one where\nhe attached a proposed revenue model for an Indian entity), this\ndid not, by itself, mean that they were unsolicited. The idea that\nPiyush would have prepared a complex document such as a revenue\nmodel or that he had reached out to Cherry to ask her to talk to\nThai lawyers (even if no money was spent on this initiative, as Nagender\nstated[note: 503]) to enquire about\nthe possible incorporation of a QRS branch office without anyone\nasking him to do so beggars belief. 331    As\nfor his assistance in drawing up a “costs sharing plan” for the\nNew Entities, the Defendants claimed that Piyush was aware of the\ndiscussions that led to the incorporation of Quest Horizon, but\ndid not show any interest in participating. In May or June 2011,\nPiyush found out that Quest Horizon, Niado and BHEA Tech had been\nincorporated. He told Prasad that he felt “excluded” by his colleagues\nand volunteered his assistance.[note: 504]This would be odd behaviour,\nsince Piyush stated that he never got along with Annie, Adella,\nLeny, and Joanna.[note: 505]Why\ngo out of his way to help people he did not like? Nagender himself\nhad alleged that Piyush’s dislike for Leny and Joanna stemmed from\nPiyush’s view that they were barriers between Nagender and himself.[note: 506] 332    Based\non the evidence, it was more likely that Piyush did the work for the\nNew Entities because he was used to taking instructions from Nagender (and\nPrasad) and he felt obliged to comply with their instructions. 333    For\nthe above reasons, I find that Nagender had breached his fiduciary\nduties by instructing Piyush to perform tasks for QRS. I note that the\nmajority of the tasks that Piyush was alleged to have performed\nwere in relation to QRS, which was essentiallyNagender’s\nown company.It does not matter whether or not QRS was\ncompetitivevis-à-visthe Plaintiff\n– Nagender was not entitled to have the Plaintiff’s employees do\npersonal tasks for him where there was no possible benefit to the\nPlaintiff. A director of a company is not entitled to treat the\ncompany’s employees as if they were his own, and make use of them\nfor his private benefit. While Nagender’s breach in this regard\ndid not cause the Plaintiff any loss, as Piyush himself has admitted\nthat his activities were not done at the expense of his duties to\nthe Plaintiff,[note: 507]this does not mean that\nit was proper for Nagender to have done so.",
        "Payment of bonuses and the Australian\ntrip": "",
        "Bonus payments to Leny, Prasad,\nRahul, Annie, Joanna and Adella": "334    The\nPlaintiff claimed that Nagender exercised his discretion wrongly as\na managing director and breached his fiduciary duties and/or implied duties\nas an employee in awarding bonuses to Leny, Prasad, Rahul, Annie, Joanna\nand Adella. The Plaintiff did not take issue with thequantumof bonuses paid to these Defendants,\nbut rather with the fact that any bonuses were paid to them at all,\ngiven their clear involvement in the New Entities while they were\nall still employed by the Plaintiff.[note: 508] 335    The\nbonuses (which were generally paid on a quarterly basis[note: 509]) were alleged by the Plaintiff to be\npaid as follows over the course of May to July 2011:[note: 510] (a)     Prasad’s\nlast drawn monthly salary was $9,350. In May and June 2011 (after\nPrasad had tendered his resignation), Nagender procured and/or caused\nthe Plaintiff to pay to Prasad bonus payments amounting to approximately\n$46,850. (b)     Joanna’s\nlast drawn monthly salary was $12,198. In July 2011, Nagender procured\nand/or caused the Plaintiff to pay to Joanna bonus payments amounting\nto approximately $13,568. (c)     Leny’s\nlast drawn monthly salary was $12,198. In May and June 2011 (after\nLeny had tendered her resignation), Nagender procured and/or caused\nthe Plaintiff to pay to Leny bonus payments amounting to approximately\n$62,086. (d)     Rahul’s\nlast drawn monthly salary was $9,898. In May and July 2011, Nagender\nprocured and/or caused the Plaintiff to pay to Rahul bonus payments\namounting to approximately $25,240. (e)     Annie’s\nlast drawn monthly salary was $7,898. In May and July 2011, Nagender\nprocured and/or caused the Plaintiff to pay to Annie bonus payments\namounting to approximately $26,755. (f)     Adella’s\nlast drawn monthly salary was $10,048. In May and July 2011, Nagender\nprocured and/or caused the Plaintiff to pay to Adella bonus payments\namounting to approximately $25,547. 336    The\nPlaintiff’s position was that, in general, discretionary bonuses should\nbe paid even to departing employees if they had served dutifully and/or\nwere effective in meeting their targets, but that when exercising\nthis discretion, the overall conduct of the employee had to be considered.[note: 511]However,\nin the present case, given the circumstances regarding the Defendants’\ninvolvement in the New Entities, it was unlawful and dishonest for\nNagender to authorise these payments.[note: 512] 337    I\nagree that it would be very unusual for a managing director to pay bonuses\nto employees who were guilty of serious wrongdoing against the company.\nHowever, this was not the case here. I have found that the Defendants\n(apart from Nagender) were at most in technical breach of their duties\nwith respect to their involvement in the New Entities. While they\nhad spent some of their working hours on the New Entities, this\ndid not appear to have affected their work performances overall.\nIn such circumstances, I do not think Nagender acted in bad faith\nwhen he authorised these bonuses.",
        "Payment of Nagender’s bonus": "338    On\n5 September 2011, while serving his notice period, Nagender procured\nand/or caused the Plaintiff to make a bonus payment to himself amounting\nto $64,666.[note: 513]The Plaintiff\nalleged that by doing so without the approval of George or the Plaintiff’s\nboard of directors, Nagender had breached his fiduciary duties and/or\nhis implied duties as an employee.[note: 514]On the other hand, the\nDefendants denied that there was any requirement that Nagender had\nto seek the approval of the Plaintiff’s board of directors or George.[note: 515] 339    George\nand Marcus admitted that there were no formal procedures in place\nfor the payment of bonuses to senior management of the Griffin Group\nprior to 2011.[note: 516]George\nalso accepted that Nagender had never obtained or sought the approval\nof the Plaintiff’s board of directors in respect of bonuses payable\nto himself.[note: 517]While\na remuneration committee had been formed in 2011, no formal procedures\nwere put in place,[note: 518]although Marcus did add\nthat better corporate practices prevailed after Inflexion invested\nin the Griffin Group and it would not be acceptable for any of the\nheads of the Griffin entities to unilaterally decide their own pay\npackages.[note: 519] 340    As\nfor past practice, George said that Nagender would discuss the bonus\nto be paid to himself (ie, Nagender).\nThis usually took place over the telephone and George would verbally\napprove the figure if it was reasonable.[note: 520]Although\nNagender did not do this in 2010, George said he “let it go” because\nhe “did not want to push things too far”.[note: 521]Nagender denied\nsuch a practice and said that, prior to 2011, his bonuses had been “validated”\nby Leny.[note: 522]As for his\nbonus for 2011, he got Joanna to approve his bonus since she was\nthe acting general manager of the Plaintiff.[note: 523] 341    Undoubtedly,\nGeorge gave Nagender a great deal of leeway when it came to his\nremuneration,[note: 524]notwithstanding\nthe inherent conflict of interest in such a situation. In fact,\nit was George’s evidence that he had asked Nagender toincreasehis proposed bonus in 2009 from\nhis usual amount of about $27,000.[note: 525]It\nwas possible that, based on Nagender’s performance and if there\nhad been a proper transition to a new managing director, George\nmight well have granted Nagender the 2011 bonus anyway, as George\nadmitted.[note: 526] 342    Despite\nthe wide discretion which Nagender had in determining the quantum\nof his bonus, I do not think that this was a discretion without limits.\nI find that it is more likely that the practice was for Nagender\nto call George for the latter’s approval, and that it was understood\nthat Nagender had to do so before he could be paid his bonus. Even\nif that was not the case, it was apparent that things had changed\nin 2011. The appointment of the remuneration committee was one factor.\nThe fact that Nagender had alreadyresignedwas\nanother important factor. In such circumstances, the calculus for\nthe company had changed. Certainly, the role of bonuses as an incentive\nfor an employee to stay disappears. Nagender might have felt he deserved\nthe money but he was in no position to exercise the discretion to pay\nbonuses to a resigning employee when the resigning employee was himself.\nHis bonuses could not be approved or ratified by his subordinates. He\nhad put himself in a position ofactualconflict\nof interest. Accordingly, I find that he was in breach of his fiduciary\nduties to the Plaintiff.",
        "Linda’s bonus": "343    The\nPlaintiff also claimed that Nagender had wrongfully exercised his discretion\nas managing director and that he was in breach of his fiduciary duties\nand/or implied duties of fidelity in procuring and/or causing the Plaintiff\nto pay bonuses totalling $15,000 to Ms Huynh Ngoc Dao Lam (“Linda”)\nas such payments were not in the best interests of the Plaintiff.[note: 527] 344    The\nPlaintiff had employed Linda as an IT project manager with effect from\n1 May 2011 on a 4-month contract on a monthly salary of $5,000.[note: 528]Nagender interviewed her.\nNagender said he engaged Linda because he needed somebody “to interface\nwith BHEA India for the customisation of the SugarCRM project”.[note: 529]Linda expected a higher\nremuneration package than what the Plaintiff could offer her. As\na compromise, Nagender agreed to pay her a salary of $5,000 with\nthe balance $15,000 payable upon the meeting of certain targets.[note: 530] 345    Linda\nwas originally slated to be a witness for the Defendants, but she was\neventually not called to give evidence. However, the Plaintiff made references\nto Linda’s AEIC in the course of cross-examining Nagender and Rita.\nLinda’s account in her AEIC differed from Nagender’s in one respect, which\nis that while she recalled Nagender having offered to bridge the\ngap between her expected salary with bonus payments, she could not\nrecall Nagender fixing and informing her of the quantum of such\nbonus payments, either at the interview or subsequently.[note: 531] 346    The\nPlaintiff submitted that, as a result of this failure to call Linda\nas a witness, an adverse inference should be drawn against the Defendants.\nIt submitted that the Defendants decided not to call Linda because\nthey feared that she would be rigorously cross-examined on this\ndifference between her account and Nagender’s, and reveal Nagender’s\nself-serving account of the facts to be completely untrue.[note: 532]With\nrespect, this was a slender basis upon which to found an adverse\ninference. The discrepancy between Linda’s version, where the shortfall\nin her expected salary would be bridged by bonus payments, and Nagender’s\nversion, where the shortfall of $15,000 would be payable upon certain\ntargets being met, does not appear to me to be significant. Both\nmaterially relate to an understanding that the shortfall would be\nmade up in the form of bonus payments, which would naturally be\nsubject to work performance. 347    Further,\nthe Plaintiff also alleged that even if there was an agreement with\nLinda on the bonus to be paid to her, Nagender still wrongly exercised his\ndiscretion in coming to the arrangement and/or paying the bonus. SugarCRM\nwould be obsolete once Salesforce was implemented as the Global\nCRM system for the Griffin Group. The Griffin Group’s contract with\nSalesforce, Inc was signed on 22 July 2011. Therefore, Linda’s continued\nemployment in the Plaintiff post-July 2011 for the further development\nof SugarCRM was completely unnecessary.[note: 533] 348    I\npreferred Nagender’s account to the Plaintiff’s allegations. In\nthe first place, although the $15,000 figure seems excessive at\nfirst glance, nevertheless if one were to calculate the average\namount paid to Linda over four months, inclusive of her base pay,\nshe would only be getting $8,750 a month, which does not seem excessive\nfor a skilled worker. Even though SugarCRM would eventually be obsolete,\nthere would undoubtedly be a cross-over period before the new system\nis implemented, during which the Plaintiff would benefit from having\nan operational and improved CRM system. Moreover, no plausible reason\nhas been suggested as to why Nagender would have wanted to wrongfully\nbenefit Linda in the first place. In such circumstances, it cannot\nbe said that Nagender was in breach of his duties for paying the\nbonus to Linda pursuant to an understanding or agreement reached\nbetween them at the time when Nagender hired Linda.",
        "Linda’s Australia trip": "349    In\na similar vein, the Plaintiff also pleaded that Nagender was in breach\nof his duties for approving Linda’s trip to Australia from 3 September\n2011 to 10 September 2011 and sanctioning the reimbursement of her\ntravel expenses when there was no reason for her attendance.[note: 534] 350    According\nto Rita, the trip to Australia was organised by Annie, Madhu and\nherself for staff in two of the Plaintiff’s teams. The trip had\ntwo aims. The first was to familiarise those teams with the locations\nof airports, vessels and offshore rigs in Australia, which was useful\nfor staff when making route recommendations. The second was that\nit would be a team building opportunity for the two teams.[note: 535] 351    The\nPlaintiff described the Australia trip as a “complete joyride”[note: 536]and\nthat there was no reason for Linda to go since she was a mere contract worker\nwhose role in the Plaintiff, if any, was in relation to IT matters\nand not client management and business development. Therefore, Nagender had\nexercised his discretion wrongly in allowing Linda to go on the trip.[note: 537] 352    Rita\ntestified that she was actually the one who made the decision for Linda\nto go on the trip, for the following reasons: (a)     She\nwanted to ensure that there would be sufficient drivers who could\ntake turns driving. Linda was one of the few people who could drive.\nMoreover, she was from Australia and knew the country. Linda could\nhelp with the navigation required.[note: 538] (b)     Although\nLinda was nearing the end of her employment, Rita saw no reason\nto exclude her from consideration.[note: 539] (c)     Linda\nhad done a great job on the SugarCRM upgrading project and demonstrated\na good work attitude.[note: 540] 353    It\nwas clear that the participants enjoyed themselves during the trip,[note: 541]but\nthat did not necessarily mean that the trip must have been a “complete\njoyride”. There was nothing wrong in Nagender not wanting to override\nRita’s decision,[note: 542]which\nwas in no way unjustifiable. I accept the evidence of Rita and the\nreasons stated by her for including Linda on the trip. Under the\ncircumstances, I find that Nagender was not in breach of his duties\nfor approving Linda’s trip to Australia.",
        "Golf membership in Laguna National\nGolf and Country Club": "354    On\n17 June 2011, Signature Sparks purchased a 10-year corporate membership\n(with three nominees) in Laguna National Golf and Country Club (“Laguna”).[note: 543]The three nominees for the first year\nof the corporate membership were Nagender, Joanna and Peter McSweeney\n(“Peter”). Peter was the Plaintiff’s business development manager\nat the time. Then in around July 2011, Nagender caused the Plaintiff\nto pay $75,000 to Signature Sparks, which defrayed part of the sum\nof $200,000 that Signature Sparks paid to Laguna to acquire for\nitself the aforesaid golf membership. 355    Nagender\neffected this payment to Signature Sparks in a most unusual way.\nFirst, Nagender instructed Piyush to issue three cheques of $25,000 (dated\n5 July 2011) on behalf of the Plaintiff in favour of Nagender, Joanna and\nPeter, which were countersigned by Nagender. This was followed by the\nsubmission of a claim, along with the nomination letter from Laguna, by\neach nominee, to the Plaintiff. Oddly, the name of Signature Sparks\nhad beenredactedfrom the nomination\nletters. Nagender then instructed Piyush to record the total payment\nof $75,000 in the Plaintiff’s books and accounts as “Golf Membership”.\nNext, Nagender got Peter and Joanna tocashout\nthe cheques. Finally, Peter and Joanna handed the cash to Nagender[note: 544](although\nthere is an inconsistency in that Joanna recalls paying the cash\nto Kavita instead[note: 545]). 356    The\nPlaintiff pleaded that Nagender’s involvement was a breach of his fiduciary\nduties as well as his implied duties of fidelity, and that Joanna\nwas in breach of her implied duties of fidelity.[note: 546]",
        "Nagender’s rationale": "357    Nagender\nclaimed that he thought it would be beneficial for the Plaintiff\nto have a golf membership as it was increasingly evident that the Plaintiff’s\ncustomers enjoyed golfing activities. Nagender tasked Peter with obtaining\na golf membership for the Plaintiff. After doing some research, Peter\ntold Nagender about the prices at Laguna.[note: 547]Subsequently,\nPeter informed Nagender that there was a 3-nominee corporate membership\nin Laguna that was available for $200,000 and there were two or\nthree other parties interested in purchasing the membership.[note: 548] 358    Nagender\nalso asserted that he did not wish to commit the Plaintiff to pay\n$200,000 for a corporate membership. He had considered purchasing individual\ngolf term memberships (which cost $25,000 for each individual member\nfor one year of membership only) for some of the Plaintiff’s staff\nto test out the utility of the golf membership.[note: 549]However, as the offer for the three-nominee\nmembership that came along with the corporate membership was for\na limited time only, he decided that the most cost-effective solution\nwas for him to take up the corporate membership through Signature\nSparks and the nominees of the corporate membership to be three\nof the Plaintiff’s staff for one year. If the Plaintiff decided\nagainst taking up the golf membership after one year of trial, it\nwould then only have spent $75,000, the equivalent cost if the Plaintiff\nhad taken up three individual golf term memberships for one year\ndirectly with Laguna instead. If the Plaintiff wished to take over\nthe 10-year corporate membership, Signature Sparks could transfer\nit to the Plaintiff for the balance $125,000 (being $200,000 less\n$75,000) plus the transfer fee of about $50,000. In this instance,\nthe total cost to the Plaintiff for the three “trial term memberships”\nfor the year before would essentially have been only the transfer\nfees of about $50,000, which was about $25,000 less than if the\nthree individual one-year term memberships (costing $75,000) were\nto be taken out directly with Laguna.[note: 550] 359    The\nDefendants further pleaded that the payment of $75,000 by the Plaintiff\nto Signature Sparks was for the nominations and utilisation of the golf\nmembership in Laguna for Nagender, Joanna and Peter so that they could\nentertain the Plaintiff’s clients.[note: 551]",
        "Analysis": "360    Nagender\ntried to show that there was a potential cost saving of $25,000\nfor the Plaintiff in his hypothetical case should the Plaintiff\ndecide to take up the corporate membership after the one-year trial\nperiod. I find it hard to believe that Nagender was so generous\nas to have Signature Sparks spend $200,000 on buying a corporate\ngolf membership for itself so that the Plaintiff could enjoy a potential\ncost saving of $25,000. A closer look would show that the Plaintiff\ndid not enjoy any cost saving. 361    Basically,\nthe cost comparison put forth by Nagender is between Option A: the\nPlaintiff purchasing three individual one-year term memberships\nfrom Laguna for $75,000 and then subsequently purchasing a 10-year\ncorporate membership from Laguna for $200,000 (thus getting a total\nof 11 years of membership for a total cost of $275,000); and Option\nB: the Plaintiff initially paying Signature Sparks $75,000 for golfing\nuse by three of the Plaintiff’s nominees for a year, and then paying\nSignature Sparks $125,000 to take over the balance of the 10-year\ncorporate membership plus paying another $50,000 as transfer fee\n(thus getting a total of only 10 years of membership essentially\nfor a total cost of $250,000). There is a supposed saving of $25,000\naccording to Nagender but he avoided mentioning that the overall\nlength of the membership isshorter by a year.\nThe average cost for each year of membership works out to be the same\nfor both at $25,000 per year. From this perspective, there is no\nreal benefit to the Plaintiff to speak of. 362    In\nany event, whether it is Option A or Option B, Nagender had instead\nincreased the overall cost of the golf membership for the Plaintiff because\nif the Plaintiff had purchased the 10-year corporate membership straightaway\ninstead of doing so in two steps, the average cost of each year of\nmembership is only $20,000 per year. Computed over ten years, Nagender\nhad increased the cost of the golf membership for the Plaintiff\nby $50,000 instead. I find it hard to believe that he had the interest\nof the Plaintiff in mind where this corporate golf membership transaction\nwas concerned. 363    If\none were to compare it with the cost of $75,000 per year for three individual\nmemberships, then the average cost per year for a 10-year corporate\nmembership is very much cheaper at an average cost of $20,000 per\nyear. On any view, it is certainly far more economical to take up\nthe 10-year corporate membership. The parties also spilled much\nink on the utility (or lack thereof) of the golf membership in the\ncontext of the Plaintiff’s business. These arguments however do\nnot take us very far. Leaving aside the question of cost, a corporate\ngolf membership is of coursepotentiallyuseful\nfor a company like the Plaintiff. It is probably notnecessary, but that is not the same thing.\nIn any event, the Plaintiff never had the benefit of the golf membership.\nIt never owned it. All it got was, at best, a one year licence (to\nuse the term loosely) for three of its employees, at a hefty total\ncost of $75,000 to golf for only one year. 364    Could\nsuch an arrangement have beenbona fide?\nEverything pointed to the contrary. The Defendants claimed that\nNagender had beenentirelytransparent\nabout the manner by which the golf membership had been purchased.[note: 552]This could not have been further from\nthe truth. 365    The\nDefendants had no explanation for the surreptitious way in which\nNagender got the Plaintiff to make payment to Signature Sparks.\nThe easiest thing to do would have been to issue a cheque to Signature\nSparks, rather than have the Plaintiff issue separate cheques to\nthe employee nominees, and then have the nominees cash out the cheques\nto pay Signature Sparks. The Defendants rationalised this by saying\nthat Nagender did not try to hide the transaction as he had discussed\nit with Marcus and Khuman. They also argued that the nomination\nletters were given to Piyush as part of the administration and records-keeping\nprocesses. Therefore there was no attempt to hide the true purpose\nof the cheque payments to each of the individual nominees – it was\nclearly for the purposes of the golf membership.[note: 553] 366    As\nmentioned above, Nagender claimed that he had informed Marcus and\nKhuman as to his reasons behind the decision to take out a corporate membership\nin Signature Sparks’s name. This was when they purportedly met at\na restaurant in Laguna on 28 June 2011.[note: 554]However, both Marcus and\nKhuman said they did not recall Nagender talking about this.[note: 555]There\nis no evidence of that conversation, but there was a separate conversation\non 29 June 2011 which was secretly taped by Nagender,[note: 556]and I reproduce the relevant part\nof the transcript below: NR [ie,\nNagender] : … So if someone says… you know what… it was mis… b00134 NR: …miserable for me to go and get this 75000 dollars Golf\nstupidities… it was a misery to make a decision about it. On one\nside I am saying… wait a minute I need to… b00135 NR: …to grow, I need to get customers… the business is moving\nin a different way… do I pay 200000 dollars and get a full time\nmembership or do I get 75… who do I discuss this with. b00136 NR: … it is a requirement in my… If I tell him (referring\nto AK)… okay 75000 dollars for a golf membership… he’ll say take\na toss. But for offshore and…. b00137 NR: …it is proving to be important. I take two people from\nSWIRE and I take one from EMAS offshore. That’s how I started with\nEMAS. Whole golf game finished. b00138 NR: …having tea and Swire says… “You are not dealing with\nGriffin… oh… I have been dealing with them for last 5 years… my\ngod… its (sic) been good sailing.” EMAS says… okay come down. We\nare doing 120… b00139 MH: That’s just good business NR: …tickets. Okay… (MH interrupts… yeh)\nbut these are also certain gut feel (sic) so made a dec…now I feel I made a mistake. I should have gone in for\na… b00140 NR:…full blown membership rather than\na term membership… yaaa… but again it is a question of decision\nat that point of time…where I said if I am not using it I only lose\n75…[note: 557] [emphasis added in italics] 367    This\nconversation took placeafterthe\ncorporate golf membership had been purchased on 17 June 2011 by\nSignature Sparks (albeit before the Plaintiff issued the cheques\ndated 5 July 2011 each to Nagender, Joanna and Peter for onward\npayment to Signature Sparks). By that time, Nagender had already\ndecided to go through with the transaction. Signature Sparks had already\npurchased a “full blown membership”. It is strange then that in\nthe recorded conversation Nagender said he felt that he had made\na mistake and that he should have gone for a full blown membership\nrather than a term membership, when he had never acquired an individual\nterm membership in the first place for the Plaintiff. There are\nthree points to note here. 368    First,\nthe transcript does not show that Nagender said anything about the\nfact that the golf membership was in Signature Sparks’s name or\nthat the payments would be made to Nagender himself. After all,\nthe crucial issue is not whether Nagender had disclosed that the\ncash payments were for a golf membershipper\nse, but rather that the Plaintiff would be making payments for\na golf membership thatSignature Sparks had\nacquired. 369    Second,\nNagender obviously knew that the cost per year for taking up the\nthree individual term memberships at $75,000 per year is nearly\nfour times more expensive that taking up the full blown 10-year\ncorporate membership which works out to only $20,000 per year. From\nthis point of view, he was trying to excuse what he did by saying\nthat “now I feel I made a mistake. I should\nhave gone in for a….. full blown membership rather than a term membership…”.\nSo he recognised his “mistake” on hindsight for purchasing very\nexpensive individual term memberships of one year for the Plaintiff. 370    Third,\nNagender was also trying to mislead Marcus and Khuman into thinking\nthat he had purchased three individual term memberships from Laguna\nfor the Plaintiff at $75,000, when in truth, no such thing happened. Nagender\nconcealed from them the fact that Signature Sparks, having purchased\nfor itself the much cheaper 10-year corporate membership which works\nout to an average cost of $20,000 per year, was going to charge\nthe Plaintiff $75,000 per year for golfing use by three of the Plaintiff’s\nstaff, thereby making for itself a profit of $55,000 for each year\nthat the arrangement continued. There is no guarantee that Signature\nSparks would transfer its corporate membership at a deeply discounted\nprice of $125,000 for the balance of the nine years of corporate\nmembership to the Plaintiff at the Plaintiff’s insistence. Signature\nSparks gave no written binding option to the Plaintiff to purchase\nthe corporate membership from Signature Sparks at $125,000 after\none year. In my assessment, if this “licensing” arrangement had\nnot been discovered and had gone on for the full life of the 10-year\ncorporate membership in the name of Signature Sparks, then Signature\nSparks would stand to gain a total of $550,000. The “licensing” arrangement\nneed go on for only three years for Signature Sparks to more than\nfully recover its entire cost of purchasing the 10-year corporate membership\nfor only $200,000. After that, it would be a pure profit of $75,000\nper annum for the next seven years. Nagender was thus trying to make\nmoney off the Plaintiff whilst acting as its fiduciary. Such is\nthe depth and scale of the deception and dishonesty in this transaction. 371    Even\nif the Plaintiff were to refuse to purchase the balance nine years of\nthe corporate membership for $125,000 at the end of one year (on\nthe assumption that there was a binding option which the Plaintiff\ndid not want to exercise), Signature Sparks would still have got\nfor itself a huge subsidy of $75,000, which would have brought down\nits cost of owning a nine-year corporate membership at an average\ncost of only $13,888 per annum. 372    The\nnext issue related to the fact thatsomeonehad\nredacted the words “Signature Sparks” from the nomination letters\nsubmitted by the nominees to Piyush as supporting documents for\nthe three cheques totalling $75,000.[note: 558]The obvious candidate\nwas Nagender, as he had both the means and motive to accomplish\nit. Nagender denied having anything to do with it, and claimed he\ndid not know who did it, although he claimed that he had asked Peter\nto photocopy the letters and submit them to the Plaintiff (which\nwould suggest that it wasPeterwho\nblanked the letters).[note: 559]The Defendants\nargued that the Plaintiff should have called Peter as a witness\nto testify to this, and an adverse inference should be drawn against\nthe Plaintiff and Peter in this regard.[note: 560]Yet Nagender himself could not\nsee a reason why Peter would do such a thing.[note: 561]Whatever it is, I believe that Nagender\nhad caused the words “Signature Sparks” to be redacted from the supporting\ndocuments given to the Plaintiff for its records. In the same way, I\nalso find that he was responsible for the convoluted manner by which\nthe Plaintiff paid the $75,000 to Signature Sparks by not issuing\nthe Plaintiff’s cheques directly in the name of Signature Sparks\nbut in the names of the Plaintiff’s nominees, and for these nominees\nto cash the cheque and hand the cash to either himself or Kavita.\nFor obvious reasons, Nagender did not want the transaction in the\nPlaintiff’s records ever to reveal the involvement of Signature\nSparks. Clearly, Nagender knew that it was a highly improper transaction.\nErasure of “Signature Sparks” from the documentary trail was therefore\na part of his overall concealment to minimise the risk of discovery. 373    The\nDefendants also raised the argument that the Plaintiff had budgeted\nfor a golf membership for 2011.[note: 562]It was only late in the day that\ninspection of electronic copies of the budget documents on 26 November\n2013 revealed that there werehiddencolumns\nwith a reference to $60,000 for a golf membership (which did not\nmatch the $75,000 that was actually paid out). The Defendants argued\nthat as the Plaintiff could not explain why the columns were hidden,\nan adverse inference should be drawn against it.[note: 563]Considering that the\nbudgets bearing the hidden columns were attached to the original\nemails sent from the Plaintiff to GGG, which were prepared by Nagender\nand Prasad or at their direction,[note: 564]it seemed to me the question\nof why the columns were hidden is one that the Defendants should\nbe answering instead. 374    To\nsummarise, as a result of these arrangements, Nagender acquired an\nasset for Signature Sparks, which was effectively subsidised by\nthe Plaintiff. He has not only failed to disclose his interest in\nthe matter, he tookdeliberate stepsto\nprevent the Plaintiff from finding out. He had put himself in a\nposition where, if the value of the golf membership went up, he\ncould sell it to a third party, at an increased profit. If the value\nwent down, he could simply sell it to the Plaintiff using the excuse\nthat the “trial” was successful, or even continue to “sell” one-year\nterm licences to the Plaintiff at an enormous gain to himself. It\nwas a win-win situation for Nagender, at the Plaintiff’s expense. 375    For\nthe above reasons, I find that Nagender was in blatant breach of both\nhis duties as a fiduciary and his implied duties as an employee. 376    There\nis another point of significance which should be dealt with at this\njuncture. At [108], I stated that Nagender would likely have firmed\nup his intention to quit the Plaintiff sometime between May and\nJuly 2011. I note that Signature Sparks purchased the 10-year corporate\ngolf membership on 17 June 2011. This further suggests to me that\nperhaps on 17 June 2011, he might still not have made up his mind\nto resign yet because if he did, he would not be able to exploit\nthe profitable transaction of having Signature Sparks sell one-year\nterm golf licences to the Plaintiff at $75,000 per annum. To do\nso, he must still be at least the managing director of the Plaintiff\nto cause this to happen on a yearly basis. No evidence was led to\ndemonstrate that the corporate golf membership would be really useful\nfor Signature Sparks itself. With this further bit of evidence from\nthe date of the purchase of the corporate golf membership by Signature\nSparks, I am prepared to further refine the probable date of Nagender’s\nfirm decision to resign to be sometime between 17 June 2011 and\nend July 2011. This reinforces my view that as of February 2011,\nwhen Quest Horizon was incorporated, it was more likely to be the\nprivate activity of its shareholders than one which involved a masterplan\nof Nagender being put into action.",
        "Joanna’s involvement": "377    The\nnext question is whether Joanna too was in breach of her implied duty\nof fidelity arising out of the golf membership transaction. It is\nclear to me that her level of involvement was far lower than that\ncompared to Nagender (and even Peter, although I am not suggesting\nthat Peter was knowingly complicit in Nagender’s scheme). She said\nthat Peter told her that it was Signature Sparks that acquired the\nmembership and the Plaintiff only needed to pay the cost of having\nthe three of them as nominees for a year which was $25,000 each.\nEssentially, all she did was to fill in the application form that\nPeter provided her, encash the Plaintiff’s cheque for the sum of\n$25,000 and thereafter hand the funds to Kavita, on Nagender’s instructions.[note: 565] 378    The\nPlaintiff’s case was that Joanna was in breach of her duty of fidelity\nby “knowingly participating” in the scheme as she had clearly failed to\nact in the Plaintiff’s best interests.[note: 566]It was also argued that she\nshould have made inquiries as to why the membership was taken out\nin the name of Signature Sparks and why the payment was made in\nthat manner, or put a stop to the payments, or alerted GGG in the\nUK.[note: 567] 379    However,\nthere is nothing to suggest that Joanna knew the nomination letters\nhad been tampered with or that no record was made of the fact that\nthe moneys were transferred to Signature Sparks. The evidence does\nnot show that she was aware that Nagender’s actions were not in\nthe Plaintiff’s best interests. She did not profit by the arrangement.\nShe was merely following Nagender’s instructions, like Piyush and\nPeter. I therefore find that she was not in breach of her implied\nduty of fidelity.",
        "Tenancy of residential premises\nfor Nagender": "380    By\nway of a tenancy agreement dated 1 June 2011 (“the Tenancy Agreement”),[note: 568]the\nPlaintiff entered into a two-year tenancy commencing 1 June 2011\nfor premises at Frankel Place at a monthly rental of $6,550 as residential\nlodgings for Nagender.[note: 569]This was about two and a\nhalf months before his resignation from the Plaintiff’s employment\non 16 Aug 2011. Under cl 4(f)(i) of the Tenancy Agreement, the Plaintiff\ncould only terminate the Tenancy Agreement after 12 months from\nthe commencement of the Tenancy Agreement and after giving three\nmonths’ notice if Nagender resigned from the Plaintiff’s employment.[note: 570] 381    The\nPlaintiff’s case was that Nagender knew that he would be resigning\nfrom the Plaintiff’s employment prior to the commencement of the\ntenancy period; yet, he procured and/or caused the Plaintiff to\nenter into the Tenancy Agreement and thereby exposed the Plaintiff\nto liability to pay for at least 15 months’ rent.[note: 571]He\nwas therefore in breach of his fiduciary duties and/or his implied\nduty of fidelity to the Plaintiff.[note: 572] 382    Nagender\nclaimed that he had always been entitled to accommodation being\nprovided by the Plaintiff as a term of his employment. In anticipation\nof relocating to London (ie, in\nexpectation of becoming the Global CEO), he purchased a much smaller\nproperty in Pine Vale (which transaction was completed sometime\nin mid-2010) for his children’s use in the event that they wanted\nto stay in Singapore while he was in London[note: 573].\nHe then put his previous apartment at Ocean Park up for sale in\n2010,[note: 574]which sale was completed\nin June 2011. 383    I\nnote that Nagender and his wife had executed the Option to Purchase\nfor the Ocean Park property on 25 March 2011, which was accepted\nby the purchasers on 8 April 2011.[note: 575]This\nfact reinforces my earlier finding that Nagender would not have\nintended to resign as early as February 2011. Even if he had an\nintention to cause damage to the Plaintiff, I do not think he would\nhave put himself through the hassle of selling the Ocean Park property,\nleaving no place for himself to stay, and having perhaps to look\nfor a replacement property. While he had another property in Pine\nVale, the liveable area was half the size of his previous accommodation\nin Ocean Park,[note: 576]which he said\nwas too small for his household’s needs.[note: 577] 384    In\nany event, I have found that Nagender would likely have made up his\nmind to resign sometime between 17 June and end July 2011. As at\nthe date of the Tenancy Agreement,ie,\n1 June 2011, Nagender therefore had no intention to leave the Plaintiff\nand he did nothing wrong when he procured the Plaintiff to enter\ninto the Tenancy Agreement. 385    Even\nif Nagender already had made up his mind to resign when the Tenancy\nAgreement was entered into, Nagender had not resigned yet and he\nwas also obliged to give six months’ notice of his resignation.\nClearly, the reasonable expectation would be that the Plaintiff\nwould continue to provide Nagender with rented accommodation whilst\nhe served out his notice period. Nagender resigned on 16 August\n2011 and his expected notice period would therefore run out on 16\nFebruary 2012. If he had not been summarily dismissed, he would\nhave stayed in the rented property for a good eight and a half months.\nSurely the expectation would still be for the Plaintiff to continue\nto provide him with rented accommodation for this period. Viewed\nin this light, it was not extravagant for Nagender to have the Plaintiff\nenter into the Tenancy Agreement. Further, a minimum tenancy term\nof 15 months does not appear to me to be out of the ordinary. 386    Accordingly,\nI am not able to find that Nagender had entered into the Tenancy\nAgreement on behalf of the Plaintiff in bad faith. Nagender’s obligations\nto the Plaintiff did not require him to drastically reduce his family’s\nstandard of living by moving to Pine Vale, especially since he had sold\nthe Ocean Park property because he had been led to believe he would be\nmade the Global CEO. In my view, if he had stayed on, the Plaintiff would\nnot have complained about him staying in Frankel Place and leaving Pine\nVale empty. Most importantly, his frame of mind at the time the Tenancy\nAgreement was entered into was that he was still staying on with the\nPlaintiff. For these reasons, I find that Nagender did not breach\nhis fiduciary duties and/or his implied duty of fidelity when he\nprocured the Plaintiff to enter into the Tenancy Agreement.",
        "Destruction of information on\nthe Plaintiff’s laptops": "387    It\nwas not disputed that Nagender, Joanna and Rahul deleted the data on\ntheir laptops by the acts described at [267] to [270] above. The\nPlaintiff relied on the following contractual terms and duties owed\nby these Defendants to the Plaintiff: (a)     Clause\n17 of Nagender and Rahul’s employment contracts. (b)     The\nfollowing fiduciary duties owed by Nagender to the Plaintiff: (i)       to act in good faith and in the best interests of the Plaintiff; and (ii)       to act with honesty and loyalty towards the Plaintiff. (c)     The\nimplied term of fidelity owed by Nagender, Rahul and Joanna to the\nPlaintiff.",
        "Whether there was a breach of\ncl 17": "388    Clause\n17 of Nagender and Rahul’s employment contracts stated: 17.\nConfidentiality of Information The Employee shall be authorized to gain access to certain\ncomputer systems, programs and data. The Employee must not attempt,\nalone or with others, to gain access to data or programs to which\nthey have not been authorized to gain access. The Employee must not, except with specific\nprior authority from the Management, load into any computer via\ndisk, typing, electronic data transfer or by any other means, any\nother software programme or application. The Employee must not use\nor insert into any computer any floppy disk, CD-ROM, DVD, removable\nhard drive, memory stick, or any other device for the storage and\ntransfer of data programs. The Employee must not use any modern link\nor network link or any other internet or internet link to access\nany other computer or information service without prior written\napproval, and the Employee must not download any file without specific\nprior written approval from the Management. The Employee must not\nconnect any piece of computer equipment to any network or other\nitems of computer equipment without written approval. The Employee shall be responsible for any\naction taken against the Company for breaches of copyright resulting\nfrom any breach of this condition, which may render the Employee\nliable to summary dismissal. 389    The\nDefendants invited me to read the clause much more narrowly by interpreting\nit purposively. They argued that it was apparent that cl 17 had two\nprimary purposes, namely:[note: 578] (a)     It\nprotected the Plaintiff’s confidential information from being accessed,\nstored onto an external device and transferred, or alternatively\nfrom being transmitted by way of internet. (b)     It\nplaced liability for copyright infringement on the employee. It was\nin this context that the prohibition against loading any software onto\nthe Plaintiff’s computers, as well as the downloading of any files, was\ninstituted. 390    They\nfurther argued that a strict, literal reading of cl 17 would result in\nabsurdity, as it would prevent employees from using on the Plaintiff’s computers\nany USB flash drive, for example. Moreover, a plain reading of the\nclause did not contain any prohibition on the storage of data or document\nfiles, but merely prohibited the loading into the Plaintiff’s computer\nof any software.[note: 579] 391    Undoubtedly,\nin interpreting a clause in a contract, the court should take into\naccount the commercial purpose of the provision. Nevertheless, I find\nno reason to depart from the plain and obvious meaning of the clause. There\nare plenty of possible reasons why an employer may wish to prevent an\nemployee from installing software without permission, which is not limited\nto fears of copyright infringement. Therefore, Nagender and Rahul were\nin breach of cl 17 by installing and running the software SDelete\non the Plaintiff’s laptops without permission. 392    However,\nthis was, ultimately, merely a technical breach, as no loss was\ncaused to the Plaintiff. The Plaintiff had a terminal server system\nwhich was described in Sandeep’s AEIC. This meant that, in general,\nemployees of the Plaintiff generally worked on documents which were\nstored on a central server rather than on individual laptops. They\naccessed the server using “dumb terminals” which had no capability\nto save documents. The information stored on the terminal servers\nwere backed up daily, which made it “virtually impossible” for company\ninformation contained in these servers to be destroyed.[note: 580] 393    However,\nthere remained a number of laptops still in circulation. Information\nmight be lost if, instead of working on the file directly on the server\nitself, the file was downloaded to the laptop and worked on locally. Alister\n(the Griffin Group’s chief information officer) accepted that it\nwas a “fairly simple and easy process” to subsequently save that\ndocument to the server at the end of the session, although he emphasised\nthat it was a manual process.[note: 581]Nagender,\nJoanna and Rahul had testified that they had a regular practice\nof saving work documents back onto the Plaintiff’s terminal servers.[note: 582]The\nPlaintiff contended that it was highly unlikely that the three of\nthem had manually uploaded every single work document that they\nworked on back onto the Plaintiff’s server.[note: 583]In\nmy view, the fact that it is a manual process does not necessarily\nmake it “highly unlikely”. 394    While\nthe Plaintiff did point to a number of files which may have contained\ncompany information which was deleted from Joanna’s laptop and accessed\nfrom Rahul’s,[note: 584]it is unclear whether they were\nmerely temporary files that had already been uploaded to the Plaintiff’s\nservers. 395    In\nconclusion, the Plaintiff has not adduced sufficient evidence demonstrating\nthat Nagender and Rahul’s breach of cl 17 caused the Plaintiff any\nloss.",
        "Fiduciary duties and implied\nduty of fidelity": "396    Nagender’s\ndeletion of data from the Plaintiff’s laptop which was assigned\nto him did not, in itself, mean that he was in breach of his fiduciary duties.\nI believe that he undertook the deletion in order to prevent the Plaintiff\nfrom discovering the breaches that I have found him to have committed.\nHowever, there is no indication that he had set out to deliberately\ndestroy the Plaintiff’s documents in the course of deleting files and\ninformation regarding his private activities. I note that the Plaintiff’s documents,\nin the normal course of business, would be duplicated or stored on\nthe Plaintiff’s servers because the laptops were to be used as “dumb terminals”\nby its employees, a fact that Nagender would be aware of. Clearly,\nit is a pointless exercise for Nagender to maliciously destroy the Plaintiff’s\ndocuments on his laptop when it is after all already duplicated\non the Plaintiff’s servers. 397    In\nthe case of Rahul and Joanna, their deletion of the company’s documents\non the laptops assigned to them does not, without more, amount to\na breach of their implied duty of fidelity, having regard to the fact\nthat the laptops were meant to be used as “dumb terminals” and the Plaintiff’s\ndocuments would be stored on the Plaintiff’s servers.",
        "The counterclaim": "",
        "Wrongful dismissal": "398    I\nnow turn to Nagender, Joanna, Rahul, Annie and Adella’s counterclaims\nfor wrongful dismissal. In essence, they claimed that the Plaintiff\nwas in breach by dismissing them with immediate effect and without\nnotice as required by their employment contracts.[note: 585] 399    Clause\n22 of the contracts of employment for Nagender, Annie and Adella\nstated: 22.\nTermination of Services Except in the case of gross misconduct, the parties agree\nthat after confirmation of services, six months’ notice in writing\nshall be given by either the company or yourself as the case may\nbe, when terminating employment… In the case of gross misconduct\nthen the employment may be terminated immediately and without notice\ndepending on the seriousness of the incident. … [T]he Company may at any time during the\nterm of the Agreement without notice terminate the employment of\nthe Employee for malfeasance, breach of any confidentiality or non-compete\nprovisions contained in this Agreement, providing false or misleading\ninformation in entering into this Agreement, for any wilful and\nintentional act having the effect of injuring the reputation, business\nor business relationships of the Company and its affiliates or for\nany failure to perform work responsibilities to the high standard\nof performance required by the Company of its professional staff. … 400    Rahul’s\ncontract is similar except that the notice period is three months,\ninstead of six.[note: 586]The Defendants also pleaded that\nJoanna was entitled to three months’ notice, which appears to be\nbased on the written contract she entered into when she was transferred\nto Griffin Australia.[note: 587]However,\nit was agreed by the parties that her contract of employment with the\nPlaintiff was actually animpliedone.\nNevertheless, the parties do not seem to be in dispute over the\nactual length of her notice period. As neither party submitted on\nthis point, I will say no more about it. 401    The\nquestion is whether any of the breaches of duty by Nagender, Joanna,\nRahul, Annie and Adella were of such gravity that the Plaintiff\nwas warranted in summarily dismissing them. InAldabe\nFermin v Standard Chartered Bank[2010] 3 SLR 722, it\nwas held that: (a)     The\ncommon law rule that an employer can rely on any additional reasons\n(whether known to him or not) which existed at the time of dismissal\nto justify the dismissal applies in Singapore (at [49]). (b)     The\nquestion of whether the employee had acted in a manner sufficient\nto justify the summary dismissal is to be determined objectively\nby the courts (at [57]). (c)     The\nact must be so serious that it strikes at the root of the contract\nof employment, that it destroys the confidence underlying such a\ncontract. The relevancy and effect of any misdeed complained of\nmust be judged by reference to its effect on the employer-employee relationship\n(at [58], citing with approvalCowie Edward\nBruce v Berger International Pte Ltd[1999] 1 SLR(R)\n739). 402    With\nrespect to Joanna, I have not found that she was in breach of any duty\nto the Plaintiff. As for Rahul, Annie and Adella, while they had committed\nbreaches of duty, none of the breaches were so serious as to amount\nto gross misconduct. The four of them were therefore wrongfully dismissed\nby the Plaintiff. 403    As\nfor Nagender, it was an entirely different matter. Taken together, the\nbreaches relating to his failure to disclose his material involvement\nas the moving spirit behind QRS (see [325] above), his unlawful\nuse of Piyush’s services (see [333] above), the payment of his own\nbonuses without authority (see [342] above), and, most seriously,\nhis acts in relation to the acquisition of the Laguna golf membership\n(see [374] above), certainly entitled the Plaintiff to summarily\ndismiss him.",
        "Nagender as “Bad Leaver”": "404    Under\nthe Subscription Agreement, Nagender subscribed, through Signature\nSparks, to 9.1% of the shares in Holdco and £1.6m worth of loan notes\nissued by Bidco. As a member of Holdco, Signature Sparks was bound by\nHoldco’s Articles of Association (“the Articles”). The subscription\nby Signature Sparks of loan notes issued by Bidco was governed by\nan agreement titled “Instrument constituting £26,752,000 Series\n1 Vendor Loan Stock 2016” (“the Loan Note Instrument”).[note: 588] 405    Under\nthe contractual framework described in the preceding paragraph,\nthe value Nagender was entitled to receive for the shares in Holdco\nand the loan note from Bidco was predicated on whether he should be\ncategorised as a “Resigning Leaver”, “Good Leaver” or “Bad Leaver” under\nSchedule 1 of the Articles.[note: 589]The Plaintiff accepted that\nif Nagender was validly dismissed on the grounds of dishonesty,\nhe was a Bad Leaver. If he was wrongfully dismissed, he was a Good\nLeaver. If he was not dishonest but validly dismissed, he was a\nResigning Leaver.[note: 590] 406    A\nBad Leaver was defined as follows:[note: 591] “Leaver” means any person who ceases or\n(as the case may be) will cease (through having given or been given\nnotice) to be a Relevant Executive in circumstances where he does\nnot or (as the case may be) will not continue immediately thereafter\nto be a Relevant Executive in any capacity. “B1 Bad Leaver” means any Leaver who either\nholds B1 Ordinary Shares or is a B Corporate Shareholder Executive\nand the relevant Corporate Shareholder holds B1 Ordinary Shares\nand becomes a Leaver as a result for summary dismissal for acts\nof dishonesty, physical violence or similar. 407    Harsh\nconsequences follow from being classified as a Bad Leaver, as it allows\nHoldco and Bidco to forfeit Nagender’s entitlements for a pittance: (a)     Signature\nSparks would be required to transfer its entire shareholding in\nHoldco at £1 pursuant to art 16.14 of the Articles;[note: 592]and (b)     The\nvalue of the loan note issued by Bidco to Signature Sparks would\nbe reduced to £1 pursuant to cl 3.3 of Schedule 2 of the Loan Note\nInstrument.[note: 593] 408    By\nway of letters dated 30 November 2011, Holdco and Bidco issued notices\nto Nagender to inform him that they had classified him as a Bad Leaver\nand purported to redeem his loan note with Bidco at £1and to require\nthat he transfer to Holdco his shares therein for £1.[note: 594] 409    Having\nalready found that the Plaintiff was entitled to summarily dismiss\nNagender, I am not concerned with whether Nagender was a Good Leaver.\nI only need to consider whether Nagender committed any “acts of dishonesty,\nphysical violence or similar” which would justify the Plaintiff’s characterisation\nof him as a “Bad Leaver”. 410    The\nparties disagreed as to what was meant by “dishonesty” as used in Schedule\n1 of the Articles. The Plaintiff submitted that dishonesty should\nbe interpreted according to its plain and ordinary meaning as stated\nin the Oxford Online English Dictionaries,ie,\n“deceitfulness shown in someone’s character or behaviour”.[note: 595]It\nfurther argued that even if the term “dishonesty” was to be construed\nto refer to the legal doctrine of dishonesty, the evidence of Nagender’s\ndishonesty was so overwhelming that it meets the requisite standard\nunder the law, which the Defendants submitted required more evidence\nthan in an ordinary civil case. The Plaintiff referred to the cases\nofCavenagh Investment Pte Ltd v Kaushik Rajiv[2013] 2 SLR 543\n(“Cavenagh Investment”) (at [70]\nand [71]) andGeorge Raymond Zage III and another\nv Ho Chi Kwong and another[2010] 2 SLR 589 (“George Raymond Zage III”) for the proposition\nthat the test for dishonesty is an objective one, and that the court\nlooks at whether a defendant acted in a commercially unacceptable\nway, and such behaviour is made out if he fails to query the irregular\nshortcomings of the transaction that ordinary honest people would\nso query.[note: 596] 411    The\nDefendants, in response, argued thatCavenagh\nInvestmentandGeorge Raymond Zage\nIIIwere cases that related to the requirement of dishonesty\nin relation to a change of position defence and the issue of dishonest\nassistance respectively, and that the principles of dishonesty in restitutionary\nand equitable trusts claims are not of general application.[note: 597]Rather,\nit argued that dishonesty in the present circumstances required advertent\nconduct, and conscious impropriety. 412    Ultimately,\nthis is really a matter of interpretation of the Articles. It seems\nto me that importing doctrines from other areas of law is not entirely helpful,\nand only serves to muddy the analysis. In my view, dishonesty should\nbe given its plain and ordinary meaning. Of course, it must be such\na level of dishonesty that would entitle the Plaintiff to summarily\ndismiss Nagender. 413    In\na sense, the argument over the meaning of dishonesty was academic\nsince Nagender’s actions relating to the acquisition of the golf membership\nin Laguna were dishonestby any standard.\nHe had not only procured the Plaintiff to issue cheques totalling\n$75,000 to subsidise Signature Sparks’s acquisition of the Laguna\ncorporate golf membership, he also tried to make money out of the\nPlaintiff of which he was a fiduciary and also made use of its employees\nto cover his tracks. 414    For\ncompleteness, I will also deal briefly with the Defendants’ allegation\nthat Holdco and Bidco’s decision to classify Nagender as a Bad Leaver\nwas made in bad faith, and that Holdco’s board of directors had launched\na campaign to marginalise Nagender from end-2010.[note: 598] 415    Nagender\nrelied heavily on an email sent by Porter to George and Khuman on\n19 May 2011[note: 599]to establish his allegation\nof bad faith. The attachment was three pages long. In the section\ntitled “The Way Forward in Our Talks with Nagender”, Porter used\nthe words “good leaver” and “bad leaver” several times. For example: It is likely he will want to avoid being\na bad leaver – though he may not and we will have to be ready for\nthis. With his immediate departure we should\nstill seek to get him to agree to restrictions. I would suggest\nwhen he leaves he would be treated as a bad leaver but if he fulfils\nconditions such as not poaching customers; staff and not competing\nfor (say) 2 years – we would agree to treat him as a good leaver at\nthe end of that time and compensate him accordingly. 416    While\nthis email was written in May 2011, I am not persuaded that it indicated\nthat Holdco and Bidco had the intention of labelling Nagender as a\nBad Leaver, come what may. Moreover, it can be seen from the transcripts of\na telephone conversation on 4 July 2011 between George and Khuman that\nthey were still talking about re-engaging Nagender,[note: 600]a\nfact which Nagender accepted in cross-examination.[note: 601]Finally, evenifthe Plaintiff had been acting against\nNagender in bad faith, it did not mean Nagender could act in a dishonest\nway against the Plaintiff. 417    Accordingly,\nthe Plaintiff is entitled to label Nagender as a Bad Leaver.",
        "Annex 1": "Details of the New Entities\n(and Q4T Australia) at incorporation: New\nEntitiesIncorporation dateShareholding\nat incorporationDirectors\nat incorporationQuest Horizon21 Feb 2011Joanna (10%)Annie (10%)Adella (35%)Madhu (45%)AnnieAdellaNiado27 Apr 2011Quest Horizon (45%)Sandeep (10%)Cornel (45%)AnnieCornelSandeepBHEA Tech27 Apr 2011Annie (100%)AnnieAdellaQ4T Australia31 May 2011Apoorva (100%)ApoorvaQ4T Singapore23 June 2011Rahul (50%)Ajay (50%)RahulAjayQRS3 Aug 2011Kavita (100%)KavitaLeny",
        "Annex 2": "Timeline of key undisputed\nevents: DateEvent23 Sep 2010Nagender sends email saying\nit is timely to “move on”6 – 8 Oct 2010George and Nagender meet\nin Mumbai, India26 Nov 2010Nagender writes email offering\nto resign. George replies asking him to “please rest this”.12 Jan 2011Shareholders’ meeting in\nAthens, Greece2 Feb 2011Leny resigns from the Plaintiff21 Feb 2011Quest Horizon is incorporated1 Mar 2011Prasad resigns from the\nPlaintiff25 Mar 2011Option to Purchase for Ocean\nPark property is executed28 Mar 2011George writes email saying\nNagender is not ready to be Global CEO27 Apr 2011BHEA Tech and Niado are\nincorporatedMay 2011Porter, Khuman and Nagender\nhave conversation where Nagender is told that a search was beginning immediately\nfor an externally sourced Global CEO31 May 2011Q4T Australia is incorporated31 May 2011Tenancy agreements for Changi\nOffices signed1 June 2011Plaintiff enters into tenancy\nagreement for Frankel Place17 June 2011Signature Sparks purchases\nLaguna golf membership20 June 2011Nagender resigns from the\nboard of Griffin India21 June 2011Nagender resigns from the\nGlobal Board23 June 2011Q4T Singapore is incorporated30 June 2011Leny exits the Plaintiff\nafter serving her notice21 July 2011Nagender, Joanna and Prasad\ngo to Cebu, Philippines22 July 2011Marcus calls Nagender to\ninform him about the possible appointment of Simon Morse as the\nnew Group executive chairman3 Aug 2011QRS is incorporated16 Aug 2011Nagender resigns as managing\ndirector of the Plaintiff31 Aug 2011Prasad exits the Plaintiff\nand returns to India after serving his notice5 Sep 2011Bonus is paid to Nagender12 Sep 2011Annie resigns from the Plaintiff19 Sep 2011Nagender resigns from the\nPlaintiff’s board of directors21 Sep 2011Joanna resigns from the\nPlaintiff22 Sep 2011Rahul resigns from the Plaintiff28 Sep 2011Adella resigns from BHEA\nTech6 Oct 2011Rahul, Annie and Adella\nare summarily dismissed21 Nov 2011Nagender and Joanna are summarily dismissed.",
        "Annex 3": "[note: 1]Statement of Claim (Amendment\nNo 4) (“SOC”), para 3; Defence and Counterclaim (Amendment No 4)\n(“Defence”), para 4. [note: 2]Plaintiff’s Executive\nSummary of Submissions dated 21 March 2014 (“PES”), para 3. [note: 3]PES,\npara 3. [note: 4]PCS, para 5. [note: 5]PES,\npara 7. [note: 6]PES, para 8. [note: 7]Defendants’\nReply Submissions (“DRS”), para 9. [note: 8]DRS, para 14(e). [note: 9]PCS, para 11. [note: 10]SOC, para 6(a). [note: 11]SOC,\npara 6(a); Defence, para 7(a). [note: 12]Joanna’s AEIC, para\n93. [note: 13]SOC, para 6(b); Defence,\npara 7(b) [note: 14]SOC, para 6(c); Defence,\npara 7(c). [note: 15]SOC,\npara 6(d); Defence, para 7(d). [note: 16]SOC,\npara 6(e); Defence, para 7(e). [note: 17]SOC,\npara 6(f); Defence, para 7(f). [note: 18]Prasad’s\nAEIC, para 85. [note: 19]SOC, para 6(g); Defence,\npara 7(g). [note: 20]Prasad’s AEIC, para\n4. [note: 21]Marcus’s AEIC, paras\n2–3. [note: 22]SOC, para 7. [note: 23]PRS,\npara 16; SOC, para 17; Defence, para 18. [note: 24]SOC, paras 10–11. [note: 25]SOC,\npara 9 [note: 26]SOC, para 8 [note: 27]DCS,\nparas 132–133. [note: 28]DCS,\nparas 134–135. [note: 29]DRS,\npara 209. [note: 30]PRS, para 8. [note: 31]PRS,\npara 12. [note: 32]PRS,\nparas 13–14. [note: 33]Seeeg1AB,\np 34. [note: 34]DCS, para 143. [note: 35]PCS,\npara 172. [note: 36]PRS,\npara 21. [note: 37]DCS, paras 146–147. [note: 38]PCS, para 173. [note: 39]DCS,\npara 149. [note: 40]DCS, paras 151–153. [note: 41]NE,\n20 Jan 2014, p 61, lines 7–8. [note: 42]1AB,\np 61. [note: 43]Prasad’s AEIC, para\n20. [note: 44]SOC, para 30. [note: 45]DRS, paras 241–242. [note: 46]SOC,\npara 19. [note: 47]Defence,\npara 20. [note: 48]DCS, paras 154–155. [note: 49]PRS, para 26. [note: 50]PCS,\npara 160. [note: 51]George’s AEIC, para\n20. [note: 52]Nagender’s AEIC, paras\n86 – 88; George’s AEIC, para 18. [note: 53]Nagender’s AEIC, paras\n91 – 92. [note: 54]George’s AEIC, para\n24. [note: 55]Nagender’s\nAEIC, para 99; NE, 6 November 2013, pp 12, lines 2 – 6. [note: 56]Defence, para 95; Reply\nand Defence to Counterclaim (“Reply”), para 15. [note: 57]Nagender’s\nAEIC, para 90. [note: 58]PRS,\nparas 433 – 435. [note: 59]George’s\nAEIC, para 33; see also DCS, para 527. [note: 60]George’s AEIC, para\n44; see also 2AB, p 771. [note: 61]Nagender’s\nAEIC, para 114; 1AB, p 424. [note: 62]George’s\nAEIC, para 46. [note: 63]George’s AEIC, para\n47. [note: 64]George’s AEIC, para\n48. [note: 65]Nagender’s\nAEIC, para 126; see PBD, p 566. [note: 66]PBD, p 567. [note: 67]Nagender’s\nAEIC, para 127; see also 1SAB, p 58. [note: 68]2AB, p 825. [note: 69]NE,\n14 Nov 2013, p 30 line 6 to p 31 line 1; Nagender’s AEIC, para 126. [note: 70]DRS,\nparas 161 – 163. [note: 71]2AB, p 827. [note: 72]George’s AEIC, para\n57. [note: 73]Nagender’s AEIC, para\n129. [note: 74]8AB,\np 4432. [note: 75]NE, 5 Nov 2013, p 110,\nlines 10–17. [note: 76]PCS,\npara 130. [note: 77]8AB, p 4465. [note: 78]Nagender’s\nAEIC, para 130; NE, 14 Nov 2013, p 52 lines 15–17. [note: 79]NE, 14 Nov 2013, p\n56 line 22 to p 57 line 4. [note: 80]NE,\n14 Nov 2013, p 65 line 25 to p 66 line 17. [note: 81]1SAB, p 59. [note: 82]1SAB,\np 60. [note: 83]NE,\n14 Nov 2013, p 58, lines 11–13. [note: 84]8AB, p 4470. [note: 85]Nagender’s\nAEIC, para 136. [note: 86]2AB, p 860. [note: 87]2AB,\np 859. [note: 88]2AB,\np 859. [note: 89]2AB,\np 868. [note: 90]8AB,\np 4471. [note: 91]DRS, para 179. [note: 92]George’s AEIC, para\n62. [note: 93]NE, 5 Nov 2013, p 120,\nlines 5–9. [note: 94]PCS,\npara 140. [note: 95]PCS,\npara 142. [note: 96]Nagender’s\nAEIC, para 141. [note: 97]DRS,\npara 185. [note: 98]2AB,\np 880. [note: 99]PCS, para 146. [note: 100]PCS,\npara 148. [note: 101]DRS, para 188. [note: 102]2AB, p 897. [note: 103]NE, 14 Nov 2013, p\n95, lines 2–24. [note: 104]NE, 14 Nov 2013, p\n96 line 8 to p 97 line 14; see 8AB, p 4480. [note: 105]2AB, p 944. [note: 106]2AB, p 956; 2AB, p\n955. [note: 107]2AB, p 928. [note: 108]NE,\n21 Nov 2013, p 18 line 25 to p 21 line 3; p 22 lines 1–16; see also\nNagender’s AEIC, paras 185–186. [note: 109]Morse’s\nAEIC, paras 40 – 41. [note: 110]Nagender’s\nAEIC, para 266. [note: 111]2AB, p 967–968. [note: 112]2AB,\np 1035. [note: 113]PCS, para 113. [note: 114]DRS,\npara 195. [note: 115]DRS,\npara 196. [note: 116]Adella’s AEIC, para\n58. [note: 117]NE, 29 Nov 2013, p\n172, lines 18–23. [note: 118]Leny’s AEIC, para\n83. [note: 119]Adella’s\nAEIC, para 59. [note: 120]Adella’s\nAEIC, para 60; Annie’s AEIC, para 43; Joanna AEIC, para 71. [note: 121]DCS,\npara 64. [note: 122]6AB, p 3336 [note: 123]6AB, p 3336. [note: 124]NE,\n19 Nov 2013, p 11, lines 12–22. [note: 125]NE, 29 Nov 2013, p\n178, lines 8 – 25. [note: 126]NE,\n28 Nov 2013, p 179, lines 6 – 21. [note: 127]NE,\n29 Nov 2013, p 183, lines 4–24. [note: 128]Prasad’s AEIC, paras\n92 and 94. [note: 129]Joanna’s AEIC, para\n73. [note: 130]Nagender’s\nAEIC, para 248. [note: 131]2AB, p 1095. [note: 132]Cornel’s AEIC, para\n13; see also NE, 27 Jan 2014, p 135 lines 6–17; p 136 lines 12–14. [note: 133]NE, 27 January 2014,\np 140, lines 10–21. [note: 134]Cornel’s\nAEIC, para 10–11; PCS, para 569. [note: 135]NE,\n27 January 2014, p 135 line 6 to p 136 line 14. [note: 136]Cornel’s\nAEIC, para 13. [note: 137]NE, 27 Jan 2014, p\n139 line 22 to p 140 line 11. [note: 138]NE,\n27 Jan 2014, p 142 line 6 to p 145 line 20. [note: 139]Cornel’s\nAEIC, para 11. [note: 140]NE, 27 Jan 2014, p\n160 line 9 to p 161 line 8. [note: 141]NE,\n27 Jan 2014, p 154, lines 5 – 9. [note: 142]NE,\n20 Jan 2014, p 79, lines 4 – 6. [note: 143]Annie’s\nAEIC, para 53. [note: 144]NE, 27 Jan 2014, p\n184 lines 7 – 25. [note: 145]NE,\n20 Jan 2014, p 76 lines 9 – 11; see also 5AB p2554. [note: 146]9AB, pp 4529 – 4530. [note: 147]NE,\n27 Jan 2014, p 171, lines 14–17. [note: 148]Joanna’s\nAEIC, para 82. [note: 149]5AB,\np 2560; see also 5AB, p 3061. [note: 150]5AB,\np 2784. [note: 151]5AB,\np 2704. [note: 152]4AB,\np 2352. [note: 153]5 AB, p 2832. [note: 154]NE,\n29 Nov 2013, pp 213 – 215. [note: 155]Leny’s AEIC, para\n87. [note: 156]Leny’s\nAEIC, para 88. [note: 157]Nagender’s\nAEIC, para 252 [note: 158]NE, 29 Nov 2013 p\n214 lines 19 to 21; see also 6AB, p 3373. [note: 159]PCS, para 342. [note: 160]PCS,\npara 344–345. [note: 161]NE, 21 Nov 2013, p\n86, line 9. [note: 162]NE, 26 Nov 2013, p\n113, line 14. [note: 163]PCS, paras 353 – 355. [note: 164]NE,\n27 Jan 2014, pp 156 – 157. [note: 165]PCS, para 565(d). [note: 166]NE, 27 Jan 2014, p\n162 line 21 to p 163 line 23. [note: 167]PCS, paras 358–367. [note: 168]PCS,\nparas 377 – 381. [note: 169]5AB,\npp 2831 – 2845. [note: 170]DB,\npp 197 – 206. [note: 171]DCS, para 190. [note: 172]DRS, paras 298 – 300. [note: 173]NE, 27 Jan 2014, p\n162 line 21 to p 163 line 19. [note: 174]NE, 27 Jan 2014, p\n229, lines 2 – 4. [note: 175]NE, 27 Jan 2014, p\n213 lines 5 – 21. [note: 176]PCS,\npara 565(g). [note: 177]PCS,\npara 384 [note: 178]PCS,\nparas 422 – 423. [note: 179]PCS,\npara 388. [note: 180]DRS, para 51. [note: 181]DRS,\npara 302. [note: 182]PCS,\npara 393. [note: 183]PCS,\nparas 408 – 409. [note: 184]Andy’s AEIC, paras\n3 – 5. [note: 185]6AB,\np 3355. [note: 186]NE, 14 Nov 2013, p\n17, lines 6 – 13. [note: 187]NE, 14 Nov 2013, p\n16, lines 17 – 23. [note: 188]6AB, p 3357. [note: 189]DRS,\nparas 321 – 322. [note: 190]Andy’s\nAEIC, para 11. [note: 191]6AB,\np 3356. [note: 192]NE,\n14 Nov 2013, p 20, lines 6 – 24. [note: 193]NE, 14 Nov 2013, p\n9 line 5 to p 13 line 14. [note: 194]NE, 14 Nov 2013, p\n20 line 25 to p 22 line 11. [note: 195]NE, 27 Jan 2014, p\n211, lines 2 – 5. [note: 196]NE, 27 Nov 2013, p\n120, lines 11 – 19. [note: 197]Nagender’s\nAEIC, para 256. [note: 198]DCS,\nparas 221 and 228. [note: 199]Indraneel’s AEIC,\nparas 40 – 41. [note: 200]Alister’s\nAEIC, para 40. [note: 201]DCS, para 226; PCS,\npara 641. [note: 202]Indraneel’s\nAEIC, para 24. [note: 203]DCS, para 405. [note: 204]NE, 19 Nov 2013, lines\n10 – 13. [note: 205]Nagender’ AEIC, para\n171. [note: 206]Indraneel’s AEIC,\nat para 42; Nagender’s AEIC, para 175. [note: 207]Indraneel’s\nAEIC, para 42. [note: 208]Nagender’s\nAEIC, paras 170 and 171. [note: 209]Prasad’s AEIC, para\n107. [note: 210]Indraneel’s AEIC,\nparas 45 – 46. [note: 211]Prasad’s\nAEIC, para 107; 9AB, pp 4519 – 4521. [note: 212]Indraneel’s AEIC,\npara 44. [note: 213]Indraneel’s\nAEIC, paras 42 and 52. [note: 214]Indraneel’s AEIC,\npara 52. [note: 215]4AB 1869 – 1870. [note: 216]NE, 27 Nov 2013, p\n95, lines 16 – 25. [note: 217]Joanna’s\nAEIC, para 83. [note: 218]Indraneel’s AEIC,\npara 54. [note: 219]4AB, p 1923. [note: 220]Annie’s\nAEIC, para 61; Indraneel’s AEIC, para 47. [note: 221]Adella’s AEIC, para\n109. [note: 222]Annie’s\nAEIC, para 65. [note: 223]Indraneel’s AEIC,\npara 57. [note: 224]NE, 27 Nov 2013, p\n46 line 24 to p 47 line 5. [note: 225]NE,\n27 Nov 2013, p 51 line 13 to p 52 line 4. [note: 226]PCS, para 655. [note: 227]PCS, para 656 – 658. [note: 228]PCS, para 659; see\nalso PRS, para 181. [note: 229]PCS,\npara 660. [note: 230]PCS,\npara 661. [note: 231]PCS,\npara 664. [note: 232]DRS, para 460. [note: 233]NE,\n27 Nov 2013, p 62, lines 1 – 16. [note: 234]4AB,\np 1900. [note: 235]PRS, para 181(i);\n4AB, pp 2054, 2056, 2058. [note: 236]Indraneel’s\nAEIC, para 39; see also SAB, p 1044. [note: 237]NE, p 20 Nov 2013,\np 174 line 3 to p 175 line 24; see also NE, 19 Nov 2013, p 87, lines\n6 – 11. [note: 238]NE, 13 Nov 2013, p\n41. [note: 239]NE, 13 Nov 2013, p\n42 line 23 to p 43 line 3. [note: 240]NE,\n13 Nov 2013, p 46 lines 21 – 24. [note: 241]Rahul’s AEIC, para\n45. [note: 242]Rahul’s AEIC, para\n46. [note: 243]Rahul’s\nAEIC, paras 22–28. [note: 244]Ajay’s AEIC, paras\n9 and 17. [note: 245]Rahul’s AEIC, para\n48; Ajay’s AEIC para 18. [note: 246]Rahul’s AEIC, paras\n49 and 50. [note: 247]NE, 28 Nov 2013, p\n98, lines 14–22. [note: 248]NE, 28 Nov 2013, p\n192 line 10 to p 193 line 11. [note: 249]Ajay’s AEIC, paras\n17 – 18. [note: 250]NE, 27 Jan 2014, p\n30 line 15 to p 33 line 22. [note: 251]5AB,\np 2394. [note: 252]Prasad’s\nAEIC, para 123. [note: 253]DCS,\npara 215. [note: 254]Ajay’s\nSupplemental AEIC, para 7. [note: 255]Ajay’s\nSupplemental AEIC, para 7. [note: 256]Ajay’s\nSupplemental AEIC, paras 8 – 9. [note: 257]Rahul’s Supplemental\nAEIC, para 13. [note: 258]PBD,\npp 581 – 582. [note: 259]5AB,\np 2524. [note: 260]Prasad’s AEIC, para\n122. [note: 261]5AB,\npp 2534–2535. [note: 262]Prasad’s AEIC, para\n125. [note: 263]Adella’s\nAEIC, para 96. [note: 264]Adella’s\nAEIC, para 97. [note: 265]Nagender’s\nAEIC, para 257. [note: 266]Nagender’s AEIC, para\n258. [note: 267]NE,\n28 Nov 2013, p 104, lines 2 – 14. [note: 268]4AB,\np 1882. [note: 269]NE, 28 Nov 2013, p\n107 line 19 to p 108 line 12. [note: 270]PBD,\np 581. [note: 271]PCS,\npara 588. [note: 272]PCS,\npara 589. [note: 273]PCS, paras 590 – 604. [note: 274]PCS, paras 605 – 607. [note: 275]PCS,\npara 614. [note: 276]Rahul’s\nAEIC, para 75. [note: 277]PCS, para 621. [note: 278]PCS,\npara 626. [note: 279]PCS,\npara 635. [note: 280]PCS,\nparas 637 – 638. [note: 281]PCS,\npara 595. [note: 282]NE, 27 Jan 2014, p\n35, lines 6 – 18; also p 72 line 25 to p 73 line 3. [note: 283]NE,\n28 Jan 2014, p 81, lines 11 – 16. [note: 284]NE, 27 Jan 2014, p\n22 lines 8 – 15. [note: 285]NE, 27 Jan 2014, p\n28 line 4 to p 29 line 5. [note: 286]PCS,\npara 602; see also NE, 27 Jan 2014, p 72 line 1 to p 73 line 3. [note: 287]PCS, paras 611 – 615. [note: 288]See e.g. NE, 29 Nov\n2013, p 64 line 21 to p 65 line 8. [note: 289]Rahul’s AEIC, para\n75. [note: 290]PRS, para 49. [note: 291]DRS,\nparas 444 – 445. [note: 292]DCS, para 193; see\nalso 5AB, p 2831. [note: 293]DCS, para 196. [note: 294]Leny’s\nAEIC, paras 111 – 112. [note: 295]Nagender’s AEIC, paras\n229 – 230. [note: 296]Nagender’s\nAEIC, para 231. [note: 297]Piyush’s\nAEIC, para 5. [note: 298]Nagender’s AEIC, para\n232. [note: 299]NE,\n21 Nov 2013, p 140, lines 3 – 12. [note: 300]NE, 21 Nov 2013, p\n138 lines 9 to p 139 line 16. [note: 301]8AB, p 4205. [note: 302]Nagender’s AEIC, paras\n233 – 234. [note: 303]DCS, para 323. [note: 304]6AB\n3076. [note: 305]Nagender’s\nAEIC, para 237 – 239. [note: 306]Nagender’s\nAEIC, para 240; Joanna’s AEIC, para 110. [note: 307]6AB,\np 3326 – 3327. [note: 308]6AB,\npp 3185 to 3192 and pp 3206 to 3209. [note: 309]3AB, pp 1493 – 1494. [note: 310]3AP,\npp 1489 – 1491. [note: 311]3AB, p 1540 – 1544. [note: 312]DCS, para 359(c);\nPCS, para 503; NE, p 185 line 5 to p 186 line 6. [note: 313]NE, 20 Nov 2013, p\n76 line 19 to p 77 line 25. [note: 314]DCS, para 359. [note: 315]DCS,\npara 316(c). [note: 316]6AB, pp 3230 – 3236;\np 3237. [note: 317]NE,\n26 Nov 2013, p 168 line 19 to p 170 line 16. [note: 318]6AB, pp 3230 and 3237. [note: 319]6AB,\npp 3245 – 3247. [note: 320]NE,\n26 Nov 2013, p 159 lines 10 to p 160 line 8. [note: 321]6AB, pp 3248 – 3256. [note: 322]6AB,\npp 3258 – 3267. [note: 323]6AB 3268 – 3278. [note: 324]DCS,\npara 248. [note: 325]Leny’s\nAEIC, para 118. [note: 326]NE, 21 Nov 2013, p\n63, lines 11 – 19. [note: 327]NE,\n21 Nov 2013, p 66 line 14 to p 67 line 9. [note: 328]NE, 21 Nov 2013, p\n68 line 10 to p 69 line 20. [note: 329]PCS, para 456. [note: 330]PCS,\nparas 458 – 468. [note: 331]PCS,\nparas 470 – 483. [note: 332]PCS, para 484. [note: 333]PCS, para 486. [note: 334]DRS,\npara 355. [note: 335]DRS,\nparas 357 – 360. [note: 336]DRS, para 363. [note: 337]DRS,\npara 365. [note: 338]DRS, para 361. [note: 339]Nagender’s AEIC, para\n244. [note: 340]For\nexample, NE, 20 Nov 2013, p 18 lines 5 – 20; p 20 lines 15 – 22; [note: 341]NE, 20 Nov 2013, p\n22 – 25. [note: 342]NE, 20 Nov 2013, p\n24, lines 4 – 14. [note: 343]PCS,\npara 516. [note: 344]PCS,\nparas 517 – 519. [note: 345]PCS,\npara 524; 6AB, p 3076. [note: 346]PCS,\npara 525. [note: 347]PCS,\nparas 527 – 531, 533 and 536. [note: 348]PCS,\npara 486. [note: 349]PCS, para 537. [note: 350]PCS,\npara 541. [note: 351]Nagender’s AEIC, para\n256. [note: 352]PCS,\nparas 543 – 546. [note: 353]PCS, paras 517 – 519. [note: 354]6AB,\npp 3232 – 3233. [note: 355]NE,\n20 Nov 2013, p 38 line 14 to p 40 line 12. [note: 356]PCS, para 546. [note: 357]NE, 26 Nov 2013, p\n169, lines 8 – 11. [note: 358]SOC, para 78. [note: 359]Leny’s AEIC, para\n69. [note: 360]Leny’s\nAEIC, para 67–68. [note: 361]NE,\n26 Nov 2013, p 107 line 22 to p 108 line 2. [note: 362]Leny’s\nAEIC, para 5. [note: 363]3AB,\np 1129. [note: 364]Leny’s\nAEIC, para 69. [note: 365]3AB, p 1147. [note: 366]NE, 26 Nov 2013, p\n102, lines 1–23. [note: 367]George’s AEIC, para\n101. [note: 368]NE, 26 Nov 2013, p\n104 line 14 to p 106 line 5. [note: 369]NE,\n26 Nov 2013, p 132 line 19 to p 136 line 3. [note: 370]PRS, paras 146–147. [note: 371]SOC, para 52. [note: 372]Prasad’s AEIC, para\n85. [note: 373]Prasad’s\nAEIC, para 71. [note: 374]NE,\n13 Nov 2013, p 82 lines 2–19. [note: 375]Adella’s AEIC, para\n48; see also NE, 5 Nov 2013, p 146, lines 2–19; p 149, lines 10–15. [note: 376]Adella’s AEIC, para\n102. [note: 377]1SAB,\npp 171–172. [note: 378]3AB,\np 1169. [note: 379]Annie’s\nAEIC, paras 83–84. [note: 380]Joanna’s\nAEIC, para 150. [note: 381]NE, 21 Nov 2013, p\n186, lines 9–17. [note: 382]DCS\npara 440(a)–(d). [note: 383]NE,\n26 Nov 2013, p 35, lines 1–24. [note: 384]PCS, para 732, [note: 385]DRS, para 475. [note: 386]NE, 26 Nov 2013, p\n35, lines 3–9. [note: 387]PCS, paras 733–736. [note: 388]Rahul’s AEIC, para\n66. [note: 389]Rahul’s AEIC, para\n64. [note: 390]NE, 29 Nov 2013, p\n8 lines 1 – 11. [note: 391]Rahul’s\nAEIC, para 67. [note: 392]PCS, para 749. [note: 393]PCS,\npara 750. [note: 394]Ali’s\nAEIC, para 50. [note: 395]Piyush’s\nAEIC, paras 22–24. [note: 396]Nagender’s Supplemental\nAEIC, paras 21–26. [note: 397]DRS, paras 57(d),\n602 and 603. [note: 398]DCS,\npara 355(a); DRS, para 604. [note: 399]DRS,\npara 486. [note: 400]CB, pp 421 – 503. [note: 401]PCS, para 696. [note: 402]PCS,\npara 695. [note: 403]PSB,\np 228 – 229. [note: 404]NE,\n27 Jan 2014, p 9 line 2 to p 10 line 6. [note: 405]NE,\n27 Jan 2014, p 11 line 17 to p 12 line 9. [note: 406]NE,\n27 Jan 2014, p 16 lines 2 – 13. [note: 407]NE,\n27 Jan 2014, p 14 line 14 to p 15 line 7. [note: 408]Sandeep’s\nAEIC, para 20. [note: 409]PCS,\nparas 698 – 699. [note: 410]DRS,\npara 510. [note: 411]Exhibit P7 – see CB,\np 515. [note: 412]Exhibit\nP8 – see CB, p 518. [note: 413]PCS, paras 712 – 713. [note: 414]DRS\nparas 407 and 516. [note: 415]DRS\nAnnexes, Annex B. [note: 416]3AB,\np 1214. [note: 417]NE, 29 Nov 2013, p\n223 lines 5 – 15. [note: 418]3AB,\np 1215. [note: 419]NE,\n29 Nov 2013, p 225 line 9 to p 226 line 3. [note: 420]PCS,\npara 703. [note: 421]3AB,\np 1266. [note: 422]NE, 29 Nov 2013, p\n229 line 2 to p 230 line 7. [note: 423]3AB, p 1219. [note: 424]NE,\n29 Nov 2013, p 234 lines 10 – 24. [note: 425]3AB, p 1293. [note: 426]NE,\n29 Nov 2013, p 242, lines 1 – 22. [note: 427]PCS,\npara 710. [note: 428]DRS,\npara 266. [note: 429]NE,\n29 Nov 2013, p 242 line 23 to p 243 line 7. [note: 430]NE, 29 Nov 2013, p\n243 line 8 to p 246 line 10. [note: 431]Adella’s AEIC, para\n68(a). [note: 432]DRS,\npara 512. [note: 433]PCS, para 20. [note: 434]PCS, para 23. [note: 435]PCS,\npara 25. [note: 436]PCS,\npara 27. [note: 437]PCS, para 27(c). [note: 438]DCS,\npara 410. [note: 439]Nagender’s\nAEIC, para 303; Joanna’s AEIC, para 155; Rahul’s AEIC, para 91. [note: 440]Nagender’s\nAEIC, para 303. [note: 441]Rahul’s AEIC, paras\n91–93. [note: 442]NE,\n28 Nov 2011 p 176 line 16 to p 178 line 21; 7AB, pp 4144H to 4144J. [note: 443]PCS, para 68. [note: 444]Plaintiff’s\nBundle of Documents (“PBD”), p 483. [note: 445]PCS,\npara 69. [note: 446]PCS, para 91. [note: 447]PCS, para 97. [note: 448]DRS,\npara 136. [note: 449]PCS, para 160. [note: 450]DRS, paras 42 – 47. [note: 451]PCS,\npara 98. [note: 452]PCS, para 103. [note: 453]PCS, para 1092. [note: 454]See PRS, para 52;\nPCS, paras 1092 – 1103. [note: 455]PRS, para 53. [note: 456]PCS,\nparas 12 – 14. [note: 457]NE, 8 Nov 2013, p\n38, lines 13 – 16. [note: 458]PRS, para 97. [note: 459]PRS, paras 101 – 102. [note: 460]PRS, paras 106 – 108. [note: 461]PRS,\npara 110. [note: 462]6AB, pp 3232 – 3233. [note: 463]NE,\n21 Nov 2013, p 71, lines 13 – 15. [note: 464]NE, 20 Nov 2013, p\n164 line 8 to p 165 line 20; NE, 26 Nov 2013, p 220 line 23 to p\n221 line 16. [note: 465]DRS,\npara 374. [note: 466]NE, 20 Nov 2013, p\n169 lines 12 – 20. [note: 467]NE, 20 Nov 2013, p\n164 line 8 to p 165 line 20. [note: 468]PCS,\npara 329. [note: 469]DCS, paras 378 – 391. [note: 470]PCS,\nparas 766 – 767. [note: 471]PRS, paras 235 – 237. [note: 472]NE, 13 Nov 2013, p\n10 line 5 to p 11 line 8. [note: 473]1AB, p 292. [note: 474]PCS,\npara 552. [note: 475]PCS,\nparas 559 – 560. [note: 476]Exhibit D5; CB 302\n– 311. [note: 477]NE, 28 Nov 2013, p\n147. [note: 478]DCS, para 330. [note: 479]NE, 20 Nov 2013, p\n99 lines 10 – 22. [note: 480]PCS, paras 552 – 558. [note: 481]NE,\n28 Nov 2013, p 153, lines 15 – 23. [note: 482]PRS,\npara 159. [note: 483]NE,\n26 Nov 2013, p 53, lines 7 – 13. [note: 484]NE,\n26 Nov 2013, p 51 line 4 to p 52 line 18. [note: 485]NE, 26 Nov 2013, p\n50 line 14 to p 51 line 3. [note: 486]6AB,\np 3076. [note: 487]NE,\n28 Nov 2013, p 150, lines 2 – 10. [note: 488]NE,\n28 Nov 2013, p 155 line 20 to p 157 line 13. [note: 489]NE,\n27 Nov 2013, p 250 line 15 to p 253 line 5. [note: 490]See PCS, paras 669\n– 675; see also SOC pp 63 – 68. [note: 491]PCS, para 670. [note: 492]NE\n19 Nov 2013, p 32, lines 3 – 22. [note: 493]3 AB, p 1330; NE,\n19 Nov 2013, p 59 line 20 to p 60 line 5. [note: 494]Indraneel’s\nAEIC, para 14. [note: 495]SOC,\npara 66. [note: 496]SOC, para 67. [note: 497]SOC, para 69. [note: 498]SOC, para 70. [note: 499]DCS, para 367. [note: 500]DCS,\npara 363 – 364. [note: 501]See for example 6AB\n3183. [note: 502]See for example 6AB\n3071. [note: 503]NE,\n20 Nov 2013, pp 71 – 72. [note: 504]DCS,\npara 368. [note: 505]NE,\n13 Nov 2013, p 63 line 3 to p 64 line 15. [note: 506]Nagender’s AEIC, para\n231. [note: 507]NE,\n13 Nov 2013, p 11. [note: 508]PCS,\nparas 766 – 767. [note: 509]Nagender’s AEIC, para\n73. [note: 510]PCS, para 758. [note: 511]PCS, para 774. [note: 512]PCS,\npara 775. [note: 513]PCS,\npara 785; DCS, para 452. [note: 514]PCS,\nparas 786 – 787. [note: 515]DCS, para 454. [note: 516]George’s\nAEIC, paras 72; Marcus’s AEIC, para 12. [note: 517]NE,\n5 Nov 2013, p 105 line 17 to p 106 line 16. [note: 518]George’s\nAEIC, para 74. [note: 519]Marcus’s\nAEIC, para 13. [note: 520]George’s AEIC, para\n73; NE, 5 Nov 2013, p 97 line 16 to p 99 line 5. [note: 521]NE, 5 Nov 2013, p\n105 line 17 to p 106 line 16. [note: 522]NE,\n20 Nov 2013, p 135, line 6. [note: 523]NE, 20 Nov 2013, p\n130, lines 6 – 20. [note: 524]NE,\n5 Nov 2013, p 108 line 6 – 23. [note: 525]NE,\n5 Nov 2013, p 97 line 16 to p 99 line 5. [note: 526]NE,\n5 Nov 2013, p 100 line 15 to p 101 line 19. [note: 527]SOC, paras 82 – 84. [note: 528]3AB, pp 1397 and 1404;\nPCS, para 821. [note: 529]NE, 19 Nov 2013, p\n94, lines 15 – 18. [note: 530]Nagender’s AEIC, para\n162. [note: 531]Linda’s AEIC, paras\n8 – 10; PCS, paras 830 – 832. [note: 532]PCS, paras 833 – 835. [note: 533]PCS,\nparas 844 – 845. [note: 534]SOC, paras 83 and\n84(c). [note: 535]Rita’s AEIC, para\n35 [note: 536]PRS, para 334. [note: 537]PRS, para 336. [note: 538]Rita’s\nAEIC, para 36. [note: 539]Rita’s\nAEIC, para 40. [note: 540]NE,\n26 Nov 2013, p 62 line 20 to p 63 line 7. [note: 541]7AB, pp 3848 – 3851. [note: 542]NE,\n19 Nov 2013, p 120 line 14 to p 121 line 22. [note: 543]Nagender’s AEIC, para\n211. [note: 544]Defence, para 85A;\nNE, 15 Nov 2013, p 122 line 6 [note: 545]NE,\n26 Nov 2013, p 9, lines 1 – 7. [note: 546]SOC, paras 90 – 93. [note: 547]Nagender’s AEIC, para\n206; 7AB, p 3902 – 3903. [note: 548]Nagender’s AEIC paras\n207 – 209; 7AB, p 3905. [note: 549]Nagender’s AEIC, para\n208. [note: 550]Nagender’s\nAEIC, para 210; DCS, para 97(b). [note: 551]Defence,\npara 85C. [note: 552]DCS, heading to para\n473. [note: 553]DRS, para 629. [note: 554]Nagender’s\nAEIC, paras 224 – 226. [note: 555]PCS, paras 978 – 979. [note: 556]Nagender’s AEIC, para\n222. [note: 557]3\nAB, pp 1340 – 1341. [note: 558]2SAB,\npp 895 – 897; Piyush’s AEIC, para 28;cf7AB\npp 3874, 3879 and 3884. [note: 559]NE,\n15 Nov 2013, p 113 line 5 to p 121 line 15. [note: 560]DCS,\npara 478, [note: 561]NE, 15 Nov 2013, lines\n19 – 22. [note: 562]DCS,\npara 464. [note: 563]DCS, para 464(g);\nsee CB 627 – 628. [note: 564]PRS,\nparas 345 – 346. [note: 565]Joanna’s AEIC, paras\n95 – 97. [note: 566]PCS,\npara 1004. [note: 567]PRS,\npara 382. [note: 568]7AB, p 3991. [note: 569]Nagender’s\nAEIC, para 189. [note: 570]7AB, p 3994. [note: 571]SOC, para 98. [note: 572]SOC,\npara 102. [note: 573]Nagender’s AEIC, para\n190; NE, 15 Nov 2013, p 161 lines 17 – 19. [note: 574]Nagender’s\nAEIC, para 190. [note: 575]Rajah\nand Tann’s fax dated 22 Sep 2014, pp 11 – 13. [note: 576]DRS,\npara 644; PCS, para 1027. [note: 577]NE, 19 Nov 2013, p\n2, lines 2 – 8. [note: 578]DRS,\npara 527. [note: 579]DRS,\npara 529. [note: 580]Sandeep’s AEIC, paras\n11 – 13. [note: 581]NE,\n7 Nov 2013, p 5 line 20 to p 6 line 14. [note: 582]DCS, para 421 – 426. [note: 583]PRS, para 281. [note: 584]PRS,\npara 289. [note: 585]Defence, paras 91\n– 94. [note: 586]1AB,\np 53. [note: 587]1AB,\np 24; see also NE, 21 Nov 2013, p 74, lines 8 – 16. [note: 588]Defence, paras 96–97;\nReply, para 15. [note: 589]2AB,\np 518 – 525. [note: 590]PCS,\npara 1047. [note: 591]2AB,\np 519. [note: 592]2AB, p 507. [note: 593]8AB,\npp 4387 – 4388. [note: 594]2AB, pp 1069 – 1074. [note: 595]PCS, para 1056. [note: 596]PCS,\nparas 1057 – 1059. [note: 597]DRS, para 709. [note: 598]Defence, para 99. [note: 599]8\nAB, pp 4475 – 4479, [note: 600]1SAB, pp 114 – 115. [note: 601]NE, 14 Nov 2013, p\n130 line 9 to p 132 line 8."
    }
}