{
    "case_title": "Public Prosecutor\n      v\n      Wang\nWenfeng",
    "ncitation": "[2014] SGHC 23",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "The background": "2       The\nfull facts of this case are set out in my judgment delivered at\nthe end of the trial inPublic Prosecutor v\nWang Wenfeng[2011] SGHC 208 (“HC Judgment”), as well\nas in the grounds of decision of the appeal inWang\nWenfeng v Public Prosecutor[2012] 4 SLR 590; [2012]\nSGCA 47 (“CA Judgment”). I shall therefore set out only the salient\nfacts below. 3       Wang\nis from Fujian Province in the People’s Republic of China. He came\nto Singapore to work, but at the time of the offence in April 2009,\nhe was out of work and was required to leave Singapore by 15 April 2009.\nAt that time, he could not afford a plane ticket home. He tried\nto borrow money from his younger sister and his wife but they did\nnot lend him any. On Friday 10 April 2009, Wang decided to resort\nto robbery to get the money for his airfare. 4       In\nthe early morning of 11 April 2009, Wang set off to Sun Plaza at Sembawang\nDrive, carrying with him a haversack containing a fruit knife, a pair\nof cotton gloves and a small bottle of water. He thought that taxi drivers\nwould be good targets, so he flagged down a taxi. It was driven\nby the deceased, Yuen Swee Hong (“the Victim”). Wang directed the\nVictim to drive to “Bao Ping Chun” and, as they neared the destination,\nhe directed the Victim to Jalan Selimang. When the taxi stopped\nat the end of Jalan Selimang, Wang had already put on his gloves\nand taken out his knife. 5       Wang\nused his left hand to hold the knife against the Victim’s chest and\nhis right hand to hold onto the backrest of the driver’s seat. He\ntold the Victim to hand over his money. A struggle ensued between\nWang and the Victim and, in the course of the struggle, Wang stabbed\nthe Victim on his chest. The Court of Appeal (“CA”) found that the\nVictim was stabbed at least five times (CA Judgment at [36], [38]).\nThe injuries inflicted on the Victim were severe enough to have\ncaused heavy bleeding (HC Judgment at [24]) such that, within two\nminutes, the struggle ceased and the Victim went limp. This led\nWang to believe that the Victim had died. He decided to hide the\nbody in the secondary jungle nearby. After carrying the body to\na location well inside the jungle, Wang searched the Victim’s pockets\nand took the money he found. 6       Wang\nsubsequently washed himself at a nearby beach and drove the taxi\nto a multi-storey car park at Canberra Road. He parked the taxi\nat one of the higher levels. Using the water he brought, he cleaned\naway the blood from part of the front cabin. He also cut the cables\nconnecting the credit card machine which he thought was a Global\nPositioning System (“GPS”), took money and the Victim’s mobile phone\nfrom the taxi, cleaned the door handle, and left for home. 7       Sometime\nlater on the same day, Wang went out to dispose of the incriminating\nitems, such as the soiled clothes he had worn. He left the haversack\ncontaining these items in a forested area near Nee Soon Road. As he\nwas journeying on a bus, he received a missed call from the Victim’s\nwife on the Victim’s mobile phone. He alighted and returned a call\nto the Victim’s wife. He told the Victim’s wife that he was holding\nthe Victim captive and demanded $150,000 from her. Over the course\nof two days, from 11 April 2009 to 12 April 2009, Wang gave instructions\nto the Victim’s wife to make payment. When she still did not remit\nthe money to the account number he provided, he reminded her that\nthe Victim had not eaten for two days. 8       Meanwhile,\nWang had secured a place on a flight departing on 14 April 2009.\nBut before he could leave the country, he was arrested by the police\non 13 April 2009.",
        "The prosecution’s submissions": "9       The\nIndian courts adopt the position that the default punishment for murder\nis life imprisonment and that the death penalty is an exception\n(seeBachan Singh v State of PunjabAIR\n1980 SC 898 at [151]). This, the prosecution submitted, was untenable\nin Singapore for two reasons. First, the legislative framework in\nIndia is different. There is no mandatory death penalty for s 300\ncases in India, whereas the death penalty is still mandatory for\ns 300(a) cases in Singapore. Secondly,\nthere is considerable uncertainty in India on the punishment to\nbe ordered in capital offences (seeSangeet and\nanother v State of HaryanaAIR 2013 SC 447 at [81]). 10     The\nprosecution thus submitted that where the law, in this case, s 300(c), provides for a discretionary death\npenalty, neither life imprisonment nor the death penalty should\nbe viewed as the default position. The correct approach is to consider\nall the facts and circumstances to determine if the offender ought\nto suffer the death penalty (seeSia Ah Kew\nand others v Public Prosecutor[1974–1976] SLR(R) 54\n(“Sia Ah Kew”) at [8]). 11Sia Ah Kewis a case of kidnapping under\ns 3 of the Kidnapping Act (Cap 101, 1970 Rev Ed). The CA in that\ncase similarly faced the binary choice of death or life imprisonment,\nand had opined that the maximum sentence of death penalty would\nbe appropriate where the manner of the kidnapping or the acts or\nconduct of the kidnappers were such as tooutrage the\nfeelings of the community(at [5]). 12     The\nprosecution also referred the court to the Parliamentary speech by\nthe Minister for Law when introducing the amendments to the mandatory\ndeath penalty regime (seeSingapore Parliamentary\nDebates, Official Report(9 July 2012) vol 89): In deciding whether and how to apply the\ndeath penalty to a particular offence, several factors have to be\nconsidered. In particular … three interconnected factors: (1)the seriousness of the offence, both in\nterms of the harm that the commission of the offence is likely to\ncause to the victim and to society, and the personal culpability\nof the accused; (2)how frequent or widespread\nanoffenceis; and (3)deterrence. [emphasis added] 13     Each\nof the factors was analysed by the prosecution in light of the facts\nof this case. 14     In\nterms of theseriousness of the offence,\nthe prosecution submitted on three main aspects. First, the offence\nwas committed in a cruel manner. The prosecution argued that there\nwas a high degree of premeditation and planning, which was demonstrated\nby Wang’s intention to commit robbery at the wee hours of the morning,\nhis preparation of items such as a knife, spare change of clothes\nand a water bottle, his deliberate choice of victim (a taxi driver),\nand his direction to the Victim to drive to a deserted area (“Bao Ping\nChun”). The prosecution further pointed to the way Wang had armed himself\nwith a dangerous weapon, a knife with a 12.5cm blade, and had focused\nhis attack on a vulnerable part of the Victim’s body,viz, the chest. Two of the stab wounds\nsuffered by the Victim were described by the CA as “likely to have\nbeen very deep, with [one of them] achieving full, or near-complete,\npenetration of the knife’s 12.5cm blade” (CA Judgment at [25]). As\na result, the Victim suffered an agonizing and painful death. Secondly, Wang’s\nculpability was high. The prosecution examined Wang’s post-murder\nactions and argued he was unremorseful. Particular attention was paid\nto how Wang robbed from the Victim after he killed him, took steps\nto conceal the murder, attempted to extort money from the Victim’s\nfamily, prepared to flee from Singapore and, even after arrest,\nled the police on a wild goose chase and gave several false statements.\nThe prosecution submitted that there were no significant mitigating\nfactors that Wang could rely on. Even though Wang experienced financial\nstress and loneliness as a foreigner in Singapore, they were not\nso unusual or extraordinary that he could rely upon them in mitigation.\nAs Yong Pung How CJ stated inLai Oei Mui Jenny\nv Public Prosecutor[1993] 2 SLR(R) 406 at [10], financial difficulties\ncannot be relied upon, save, possibly, in the most exceptional or extreme\nof circumstances. Thirdly, the prosecution submitted that Wang, being\nstronger and much younger than the Victim, and having taken the Victim\nby surprise from behind, had taken an unfair advantage over the Victim.\nThe prosecution also stressed the high degree of public disquiet\nthat had emanated from the case. 15     To\nshow howfrequent or widespreadoffences\ncommitted against taxi drivers are, the prosecution produced statistics\non the number of robberies, serious hurt and murder committed against\ntaxi drivers between January 2009 and September 2013. Significantly,\nthe number of serious hurt cases over the years are: two in 2009,\ntwo in 2010, six in 2011, seven in 2012, and four in the period\nfrom January to September 2013. The prosecution pointed out the\nparticular vulnerability of taxi drivers – they may be completely\nat the mercy of their passenger-turned-assailant, and out of the reach\nof any help that may be rendered by bystanders. 16     In\ncalling for adeterrentsentence,\nthe prosecution elaborated on the fact that public transport workers\n(“PTWs”), especially taxi drivers, have been viewed by the courts\nas vulnerable victims (see,eg,\nthe CA judgment at [3] andWong Hoi Len v Public\nProsecutor[2009] 1 SLR(R) 115 at [11]). The prosecution\nargued that the present case also has a wider-felt impact of triggering\nunease and offending the sensibilities of the general public, which\nmakes it necessary and appropriate to order a deterrent sentence\n(seePublic Prosecutor v Law Aik Meng[2007]\n2 SLR(R) 814 at [25]). 17     At\nthe time of hearing, there were three other concluded murder re-sentencing\ncases. In all these cases the court reduced the sentence of death to\na sentence of life imprisonment and caning. The prosecution argued\nthat these cases could be distinguished. InPublic\nProsecutor v Fabian Adiu Edwin(Criminal Case No 40 of\n2009) (“Fabian”), the offender was\nyoung (18 years old at the time of offence) and had sub-normal intelligence.\nInPublic Prosecutor v Kho Jabing[2013]\nSGHC 251 (“Kho Jabing”), the offender\nwas also considered to be young (24 years old at the time of offence)\nand his choice of weapon was described as opportunistic and improvisational.\nInPublic Prosecutor v Gopinathan Nair Remadevi Bijukumar(Criminal\nCase No 40 of 2011) (“Gopinathan”),\nthe CA did not find that the offender had set out to rob the victim\nand had given the offender the benefit of doubt that he had been\nprovoked by the victim. The prosecution submitted that none of these\ncharacteristics exist in the present case. Wang was already 30 years\nold at the time of the offence. From the degree of planning that\nwent into his crime and the calculated steps he took to conceal\nthe evidence, the prosecution submitted that Wang was a highly intelligent\nindividual. UnlikeKho Jabing, Wang\nin this case had prepared a knife and therefore, his choice of weapon\ncould not have been opportunistic. Lastly, unlikeGopinathan,\nWang set out to rob the Victim and was not provoked. 18     In\nlight of the foregoing, the prosecution submitted that the three precedent\ncases do not bar the court from imposing the death penalty. In fact,\nas the present case falls squarely within the category of cases\nthat would outrage the feelings of the community, the prosecution\nurged the court to re-sentence Wang to death.",
        "The defence’s submissions": "19     The\ndefence relied onSia Ah Kewfor\nthe principle that the death penalty should only be imposed for\nthe worst manner of offending. The court was also referred to a\nnumber of cases from across the Commonwealth and other jurisdictions,\nwhich have a common thread of imposing the death penalty in the\nmost exceptional cases. Therefore, the defence submitted that the\ndeath penalty should only be imposed if the manner by which the\nmurder was carried out was of the most heinous nature, the murderer\nwas of the worst type, and there was an absence of any significant\nmitigating circumstances. The present case, the defence argued, was\nnot such a case where death penalty would be appropriate. 20     Much\nemphasis was placed on the fact that there was a lack of any premeditation\nto inflict the fatal injuries. What happened was a sudden and unexpected\nstruggle, during which Wang stabbed the Victim spontaneously. Given\nthat the intention to stab had formed only during the struggle,\nit could not be said that Wang consciously took advantage of the Victim’s\nvulnerability or planned to stab the Victim as part of the robbery. Neither\nwas the stabbing inflicted in cold blood as Wang did not relish\nthe act of murder and no further injuries were inflicted on the\nVictim to ensure that he died. 21     The\ndefence stressed that the post-killing acts, such as his extortion\nof money from the Victim’s family, must be seen in context. They\nwere induced by panic, fear and adrenaline, and the defence urged\nthe court not to accord them undue weight in the formulation of\nwhat his intention was at the beginning of the criminal enterprise\nand when deciding the appropriate sentence. 22     To\nfurther show that the moral blameworthiness of Wang was below that\nfor the most heinous cases of murder under s 300(c)\nof the Penal Code, the defence raised a number of mitigating circumstances.\nFirst, Wang did not form the intention to murder the Victim when\nhe set out to commit robbery; he only brought the knife to scare\nhis Victim into submission. Secondly, his mind was not at its clearest\nwhen he had formed the intention to stab the Victim during the struggle.\nAt the time of the offence, he was labouring under difficult personal\nand financial circumstances and when the Victim struggled, he reacted\non the spur of the moment without considering the consequences of\nhis actions. Thirdly, the Victim was not made to endure extended\npain and suffering; he went limp within two minutes of the struggle.\nFourthly, Wang was remorseful for his actions. The defence admitted\nthat Wang lied to the police initially, but highlighted that Wang\nvolunteered the truth later on. Lastly, Wang was not a hardened criminal,\nand has the potential to reform and be rehabilitated. 23     The\ndefence referred to the four sentencing principles of deterrence, prevention,\nretribution, and rehabilitation as affirmed by the CA inPublic Prosecutor v Kwong Kok Hing[2008]\n2 SLR(R) 684, as well as the principle of individualised justice\nenunciated by V K Rajah J in the High Court decision ofDinesh Singh Bhatia s/o Amarjeet Singh v Public Prosecutor[2005]\n3 SLR(R) 1. Having regard to the circumstances of Wang’s act, the defence\nsubmitted that all four sentencing objectives can be met by a sentence\nof life imprisonment, and that life imprisonment was the appropriate\nsentence to be passed in this case. 24     There\nwere also three letters written by Wang’s father, sister and daughter\npleading for clemency. They mentioned that Wang’s 12-year-old daughter\nyearned to see her father again, and that his parents were over\n50 years old and wished to have the accompaniment of their son in\ntheir old age. 25     In\nrespect of the three precedent cases of re-sentencing, the defence drew\nthe court’s attention to the fact that none of the cases had meted\nout the death penalty. On the other hand, in addition to the sentence\nof life imprisonment, the three precedent cases had imposed either\n18 or 24 strokes of cane. Because the defence submitted that an\nadditional punishment of no more than ten strokes of the cane was\nappropriate, it had to distinguish the three precedent cases. 26     InFabianandKho Jabing,\nthe court had imposed the maximum of 24 strokes of cane. The defence\nsubmitted that Wang’s culpability in this case was lower than that\nof the offenders inFabianandKhoJabingbecause\nthe offenders in the latter two cases had intended to use their\nweapons to cause bodily injury in furtherance of their robbery.\nThe defence argued that no such intention was present in this case.\nInGopinathan, the court had imposed\n18 strokes of cane. The defence submitted that Wang’s culpability was\ncloser to the facts ofGopinathanbecause,\nin both cases, the robberies were motivated by desperate financial\ncircumstances. Nonetheless, the defence observed that the offender\ninGopinathanhad maintained his\nlie about another man who had killed the victim, whereas the offender\nin this case had shown remorse at an earlier stage and volunteered\nthe truth to the police less than ten days after he gave the false\nstatements. 27     Given\nthe above, the defence submitted that the appropriate sentence in\nthis case was life imprisonment and no more than ten strokes of\nthe cane.",
        "The court’s decision": "28     The\nissue before me was whether the facts and circumstances of this case\njustified imposing the death penalty or life imprisonment with or without\ncaning. 29     I\nhad found that Wang had not set out with the intention to kill,\nbut with the intention to commit robbery, armed with a knife. He\nhad targeted taxi drivers, presumably for their unique vulnerability.\nHe got the Victim to drive to a lonely spot and pointed the knife\nat him to get him to surrender his money. However the Victim tried\nto snatch or pluck the knife from Wang and a struggle ensued, resulting\nin the tragic outcome. These would be the relevant facts of the\noffence, although the aftermath provides some insight into Wang’s\nframe of mind. When Wang realised that the Victim had gone limp,\nhe got out of the taxi, ascertained that the Victim was dead, and\nproceeded to hide the body in the nearby jungle. He washed himself\nin the sea, drove the taxi to a multi-storey carpark, washed off\nthe blood stains and took the Victim’s money and mobile phone. He\nthen attempted to leave the country. When the Victim’s wife called\nhis mobile phone, Wang took advantage of the situation and tried\nto extort money from her by leading her to think that the Victim\nwas still alive and would be hurt if she did not pay up. 30     It\nwas in the context of these facts, particularly the facts leading\nto the killing, and to a lesser extent, the facts post-killing that\nI have to determine the issue, along with other factors of the case,\nnamely the fact that the Victim was a taxi driver, and part of a\nvulnerable group. 31     The\nprosecution submitted that this was an offence against a PTW and\ntherefore a deterrent sentence was necessary. There have been cases involving\nvictims who were PTWs in which the courts have held that it was necessary\nto impose deterrent sentences in view of their vulnerable positions\nas well as the dangers posed to the public at large. I myself have stated\nthis in a Magistrate’s Appeal: seeBalbir Singh\ns/o Amar Singh v Public Prosecutorand\nanotherappeal[2010]\n3 SLR 784. But the expression “public transport worker” covers a\nwide range of people. This ranges from PTWs who operate transportation\ninvolving many passengers, such as buses or trains, to those who\ncarry much less,egtaxis. The degree\nof danger to the public would vary with the numbers carried. However\nthe danger may be higher in certain modes of transport,egaircraft. The degree of punishment imposed\ncould correspond to the degree of danger posed to the public. There\nis the special case of taxi drivers, who are vulnerable because\nthey work alone and can be stranded in remote locations. However\nit is one thing to impose a higher fine or period of imprisonment\nfor an offence against a taxi driver to deter like-minded from carrying\nout offences against taxi drivers. It is quite another to say that\nit is necessary and appropriate to impose a sentence of death where\nlife imprisonment is otherwise called for. For the court to justify\nimposition of capital punishment on the ground of deterrence, the\nprosecution must produce much more evidence to show the inadequacy\nof life imprisonment (plus caning) as against the death sentence.\nThe only evidence of this produced by the prosecution was a single\nincident of murder of a taxi driver in the past five years, which\nwas this present case. There have been a number of cases of serious\nhurt against taxi drivers, but there is no upward trend nor are\nthe numbers high – the range of such offences vary from two a year\nto seven a year in the last five years. 32     I\ntherefore consider that deterrence was not a major factor in determining\nthe sentence for the present case. The relevant parameters were\nthe facts of the offence, although keeping in mind that it was perpetrated\nagainst a person belonging to a particularly vulnerable group. Wang\nhad set out to rob a taxi driver, but there was no evidence of any intention\nto kill from the outset. Death was caused in the course of a struggle,\none that Wang ought to have anticipated. The prosecution made a rather\nuncharacteristic submission that there was “a high degree of premeditation\nand planning”, without stating that this was in relation to the offence\nof robbery and not the murder. This was puzzling because the finding\nof fact at both High Court and Court of Appeal was that the offence of\nmurder was not premeditated. That submission only had the unfortunate effect\nof causing the media reports of the case to be misreported. As for\nthe acts post-killing, there was a range of explanations for it,\nbut Wang was entitled to the benefit of doubt that this was motivated\nby self-preservation after the fact and not cold blooded intent.\nThe aggravating factor in this case was the fact that he took cruel\nadvantage of the desperation of the Victim’s widow and tried to\nextort money from her while keeping up her hopes that the Victim\nwas still alive. But again there was no evidence that this was preplanned;\nindeed the evidence points to them being opportunistic acts. Wang\ndeserved the full brunt of the law short of capital punishment.\nIn my view, the ends of justice were served by a sentence of life imprisonment\nand, in view of the acts post-killing, to 24 strokes of the cane, which\nwas the maximum sentence I can impose short of the death penalty. 33     For\nthe reasons given above, I exercised my power under s 4(5)(g) of the Penal Code (Amendment) Act to\nre-sentence Wang to imprisonment for life and to 24 strokes of the\ncane."
    }
}