{
    "case_title": "R1 International Pte Ltd\n      v\n      Lonstroff AG",
    "ncitation": "[2014] SGHC 69",
    "coram": "Judith Prakash J",
    "sections": {
        "Introduction": "1       The plaintiff and the defendant are both\n                    business entities and they dealt with each other on a number of transactions\n                    under which the plaintiff sold, and the defendant bought, consignments of\n                    rubber. 2       The plaintiff brought these proceedings to\n                    obtain a permanent injunction to restrain the defendant from continuing with a\n                    law suit filed in the courts of Switzerland. It was able to get an interim\n                    injunction to this effect. Having been notified of the interim order, the\n                    defendant applied for it to be discharged. The plaintiff then applied for the\n                    injunction to be made permanent. The applications were heard together since one\n                    was the obverse of the other. 3       What makes this anti-suit injunction different\n                    from the usual one of its kind is that it seeks to permanently restrain foreign\n                    court proceedings in favour of arbitration. This raises distinct jurisdictional\n                    considerations which are not typically encountered in situations where an\n                    anti-suit injunction is sought in support of foreign court\n                proceedings. 4       While the question of the court’s\n                    jurisdiction is intriguing, the defendant argues that it does not need to be\n                    considered at all because the contract between the plaintiff and the defendant\n                    did not contain any arbitration or jurisdiction clause and the defendant was\n                    therefore perfectly entitled to take action in the courts of Switzerland. This\n                    is a threshold issue which must be determined first.",
        "Background facts": "5       R1 International Pte Ltd (“R1\n                    International”), the plaintiff, is a Singapore company in the business of\n                    wholesale trading and brokering of rubber. It dealt with Lonstroff AG\n                    (“Lonstroff”) through its authorised agent, R1 Europe GmbH\n                    (“R1 Europe”). 6       Lonstroff is a Swiss company in the business of\n                    processing natural rubber and plastics. 7       Between 2012 and early 2013, R1 International\n                    supplied natural rubber to Lonstroff via R1 Europe. There were five transactions\n                    in total. Details of how the orders were placed, the contracting process and\n                    delivery of the rubber were given by Andreas Schenker (“Mr\n                    Schenker”), Head of Purchasing in Lonstroff. He said that each\n                    transaction was negotiated and concluded in a similar manner. First, there were\n                    sales negotiations between Lonstroff and R1 Europe via email. Acceptance of R1\n                    International’s offers would be communicated to R1 Europe by telephone.\n                    The latter would then send an email to Lonstroff confirming the sale.\n                    Subsequently, R1 International would send out a signed sales contract for\n                    Lonstroff’s signature but Lonstroff would never sign it.",
        "The first order": "8       The first order was concluded between 24 and 25\n                    January 2012. On 24 January 2012, R1 Europe sent an email to Mr Schenker,\n                    thanking him for a contract to purchase 42.32 metric tonnes of rubber from R1\n                    International and stating several terms of the contract. No mention of any\n                    arbitration agreement was made in that email. 9       On 1 February 2012, R1 Europe sent an email to\n                    Lonstroff requesting them to sign a sales contract dated 27 January 2012. This\n                    contract had been pre-signed by R1 International and included a term\n                    stating: Subject to the terms, conditions and rules (including the arbitration\n                        clauses and rules) of the International Rubber Association Contract for\n                        technically specified rubber in force at date of contract. 10     In clause 12(C) of the Index to the\n                    International Rubber Association Contract (“IRAC terms”), it is\n                    specified that any dispute arising out of the contract shall be settled at the\n                    designated centre of arbitration which, in respect of shipments to Europe would\n                    be London unless the parties agreed otherwise. Lonstroff did not sign the sales\n                    contract, but it accepted delivery of the order on 25 May 2012 and made payment\n                    to R1 International on 16 July 2012.",
        "The second order": "11     The second order was concluded on or around 15\n                    August 2012. An email was sent to Lonstroff by R1 Europe, thanking it for the\n                    purchase and stating several terms on which the contract was concluded. There\n                    was no mention of arbitration as the dispute resolution mechanism or any\n                    arbitration agreement in that email. 12     The order was delivered to and accepted by\n                    Lonstroff on 27 August 2012. Four days later, on 31 August 2012, R1 Europe sent\n                    an email on behalf of R1 International to Lonstroff with a sales contract dated\n                    16 August pre-signed by R1. This contract contained the same clause referring to\n                    the IRAC terms but, immediately below that, also had the following additional\n                    clause (“the SICOM arbitration agreement”): In the event of any arbitration, it will be conducted\n                            in Singapore. [Emphasis added in bold italics]13     Lonstroff did not sign the sales\n                    contract.14     There were three other orders that were made\n                    after the first and second orders. In each case, R1 International sent out a\n                    sales contract containing the IRAC clause and the SICOM arbitration\n                    clause.The dispute15     The dispute arose from the second order. On 20\n                    September 2012, Lonstroff emailed R1 Europe, complaining about the smell of the\n                    rubber supplied and alleging that R1 had breached the contract because the goods\n                    emitted a foul smell that made them unsuitable for Lonstroff’s use.\n                    Lonstroff threatened legal proceedings when R1 International refused to offset\n                    payment against the cost of delivery.Procedural history and issues16     Lonstroff commenced legal proceedings against\n                    R1 International in Switzerland on 28 March 2013. On 2 July 2013, R1\n                    International requested the Singapore Commodity Exchange (“SICOM”)\n                    to set up an arbitration tribunal to resolve the dispute. SICOM replied on 17\n                    July 2013 and stated that they would only consider the request when it was\n                    confirmed that Swiss proceedings had been suspended and that both parties agreed\n                    to refer the dispute to it.17     R1 International then filed these proceedings\n                    on 5 August 2013, to obtain an anti-suit injunction preventing Lonstroff from\n                    continuing legal proceedings in the Commercial Court of Canton of Aargovia in\n                    breach of the SICOM arbitration agreement. An interim order to this effect was\n                    made which Lonstroff then applied to discharge.18     The ensuing hearing before me dealt with the\n                    applications of both parties since the issues they raised were the same. Three\n                    issues were canvassed during the hearing:(a)     Whether the contract between the\n                        parties provided for disputes to be submitted to\n                    arbitration;(b)     If so,\n                        whether this court can grant a permanent anti-suit injunctions supporting\n                        international arbitration either under s 12A(2) read with s 12(1)(i) of the\n                        International Arbitration Act (Cap 143A, 2002 Rev Ed) (“the\n                        IAA”) or under any other power; and(c)     In either case, when should the power be\n                        exercised.Did the contract for the second order contain an arbitration\n                clause?19     Mr Mohamed, counsel for R1 International,\n                    initially advanced his case on the proposition that the SICOM arbitration\n                    agreement was part of the contract for the second order on the basis of trade\n                    custom. His alternative case was that at least the IRAC term providing for\n                    arbitration in London was part of the contract having been incorporated in it by\n                    a previous course of dealing.Incorporation by trade custom20     Turning to the plaintiff’s grounds, Mr\n                    Mohamed first submitted that the SICOM arbitration agreement was incorporated by\n                    trade custom. He relied on the evidence of Oh Kian Chew (“Mr Oh”),\n                    the plaintiff’s Head of Global Trading, and that of the president of the\n                    board of directors of R1 Europe, Mr Lorenzo Pietro Paolo Dufour (“Mr\n                    Dufour”). The effect of their evidence is that the rubber trade is a very\n                    mature trade and it is a trade custom for the majority of international rubber\n                    traders to conclude contracts based on IRAC terms. Lonstroff’s immediate\n                    past supplier, Wurfbain BV, had also used IRAC terms in its dealings with\n                    Lonstroff and stipulated for Singapore arbitration. This latter evidence came\n                    from Mr Dufour who exhibited a copy of Wurfain BV’s standard form contract\n                    to his affidavit.21     CitingLouis Dreyfus\n                        Commodities Asia Pte Ltd v Govind Rubber Limited(Arbitration\n                    Petition No 174 of 2012), Mr Mohamed then requested the court to take judicial\n                    notice of this fact and find the SICOM arbitration agreement incorporated via\n                    trade custom. He citedZheng Yu Shan v Lian Beng Construction\n                        (1988) Pte Ltd[2009] 2 SLR(R) 587 (“Zheng Yu Shan”) at 599 in further support.22     Mr Lobo, counsel for Lonstroff, objected and\n                    contended that there was insufficient evidence before the court that all\n                    contracts for the sale and purchase of rubber incorporated IRAC terms. Moreover,\n                    all that had been alleged was that Lonstroff had had a previous supplier who\n                    dealt on IRAC terms. This was not supported by evidence.23     In my view, on the facts of this case,Zheng Yu Shanis not applicable. The court can\n                    only take judicial notice of facts which are clearly established such that they\n                    are beyond reasonable dispute or of specific facts which are capable of being\n                    immediately and accurately shown to exist by authoritative sources. I cannot\n                    take judicial notice of any practice in the rubber trade which is not something\n                    I or any ordinary layman who was not involved in the rubber trade would have\n                    ordinarily been aware.24     Accordingly, the trade practice has to be\n                    proved. In this, R1 International has failed. The only evidence came from Mr Oh\n                    and Mr Dufour, the latter being R1 International’s agent and therefore not\n                    an independent party. The standard form contract of Wurfbain BV was of little\n                    probative value as it was not shown that Lonstroff bought from Wurfbain BV on\n                    these terms. Mr Schenker’s evidence was that Lonstroff had never been\n                    shown the IRAC terms nor had these been mentioned in the course of negotiations.\n                    In any case, Lonstroff is not an international rubber trader but an end user of\n                    the product so it is believable that it may not be aware of the practice of\n                    international rubber traders even if one exists.25     Counsel has neither adduced evidence on the\n                    prevalence of IRAC terms in the rubber trade nor shown that the use of IRAC\n                    terms is of an incontrovertible nature. I thus reject his submission and find\n                    that no trade custom has been established. The SICOM arbitration clause cannot\n                    therefore be regarded as having been incorporated in the second order by trade\n                    custom.26     It is also worth noting that the SICOM\n                    arbitration agreement is not part of the standard IRAC terms. These provide for\n                    the place of arbitration to be settled according to the destination of the goods\n                    and Singapore is not a designated arbitration centre for goods shipped to\n                    London. Thus it would not have been enough for the plaintiff to prove a custom\n                    in the rubber trade to contract on IRAC terms; additionally it would have had to\n                    establish that in the case of shippers from Singapore these terms included the\n                    SICOM arbitration agreement. The plaintiff did not even attempt to do\n                    that.Incorporation via previous course of dealing27     Alternatively, Mr Mohamed submitted that the\n                    SICOM arbitration agreement was incorporated by the parties’ previous\n                    course of dealing in which IRAC terms had been incorporated into their\n                    contracts. This submission relied on the fact that when the first transaction\n                    between the parties took place in early 2012, R1 International had forwarded its\n                    sale contract referring to the IRAC terms to Lonstroff. In that case, Lonstroff\n                    had not signed the sale contract but it had taken delivery of the goods some    \n                    months thereafter and paid for the same without expressly disputing or rejecting\n                    the sale contract. I note that Lonstroff disputes that the IRAC terms applied to\n                    the first order.28     Mr Mohamed further submitted that this\n                    approach was supported byInternational Research Corp PLC v\n                        Lufthansa Systems Asia Pacific Pte Ltd and another[2014] 1 SLR\n                    130 (“International Research Corp”),\n                    which held that a valid arbitration agreement can be constituted by reference\n                    where a document containing an arbitration agreement is referred to in a\n                    contract and the reference is such as to make the arbitration agreement part of\n                    the contract. Whether this was satisfactorily incorporated was a matter of\n                    contractual interpretation and the court must have regard to the context and the\n                    objective circumstances surrounding the formation of the contract. For the\n                    purpose of the discussion that follows, I am taking R1 International’s\n                    case at its highest and assuming that the IRAC terms were incorporated into the\n                    first order.29     Relying onAjwa for Food Industries Co (MIGOP), Egypt v Pacific\n                        Inter-Link Sdn Bhd[2013] 5 MLJ 625 (“Ajwa Food Industries”), which held that an arbitration\n                    agreement need not be signed and was incorporated by the parties’ previous\n                    course of dealing, Mr Mohamed argued that since the parties had entered into a\n                    prior order and in that order the IRAC clause was incorporated, it must have\n                    been aware that the second order contained the same clause with a nomination for\n                    the arbitration to be conducted in Singapore. In this manner, the SICOM\n                    arbitration agreement was incorporated by the parties’ previous course of\n                    dealing.30     Mr Lobo did not dispute the holding inInternational Research Corpbut submitted\n                    that, on a contextual interpretation, the SICOM arbitration agreement was never\n                    incorporated into the second order since the matter was never discussed by the\n                    parties, the IRAC was never referred to or provided to Lonstroff, and the\n                    pre-signed contract had been sent only after delivery of the order had been\n                    made.31     Alternatively, the arbitration agreement in\n                    the first contract could not be accepted as having been incorporated by previous\n                    course of dealing since the relationship between the parties was not long\n                    enough. Two orders were insufficient to establish the continuity of acts\n                    required to prove incorporation by previous course of dealing:Trans-Link Exhibition Forwarding Pte Ltd v Wadkin Robinson Asia Pte\n                        Ltd[1996] 1 SLR(R) 424 at [22]. In his further written\n                    submissions, Mr Lobo distinguishedAjwa Food\n                        Industrieson the basis that the parties in that case had a\n                    course of dealing which stretched over a period of twenty years and had\n                    previously referred their trade disputes to arbitration. This was despite their\n                    not having signed the arbitration agreements.32     I accept Mr Lobo’s argument: one prior\n                    transaction between these parties was, in my view, insufficient to found a\n                    course of dealing between them. There was no continuity in the transactions as\n                    the facts themselves show. Whilst in the first transaction, R1 International was\n                    content to rely on the standard IRAC terms, in the second order it wanted to\n                    modify those by adding the SICOM arbitration agreement. That change in the terms\n                    showed that there was, at the time of the second order, no settled course of\n                    dealing between the parties.33     Even if there was indeed a previous course of\n                    dealing between the parties, I find that the SICOM clause could not have been\n                    incorporated by reference. InUnited Eng Contractors Pte Ltd\n                        v L & M Concrete Specialists Pte Ltd[1999] 2 SLR(R) 524, G P\n                    Selvam J held that:The general rule is that he is not bound by the terms of offer if he\n                        merely remains silent even if the offer provides that silence will be deemed\n                        to be acceptance. More so if the terms are contained in a document which he\n                        is required to sign to signify his intention to accept.It is even more so, if the parties have already been acting on an oral\n                            contract and one party unilaterally tries to impose onerous terms after\n                            the original oral contract has been acted upon.[Emphasis added in bold]34     Here, I hold that the SICOM arbitration\n                    agreement was not and could not have been incorporated by reference into the\n                    second order. The sales contract dated 16 August 2012 was sent to Lonstroff only\n                    on 31 August 2012 while the order had been delivered on 27 August 2012. The\n                    SICOM arbitration agreement was not incorporated since the contract had been\n                    concluded and performed between both parties before Lonstroff was notified of\n                    the SICOM arbitration agreement. There was also no discussion pertaining to the\n                    incorporation of the SICOM arbitration agreement during negotiations between the\n                    parties. Hence, the SICOM arbitration agreement was not incorporated by\n                    reference.35     Since the SICOM arbitration agreement has not\n                    been incorporated into the second order, I find that there is no basis to grant\n                    a permanent anti-suit injunction or sustain the interim anti-suit\n                    injunction.Whether this court can grant a permanent anti-suit injunctions\n                supporting international arbitration under s 12A(2) read with s 12(1)(i) of the\n                International Arbitration Act36     In light of my holding above, there is\n                    strictly no need to consider the court’s power to grant a permanent\n                    anti-suit injunction in aid of an international arbitration. However, since both\n                    parties dealt with this point extensively in their submissions and since it is a\n                    point that may have significance in future cases, I give my views on it\n                    below.37     Mr Mohamed submitted that this court had the\n                    power to grant permanent injunctions in support of international arbitration. In\n                    its \"Report of the United Nations Commission on International Trade Law\n                    (“UNCITRAL”) on the work of its Thirty-third Session\" at\n                    para 15, UN Doc A/CN.9/WG.II/WP.111 (“the UNCITRAL Report”),\n                    UNCITRAL reported as follows:Availability of provisional and\n                            protective measures (Principle 3)15. It is desirable that the measures be available to both foreigners and\n                        citizens alike and in respect of arbitrations held in both the country of\n                        the court issuing the measure and in a foreign country.38     He contended that s 12A(1)(b) of the IAA gives\n                    effect to this principle, noting that inWSG Nimbus Pte Ltd v\n                        Board of Control for Cricket in Sri Lanka[2008] 1 SLR(R) 1088\n                        (“WSG Nimbus”), Lee Seiu Kin JC\n                    (as he then was) had sustained an interim anti-suit injunction in aid of\n                    domestic international arbitration.39     Mr Mohamed also citedMaldives Airports Co Ltd and another v GMR Male International Airport Pte\n                        Ltd[2013] 2 SLR 449 (“Maldives\n                        Airports”), which held that s 12A(2) and (4) read with s\n                    12(1)(c) to (i) did not confine the court to just grantingAnton Pillerorders orMarevainjunctions; as long as it is necessary for the preservation of evidence or\n                    assets, the court has the power to grant injunctions, including permanent\n                    anti-suit injunctions.40     Whilst I accept Mr Mohamed’s general\n                    proposition on the court’s ability to grant such injunctions, with due\n                    respect, I do not agree that this power to grant permanent anti-suit injunctions\n                    to assist arbitration can be derived from s 12A of the IAA. Principle 3 found in\n                    paragraph 15 of the UNCITRAL Report concerned provisional and protective\n                    measures in respect of both domestic and foreign international arbitrations.\n                    This was discussed in the context of disputes with an international element and\n                    the possibility of developing uniform rules for the provision of interim\n                    measures: see UNCITRAL Report at para 7. I agree with Mr Mohamed that this\n                    principle has been accepted here to the extent that s 12A(2) read with s\n                    12(1)(i) of the IAA provides for interim injunctions in aid of both domestic and\n                    foreign international arbitration. However, I do not think that the s 12(1)(i)\n                    of the IAA extends to permanent anti-suit injunctions. This is essentially a\n                    question of statutory interpretation and interplay between the court’s\n                    injunctive power under s 12A read with s 12 of the IAA and its general\n                    injunctive power under s 4(10) of the Civil Law Act (Cap 43, 1999 Rev Ed)\n                    (“CLA”) and paragraph 14 to the First Schedule of the Supreme\n                    Court of Judicature Act (Cap 322, 2007 Rev Ed).41     The relevant portions of s 12A and s 12 of the\n                    IAA read:12A. —(1) This section shall apply in\n                        relation to an arbitration —(a)    to which this Part\n                            applies; and(b)    irrespective of\n                            whether the place of arbitration is in the territory of\n                            Singapore.(2)    Subject\n                            to subsections (3) to (6), for the purpose of and in\n                            relation to an arbitration referred to in subsection (1), the\n                            High Court or a Judge thereof shall have the same power of making an\n                            order in respect of any of the matters set out\n                                in section 12(1)(c) to (i) as it has for the purpose of and in relation to an\n                            action or a matter in the court.(3)    The High Court or a Judge thereof may refuse to\n                            make an order under subsection (2) if, in the opinion of\n                            the High Court or Judge, the fact that the place of arbitration is\n                            outside Singapore or likely to be outside Singapore when it is\n                            designated or determined makes it inappropriate to make such\n                            order.12.—(1) Without prejudice to the\n                        powers set out in any other provision of this Act and in the Model Law, an\n                        arbitral tribunal shall have powers to make orders or give directions to any\n                        party for —(i)    an interim\n                            injunction or any other interim measure.42     From the above it can be seen that as far as\n                    the power that s 12(l) grants the courts in respect of injunctive relief, this\n                    is a power to be exercised on an interim basis only. This makes eminent sense as\n                    the interim injunction is to be given in aid of the arbitration proceedings\n                    which will make the findings and give the orders that permanently resolve the\n                    dispute.43     This does not mean, however, that the court\n                    has no power to grant a permanent anti-suit injunction in relation to\n                    arbitration proceedings, only that the source of that power is not the IAA. As\n                    stated above, the court’s general injunctive power emanates from s 4(10)\n                    of the CLA. This is the power that the court exercises when it grants a\n                    permanent anti-suit injunction in aid of local court proceedings. There is no\n                    reason why this power cannot be exercised to make permanent anti-suit\n                    injunctions in aid of domestic international arbitration proceedings especially\n                    since under s 12A(2) read with s 12(1)(i) of the IAA and the holding inMaldives Airports, the courts can grant\n                    interim anti-suit injunctions in such situations.44     An argument was made in the United Kingdom\n                    (“UK”) that the power to grant interim injunctions in aid of\n                    arbitration proceedings conferred on the courts by the Arbitration Act 1996 (c\n                    23) (UK) (“the Arbitration Act 1996”) limited or excluded or\n                    qualified the court’s general jurisdiction to order injunctive relief in\n                    cases relating to arbitration that had hitherto been exercised under s 37 of the\n                    Senior Courts Act 1981 (c 54) (UK) (“ the Senior Courts Act\n                    1981”). This argument was roundly rejected: seeAES\n                        Ust-Kamenogorsk Hydropower Plant LLP v Ust-Kamenogorsk Hydropower Plant\n                        JSC[2013] 1 WLR 1889 (“AES\n                        Ust-Kamenogorsk”) at [57]. Instead, the UK Supreme Court\n                    held that clear words would be needed to abrogate the court’s general\n                    jurisdiction to grant anti-suit injunctions. The language of s 4(10) of the CLA\n                    is very similar to that of s 37 of the Senior Courts Act 1981 and I am happy to\n                    adopt the holding inAES Ust-Kamenogorskand hold\n                    that there is no clear language in the IAA which would cut down the breadth and\n                    scope of the court’s powers under s 4(10) of the CLA.45     The facts ofAES\n                        Ust-Kamenogorskare interesting. It involved an owner of\n                    hydroelectric facilities in Kazakhstan which entered into a concession agreement\n                    with the operator of the facilities. The agreement was governed by Kazakh law\n                    but provided for London arbitration under English law. Disputes having arisen\n                    subsequently, the owner started court proceedings in Kazakhstan in breach of the\n                    arbitration agreement. The operator contested those proceedings. However, the\n                    Kazakhstan Supreme Court held that the arbitration clause was contrary to Kazakh\n                    public policy and thus invalid. The owner then started proceedings in the\n                    Kazakhstan Economic Court, which assumed jurisdiction over the matter. The\n                    operator was forced to defend the merits of the claim while denying the Kazakh\n                    court’s jurisdiction – if it did not, it would not be able to appeal\n                    the Kazakhstan Supreme Court’s decision on jurisdiction.46     The operator then sought an interim anti-suit\n                    injunction from the English against Kazakh proceedings started in breach of the\n                    arbitration clause by the owner, even though English arbitration proceedings had\n                    not commenced and it had no settled intention yet to commence arbitration. The\n                    judge at first instance granted a final order, which declared that certain\n                    claims could only be pursued in arbitration and their pursuit in other forums\n                    must be restrained. The owner’s appeal to the English Court of Appeal was\n                    dismissed and the question before the UK Supreme Court was whether an anti-suit\n                    injunction under s 37 of the Senior Courts Act 1981 but not under s 44 of the\n                    Arbitration Act 1996 could be granted.47     The UK Supreme Court held that since the\n                    Arbitration Act 1996 did not apply where proceedings are not starting and have\n                    not started, any injunction granted must be under s 37 of the Senior Courts Act\n                    1981. There was nothing in the Arbitration Act 1996 which abrogated the\n                    court’s general injunctive power and the jurisprudence on anti-suit\n                    injunctions was not to be undermined. It observed that it would be astonishing\n                    if Parliament should without warning have abrogated or precluded the use by the\n                    English Court of its well-established jurisdiction under s 37 in respect of\n                    foreign proceedings threatened in breach of the negative aspect of an\n                    arbitration agreement (by which it meant the negative obligation imposed on a\n                    party to an arbitration agreement not to commence proceedings in any other\n                    forum): seeAES Ust-Kamenogorskat [57]. Therefore, the owner’s appeal was\n                    dismissed.When would it be appropriate to grant a permanent anti-suit\n                injunction?48     The established principles concerning the\n                    grant of permanent anti-suit injunctions can be found inSociete Nationale Industrielle Aerospatiale v Lee Kui Jak[1987]\n                    AC 879. These principles were adopted byMaldives\n                        Airportsin relation to arbitration proceedings. There, the court\n                    affirmed its jurisdiction and ability to protect the parties’ contractual\n                    rights to have disputes resolved by arbitration in a contractually chosen\n                    court.49     This is recognised as part of Singapore law:Halsbury Law of Singaporevol 6(2)\n                    (LexisNexis, 2013) at para 75.133.50     The position is clear for arbitration\n                    agreements providing for international arbitrations in Singapore – where\n                    there is such a clause, the innocent party can seek a permanent anti-suit\n                    injunction under the court’s general power to grant an\n                injunction.Whether Singapore should grant a permanent anti-suit injunction where\n                the arbitration agreement is for a foreign international arbitration51     In the course of proceedings, a question arose\n                    as to whether it would be appropriate to grant a permanent anti-suit injunction\n                    if I found that an arbitration agreement calling for arbitration in London had\n                    been incorporated into the contract.52     I think this point can be dealt with shortly.\n                    The court now has the power under s 12A(2) read with s 12 of the IAA to grant\n                    interim injunctions, even in aid of foreign international arbitration\n                    proceedings. This was not the case under the former s 12(6) of the IAA, which\n                    read:(6)    The High Court or a Judge thereof shall have, for\n                            the purpose of and in relation to an arbitration to which this Part\n                            applies, the same power of making orders in respect of any of the\n                            matters set out in subsection (1) as it has for the purpose of and in\n                            relation to an action or matter in the court.53     To enable the courts to assist foreign\n                    international arbitration, s 12A was then enacted to replace s 12(6) of the IAA.\n                    It empowers the courts to issue interim injunctions in aid of foreign\n                    international arbitration and brings the IAA in line with legislation in other\n                    countries, such as the United Kingdom and New Zealand: seeSingapore Parliamentary Debates,Official\n                        Report(19 October 2009) vol 86 at cols 1633-1634. The present\n                    position is that s 12A(2) read with s 12(1)(i) of the IAA grants to the court\n                    jurisdiction to issue an interim anti-suit injunction in aid of foreign\n                    international arbitration:Maldives Airportsat\n                    [34].54     I have opined above that the courts have\n                    jurisdiction under s 4(10) of the CLA to grant permanent anti-suit injunctions\n                    in aid of domestic international arbitrations. It would be logical and\n                    consistent with the court’s power under s 12A(2) read with s 12(1)(i) to\n                    issue interim anti-suit injunctions in aid of foreign international arbitrations\n                    to hold that the court has power under the more wide-ranging law in s 4(10) of\n                    the CLA to issue permanent anti-suit injunctions in such cases. Logic alone,\n                    however, may not be a sufficient basis to extend the court’s powers beyond\n                    what is in the IAA to parties who have agreed to arbitrate abroad especially\n                    since the interim orders made should be sufficient to put matters on the right\n                    track. Any such extension of power would have the potential to affect more\n                    situations than simply those concerned with arbitration and therefore policy\n                    considerations would come into play. Since this point was not fully argued and,\n                    in the event, it is not necessary to decide it, I do not express a concluded\n                    opinion.55     On this note, I also agree with Choo Han Teck\n                    J’s warning inPeople’s Insurance Co Ltd v Akai\n                        Pty Ltd[1997] 2 SLR(R) 291 at [12] that Singapore should not be\n                    an international busybody; it is only when strong reasons are present that the\n                    courts would intervene with a permanent anti-suit injunction to support foreign\n                    international arbitration. One possible situation might be where the forum in\n                    which the arbitration is to take place does not provide for effective interim\n                    measures in support of arbitration: see UNCITRAL Report at para 7. Since I do\n                    not have to decide this issue, I shall say no more.Conclusion56     In the premises, I allow the appeal by\n                    Lonstroff and discharge the interim anti-suit injunction. I also dismiss R1\n                    International’s application for a permanent anti-suit injunction. Costs\n                    will follow the event and I will hear the parties in order to fix the amount of\n                    the same.",
        "The dispute": "15     The dispute arose from the second order. On 20\n                    September 2012, Lonstroff emailed R1 Europe, complaining about the smell of the\n                    rubber supplied and alleging that R1 had breached the contract because the goods\n                    emitted a foul smell that made them unsuitable for Lonstroff’s use.\n                    Lonstroff threatened legal proceedings when R1 International refused to offset\n                    payment against the cost of delivery.",
        "Procedural history and issues": "16     Lonstroff commenced legal proceedings against\n                    R1 International in Switzerland on 28 March 2013. On 2 July 2013, R1\n                    International requested the Singapore Commodity Exchange (“SICOM”)\n                    to set up an arbitration tribunal to resolve the dispute. SICOM replied on 17\n                    July 2013 and stated that they would only consider the request when it was\n                    confirmed that Swiss proceedings had been suspended and that both parties agreed\n                    to refer the dispute to it. 17     R1 International then filed these proceedings\n                    on 5 August 2013, to obtain an anti-suit injunction preventing Lonstroff from\n                    continuing legal proceedings in the Commercial Court of Canton of Aargovia in\n                    breach of the SICOM arbitration agreement. An interim order to this effect was\n                    made which Lonstroff then applied to discharge. 18     The ensuing hearing before me dealt with the\n                    applications of both parties since the issues they raised were the same. Three\n                    issues were canvassed during the hearing: (a)     Whether the contract between the\n                        parties provided for disputes to be submitted to\n                    arbitration; (b)     If so,\n                        whether this court can grant a permanent anti-suit injunctions supporting\n                        international arbitration either under s 12A(2) read with s 12(1)(i) of the\n                        International Arbitration Act (Cap 143A, 2002 Rev Ed) (“the\n                        IAA”) or under any other power; and (c)     In either case, when should the power be\n                        exercised.",
        "Did the contract for the second order contain an arbitration\n                clause?": "19     Mr Mohamed, counsel for R1 International,\n                    initially advanced his case on the proposition that the SICOM arbitration\n                    agreement was part of the contract for the second order on the basis of trade\n                    custom. His alternative case was that at least the IRAC term providing for\n                    arbitration in London was part of the contract having been incorporated in it by\n                    a previous course of dealing. Incorporation by trade custom 20     Turning to the plaintiff’s grounds, Mr\n                    Mohamed first submitted that the SICOM arbitration agreement was incorporated by\n                    trade custom. He relied on the evidence of Oh Kian Chew (“Mr Oh”),\n                    the plaintiff’s Head of Global Trading, and that of the president of the\n                    board of directors of R1 Europe, Mr Lorenzo Pietro Paolo Dufour (“Mr\n                    Dufour”). The effect of their evidence is that the rubber trade is a very\n                    mature trade and it is a trade custom for the majority of international rubber\n                    traders to conclude contracts based on IRAC terms. Lonstroff’s immediate\n                    past supplier, Wurfbain BV, had also used IRAC terms in its dealings with\n                    Lonstroff and stipulated for Singapore arbitration. This latter evidence came\n                    from Mr Dufour who exhibited a copy of Wurfain BV’s standard form contract\n                    to his affidavit. 21     CitingLouis Dreyfus\n                        Commodities Asia Pte Ltd v Govind Rubber Limited(Arbitration\n                    Petition No 174 of 2012), Mr Mohamed then requested the court to take judicial\n                    notice of this fact and find the SICOM arbitration agreement incorporated via\n                    trade custom. He citedZheng Yu Shan v Lian Beng Construction\n                        (1988) Pte Ltd[2009] 2 SLR(R) 587 (“Zheng Yu Shan”) at 599 in further support. 22     Mr Lobo, counsel for Lonstroff, objected and\n                    contended that there was insufficient evidence before the court that all\n                    contracts for the sale and purchase of rubber incorporated IRAC terms. Moreover,\n                    all that had been alleged was that Lonstroff had had a previous supplier who\n                    dealt on IRAC terms. This was not supported by evidence. 23     In my view, on the facts of this case,Zheng Yu Shanis not applicable. The court can\n                    only take judicial notice of facts which are clearly established such that they\n                    are beyond reasonable dispute or of specific facts which are capable of being\n                    immediately and accurately shown to exist by authoritative sources. I cannot\n                    take judicial notice of any practice in the rubber trade which is not something\n                    I or any ordinary layman who was not involved in the rubber trade would have\n                    ordinarily been aware. 24     Accordingly, the trade practice has to be\n                    proved. In this, R1 International has failed. The only evidence came from Mr Oh\n                    and Mr Dufour, the latter being R1 International’s agent and therefore not\n                    an independent party. The standard form contract of Wurfbain BV was of little\n                    probative value as it was not shown that Lonstroff bought from Wurfbain BV on\n                    these terms. Mr Schenker’s evidence was that Lonstroff had never been\n                    shown the IRAC terms nor had these been mentioned in the course of negotiations.\n                    In any case, Lonstroff is not an international rubber trader but an end user of\n                    the product so it is believable that it may not be aware of the practice of\n                    international rubber traders even if one exists. 25     Counsel has neither adduced evidence on the\n                    prevalence of IRAC terms in the rubber trade nor shown that the use of IRAC\n                    terms is of an incontrovertible nature. I thus reject his submission and find\n                    that no trade custom has been established. The SICOM arbitration clause cannot\n                    therefore be regarded as having been incorporated in the second order by trade\n                    custom. 26     It is also worth noting that the SICOM\n                    arbitration agreement is not part of the standard IRAC terms. These provide for\n                    the place of arbitration to be settled according to the destination of the goods\n                    and Singapore is not a designated arbitration centre for goods shipped to\n                    London. Thus it would not have been enough for the plaintiff to prove a custom\n                    in the rubber trade to contract on IRAC terms; additionally it would have had to\n                    establish that in the case of shippers from Singapore these terms included the\n                    SICOM arbitration agreement. The plaintiff did not even attempt to do\n                    that. Incorporation via previous course of dealing 27     Alternatively, Mr Mohamed submitted that the\n                    SICOM arbitration agreement was incorporated by the parties’ previous\n                    course of dealing in which IRAC terms had been incorporated into their\n                    contracts. This submission relied on the fact that when the first transaction\n                    between the parties took place in early 2012, R1 International had forwarded its\n                    sale contract referring to the IRAC terms to Lonstroff. In that case, Lonstroff\n                    had not signed the sale contract but it had taken delivery of the goods some    \n                    months thereafter and paid for the same without expressly disputing or rejecting\n                    the sale contract. I note that Lonstroff disputes that the IRAC terms applied to\n                    the first order. 28     Mr Mohamed further submitted that this\n                    approach was supported byInternational Research Corp PLC v\n                        Lufthansa Systems Asia Pacific Pte Ltd and another[2014] 1 SLR\n                    130 (“International Research Corp”),\n                    which held that a valid arbitration agreement can be constituted by reference\n                    where a document containing an arbitration agreement is referred to in a\n                    contract and the reference is such as to make the arbitration agreement part of\n                    the contract. Whether this was satisfactorily incorporated was a matter of\n                    contractual interpretation and the court must have regard to the context and the\n                    objective circumstances surrounding the formation of the contract. For the\n                    purpose of the discussion that follows, I am taking R1 International’s\n                    case at its highest and assuming that the IRAC terms were incorporated into the\n                    first order. 29     Relying onAjwa for Food Industries Co (MIGOP), Egypt v Pacific\n                        Inter-Link Sdn Bhd[2013] 5 MLJ 625 (“Ajwa Food Industries”), which held that an arbitration\n                    agreement need not be signed and was incorporated by the parties’ previous\n                    course of dealing, Mr Mohamed argued that since the parties had entered into a\n                    prior order and in that order the IRAC clause was incorporated, it must have\n                    been aware that the second order contained the same clause with a nomination for\n                    the arbitration to be conducted in Singapore. In this manner, the SICOM\n                    arbitration agreement was incorporated by the parties’ previous course of\n                    dealing. 30     Mr Lobo did not dispute the holding inInternational Research Corpbut submitted\n                    that, on a contextual interpretation, the SICOM arbitration agreement was never\n                    incorporated into the second order since the matter was never discussed by the\n                    parties, the IRAC was never referred to or provided to Lonstroff, and the\n                    pre-signed contract had been sent only after delivery of the order had been\n                    made. 31     Alternatively, the arbitration agreement in\n                    the first contract could not be accepted as having been incorporated by previous\n                    course of dealing since the relationship between the parties was not long\n                    enough. Two orders were insufficient to establish the continuity of acts\n                    required to prove incorporation by previous course of dealing:Trans-Link Exhibition Forwarding Pte Ltd v Wadkin Robinson Asia Pte\n                        Ltd[1996] 1 SLR(R) 424 at [22]. In his further written\n                    submissions, Mr Lobo distinguishedAjwa Food\n                        Industrieson the basis that the parties in that case had a\n                    course of dealing which stretched over a period of twenty years and had\n                    previously referred their trade disputes to arbitration. This was despite their\n                    not having signed the arbitration agreements. 32     I accept Mr Lobo’s argument: one prior\n                    transaction between these parties was, in my view, insufficient to found a\n                    course of dealing between them. There was no continuity in the transactions as\n                    the facts themselves show. Whilst in the first transaction, R1 International was\n                    content to rely on the standard IRAC terms, in the second order it wanted to\n                    modify those by adding the SICOM arbitration agreement. That change in the terms\n                    showed that there was, at the time of the second order, no settled course of\n                    dealing between the parties. 33     Even if there was indeed a previous course of\n                    dealing between the parties, I find that the SICOM clause could not have been\n                    incorporated by reference. InUnited Eng Contractors Pte Ltd\n                        v L & M Concrete Specialists Pte Ltd[1999] 2 SLR(R) 524, G P\n                    Selvam J held that: The general rule is that he is not bound by the terms of offer if he\n                        merely remains silent even if the offer provides that silence will be deemed\n                        to be acceptance. More so if the terms are contained in a document which he\n                        is required to sign to signify his intention to accept.It is even more so, if the parties have already been acting on an oral\n                            contract and one party unilaterally tries to impose onerous terms after\n                            the original oral contract has been acted upon. [Emphasis added in bold]34     Here, I hold that the SICOM arbitration\n                    agreement was not and could not have been incorporated by reference into the\n                    second order. The sales contract dated 16 August 2012 was sent to Lonstroff only\n                    on 31 August 2012 while the order had been delivered on 27 August 2012. The\n                    SICOM arbitration agreement was not incorporated since the contract had been\n                    concluded and performed between both parties before Lonstroff was notified of\n                    the SICOM arbitration agreement. There was also no discussion pertaining to the\n                    incorporation of the SICOM arbitration agreement during negotiations between the\n                    parties. Hence, the SICOM arbitration agreement was not incorporated by\n                    reference.35     Since the SICOM arbitration agreement has not\n                    been incorporated into the second order, I find that there is no basis to grant\n                    a permanent anti-suit injunction or sustain the interim anti-suit\n                    injunction.Whether this court can grant a permanent anti-suit injunctions\n                supporting international arbitration under s 12A(2) read with s 12(1)(i) of the\n                International Arbitration Act36     In light of my holding above, there is\n                    strictly no need to consider the court’s power to grant a permanent\n                    anti-suit injunction in aid of an international arbitration. However, since both\n                    parties dealt with this point extensively in their submissions and since it is a\n                    point that may have significance in future cases, I give my views on it\n                    below.37     Mr Mohamed submitted that this court had the\n                    power to grant permanent injunctions in support of international arbitration. In\n                    its \"Report of the United Nations Commission on International Trade Law\n                    (“UNCITRAL”) on the work of its Thirty-third Session\" at\n                    para 15, UN Doc A/CN.9/WG.II/WP.111 (“the UNCITRAL Report”),\n                    UNCITRAL reported as follows:Availability of provisional and\n                            protective measures (Principle 3)15. It is desirable that the measures be available to both foreigners and\n                        citizens alike and in respect of arbitrations held in both the country of\n                        the court issuing the measure and in a foreign country.38     He contended that s 12A(1)(b) of the IAA gives\n                    effect to this principle, noting that inWSG Nimbus Pte Ltd v\n                        Board of Control for Cricket in Sri Lanka[2008] 1 SLR(R) 1088\n                        (“WSG Nimbus”), Lee Seiu Kin JC\n                    (as he then was) had sustained an interim anti-suit injunction in aid of\n                    domestic international arbitration.39     Mr Mohamed also citedMaldives Airports Co Ltd and another v GMR Male International Airport Pte\n                        Ltd[2013] 2 SLR 449 (“Maldives\n                        Airports”), which held that s 12A(2) and (4) read with s\n                    12(1)(c) to (i) did not confine the court to just grantingAnton Pillerorders orMarevainjunctions; as long as it is necessary for the preservation of evidence or\n                    assets, the court has the power to grant injunctions, including permanent\n                    anti-suit injunctions.40     Whilst I accept Mr Mohamed’s general\n                    proposition on the court’s ability to grant such injunctions, with due\n                    respect, I do not agree that this power to grant permanent anti-suit injunctions\n                    to assist arbitration can be derived from s 12A of the IAA. Principle 3 found in\n                    paragraph 15 of the UNCITRAL Report concerned provisional and protective\n                    measures in respect of both domestic and foreign international arbitrations.\n                    This was discussed in the context of disputes with an international element and\n                    the possibility of developing uniform rules for the provision of interim\n                    measures: see UNCITRAL Report at para 7. I agree with Mr Mohamed that this\n                    principle has been accepted here to the extent that s 12A(2) read with s\n                    12(1)(i) of the IAA provides for interim injunctions in aid of both domestic and\n                    foreign international arbitration. However, I do not think that the s 12(1)(i)\n                    of the IAA extends to permanent anti-suit injunctions. This is essentially a\n                    question of statutory interpretation and interplay between the court’s\n                    injunctive power under s 12A read with s 12 of the IAA and its general\n                    injunctive power under s 4(10) of the Civil Law Act (Cap 43, 1999 Rev Ed)\n                    (“CLA”) and paragraph 14 to the First Schedule of the Supreme\n                    Court of Judicature Act (Cap 322, 2007 Rev Ed).41     The relevant portions of s 12A and s 12 of the\n                    IAA read:12A. —(1) This section shall apply in\n                        relation to an arbitration —(a)    to which this Part\n                            applies; and(b)    irrespective of\n                            whether the place of arbitration is in the territory of\n                            Singapore.(2)    Subject\n                            to subsections (3) to (6), for the purpose of and in\n                            relation to an arbitration referred to in subsection (1), the\n                            High Court or a Judge thereof shall have the same power of making an\n                            order in respect of any of the matters set out\n                                in section 12(1)(c) to (i) as it has for the purpose of and in relation to an\n                            action or a matter in the court.(3)    The High Court or a Judge thereof may refuse to\n                            make an order under subsection (2) if, in the opinion of\n                            the High Court or Judge, the fact that the place of arbitration is\n                            outside Singapore or likely to be outside Singapore when it is\n                            designated or determined makes it inappropriate to make such\n                            order.12.—(1) Without prejudice to the\n                        powers set out in any other provision of this Act and in the Model Law, an\n                        arbitral tribunal shall have powers to make orders or give directions to any\n                        party for —(i)    an interim\n                            injunction or any other interim measure.42     From the above it can be seen that as far as\n                    the power that s 12(l) grants the courts in respect of injunctive relief, this\n                    is a power to be exercised on an interim basis only. This makes eminent sense as\n                    the interim injunction is to be given in aid of the arbitration proceedings\n                    which will make the findings and give the orders that permanently resolve the\n                    dispute.43     This does not mean, however, that the court\n                    has no power to grant a permanent anti-suit injunction in relation to\n                    arbitration proceedings, only that the source of that power is not the IAA. As\n                    stated above, the court’s general injunctive power emanates from s 4(10)\n                    of the CLA. This is the power that the court exercises when it grants a\n                    permanent anti-suit injunction in aid of local court proceedings. There is no\n                    reason why this power cannot be exercised to make permanent anti-suit\n                    injunctions in aid of domestic international arbitration proceedings especially\n                    since under s 12A(2) read with s 12(1)(i) of the IAA and the holding inMaldives Airports, the courts can grant\n                    interim anti-suit injunctions in such situations.44     An argument was made in the United Kingdom\n                    (“UK”) that the power to grant interim injunctions in aid of\n                    arbitration proceedings conferred on the courts by the Arbitration Act 1996 (c\n                    23) (UK) (“the Arbitration Act 1996”) limited or excluded or\n                    qualified the court’s general jurisdiction to order injunctive relief in\n                    cases relating to arbitration that had hitherto been exercised under s 37 of the\n                    Senior Courts Act 1981 (c 54) (UK) (“ the Senior Courts Act\n                    1981”). This argument was roundly rejected: seeAES\n                        Ust-Kamenogorsk Hydropower Plant LLP v Ust-Kamenogorsk Hydropower Plant\n                        JSC[2013] 1 WLR 1889 (“AES\n                        Ust-Kamenogorsk”) at [57]. Instead, the UK Supreme Court\n                    held that clear words would be needed to abrogate the court’s general\n                    jurisdiction to grant anti-suit injunctions. The language of s 4(10) of the CLA\n                    is very similar to that of s 37 of the Senior Courts Act 1981 and I am happy to\n                    adopt the holding inAES Ust-Kamenogorskand hold\n                    that there is no clear language in the IAA which would cut down the breadth and\n                    scope of the court’s powers under s 4(10) of the CLA.45     The facts ofAES\n                        Ust-Kamenogorskare interesting. It involved an owner of\n                    hydroelectric facilities in Kazakhstan which entered into a concession agreement\n                    with the operator of the facilities. The agreement was governed by Kazakh law\n                    but provided for London arbitration under English law. Disputes having arisen\n                    subsequently, the owner started court proceedings in Kazakhstan in breach of the\n                    arbitration agreement. The operator contested those proceedings. However, the\n                    Kazakhstan Supreme Court held that the arbitration clause was contrary to Kazakh\n                    public policy and thus invalid. The owner then started proceedings in the\n                    Kazakhstan Economic Court, which assumed jurisdiction over the matter. The\n                    operator was forced to defend the merits of the claim while denying the Kazakh\n                    court’s jurisdiction – if it did not, it would not be able to appeal\n                    the Kazakhstan Supreme Court’s decision on jurisdiction.46     The operator then sought an interim anti-suit\n                    injunction from the English against Kazakh proceedings started in breach of the\n                    arbitration clause by the owner, even though English arbitration proceedings had\n                    not commenced and it had no settled intention yet to commence arbitration. The\n                    judge at first instance granted a final order, which declared that certain\n                    claims could only be pursued in arbitration and their pursuit in other forums\n                    must be restrained. The owner’s appeal to the English Court of Appeal was\n                    dismissed and the question before the UK Supreme Court was whether an anti-suit\n                    injunction under s 37 of the Senior Courts Act 1981 but not under s 44 of the\n                    Arbitration Act 1996 could be granted.47     The UK Supreme Court held that since the\n                    Arbitration Act 1996 did not apply where proceedings are not starting and have\n                    not started, any injunction granted must be under s 37 of the Senior Courts Act\n                    1981. There was nothing in the Arbitration Act 1996 which abrogated the\n                    court’s general injunctive power and the jurisprudence on anti-suit\n                    injunctions was not to be undermined. It observed that it would be astonishing\n                    if Parliament should without warning have abrogated or precluded the use by the\n                    English Court of its well-established jurisdiction under s 37 in respect of\n                    foreign proceedings threatened in breach of the negative aspect of an\n                    arbitration agreement (by which it meant the negative obligation imposed on a\n                    party to an arbitration agreement not to commence proceedings in any other\n                    forum): seeAES Ust-Kamenogorskat [57]. Therefore, the owner’s appeal was\n                    dismissed.When would it be appropriate to grant a permanent anti-suit\n                injunction?48     The established principles concerning the\n                    grant of permanent anti-suit injunctions can be found inSociete Nationale Industrielle Aerospatiale v Lee Kui Jak[1987]\n                    AC 879. These principles were adopted byMaldives\n                        Airportsin relation to arbitration proceedings. There, the court\n                    affirmed its jurisdiction and ability to protect the parties’ contractual\n                    rights to have disputes resolved by arbitration in a contractually chosen\n                    court.49     This is recognised as part of Singapore law:Halsbury Law of Singaporevol 6(2)\n                    (LexisNexis, 2013) at para 75.133.50     The position is clear for arbitration\n                    agreements providing for international arbitrations in Singapore – where\n                    there is such a clause, the innocent party can seek a permanent anti-suit\n                    injunction under the court’s general power to grant an\n                injunction.Whether Singapore should grant a permanent anti-suit injunction where\n                the arbitration agreement is for a foreign international arbitration51     In the course of proceedings, a question arose\n                    as to whether it would be appropriate to grant a permanent anti-suit injunction\n                    if I found that an arbitration agreement calling for arbitration in London had\n                    been incorporated into the contract.52     I think this point can be dealt with shortly.\n                    The court now has the power under s 12A(2) read with s 12 of the IAA to grant\n                    interim injunctions, even in aid of foreign international arbitration\n                    proceedings. This was not the case under the former s 12(6) of the IAA, which\n                    read:(6)    The High Court or a Judge thereof shall have, for\n                            the purpose of and in relation to an arbitration to which this Part\n                            applies, the same power of making orders in respect of any of the\n                            matters set out in subsection (1) as it has for the purpose of and in\n                            relation to an action or matter in the court.53     To enable the courts to assist foreign\n                    international arbitration, s 12A was then enacted to replace s 12(6) of the IAA.\n                    It empowers the courts to issue interim injunctions in aid of foreign\n                    international arbitration and brings the IAA in line with legislation in other\n                    countries, such as the United Kingdom and New Zealand: seeSingapore Parliamentary Debates,Official\n                        Report(19 October 2009) vol 86 at cols 1633-1634. The present\n                    position is that s 12A(2) read with s 12(1)(i) of the IAA grants to the court\n                    jurisdiction to issue an interim anti-suit injunction in aid of foreign\n                    international arbitration:Maldives Airportsat\n                    [34].54     I have opined above that the courts have\n                    jurisdiction under s 4(10) of the CLA to grant permanent anti-suit injunctions\n                    in aid of domestic international arbitrations. It would be logical and\n                    consistent with the court’s power under s 12A(2) read with s 12(1)(i) to\n                    issue interim anti-suit injunctions in aid of foreign international arbitrations\n                    to hold that the court has power under the more wide-ranging law in s 4(10) of\n                    the CLA to issue permanent anti-suit injunctions in such cases. Logic alone,\n                    however, may not be a sufficient basis to extend the court’s powers beyond\n                    what is in the IAA to parties who have agreed to arbitrate abroad especially\n                    since the interim orders made should be sufficient to put matters on the right\n                    track. Any such extension of power would have the potential to affect more\n                    situations than simply those concerned with arbitration and therefore policy\n                    considerations would come into play. Since this point was not fully argued and,\n                    in the event, it is not necessary to decide it, I do not express a concluded\n                    opinion.55     On this note, I also agree with Choo Han Teck\n                    J’s warning inPeople’s Insurance Co Ltd v Akai\n                        Pty Ltd[1997] 2 SLR(R) 291 at [12] that Singapore should not be\n                    an international busybody; it is only when strong reasons are present that the\n                    courts would intervene with a permanent anti-suit injunction to support foreign\n                    international arbitration. One possible situation might be where the forum in\n                    which the arbitration is to take place does not provide for effective interim\n                    measures in support of arbitration: see UNCITRAL Report at para 7. Since I do\n                    not have to decide this issue, I shall say no more.Conclusion56     In the premises, I allow the appeal by\n                    Lonstroff and discharge the interim anti-suit injunction. I also dismiss R1\n                    International’s application for a permanent anti-suit injunction. Costs\n                    will follow the event and I will hear the parties in order to fix the amount of\n                    the same.",
        "Whether this court can grant a permanent anti-suit injunctions\n                supporting international arbitration under s 12A(2) read with s 12(1)(i) of the\n                International Arbitration Act": "36     In light of my holding above, there is\n                    strictly no need to consider the court’s power to grant a permanent\n                    anti-suit injunction in aid of an international arbitration. However, since both\n                    parties dealt with this point extensively in their submissions and since it is a\n                    point that may have significance in future cases, I give my views on it\n                    below. 37     Mr Mohamed submitted that this court had the\n                    power to grant permanent injunctions in support of international arbitration. In\n                    its \"Report of the United Nations Commission on International Trade Law\n                    (“UNCITRAL”) on the work of its Thirty-third Session\" at\n                    para 15, UN Doc A/CN.9/WG.II/WP.111 (“the UNCITRAL Report”),\n                    UNCITRAL reported as follows: Availability of provisional and\n                            protective measures (Principle 3) 15. It is desirable that the measures be available to both foreigners and\n                        citizens alike and in respect of arbitrations held in both the country of\n                        the court issuing the measure and in a foreign country. 38     He contended that s 12A(1)(b) of the IAA gives\n                    effect to this principle, noting that inWSG Nimbus Pte Ltd v\n                        Board of Control for Cricket in Sri Lanka[2008] 1 SLR(R) 1088\n                        (“WSG Nimbus”), Lee Seiu Kin JC\n                    (as he then was) had sustained an interim anti-suit injunction in aid of\n                    domestic international arbitration. 39     Mr Mohamed also citedMaldives Airports Co Ltd and another v GMR Male International Airport Pte\n                        Ltd[2013] 2 SLR 449 (“Maldives\n                        Airports”), which held that s 12A(2) and (4) read with s\n                    12(1)(c) to (i) did not confine the court to just grantingAnton Pillerorders orMarevainjunctions; as long as it is necessary for the preservation of evidence or\n                    assets, the court has the power to grant injunctions, including permanent\n                    anti-suit injunctions. 40     Whilst I accept Mr Mohamed’s general\n                    proposition on the court’s ability to grant such injunctions, with due\n                    respect, I do not agree that this power to grant permanent anti-suit injunctions\n                    to assist arbitration can be derived from s 12A of the IAA. Principle 3 found in\n                    paragraph 15 of the UNCITRAL Report concerned provisional and protective\n                    measures in respect of both domestic and foreign international arbitrations.\n                    This was discussed in the context of disputes with an international element and\n                    the possibility of developing uniform rules for the provision of interim\n                    measures: see UNCITRAL Report at para 7. I agree with Mr Mohamed that this\n                    principle has been accepted here to the extent that s 12A(2) read with s\n                    12(1)(i) of the IAA provides for interim injunctions in aid of both domestic and\n                    foreign international arbitration. However, I do not think that the s 12(1)(i)\n                    of the IAA extends to permanent anti-suit injunctions. This is essentially a\n                    question of statutory interpretation and interplay between the court’s\n                    injunctive power under s 12A read with s 12 of the IAA and its general\n                    injunctive power under s 4(10) of the Civil Law Act (Cap 43, 1999 Rev Ed)\n                    (“CLA”) and paragraph 14 to the First Schedule of the Supreme\n                    Court of Judicature Act (Cap 322, 2007 Rev Ed). 41     The relevant portions of s 12A and s 12 of the\n                    IAA read: 12A. —(1) This section shall apply in\n                        relation to an arbitration — (a)    to which this Part\n                            applies; and (b)    irrespective of\n                            whether the place of arbitration is in the territory of\n                            Singapore. (2)    Subject\n                            to subsections (3) to (6), for the purpose of and in\n                            relation to an arbitration referred to in subsection (1), the\n                            High Court or a Judge thereof shall have the same power of making an\n                            order in respect of any of the matters set out\n                                in section 12(1)(c) to (i) as it has for the purpose of and in relation to an\n                            action or a matter in the court. (3)    The High Court or a Judge thereof may refuse to\n                            make an order under subsection (2) if, in the opinion of\n                            the High Court or Judge, the fact that the place of arbitration is\n                            outside Singapore or likely to be outside Singapore when it is\n                            designated or determined makes it inappropriate to make such\n                            order. 12.—(1) Without prejudice to the\n                        powers set out in any other provision of this Act and in the Model Law, an\n                        arbitral tribunal shall have powers to make orders or give directions to any\n                        party for — (i)    an interim\n                            injunction or any other interim measure. 42     From the above it can be seen that as far as\n                    the power that s 12(l) grants the courts in respect of injunctive relief, this\n                    is a power to be exercised on an interim basis only. This makes eminent sense as\n                    the interim injunction is to be given in aid of the arbitration proceedings\n                    which will make the findings and give the orders that permanently resolve the\n                    dispute. 43     This does not mean, however, that the court\n                    has no power to grant a permanent anti-suit injunction in relation to\n                    arbitration proceedings, only that the source of that power is not the IAA. As\n                    stated above, the court’s general injunctive power emanates from s 4(10)\n                    of the CLA. This is the power that the court exercises when it grants a\n                    permanent anti-suit injunction in aid of local court proceedings. There is no\n                    reason why this power cannot be exercised to make permanent anti-suit\n                    injunctions in aid of domestic international arbitration proceedings especially\n                    since under s 12A(2) read with s 12(1)(i) of the IAA and the holding inMaldives Airports, the courts can grant\n                    interim anti-suit injunctions in such situations. 44     An argument was made in the United Kingdom\n                    (“UK”) that the power to grant interim injunctions in aid of\n                    arbitration proceedings conferred on the courts by the Arbitration Act 1996 (c\n                    23) (UK) (“the Arbitration Act 1996”) limited or excluded or\n                    qualified the court’s general jurisdiction to order injunctive relief in\n                    cases relating to arbitration that had hitherto been exercised under s 37 of the\n                    Senior Courts Act 1981 (c 54) (UK) (“ the Senior Courts Act\n                    1981”). This argument was roundly rejected: seeAES\n                        Ust-Kamenogorsk Hydropower Plant LLP v Ust-Kamenogorsk Hydropower Plant\n                        JSC[2013] 1 WLR 1889 (“AES\n                        Ust-Kamenogorsk”) at [57]. Instead, the UK Supreme Court\n                    held that clear words would be needed to abrogate the court’s general\n                    jurisdiction to grant anti-suit injunctions. The language of s 4(10) of the CLA\n                    is very similar to that of s 37 of the Senior Courts Act 1981 and I am happy to\n                    adopt the holding inAES Ust-Kamenogorskand hold\n                    that there is no clear language in the IAA which would cut down the breadth and\n                    scope of the court’s powers under s 4(10) of the CLA. 45     The facts ofAES\n                        Ust-Kamenogorskare interesting. It involved an owner of\n                    hydroelectric facilities in Kazakhstan which entered into a concession agreement\n                    with the operator of the facilities. The agreement was governed by Kazakh law\n                    but provided for London arbitration under English law. Disputes having arisen\n                    subsequently, the owner started court proceedings in Kazakhstan in breach of the\n                    arbitration agreement. The operator contested those proceedings. However, the\n                    Kazakhstan Supreme Court held that the arbitration clause was contrary to Kazakh\n                    public policy and thus invalid. The owner then started proceedings in the\n                    Kazakhstan Economic Court, which assumed jurisdiction over the matter. The\n                    operator was forced to defend the merits of the claim while denying the Kazakh\n                    court’s jurisdiction – if it did not, it would not be able to appeal\n                    the Kazakhstan Supreme Court’s decision on jurisdiction. 46     The operator then sought an interim anti-suit\n                    injunction from the English against Kazakh proceedings started in breach of the\n                    arbitration clause by the owner, even though English arbitration proceedings had\n                    not commenced and it had no settled intention yet to commence arbitration. The\n                    judge at first instance granted a final order, which declared that certain\n                    claims could only be pursued in arbitration and their pursuit in other forums\n                    must be restrained. The owner’s appeal to the English Court of Appeal was\n                    dismissed and the question before the UK Supreme Court was whether an anti-suit\n                    injunction under s 37 of the Senior Courts Act 1981 but not under s 44 of the\n                    Arbitration Act 1996 could be granted. 47     The UK Supreme Court held that since the\n                    Arbitration Act 1996 did not apply where proceedings are not starting and have\n                    not started, any injunction granted must be under s 37 of the Senior Courts Act\n                    1981. There was nothing in the Arbitration Act 1996 which abrogated the\n                    court’s general injunctive power and the jurisprudence on anti-suit\n                    injunctions was not to be undermined. It observed that it would be astonishing\n                    if Parliament should without warning have abrogated or precluded the use by the\n                    English Court of its well-established jurisdiction under s 37 in respect of\n                    foreign proceedings threatened in breach of the negative aspect of an\n                    arbitration agreement (by which it meant the negative obligation imposed on a\n                    party to an arbitration agreement not to commence proceedings in any other\n                    forum): seeAES Ust-Kamenogorskat [57]. Therefore, the owner’s appeal was\n                    dismissed.",
        "When would it be appropriate to grant a permanent anti-suit\n                injunction?": "48     The established principles concerning the\n                    grant of permanent anti-suit injunctions can be found inSociete Nationale Industrielle Aerospatiale v Lee Kui Jak[1987]\n                    AC 879. These principles were adopted byMaldives\n                        Airportsin relation to arbitration proceedings. There, the court\n                    affirmed its jurisdiction and ability to protect the parties’ contractual\n                    rights to have disputes resolved by arbitration in a contractually chosen\n                    court. 49     This is recognised as part of Singapore law:Halsbury Law of Singaporevol 6(2)\n                    (LexisNexis, 2013) at para 75.133. 50     The position is clear for arbitration\n                    agreements providing for international arbitrations in Singapore – where\n                    there is such a clause, the innocent party can seek a permanent anti-suit\n                    injunction under the court’s general power to grant an\n                injunction.",
        "Whether Singapore should grant a permanent anti-suit injunction where\n                the arbitration agreement is for a foreign international arbitration": "51     In the course of proceedings, a question arose\n                    as to whether it would be appropriate to grant a permanent anti-suit injunction\n                    if I found that an arbitration agreement calling for arbitration in London had\n                    been incorporated into the contract. 52     I think this point can be dealt with shortly.\n                    The court now has the power under s 12A(2) read with s 12 of the IAA to grant\n                    interim injunctions, even in aid of foreign international arbitration\n                    proceedings. This was not the case under the former s 12(6) of the IAA, which\n                    read: (6)    The High Court or a Judge thereof shall have, for\n                            the purpose of and in relation to an arbitration to which this Part\n                            applies, the same power of making orders in respect of any of the\n                            matters set out in subsection (1) as it has for the purpose of and in\n                            relation to an action or matter in the court. 53     To enable the courts to assist foreign\n                    international arbitration, s 12A was then enacted to replace s 12(6) of the IAA.\n                    It empowers the courts to issue interim injunctions in aid of foreign\n                    international arbitration and brings the IAA in line with legislation in other\n                    countries, such as the United Kingdom and New Zealand: seeSingapore Parliamentary Debates,Official\n                        Report(19 October 2009) vol 86 at cols 1633-1634. The present\n                    position is that s 12A(2) read with s 12(1)(i) of the IAA grants to the court\n                    jurisdiction to issue an interim anti-suit injunction in aid of foreign\n                    international arbitration:Maldives Airportsat\n                    [34]. 54     I have opined above that the courts have\n                    jurisdiction under s 4(10) of the CLA to grant permanent anti-suit injunctions\n                    in aid of domestic international arbitrations. It would be logical and\n                    consistent with the court’s power under s 12A(2) read with s 12(1)(i) to\n                    issue interim anti-suit injunctions in aid of foreign international arbitrations\n                    to hold that the court has power under the more wide-ranging law in s 4(10) of\n                    the CLA to issue permanent anti-suit injunctions in such cases. Logic alone,\n                    however, may not be a sufficient basis to extend the court’s powers beyond\n                    what is in the IAA to parties who have agreed to arbitrate abroad especially\n                    since the interim orders made should be sufficient to put matters on the right\n                    track. Any such extension of power would have the potential to affect more\n                    situations than simply those concerned with arbitration and therefore policy\n                    considerations would come into play. Since this point was not fully argued and,\n                    in the event, it is not necessary to decide it, I do not express a concluded\n                    opinion. 55     On this note, I also agree with Choo Han Teck\n                    J’s warning inPeople’s Insurance Co Ltd v Akai\n                        Pty Ltd[1997] 2 SLR(R) 291 at [12] that Singapore should not be\n                    an international busybody; it is only when strong reasons are present that the\n                    courts would intervene with a permanent anti-suit injunction to support foreign\n                    international arbitration. One possible situation might be where the forum in\n                    which the arbitration is to take place does not provide for effective interim\n                    measures in support of arbitration: see UNCITRAL Report at para 7. Since I do\n                    not have to decide this issue, I shall say no more.",
        "Conclusion": "56     In the premises, I allow the appeal by\n                    Lonstroff and discharge the interim anti-suit injunction. I also dismiss R1\n                    International’s application for a permanent anti-suit injunction. Costs\n                    will follow the event and I will hear the parties in order to fix the amount of\n                    the same."
    }
}