{
    "case_title": "Manharlal Trikamdas Mody and another\n      v\n      Sumikin Bussan International (HK) Limited",
    "ncitation": "[2014] SGHC 123",
    "coram": "George Wei JC",
    "sections": {
        "Introduction": "1       The first plaintiff (“P1”) is the husband of the second plaintiff (“P2”). Both P1 and P2 (hereinafter referred to collectively as “the Plaintiffs”) were adjudged bankrupt in Singapore on 4 February 2005. The Plaintiffs are permanent residents of Singapore although it is undisputed that they are also Indian nationals. The defendant (“the Defendant”) is a company incorporated under the laws of the Hong Kong Special Administrative Region (“the HKSAR”). It is undisputed that the Defendant does not have any presence in Singapore at all. 2       The Defendant, being a judgment creditor of P1, commenced execution proceedings against a property located in Mumbai, India (“the Mumbai property”) about ten years ago. In Originating Summons No 601 of 2013 (“OS 601/2013”), the Plaintiffs are seeking to restrain the Defendant from continuing with the legal proceedings in India against the Plaintiffs and the Official Assignee (“the OA”). Leave to serve out of jurisdiction was also sought by the Plaintiffs in order for OS 601/2013 to be served on the Defendant in the HKSAR. The application before me today is Summons No 5391 of 2013 (“SUM 5391/2013”), which is taken out by the Defendant. In this application, the Defendant seeks to set aside OS 601/2013 and the order granting leave to serve out of jurisdiction (“the service order”), as well as the actual service on the Defendant in the HKSAR. After considering the evidence and the arguments made by all parties, I am allowing the Defendant’s application in SUM 5391/2013. I now give the reasons for my decision.",
        "The facts": "3       The background facts to this longstanding dispute between the Plaintiffs and the Defendant are complex, involving litigation in the HKSAR, India, and now, Singapore. Therefore, there is a need to first set out a brief summary of the main events leading up to the present application (viz, SUM 5391/2013) to set aside OS 601/2013, the service order and the actual service on the Defendant in the HKSAR. Given the multiplicity of proceedings across different jurisdictions, I will consider the legal proceedings in the HKSAR, India and Singapore separately for ease of reference.",
        "Legal proceedings in the HKSAR": "4       Legal proceedings were first commenced in the HKSAR back in 2001 by the Defendant against P1. The Defendant succeeded in obtaining a judgment (“the HKSAR judgment”) against P1 on 31 May 2002 for the sum of US$618,331.26. The application for leave to appeal by P1 was dismissed. 5       In October 2002, the Defendant commenced proceedings to enforce the judgment debt and subsequently obtained a charge over a property in the HKSAR (“the HKSAR property”) belonging to P1. On 14 January 2005, the HKSAR property was sold and the sum of HK$215,528 was paid to the Defendant in partial satisfaction of the judgment debt. It is undisputed that the outstanding judgment debt remains unsatisfied till date. 6       At this juncture, it also bears noting that P2 was not involved in the HKSAR proceedings. Thus, P2 was never a judgment debtor of the Defendant.",
        "Legal proceedings in India": "7       On 26 June 2003, the Defendant commenced execution proceedings (“the execution proceedings”) in the High Court of Bombay against the Mumbai property belonging to P1 (of which P2 also claims an interest in). The execution proceedings were by way of a claim to enforce the HKSAR judgment against P1 in India. 8       Between June 2003 and early 2005, numerous applications and hearings involving the Defendant and the Sheriff of Mumbai (“the Sheriff”) took place before the High Court of Bombay. These resulted in, amongst others, the issuance of a warrant of attachment, a certificate of attachment (returned by the Sheriff) and a warrant of sale in the first half of 2004. 9       While the execution proceedings were ongoing in India, the Plaintiffs were adjudged bankrupt in Singapore on 4 February 2005. At this juncture, I note from across the different documents that have been placed before me that there is a slight discrepancy as to the precise date on which the Plaintiffs were adjudged bankrupt. That date is stated as 9 February 2005 in the Plaintiffs’ written submissions whereas it is stated as 15 February 2005 in the Defendant’s written submissions. In both P1 and P2’s affidavits, 4 February 2005 is referred to as the correct date. After perusing the affidavits and the exhibits attached therein, including the letters that were sent by the OA, I am of the view that the relevant date should be 4 February 2005. In any event, nothing turns on this slight discrepancy as it is undisputed that the bankruptcy orders were granted in February 2005. Further details of the bankruptcy proceedings in Singapore will be provided later in this judgment (see [21]–[22] below). 10     On 14 April 2005, P1 applied to the High Court of Bombay for a stay of the execution proceedings (“the bankruptcy stay action”) that were ongoing in India on the basis that P1 had been adjudged bankrupt in Singapore. The bankruptcy stay action was commenced with the written consent of the OA by way of a letter dated 13 April 2005. Subsequently, P2 applied to intervene in the bankruptcy stay action and to be joined as an interested party on the basis that she was a co-owner of the Mumbai property. P2’s application, however, was eventually dismissed in August 2005 for want of prosecution. 11     With regard to the bankruptcy stay action, a single judge of the High Court of Bombay granted, at first instance, an ad-interim stay of the sale of the Mumbai property on the basis of P1’s bankruptcy in Singapore. The Defendant appealed against that decision. The Division Bench of the High Court of Bombay (“the Division Bench”) allowed the appeal and discharged the ad-interim stay of the sale of the Mumbai property. It was held that the attachment was levied on the Mumbai propertypriorto the grant of the bankruptcy order in Singapore. On that basis, the bankruptcy order could not “affect the right of the attaching creditor of the insolvent”. The Plaintiffs, however, complain that this ruling was obtained by the Defendant’s failure to disclose to the Division Bench that it had filed a proof of debt in the ongoing bankruptcy proceedings in Singapore. In any event, P1 lodged an appeal against the decision of the Division Bench on 29 November 2005 and that appeal was pending before the Supreme Court of India (“the Indian Supreme Court”) as at the date of the hearing before me. 12     It appears that, at about this time in around September 2005, the terms of the sale of the Mumbai property were amended to recognise the rights of ING Bank, the then lessee of the Mumbai property. At first instance, a single judge of the High Court of Bombay permitted the amendment in order to allow ING Bank to remain in possession until it was repaid the rental security deposit. The Defendant appealed against this decision but the appeal was dismissed by the Division Bench on 2 May 2006. The Division Bench held that although ING Bank did not have a lien or a mortgage over the Mumbai property, it had an irrevocable licence to remain in possession until the rental security deposit was returned. P1 subsequently filed an appeal to the Indian Supreme Court on 23 January 2007. 13     Meanwhile, on 14 October 2006, P1 commenced a fresh action (“the reciprocating territory action”) to set aside the execution proceedings on the basis that the HKSAR was not a reciprocating territory as declared by the Indian government. Although a government notification issued in 1968 included Hong Kong as a reciprocating territory, P1 argued that the notification did not, in any event, cover the HKSAR. P1 also objected on the basis that the HKSAR High Court was not a superior court of record. It bears noting that these objections were being raised for the first time. It is further noted that the ground of attack in the reciprocating territory action is quite separate and distinct from that in the bankruptcy stay action, which was based on the bankruptcy order against P1 in Singapore. 14     On 17 February 2009, the Sheriff held an auction of the Mumbai property. This was followed by the Sheriff’s application to the High Court of Bombay in June 2009 for confirmation of the sale.  It was at this stage when P2 filed an application to protect her interest in the Mumbai property. P2’s claim appears to be based on the assertion that the Mumbai property was purchased with investment earnings that had been deposited into the Plaintiffs’ joint bank accounts. Further details of P2’s application were not led in the evidence before me. It is noted that the Defendant’s position is that P2 does not have any interest in the Mumbai property. 15     With regard to the reciprocating territory action, P1’s application was dismissed at first instance by a single judge of the High Court of Bombay on 13 February 2008. P1 appealed and the Division Bench allowed the appeal, holding that the HKSAR judgment was not enforceable in India. As a result, the execution proceedings were discharged by the Division Bench. The Defendant has since lodged an appeal against the decision of the Division Bench and the appeal was pending before the Indian Supreme Court as at the date of the hearing before me. 16     As a result of the Division Bench’s decision to discharge the execution proceedings, the High Court of Bombay, on 12 July 2010, declined to confirm the sale and instead ordered the sale monies to be returned to the buyer. 17     On 4 October 2010, the Indian Supreme Court ordered all parties to maintain the status quo with respect to the Mumbai property pending the hearing of the appeal in relation to the reciprocating territory action. In summary, there are now (as at the date of the hearing before me) three appeals scheduled to be heard jointly by the Indian Supreme Court: (a)     P1’s appeal with respect to the bankruptcy stay action; (b)     P1’s appeal with respect to ING Bank’s application to protect its interest in the rental security deposit; and (c)     the Defendant’s appeal with respect to the reciprocating territory action. 18     Apart from that, it is noted that a gazette notification was issued by the Indian government on 14 July 2012 (“the 2012 Gazette Notification”), retrospectively providing that the HKSAR was a reciprocating territory under the Indian Civil Procedure Code with effect from 1 July 1997. The 2012 Gazette Notification also provides that the HKSAR High Court is a superior court of record. It appears that the validity of the 2012 Gazette Notification and its retrospective operation will be a key issue in the Defendant’s appeal to the Indian Supreme Court with regard to the reciprocating territory action. In fact, it bears noting that the Defendant has since highlighted the 2012 Gazette Notification to the Indian courts by way of a summons for directions on 12 March 2013. To this end, the Plaintiffs appear to take the view that the 2012 Gazette Notification is invalid in so far as it purports to have retrospective effect. 19     Notwithstanding the pending appeals before the Indian Supreme Court, the Plaintiffs commenced a fresh action in India on 22 October 2013 against the Indian government (“the gazette notification action”), seeking to set aside the 2012 Gazette Notification. The Plaintiffs assert that the gazette notification action was commenced in response to the Defendant’s position in relation to the 2012 Gazette Notification. 20     Before turning to consider the legal proceedings in Singapore, it is emphasised that the question as to whether there was a valid execution or enforcement treaty covering the HKSAR at the material time is a matter for the Indian courts to determine. While the Singapore courts can take cognisance of the appeals pending before the Indian Supreme Court and the arguments raised therein, I make no comment on the substantive merits of the appeals before the Indian Supreme Court. In this respect, it is further noted that the parties also agreed during the hearing before me to have the present application decided on the facts as they stood as at the date of this hearing.",
        "Legal proceedings in Singapore": "The bankruptcy proceedings 21     The legal proceedings in Singapore date back to 4 February 2005 when the Plaintiffs were adjudged bankrupt (see [9] above). It will be recalled that as at that date, the Defendant had already commenced the execution proceedings in India against the Mumbai property. 22     The bankruptcy proceedings were not brought by the Defendant. To this end, the Defendant asserts that it was only informed of the Plaintiffs’ bankruptcy on 14 April 2005. This was when P1 commenced the bankruptcy stay action before the High Court of Bombay. Subsequently, the Defendant filed a proof of debt with the OA on 10 June 2005 for the full judgment debt of US$618,331.26. In this respect, the Plaintiffs assert that the Defendant, in filing the proof of debt, failed to disclose the part payment it had received from the sale of the HKSAR property (see [5] above). The Plaintiffs further state that the Defendant also failed to disclose the fact that it had commenced the execution proceedings against the Mumbai property in India. The Defendant denies these assertions and states that, in any event, the proof of debt was subsequently amended in January 2008 to reflect the partial satisfaction of the judgment debt from the sale of the HKSAR property. OS 601/2013 23     On 23 March 2013, the Plaintiffs entered into a Deed of Assignment with the OA in respect of a right to claim against the Defendant. On 5 July 2013, about ten years after the Defendant first commenced the execution proceedings in India, OS 601/2013 was commenced by the Plaintiffs in Singapore. The application was supported by an affidavit affirmed by P1 on 4 July 2013 (“the substantive affidavit”).[note: 1]As mentioned above at [2], in OS 601/2013, the Plaintiffs seek an order to,inter alia, stay all proceedings in India, including the execution proceedings against the Mumbai property. 24     As the Defendant did not have any presence in Singapore, the Plaintiffs made anex parteapplication on 22 July 2013 for leave to serve OS 601/2013 out of jurisdiction. A supporting affidavit affirmed by P1 on 22 July 2013 (“the service affidavit”) was filed,[note: 2]stating that the application was made pursuant to O 11 r 1(p), r 1(r) and/or r 1(s) of the Rules of Court (Cap 322, R 5, 2006 Rev Ed) (“RC”). The order was granted the very next day on 23 July 2013.[note: 3]It is undisputed that the Defendant was not informed of the Plaintiffs’ application and that it was not invited to attend the hearing. 25     After the service order was granted, OS 601/2013 was served on the Defendant in the HKSAR on 22 August 2013.[note: 4]The Defendant entered an appearance on 12 September 2013 and, on 23 September 2013, the Defendant obtained an extension of time for the purposes of disputing the jurisdiction of the Singapore courts. SUM 5391/2013 26     On 14 October 2013, the Defendant proceeded to file SUM 5391/2013. In this application, the Defendant seeks to set aside OS 601/2013, the service order, as well as the actual service on the Defendant in the HKSAR. For the avoidance of doubt, the application before me is SUM 5391/2013, and not OS 601/2013.",
        "The issues": "27     In SUM 5391/2013, the Defendant relies on six broad grounds to support its application to set aside OS 601/2013, the service order, as well as the actual service on the Defendant in the HKSAR. These grounds are set out below in the same sequence as they appear in the Defendant’s submissions: (a)     First, the Defendant submits that the Plaintiffs do not havelocus standito sue in their own names without joining the OA (“thelocus standiobjection”). (b)     Second, the Defendant highlights that OS 601/2013 was commenced pursuant to the Bankruptcy Act (Cap 20, 2009 Rev Ed) (“BA”), thus the provisions in the RC are inapplicable. Accordingly, the service order (as well as the actual service in the HKSAR) should be set aside as being wrongly obtained, given that the Plaintiffs have relied on O 11 of the RC (“the procedural objection”). (c)     Third, the Defendant asserts that the service order (as well as the actual service in the HKSAR) should be set aside as the Plaintiffs failed to make full and frank disclosure of all material facts when applyingex partefor leave to serve out of jurisdiction (“the disclosure objection”). (d)     Fourth, the Defendant asserts that the service order (as well as the actual service in the HKSAR) should be set aside as the Plaintiffs did not establish a good arguable case on the merits of the application (“the merits objection”). (e)     Fifth, the Defendant argues that Singapore is not, in any event, the proper forum “for the hearing of the OS and the reliefs and remedies sought” (“the conflicts objection”). In this regard, the Defendant submits that the Singapore courts should decline jurisdiction on the basis offorum non conveniens. (f)     Sixth, the Defendant relies onres judicatato set aside OS 601/2013 and the service order (“theres judicataobjection”). This includes cause of action estoppel, issue estoppel and the extended doctrine ofres judicata. 28     These six objections will be covered in turn. However, it is preliminarily observed that these six objections fall into two broad categories. First, there are the objections which relate directly to the issue of whether OS 601/2013 is maintainable at all. This concerns the prayer to set OS 601/2013 aside based on a lack oflocus standito bring the proceedings andres judicata. Following the sequence adopted above, however, theres judicataobjection will be discussed towards the end of this judgment. Second, there are the objections which relate to the grant of leave to serve OS 601/2013 out of jurisdiction. A broad range of grounds were relied upon in this category, including the non-disclosure of material facts, the absence of a good arguable case andforum non conveniens. To be clear, in the event that OS 601/2013 is set aside on the grounds set out in the first category, there will strictly be no need to consider the issues arising from the second category. Nevertheless, for the sake of completeness, I will still proceed to address the issues regarding the grounds within the second category even if the Defendant succeeds on the grounds within the first category.",
        "Thelocus standiobjection": "29     Thelocus standiobjection is an attack on the Plaintiffs’ right to commence the proceedings in OS 601/2013 against the Defendant. The fundamental basis of this objection is s 76(1)(a) of the BA, which provides that on the making of the bankruptcy order, the property of the bankrupt shall “vest in the OA without any further conveyance, assignment or transfer”. In this respect, “property” is defined in s 2(1) of the BA as including: ... money, goods,things in action, land and every description of propertywherever situatedand also obligations and every description of interest, whether present or future or vested or contingent, arising out of or incidental to, property ... [emphasis added] When read together, the foregoing provisions yield the understanding that the vesting principle in s 76(1)(a) of the BA applies to all propertywherever situated. This will include real property situated outside of Singapore, such as in India. Section 76(1)(c) of the BA goes on to provide that on the making of a bankruptcy order: [U]nless otherwise provided by this Act — ... (ii) no action or proceedings shall be proceeded with or commenced against the bankrupt in respect of that debt, except by leave of the court and in accordance with such terms as the court may impose. 30     Under s 105(1) of the BA, a creditor shall not be “entitled to retain the benefit of the execution or attachment against the OA unless he has completed the execution or attachment before the date of the bankruptcy order”. In this regard, it is notable that these statutory provisions only apply to the affairs of a bankrupt’s estatesubsequentto the adjudication of his bankruptcy. 31     Section 111 of the BA sets out the powers granted to the OA in respect of the property comprised in the bankrupt’s estate. It provides,inter alia, that the OA may sell the property. Section 112 goes on to state that the OA’s powers include the right to bring, institute or defend any action or legal proceedings relating to the property of the bankrupt. These are powers conferred on the OA. It follows that the OA could have decided in the present case to bring proceedings in its name against the Defendant for an order under ss 76(1)(c) and 105 of the BA to restrain the execution proceedings in India. For reasons better known to the OA and the relevant parties, this did not happen. Instead, the Plaintiffs have commenced OS 601/2013 in their own names on the basis that an assignment had been obtained from the OA (see [23] above).",
        "Whether the rights under ss 76 and 105 of the BA are assignable": "32     In essence, the Defendant asserts that the statutory rights embodied in both ss 76(1)(c) and 105 of the BA are personal to the OA. To this extent, they are non-assignable at law and the Plaintiffs do not have the requisitelocus standito commence OS 601/2013 against the Defendant. The crucial question, therefore, is whether the rights conferred by ss 76(1)(c) and 105 in the BA can be assigned to the Plaintiffs by the OA such that the Plaintiffs are able to bring the actionin their own names. In determining this issue, there is also a need to consider the extent and circumstances under which an assignment of those rights can be executed. 33     In support of their proposition, the Defendant relies on an English commentary and a number of English decisions under the Insolvency Act 1986 (c 45) (UK) (“UK Insolvency Act 1986”) to draw a distinction between property (including choses in action) which belonged to the bankruptpriorto the making of the bankruptcy order and those which only aroseafterbankruptcy pursuant to the statutory provisions in the BA. It is the Defendant’s position that while the OA can assign choses in action which belonged to the bankrupt prior to bankruptcy, there is no power to assign rights which arise after bankruptcy pursuant to the statutory powers under the BA. 34     To this end, the Defendant refers to Anthony Guest,Guest on the Law of Assignment(Sweet & Maxwell, 1st Ed, 2012) (“Guest on the Law of Assignment”) at para 4–30, where the learned author begins by explaining that under the UK Insolvency Act 1986, a right of action which has become vested in the trustee as part of the bankrupt’s estate can be assigned and sold by the trustee for the benefit of the creditors of the bankrupt. That said, the learned author goes on to assert at para 4–31 that this exemption from the law on maintenance and champerty does not extend to cover the assignment of a right of actionconferred exclusively on the liquidator. Therefore, it was said that the assigned right must be one which had arisen and which could have been pursued by the company at the time of the liquidation. A distinction must, accordingly, be drawn between the property of the company and the statutory powers conferred on the liquidator. English decisions cited in support of this proposition includeIn re Oasis Merchandising Services Ltd[1998] Ch 170 (“Re Oasis”) andRe Ayala Holdings Ltd (No. 2)[1996] 1 BCLC 467 (“Re Ayala Holdings”). 35     In particular, the principles inRe Oasishave been applied locally by the Court of Appeal inNeo Corp Pte Ltd (in liquidation) v Neocorp Innovations Pte Ltd[2006] 2 SLR(R) 717 (“Neo Corp”).  InNeo Corp, the company in question was placed under judicial management. The judicial managers applied under s 227T of the Companies Act (Cap 50, 2006 Rev Ed) (“CA”) to have a floating charge created by the company in favour of the defendant creditor set aside as an unfair preference. Subsequently, a winding up order was granted which,inter alia, authorised the liquidators to continue with any legal action commenced by the judicial managers. Thereafter, the defendant applied to set aside the order authorising the liquidators to continue the action on the basis that the company was no longer under judicial management. 36     At first instance, the High Court held that s 227T of the CA did not, as a matter of construction, allow anyone other than the judicial managers to invoke the powers under that provision (seeNeo Corp Pte Ltd (under judicial management) v Neocorp Innovations Pte Ltd and another application[2005] 4 SLR(R) 681). On this basis, the order authorising the liquidators to continue with the action commenced by the judicial managers was set aside. Before the Court of Appeal, Chao Hick Tin JA framed the legal issue as whether “an action instituted by the judicial managers of a company to challenge a transaction entered into by the company with a third party on the ground of unfair preference ... may be continued by the liquidators when judicial management of the company is followed by a winding up order before the action is adjudicated upon” (at [1]). 37     In upholding the decision of the High Court, the Court of Appeal essentially undertook an exercise of statutory interpretation in the light of the reasoning adopted inRe Oasis. In particular, the Court of Appeal emphasised that the words “be void as against the judicial manager” in s 227T of the CA indicates that the statutory right is personal to the judicial managers. To that end, the Court of Appeal referred toRe Oasisand made the following observations at [24]: … Peter Gibson LJ, delivering the judgment of the Court of Appeal, said (at 181) that money recovered by the liquidators from fraudulently preferred creditors did not become part of the general assets of the company. Thus,by analogy, the right of action conferred upon the judicial manager under s 227T is a rightpersonalto the judicial manager and this right does not form part of the assets of the company which upon its winding up will be vested in the liquidator. [emphasis added] 38     Apart fromNeo Corp, the Defendant also referred to the later Court of Appeal decision ofStandard Chartered Bank v Loh Chong Yong Thomas[2010] 2 SLR 569 (“Standard Chartered”) which involved personal bankruptcy. In that case, the respondent lawyer had been made bankrupt by a creditor of his law firm. Subsequently, the respondent commenced an action in the District Court in contract and tort against the appellant bank for breach of duty in respect of two personal bank accounts maintained by the respondent. The action was brought in the respondent’s own name. The OA’s sanction was not obtained prior to the commencement of the action but only some six months after the writ of summons was first filed. At no time did the respondent seek or obtain an assignment of the choses in action from the OA. 39     The District Court and the High Court (on appeal) held that the respondent hadlocus standito maintain the suit under s 131(1)(a) of the BA on the basis that the respondent would be competent to sue in his own name upon obtaining the sanction of the OA (seeLoh Chong Yong Thomas v Standard Chartered Bank[2007] SGDC 82). In other words, there was no need for a further assignment of the specific choses in action once sanction of the OA had been obtained. 40     Four issues were raised before the Court of Appeal, three of which are relevant to the present case. The first was whether the choses in action were properly to be regarded as property that vested in the OA upon the respondent’s bankruptcy. If the answer was yes, the second issue was whether an assignment of the choses in action was necessary before the respondent could commence the action. The third issue was whether the sanction of the OA was, in any event, necessary before any suit was commenced. 41     On the first issue, it has been noted above that s 2(1) of the BA defines “property” as including “all things in action … whether present or future or vested or contingent, arising out of or incidental to … property”. In this regard, V K Rajah JA, in delivering the judgment of the court, held at [12] that the definition was broad enough to include all choses of action in relation to property. Choses in action which did not arise out of or which were not incidental to property, such as a claim for injury to reputation in a defamation suit did not, however, fall within the scope of the definition of property in s 2(1). 42     Given that s 76(1)(a)  provides that the property of the bankrupt vests in the OA automatically on bankruptcy without the need for any further conveyance, assignment or transfer, the second issue was whether, given that the property had vested in the OA, it was necessary for the OA to assign the property back to the bankrupt before the bankrupt could sue on that property in his own name. It will be recalled that inStandard Chartered, no assignment of the specific choses in action had been obtained. Instead, the bankrupt had relied on the subsequent sanction of the OA as the basis of his right to sue in his own name. For this reason, Rajah JA commented at [16] that the issue was hypothetical and further noted that in any event, it was not the practice of the OA to assign property back to the bankrupt such that the bankrupt could pursue a claim in respect of that property. It was observed that an assignment of the property back to the bankrupt would necessarily require considerable administrative oversight by the OA and be subject to conditions to safeguard the interests of creditors. Therefore, in most cases, it would likely be far simpler and more convenient for the OA to sue on the property. 43     That said, Rajah JA explained at [15] that: … The guiding principle here is that, where property of a bankrupt has vested in the OA upon bankruptcy, the bankrupt no longer has any standing to commence any proceedingsin his own namein respect of such property. He may do so (ie, sue in his own name vis-à-vis property vested in the OA)only ifthe OA assigns the property in question back to him (upon such assignment, the property re-vests in the bankrupt, which is why he can then bring an action in his own nameaproposthat property).In contrast, if the OA does not assign the property in question back to the bankrupt (and merely grants the sanction required by s 131(1)(a)), the bankrupt cannot sue in his own name in respect of that property, but must instead suein the OA’s name. [emphasis in original] 44     This guiding principle laid down by Rajah JA lies at the heart of the Defendant’s attack on the Plaintiffs’ standing to bring OS 601/2013 in their own names. Indeed, the importance of this guiding principle is further underscored by the holding inStandard Charteredthat it remains applicable even where the special provisions relating to the sanction of the OA were applicable. While the provisions set out in s 131(1)(a) of the BA are not directly relevant to the present case, a brief summary will be helpful in appreciating the importance of the guiding principle. 45     Section 131(1)(a) of the BA states that an undischarged bankrupt is “incompetent to maintain any action, other than an action for damages in respect of an injury to his person, without the previous sanction of the OA”. The consequences of a breach of s 131(1)(a) are serious – not only is the bankrupt incompetent to maintain the proceedings, he also commits a criminal offence under s 131(2), punishable by a fine not exceeding $10,000 or to imprisonment for a term not exceeding 2 years or to both. 46     The origin and history behind s 131(1)(a) of BA is set out in detail inStandard Charteredat [19]–[27] and will not be traversed again in this judgment. What is important is the holding of the Court of Appeal at [28] that s 131(1)(a) was introduced to “give the OA full control of the administration of a bankrupt’s estate for the benefit of creditors”. That being so, the Court of Appeal stated that the intention of the legislature must have been to exclude the retrospective operation of any sanction obtained by the bankrupt. What was required, and had to be strictly adhered to, was the requirement that sanction be obtainedpriorto the commencement of any action. 47     What is even more significant, however, is the holding of the Court of Appeal on the relationship between s 131(1)(a) of the BA and the guiding principle referred to earlier. The question posed inStandard Charteredwas whether an assignment was still required where the sanction of the OA had been obtained prior to commencement of proceedings. Rajah JA at [30] held that s 131(1)(a) implied that it is only in cases where the bankrupt would be competent to maintain an action despite the bankruptcy that he required the prior sanction of the OA. To put the matter the other way round, the effect of s 131(1)(a) was to restrict the competence of a bankrupt to maintain any action (other than an action for damages in respect of injury to his person). 48     The actions which the bankrupt retained competency over were described at [30] ofStandard Charteredas actions which “will not, for practical reasons, be actions relating to property which vests in the OA upon bankruptcy”. In other words, they were actions relating to property which didnotvest in the OA upon bankruptcy. In such cases, while the action remained vested in the bankrupt, the bankrupt was disabled from commencing the action (ie, lack of competence) without the prior sanction of the OA pursuant to s 131(1)(a) of the BA. This result was said to be consistent with the object of the legislation which was to,inter alia, disable some of a bankrupt’s civil rights and ensure that the OA has conduct and oversight of the bankrupt’s property and affairs. 49     The Court of Appeal then turned to address the question of whether an assignment of the property back to the bankrupt was still necessary where the sanction of the OA had been obtained. A number of Malaysian decisions were cited, includingGoh Eng Hwa v M/S Laksamana Realty Sdn Bhd[2004] 3 MLJ 97 (“Goh Eng Hwa”), which stands for the proposition that where sanction from the OA had been obtained, a further assignment of the property would not be required. While the Court of Appeal inStandard Charteredagreed with the conclusion arrived at inGoh Eng Hwa, the reasoning adopted was quite different. In this regard, the Malaysian Court of Appeal inGoh Eng Hwatook the view that the assignment was simply not necessary where prior sanction had been obtained. The Singapore Court of Appeal, however, held that the reason was because s 131(1)(a) is necessarily concerned with actions in respect of property that didnotvest in the OA upon bankruptcy. In such cases, no assignment is necessary because the property remains vested in the bankrupt person. Indeed, with respect, I would add that in such a case, an assignment of the property to the bankrupt by the OA is not even possible ­-­ the OA has nothing to assign back in respect of the chose in action. 50     For completeness, it is noted that the Court of Appeal inStandard Charteredwent on to hold that an action in defamation was not an action for damages in respect of an injury to his person. On this basis, s 131(1)(a) applied such that it was still necessary for the bankrupt to obtain the prior sanction of the OA. 51     Apart from the arguments explored above, the Defendant also highlighted that theReport of the Insolvency Law Review Committee(2013) (“the ILRC Report 2013”) at p 73 agreed that actions created under the corporate insolvency legislation and statutorily vested in the office of the liquidator should not be assigned but should remain vested in the liquidator. While the report was commissioned by the Ministry of Law and is of some persuasive value, the views of the committee are not binding on the courts. Following the approach taken inNeo Corpwhich appliedRe Oasis, the key question is whether, on a proper construction of ss 76(1)(c) and 105 of the BA, the rights of the OA are personal and thus incapable of assignment at law. 52     In support of the proposition that the rights are personal to the OA, the Defendant also refers to s 112 of the BA, which as set out above at [31], states that the OA’s powers include the right to bring, institute or defend any action or legal proceedings relating to the property of the bankrupt. These are powers which have been expressly conferred on the OA by way of statute. The substantive grounds of the application for a stay would thus be found in ss 76(1)(c) and 105 of the BA. 53     Nevertheless, there is nothing in the wording of ss 76(1)(c), 105 and 112 of the BA which directly suggests that the power to bring proceedings for a stay are intended to be assignable. Indeed, while the Indian enforcement proceedings (for which a stay is now sought) were begun before the bankruptcy of the Plaintiffs, the substantive provisions under which the right to seek a stay is said to flow were only applicable after the order for bankruptcy was made. 54     After due consideration of the law in this area, I am of the view that the statutory rights under ss 76(1)(c) and 105 of the BA are indeed personal to the OA and are thus not capable of assignment at law. Notwithstanding that the analysis inRe Oasisas applied inNeo Corpwas made in the context of corporate insolvency, in my judgment, the reasoning adopted there applies with equal force in cases of personal bankruptcy. In fact, the wording in s 227T of the CA makes specific references to the statutory provisions in the BA: Subject to this Act and such modifications as may be prescribed, a settlement, a conveyance or transfer of property, a charge on property, a payment made or an obligation incurred by a company which if it had been made or incurred by a natural person wouldin the event of his becoming a bankrupt be void as against the OA under section 98, 99 or 103 of the Bankruptcy Act (Cap. 20) (read with sections 100, 101 and 102 thereof)shall, in the event of the company being placed under judicial management, be void as against the judicial manager. [emphasis added] 55     Further, it is noted that there are a few provisions in the BA which expressly state that the application isto be made by the OA,eg, s 98(1) for undervalue transactions, s 99(1) for unfair preferences and s 103(2) for extortionate credit transactions. In my judgment, little turns on the difference in wording between an application which is “to be made by the OA” and an action or outcome which is “void as against the OA”. On the basis of the reasoning inNeo CorpandRe Oasis, I am of the view that the rights arising out of ss 76 and 105 of the BA arepersonalto the OA and are thus not capable of assignment at law. 56     For the reasons above, even if there had been an assignment from the OA to the Plaintiffs of the right to sue under ss 76(1)(c) and 105 of the BA, that assignment is ineffective and has no legal effect. It follows that OS 601/2013 is set aside as the Plaintiffs do not have the requisitelocus standito commence the action. I note that the Defendant has also raised a couple of other issues in relation to thelocus standiobjection and the terms of the assignment. Given the finding that the rights under ss 76(1)(c) and 105 of the BA are not, in any event, capable of assignment at law, in the light of the absence of full arguments by both parties, I will only make a couple of passing observations on the other issues raised by the Defendant.",
        "Whether there was a valid assignment": "57     In the present case, the Defendant also complains that the Plaintiffs were not forthcoming in disclosing the Deed of Assignment that gave them the right to commence OS 601/2013. On 30 September 2013, the OA confirmed with the Plaintiffs’ law firm that a Deed of Assignment dated 21 March 2013 had been entered into. In that letter, the Deed of Assignment was said to have “assigned the action concerning the property to your clients [ie, the Plaintiffs]”. It appears that a heavily redacted version of the Deed of Assignment was sent to the Defendant on 7 October 2013. Subsequently, in P1’s affidavit dated 15 November 2013, a slightly less heavily redacted version of the Deed of Assignment was attached as an exhibit. 58     According to the Defendant, a complete unredacted copy of the Deed of Assignment was only made available to the Defendant when the OA stepped in and disclosed the entire document. Quite apart from the Defendant’s arguments on the Deed of Assignment and the question oflocus standi, as will be seen below, the Plaintiffs’ reluctance to disclose the unredacted Deed of Assignment, especially in relation to theex parteapplication for leave to serve out of jurisdiction, is in any case a relevant factor in determining whether the service order should be set aside. 59     Clause 1.1 of the Deed of Assignment defined the assigned property as follows: ... all of the Assignor’s rights, title and interest at law or in equity to claim against the Defendant(s) in respect of such property as may be comprised in the estates in bankruptcy of the Assignees. The assignor was identified as the OA while the assignees were named as the Plaintiffs. The Defendant referred to in the Deed of Assignment is the Defendant named in OS 601/2013. 60     This is followed by cl 2 of the Deed of Assignment, which states that: For the unequivocal, unreserved and unanimous consent of the Assignees received (the receipt of which the Assignor hereby acknowledges): (a) The Assignor hereby assigns absolutely to the Assignee, all its rights in the Assigned Property; and (b) The Assignees assume and agree to assume the obligations of the Assignor in connection with the Assigned Property; with effect from the date of this Deed. 61     Leaving aside the Defendant’s complaint regarding the redaction of the Deed of Assignment, the Defendant also raised the objection that the Deed of Assignment did not assign thepropertyback to the Plaintiffs. Instead, what was assigned to the Plaintiffs were the OA’s rights, title and interest at law or in equity toclaimagainst the Defendant in respect of such property as may be comprised in the estates in bankruptcy of the Plaintiffs. 62     At this juncture, it bears noting that the Deed of Assignment does not, given the definition of “assigned property”, purport to assign any of thetangibleproperty, including the Mumbai Property, back to the Plaintiffs. All that was assigned pursuant to the Deed of Assignment was the right of the OA to take action in respect of that property. The limitation of the assignment in this manner is understandable. If the OA’s intention was to re-vest such property in the Plaintiffs, clear and detailed terms, conditions and safeguards would have been necessary to protect the interests of the creditors in general. 63     In this respect, the Defendant argues that the assignment is invalid in so far as it only purports to assign theright to claimin respect of the property, and not theproperty itself. The Defendant further asserts that the right to aremedyby which thatchose in actioncan be enforced cannot be sold or assigned separately from the right to which it relates. In support of this proposition, the Defendant cites the English decision ofIn Re GP Aviation Group International Ltd (in liquidation)[2014] 1 WLR 166 (“Re GP”). 64     InRe GP, the revenue authority had raised discovery assessments against the company for corporation tax alleged to have arisen as a result of the sale of the company’s assets. At the request of the former directors of the company, the liquidator caused the company to serve a notice of appeal against the discovery assessments. The liquidator subsequently informed the former directors, who were being sued in ongoing misfeasance proceedings, that they would be liable to account to the company for the debts incurred in relation to the discovery assessments in the event that the appeal was unsuccessful. The former directors then asked the liquidator to assign the company’s right to appeal against the discovery assessments to them. The liquidator proceeded to seek the court’s direction as to whether the company’s right of appeal constituted “property” such that it was capable of assignment. 65     It was held that a “bare right of appeal” against what would otherwise be a liability did not fall within the scope of “property” in the UK Insolvency Act 1986. Therefore, to assign the right of appeal would be akin to assigning a remedy without the right in respect of which the remedy existed and this would be invalid at law. In arriving at this conclusion, Pelling J made the following observations at [27]–[28]: First, the classical definition of a chose in action is that identified by Channell J inTorkington v Magee... – that it is an expression used to describe “... all personal rights of property which can only be claimed or enforced by action and not by taking physical possession”. A bare right to appeal against what would otherwise be a liability does not satisfy this definition. It is not a right that must be claimed by action. It is a right that is unconditionally conferred on the company (in this case) by operation of statute. It is not a property right that can only be enforced by action. That is a cause of action and a bare right to appeal does not fall within the scope of that concept either. Secondly, the authorities maintain a distinction between a chose and the remedies available for its enforcement. As I have said already, the right to a remedy is an incident of the ownership of the chose. The remedy is not something that is capable of being sold or assigned separately from the right to which it relates. … 66     As mentioned above, I am of the view that it would be more appropriate to leave this issue open in the light of the absence of full arguments by both parties. Nevertheless, I acknowledge that the Deed of Assignment in the present case does not appear to relate to property which can be properly regarded as achose in action. In the House of Lords decision ofInvestors Compensation Scheme Ltd v West Bromwich Building Society[1998] 1 WLR 896, Lord Hoffman observed at 915C that “a chose in action is property, something capable of being turned into money”. In the present case, the rights purported to be assigned by the OA to the Plaintiffs arose solely by operation of statute. In this respect, the rights conferred on the OA pursuant to ss 76(1)(c) and 105 of the BA do not appear to fall within the scope of a chose in action which is capable of assignment. They amount to bare rights to make certain claims and to obtain the necessary remedies, such as a stay in proceedings, for the sole purpose of administering the bankruptcy. In my view, these are not rights that can be turned into money in and of themselves. They are not likely to fall within the scope of “property” as defined in the BA. It is noted that the observations made here are, in fact, consistent with the view expressed earlier that the powers conferred by ss 76(1)(c) and 105 of the BA arepersonalto the OA. 67     Apart from the issue as to whether the assignment was valid, the Defendant also raised the argument that the prayers sought by the Plaintiffs in OS 601/2013 are much broader than that granted under the Deed of Assignment. Having already found that the rights purported to be assigned are not capable of assignment at law, it would not be necessary for me to make any further observations on this issue. The Plaintiffs donothave the requisitelocus standito commence or maintain the action in OS 601/2013. Although this would be sufficient to dispose of this application entirely, for the sake of completeness, I now turn to consider the remaining objections which seek to attack the grant of leave to serve out of jurisdiction. This will be followed by a discussion of the issues pertaining tores judicatatowards the end of this judgment.",
        "The procedural objection": "68     In brief, the procedural objection is based on the Defendant’s assertion that the provisions in the RC are not applicable as OS 601/2013 was commenced under the BA. In this regard, the Defendant has referred to O 1 r 2(2) of the RC, which provides that the RC shall not apply to bankruptcy proceedings commenced under the BA. Accordingly, the Defendant argues that O 11 of the RC was not applicable to the Plaintiffs’ application for leave to serve OS 601/2013 out of jurisdiction. 69     Nonetheless, the Defendant has, quite properly, drawn my attention to s 11 of the BA which provides that: In any matter of practice or procedure for whichno specific provision has been made by this Act or the rules, the procedure and practice for the time being in use or in force in the Supreme Court, shall, as nearly as may be, be followed and adopted. [emphasis added] In this respect, the question is whether the BA and the Bankruptcy Rules (Cap 20, R 1, 2006 Rev Ed) (“BR”) provide a procedure for service of OS 601/2013 out of jurisdiction. 70     To this end, it is noted that r 38 of the BR states that: Where the debtor is not in Singapore, the court may order service on him of the bankruptcy application, the bankruptcy order or any other ordermade against him, or of any summons issuedfor his attendance, to be effected within such time and in such manner as the court thinks fit. [emphasis added] It is, however, clear that r 38 of the BR applies to service of documents out of jurisdictionagainst the debtor. It does not deal with the situation where the OA (or its assignee) has commenced proceedings under ss 76(1)(c) and 105 of the BA in order to restrain acreditorfrom continuing with proceedings against the bankrupt, as in the present case. 71     InRe Rasmachayana Sulistyo (alias Chang Whe Ming), ex parte The Hongkong and Shanghai Banking Corp Ltd and other appeals[2005] 1 SLR(R) 483 (“Re Rasmachayana Sulistyo”), V K Rajah J (as he then was) had to deal with a similar issue of whether s 11 of the BA could be invoked to supplement the rules in the BR. In that case, the petitioning creditor had obtained judgments against the three judgment debtors who were foreign nationals. When the debtors failed to comply with the terms of the judgment, the petitioning creditor initiated bankruptcy proceedings against them. Prior to the filing of the bankruptcy petitions, the petitioning creditor made multiple attempts to effect personal service of the requisite statutory demands on the debtors. Three different modes of service were relied on by the petitioning creditor in relation to the service of the statutory demands. The bankruptcy petition was, however, only served on the debtors’ nominated forwarding agent. In doing so, the petitioning creditor relied on a clause in the guarantee where it was stated that the debtors irrevocably appointed the nominated forwarding agent to receive service of process for the debtors in any proceedings in Singapore. The learned Assistant Registrar rejected the argument that the bankruptcy petitions were not properly served. In arriving at this decision, the Assistant Registrar held that although O 1 r 2(4) of the RCex facieprecluded the general application of the RC to bankruptcy proceedings, with reference to s 11 of the BA, the petitioning creditor could still apply O 62 r 3(2) of the RC in determining how personal service might be effected since the BR was silent on this issue. 72     When the matter came before Rajah J, although the appeals were eventually dismissed, it was held that the Assistant Registrar fell into error by importing wholesale the provisions of the RC into the service of court process aspect of bankruptcy procedure. In this regard, Rajah J made the following observations at [5]: ... Contrary to what [the AR] has suggested, specific provision has indeed been made in the BR to address the issue of service of thevarious bankruptcy processes: rr 96 and 109 of the BR expressly and specifically deal with the issue of service ofstatutory demands and bankruptcy petitions. ... [emphasis added] It was further held at [6] that s 11 of the BA should only be resorted to in instances where “lacunae in procedural issues exist,ie, whereno specific provisionhas been made” [emphasis in original]. To this end, s 11 of the BA should not be interpreted as a statutory charter to whimsically fill in any perceived gaps or supposed interstices existing in the BR. A distinction would have to be drawn between circumstances where there is “no specific provision” and that where there is merely a perception of incomplete or inadequate provisions dealing with a particular aspect of procedure. In this respect, s 11 would only be applicable in the former situation where there is an absence ofanyrelevant provision(s). 73     Returning to the facts of the present case, the issue then is whether there is “no specific provision” in the BA or the BR governing the service out of jurisdiction with regard to claims made under ss 76(1)(c) and 105 of the BA. At the outset, I note that the facts in the present case are rather different from that inRe Rasmachayana Sulistyo.In the latter case, the issue was in relation to the service ofbankruptcy processes, such as statutory demands and bankruptcy petitions. This can be contrasted with the present case where the issue concerns the OA (or its assignee) bringing claims under ss 76(1)(c) and 105 of the BA. 74     In this regard, it is observed that Part VI of the BR deals with the following: (a)     statutory demand; (b)     creditor’s bankruptcy application; (c)     service of creditor’s bankruptcy application; (d)     hearing of creditor’s bankruptcy application; (e)     actions to follow upon making of bankruptcy order on creditor’s bankruptcy application; (f)     debtor’s bankruptcy application; (g)     actions to follow upon making of bankruptcy order on debtor’s bankruptcy application; and (h)     interim receiver. In so far as the actions to follow the making of a bankruptcy order are concerned, reference is only made to: (i)     the settlement and contents of the bankruptcy order; (j)     the service of the bankruptcy order; (k)     the gazetting of the bankruptcy order; (l)     the advertisement of the bankruptcy order; (m)     the stay of the bankruptcy order; and (n)     the amendment of title of proceedings. 75     Therefore, it can be seen that the bankruptcy procedures as dealt with in Part VI of the BR appear to be concerned with the proceedings brought in connection with the application and the making of the bankruptcy orderagainst the debtor. On the other hand, the BA and BR appear to be silent on the commencement of proceedingsby the OA against creditors and other parties. In this regard, it bears noting that the OA has the power under s 112(b) of the BA to institute and defend proceedings relating to the property of the bankrupt. Where those proceedings are brought, then unless there are specific provisions in the BA or the BR concerning such proceedings, it must follow that reference to the RC is permissible on the basis of s 11 of the BA. Therefore, I find that the Plaintiffs’ reliance on O 11 of the RC in connection with the application for leave to serve OS 601/2013 on the Defendant out of jurisdiction was proper due to the absence of any specific provision in the BA or the BR governing such a procedure.",
        "The disclosure objection": "76     The general principles governing the grant of leave for service out of jurisdiction are well settled. InSiemens AG v Holdrich Investment Ltd[2010] 3 SLR 1007 (“Siemens AG”), the Court of Appeal at [2] adopted the three major considerations stated by Prof Jeffrey Pinsler inSingapore Court Practice 2009(LexisNexis, 2009) at para 11/2/5. First, the claim must come within the scope of one or more of the paragraphs of O 11 r 1 of the RC. Second, the claim must have a sufficient degree of merit. Third, Singapore must be theforum conveniens.The second and third considerations will be covered in the discussion of the merits objection and the conflicts objection respectively. For present purposes of analysing the disclosure objection, I will address the issue of whether the Plaintiffs did make full and frank disclosure when making the application for leave to serve out of jurisdiction. 77     In brief, O 11 r 2 of the RC states that the affidavit filed in support of an application for leave to serve out of jurisdiction must include: (a) the grounds on which the application is made; (b) that in the deponent’s belief the plaintiff has a good cause of action; (c) in what place or country the defendant is, or probably may be found; (d) where the application is made under Rule 1(c), the grounds for the deponent’s belief that there is between the plaintiff and the person on whom an originating process has been served a real issue which the plaintiff may reasonably ask the Court to try; and (e) whether it is necessary to extend the validity of the writ. 78     In this regard, the applicant owes a duty of full and frank disclosure and failure to properly discharge that duty renders any order granted liable to be set aside. The duty of disclosure that is owed relates to the facts which are set out in the supporting affidavit bearing in mind that the applicant has to establish a good arguable case. Copies of documents that are referred to in the affidavit should also be exhibited and the affidavit must also set out sufficient facts to demonstrate that Singapore is theforum conveniens. In deciding whether to grant leave for service out of jurisdiction, O 11 r 2 of the RC provides that the court has to be satisfied that “the case is a proper one for service out of Singapore under this Order”. Given theex partenature of the application, the applicantmustplaceallmaterial facts before the court can be so satisfied. It goes without saying that this includes facts which are unfavourable to the applicant’s case because the duty to make full and frank disclosure is not merely a matter of fairness between the parties to the action but it is a duty that is owed to the court. It is driven by the need for the court to satisfy itself that the case is aproperone for service out of jurisdiction. 79     The principle that the applicant is under a duty to make full and frank disclosure when making anex parteapplication for leave to serve out of jurisdiction is well-established in many local cases. In the oft-cited High Court decision ofTransniko Ptd Ltd v Communication Technology Sdn Bhd[1995] 3 SLR(R) 941, Kan Ting Chiu J made the following observations (at [11]–[12]): Where anex parteapplication for leave to serve a writ out of jurisdiction was made, the applicant is under a duty to make full and frank disclosure of all matters material to the application. We need only to refer to the most recent of the cases on this point cited by counsel for the defendants, the English Court of Appeal's decision inTrafalgar Tours Ltd v Alan James Henry[1990] 2 Lloyd's Rep 298, where Purchas LJ (with whom Nourse LJ and Beldam LJ concurred) said (at 308) that: there is a heavy duty upon those applyingex parteunder RSC O 11, r 1 for leave to serve a writ out of the jurisdiction ... to make full and frank disclosure. The duty on the applicant is onerous, and if he fails to discharge it, the leave granted may be set aside even if the non-disclosure is innocent. InLazard Brothers and Company v Midland Bank, Limited[1933] AC 289, Lord Wright held (at 306-307) that although the failure in that case was not tainted with the slightest suggestion of bad faith, \"The court has a discretion to set aside an order madeex partewhen the applicant has failed to make sufficient or candid disclosure.\" 80     InPrinciples of Civil Procedure(Academy Publishing, 2013), Prof Jeffrey Pinsler helpfully explains at para 05.012 that where the originating process is to be served out of jurisdiction, the application for leave is necessarilyex partein nature as the person to be served is not yet a party to the proceedings. It was further emphasised that this necessarily means that the applicant has to be “completely forthcoming about information which couldpotentiallyhave an adverse effect on his application” [emphasis added]. In this respect, the applicant has the responsibility to exercise the utmost good faith such that the court is able to adjudicate the application fairly and justly. The learned author’s following admonition at para 05.012 is well worth stressing: The plaintiff’s counsel must bear in mind that his conduct in theex parteapplication – whether he fully disclosed all material facts within his knowledge (notwithstanding their effect on his client’s case) – will be very carefully scrutinised by the defendant and the court for the purpose of any application to set aside the order granting leave and the service of the writ. 81     Apart from the general principles traversed above, the Defendant further submits that the heavy burden to make full and frank disclosure is also reflected in the cautious approach towards the applicant who seeks to discharge the burden of disclosure by relying on documents which are merelyexhibitedin the affidavit. The Defendant’s position is that if the facts are not fairly set out in thebodyof the affidavit, it will not assist the applicant to point to someexhibitfrom which the material facts may be extracted. In this vein, the Defendant referred to Steven Gee,Commercial Injunctions(Sweet & Maxwell, 5th Ed, 2004) at para 9.003 where it was stated that: It may well not be a sufficient answer to an allegation of non-disclosure for an applicant to say that the relevant information giving rise to the defence was contained in an exhibit, though not referred to in the body of the affidavit in the context of a possible defence. … 82     I agree with the Defendant’s submissions. What the law requires is for the facts to be fairly stated in the affidavit, such that the court is able, in the context of anex parteapplication (which will often be at short notice), to make a fair determination as to whether the case is a proper one for service out of jurisdiction. I agree with the statement inSiporex Trade SA v Comdel Commodities Ltd[1986] 2 Lloyd’s Rep 428 at 437 that the applicant must “identify the crucial points for and against the application, and not rely on general statements and the mere exhibiting of numerous documents”. Similar remarks were also made inNational Bank of Sharjah v Dellborg and others[1993] 2 Bank LR 109, where Lloyd LJ stated unequivocally at 112 that in the event the facts are not fairly stated in the affidavit, “it will not assist the plaintiff to be able to point to some exhibit from which that fact might be extracted”. 83     Although the authorities and commentaries cited above dealt with the duty of disclosure in the context of applications for injunctions, I am of the view that the general principles are also applicable to applications for leave to serve out of jurisdiction. In this regard, it is apposite to refer to the decision ofLee Hsien Loong v Review Publishing Co Ltd and another and another suit[2007] 2 SLR(R) 453 (“Lee Hsien Loong v Review Publishing”), where Sunderesh Menon JC (as he then was) observed at [58] that there was “no reason in principle why there should be a difference in approach between an application for leave to serve out of jurisdiction ... and one for an injunction”. It was further observed that both situations deal with the consequences of misleading a court to exercise its powers in circumstances where the court would not have had the benefit of opposing counsel due to theex partenature of such applications. 84     Menon JC also referred to the English High Court decision ofNetwork Telecom (Europe) Ltd v Telephone Systems International Inc[2004] 1 All ER (Comm) 418, where it was held that there was a continuing obligation on an applicant who had been granted leave to serve out of jurisdiction to inform the court of any new circumstances that might have occurred between the time when leave was granted and when process was served. The following observations that were made by Burton J in that case were cited at length by Menon JC inLee Hsien Loong v Review Publishing(at [58]): A court willing to make that kind of order at the instance of one party has to rely on that party to make the fullest and frankest disclosures of any matter thatmight affect the mind of the judgein granting the order,even to waver, never mind actually to refuse to make the order, but the rule as to full and frank disclosure is not limited to Mareva or Anton Pillers or to ex parte injunctions.Indeed just as old as the 'golden rule' in relation to injunctions is the identical rule in principle, applicable to service out of the jurisdiction. [emphasis added] With this backdrop of legal principles, I now turn to consider whether the Plaintiffs failed to discharge their duty to make full and frank disclosure when they applied for leave to serve out of jurisdiction. 85     In brief, the Defendant’s complaint was that the summary of facts set out in the body of the service affidavit was one-sided and misleading. In this respect, four examples were highlighted and relied upon by the Defendant: (a)     While the service affidavit disclosed the proof of debt filed in Singapore, and further asserted that the proceedings undertaken in the HKSAR and India to enforce the judgment were in breach of bankruptcy laws, there was no disclosure that the Mumbai property had been attached more than a year before the bankruptcy orders were made in Singapore. (b)     The service affidavit also failed to disclose that the Indian courts had already determined that: ... the attachment was levied on 12.1.2004,i.e.much prior to the order of the High Court of Singapore adjudicating the respondent no. 2 as a bankrupt. The order of adjudication by [the] Singapore High Court cannot affect the right of the attaching creditor of the insolvent. (c)     The service affidavit failed to mention any of the extensive proceedings in India challenging the execution proceedings. (d)     The service affidavit also failed to disclose the numerous steps undertaken by the High Court of Bombay, the Sheriff and the Defendant to execute against and sell the Indian property. Indeed, the process had reached a significantly advanced stage of execution and sale by the end of January 2005 (ie, before the bankruptcy orders were made on 4 February 2005). 86     I note that the service affidavit comprised only three pages and nine paragraphs. The key paragraph in which the facts were summarised began with the statement that the full facts could be found in the substantive affidavit (ie, the affidavit filed in support of OS 601/2013). 87     The substantive affidavit filed in support of OS 601/2013 was affirmed on 4 July 2013. It began with a summary of the proceedings in the HKSAR leading to the judgment obtained by the Defendant, and the award of damages in the sum of US$618,331.26 with interest and costs. The affidavit then proceeded to describe the enforcement proceedings that were undertaken in the HKSAR and India. With regard to the Indian proceedings, reference was made to the warrant of sale of 21 May 2004, as well as the public notice inviting offers. The substantive affidavit also included the fact that the Defendant had received the sum of HK$215,528.07 in part satisfaction of the judgment debt following the sale of the HKSAR property. This affidavit proceeded to explain the bankruptcy petition filed in Singapore by the Bank of East Asia. Thereafter, details were provided of proceedings taken in India by the Plaintiffs to stay the execution following the bankruptcy order granted in Singapore. This included the pending appeal to the Indian Supreme Court in respect of the High Court’s decision to allow the execution proceedings to continue. The substantive affidavit also referred to the applications to challenge the jurisdiction of the Indian courts on the basis of a lack of jurisdiction, and the appeal to the Indian Supreme Court. Finally, the substantive affidavit also included several paragraphs describing that the Defendant had filed a proof of debt in Singapore, as well as the application by ING Bank in India to protect its interests in the Mumbai property. 88     The Defendant’s position is that even if the Plaintiffs were allowed to rely on the substantive affidavit to support the application for leave to serve out of jurisdiction, the affidavits (ie, the substantive affidavit and the service affidavit), even when read together, failed to disclose the following material facts: (a)     The Deed of Assignment was not disclosed or exhibited in either affidavit. (b)     While both affidavits asserted that P2 was a joint owner of the Mumbai property, there was no mention of the fact that the proceedings commenced in India to establish P2’s interest in the Mumbai property had been dismissed for want of prosecution on 1 August 2005. (c)     While the service affidavit alleged that the Defendant was in breach of ss 76(1)(c) and 105 of the BA by enforcing the judgment debt in India, the Plaintiffs failed to disclose that those sections did not have any extra-territorial effect and thus did not apply to the execution proceedings that were ongoing in India. (d)     While the substantive affidavit referred to the Division Bench’s decision that the HKSAR was not a reciprocating territory, both affidavits failed to mention that the Indian Government subsequently issued the 2012 Gazette Notification, stating that the HKSAR was a reciprocating territory with effect from 1 July 1997. (e)     Both affidavits also failed to exhibit any of the court papers or documents filed in relation to the Indian proceedings, thereby concealing the extent and scope of the proceedings that were ongoing in India. There was no mention of the fact that a full set of papers had been filed in relation to the appeals to the Indian Supreme Court, which runs into tens of thousands of pages. (f)     Both affidavits made misleading and inaccurate allegations against the Defendant. The following details were set out in the affidavit filed on behalf of the Defendant on 15 October 2013: (i)       The allegation in the substantive affidavit that the Defendant, in its application to commence execution proceedings in India, failed to disclose to the High Court of Bombay that execution proceedings had already been commenced in the HKSAR. This was incorrect as the application for execution did disclose the charging of a residential asset belonging to P1 in the HKSAR (viz, the HKSAR property). (ii)       The allegation that the Defendant did not disclose the receipt of HK$215,528.07 in partial satisfaction of the judgment debt to the High Court of Bombay and failed to file any revised certificate concerning the same. In response, the Defendant asserts that a revised certificate was filed, with reference being made to a Certificate of Part Satisfaction of Debt issued by the High Court of Bombay on 3 December 2008. That said, it is clear that the filing of the revised certificate only took place about three years after the filing of the original proof of debt. In response, the Defendant explains that the sum received only represented a small portion of the judgment debt and that to date no dividend has been paid in Singapore. (iii)       The assertion that it has been seven years since P1 filed the application for a stay of execution in India and that he is still waiting for the matter to be heard by the Indian Supreme Court. The Defendant is of the view that this is misleading as P1 failed to disclose that there are presently three appeals before the Indian Supreme Court and that all three appeals have been fixed to be heard together. The Defendant further asserts that the length of time with regard to the Indian proceedings is due to the numerous applications and appeals taken out by the Plaintiffs. (iv)       The assertion by P1 that despite the fact that the Indian Supreme Court had made an ad-interim order on 3 March 2006 staying execution of the final documents of sale with respect to the Mumbai property, the Defendant still commenced execution by way of a Sheriff auction. The Defendant asserts that this is misleading as the Indian Supreme Court’s actual order was to allow execution proceedings to continue, with the sole qualifier that final sale should not be executed against the Mumbai property while the appeal was still pending. (v)       The allegation that the Defendant and ING Bank “acted in cahoots” in drafting the consent order in respect of ING Bank’s application and that the Division Bench had refused to accept the consent order on record. The Defendant asserts that this was untrue and that, in any event, no consent order would have bound P1 in the absence of his consent. The Division Bench decided that it could not accept the consent order on record given that the OA had refused to consent to P1 being a party to the consent order. 89     In the present case, the service affidavit was filed one day before the order was granted on anex partebasis. The substantive affidavit does not appear to have been set out as an exhibit in the service affidavit although it is likely that the substantive affidavit would have been accessible through the eLitigation system. Nonetheless, the Defendant’s position is that the learned Assistant Registrar who granted the order may not have had the opportunity to review the substantive affidavit although it was referred to in the service affidavit. Whether the learned Assistant Registrar didin facthave the opportunity to review the substantive affidavit is not an issue that I am able to make a conclusive finding on, given the state of the evidence before me. Nevertheless, I am of the view that the service affidavit should have, at the very least, highlighted the areas of the substantive affidavit which are of especial importance. 90     For the avoidance of doubt, I acknowledge that the substantive affidavit does set out some of the important facts which are relevant to the decision of whether to grant leave to serve out of jurisdiction. This includes,inter alia, the fact that the warrant of sale was levied on the Mumbai property on 21 May 2004, and that a public notice inviting offers was issued on 20 April 2005. Other material facts concern information regarding the state of the Indian proceedings, such as the decision of the High Court of Bombay to refuse a stay of the execution proceedings on the basis of the bankruptcy order granted in Singapore (which is now on appeal to the Indian Supreme Court). In this respect, I am of the view that, at the very least, the service affidavit should have drawn the attention of the court to these material points mentioned above, leaving the details to be gleaned from a closer reading of the substantive affidavit. Whether the material facts must always be set out (and in what detail) in the body of the service affidavit depends on the circumstances of each case. That said, it bears emphasising that the more important the facts and the more complicated the background circumstances are, the greater the need for care to be taken in complying with the duty of full and frank disclosure. 91     In any event, while the substantive affidavit did refer to the legal proceedings in India, the Deed of Assignment through which the Plaintiffs claim to have acquired the right to commence OS 601/2013 was not referred to or exhibited in both affidavits. It bears emphasising that the applicant, for leave to serve out of jurisdiction, is required to discloseallmaterials facts thatmay potentiallyhave an impact on the court’s decision. In this regard, the applicant cannot rely on the argument that the court would have arrived at the same decision even if disclosure had been made in the first place. 92     To be clear, it is acknowledged that the Plaintiffs have, in the substantive affidavit, referred to some of the legal proceedings in India. Nevertheless, as a whole, I am of the view that the level of disclosure was inadequate in so far as the extent and scale of the proceedings in India were concerned. Having failed to adequately discharge their duty of full and frank disclosure, the order granting the Plaintiffs leave to serve OS 601/2013 out of jurisdiction is thereby set aside.",
        "The merits objection": "93     Apart from the material non-disclosure on the part of the Plaintiffs, the Defendant also submits that the service order should not have been granted on the basis that the Plaintiffs failed to establish a good arguable case on the merits of the case. In this respect, the Defendant refers to the following passage fromSingapore Civil Procedureat para 11/1/8: A good arguable case is one that establishes “facts from which an inference could clearly and properly be drawn” ... This phrase has also been defined as where the applicant’s case has a good prospect of success ... They indicate that though the court will not at this stage require proof to its satisfaction, it will require something better than a mereprima faciecase. The practice, where questions of fact are concerned, is to look primarily at the plaintiff’s case and not to attempt to try dispute of fact on affidavit; it is of course open to the defendant to show that the evidence of the plaintiff is incomplete or plainly wrong. Onquestions of law, however, the court may go fully into the issues and will refuse leave if it considers that the plaintiff’s case isbound to fail. [emphasis added] 94     The learned author ofPrinciples of Civil Procedurealso helpfully explains at para 05.013 that the plaintiff must be able to positively show “a good arguable case” that the facts on which the claim is based can be brought within one of the limbs of O 11 r 1. In this latter respect, the court is concerned with whether jurisdiction has been established and not with whether the claim meets a particular level of merit. However, at this stage, the plaintiff must still at least show that there exists a “serious issue” for adjudication, a criteria which will often be apparent from the facts which establish the ground of jurisdiction. 95     In determining whether the plaintiff has overcome the threshold of proving a good arguable case to establish jurisdiction, it is insufficient if it is merely demonstrated that the claim has a prospect of success. Further, these principles must be applied bearing in mind the particular limb of O 11 r 1 that the applicant relies on. In the present case, the Plaintiffs have relied on the following limbs: (a)     para (p) – the claim is founded on a cause of action arising in Singapore; (b)     para (r) – the claim is in respect of matters in which the defendant has submitted or agreed to submit to the jurisdiction of the Court; and (c)     para (s) – the claim concerns the construction, effect or enforcement of any written law. 96     In this respect, the Defendant’s submission that the Plaintiffs have not established a good arguable case is based on two grounds. First, the Defendant asserted that the Mumbai property was “attached” more than a year before the bankruptcy orders were granted in Singapore. Second, it was argued that ss 76(1)(c) and 105 of the BA do not have any extra-territorial effect. I will deal with these arguments in turn. 97     With regard to the attachment of the Mumbai property, the Defendant relies on the House of Lords decision ofGalbraith v Grimshaw and another[1910] AC 508 (“Galbraith v Grimshaw”). In that case, the judgment creditor had obtained judgment for a sum of money before the Scottish courts. The Scottish judgment was extended to England by virtue of the Judgments Extension Act 1868. The judgment creditor proceeded to serve a garnishee ordernision a firm in England who owed a debt to the judgment debtor. Subsequently, the judgment debtor was declared bankrupt in Scotland, resulting in his estate being sequestered and transferred to the trustee in bankruptcy. The trustee in bankruptcy then brought interpleader proceedings in England to determine the rights of the trustee and that of the judgment creditor with respect to the garnished debt. The House of Lords ruled in favour of the judgment creditor, holding that the judgment creditor had, by service of the garnishee ordernisi, obtained an attachment in England prior to the date of sequestration. The Scottish court thus had no power to interfere with the garnishee claim. 98     In the present case, the question is whether the Singapore court has the jurisdiction to interfere with the Defendant’s execution against the Mumbai property in India. With reference to the principles laid down inGalbraith v Grimshaw, the answer to that depends on whether the attachment occurredpriorto the granting of the bankruptcy order in Singapore. If the Mumbai property had already been attached prior to the bankruptcy order in Singapore, it is difficult to see how the subsequent bankruptcy of the Plaintiffs can affect the execution proceedings in India. 99     Furthermore, inInsolvency in Private International Law(Oxford University Press, 2nd Ed, 2005), Ian Fletcher notes that it is one of the fundamental principles of English bankruptcy law that the trustee in bankruptcy takes the property subject to equities, including any valid and subsisting claims arising from the property or any security rights previously effected in relation to it. In this respect, the following observations were made by the learned author with regard to the issue of the applicable law (at pp 75–76): In an international context, the “subject to equities” rule retains its significance, but the manner of its application follows the usual principles of private international law concerning the law of property, namely that there must be reference to the law of thesitusto discover what claims or charges are recognized as affecting the property to which the trustee claims to have become entitled. A further relevant factor is that the third party’s claim or charge over the property must have been perfected prior to the time at which the title of the trustee in bankruptcy first accrued, so that it can be said that, at that time, the bankrupt could not have effected a voluntary assignment in favour of the trustee free of the incumbrance in question. … 100    It will be recalled that by the time the bankruptcy order was granted, the execution proceedings against the Mumbai property were already in an advanced stage. The relevant timeline is as follows: (a)     Execution proceedings against P1 were commenced on 26 June 2003. (b)     On 12 January 2004, the High Court of Bombay issued the warrant of attachment. (c)     On 15 January 2004, the Deputy Sheriff of Bombay returned a certificate of attachment to certify that, pursuant to the warrant, the title and interest of the Mumbai property had been attached. (d)     The High Court of Bombay issued the warrant of sale against the Mumbai property on 21 May 2004. 101    Subsequently, the Plaintiffs were adjudged bankrupt in Singapore on 4 February 2005 and about three months later, P1 commenced an action in India to stay the execution proceedings on the basis of the bankruptcy order granted in Singapore (viz, the bankruptcy stay application). While the stay was initially granted by a single judge of the High Court of Bombay, this was reversed on appeal. In Appeal No 403 of 2005, the Division Bench, after discussing relevant case law includingGalbriath v Grimshaw, held that the attachment in India occurred prior to the adjudication of bankruptcy in Singapore. Accordingly, it was held that the bankruptcy orders granted in Singapore could not affect the right of the attaching creditor in India. Although P1 has since appealed to the Indian Supreme Court, the decision of the Division Bench remains as it stands given that the appeal was still pending as at the date of the hearing before me. 102    Nonetheless, it must also be acknowledged that P1 subsequently filed a fresh action to set aside the execution proceedings on the basis that the HKSAR is not a reciprocating territory (ie, the reciprocating territory action). At first instance, P1’s claim was rejected by a single judge of the High Court of Bombay. On appeal, however, the Division Bench reversed the lower court’s decision and decided that the HKSAR judgment could not be enforced in India. The Defendant has since appealed against that decision and an issue which is likely to arise would be the validity of the 2012 Gazette Notification, which is also the subject matter of a separate action by the Plaintiffs against the Indian government (viz, the gazette notification action). 103    Therefore, the question that arises is the effect of the Division Bench’s decision to discharge the Defendant’s execution proceedings on the status of the attachment of the Mumbai property pending final determination of the matter by the Indian Supreme Court. In this respect, the Defendant has stated that, on or about 4 October 2010, the Indian Supreme Court granted an order for both parties to maintain the status quo with regard to the Mumbai property notwithstanding the Division Bench’s decision to discharge the Defendant’s execution proceedings. 104    It thus follows that if the OA did not have the right to set aside or stay the execution proceedings in India, the Plaintiffs, being the assignee of the rights pursuant to the Deed of Assignment, could not be in a better position than the OA. Indeed, it is noted that the position under Singapore law in relation to the issue of when execution against property is effected appears to be similar to that in India. Section 105 of the BA states that: (1) Where the creditor of a bankrupt has issued execution against the goods or lands of the bankrupt or has attached any debt due or property belonging to him, the creditor shall not be entitled to retain the benefit of the execution or attachment against the OAunless he has completed the execution or attachment before the date of the bankruptcy order... ... (2) For the purposes of this Act — ... (c) an execution against land or any interest therein is completed by registering under any written law relating to the registration of land a writ of seizure and saleattaching the interest of the bankrupt in the land described therein. [emphasis added] 105    Therefore, given that attachment of the Mumbai property occurredpriorto the grant of the bankruptcy orders in Singapore, I am of the view that the Plaintiffs failed to establish a good arguable case for leave to be granted to serve OS 601/2013 out of jurisdiction. 106    Moving on to the second ground of attack in relation to the merits objection, the Defendant also asserts that ss 76 and 105 of the BA do not have any extra-territorial effect. To this end, the Defendant relies on the English decision ofIn re Vocalion (Foreign) Limited[1932] 2 Ch 196. In that case, a company had been ordered to be wound up by the court. Subsequently, the Official Receiver and the provisional liquidator of the company applied to restrain the respondent creditor from further proceeding with,inter alia, an action against the company before the Supreme Court of Melbourne. In this regard, s 177 of the Companies Act 1929 (c 23) (UK) (“UK Companies Act 1929”) stated that “[n]o action or proceeding shall be proceeded with or commenced against the company except by leave of the court” while s 174 rendered void any attachment, sequestration, distress, or execution put in force against the estate or effects of the company after the commencement of the winding up. Referring to s 174 of the UK Companies Act 1929, Maugham J made the following observations at 201–202: ... If s. 174 is considered, it would seem to be impossible to hold that the Legislature intended to say that an attachment or distress or execution put in force under the jurisdiction of some foreign Court against the assets of a company in a foreign land should be void to all intents; and it may be observed that a provision of that kind would in almost every case be nugatory. But apart from these considerations of the language of the relevant sections I think the observation of Mellish L.J. inIn re Oriental Inland Steam Co.(1) is undeniable: “Of course,” he says, “Parliament never legislates respecting strictly foreign Courts. Nor is it usually considered to be legislating respecting Colonial Courts or Indian Courts, unless they are expressly mentioned.” ... In relation to s 177 of the UK Companies Act 1929, Maugham J acknowledged at 202 that: ... Apart from authority, in my judgment it is reasonably clear that s. 177 has no application to actions or proceedings in foreign Courts. ... The Defendant argues that s 76 of the BA, being equivalent to ss 174 and 177 of the UK Companies Act 1929, similarly does not have extra-territorial effect. 107    With respect to s 105 of the BA, the Defendant relies on the English Court of Appeal decision ofMitchell and another v Carter and another, Re Buckingham International plc[1997] 1 BCLC 673. In that case, it was accepted that s 183 of the UK Insolvency Act 1986, the English equivalent for corporate insolvency, had no extra-territorial effect. Apart from that, the Defendant also refers to the ILRC Report 2013, where it was observed at para 92 that: In Singapore, the relevant provisions which provide for a stay of proceedings and other action against the company in judicial management or schemes of arrangement do not appear to have extraterritorial scope. In other words, the prohibition against the commencement of legal process is generally understood not to apply to proceedings instituted in a foreign court. ... 108    To be clear, for the purposes of deciding SUM 5391/2013, I do not have to make a final determination on the merits of the Plaintiffs’ claim. In that respect, I merely have to deal with the issue of whether the Plaintiffs have established a good arguable case on the merits of their claim. However, as the learned author inSingapore Civil Procedureexplains, with regard to questions of law, the court may go fully into the issues and will refuse leave if it considers that the plaintiff’s case is “bound to fail” (see [93] above). 109    On this basis, it is observed that the decisions raised by the Defendant in support of the argument that ss 76 and 105 of the BA have no extra-territorial effect all pertain to statutory provisions governing the winding up of companies. While there are indeed significant differences between the law pertaining to personal bankruptcy and that of corporate insolvency, I am of the view that the reasoning applied in the decisions above in the latter context is similarly applicable to the former. In the absence of clear wording, I cannot accept the Plaintiffs’ arguments that ss 76 and 105 were intended to have any extra-territorial effect. In fact, while both parties have not referred me to the English decision ofPaul Zeital Kemsley v Barclays Bank plc, Mark Fry, Kirstie Jane Provan[2013] EWHC 1274, I note that Roth J, in that decision, had made the following remarks at [22]: Accordingly, if Barclays as a creditor had commenced the proceedings on its debtnot in New York but in England, since they were commenced after the date of presentation of the bankruptcy petition but before the date of the order, s. 285(1) would apply and the action would probably be stayed. Further, Barclays would not be permitted to obtain any remedy against Mr Kemsley’s property: s. 285(3)(a).However, it is common ground that s. 285(1) and (3) do not apply to foreign proceedings and enforcement measures. ... In this regard, while it is recognised that Roth J was dealing with provisions governing the interim period between the date of presentation of the bankruptcy petition and the date of the order, I am of the view that the same principles would apply to the statutory moratorium governing the periodafterthe grant of the bankruptcy order. 110    Nevertheless, it must also be acknowledged that Roth J immediately went on to make the following observation at [22]: ... Nonetheless, the court has jurisdiction to grant an injunction restraining the pursuit of foreign proceedings under s. 37 of the Senior Courts Act 1981. The question thus remains as to whether the Singapore courts will exercise a general jurisdiction to grant injunctive relief against the pursuit of foreign proceedings. More commonly known as “anti-suit injunctions”, this was explained by Lord Goff of Chieveley in the Privy Council decision ofSociete Nationale Industrielle Aerospatiale v Lee Kui Jak and another[1987] 1 AC 871 at 892H–893A as follows: … One such category of case arises where an estate is being administered in this country, or apetition in bankruptcy has been presented in this country, or winding up proceedings have been commenced here, and aninjunction is granted to restrain a person from seeking, by foreign proceedings, to obtain the sole benefit of foreign assets. In such cases, it may be said that the purpose of the injunction is to protect the jurisdiction of the English court. … [emphasis added] 111    The related issue of whether foreign winding up proceedings would be recognised in Singapore was dealt with by the Court of Appeal in the recent decision ofBeluga Chartering GmbH (in liquidation) and others v Beluga Projects (Singapore) Pte Ltd (in liquidation) and another (deugro (Singapore) Pte Ltd, non-party)[2014] 2 SLR 815 (“Beluga Chartering”). At the outset, Sundaresh Menon CJ, in delivering the grounds of decision of the court, made the following pertinent observations at [90]: A statutory moratorium on the commencement or continuation of legal proceedings and process triggered by a winding up orderdoes not generally have extraterritorial effect: seeIn re Oriental Inland Steam Co; Es p Scinde Railway Co...;In re Vocalion (Foreign), Limited... This is premised on the fundamentally territorial nature of jurisdiction. It follows that under the common law rules of recognition, a court would not recognise the jurisdiction of a foreign legislature or court to impose a stay on any proceedings in the forum court and so would not be bound by any such stay: seeBanque Indosuez SA v Ferromet Resources Inc... As already discussed at [72] above, while the concept of universalism still exists to a certain extent in the context of personal bankruptcy law (such as the vesting of foreign property in the OA), I am of the view that this does not extend to the restraint of foreign proceedings based on a “simplistic” application of the statutory moratorium provisions in the BA. That would be interpreting ss 76 and 105 of the BA far too broadly. Furthermore, the decision ofBeluga Charteringalso suggests that under the common law rules of recognition, the Indian courts would not, in any event, be bound by an anti-suit injunction that has been granted by the Singapore courts. I am thus of the view that the more appropriate procedure involves the Plaintiffs seeking a stay of the execution proceedings before the Indian courts on the basis of the bankruptcy orders granted in Singapore, which I note has already been done in the present case. 112    In any event, I also note the existence of a line of old English authorities where such injunctions have been granted to restrain foreign proceedings. InEx parte Ormiston; Re Distin(1871) 24 LT 197, creditors in a bankruptcy were restrained by the English court from pursuing actions in Belgium in circumstances where the creditors were English subjects and the debts were incurred in England. In the subsequent case ofIn re Tait & Co(1872) LR 13 Eq 75, the English court granted an injunction to restrain a creditor living in Ireland, whose claim had been rejected in the English bankruptcy, from pursuing an action on the same debt in Ireland. 113    In the absence of proper submissions by both parties, I will go no further on this issue of anti-suit injunctions. For the purposes of the application before me, I am of the view that the grant of such injunctions cannot be based solely on ss 76 and 105 of the BA. As explained at [74] above, that would be reading the provisions governing the statutory moratorium far too broadly. The grant of such anti-suit injunctions can thus only find its basis in the exercise of the court’s general jurisdiction. Returning to the facts in the present case, given that the Plaintiffs’ claim rests entirely on ss 76 and 105 of the BA, I am of the view that the Plaintiffs have not established a good arguable case for the purposes of obtaining leave to serve OS 601/2013 out of jurisdiction. 114    It is noted that the Plaintiffs have also relied on para (r) of O 11 r 1 of the RC, namely that the claim is in respect of matters in which the defendant has submitted or agreed to submit to the jurisdiction of the court. In this respect, the Plaintiffs refer to the fact that the Defendant submitted a proof of debt to the OA dated 10 June 2005. 115    In response, the Defendant denies that the filing of a proof of debt can be regarded as a submission to jurisdiction and further asserts that it was only first made aware of the bankruptcy orders granted in Singapore when P1 commenced the bankruptcy stay action on or about 14 April 2005. Thereafter, on 31 May 2005, the Defendant received a letter from the OA requesting the Defendant, as a disclosed creditor, to file a proof of debt. In the circumstances, the Defendant proceeded to file its proof of debt on or about 10 June 2005. The Defendant asserts that this was done to protect its interest in the event that the execution proceedings were stayed in India. 116    In determining whether the Defendant had submitted to the jurisdiction of the court when it filed its proof of debt with the OA, it will be useful to refer to the recent combined appeals heard by the UK Supreme Court inRubin and another v Eurofinance SA and others (Picard and others intervening)[2013] 1 AC 236 (“Rubin v Eurofinance SA”). For the purposes of the present application, only the second appeal needs to be considered. In that case, the defendants were members of a Lloyd’s syndicate which had placed reinsurance with an Australian reinsurance company. The defendants received payments from the company shortly before it went into liquidation. The liquidator in New South Wales brought an action against the defendants to recover the payments made on the basis that the company was already insolvent at the point in time when the payments were made. Although the defendants did not accept service of the proceedings, it was observed by Lord Collins of Mapesbury at [158] that they had “submitted proofs of debt ... and attended and participated in creditors’ meetings”. It was held that this was sufficient for taking the defendants to have submitted to the jurisdiction of the Australian court responsible for the supervision of that proceeding. Therefore, the Australian judgment was held to be enforceable in the English courts. 117    In delivering the leading judgment of the Supreme Court, Lord Collins went as far as to state that (at [165]): In English law there is no doubt that orders may be made against a foreign creditor who proves in an English liquidation or bankruptcy on the footing that by proving the foreign creditor submits to the jurisdiction of the English court. … It was further observed by Lord Collins that (at [167]): ... having chosen to submit to New Cap’s Australian insolvency proceeding, the syndicate should be taken to have submitted to the jurisdiction of the Australian court responsible for the supervision of that proceeding. It should not be allowed to benefit from the insolvency proceeding without the burden of complying with the orders made in that proceeding. Interestingly, in arriving at the decision above, the only decision cited by the learned law lord was the old English authority ofEx p Robertson; In re Morton(1875) LR 20 Eq 733 (“Ex p Robertson”). 118    InEx p Robertson, a Scots merchant had received a sum of £120 out of a debt of about £367 after the liquidation petition was presented. The merchant submitted a proof of debt for the balance of £247 and eventually received a dividend arising from the liquidation in England. Subsequently, the trustees sought to recover the sum of £120 paid out of the insolvent estate, out of the jurisdiction. The respondent objected to the jurisdiction of the English court on the basis that he was a domiciled Scotsman. In holding that the English court had jurisdiction, Sir James Bacon CJ made the following observations (at 737–738): ... what is the consequence of creditors coming in under a liquidation or bankruptcy? They come in under what is as much a compact as if each of them had signed and sealed and sworn to the terms of it – that the bankrupt’s estate shall be duly administered among the creditors. That being so, the administration of the estate is cast upon the court, and the court has jurisdiction to decide all questions of whatever kind, whether of law, fact, or whatever else the court may think necessary in order to effect complete distribution of the bankrupt’s estate. ... [C]an there be any doubt that the Appellant in this case has agreed, as far as he is concerned, the law of bankruptcy shall take effect as to him, and under this jurisdiction, to which he is not only subjected, but under which he has become an active party, and of which he has taken the benefit. ... [The Appellant] is as much bound to perform the conditions of the compact, and to submit to the jurisdiction of the court, as if he had never been out of the limits of England. 119    The English decisions ofRubin v Eurofinance SAandEx p Robertsonhave not gone unnoticed in the Australian courts. In the recent case ofAkers (as joint foreign representative) v Saad Investments Company Limited; Re Saad Investments Company Limited (in official liquidation)[2013] FCA 738, Rares J was confronted with a similar issue of whether the Commissioner of Taxation had submitted to the jurisdiction of the Grand Court of the Cayman Islands when it lodged a proof of debt in that jurisdiction. Interestingly, Rares J sought to confine the principle laid down in the English decisions to situations where the creditor had received abenefitfrom the liquidation process, such as the payment of a dividend. 120    This was, however, implicitly rejected by the Full Court of the Federal Court of Australia on appeal (seeAkers as a joint foreign representative of Saad Investments Company Limited (in Official Liquidation) v Deputy Commissioner of Taxation[2014] FCAFC 57 (“Akers”)). Allsop CJ, in delivering the judgment of the court, agreed with the appellants that “the reasoning of Bacon CJ [inEx p Robertson] did not depend upon thereceipt of the dividend, but upon thesubmission of the proof” [emphasis added]. It was further observed at [165] that: ... I am prepared to accept that formal submission of a proof of debt to the insolvency administration will generally be adequate to support a conclusion that the court supervising the administration thereafter has jurisdiction to make orders in matters connected with the administration against the creditor who has proved. ... In my judgment, the issue of whether a creditor can be taken to have submitted to a particular jurisdiction upon lodging a proof of debt cannot be based on the often fortuitous outcome of whether it had received a benefit from the liquidation, such as the payment of a dividend. I find it difficult to accept that a creditor can be taken not to have submitted to a particular jurisdiction on the sole basis that it had not received abenefitfrom the liquidation and this position is then radically transformed into one where it is taken to have submitted to the jurisdiction when it receives a dividend from the liquidation process. Therefore, I am of the view that the principle laid down inRubin v Eurofinance SAandEx p Robertson, whether rightly or wrongly, cannot be confined to situations where the creditor had received either a dividend or some other benefit from the liquidation process. 121    It bears noting that the decision ofRubin v Eurofinance SAhas also been the subject of scrutiny by academic commentators. In fact, the holding that the formal submission of a proof of debt can be taken as a submission to that particular jurisdiction was severely criticised by Prof Adrian Briggs in a lecture delivered in Singapore on 21 November 2013 (see Adrian Briggs, “New Developments in Private International Law: A Busy 12 Months for the Supreme Court”, lecture on private international law (21 November 2013)). The learned commentator went so far as to describe the conclusion as “astonishing”. In brief, Prof Briggs was of the view that the mere submission of a proof of debt cannot be treated as the unlimited submission to the jurisdiction of the supervising court. It was highlighted that the lodging of a proof of debt was “an act which did not need to be undertaken and was not accompanied by any protest to the jurisdiction of the court conducting the administration”. Prof Briggs observed at para 8 that: ... Lord Collins may not have used the idiom of the Syndicate being in for a penny so in for a pound, but that seems to sum it up quite well. In submitting a proof of debt, in asking to be allowed to stand in the queue for payment out of whatever the liquidators may scratch together to pay off the creditors, the Syndicate had apparently laid itself open to any and all orders which the NSW court might in due course make against it. It appears that to let the liquidator of a company know that you believe that the company owed you money, you cast away your jurisdictional shield, you turn off your firewall. 122    I, however, note that Prof Briggs also made the following observations at para 9 in relation toEx p Robertson: ... But whether the case is seen as one of election, or of approbation and reprobation, it decidedno more than that the English court had jurisdiction to make the order against the foreign creditor who had taken a dividend. It hadnothing whatever to do with the law on foreign judgments given against a creditor who had lodged a proof of debt. [emphasis added] In this respect, I am of the view that the authorities discussed above can be broadly grouped into three different categories. The first category involves the issue of whether a court has the jurisdiction to make an order against a foreign party who had lodged a proof of debt in that particular jurisdiction. The English decision ofEx p Robertsonfalls into this category, as was recognised by Prof Briggs. The second category involves the issue of whether a foreign judgment given against a creditor should be enforced on the basis that the creditor had submitted to that foreign jurisdiction when it lodged a proof of debt. The second appeal inRubin v Eurofinance SAfalls into this category. The last category involves the issue of whether acts done in relation to a foreign liquidation, such as the lodging of a proof of debt in that foreign jurisdiction, are sufficient to prevent the grant of relief in the local jurisdiction under a local statute. The Australian decision ofAkersfalls into this category. With reference to the facts in the present application, the main issue, at least in relation to the Plaintiffs’ arguments on submission to jurisdiction, is whether the Singapore courts have the jurisdiction to make an order against the Defendant on the basis that it had lodged a proof of debt with the OA in Singapore. Therefore, I confine my observations to cases falling within thefirstcategory. 123    In my judgment, the formal submission of a proof of debt by a foreign creditor is sufficient basis to allow the supervising court to make orders against that foreign creditor. While the decisions ofRubin v Eurofinance SAandAkersmay have given rise to different outcomes as they were effectively dealing with different fact patterns as explained above, it is noteworthy that the courts are at least in agreement on whether a supervising court has the jurisdiction to make orders against a foreign creditor on the basis that the creditor had lodged a formal proof of debt (seeRubin v Eurofinance SAat [165];Akersat [165]). Nevertheless, as will be seen below, I am of the view that Singapore is not, in any event, the appropriate forum and jurisdiction should thus be declined on the basis offorum non conveniens. Therefore, the issue of whether the Defendant can be regarded as having submitted to the jurisdiction of the court when it filed the proof of debt with the OA is largely inconsequential.",
        "The conflicts objection": "124    Moving on, the Defendant also submits that Singapore is not, in any event, the proper forum for deciding the matters in OS 601/2013. The Defendant’s position, therefore, is that the Singapore courts should not assume jurisdiction over OS 601/2013. 125    It will be recalled that it was discussed at [76] above that the third major consideration in an application for leave to serve out of jurisdiction would be that Singapore must be theforum conveniens.For the purposes of determining the issue of whether Singapore is theforum conveniensin the present case, it is sufficient to adopt the summary of applicable principles set out inSingapore Civil Procedureat p 145. First, the court is to choose the forum in which the case can be tried more suitably for the interests of all the parties and for securing the ends of justice. Second, the burden is on the plaintiff to show that leave to serve out of jurisdiction should be granted. Third, the court must consider all relevant factors including the residence and place of business of the defendant, the nature of the dispute, the legal and practical issues involved, such as the relevance of local knowledge, the availability of witnesses and their evidence and expense. The question is whether Singapore is clearly the more appropriate forum and the various factors may differ in weight depending on the circumstances of the case. Fourth, the fact that the applicant may be denied a legitimate or juridical advantage in Singapore if he is not given leave to serve out of jurisdiction is not a decisive factor. 126    It will also be useful to refer to the Court of Appeal decision ofSiemens AG(see [76] above), where it was noted that in recognition of the primarily territorial nature of the court’s jurisdiction, the court begins with the location of the defendant when determining whether it has jurisdiction over a dispute. In this regard, it was acknowledged that jurisdiction over a defendant who is within the territory isas of right, while jurisdiction over a defendant who is outside the territory isdiscretionary. It was recognised at [7] that the burden is one of demonstrating “the normative weight to be given to each connecting factor in the light of all the circumstances of the case”. 127    The Defendant raises a number of factors indicating that Singapore is not theforum conveniens, as opposed to India. While these factors were canvassed extensively in the Defendant’s written submissions, a brief summary will suffice for the purposes of this judgment: (a)     The Defendant is incorporated in the HKSAR and has no office in Singapore. It does not carry on business in Singapore and has no assets or property in Singapore. (b)     The proceedings in India have been ongoing for about ten years. In particular, the issues raised in the Indian proceedings are substantially similar to that raised in OS 601/2013 – whether the execution proceedings in India are to be stayed in the light of the bankruptcy orders made in Singapore. (c)     Immense time and costs have already been incurred for the purposes of the Indian proceedings. Three separate appeals which have been scheduled to be heard together are now pending before the Indian Supreme Court. (d)     The Plaintiffs have filed a fresh action against the Indian government to challenge the validity of the 2012 Gazette Notification (viz, the gazette notification action). This action is also related to the separate appeal of whether the HKSAR was a reciprocating territory at the material time (viz, the reciprocating territory action). Further, the gazette notification action was taken outafterthe commencement of OS 601/2013 in Singapore. On this basis, the Defendant argues that a single forum hearing all the disputes is to be preferred. (e)     The appeals before the Indian Supreme Court involve complex questions of law which the Singapore courts should not decide, especially when one of the issues concerns the constitutionality of the 2012 Gazette Notification issued by the Indian government. The Defendant further asserts that it would be a breach of comity for the Singapore courts to hear the application for a stay of the proceedings in India when the Indian courts have been hearing the relevant proceedings concerning the execution of the HKSAR judgment for the past ten years. Apart from that, it is argued that the substance of the relief sought is in essence an anti-suit injunction, which carries with it the usual problems concerning comity. (f)     The Plaintiffs have taken more than eight years since they were adjudged bankrupt to commence these proceedings in Singapore. The Defendant argues that this constitutes “inordinate delay” and is a ground for refusing leave. 128    Apart from the factors summarised above, the Defendant further submits that the Singapore courts should not, in any event, assume jurisdiction on the ground that the subject matter in OS 601/2013 essentially concerns the Mumbai property located in India. In this respect, if the Defendant is correct in characterising the dispute in this manner, the well-establishedMocambiqueprinciple applies and the Singapore courts will have no jurisdiction to determine the title to or right to possession of any immovable property situated outside the forum (seeThe British South Africa Company v The Companhia de Mocambique and others[1893] 1 AC 602;Eng Liat Kiang v Eng Bak Hern[1995] 2 SLR(R) 851 at [11];Murakami Takako v Wiryadi Louise Maria and others[2008] 3 SLR(R) 198 at [15]–[16]). 129    In the present case, it is undisputed that the Plaintiffs are permanent residents of Singapore and have been adjudicated bankrupt under the laws of Singapore. There is no doubt that under the BA, the property of the bankrupt vests automatically in the OA on the making of the bankruptcy order. This includes property situated outside of Singapore. Thereafter, with reference to s 105 of the BA, a creditor is not permitted to retain the benefit of an execution or attachment of property as against the OA unless the execution or attachment was completed before the grant of the bankruptcy order. It thus follows that to the extent that OS 601/2013 is based on an assignment of the OA’s rights pursuant to s 105 of the BA, the key question is whether the execution against the Mumbai property was completed prior to the making of the bankruptcy order. In this regard, leaving aside the pending appeals to the Indian Supreme Court and the dispute over whether the HKSAR was a reciprocating territory at the material time, the Indian courts have since ruled that, under Indian law, the Mumbai property has already been attached and is unaffected by the bankruptcy proceedings in Singapore. Does it then follow that the Singapore court now lacks subject matter jurisdiction over the claim? Given that the property of the bankrupt vests in the OA automatically upon the making of the bankruptcy order, the issue of whether the Singapore court has subject matter jurisdiction depends, at least in part, on whether the Plaintiffs still had an interest and, if so, what type of interest in the property as at the date the bankruptcy order was granted. To this end, I am of the view that the Singapore court does have jurisdiction over the rights, powers and duties set out in ss 76 and 105 of the BA. 130    In any event, this does not necessarily mean that the court must grant leave pursuant to O 11 r 2 of the RC. In fact, after a close perusal of the surrounding facts regarding the ongoing dispute between the parties, I am of the view that Singapore isnot, in any event, theforum conveniensfor the following reasons: (a)     the extensive litigation ongoing in India; (b)     the advanced state of the Indian proceedings, which include three pending appeals before the Indian Supreme Court; (c)     the fact that the issues being aired in OS 601/2013 have already been considered by the Indian courts on multiple occasions, such as the question of whether the Defendant has the right to continue with the execution proceedings against the Mumbai property notwithstanding the grant of the bankruptcy orders in Singapore; and (d)     the considerable costs, time and effort which have been expended by the parties in connection with the legal proceedings in India. 131    As was mentioned by the Court of Appeal inSiemens AG, the objective of this inquiry is to identify the most appropriate forum for the dispute to avoid jurisdictional uncertainty. For the avoidance of doubt, it is recognised that not all of the issues raised in the legal proceedings in India are identical with those raised in OS 601/2013. Nonetheless, it must also be acknowledged that the matters are closely related. For instance, in the event that OS 601/2013 is heard and determined by the Singapore courts, one issue that may arise would be whether the execution proceedings commenced by the Defendant in India were valid. This will depend on the issue of whether the HKSAR was a reciprocating territory at the material time such that its judgments were enforceable in India. Whether the HKSAR was a reciprocating territory at the material time may in turn raise the question of whether the 2012 Gazette Notification issued by the Indian government was valid. This clearly involves complex questions of Indian law and may even extend to questions concerning the constitutionality of the Indian government’s act in issuing the 2012 Gazette Notification and the legitimacy of its retrospective effect. Leaving aside the issue of jurisdiction, these are issues which, as a matter of comity, are best left to the Indian courts. 132    In fact, the courts have long recognised that disputes over forum are especially complicated when there are parallel proceedings abroad. In this context, the following comments made by the learned author inPrinciples of Civil Procedureat para 05.022 bear repeating: ... For example, the plaintiff who applies for service out of Singapore may have commenced proceedings over the same dispute in another jurisdiction; or the defendant may have initiated a suit concerning the same dispute elsewhere; or a foreign counterclaim may duplicate the Singapore proceedings. Such circumstances are often inimical to the interests of justice: the additional costs and effort of pursuing a second action; the risk of inconsistent judgments; manipulation by the parties in pursuit of the judgment which they think will favour them; issues ofres judicataas the first judgment may bind the parties; and complexity and uncertainty arising from the multiplicity of suits. As a court has statutory power to dismiss or stay an action where there is a multiplicity of proceedings, it follows that an application for service out of jurisdiction may also be adversely affected by concurrent proceedings elsewhere. ... As can be seen from the variety of objections raised in the application before me today, the problems associated with the multiplicity of actions across different jurisdictions cannot be trivialised. In the final analysis, for the reasons above, I am of the view that Singapore is not, in any event, theforum conveniens.",
        "Theres judicataobjection": "133    Finally, the Defendant also submits that OS 601/2013 should be set aside on the basis ofres judicata. In this regard, the Defendant refers to the High Court decision ofGoh Nellie v Goh Lian Teck and others[2007] 1 SLR(R) 453 (“Goh Nellie”), where Sunderesh Menon JC (as he then was) observed at [17] that the “umbrella doctrine ofres judicataencompasses three conceptually distinct though interrelated principles”. These were cause of action estoppel, issue estoppel and extendedres judicata, which is more commonly known as the defence of abuse of process. 134    In the present case, the proceedings said to give rise tores judicatais the application brought by P1 to stay the execution proceedings undertaken by the Defendant against the Mumbai property on the basis of the bankruptcy orders granted in Singapore (viz, the bankruptcy stay application). It will be recalled that the Division Bench reversed the lower court’s decision to grant a stay of the execution proceedings, and held that the attachment of the Mumbai property took place “much prior” to the bankruptcy proceedings in Singapore. It was further held that the order of adjudication (viz, the bankruptcy orders granted in Singapore) could not affect the rights of the attaching creditor (ie, the Defendant) against the Mumbai property. The decision of the Division Bench has been appealed against by P1 and the appeal is pending before the Indian Supreme Court. 135    In this regard, the principle that the doctrine ofres judicataapplies to foreign judgments entitled to recognition is well-established and undoubtedly part of Singapore law. InThe “Vasiliy Golovnin”[2008] 4 SLR(R) 994, the Court of Appeal observed at [111] that it is “trite that a foreign judgment can give rise to an issue estoppel so as to prevent a party to that foreign action from vexing another party to that action by an attempt to re-open an issue already resolved in the foreign court”. InMurakami Takako (executrix of the estate of Takashi Murakami Suroso, deceased) v Wiryadi Louise Maria and others[2007] 4 SLR(R) 565, the Court of Appeal at [51] also agreed that a foreign judgment which was freely recognised could give rise to ares judicataor to an issue estoppel. 136    In order to establish issue estoppel, four requirements will have to be established (seeThe “Vasiliy Golovnin”[2007] 4 SLR(R) 277 at [38];The “Bunga Melati 5”[2012] 4 SLR 546 at [80]): (a)     the judgment in the earlier proceedings being relied on as creating an estoppel must have been given by a foreign court of competent jurisdiction; (b)     the judgment must have been final and conclusive on the merits; (c)     there must have been identity of parties in the two sets of proceedings; and (d)     there must have been identity of subject matter,ie, the issue decided by the foreign court must have been the same as that arising in the proceedings at hand. It is noted that similar requirements apply to cause of action estoppel. 137    Accordingly, the first question is whether the Division Bench is a foreign court of competent jurisdiction such that its decision to reject the stay of execution proceedings is capable of giving rise tores judicata. In this respect, it is helpful to refer to the observations made by KR Handley inSpencer Bower and Handley: Res Judicata(LexisNexis, 4th Ed, 2009) (“Spencer Bower and Handley: Res Judicata”) at para 4.01 that a judicial decision will bind parties if the tribunal had jurisdiction over the cause and the parties. In the event that the tribunal exceeds its jurisdiction or made an order beyond its powers, the decision will not be capable of establishingres judicata. Apart from that, in cases whereres judicatais based on a foreign decision, it is necessary to show that the foreign tribunal had an internationally recognised jurisdiction (seeSpencer Bower and Handley: Res Judicataat para 4.19). 138    The reference to “jurisdiction” in this context essentially means the authority to decide. In this respect, a distinction is drawn between superior courts of record and other courts and tribunals. A superior court of general jurisdiction is presumed to have jurisdiction. The effect of this presumption can be seen in the English decision ofJames WB Scott v John N Bennett(1871) LR 5 HL 234, where Martin B acknowledged at 245 that the Court of Common Pleas was one of the superior courts of record and on that basis, it had the jurisdiction to make the order even if “the Act of Parliament did not justify it”. In other words, even in the case where the order granted exceeded the power of the court, it still possessed the requisite jurisdiction. 139    In the present case, the Division Bench is undoubtedly entitled to recognition as a superior court of record as it hears appeals from the High Court of Bombay. There is no doubt that the High Court of Bombay had the jurisdiction to hear and decide the execution proceedings undertaken against the Mumbai property. There is also no doubt that these execution proceedings were commenced well before the making of the bankruptcy orders in Singapore and that P1 had voluntarily submitted to the jurisdiction of the High Court of Bombay. It is further noted that while the Plaintiffs are permanent residents of Singapore, it is undisputed that they are also Indian nationals. The Defendant submits that the Plaintiffs have never contested the jurisdiction of the High Court of Bombay to hear the execution or attachment proceedings. In fact, it bears noting that P1 had instituted proceedings before the High Court of Bombay to stay the execution proceedings against the Mumbai property on the basis of the bankruptcy orders in Singapore. In other words, P1 made a conscious decision to seek the aid of the High Court of Bombay to stay the execution proceedings in India on the basis of his bankruptcy in Singapore. In this regard, it is useful to refer toSpencer Bower and Handley: Res Judicataat para 4.29 where it is stated that in cases ofres judicatabeing based on a foreign judgment, voluntary submission to that foreign jurisdiction is a basis for jurisdiction. To this end, if a party takes the chance of judgment in his favour, he is bound in any event. Thus, even if the decision of the Division Bench in refusing the stay of the execution proceedings is treated as a judgmentin personam, there is no doubt that P1 was amenable to the foreign judgmentin personam. In the case of P2, it will be recalled that she had applied to join as an interested party (see [10] above). That application was eventually dismissed on the grounds of want of prosecution. 140    The second question is whether the judgment is final and conclusive on the merits. In this regard, the fact that the decision of the Division Bench is being appealed against and that the appeal is currently pending before the Indian Supreme Court (as at the date of the hearing before me) does not necessarily mean that the decision has to be treated as being not final and conclusive. The real question is whether the decision is final for the purposes ofres judicata. To this end, it was acknowledged by the learned authors inSpencer Bower and Handley: Res Judicataat para 5.19 that a judgment may be final for the purposes ofres judicataeven though it may be reversed or varied by an appellate court. 141    In the Court of Appeal decision ofThe “Bunga Melati 5”, it was accepted at [81] that a judgment is final and conclusive on the merits if it is one which cannot be varied, re-opened or set aside by the court that delivered it. In this regard, the fact that the decision has been appealed against does not necessarily mean that the second requirement is not met. Further support for this proposition can be found in the earlier High Court decision ofThe “Vasiliy Golovnin”[2007] 4 SLR(R) 277, where Tan Lee Meng J cited at [43] the observations made by Tuckey J inThe Irini A (No 2)[1999] 1 Lloyd’s Rep 189 at 193: [O]n the facts I think that the decision of the Lome Court was final in the sense required to found issue estoppel. It is incapable of revisionby the Court which pronounced it. It is enforceable and has been enforced. That process is only provisional in the sense that if the Court of Appeal reverses the judgement the execution no longer stands ... That is no different from the position here wherethe fact that a judgement is under appeal does not mean that it is not final. [emphasis added] This particular extract was also cited in the Court of Appeal decision ofThe “Bunga Melati 5”at [85]. In fact, the following observations were made about the decision ofThe Irini A (No 2)inThe “Bunga Melati 5”at [86]: In our view, the decision of Tuckey J inThe Irini A (No 2)[1999] 1 Lloyd's Rep 189 neatly explains why a Lome Release Order was \"not in any sense interim or provisional\" ... In determining whether a foreign judgment was final and conclusive, Tuckey J held that \"[the English courts] must look not only at English law but also at what the foreign law itself says about the nature of the judgment\" (The Irini A (No 2)at 193), an approach earlier established by the seminal House of Lords decision inCarl Zeiss Stiftung v Rayner & Keeler Ltd[1967] 1 AC 853 at 919 (perLord Reid). We would highlight that this principled approach applies in the Singapore courts as well when determining whether a foreign judgment was final and conclusive ... Each determination must therefore turn on its own facts - and the court must be extra-sensitive, in particular, to \"the intention of the [foreign] judge in the earlier proceedings\" (Singapore Court Practice 2009(Jeffrey Pinsler gen ed) (LexisNexis, 2009) at para 18/19/14). 142    Moving on, it is noted that the requirement of finality and conclusiveness is not affected by the fact that the execution proceedings had been stayed. In the case of foreign judgments, the learned author inSpencer Bower and Handley: Res Judicataexplains at para 5.20 that if a foreign judgment can be re-opened by the tribunal which pronounced it, that judgment will not give rise tores judicata. It must be added that under English and Singapore law, upon a judgment being formally entered, that judgment is final even though it may still be subject to a residual power of revision under the “slip rule” or the court’s inherent jurisdiction. The reason is because such a residual power of revision does not enable the court to re-examine the decisionon the merits. 143    Returning to the facts in the present case, it is noted that the judgment of the Division Bench concerned an attempt by P1 to stay the execution proceedings that were already well under way in India against the Mumbai property (viz, the bankruptcy stay action). The judgment was final and conclusive on the merits of the application, which was based on the making of the bankruptcy orders in Singapore. The fact that the decision of the Division Bench was subsequently appealed to the Indian Supreme Court does not change the fact that the judgment was final and conclusive for the purposes ofres judicata. 144    There is of course the additional complication that the Plaintiffs have since brought separate and distinct proceedings to stay or set aside the execution proceedings on the ground that the HKSAR was not a reciprocating territory at the material time (viz, the reciprocating territory action). The question is whether this affects the finality of the judgment of the Division Bench that was delivered on 27 June 2005 in relation to the bankruptcy stay action. It will be recalled that the Division Bench subsequently ruled in favour of the Plaintiffs, holding that the HKSAR was not a reciprocating territory at the material time. P1 asserts that as a result of this subsequent judgment, all orders that arose out of the execution proceedings must bedeemedto have been set aside as the execution proceedings are no longer maintainable. Nonetheless, I am of the view that the question of whether such orders are deemed to have been set aside must be a matter of Indian law. In any event, it must also be recognised that both parties have referred to the fact that the Indian Supreme Court subsequently issued an order on 4 October 2010, requiring all parties to maintain the status quo in respect of the Mumbai property pending the hearing of the appeals. Therefore, as a whole, I am not convinced that the decision in the reciprocating territory action affects the finality of the decision in the bankruptcy stay action. 145    Returning to the bankruptcy stay action in India, it is further acknowledged that even if the proceedings were interlocutory in nature, there is no reason whyres judicatacannot arise. The learned author ofSpencer Bower and Handley: Res Judicataat para 5.31 gives the example of the dismissal of an application by a third party to have property excluded from amarevainjunction because it did not belong to the defendant (seeSCF Finance Co Ltd v Masri (No 3)[1987] 1 QB 1028). InPrinciples of Civil Procedure, the learned author observed at para 09.016 that a final decision on an interlocutory application is capable of giving rise tores judicata. I agree. 146    The third requirement is that there must have been identity of parties in the two sets of proceedings. The bankruptcy stay action was brought by King Shing Enterprises Ltd (“KSE”) and P1. KSE was a customer of the Defendant and P1 was the guarantor of the debts owed by KSE. It was in respect of a debt owed by KSE that a successful action was brought in the HKSAR against both KSE and P1. This eventually gave rise to the HKSAR judgment debt, the enforcement of which forms the basis of the longstanding dispute between the Plaintiffs and the Defendant. 147    In OS 601/2013, the same parties are involved with one slight difference – the addition of P2. As mentioned above at [1], P2 is the wife of P1. It is undisputed that P2 is not a debtor of the Defendant. In fact, P2 had commenced proceedings in India in 2005 for her to be included as an interested party in the execution proceedings on the basis that she was a co-owner of the Mumbai property. The proceedings undertaken by P2 were eventually dismissed for want of prosecution in August 2005. In this regard, the Defendant asserts that P1 is the party who commenced most of the applications in India in relation to the Mumbai property without P2 being joined as co-plaintiff. On this basis, the Defendant argues that the addition of P2 to OS 601/2013 makes no difference to the question ofres judicata. To this end, the Defendant refers to Peter Barnett,Res Judicata, Estoppel and Foreign Judgments(Oxford University Press, 2001) where the learned author made the following observations at para 3.17: The definition of ‘parties’ is given greater dimension by the suggestion that certain entities can bedeemedto be parties for preclusive purposes. Entities typically deemed as parties include: those who intervene and take part in the proceedings; those who insist on being added as a party and obtain an order to this effect; ... and those who have an interest in the dispute and a right to intervene, but who stand by and allow the litigation to be conducted by others. This latter category includes not only joint tortfeasors, but also a person in a probate case with such an interest; a person with an interest in land who allows another with the same interest to fight the litigation; and possibly an unproved creditor aware of a bankruptcy. [emphasis in original] In this respect, the Defendant’s position is that P2 was well aware of the proceedings in the HKSAR and India, and that she had stood by and allowed the litigation to be conducted by P1. On this basis, it was argued that P2 can be deemed to be a party for preclusive purposes. 148    In OS 601/2013, P2 has claimed to be the co-owner of the Mumbai property and that upon her being adjudged bankrupt in Singapore, her share in the Mumbai property would have vested automatically in the OA. While her claim to having an interest in the Mumbai property is based on her alleged financial contributions to the purchase, there does not appear to be any determination of the nature or extent of her interest (if any). Indeed, it bears repeating that P2 had commenced proceedings in respect of her claim to having an interest in the Mumbai property but the proceedings were eventually dismissed for want of prosecution. P2 was clearly aware of the execution proceedings commenced by the Defendant against the Mumbai property. She made no attempt to restore her application after the dismissal for want of prosecution. In this regard, I find it useful to also refer to the observations made inPrinciples of Civil Procedureat para 09.023 which cites the case ofSetiadi Hendrawan v OCBC Securities Pte Ltd and others[2001] 3 SLR(R) 296 (“Setiadi”) for the proposition that where a party pursues a claim and then decides to abandon it or to concede the case so that it is struck out or dismissed (and the order is not appealed against or set aside), that party would not ordinarily be entitled to re-litigate the same issues in new proceedings. While it is acknowledged that the present case is different fromSetiadi, it is nevertheless unclear as to why P2 decided not to restore her application and the fact remains that her application was dismissed for want of prosecution. Even if this may not be a case for strictres judicataagainst P2, I am of the view that the surrounding facts and circumstances do at least give rise to the spectre of an abuse of process. 149    Therefore, I find that the addition of P2 as a party to OS 601/2013 does not affect the issue ofres judicatabased on the decision in the bankruptcy stay action, at least not as against P1. In this regard, I find it useful to refer toSpencer Bower and Handley: Res Judicataat para 9.12, where the learned author highlights the rule (originating from probate jurisdiction) that any person claiming an interest in an estate could intervene and that if he allowed the litigation to be conducted by others in the same interest, he was bound by the result. Indeed, inGoh Nellie, Menon JC at [32] underscored the principle that the courts have not chosen a narrow approach to the requirement of identity of parties. To this end, Menon JC citedLee Tat Development Pte Ltd v Management Corporation of Strata Title Plan No 301[2005] 3 SLR(R) 157 (“Lee Tat Development”), where the appellant had brought earlier proceedings as the owner of two dominant tenements. Subsequently, the appellant brought an action as the owner of a subservient tenement. The change of status did not prevent the Court of Appeal from holding that the effective parties were the same. 150    The decision ofLee Tat Developmentconcerned a case where what had changed was the status of one of the parties while the identity of the party remained the same. In the present case, P2 was never made a party to the bankruptcy stay action in India. That being so, the issue is whether P2, by applying to be added as a party to the bankruptcy stay action, has taken a sufficiently active part such as to be subject tores judicata. In this regard, I refer to the observation inSpencer Bower and Handley: Res Judicataat para 9.12 that “whether an intervener becomes a party depends on the extent to which it participates”. 151    In the present case, P2 had applied to be joined as an interested party and to challenge the action for attachment. That application was dismissed for want of prosecution on 1 August 2005 and no further steps were taken to restore the application. This was reflected in the decision of the High Court of Bombay of 6 September 2005, delivered in respect of the application by ING Bank to protect its interest in the Mumbai property. Even if this is insufficient intervention by itself, there remains the point already alluded to above that P2, by not restoring her application, effectively chose to stand aside and to allow P1 to have conduct of the bankruptcy stay action in respect of the Mumbai property. One difficulty, however, is that P2’s interest in the Mumbai property may not be the same as the interest of P1. That said, though, the property in which her interest was claimed, the execution proceedings and the basis for the bankruptcy stay action (viz, the bankruptcy orders granted in Singapore) were the same. That being so, I am of the view that there is sufficient identity of the parties such that P2 is bound byres judicata. 152    The fourth question is whether there is sufficient identity of subject matter between the two actions. The bankruptcy stay action involved the seeking of various orders, including a stay of the execution proceedings, the setting aside of the warrant of sale and an injunction to restrain the Defendant from selling or taking any further proceedings towards the sale of the Mumbai property. The basis of the bankruptcy stay action was the fact that P1 had been adjudged bankrupt in Singapore on 4 February 2005 and, consequently, the OA in Singapore should be appointed as receiver and administrator in respect of the Mumbai property. Before a single judge of the High Court of Bombay, the application was dismissed on the basis that in cases where insolvency proceedings are started in a foreign country and an adjudication order is subsequently passed against an insolvent by the court of that country, that order has no effect on the immovable property of the insolvent in India and that consequently, the immovable property of the insolvent situated in India can be proceeded against by the decree holder (ie, the judgment creditor) against the insolvent. On appeal, the Division Bench, as discussed above, agreed and held at [8] that the bankruptcy order granted in Singapore, being later in time as compared to the attachment of the Mumbai property, could not affect the right of the attaching creditor. 153    While the terms of the relief sought in OS 601/2013 is broader than that in the bankruptcy stay action, there is no doubt that, at the core of both actions, the issues and the relief sought are the same: namely, whether the execution proceedings before the Indian courts should be stayed or set aside on the ground that the Plaintiffs were adjudged bankrupt in Singapore. Even if there exists a slight difference of detail in the sense that OS 601/2013 is based on the application of specific statutory provisions (viz, ss 76 and 105 of the BA), I am of the view that there is sufficient identity of subject matter to support a finding ofres judicata. That said, in the event that the issues are not identical in their finer details, I now proceed to deal with the question of whether a case for abuse of process or extendedres judicatahas been established. 154    InChing Mun Fong (executrix of the estate of Tan Geok Tee, deceased) v Liu Cho Chit and another appeal[2000] 1 SLR(R) 53, LP Thean JA (for the Court of Appeal) stated at [23] that abuse of process lay at the heart of the doctrine of extendedres judicata. In reaching this conclusion, the Court of Appeal referred to the holding of Somervell LJ inGreenhalgh v Mallard[1947] 2 All ER 255 at 257, where it was stated that: [R]es judicatafor this purpose is not confined to the issues which the court is actually asked to decide, but … it covers issues or facts which are so clearly part of the subject-matter of the litigation and so clearly could have been raised that it would be an abuse of the process of the court to allow a new proceeding to be started in respect of them. 155    InGoh Nellieat [53], Menon JC held that a court should determine whether there is an abuse of process by looking at all the circumstances of the case, including the question of whether the later proceedings are nothing more than a collateral attack upon the previous decision. This was said in connection with the question of whether there werebona fidereasons as to why an issue that ought to have been raised in earlier proceedings was not raised or whether there were special circumstances that might justify allowing the case to proceed. In the present case, it is apparent that the substantive issues raised in OS 601/2013 are similar to those dealt with in the bankruptcy stay action. I further note that no fresh evidence has been raised in the Singapore proceedings apart from the fact that the Plaintiffs have themselves mounted new and separate attacks before the Indian courts based on the question of reciprocity and the enforceability of the HKSAR judgment. Furthermore, while the lapse of time is on its own not determinative, I note that the Plaintiffs have waited almost eight years (since they were adjudged bankrupt back in 2005) to bring OS 601/2013 in Singapore, during which P1 took a very active part in defending and instituting proceedings in India in connection with the execution proceedings that date all the way back to 2003. With regard to P2, while it is recognised that she was not a party to many of these proceedings, her awareness of the proceedings has already been elaborated upon at [100] above. I further note that P2 had also commenced proceedings to intervene in the bankruptcy stay action and be joined as a party, although this was eventually dismissed for want of prosecution. 156    As Menon JC observed inGoh Nellieat [53], in deciding whether there is abuse of process, the court should be guided by the balance to be found between the demands of ensuring that a litigant who has a genuine claim is allowed to press his claim in court and “recognising that there is a point beyond which repeated litigation would be unduly oppressive to the defendant”. In the final analysis, I am of the view that a good case for abuse of process or extendedres judicatahas been made out.",
        "Conclusion": "157    In summary, I find that the Defendant has succeeded on thelocus standiobjection. It follows that on this ground alone the Defendant succeeds in the application under SUM 5391/2013. For the avoidance of doubt, I also find in favour of the Defendant on the issue ofres judicataand this is another ground for setting aside OS 601/2013. 158    Apart from that, for the sake of completeness, I also find that the grant of leave to serve SUM 5391/2013 out of jurisdiction (viz, the service order) is to be set aside on the grounds of: (a)     material non-disclosure; and (b)forum non conveniens. 159    For the reasons above, I am granting the Defendant’s application in SUM 5391/2013. 160    At the end of the hearing, counsel for both parties were in agreement that their submissions on costs would depend on the substantive outcome in SUM 5391/2013. On that basis, it was agreed that both parties would make submissions on costs only after the substantive merits of SUM 5391/2013 have been decided upon. Therefore, having now arrived at the decision to grant the Defendant’s application in SUM 5391/2013, I will proceed to hear parties on costs at a later date to be fixed.  [note: 1]Core Bundle (Volume 1), Tab 2. [note: 2]Core Bundle (Volume 1), Tab 5. [note: 3]Core Bundle (Volume 1), Tab 6. [note: 4]Core Bundle (Volume 1), Tab 7 at para 9."
    }
}