{
    "case_title": "Seow Hock Hin\n      v\n      MF Global Singapore Pte Ltd",
    "ncitation": "[2014] SGHC 42",
    "coram": "Tan Siong Thye JC",
    "sections": {
        "The Plaintiff’s case": "3       The Plaintiff alleged that he was entitled to\n                    accrued bonuses under his employment contract with the Defendant. These bonuses\n                    were related to the provisions for contingent events which did not take place\n                    and had since been returned,ie, written-back, to\n                    the Defendant. The Plaintiff sought to claim: (a)     US$124,624.19 which he alleged he was\n                        entitled to by way of accrued bonus following upon the write-back by the\n                        Defendant into its financial accounts of a sum of money which was previously\n                        set aside as contingency for its own tax liabilities (“the Tax\n                        Provision Claim”); and (b)     US$100,000 which he alleged he was entitled to by way of\n                        accrued bonus a certain sum set aside by the Defendant as contingency for\n                        bad debts (“the Bad Debt Provision\n                Claim”). 4       The Plaintiff submitted that the above sums\n                    represented part of the bonuses which were purportedly declared by the Defendant\n                    and had accrued in his favour prior to the appointment of the Liquidators on 1\n                    November 2011. Hence these sums became due and payable to him.",
        "The Defendant’s case": "5       The Liquidators resisted the Plaintiff’s\n                    claims on the following grounds: (a)     The Defendant had the sole discretion\n                        to declare the amount of bonuses that were due to the Plaintiff. In this\n                        case, the sums claimed by the Plaintiff as bonuses had not been declared by\n                        the Defendant as the necessary approval by the Defendant’s executive\n                        officers prior to declaration was not given; and (b)     The Plaintiff and his team were not\n                        automatically entitled to such amounts deducted from the calculation of the\n                        “net available bonus pool” (see [13] below) as bonuses once\n                        such deductions were written-back into the Defendant’s financial\n                        accounts.",
        "The issues": "6       These were the issues before the court: (a)     Did the Plaintiff’s employment\n                        contract entitle him to the bonuses? (b)     Did the Defendant declare the bonuses in the\n                        Plaintiff’s favour?",
        "Did the Plaintiff’s employment contract entitle him to the\n                bonuses?": "7       The Plaintiff’s claim must be premised on\n                    his employment contract entered into with the Defendant on 29 March 2006. Clause\n                    5 of his employment contract stipulated that: The payment of such bonus is at thesole-discretion of\n                            the Companyand is only payable provided you are in the\n                        employment of the Company on thedate it is\n                            declared. [emphasis added] 8       Therefore, it is very clear from clause 5 of the\n                    Plaintiff’s contract of employment that the payment of bonuses is neither\n                    a right nor an entitlement. Bonuses are payable at the “sole discretion\n                    of the Company” and “on the date it is declared”. Hence if\n                    the bonuses claimed in this case were not declared, the Plaintiff would not be\n                    entitled to them. 9       There was another letter from the Defendant to\n                    the Plaintiff dated 25 August 2011 which further indicated that the payment of\n                    bonuses was entirely discretionary. The operative date for the bonus eligibility\n                    in that letter was 1 October 2011. It stated: Bonus Eligibility The Company operates performance related bonus schemes for employees.\n                        Under the Bonus Scheme in which you will be eligible to participate,bonuses will be determined on a discretionary\n                            basisand paid semi-annually (“Semi-Annual\n                        Bonus”). The Companyreserves the right to pay a portion of any\n                            bonus payment(or other incentive award, including the\n                        Semi-Annual Bonus), in the form of long-term incentive vehicles (restricted\n                        shares, units, options or other), in a manner consistent with Company\n                        policies applicable to all similarly-situated employees. [emphasis added] 10     In the Court of Appeal case ofLatham Scott v Credit Suisse First Boston[2000] 2\n                    SLR(R) 30, the employee argued that he was entitled to a certain bonus even when\n                    he had been dismissed by the company and the bonus was discretionary. The bonus\n                    clause in that employee’s employment contract stated that “a bonus\n                    may be paid to you at the end of each calendar year, based on Company\n                    profitability and your performance during the year”. The Court of Appeal\n                    interpreted this clause to mean that payment of the bonus was entirely at the\n                    discretion of the company. The employee was correspondingly not entitled to the\n                    bonus as it had not been declared. The Court of Appeal made the following\n                    remarks at [71]–[72]: In our view, it would be wrong to allow an employee in Latham’s\n                        position to lay claim to a discretionary bonus on a proper construction of\n                        his employment contract when his services were terminated even before his\n                        bonus was properly declared. In bothWalz v Barings\n                            Services Ltd, a preliminary hearing before the English\n                        Industrial Tribunal, andBajor v Citibank International\n                            plc(Queen’s Bench Division, 19 February 1998,\n                        unreported), the plaintiffs were employed in an industry in which the\n                        employees operated within a “bonus culture” in which bonuses\n                        were very commonly and even invariably paid. However, both plaintiffs were\n                        held not to be entitled to claim the bonus as a matter of contractual\n                        obligation after being dismissed, even if they were wrongfully dismissed as\n                        in the case ofBajor v Citibank International\n                            plc. InWalz v Barings Services\n                            Ltd, this was so even though the bonus had already been\n                        announced by the respondents. It was held there that, as the bonus was\n                        totally discretionary, there was simply no obligation to pay. Announcing it\n                        did not convert the payment of the bonus into a contractual\n                        obligation. Latham’s situation was akin to the plaintiffs in these two cases.Unless the bonus had been expressed to be guaranteed,\n                            an employee in Latham’s position could not claim to be legally\n                            entitled to a bonus, the granting and quantum of which are entirely at\n                            the discretion of the employer. While he might have hoped for\n                        a bonus if he had indeed remained in the employ of CSFB, the fact remained\n                        that, even then, he would not have been able to claim to be entitled to a\n                        bonus as of right as it was entirely at the discretion of CSFB.\n                        … [emphasis added] 11     In this case, the Plaintiff also agreed at\n                    para 10 of his affidavit dated 12 June 2013 (“the Plaintiff’s\n                    Affidavit”) that his bonuses were paid at the “sole\n                    discretion” of the Defendant. In the same affidavit, he explained that\n                    the finance department would compute the bonus pool based on the percentage of\n                    the net profit of his department. He would then allocate the bonus amongst the\n                    people in his department including himself. This bonus allocation had to be\n                    approved by other senior executive officers of the Defendant. Therefore, the\n                    Plaintiff acknowledged that the declaration of a bonus had to go through a\n                    system of calculation, allocation and, finally, approval from the Defendant.\n                    However, he submitted that the bonuses which he sought had already been declared\n                    and that he should, accordingly, be paid.",
        "Did the Defendant declare the bonuses in the Plaintiff’s\n                favour?": "The Defendant’s procedure for the computation of\n                bonuses 12     The next important issue is to determine\n                    whether the bonuses claimed by the Plaintiff had been declared by the Defendant.\n                    This would require an understanding of the system of computing bonuses which\n                    forms part of the process undertaken for bonuses to be finally declared. The\n                    affidavits of the Chief Executive Officer (“CEO”) and Chief\n                    Financial Officer (Asia Pacific) of the Defendant, Mr Rajendra Bhambhani and Mr\n                    Jason Foo, respectively, explained the bonus approval system. They stated that,\n                    in the ordinary course of business, the Defendant would consider in its sole\n                    discretion whether or not to declare and pay a quarterly bonus to the Plaintiff\n                    and/or his team members. This would be at the end of each quarter in a calendar\n                    year. The employees had no right or entitlement to such bonuses unless there was\n                    a declaration to that effect. 13     To facilitate the Defendant’s exercise\n                    of its discretion, a formula is used as a general guideline. At the end of each\n                    quarter, the net profit earned by the Plaintiff's team would be calculated. This\n                    would be the “net profit available for payout”. A percentage of\n                    this “net profit available for payout” would then be identified as\n                    the “gross available bonus pool”. This percentage was not fixed\n                    and would vary across the years. From this “gross available bonus\n                    pool”, certain deductions would be made to arrive at the “net\n                    available bonus pool”. 14     The Plaintiff would then submit a proposal as\n                    to how the “net available bonus pool” should be allocated between\n                    him and his team members. This would be subject to the approval of the\n                    Defendant’s Global Head of Futures and Options, Mr Gary Pettit (“Mr\n                    Pettit”). However, even after Mr Pettit had approved the\n                    Plaintiff’s proposal, the actual declaration of bonuses was subject to the\n                    final decision of the Defendant’s CEO. The CEO is not bound by the\n                    Plaintiff’s proposal in this regard and the actual bonuses declared may\n                    vary from that proposed by the Plaintiff as they would still be subject to the\n                    CEO’s approval. Was the bonus of US$124,624.19 relating to the Tax Provision Claim\n                declared by the Defendant? 15     The Defendant had set aside a contingent sum\n                    of US$491,913.95 for its Taiwan Branch for the financial year ending 31 March\n                    2007. This sum was to cater for potential fines and withholding taxes which\n                    might be imposed by the Taiwanese tax authorities from 2003 to 2006. After a\n                    fine of US$76,500 was paid in March 2011, a sum of US$415,413.95 was\n                    written-back in 2011 by the Defendant to its financial accounts. The Plaintiff\n                    argued that he was entitled to 30% of the write-back which was his bonus of\n                    US$124,624.19. He contended that the bonus was declared in his favour but\n                    payment was deferred by the Defendant on the basis of potential tax\n                    liability. 16     However, the evidence did not support the\n                    Plaintiff’s contention. In fact, the Plaintiff had attempted to seek\n                    approval from Mr Pettit and the Defendant’s CEO for the pay out of the\n                    bonus in relation to the Tax Provision Claim. In an email to Mr Pettit and the\n                    CEO on 26 April 2011, the Plaintiff stated: 4.    We paid a fine of USD76,500 in Mar 2011, and\n                            because tax authority can only back-track tax delinquencies for up to 5\n                            years, we would not be liable for any tax payments or fines for FY2003,\n                            FY2004 and FY2005. As such, we have written back the remaining\n                            provisions, amounting to USD415,413.95. 5.    Previously, when we made the provisions, it\n                            impacted the bonus pool, and the bonus of the Dept was affect [sic]. As such, now as we are writing back the\n                            provisions, I am of the opinion that we should add the amount back to\n                            the Net Revenue line of the Dept, so that it would benefit the bonus\n                            pool for the Dept. 6.For your kind approval\n                                please. [emphasis added] 17     If it was the Plaintiff’s case that the\n                    bonus had been declared, why then did he still attempt to seek approval from Mr\n                    Pettit or the CEO? There was no reason to do so unless he was of the belief that\n                    the declaration of such a bonus remained subject to the approval of Mr Pettit\n                    and the CEO. It is therefore evident that even the Plaintiff himself was of the\n                    opinion that he was not entitled to such a bonus in relation to the Tax\n                    Provision Claim without the approval of both Mr Pettit and the CEO. No such\n                    approval was given in response to the Plaintiff’s email. Furthermore, in\n                    an email on 30 October 2011, the Plaintiff requested Mr Pettit to approve the\n                    addition of US$106,000 to his bonus pool. This US$106,000 was calculated on the\n                    basis of 25.5% of the residual contingent sum in relation to the Tax Provision\n                    Claim. Again, no approval was given. 18     The Plaintiff’s foundation for the Tax\n                    Provision Claim was that he used the method of calculation of bonuses in the\n                    ordinary course of business,ie, the bonus formula\n                    described above at [13]. This was his basis to justify his entitlement to the\n                    bonus notwithstanding the fact that there was no approval given by the Defendant\n                    and, correspondingly, no declaration. It must be emphasised that the declaration\n                    of bonuses is at the sole discretion of a company unless guaranteed under a\n                    contract of employment. In many instances, a company may adopt a general\n                    guideline as to how to compute the quantum of bonuses to be declared in the\n                    ordinary course of business. However, a company should not in any way be\n                    fettered and bound by such guidelines. The economic climate is always changing.\n                    Sometimes a company may experience a windfall and sometimes it may face a lack\n                    of business. At other times, a company, such as the Defendant here, may even\n                    face financial difficulties of such an extent that it eventually has to enter\n                    into liquidation—a situation which cannot be described as being in the\n                    ordinary course of business. The amount of bonuses declared by a company would\n                    thus inevitably be based on a consideration of the economic climate and other\n                    relevant factors and vary in the light of such changing circumstances.\n                    Therefore, although a guideline as to bonus computation grants the employee a\n                    degree of certainty as to the quantum of bonus he may receive, it should not tie\n                    the hands of the company such that it can no longer depart from such a guideline\n                    if the economic circumstances demand that it does so. If the company faces a\n                    tightening budget it should be allowed to depart from such a guideline, even to\n                    the extent of not declaring a bonus if necessary. Even if the sums in question\n                    were part of the profits generated by an employee, such as in the case of the\n                    Plaintiff here, it must be remembered that a company declares bonuses based on\n                    the performance of the company as a whole and not the employee individually.\n                    Hence, in this scenario, there was no declaration of the bonus as there was no\n                    approval from the Defendant. Ultimately, while it is possible to calculate the\n                    bonus in accordance with the bonus formula this exercise is fruitless without\n                    the Defendant’s approval. 19     As for the Plaintiff’s calculation of\n                    the bonus accrued under the Tax Provision Claim, this was derived as a\n                    percentage of the “net available bonus pool”. This percentage was\n                    not fixed and was determined by the Defendant. In fact, in his email to Mr\n                    Pettit, he indicated the percentage as 25.5% of US$415,413.95 which is\n                    US$106,000 for his team while his claim in court of US$124,624.19 is premised on\n                    30%. Hence he was not certain of the percentage himself as the Defendant did not\n                    have a fixed percentage. As the Plaintiff stated at para 18 of the\n                    Plaintiff’s Affidavit: Throughout my employment, my bonus was calculated as a percentage of the\n                        net profit of my department. For the earlier period, the bonus was set at\n                        20% of the net profit whilst in later years my bonus was set at 25% or 30%\n                        of the net profit. Thus when the Plaintiff calculated his bonus for the Tax\n                        Provision Claim he was unsure as to whether it was to be calculated on the\n                        basis of 25.5% or 30%. 20     The very fact that the percentage in question\n                    was not fixed and was to be determined at the discretion of the Defendant is\n                    further evidence that the amount claimed by the Plaintiff under the Tax\n                    Provision Claim cannot automatically accrue upon a write-back. It remained for\n                    the Defendant to determine the exact percentage of the residual contingent sum\n                    to be included in the “gross available bonus pool”. There was no\n                    such determination in this case and this explains why even the Plaintiff\n                    deviated in his position as to what percentage of the residual contingent sum he\n                    intended to claim. This again indicated that no bonus had been declared by the\n                    Defendant. Thus there was no basis for the Plaintiff to claim the sum of\n                    US$124,624.19 under the Tax Provision Claim. Was the bonus of US$100,000 relating to the Bad Debt Provision\n                declared by the Defendant? 21     The Plaintiff argued that the Bad Debt\n                    Provision Claim had been previously declared by the Defendant in his favour.\n                    However, the payment was held back by the Defendant to provide for potential bad\n                    debts. The only evidence referred to by the Plaintiff was the Quarterly Payout\n                    for October 2008 which showed a bad debt reserve of US$100,000. This does not\n                    indicate whether this sum was declared as a bonus by the Defendant upon the\n                    Defendant’s approval. The Defendant, on the other hand, submitted that\n                    this sum was not declared in the Plaintiff’s favour. 22     As explained by the Defendant’s CEO in\n                    the procedure above at [13], during the computation of the bonus to be declared,\n                    certain deductions would be made from the “gross available bonus\n                    pool” to arrive at the “net available bonus pool”. One such\n                    deduction would be the sum required for maintaining a bad debt reserve. The\n                    Defendant had a practice of having a bad debt reserve for each team. In\n                    computing the “net available bonus pool” for each team, 15% of\n                    each team’s “gross available bonus pool” in each quarter was\n                    deducted over the years to arrive at the “net available bonus\n                    pool” for that quarter. Once the bad debt reserve reached US$100,000, no\n                    further deductions were made unless the Defendant decided to increase the\n                    provision beyond this sum. When declaring the respective bonuses, the Defendant\n                    only considered the “net available bonus pool” after the deduction\n                    of amounts to be used for contribution into the bad debt reserve and not the\n                    “gross available bonus pool”. 23     Hence, the sums set aside for bad debt cannot\n                    be considered as accruing automatically or as having been declared in the\n                    absence of approval. Furthermore, the affidavit of one of the Liquidators, Mr\n                    Bob Yap, dated 18 July 2013 at para 15(d) also stated that: … [I]t was never a policy or practice of the Company nor was there\n                        any agreement between the Company and the Plaintiff (and his team members)\n                        that amounts which were deducted by way of “bad debt reserve”\n                        in arriving at the “net available bonus pool” would vest in or\n                        be paid to any of them at any time (including, in particular, if such\n                        “bad debt reserve” turns out to be unutilised) or treat any\n                        part of such “bad debt reserve” as prospective or contingent\n                        bonuses vested in them … Both claims were not declared by the Defendant 24     There was no evidence to suggest that the\n                    bonuses relating to the Tax Provision Claim and the Bad Debt Provision Claim\n                    were declared by the Defendant. No approvals were given by Mr Pettit or the CEO.\n                    Their approvals were necessary for bonuses to be declared. The Plaintiff has\n                    failed to prove these vital facts on a balance of probabilities. InTan Hup Thye v Refco (Singapore) Pte Ltd (in members’\n                        voluntary liquidation)[2010] 3 SLR 1069, the managing director\n                    in that case claimed for his bonus accrued to him after the voluntary winding up\n                    of the company. The company refuted the claim. Judith Prakash J decided against\n                    the managing director and said at [64]: The evidence also showed that far from simply determining what bonus was\n                        payable according to the Bonus Formula and paying that sum out after the end\n                        of each financial year, the plaintiff invariably sought Mr Bennett’s\n                        approval. At trial, the plaintiff admitted that he sought such approval from\n                        Mr Bennett in the latter’s capacity as the representative of Refco\n                        Inc. At the end of each financial year, the plaintiff would write to Mr\n                        Bennett seeking his approval before the specific bonus amounts were paid\n                        out. The plaintiff also admitted that over the period from 1996 to 2005, he\n                        had consistently sought approval from the defendant’s shareholders to\n                        pay bonus. If the plaintiff and the other employees of\n                            the defendant had been contractually entitled to bonus, there would have\n                            been no need to seek approval for payment of the same.This\n                        evidence also established that the amount of bonus to be paid by the\n                        defendant had to be approved, ultimately by Mr Bennett; it was not fixed by\n                        the Bonus Formula. [emphasis added] 25     Similarly, in this case, the Plaintiff had to\n                    show that the bonuses were declared by the Defendant. Such declaration must be\n                    premised on the approvals of Mr Pettit and the CEO in order for the Plaintiff to\n                    succeed in his claim. This was not proven and, as explained, there was no reason\n                    why the bonuses claimed by the Plaintiff could accrue automatically as a result\n                    of the bonus formula only.",
        "The claimed amounts did not solely represent the Plaintiff’s\n                bonuses": "26     It is, therefore, clear that the Plaintiff was\n                    not entitled to the bonuses under both the Tax Provision Claim and the Bad Debt\n                    Provision Claim. However, I further noted that the sums claimed by the Plaintiff\n                    did not solely represent his bonuses. Rather, they were his entire team’s\n                    “net available bonus pool” which was to be distributed amongst him\n                    and his team members. This was admitted by the Plaintiff. As described by the\n                    Plaintiff at para 20 of the Plaintiff’s Affidavit, he was to provide the\n                    proposed final allocation of such sums to Mr Pettit for approval. In this case,\n                    no such proposal was provided and no allocation was approved by Mr Pettit. The\n                    Plaintiff adduced no breakdown as to the allocation of the bonuses claimed by\n                    him between him and the other members of his team. Furthermore, in his email\n                    dated 26 April 2011 to Mr Pettit and the Defendant’s CEO in relation to\n                    the Tax Provision Claim, he stated that: Previously, when we made the provisions, it impacted the bonus pool, and\n                        the bonus of the Dept was affect [sic]. As\n                        such, now as we are writing back the provisions, I am of the opinion that we\n                        should add the amount back to the Net Revenue line of the Dept, so that itwould benefit the bonus pool for the Dept.\n                        [emphasis added] 27     It is apparent that by referring to his\n                    department instead of himself, and by viewing the benefit to be for the entire\n                    department instead of himself, the Plaintiff was aware that the sum claimed\n                    under the Tax Provision Claim was intended for his whole team and not just\n                    himself only. Likewise, the bad debt reserve was maintained via deductions from\n                    the entire team’s “gross available bonus pool”. Hence the\n                    Bad Debt Provision Claim should also not accrue to the Plaintiff\n                alone. 28     This was an action taken out by the Plaintiff.\n                    He should have indicated his share of the bonuses. Instead, he claimed for the\n                    entire amount including bonuses which, assuming that they had accrued, should\n                    have been paid out to his team members who were not parties to the action. This\n                    crucial information was not disclosed in any of his affidavits. Even the\n                    Plaintiff’s lawyer stated at the hearing that he was unaware that the sums\n                    claimed were for the whole team and that he was instead under the impression\n                    that these sums belonged solely to the Plaintiff. The Plaintiff had in fact\n                    attempted to claim for a large sum of money when he should have done so only for\n                    a smaller sum, the difference of which did not belong to the Plaintiff but to\n                    his team members.",
        "Conclusion": "29     In summary, the payment of bonuses was at the\n                    sole discretion of the Defendant. The Plaintiff did not have an automatic or\n                    contractual entitlement to the bonuses. The Plaintiff had failed to prove on the\n                    balance of probabilities that the bonuses were declared by the Defendant. I\n                    therefore dismissed his claim with fixed costs."
    }
}