{
    "case_title": "Chua Boon Chye\n      v\n      Public Prosecutor",
    "ncitation": "[2014] SGHC 135",
    "coram": "Choo Han Teck J",
    "sections": {
        "Background facts": "3       First, the appellant’s role. The appellant\n                    was the director and general manager of Aegean Bunkering (Singapore) Pte Ltd\n                    (“AB”). AB was a wholly owned subsidiary of Aegean Marine\n                    Petroleum SA (“AM”), incorporated in Liberia. The directors of AM\n                    were Greek nationals. AM was in turn wholly owned by Aegean Marine Petroleum\n                    Network Inc (“AMPN”), which was incorporated in New York. AB was\n                    in the business of purchasing marine fuel oil (“MFO”). Once AB\n                    makes the purchase, according to the appellant, it would refer the operational\n                    aspects of delivery to a related company, Aegean Breeze Shipping Pte Ltd\n                    (“ABS”). Ioannis Sgouras (“Ioannis”), a defence\n                    witness, was the director of ABS. ABS was wholly owned by Aegean Shipholdings\n                    Inc, which was in turn wholly owned by AMPN. According to the appellant, ABS was\n                    part of the “operational arm” of AMPN, whereas AB and AM were part\n                    of the “trading arm”. 4       Second, the operations at the terminal. Shanker\n                    s/o Balasubramaniam (“Shanker”) was the Operations Executive at\n                    the Chevron Singapore Pte Ltd Terminal, a facility at No 210 Jalan Buroh\n                    (“the Terminal”). As part of his role, which included taking on\n                    the duty of shift superintendent, he would track the movement of fuel at the\n                    Terminal. The Terminal had approximately 45 tanks which stored different\n                    grades of fuel, and some of these tanks were leased to companies such as\n                    Marubeni International Petroleum (S) Pte Ltd (“Marubeni”) and\n                    Petrobras Singapore Pte Ltd (“Petrobras”). In the course of\n                    operations, minor discrepancies in tank readings could arise, which lead to\n                    “gains” and “losses” in fuel. When fuel is pumped\n                    into vessels, for instance, there may be a variance between the reading on the\n                    shore tank and the reading on the vessel. The tolerance level for this variance\n                    is 0.5%. Any amount constituting gains (within this 0.5%) is retained at the\n                    Terminal. Shanker, as shift superintendent, was the custodian of these\n                    discrepancies. At the end of each shift, he had to record them in a log book and\n                    report to his superior, Tan Poo Lee (the prosecution’s eighth\n                    witness). 5       Shanker conspired with two petroleum surveyors,\n                    Remy bin Khaizan (the prosecution’s second witness) (“Remy”)\n                    and Viknasvaran s/o Kumarasamy (the prosecution’s third witness)\n                    (“Viknasvaran”) to siphon off and sell the gains of fuel at the\n                    Terminal. As petroleum surveyors, Remy and Viknasvaran had to take measurements\n                    of the fuel in a barge before and after loading. However, in siphoning off fuel,\n                    their roles were as follows: (a)     Shanker identified the gains of fuel\n                        which had not been reported to Chevron. (b)     Shanker then informed Remy both of the quantity\n                        of gains available, and of vessels that were arriving at the Terminal for\n                        loading. (c)     Remy\n                        then negotiated with the vessel’s owner or representative (such as the\n                        appellant) for the sale of the illicit fuel. (d)     To conceal their wrongful acts either Remy or\n                        Viknasvaran boarded the vessels and took measurements of the fuel before and\n                        after loading. The figures were adjusted such that the loading of the excess\n                        fuel would not be detected (for instance, by inflating the pre-loading\n                        figure). (e)     When\n                        the loading was completed, Shanker prepared the Certificate of Quantity\n                        – which also excluded the quantity of the excess\n                    fuel. (f)     The payments\n                        for the excess fuel were made in Singapore dollars, in cash, and without any\n                        receipt. 6       They carried out their plan between 28 and 29\n                    October 2007, this plan was set in motion. Shanker was on duty as shift\n                    superintendent on 29 October 2007. He identified approximately 105 metric tonnes\n                    of fuel (gains) to sell and informed Remy accordingly. He also informed Remy\n                    that the MV Milos, a barge operated by ABS, was due at the Terminal to load 2500\n                    metric tonnes of MFO of 380CST grade, purchased from Marubeni on the night of 29\n                    October 2007. The 2500 metric tonnes, priced at US$439.40 per metric tonne, came\n                    up to US$1,100,827. Remy approached a broker, Hussein Ahmad bin Abdul Satar (the\n                    prosecution’s fifth witness) (“Hussein”), to sell the excess\n                    fuel. Hussein approached the appellant offering this excess fuel. The appellant\n                    understood that the fuel came from the “black market” (according\n                    to his statement). They agreed on a price of S$180 per metric tonne for the 105\n                    metric tonnes. 7       On 29 October 2007, the MV Milos berthed at the\n                    Terminal. The 105 metric tonnes were loaded onto the barge. Subsequently,\n                    the appellant arranged to meet Hussein at a hawker centre to make payment of\n                    S$18,900 from AB’s petty cash account. Shanker, Remy, Viknasvaran and\n                    Hussein were all convicted of offences of criminal breach of trust in respect of\n                    the fuel. 8       The third aspect is the nature of MFO, or fuel.\n                    MFO is graded according to viscosity. The unit of viscosity used is the\n                    centistoke (“CST”). The three main types of MFO in the industry\n                    are 180CST, 380CST and 500CST. 180CST is the most expensive, whereas 500CST is\n                    the cheapest. Each of these grades of fuel has to comply with certain quality\n                    standards. Fuel that does not is generally known as off-specification, or\n                    “off-spec”. Off-spec fuel generally fetches a lower price.\n                    Off-spec fuel, however, does not refer to a specific grade of fuel. Rather, it\n                    is a residual category that encompasses any fuel that does not meet\n                    specifications contracted for. “Off”, in “off-spec”,\n                    is hence a relative concept.",
        "Trial": "9       The appellant’s case at trial was that\n                    none of the elements of the offence of dishonest receipt of stolen property were\n                    made out. His arguments were as follows: (a)     First, the fuel was not\n                        “stolen property”. “Stolen property” must have\n                        been unlawfully taken from someone. The prosecution thus had a burden to\n                        prove who the original owners of the property were. In this case, the\n                        prosecution had not proven that the fuel belonged to Chevron. Shanker simply\n                        pleaded guilty to the charge of criminal breach of trust because he wanted\n                        to avoid a more serious sentence. His conviction was no indication that the\n                        fuel belonged to Chevron. In fact, the excess fuel could have belonged to\n                        Marubeni, Petrobas, or the other vessels at the Terminal. Without proof of\n                        the owner, the fuel cannot be said to have been “stolen\n                        property”. (b)     Second, it was not the appellant who had purchased the fuel. The\n                        appellant was a mere conduit between Ioannis and Hussein. The appellant was\n                        never in exclusive possession or control of the fuel. After receiving the\n                        call from Hussein, the appellant spoke to Ioannis and conveyed\n                        Hussein’s offer. Ioannis told him that ABS was interested in buying\n                        the excess fuel, and he duly replied to Hussein. Subsequently, Ioannis\n                        passed him the money for the fuel, which he handed over to\n                    Hussein. (c)     Third, the\n                        appellant was not dishonest, nor did he have reason to believe that the fuel\n                        was stolen property. During the conversation with Hussein, he asked for the\n                        source of the fuel. However, Hussein did not tell him the source. This was a\n                        norm in the industry as brokers did not want to reveal their sources lest\n                        render themselves (as middlemen) obsolete. Further, the price did not seem\n                        unduly low as Hussein told the appellant it was off-spec, and not\n                        380CST. 10     The District Judge accepted the\n                    prosecution’s case, namely, that the fuel was stolen property, the\n                    appellant had reason to believe it was stolen, and he had indeed received it. I\n                    now consider each of the appellant’s grounds of appeal.",
        "Grounds of appeal against conviction": "",
        "(1) Had the District Judge erred in finding that the charge had been\n                made out at the close of the prosecution’s case?": "11     The appellant first argued that the\n                    prosecution had amended the charge several times leading up to trial. First, on\n                    28 December 2011, the prosecution charged the appellant with dishonest receipt.\n                    In April 2012, the charge was amended to one of abetting Thet Lwin, the bunker\n                    clerk on board the MV Milos at the time of receipt. On 15 May 2012, the charge\n                    was amended to the original version – dishonest receipt. On the first day\n                    of trial, the charge was again amended. This time, the word\n                    “approximately” was used to qualify the quantity and the total\n                    price of the fuel. The appellant argued that these\n                    “prevarications” by the prosecution set the context in which I\n                    should question if the charge had been made out. The charge of dishonest receipt\n                    in this case required that: (a)     The fuel was received by the\n                        appellant; (b)     The\n                        quantity of the fuel was 105 metric tonnes and the quality was 380CST\n                        (valued at S$69,106.70); (c)     The fuel was stolen property, belonging to Chevron;\n                        and (d)     The receipt\n                        by the appellant was dishonest, and the appellant had reason to believe the\n                        fuel was stolen property. I consider each\n                        of these in turn. (a) Was the fuel received by the appellant? 12     The District Judge found that the appellant\n                    had received the fuel, based on his statement to the CPIB dated 15 May 2008\n                        (Chuaat [34]). The relevant parts of the\n                    statement are as follows: 7. Immediately, I understood that the man was trying to sell me 105MT\n                        cheap black market marine fuel. I asked him how much was he offering and\n                        after some bargaining he said he will charge me S$180/- per MT. As this was\n                        way cheaper than the market price of USD550/MT, I agreed to buy the whole of\n                        105MT. 8. I then passed instruction to the bunker clerk on board Milos at the\n                        Caltex terminal to expect an extra delivery of 105MT on top of the 2500MT\n                        which Aegean had ordered from Marubeni. Marubeni is a trader whose stock was\n                        kept at Caltex premises and sell off from Caltex terminal. 9. After the entire delivery process, I received feedback from Milos\n                        bunker clerk that the 105MT extra had been received. As such, a meeting was\n                        called with the man and we met up at Block 22 Hawker Centre, Havelock Road.\n                        During the meeting, I handed over a sum of S$18,900/- to him. I was shown to\n                        a man in CPIB today and I confirmed that he is the man whom I had passed the\n                        money to. (Recorder’s note: Hussein Ahmad Bin Abdul Satar.) I knew his\n                        name as Hussein as this was the name he introduced himself. After I passed\n                        him the money, we went our separate ways. Before me, the appellant argued that the quoted parts of the\n                        statement did not show that he had received the fuel – at best they\n                        would only prove that the appellant had abetted Thet Lwin, the bunker clerk\n                        (referred to in paragraphs 8 and 9 of the statement). Second, he argued that\n                        the District Judge was wrong to rely on his statement for the content of the\n                        conversation between Thet Lwin and the appellant, as this was hearsay\n                        evidence. In fact, he maintained that the conversation between him and Thet\n                        Lwin had never taken place, and that it was Ioannis instead who had given\n                        instructions to Thet Lwin to expect extra fuel. Third, the appellant argued\n                        that the District Judge was wrong to infer that the 105 metric tonnes were\n                        loaded onto the MV Milos just because the appellant was the one who paid\n                        Hussein, 13     Although subsequent payment may not be\n                    sufficient to prove that the fuel was transferred, it was a relevant indicator.\n                    As the District Judge noted (Chuaat [34]),\n                    “otherwise [there would have been] no reason for the payment”. In\n                    the appellant’s statement, he also stated that he “received\n                    feedback from Milos bunker clerk that the 105MT extra had been received”.\n                    It was hence generally uncontroversial that the fuel had been loaded onto the MV\n                    Milos. The question was whether this would constitute receipt within meaning of\n                    the charge. I found that it did. Receipt need not amount to physical possession.\n                    In this case, control was sufficient. The appellant had control over the 105\n                    metric tonnes of fuel (through his negotiations with Hussein and the bunker\n                    clerk), and he was the one who arranged for it to be loaded onto the MV\n                    Milos. (b) Were the quantity and quality of the fuel 105 metric tonnes and\n                380CST respectively? 14     The District Judge had found that the amount\n                    of fuel in the charge (105 metric tonnes) was proven (Chuaat [34]), as was the grade (380CST) (Chuaat [41]). For the amount, the District Judge relied the\n                    appellant’s statement (cited, in part, above at [11]). I am of the opinion\n                    that he was correct. The appellant’s contention that the amount could not\n                    have been established to precision did not raise a reasonable doubt of his guilt\n                    in this case. 15     In determining the quality, the District Judge\n                    “considered that the evidence of PW8 confirmed that the Chevron Terminal\n                    and Tank 560 which push the fuel through the pipelines, only contain 380CST fuel\n                    and all the pipelines to the Marubeni tanks contain [380CST fuel]”. PW8,\n                    or the prosecution’s eighth witness, was Tan Poo Lee. The appellant argued\n                    that the District Judge was wrong to rely on Tan Poo Lee’s evidence as, in\n                    cross-examination, he stated that different grades of fuel were stored at the\n                    Terminal and that he may not have been the best person to give evidence about\n                    gains in fuel at the Terminal as he only worked office hours and was not present\n                    at the time of the transfer, unlike Shanker. Shanker’s evidence was that\n                    he was not sure of the source of the excess fuel. What Tan Poo Lee was sure of\n                    was that the most common type of fuel in the terminal was 380CST. The appellant\n                    did not contest this. On a matter of probability, given that the fuel came from\n                    the Terminal, it was likely 380CST. Furthermore, based on the appellant’s\n                    statement, he understood that the fuel was 380CST. This can be inferred from a\n                    portion of paragraph 7, “… this was way cheaper than the market\n                    price of USD550/MT” and paragraph 4 where he stated that (he thought\n                    that) the price of 380CST was about USD550 per metric tonne. There was no\n                    mention of off-spec – or any other type of – fuel. On the totality\n                    of the evidence, I find that the District Judge was correct to find that the\n                    fuel was 380CST. (c) Was the fuel stolen property? 16     The District Judge held that “in the\n                    definition of stolen property in section 410 of the Penal Code, the emphasis is\n                    on possession of property” (Chuaat [21]).\n                    Section 410, which defines stolen property, reads: (1) Property the possession whereof has been transferred by theft, or by\n                        extortion, or by robbery, and property which has been criminally\n                        misappropriated, or in respect of which criminal breach of trust or cheating\n                        has been committed, is designated as “stolen property”,\n                        whether the transfer has been made or the misappropriation or breach of\n                        trust or cheating has been committed within or without Singapore. But if\n                        such property subsequently comes into the possession of a person legally\n                        entitled to the possession thereof, it then ceases to be stolen\n                        property. (2) The expression “stolen property” includes any property\n                        into or for which stolen property has been converted or exchanged and\n                        anything acquired by such conversion or exchange, whether immediately or\n                        otherwise. The District Judge found that Chevron was in possession of the\n                        excess fuel at the Terminal, and that Shanker controlled the movement of the\n                        fuel. The District Judge also noted that Shanker “had pleaded guilty\n                        to criminal breach of trust charges and the charge which involves the MV\n                        Milos was taken into consideration for the purpose of sentencing”\n                            (Chuaat [21]). 17     The appellant argued that the District Judge\n                    erred in law in his interpretation of s 410. He argued the District Judge\n                    “failed to take into account [his] contention that the definition of\n                    stolen property in s 410 has to be interpreted in its plain sense…\n                    consistent with the approach taken by the court inLim Hong\n                        Siang v Public Prosecutor[2009] 3 MLJ 280”.Lim Hong Siangwas a Malaysian High Court decision. The\n                    appellant in that case had pleaded guilty to a charge of retaining stolen\n                    property, namely, five units of handphones which allegedly belonged to an\n                    individual named Fong Chew Phein. According to the statement of facts, an armed\n                    robbery occurred at a shop. The owner of the shop, Poh Ken Hua, informed the\n                    complainant (a police officer on duty) of this. There was no mention in the\n                    statement of facts of Poh Ken Hua reporting 5 missing handphones from his shop.\n                    As such, it was not clear where the 5 handphones came from. After having been\n                    convicted and sentenced, the appellant appealed to the High Court (against\n                    sentence). The High Court set aside the plea of guilt. Its reason was that\n                    “[n]o evidence was led during the proceedings to show that the\n                    [handphones] belonged to Poh Ken Hua” (at [12]). Neither was there any\n                    mention of how Fong Chew Phein, the alleged “owner” of the\n                    handphones according to the charge, was related to the case. As such, it was\n                    apparent thatLim Hong Siangdealt with a\n                    different situation. The court in that case held that the prosecution needed to\n                    prove that the property (the 5 handphones) was stolen property (Lim Hong Siangat [11]). The case did not stand for the\n                    proposition that ownership was a prerequisite to the definition of stolen\n                    property in s 410, as the appellant seemed to have alluded\n                to. 18     The prosecution’s position was that it\n                    was under no obligation to prove the ownership of the fuel in question. It\n                    argued that, in this case, the fuel was stolen property as it had been\n                    transferred to the appellant by Shanker’s act of criminal breach of trust,\n                    which Shanker had pleaded guilty to. As proof of ownership of the property was\n                    not an element of the offence of criminal breach of trust, it was immaterial in\n                    this case as well. The appellant faulted the prosecution’s (and the\n                    District Judge’s) reliance on Shanker’s conviction, as the\n                    conviction did not prove that fuel belonged to (presumably in the sense of being\n                    owned by) Chevron. In my view, the District Judge correctly applied the\n                    law. (d) Was the appellant dishonest, and did he have reason to believe\n                that the fuel was stolen property? 19     The District Judge citedOw\n                        Yew Beng v PP[2003] 1 SLR(R) 536 (“Ow”) for the proposition that “the two mental\n                    elements of dishonesty and knowing or having reason to believe that the property\n                    was stolen [can] go together”. Dishonesty refers to acting with the\n                    intention of causing gain or loss which the accused has reason to believe was\n                    wrongful (Owat [11]). “Dishonesty”\n                    and “reason to believe” can go together because “[a] person\n                    who retains property knowing it to be stolen, would naturally possess an\n                    intention to cause gain or loss which he knows or has reason to believe is\n                    wrongful though there may be situations when these mental elements are not\n                    co-extensive” (Chuaat [40], citingOwat [12]). 20     The District Judge found that the appellant\n                    had reason to believe the fuel was stolen. He relied on the appellant’s\n                    statement, in which the appellant stated that he understood that the fuel was\n                    “cheap black market marine fuel” given its relatively low price\n                        (Chuaat [40] and [42]). The appellant argued\n                    that the District Judge had erred in law in conflating the two elements of\n                    dishonesty and having reason to believe that the fuel was stolen property. He\n                    argued that the District Judge should have applied a subjective test to\n                    ascertain if the appellant had, at the material time, intended to cause wrongful\n                    gain or loss. I find that the District Judge was correct in his analysis to look\n                    at the two mental elements together in this case. The appellant received the\n                    fuel, knowing it to be stolen, and hence naturally possessed an intention to\n                    cause gain to his business partners (or “Greek bosses”, according\n                    to his statement) or loss to the rightful owner of the fuel. In fact, the\n                    appellant mentioned in his statement, “I promise not to buy such\n                    dishonest stock again”. 21     The appellant also argued that the District\n                    Judge was wrong to find that he had reason to believe that the fuel was stolen.\n                    The District Judge came to that finding based on the lack of documentation for\n                    the purchase, the appellant’s statement, and the low price of the fuel.\n                    Before me, the appellant first attempted to justify the lack of documentation by\n                    arguing that he was only a conduit, and that “it was not for him to\n                    follow up in terms of documentation”. Second, he argued that the District\n                    Judge should have placed little weight on his statement, and that he did not\n                    state that the fuel was “off-spec” because Bay wanted to\n                    “truncate the recording” of the statement. Third, he argued that\n                    it was not established that the price of the fuel was (relatively)\n                    “low”, as the grade of the fuel was not proven to have been\n                    380CST. 22     I dismiss the last contention as I found that\n                    the District Judge was correct in determining the grade of the fuel (see above\n                    at [15]). I also dismiss the second contention that the District Judge should\n                    not have relied on his statement (see below at [25]–[27]). Even if the\n                    fuel were “off-spec”, this did not negate the appellant’s\n                    “reason to believe” that it was stolen. His remark in his\n                    statement that the fuel was “way cheaper” was not adequately\n                    explained. At no point did the appellant raise a plausible theory to explain\n                    those portions of his statement. As the prosecution had pointed out, “the\n                    fact that the fuel is off-spec may or may not result in a discount in\n                    price” (see also above at [8]). The appellant seemed to have conflated\n                    the two issues of “what the grade of the fuel was” and\n                    “what the appellant believed the grade of the fuel was”. The\n                    latter – his belief that the fuel was 380CST (and priced significantly\n                    below the market price) – was sufficient to establish the mental element\n                    of “reason to believe” in s 411. This was apparent from the\n                    evidence. With regard to the appellant’s first contention, even if it were\n                    not the appellant’s duty to document the transaction, he must have known\n                    that the fuel was stolen property based on the following: (a)     The payment was made in cash in a\n                        hawker centre. (b)     The price was quoted in Singapore dollars, whereas the common currency for\n                        trading in MFO is US dollars. The\n                        appellant’s case that Ioannis usually kept all the documents, but in\n                        this case assumed that records for the purchase of the 105 metric tonnes\n                        would be kept in Greece, was implausible. As pointed out by the District\n                        Judge (Chuaat [67]), “it is\n                        unacceptable to the court that as [Ioannis] had played such an important\n                        part in the [appellant’s] explanation that he was a conduit pipe for\n                        [Ioannis], yet there was no mention of [Ioannis] by the [appellant] at all\n                        during the recording of his statement. Instead, [Ioannis] was only featured\n                        during the course of the trial.”",
        "(2) Had the District Judge failed to appreciate that 3 witnesses were\n                not called by the prosecution?": "23     The three witnesses were: (a)     Thet Lwin, the bunker clerk on duty\n                        on the MV Milos at the material time; (b)     U Soe Paing, the operations executive of ABS;\n                    and (c)     the loading\n                        master on duty at the Terminal. The\n                        appellant argued that the prosecution’s failure to call Thet Lwin\n                        “left a lacuna in terms of an essential ingredient of the offence,\n                        namely the element of dishonest receipt of stolen property”; U Soe\n                        Paing was “in a position to confirm Thet Lwin’s\n                        evidence”, and the loading master “could have had knowledge of\n                        the loading of fuel onto MV Milos”. 24     The District Judge, however, found that the\n                    prosecution’s decision not to call any of these 3 individuals did not\n                    affect its case (Chuaat [34]). I agree. There was\n                    sufficient evidence before the court without these witnesses having been called.\n                    The appellant’s emphasis on Thet Lwin’s direct involvement, and his\n                    reference to the prosecution’s previous charge of abetment, are without\n                    merit. That the appellant was not on the MV Milos (and Thet Lwin was) at the\n                    material time was not detrimental to the prosecution’s case (see above at\n                    [13]). If the 3 witnesses were relevant to the defence, it was open to the\n                    defence to call them.",
        "(3) Had the District Judge erred in admitting the appellant’s\n                statement?": "25     The appellant’s statement was recorded\n                    on 15 May 2008, about seven months after the transaction at the terminal, by Bay\n                    Chun How (“Bay”), the lead investigator and the\n                    prosecution’s seventh witness. At the trial below, an ancillary hearing\n                    (formerly known as avoir dire) was conducted to\n                    determine if the statement was made voluntarily. The appellant argued that he\n                    was led to believe that he was only assisting in the investigations as a\n                    witness, and that he would not be charged in court if he cooperated. The\n                    District Judge, after hearing oral evidence from both the appellant and Bay,\n                    dismissed the appellant’s contentions and admitted the statement\n                        (Chuaat [46]). This was for two reasons.\n                    First, he noted that the appellant was given the opportunity to read his\n                    statement, understand its nature, and make amendments (in fact, the appellant\n                    made 2 amendments) – which indicated that Bay complied with the procedural\n                    requirements in recording the statement. Second, he found that Bay neither had\n                    the power to decide whether the appellant would be charged in court, nor did he\n                    – as a matter of fact – offer any inducements or promises to the\n                    appellant. 26     The appellant argued that the “District\n                    Judge’s main reason for rejecting the fact that [the statement] was given\n                    as a consequence of Bay’s inducements was that Bay was not in a position\n                    to give any inducement as the discretion to charge the [appellant] was that of\n                    the Public Prosecutor”, and that the two concepts (that prosecutorial\n                    discretion lay with the Public Prosecutor and the existence of an inducement)\n                    were mutually exclusive. I am of the view that this was an inaccurate\n                    representation of the District Judge’s reasoning. What was crucial was\n                    that Bay had not said anything to the effect that the appellant would not be\n                    charged if he cooperated. Bay’s description of the appellant as\n                    “very forthcoming [and] very cooperative” – which the\n                    appellant sought to rely on – did not of itself show that there was any\n                    inducement at work. Nor did Bay’s testimony that he told the appellant he\n                    was present at CPIB to “assist” in the investigations (the\n                    appellant argued that the word “assist” carried certain\n                    implications). Second, the two concepts were not mutually exclusive. The test\n                    for voluntariness is both objective and subjective. The question of whether\n                    there was an inducement or promise is an objective one (seeChai Chien Wei Kelvin v PP[1998] 3 SLR(R) 619 at [53]). As\n                    such, in determining (objectively) whether there was an inducement, the context\n                    of the recording, and the ability (or lack thereof) of the recorder to influence\n                    charging decisions, was not wholly irrelevant. 27     The appellant argued, in the alternative, that\n                    the District Judge erred in giving the statement “due weight”\n                    – instead, he should have given it no weight. The appellant cited\n                    “factual inconsistencies” between the statement and oral evidence\n                    at trial, such as the organisational structure of the Aegean companies (which\n                    the appellant did not mention during the recording), and that these should\n                    diminish the weight to be given to the statement. I find that the District Judge\n                    was correct to prefer the appellant’s inculpatory evidence in his\n                    statement (having found that it was admissible). Not only was the statement\n                    recorded shortly after the transaction, the appellant’s reason for not\n                    having raised many issues during the interview – that Bay wanted to\n                    truncate the recording – was not persuasive. It would not have taken the\n                    appellant a significant amount of time to bring up the role of Ioannis, or that\n                    he believed the fuel was off-spec.",
        "(4) Had the District Judge erred in considering Hussein’s\n                evidence?": "28     The District Judge stated that as Hussein had\n                    already been convicted and sentenced for his role in the offence, he did not\n                    stand to gain from implicating the appellant (in particular, because he had\n                    already served his sentence) (Chuaat [53]). At\n                    trial, Hussein had given oral evidence that he could not recall the details of\n                    the transaction. The prosecution applied under s 147(3) of the Evidence Act\n                    (Cap 97, 1997 Rev Ed) to admit the portion of the statement that Hussein gave to\n                    the CPIB on 15 May 2008 relating to the quantity of the excess fuel (105 metric\n                    tonnes). The District Judge allowed this, reasoning that “the basis for\n                    [Hussein’s] ability to remember when his statement was recorded was\n                    because of his direct dealings with the [appellant] in this transaction\n                    involving the excess fuel” (Chuaat\n                    [54]). 29     The appellant referred to inconsistencies\n                    between Hussein’s statement and oral evidence from other witnesses at\n                    trial (such as whether the quantity was exactly 105 metric tonnes, and whether\n                    the price of the transaction was in US dollars), and argued that “the\n                    [District Judge] erred in accepting Hussein’s evidence on the basis that\n                    he would have no motive to minimise his role or exaggerate that of the\n                    Appellant, as the [District Judge] did not take into account the contradictions\n                    between [Hussein’s statement] and ‘objective facts’,\n                    ‘the inherent probabilities and improbabilities’ in the statement\n                    and Hussein’s oral evidence”. I disagree with the appellant’s\n                    contentions, as well as its interpretation of the District Judge’s\n                    argument. The District Judge made a finding that Hussein did not stand to gain\n                    from implicating the appellant. This finding was independent of his oral\n                    evidence, his statement, or how his evidence tied in with the rest of the\n                    evidence. The appellant’s seeming attempt to impute an ulterior motive\n                    unto Hussein based on inconsistencies in his evidence was not substantiated.\n                    More importantly, the appellant’s arguments regarding the District\n                    Judge’s handling of Hussein’s evidence were largely inconsequential.\n                    The two important parts of Hussein’s evidence were that it was the\n                    appellant who agreed to purchase the fuel, and that it was the appellant who\n                    made payment. Neither of these was disputed by the appellant.",
        "(5) Had the District Judge failed to appreciate the defence that the\n                fuel was off-spec?": "30     The District Judge found that the fuel could\n                    not have been off-spec because “there was no documentation on the\n                    contractual specifications…” (Chuaat [40]). The appellant argued that, in making this finding, the District judge\n                    did not take into account the evidence of the other witnesses such as Shanker,\n                    Remy and Hussein. These witnesses elaborated on what “off-spec”\n                    means (see above at [8]). The appellant contended that the prosecution had not\n                    led evidence to establish the precise quality of the fuel. He argued that\n                    “if the excess fuel [was] indeed off-spec fuel, it [confirmed] the\n                    Appellant’s position that he had no reason to believe that the excess fuel\n                    was stolen property”. 31     I find that his argument was without merit.\n                    For the reasons above, it was clear that the appellant believed he was\n                    purchasing 380CST fuel. In fact, he believed the fuel to have been even more\n                    expensive that 380CST fuel. There was little doubt that he had reason to believe\n                    that the fuel was stolen. Furthermore, the appellant accepted that the most\n                    common type of fuel in the Terminal was 380CST, yet raised no evidence to create\n                    a reasonable doubt that the fuel in question was not 380CST, let alone\n                    off-spec.",
        "(6) Had the District Judge failed to recognise contradictions in the\n                evidence of critical prosecution witnesses?": "32     The appellant identified Bay, Hussein, and\n                    Badaruddin Bin Mohamed Ibrahim (who knew the appellant since 1992 and introduced\n                    Hussein to the appellant) as “critical” prosecution witnesses\n                    because they were “the only witnesses who either knew or had dealings\n                    with the [appellant]”. Again, the appellant brought up matters relating\n                    to the quantity and quality of the fuel. I looked through the evidence of the 3\n                    witnesses, and did not come across anything that contradicted the analysis of\n                    the District Judge in finding that the charge was made out. I thus agree with\n                    the District Judge’s approach.",
        "(7) Had the District Judge erred in drawing adverse inferences\n                against the appellant?": "33     The District Judge found that the prosecution\n                    had proven its case beyond a reasonable doubt (Chuaat [72]). In doing so, the appellant alleged, he had drawn\n                    adverse inferences which were “not warranted by the evidence”.\n                    These inferences were: (a)     That the appellant had reason to\n                        believe that the fuel was stolen based on the lack of documentation,\n                        concessions in his statement, and the disparity between the price paid and\n                        the market price; and (b)     That the appellant had indeed received the excess fuel, based on\n                        concessions in the his statement. 34     The appellant might have misapprehended the\n                    term “adverse inference”. It is not a term of art. It is an\n                    application of common sense. If an accused was expected to give an explanation\n                    but did not, he must explain his omission. If the explanation was accepted, his\n                    omission will not harm his defence. If his explanation failed to persuade the\n                    trial judge, the judge would be entitled to conclude that the omission\n                    incriminated him. The trial judge is generally entitled to draw inferences from\n                    the failure of the accused to give evidence on oath, “including the\n                    ultimate adverse inference that the [accused] was guilty of the offence\n                    charged” (seeOh Laye Koh v PP[1994] SGCA\n                    102 (“Oh”) at [14]). The Court of\n                    Appeal inOhdealt with s 196 of the Criminal\n                    Procedure Code (Act 10 of 1976), the equivalent of which is s 291(3) of the\n                    Criminal Procedure Code (Cap 68, 2012 Rev Ed) (“CPC”). Also,\n                    inferences can be drawn from the accused’s silence, pursuant to\n                    s 261(1) of the CPC. 35     The District Judge did not seem to have drawn\n                    any such inference against the appellant with regard to the issues cited (above\n                    at [33]). In fact, the District Judge had not used the term “adverse\n                    inference” at all in his decision (he did, however, use the term\n                    “irresistible inference” at [40]). Based on his reasoning, it\n                    seemed clear that he relied on the evidence (or lack thereof) to assess the\n                    arguments of the prosecution and defence. The lack of documentation was\n                    detrimental to the appellant’s attempt to create a reasonable doubt that\n                    the fuel was off-spec. It was not the case that simply because there was no\n                    documentation, the District Judge found that the prosecution’s case was\n                    proven beyond a reasonable doubt. 36     It could be argued that the District Judge\n                    drew an adverse inference from the appellant’s failure to mention Ioannis\n                    during the recording of the statement (Chuaat\n                    [41]). However, this point was not addressed by the appellant. In any case, I\n                    find that this was a justified inference.",
        "(8) Had the District Judge failed to consider the appellant’s\n                defence, in the light of the organisational structure of the Aegean group of\n                companies?": "37     The appellant argued, at trial, that the\n                    purchaser of the fuel was ABS and not AB. Evidence was led at trial to show that\n                    ABS was in charge of the operations of the MV Milos, not AB. These arguments\n                    were presumably made in the context of the appellant’s\n                    “receipt” of the fuel. The District Judge rejected the\n                    appellant’s contentions, having found that he had indeed received the\n                    fuel. Before me, the appellant argued erred in: (a)     Finding that ABS and AB were in\n                        effect run like a single company; (b)     Noting that the appellant made no mention of ABS and\n                        Ioannis’ involvement in his statement; (c)     Finding that Hussein’s statement\n                        corroborated the price of the fuel as S$18,900; and (d)     Relying on the appellant’s\n                        statement that his office maintained a petty cash float of about US$50,000\n                        which was accessibly only by him and his operations\n                manager. 38     In relation to the first point, I note that\n                    the District Judge did not make such a finding. At paragraph 35 of his decision,\n                    which the appellant quoted, the District Judge merely stated: 35    The prosecution has submitted that Aegean Bunkering\n                            and Aegean Breeze Shipping share the same office premises and that for\n                            all intents and purposes, in reality, the 2 companies were run like a\n                            single company. The quoted portion refers to the prosecution’s\n                        submission, rather than the District Judge’s finding. Nevertheless, a\n                        finding that the two were run like a single company would not contravene the\n                        “basic fact that [the two companies] were two separate legal\n                        entities” (in the appellant’s words). The appellant argued that\n                        AB was not in the business of purchasing small quantities of fuel, such as\n                        the 105 metric tonnes involved in this case. Even if that were the case, his\n                        reference to the organisational structure of the Aegean group did nothing to\n                        explain his involvement in the transaction (from purchase to payment), nor\n                        did it substantiate his “conduit”\n                argument. 39     Second, the District Judge noted that the\n                    appellant made no mention of ABS or Ioannis in his statement and (hence)\n                    disbelieved the appellant’s account that he was merely a conduit. Before\n                    me, the appellant argued he was wrong in doing so, as the statement was simply a\n                    truncated account. I find this unconvincing. Further, this did not explain why\n                    he stated (at paragraph 20 of his statement) his motivation to buy the fuel as\n                    “[needing] to show good business results to [his] Greek\n                    bosses”. 40     Third, the District Judge noted that Hussein\n                    had stated (at page 6 of his statement) that he “received a sum of\n                    $18,900 from [the appellant]”. Another witness, Wang Kin (the recording\n                    officer of Hussein’s statement), had given evidence that this sum was in\n                    Singapore dollars. The currency was a matter of dispute because the\n                    appellant’s account was that Ioannis had handed him a sealed envelope\n                    containing US$18,900 and told him to pass it to Hussein. However, in his\n                    statement, he mentioned that the sum was S$18,900. The District Judge held that,\n                    based on Hussein’s statement, Wang Kin’s evidence, and the\n                    appellant’s statement, the sum was S$18,900. 41     The appellant argued that the District Judge\n                    was wrong to rely on these pieces of evidence as there were intrinsic and\n                    extrinsic contradictions between Hussein and Wang Kin’s evidence. Minor\n                    contradictions are understandable, given the length of time that passed between\n                    the transaction and the trial. This currency argument was part of the broader\n                    context of the District Judge’s reasoning in determining whose account to\n                    believe. The appellant, in his oral evidence, argued that he was simply a\n                    conduit. Ioannis said that he was the one who gave the appellant the money to\n                    pass to Hussein, and the sum was US$18,900. On the contrary, the\n                    prosecution’s case was that the appellant had paid Hussein S$18,900\n                    through the petty cash account. The District Judge found that the sum was indeed\n                    S$18,900, and this was one of the reasons the District Judge rejected the\n                    appellant’s case that he was a mere conduit. 42     Although Ioannis alleged that he provided the\n                    US$18,900, and that the sum came from the account of ABS, he was unable to show\n                    any documentary evidence of a withdrawal of US$18,900 from the account. He\n                    attempted to show that two withdrawals of US$15,225 and US$10,140, made on 28\n                    August and 25 October 2007 respectively, were used to make up the US$18,900. The\n                    District Judge found Ioannis’ evidence unreliable, and that he was merely\n                    giving his evidence in order to support the appellant (Chuaat [68]). I agree. 43     Even if the sum was US$18,900, based on the\n                    totality of the evidence, it still did not mean that the District Judge was\n                    wrong in holding that the appellant was not a mere conduit. In any case, I find\n                    that the District Judge was correct to prefer the evidence of Hussein, Wang Kin,\n                    and the appellant himself (in his statement). 44     Fourth, and finally, the District Judge found\n                    that the appellant purchased and paid for the fuel through the petty cash\n                    account which only he and his operations manager had access to. The appellant\n                    argued before me that the District Judge was wrong because “the\n                    [appellant] had given evidence that there was no person employed as an\n                    operations manager with [AB] and the [prosecution] did not cross-examine him on\n                    this point”. It seems the appellant was faulting the District Judge for\n                    not having drawn an adverse inference against the prosecution’s failure to\n                    cross-examine the appellant on a particular point. This would not be tenable. In\n                    any case, the District Judge came to his finding based on the words in the\n                    appellant’s statement. If the appellant’s oral testimony had\n                    subsequently contradicted his statement, it was not clearly explained (even the\n                    “truncated” argument would not be relevant here). The District\n                    Judge was hence correct to prefer his account in the statement. The appeal\n                    against conviction is therefore dismissed.",
        "Grounds of appeal against sentence": "45     The maximum imprisonment term for an offence\n                    under s 411(1) of the Penal Code is five years. The District Judge\n                    sentenced the appellant to eight months’ imprisonment. In doing so, he\n                    noted the following factors: (a)     The commission of such offences in\n                        the bunkering trade would affect Singapore’s reputation as an\n                        internationally respected bunkering hub and bring Singapore into\n                        disrepute; (b)     The\n                        offence was difficult to detect; and (c)     The appellant stood to gain (in showing good business\n                        results to his Greek bosses). He also\n                        noted that Shanker was sentenced to 8 months’ imprisonment and Remy\n                        and Hussein each to 6 months. The three of them, however, faced criminal\n                        breach of trust charges, the maximum term of imprisonment of which is seven\n                        years. The District Judge also considered the case ofSamad bin Kamis and another v PP[1991] 1 SLR(R) 450\n                            (“Samad”). In that case, the\n                        second appellant (a bunker clerk) was sentenced by the District Court to\n                        five months’ imprisonment for dishonestly receiving 157 metric tonnes\n                        of fuel, pursuant to s 411 of the Penal Code (Cap 224, 1985 Rev Ed).\n                        The fuel was worth about S$62,616.95. The High Court affirmed the sentence.\n                        The District Judge distinguishedSamadas the\n                        “price of [fuel] was very much lower then” (Chuaat [76]). 46     Before me, the appellant argued that the\n                    District Judge erred in imposing a sentence of eight months because he: (a)     Did not apply the principle of\n                        parity in sentencing, and failed to consider the sentences imposed in\n                        similar cases; (b)     Misapprehended several facts material to sentencing; and (c)     Did not have due regard to the\n                        character references of the appellant submitted in\n                mitigation. 47     First, the appellant cited the principle of\n                    parity in sentencing. The principle states that “where there are no\n                    differentiating factors… public interest demands that there should be\n                    some consistency in the imposition of sentences on accused persons committing\n                    the same or similar offences” (seeLiow Eng Giap v\n                        PP[1968-1970] SLR(R) 681 at [3]). The appellant argued that the\n                    District Judge had erred in considering the “differentiating\n                    factors” between the appellant’s case andSamad, as well as between the appellant’s case and that of\n                    Shanker, Remy and Hussein. 48     In comparing this case withSamad, the District Judge observed thatSamad“was decided about 20 years ago, and the price of\n                    [fuel] was very much lower then”. The District Judge compared the market\n                    price of the fuel in this case (US$434 per metric tonne) with the price at which\n                    the fuel was sold inSamad(S$185 per metric\n                    tonne), and reasoned that since this case involved a much larger sum, the\n                    appellant should receive a higher sentence than the second appellant inSamad. The appellant argued that the District\n                    Judge erred in comparing the market price in his case with the sale price inSamad. Instead, if market prices in both cases\n                    were compared, the difference would not have been as stark. InSamad, the market price was found to have been S$398 per\n                    metric tonne (Samadat [76] –\n                [77]). 49     The appellant also argued that his case was\n                    less serious thanSamad. He argued that inSamad, the second appellant had received the\n                    fuel for his own personal benefit, had contaminated the fuel he bought for\n                    himself with the lower grade of fuel on the barge intended for delivery to the\n                    company’s customer, and had purchased more fuel (157, as opposed to 105,\n                    metric tonnes). 50     The appellant then drew comparisons between\n                    his case and the cases of Shanker, Remy and Hussein. The latter can be\n                    summarised as follows: (a)     Shanker faced one charge under\n                        s 406 read with s 109 of the Penal Code and three charges under\n                            s 6(b) of the Prevention of\n                        Corruption Act (Cap 241, 1993 Rev Ed) (“PCA”) read with\n                        s 34 of the Penal Code. A further three charges under s 406 read\n                        with s 109 of the Penal Code and two charges under s 6(b) of the PCA read with s 34 were taken into\n                        consideration for the purpose of sentencing. He faced a total of eight\n                        months’ imprisonment and a S$90,000 fine. (b)     Remy faced 2 charges under s 406 read with\n                        s 109 of the Penal Code and two charges under s 6(b) of the Prevention of Corruption Act (Cap 241,\n                        1993 Rev Ed) (“PCA”) read with s 34 of the Penal Code. A\n                        further two charges under s 408 read with s 109 of the Penal Code\n                        and two charges under s 6(b) of the PCA\n                        read with s 34 of the Penal Code were taken into consideration for the\n                        purpose of sentencing. He faced a total of six months’ imprisonment\n                        and a S$60,000 fine. (c)     Hussein faced two charges at trial under s 408 read with\n                        s 109 of the Penal Code. He also pleaded guilty to one charge under\n                        s 408 read with s 109 of the Penal Code. He faced a total of six\n                        months’ imprisonment. Shanker and\n                        Remy had pleaded guilty, whereas Hussein had claimed trial to two counts of\n                        s 408 read with s 109 of the Penal Code (seePP\n                            v Zahfudean Faizal Bin Mohammed Din and another[2011] SGDC\n                        223), and pleaded guilty to one count of s 408 read with s 109 of\n                        the Penal Code. The appellant argued that the trio faced more charges than\n                        him, he was not the “mastermind” in the transaction, and he\n                        did not benefit personally (whereas out of the S$18,900, Hussein took\n                        S$2,100 and Shanker and Remy each took S$6,000). As such, his sentence\n                        should have been significantly lower than theirs. 51     The District Judge, however, found that the\n                    role of Shanker could “be equated to the role of the [appellant]”\n                        (Chuaat [76]), as without the appellant\n                    agreeing to receive the [fuel], the transaction would not have occurred. He also\n                    disagreed that the appellant did not benefit personally – the\n                    appellant’s gain was showing good business results to his Greek bosses. I\n                    agree. These were not the only differences between the appellant’s case\n                    and the other cases cited. Shanker had pleaded guilty, whereas the appellant had\n                    claimed trial to the single charge under s 411. Although the appellant was\n                    entitled to claim trial, the manner in which he conducted his defence was an\n                    indication that he showed little remorse, and was unwilling to accept personal\n                    responsibility. 52     The appellant, in his submissions, went on to\n                    “[acknowledge] that the principle of parity is irrelevant once the\n                    offenders are charged with different offences, as there is no longer any common\n                    basis for comparison” (citingPhua Song Hua v\n                        PP[2004] SGHC 33 at [38]). This did not seem to have deterred\n                    him from drawing comparisons between his sentence and the sentences of Shanker,\n                    Remy and Hussein (none of whom faced s 411 charges). The s 411 cases\n                    that he did refer to (PP v Ho Yeong Yeow[2005]\n                    SGDC 85, which dealt with the receipt of stolen television sets and electrical\n                    devices andPP v Narayanan Palanivellu[2006] SGDC\n                    65, which dealt with the receipt of a stolen laptop) concerned entirely\n                    different facts and similarly provided little basis for\n                comparison. 53     The case of the second appellant inSamad, admittedly, comes close to the appellant’s\n                    case (in terms of involving dishonest receipt of stolen MFO). However,\n                    sentencing is not a mathematical endeavour of equating similar criminal\n                    transactions. The circumstances of the accused (such as his level of remorse,\n                    and how he conducted his defence at trial) could be taken into account as well.\n                    I find that the analogy ofSamadwas not\n                    sufficient to warrant appellate intervention. 54     Second, the appellant argued that the District\n                    Judge misapprehended certain facts that were material to sentencing. He argued\n                    that there was no proof that the fuel was 380CST (and hence the District Judge\n                    was wrong to have relied on the market price of 380CST fuel), and that the\n                    District Judge incorrectly relied on the appellant’s statement (possibly\n                    in determining that he stood to gain by showing results to his Greek bosses).\n                    Having found that the District Judge was correct in finding that the fuel was\n                    380CST (see above at [15]) and that the statement was an accurate representation\n                    of the facts (see above at [25]–[27]), the appellant’s contentions\n                    are without merit. 55     Third, the appellant argued that the District\n                    Judge did not have due regard to the character references he submitted in\n                    mitigation. The character references came from two individuals: the managing\n                    director of a business partner of AM, and a pastor. They stated that the\n                    appellant was a diligent and honest person. There is no reason to believe that\n                    the District Judge had not already taken these factors into\n                account. 56     In sum, I find that the sentence was not\n                    manifestly excessive. The appeal against sentence is also\n                dismissed."
    }
}