{
    "case_title": "Public Prosecutor\n      v\n      Mahesvaran a/l Sivalingam",
    "ncitation": "[2014] SGHC 182",
    "coram": "Tan Siong Thye J",
    "sections": {
        "Introduction": "1       The accused, Mahesvaran a/l Sivalingam, was charged with importing diamorphine into Singapore. The charge read as follows: That you, Mahesvaran A/L Sivalingam, are charged that you, on the 5th day of February 2012 at or about 2.39p.m, at Woodlands Checkpoint, Singapore, in motorcycle JMN 164, did import a ‘Class A’ controlled drug listed in the First Schedule to the Misuse of Drugs Act (Cap 185,2008 Rev Ed), to wit, five (5) packets of granular/powdery substance, which was pulverised and homogenised into powdery substance, which was analysed and found to contain not less than 23.84 grams of diamorphine, at a confidence level of 99.9999% without any authorisation under the said Act or the Regulations made thereunder, and you have thereby committed an offence under section 7 and punishable under section 33 of the said Act, and further upon your conviction under section 7 of the said Act, you may alternatively be liable to be punished under section 33B of the said Act. The amount of diamorphine imported by the accused exceeded the statutory limit of 15 grams as prescribed under the Second Schedule of the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (“the Act”). Hence this offence is punishable with death if the accused is convicted. The accused claimed trial to the said charge. 2       At the close of the Prosecution’s case, I explained the usual allocution to the accused. He elected to remain silent. I was satisfied that the Prosecution had proven its case beyond a reasonable doubt on the specified charge of importing 23.84 grams of diamorphine into Singapore. Accordingly, I found the accused guilty as charged. 3       Fortunately, the accused escaped the death penalty as the conditions under s 33B of the Act were fulfilled. The Prosecution had tendered a Certificate of the Public Prosecutor under s 33B(2)(b) of the Act which indicated that the accused had substantially assisted the Central Narcotics Bureau (“CNB”) in disrupting drug trafficking activities within or outside Singapore. The court was also satisfied, on a balance of probabilities, that the accused was transporting the diamorphine on behalf of Vijendran, whom he called “boss”, for a fee. 4       After considering the accused’s mitigation plea, I imposed the minimum punishment of life imprisonment and 15 strokes of the cane on him. He is now dissatisfied with the sentence and has appealed against it.",
        "The facts of the case": "5       The accused is a 22-year-old male Malaysian. At the time of the offence he was 20 years old and unemployed.",
        "At Woodlands Checkpoint Booth 61": "6       On 5 February 2012, at about 2.20 pm, the accused rode his Malaysian-registered motorcycle bearing registration number JMN 164 into Singapore. At Woodlands Checkpoint, he went to Booth 61 of the motorcycle green channel lane. He was stopped by the Immigration and Custom Officer and referred to the CNB officers.",
        "Search done on the motorcycle": "7       The CNB officers, namely PW17 SSGT See Lin Shan, PW18 SSGT Sudin Bin Mamat, and PW21 W/SSGT Palan Hemmamalani, escorted the accused to his motorcycle which was parked at lot A39. The accused was told to push his motorcycle to the K-9 garage for a search to be conducted.",
        "Discovery of the diamorphine": "8       At the K-9 garage, a sniff search by the narcotics dog was conducted on the motorcycle. The sniffer dog indicated that there were drugs in the battery compartment of the motorcycle. PW18 proceeded to unscrew the cover of the battery compartment of the motorcycle. When the cover was removed, two bundles protruded from the battery compartment. PW21 asked the accused what the bundles were. He replied they were “maavu” which meant flour in Tamil. This was the street name for heroin. The accused was placed under arrest. PW18 proceeded to remove another three other bundles from inside the battery compartment of the accused’s motorcycle.",
        "Contemporaneous statements of the accused": "9       At Woodlands Checkpoint, PW21 recorded the first contemporaneous statement of the accused. He said that he was to transport the five bundles of “maavu” in the battery compartment of his motorcycle to Singapore via Woodlands Checkpoint. After he had cleared immigration and customs, he was to make a call and someone would collect the bundles from him. 10     Shortly thereafter, the accused gave his second contemporaneous statement to PW21. In this statement the accused explained that “maavu” was a term used in Malaysia to mean illegal drugs. He further said that he retrieved the five bundles from under a phone book outside Larkin Bus Terminal before stuffing them inside the battery compartment of his motorcycle. The accused said that this was the second time he brought drugs into Singapore. He was to be paid RM4,500 for this trip. 11     These two contemporaneous statements were recorded voluntarily without any inducement, threat or promise from the accused. He also did not challenge the admissibility of these statements.",
        "Scientific analysis of the drugs": "12     The five bundles of diamorphine with a gross weight of 2259.1 grams were sent to the Health Scientific Authority for analysis. The net weight, after analysis, was 23.84 grams.",
        "Statements of the accused": "13     The accused continued to give voluntary statements to the investigating officer, PW28 ASP Eugene Tan Jun Hao, through a Tamil interpreter, PW27 Manickam. In his statement, he admitted to the importation of heroin into Singapore. He said he was told by Vijendran whom he addressed as “boss”, to transport the heroin into Singapore. Upon clearing Woodlands Checkpoint, he was to call someone who would collect the drug from him. 14     The accused said he collected the five bundles of heroin from Larkin Bus Terminal. He wrapped the five bundles individually in tape before he squeezed them into the empty battery compartment of the motorcycle. 15     The accused further said in his statements to PW28 that he knew that the five bundles contained heroin. He also said the street name for heroin was “milo”, “maavu” or “thing”.",
        "Reasons for becoming a courier": "16     The accused revealed in his statement to PW28 that he was in financial difficulty when he offered to transport drugs for his “boss”. He had borrowed RM4000 from an illegal moneylender to pay for his elder brother’s medical fees. He could not cope with the exorbitant repayment scheme. Thus he approached “boss” to bring drugs into Singapore. He would be paid according to the quantity of drugs that he delivered to Singapore. For the delivery of the five bundles of heroin on 5 February 2012 the accused was promised a sum of RM4,500.",
        "Accused elected to remain silent": "17     At the close of the Prosecution’s case, I was satisfied that the Prosecution had made out a prima facie case against the accused. Accordingly, the accused was asked to enter his defence after I had explained the usual allocution under s 230(1)(m) of the Criminal Procedure Code (Cap 68, 2012 Rev Ed). He chose to remain silent.",
        "The elements of the charge under s 7 of the Act have been made out": "18     Although the accused has only appealed against the sentence, I was satisfied that the all the elements of the charge under s 7 of the Act had been satisfied beyond a reasonable doubt. The accused was caught red-handed with the diamorphine and there was also evidence that he was aware that the drugs that he was to deliver was diamorphine or heroin. Accordingly, theactus reusand themens reafor the offence were fulfilled.",
        "Sentence": "19     I was satisfied on a balance of probabilities that the accused was a courier. The Prosecution had also produced a Certificate of the Public Prosecutor under s 33B(2)(b) of the Act. Accordingly, the punishment for this offence was no longer a death sentence. 20     The punishment under s 33B(1)(a) of the Act is life imprisonment and caning of not less than 15 strokes. Life imprisonment is mandatory. There cannot be any shorter custodial sentence. However, the number of strokes can vary from 15 to 24 strokes. 21     The court therefore has to decide whether to impose more than 15 strokes. I noticed that the accused had no criminal record. Although the evidence in court revealed that he had previously illegally imported drugs into Singapore without being caught, I did not take that into consideration as an antecedent as he was not convicted of that charge. I regarded the accused as a first-time offender. He was only 20 years old at the time he committed the offence. He was very young and he was also very co-operative. The net amount of diamorphine was also not very large,ie, 23.84 grams. Accordingly, I did not think it was necessary for me to impose more than the minimum of 15 strokes.",
        "Conclusion": "22     I have therefore imposed the minimum sentence as prescribed by law on the accused. Thus this appeal is unwarranted and unmeritorious."
    }
}