{
    "case_title": "Public Prosecutor \n      v\n      Muhammad Farid bin Mohd Yusop",
    "ncitation": "[2014] SGHC 125",
    "coram": "Chan Seng Onn J",
    "sections": {
        "Introduction": "1       The accused, a 30 year old male Singaporean, claimed trial to the following charge of trafficking in methamphetamine (hereinafter used interchangeably with its street name “ice”) under s 5(1)(a) read with s 5(2) of the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (“MDA”): That you, MOHAMMAD FARID BIN MOHD YUSOP, on 10 March 2011, at about 5.30 a.m., in the vicinity of the traffic junction of Lavender Street and Bendemeer Road, Singapore, inside vehicle SGH3547U, did traffic in a controlled drug specified as a \"Class A drug\" in the First Schedule to the Misuse of Drugs Act (Cap 185,2008 Rev Ed) (\"the Act\"), to wit, by having in your possession for the purpose of trafficking, two packets of crystalline substance which was analysed and found to containnot less than 386.7 grams of methamphetamine, without any authorisation under the Act or the regulations made thereunder, and you have thereby committed an offence under s 5(l)(a) read with s 5(2) and punishable under s 33 of the Act, and further upon your conviction under s 5(1) of the Act, you may alternatively be liable to be punished under s 33B of the Act. [emphasis added] 2       As the accused was charged with trafficking in more than 250g of methamphetamine, he faced the mandatory death penalty if found guilty (see s 33 read with the Second Schedule of the MDA). However, at the end of the trial, I believed his defence that, even though he was caught carrying 386.7g of methamphetamine, he never intended to traffic in more than 250g of the same. Accordingly, I amended the above charge against the accused to one of having a lesser amount of 249.99g of methamphetamine in his possession for the purpose of trafficking. I convicted the accused on this amended charge and sentenced him to 23 years’ imprisonment and 15 strokes of the cane. 3       As the prosecution has since appealed against my decision to acquit the accused on the capital charge, I shall now set out my grounds for doing so.",
        "Background facts": "",
        "The CNB operation leading up to the arrest": "4       On 10 March 2011, at about 4.40am, a team of 11 Central Narcotics Bureau (“CNB”) officers led by Senior Station Inspector Heng Chin Kok (“SSI Heng”) was deployed to the vicinity of Woodlands Industrial Park D Street 1. This was after they had received information that a male Malay, known as “Boy Scar” and driving a silver car with registration number SGH3547U (“the Car”), was believed to be involved in drug-related activities at the location. 5       The 11 CNB officers were grouped in different vehicles comprising four cars and two motorcycles. Together in one of the cars were Senior Staff Sergeant Kua Boon San (“SSS Kua”) and Woman Senior Staff Sergeant Woo Yoke Chun ‘Jenny’ (“W/SSS Woo”). They were stationed opposite the Kranji Mass Rapid Transit (“MRT”) station with SSS Kua behind the wheel. 6       Shortly before 5.20am, W/SSS Woo spotted the Car being driven past their vehicle. She then saw the Car make a U-turn and stop in front of Kranji MRT station somewhere between a bus stop and an overhead bridge. None of the CNB officers involved managed to observe what had happened at Kranji MRT station while the Car was there. 7       At about 5.20am, the CNB officers were instructed to move in to arrest the accused who was driving the Car. The CNB officers thus followed the Car, which was seen travelling in the direction of Seletar Expressway, and eventually caught up with it at about 5.30am when it stopped at the traffic junction of Lavender Street and Bendemeer Road. That was when SSI Heng gave the signal to contain the Car and arrest the accused.",
        "The accused’s arrest": "8       The Car was contained by two CNB cars. One of these cars was driven in front of the Car and reversed to make contact with the latter’s front bumper. The other CNB car was driven directly behind the Car to make contact with the latter’s rear bumper. 9       After the Car had been contained, one Sergeant Muhammad Fardlie Bin Ramlie (“Sgt Fardlie”) got off the motorcycle which he was riding, approached the Car, and tried to open the driver’s door. Finding it locked, Sgt Fardlie then used a glass breaker to break the window. He managed to open the door and, at this time, the accused attempted to escape. However, after a violent struggle with Sgt Fardlie and some of the other CNB officers who had arrived by then to assist, the accused was eventually handcuffed and arrested.",
        "The search of the Car": "10     After the accused was arrested, he was escorted into the rear seat of the Car and was flanked on either side by SSS Kua and Senior Station Inspector Ng Tze Chiang Tony (“SSI Tony Ng”). The Car was then driven by one of the CNB officers to a nearby car park at Beatty Road. Nobody sat in the front passenger’s seat of the Car during this journey. 11     At the Beatty Road car park, SSI Tony Ng searched the Car in the presence of the accused and recovered the following items from the front passenger’s seat:[note: 1] (a)     one plastic bag (tied), later marked as “A1”, which contained a packet of crystalline substance; and (b)     one black and grey chequered plastic bag (untied), later marked as “A2”, which also contained a packet of crystalline substance. 12     SSI Tony Ng placed the two plastic bags, A1 and A2, into two separate clear Ziploc bags before handing them over to SSI Heng. SSI Heng then recorded a contemporaneous statement[note: 2]from the accused in the rear passenger’s seat of the Car at about 6.00am.",
        "The cautioned statement": "13     On the same day, at about 6.30pm, the investigating officer, Deputy Superintendent Tan Seow Keong (“DSP Tan”), recorded a cautioned statement from the accused at the CNB headquarters. The accused’s cautioned statement read as follows:[note: 3] If I had knew that the amount of ICE that I was going to collect this morning was 500 grams, I would not have collected the ICE. Before today, I used to collect ICE below the weight of 250 grams. I really do not know why the ICE amount today was 500 grams which is more than usual. The reason for me not dealing with ICE more than 250 grams is that I knew it would be death sentence if I am caught.",
        "The four long statements": "14     Subsequently, DSP Tan recorded four further long statements from the accused.[note: 4] 15     In his long statements, the accused stated that he began dealing in ice since the start of 2010. He would get his supply of ice from a Malay man known as “Bapak”, weigh and re-pack the ice into mini-packets, and then sell the mini-packets of ice for a profit. 16     In early 2011, Bapak asked the accused to deliver ice for him and offered the accused $500 for each delivery. The accused took up the offer and made his first delivery for Bapak sometime in January 2011. On that occasion, he drove his car under the overhead pedestrian bridge at Kranji MRT station and waited for a Malaysian Indian man to place a packet of ice through his front passenger’s window. They did not speak. The accused then drove off to deliver the packet of ice to Bapak’s friend. The $500 which he was promised for making the delivery was duly deducted from the payment for the ice which he bought from Bapak. 17     The accused made two more deliveries of ice for Bapak—one occurred around the end of January 2011 while the other occurred sometime in February 2011. On both occasions, the accused followed essentially the samemodus operandithat was used on the first delivery. He would drive to the overhead pedestrian bridge at Kranji MRT station, wait for a Malaysian Indian man to place a packet of ice through his front passenger’s window, and then drive off to deliver the ice to whomever Bapak instructed him to. As before, the accused was credited $500 after each delivery. 18     At this point, it is pertinent to note that the accused had also mentioned in his long statements that he received 125g of ice on his first and second deliveries and 250g on his third. 19     The accused admitted that he was arrested during the early hours of 10 March 2011 for what would have been his fourth delivery of ice for Bapak. According to the accused, he had received instructions from Bapak early that morning at about 4.00am to proceed to Kranji MRT station to collect the ice. The accused complied and, as with previous occasions, stopped his car under the overhead pedestrian’s bridge. In the long statements, the accused said that a Malaysian Indian man approached his car and placed two plastic bags on his front passenger’s seat.[note: 5]He then drove off. While he did not open up the plastic bags to check the contents, he knew that they contained ice. He also stated that while he did not know the exact weight of the ice, he assumed that this was less than 250g. As the accused was driving, he received a call from Bapak who instructed him to bring the ice to Woodlands for delivery to its intended recipient. Shortly after this call, however, he found his car being “sandwiched” by the CNB officers at the junction of Lavender Street and Bendemeer Road. This eventually led to his arrest.",
        "The HSA analysis": "20     During the course of investigations, the crystalline substance in the two plastic bags, A1 and A2, were analysed by the Health Sciences Authority. They were found to contain not less than 194.3g and 192.4g of methamphetamine respectively;[note: 6]hence the accused’s charge of trafficking in not less than 386.7g of methamphetamine.",
        "The parties’ cases": "21     The prosecution’s case[note: 7]was straightforward given the facts. The prosecution submitted that since it was undisputed that the accused was in possession of the two plastic bags containing the drugs, he is presumed under s 18(1)(a) MDA to have had all of the drugs in his possession and further presumed under s 18(2) MDA to have known the nature of the drugs. These presumptions, it was argued, were not rebutted by the accused and thus all that remained to be established was whether the drugs were for the purpose of trafficking. The prosecution submitted that this latter point should be answered in the affirmative because the accused clearly admitted that he was on his way to deliver the drugs to Bapak’s contact at the time of his arrest. Accordingly, the total quantity of 386.7g of methamphetamine was in the accused’s possession for the purpose of trafficking and he should be convicted on the charge as framed. 22     The accused’s defence was that he did not intend to traffic in the quantity of methamphetamine found on him,viz, 386.7g, but only in a lesser quantity of up to 250g.[note: 8]In support of this defence, the accused alleged that he had an agreement with Bapak not to deliver more than 250g of ice. Given the existence of such an agreement, the accused argued that he neither knew nor could have suspected that the amount of ice which he received on the morning of his arrest was in fact in excess of 250g. Accordingly, I was urged to amend the charge by reducing the amount of methamphetamine possessed by the accused for the purpose of trafficking to one which was not more than 250g.",
        "My decision": "23     The required elements for a charge of trafficking under s 5(1)(a) MDA are as follows (seeMuhammad Ridzuan bin Md Ali v Public Prosecutor and other matters[2014] SGCA 32 at [59]): (a)     possession of a controlled drug; (b)     knowledge of the nature of the drug; and (c)     proof that possession of the drug was for the purpose of trafficking which was not authorised. 24     In the present case, it is the first element regarding “possession” that is in issue. Specifically, the accused’s defence raised the question ofhow muchmethamphetamine was in his possession at the time of his arrest.",
        "The accused was presumed under s 18(1)(a) MDA to have all 386.7g of methamphetamine in his possession": "25     There is no doubt that the accused was inphysicalpossession of the two plastic bags, A1 and A2, that containedall386.7g of methamphetamine. In these circumstances, I accept the prosecution’s submission that s 18(1)(a) MDA is triggered to presume that the accused was in possession of this entire quantity of drugs. Section 18(1)(a) MDA provides as follows: 18.—(1) Any person who is proved to have had in his possession or custody or under his control — (a) anything containing a controlled drug; … shall, until the contrary is proved, be presumed to have had that drug in his possession. 26     This presumption, however, may be rebutted by the accused on a balance of probabilities (seeTan Kiam Peng v Public Prosecutor[2008] 1 SLR(R) 1 (“Tan Kiam Peng”) at [60]) by adducing evidence that he did not have the requisitemens reafor possession. This involves the accused proving that he did not know of theexistence(as opposed to thenature) of the drugs in his physical possession. That it is open for the accused to rebut the presumption of possession in this way is clearly borne out by the following passage inFun Seong Cheng v Public Prosecutor[1997] 2 SLR(R) 796 where M Karthigesu JA stated (at [54]–[55]) that: Physical control is not enough for the purpose of proving possession. There needs to bemens reaon the part of the accused.InWarner v Metropolitan Police Commissioner[1969] 2 AC 256, a case where the House of Lords was trying to determine the meaning of \"possession\" for the purpose of s 1 of the Drugs (Prevention of Misuse) Act 1964, Lord Pearce had this to say: One may, therefore, exclude from the 'possession' intended by the Act the physical control of articles which have been 'planted' on him without his knowledge.But how much further is one to go? If one goes to the extreme length of requiring the prosecution to prove that 'possession' implies a full knowledge of the name and nature of the drug concerned, the efficacy of the Act is seriously impaired, since many drug pedlars may in truth be unaware of this.I think that the term 'possession' is satisfied by a knowledge only of the existence of the thing itself and not its qualities... InTan Ah Tee v PP[1979-1980] SLR(R) 311, a case concerning the meaning of \"possession\" in the Misuse of Drugs Act 1973, Lord Pearce's dicta was cited with approval by the Court of Appeal. Wee Chong Jin CJ, delivering the judgment of the Court of Appeal, said (at [25]): In our opinion the word 'possession' in the Act should be construed as that word has been construed by Lord Pearce and we would respectfully adopt his reasons as contained in his speech. A long line of cases have since followedTan Ah Tee v PPandWarner v Metropolitan Police Commissioner. [emphasis added] 27     In the present case, the accused was not asserting that he did not know of the drugs in the plastic bags. Certainly, his defence was not that the drugs had been “planted” without his knowledge. Instead, his defence was that although he knew that the plastic bags contained the drugs, that knowledge was limited only to the existence of a quantity of methamphetamine which did not exceed 250g. It was in this connection that the accused’s alleged agreement with Bapak was relevant. This was because if there was indeed an agreement to receive no more than 250g of methamphetamine, then that went towards showing that the accused could not reasonably have known of or suspected the existence ofthe excessmethamphetamine which he was in fact carrying at the time of his arrest. If this was successfully proved, then the presumption that he possessedall386.7g of methamphetamine under s 18(1)(a) MDA would be rebutted.",
        "The presumption was rebutted by proof that the accused did not know that he had more than 250g of methamphetamine in his possession": "28     Having considered the evidence before me, I am satisfied on a balance of probabilities that (1) the accused had an agreement with Bapak not to deliver more than 250g of methamphetamine, and that (2) he had no reason to suspect that he had been given a quantity of methamphetamine in excess of that agreed upon limit. Accordingly, the presumption in s 18(1)(a) MDA is rebutted. I explain my findings below. The accused had an agreement with Bapak not to deliver more than 250g of methamphetamine 29     The accused gave evidence at trial that his alleged agreement with Bapak was reached during a conversation prior to his first delivery. He stated that he specifically sought Bapak’s assurance that the weight of ice which he was to deliver should not exceed 250g because he knew that he faced the death penalty if caught delivering more than this amount. The agreement was therefore designed to avoid such fate befalling him:[note: 9] Q:So you asked Bapak what is the weight of the Ice he wants you to deliver? A:Yes, Sir. Q:And what did you say to him? A:I say, if it’s, er, if it’s 250 grams and below, ah, it should be okay to me. … Q:Why did you choose 250 as the cut-off point? … A:I got to know that, er, after the 250 grams, there will be a death sentence if I am caught. … Q:And what was Bapak’s reply? A:He said, “Okay”. 30     The prosecution submitted that this purported agreement with Bapak was nothing more than an afterthought conjured up by the accused at trial.[note: 10]In particular, the prosecution pointed out that the accused did not mention such an “agreement” when he had the opportunity to do so in his cautioned and long statements; thus he was not to be believed. 31     I do not agree with the prosecution’s arguments. First, I examine the accused’s cautioned statement. I have already referred to this statement (see [13] above) but I reproduce it again for ease of reference: If I had knew that the amount of ICE that I was going to collect this morning was 500 grams, I would not have collected the ICE.Before today, I used to collect ICE below the weight of 250 grams. I really do not know why the ICE amount today was 500 grams which is more than usual.The reason for me not dealing with ICE more than 250 grams is that I knew it would be death sentence if I am caught. [emphasis added] 32     The whole purpose of recording a cautioned statement from an accused person is to compel him to outline the main aspects of his defence immediately upon being charged so as to guard against him raising defences at trial which are merely afterthoughts (seeYap Giau Beng Terence v Public Prosecutor[1998] 2 SLR(R) 855 at [38]). In the present case, I find that the accused had satisfactorily outlined the defence which he relied on at trial in his cautioned statement. While he did not explicitly mention that there was an “agreement” in this statement, I find that it is nevertheless sufficiently apparent from the italicised words in the paragraph above that he did allude to the existence of some prevailing practice where he regularly dealt in less than 250g of ice. To my mind, this is indeed consistent with or referable to the kind of agreement which the accused alleged he had with Bapak,ie, one which limited the quantity of ice to be delivered each time to no more than 250g. That such an agreement existed also provides a reasonable explanation for the accused’s surprised reaction at finding out the quantity of ice he was actually carrying upon being charged. While the contents of that agreement and the circumstances in which it originated may have only become clearer during the trial, I do not regard the absence of such elaboration in the accused’s cautioned statement to be a proper basis for drawing an adverse inference against him. This is because it is well-established that an accused person is not compelled to minutely detail his defence at trial in his cautioned statement (seeRoshdi v Public Prosecutor[1994] 3 SLR(R) 1 at [21]). Instead, I find that as the existence of some form of agreement could broadly be gleaned from the accused’s cautioned statement, this statement had the effect of shoring up his defence at trial rather than showing it up as a sham. 33     Second, I consider the accused’s long statements. Here, the prosecution is again accurate in observing that there is no explicit mention of an “agreement” between the accused and Bapak. However, it emerged during the trial that this was likely attributable to a lapse by the investigating officer who interviewed the accused, namely DSP Tan, rather than any omission by the accused himself. This was because DSP Tan revealed in cross-examination that he was in fact informed by the accused that therewassuch an agreement. Yet, this was not recorded down. In these circumstances, I do not see how the absence of this material fact from the accused’s long statements can now be relied on to prejudice his defence. The relevant part of the Notes of Evidence where DSP Tan made this crucial admission is as follows:[note: 11] Q:And I’m also putting it to you more specifically that the accused says that he had an understanding with Bapak that he would not ask him to courier more than 250 grams of Ice. And if Bapak was produced, Bapak could have either confirmed or rebutted that assertion by my client. A:Your Honour, yes, the accused, er, did claim that, er, he has a agreement with Bapak, er, that, er, he will not transact more than 250 gram. [emphasis added] 34     I have thus far found that the accused did allude to the existence of an agreement with Bapak in his cautioned statement and that he did explicitly inform DSP Tan of the same when giving his long statements. The upshot of this is that the accused had raised his alleged agreement with Bapak early in the course of being investigated and on more than one occasion as well. His defence at trial, therefore, is not a mere afterthought as the prosecution contended. Instead, it carries a ring of truth to it which, I find, is further amplified by his unchallenged evidence that he never delivered more than 250g of ice for Bapak on three previous occasions. It is of course possible to argue that it was merely fortuitous that the accused was never given more than 250g of ice to deliver on previous occasions and that this, in turn, provided a convenient hook upon which he constructed and hung his entire defence. However, I am not inclined to that view. Having heard the testimony of the accused and observed his demeanour at trial, I believe his evidence that he knew of the quantity of ice which would attract the death penalty and that he had a clear desire to avoid such punishment. It thus did not seem likely that he would have accepted the offer of a flat rate of $500 to deliverwhateveramount of ice for Bapak, and possibly subjecting himself to capital punishment in the course of doing so. On balance, therefore, I find that the accused’s receipt of less than 250g of ice on the three previous occasions was more explicable on the basis that he had an agreement with Bapak which capped the delivery of ice at precisely that amount. 35     In light of the above, I am satisfied that the accused did reach an agreement with Bapak not to deliver more than 250g of methamphetamine on each occasion. The accused had no reason to suspect that he had been given more than 250g of methamphetamine on the day of his arrest 36     The accused’s agreement with Bapak certainly buttresses his defence that he did not know he was carrying more than 250g of ice on the morning of his arrest. However, it still remains to be considered whether anything might have aroused his suspicion that the agreement was not adhered to that day. This is an important consideration because a person who suspects that something is amiss, but embarks on a deliberate decision not to make further inquiries in order to avoid confirming what the actual situation is, will be regarded in law as having been wilfully blind, and that is the equivalent of having actual knowledge (seeTan Kiam Pengat [123] and [127]). Therefore, if the accused in this case had cause to suspect that he had received more than the agreed limit of ice on his fourth delivery and yet failed to investigate matters further, then he cannot be heard to argue that he had no knowledge of the quantity of ice which he was actually carrying. In that event, the accused’s agreement with Bapak would matter little since he would be treated in law as actually knowing that such agreement had been deviated from. 37     In this vein, the prosecution submitted that there were two features in the current factual matrix which should have aroused the accused’s suspicions. First, the prosecution noted that the accused had received 250g of ice on his third delivery, an amount which was right at the threshold for attracting capital punishment. The prosecution submitted that the perilous nature of the third delivery would necessarily have concerned the accused who ought, therefore, to have sought assurances from Bapak that their alleged agreement would not be breached on the next delivery.[note: 12] 38     I am not convinced by this argument. Although the ice which was given to the accused on his third delivery did go all the way up to 250g, that amount was still within the bounds of his agreement with Bapak. With the agreement remaining intact, I do not see why the suspicions of the accused ought necessarily to have been raised. It could equally, if not more so, be reasoned that the accused’s receipt of 250g of ice on his third delivery, a quantity which strainedbut went no furtherthan the maximum agreed limit, in fact reaffirmed that Bapak had not forgotten about their prior agreement and would continue to abide by it moving forward. Therefore, I find the accused’s explanation that he did not make any enquiries with Bapak after the third delivery because they “already had the agreement in the first place”[note: 13]was not an unreasonable one. 39     The second point highlighted by the prosecution related to the circumstances in which the accused received the ice on his fourth delivery. Here, the prosecution took issue with the accused’s version at trial that he had seen onlyoneplastic bag, A2, being placed on his front passenger’s seat by the Malaysian Indian man at Kranji MRT station.[note: 14]According to this version by the accused, the other plastic bag, A1, was contained inside A2 and was thus hidden from view. The prosecution submitted that this portrayal of the facts was not to be believed because it was directly contradicted by the accused’s own long statements where he admitted to seeingboththe plastic bags, A1andA2, being placed into his car (see [19] above).[note: 15]The prosecution stressed the importance of this point because it meant that the accusedhadreason to suspect that he had been given a substantial quantity of ice, possibly more than the maximum agreed amount of 250g. Accordingly, he should have enquired about the weight of the ice and cannot now downplay the circumstances to support why he did not.[note: 16] 40     Again, I am not persuaded by this argument. To begin with, I find that the accused’s version at trial was not undermined by his long statements. In my view, it is likely that the accused described two plastic bags being placed into his car because, by the time his long statements were recorded, he hadalreadybeen made aware of the existence of both plastic bags. He learnt of this soon after his arrest when SSI Heng recorded a contemporaneous statement from him at the Beatty Road car park (see [12] above). Specifically, this was when SSI Heng held up two separate Ziploc bags which separately contained A1 and A2 before asking, “What are these 2 packets of crystalline substance we found on your car?”[note: 17]In my view, this clearly shows that the accused came to know that he was given two plastic bags early on in CNB’s investigations, hence his subsequent long statements ought reasonably to be read in that light. 41     In fact, I am minded to believe the accused’s version that he had only received one plastic bag, A2, which contained the other, A1. In this regard, I note the accused’s evidence that he had been driving very fast after collecting the ice as there was little traffic on the roads early that morning.[note: 18]In these circumstances, it is not entirely inconceivable that the tied plastic bag, A1, could have slid out of the untied plastic bag, A2, when the accused braked hard, something which he stated he might have done.[note: 19]This would therefore explain why SSI Tony had recovered two plastic bags from the front passenger’s seat when he searched the Car (see [11] above).[note: 20] 42     Notwithstanding the foregoing, I find that even if the accused was handed two plastic bags on his fourth delivery, this could not have sufficiently aroused his suspicion that the agreement with Bapak had been breached. This is because it is illogical to expect him, even with his experience in weighing and re-packing drugs, to guess the volume (and hence weight) of ice which he had received merely by observing the external appearance and size of the two plastic bags, A1 and A2. In this regard, it is pertinent to note that the accused also did not take hold of the plastic bags (see [19] above), hence he could not possibly have felt that the 386.7g of ice which he received was more than the 250g which was the maximum that he agreed to carry. However, even that assumes that it is possible to tell the difference in weight merely by lifting the plastic bags. In my view, that difference is so slight that it is not likely to be registered by ordinary human senses but by a weighing machine only. 43     In light of the above, I find that the prosecution did not raise any specific facts which could reasonably be said to have thrown suspicion on the quantity of ice which the accused thought he received prior to his arrest. The circumstances in which the accused received the ice that morning followed a consistent pattern from his three previous deliveries, each of which never involved more than 250g as per his agreement with Bapak. Bapak might have made a mistake in packing more ice on the fourth occasion or he might have done so deliberately in order to exploit the accused whose courier services were being provided at a flat fee of $500. However, whatever the underlying reason, I find that the circumstances surrounding the accused’s fourth delivery were such that he could not have been any the wiser as to the agreement’s breach. While I am aware that the accused did admit to having contemplated, and being concerned, by the possibility that such a scenario might play out in reality,[note: 21]I am of the view that these suspicions which he harboured werenot firmly grounded on specific factsbut arose simply by virtue of the risky venture which he undertook. Hence, his suspicions could be characterised as being merely of a “low level” or of an “untargeted or speculative” nature (seeTan Kiam Pengat [125]), and that is insufficient to ground a finding of wilful blindness.",
        "Conclusion": "44     In the premises, I am satisfied that the accused had an agreement with Bapak not to deliver more than 250g of methamphetamine and, further, that he had no reason to suspect that this agreement was breached on the day of his arrest. I thus accept his defence that he knowingly possessed no more than 250g of methamphetamine at the material time. Accordingly, I amended his capital charge to one of possessing 249.99g of methamphetamine for the purpose of trafficking and convicted him on this amended charge.  [note: 1]Agreed Bundle at p 290 [note: 2]Agreed Bundle at pp 206–210 [note: 3]Agreed Bundle at pp 263–265 [note: 4]Agreed Bundle at pp 266–278 and pp 312–313 [note: 5]Agreed Bundle at p 271, para 15 [note: 6]Agreed Bundle at pp 46–47 [note: 7]Prosecution’s Closing Submissions dated 15 April 2014 (“Prosecution’s Closing Submissions”) at paras 34–35 [note: 8]Defence’s Closing Submissions dated 15 April 2014 (“Defence’s Closing Submissions”) at para 6 [note: 9]Notes of Evidence dated 19 March 2014, Day 5, at p 26 lines 11–29 [note: 10]Prosecution’s Closing Submissions at paras 39–44 [note: 11]Notes of Evidence dated 6 March 2014, Day 3, at p 66 lines 23–28 [note: 12]Prosecution’s Closing Submissions at para 45 [note: 13]Notes of Evidence dated 19 March 2014, Day 5, at p 51 line 23 [note: 14]Notes of Evidence dated 19 March 2014, Day 5, at p 75 lines 14–17 [note: 15]Agreed Bundle at p 271, para 15 [note: 16]Prosecution’s Closing Submissions at para 47 [note: 17]Notes of Evidence dated 19 March 2014, Day 5, at p 182 lines 4–26 [note: 18]Agreed Bundle at p 272, para 19 [note: 19]Notes of Evidence dated 19 March 2014, Day 5, at p 179 lines 20–27 [note: 20]Notes of Evidence dated 6 March 2014, Day 3, at p 25 lines 8–10 [note: 21]Notes of Evidence dated 19 March 2014, Day 5, at p 144 line 32 – p 145 line 21"
    }
}