{
    "case_title": "Law Society of Singapore\n      v\n      Yap Bock Heng Christopher",
    "ncitation": "[2014] SGHC 188",
    "coram": "Sundaresh Menon CJ; \n      Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA",
    "sections": {
        "Facts": "2       The Respondent was admitted to the Roll of Advocates and Solicitors of the Supreme Court of the Republic of Singapore on 8 March 1995. At the material time, the Respondent practised as a sole proprietor of the law firm known as M/s Christopher Yap & Co.",
        "OS 1149/2013": "16     Rule 33(a) of the PC Rules, read with r 32 of the same, prohibits an advocate and solicitor from entering into a borrowing transaction with a client (banks or finance companies excepted) unless the condition specified in r 34(a) of the same has been complied with,ie, the client received independent legal advice prior to the transaction. At the time when the loan was extended by the complainant to the Respondent, the Respondent was clearly in a solicitor-client relationship with the complainant as he was acting for the complainant in relation to the latter’s detention in Jakarta. This was acknowledged by the Respondent on the stand, and also evidenced by the Respondent invoicing $74,000 for work done on that matter. The Respondent conceded that he was aware that he had contravened r 33 of the PC Rules. 17     The alleged repayment period of two weeks, which was disputed, was irrelevant to the charge. That the client suffers no loss is also irrelevant:Re Shan Rajagopal[1994] 2 SLR(R) 60 at [13]. 18     When the Respondent was cross-examined on his motive for issuing the five invoices totalling $118,000, he admitted that the invoices were issued because he was upset with the complainant and his sister for repeatedly asking for repayment of the loan.",
        "OS 157/2014": "19     The purpose of the SA Rules is to protect the public and instil public confidence in advocates and solicitors. Where a solicitor has acted not just in breach of the rules but also dishonestly, he will be struck off the roll:Law Society of Singapore v Lee Yee Kai[2001] 1 SLR(R) 30 at [20]. 20     A failure to maintain the requisite accounting records inevitably results in a finding of professional misconduct. It is immaterial that the breach was inadvertent and had not been inspired by improper motives:Bolton v Law Society[1994] 1 WLR 512 at 516. Proof of wilful conduct is not necessary to establish a breach of the SA Rules:Law Society of Singapore v Tay Eng Kwee Edwin[2007] 4 SLR(R) 171 (“Edwin Tay”) at [18]. However, proof of wilful conduct will be germane to the question of punishment. 21     In the premises, counsel for the Law Society submitted that the Respondent should be suspended from practice in relation to his breaches of the SA Rules.",
        "The Law Society’s submissions": "",
        "Issues before this court": "22     In view of the fact that the charges brought against the Respondent were not in dispute, the issues which remained for our determination concerned the appropriate punishment and were as follows: (a)     Is the imposition of a monetary penalty appropriate for a prohibited borrowing transaction? (b)     Is the imposition of a monetary penalty appropriate for a failure to adhere to accounting rules? (c)     Does the Court of Three Judges have the power to impose consecutive sentences? (d)     What would be the appropriate global punishment for both sets of the Respondent’s misconduct?",
        "Is a monetary penalty appropriate for a prohibited borrowing transaction?": "23     The Legal Profession (Amendment) Act 2008 (Act 19 of 2008) amended s 83 of the LPA to grant the Court of Three Judges the power to impose a monetary penalty. The reason for this amendment was elucidated inLaw Society of Singapore v Andre Ravindran Saravanapavan Arul[2011] 4 SLR 1184 (“Andre Ravindran”) at [23]. In brief, it was recognised that the lack of the power to impose a fine could result in disproportionate punishments being imposed on errant solicitors. However, the question remains as to when this new punishment option should be exercised. 24     At this juncture, we think it apposite to turn to the case law. As a preliminary point, the cases which predate the 2008 amendments are of limited assistance because the Court of Three Judges in those cases might very well have chosen to impose a fine in lieu of suspension, had the option of doing so been available then. Post-2008 amendments, the Court of Three Judges held inAndre Ravindranat [36] that in the light of this new punishment option, fines should be imposed for disciplinary offences too serious to be punished with censures, but insufficiently serious to deserve suspension. InLaw Society of Singapore v Tay Choon Leng John[2012] 3 SLR 150 (“John Tay”), the Court of Three Judges opined at [62] that the 2008 amendments were “designed to bridge the cavernous gulf between a censure and suspension”. 25Andre Ravindransuggests the adoption of a category-based approach. The court must determine if the offence falls within the class of disciplinary offences which are too serious for a censure but insufficiently serious for a suspension (at [36]). The Court of Three Judges went on to hold that overcharging would fall within such a class, provided no dishonesty or deception is involved (ibid.). A fine would not be appropriate if the conduct in question is redolent of cheating or deceiving the client (at [38]). InJohn Tay, the court citedAndre Ravindranwith approval (at [57]) and agreed that the distinguishing factor was dishonesty or deceit (at [59]). 26     We did not think, however, that the decision inAndre Ravindranshould be read as intending to exhaustively stipulate the circumstances in which a fine or suspension would be appropriate. InJohn Taythe court observed that gross negligence may or may not be sufficient to warrant the imposition of suspension, depending on the overall circumstances (at [59]). Subsequently inLaw Society of Singapore v Chiong Chin May Selena[2013] SGHC 5, the Court of Three Judges referred to their earlier decision inJohn Tayand stated that monetary penalties were not necessarily sufficient; and that much would depend on the overall circumstances (at [44]). For instance, aggravating circumstances like a record of previous misconduct, may justify a departure from the starting point of a fine where there was no dishonesty or deceit involved (at [45]). 27     In our view, it would be wrong to draw the line at dishonesty. The absence of dishonesty does not necessarily lead to the conclusion that the penalty imposed should only be a fine. Indeed where there is clear dishonesty, a fine will be manifestly inadequate and a striking off the Roll would generally be the order of the day (see above at [19]). Rather, it is the overall gravity of the misconduct that determines whether a fine or the more severe punishment of suspension should be imposed. 28     A breach of rr 33(a) and 34(a) of the PC Rules is one that will be viewed extremely seriously by this court. The rationale for prohibiting solicitors from borrowing from their clients (except where the clients have obtained independent legal advice) should be apparent. A client is vulnerable vis-à-vis his solicitor because the latter enjoys a position of influence over the client, and the client may find it difficult to deny a loan simply because of the trust and confidence he has reposed in the solicitor: seeLaw Society of Singapore v Devadas Naidu[2001] 1 SLR(R) 65 at [17] which in turn cites the decision of Hope JA inLaw Society of New South Wales v Moulton[1981] 2 NSWLR at 739-740. 29     Furthermore, it is trite that a solicitor stands in a fiduciary relationship to his client and that the core of this relationship is the duty of fidelity,ie, the duty on the fiduciary’s part to place the interests of his principal ahead of his own:Ng Eng Ghee and others v Mamata Kapildev Dave and others (Horizon Partners Pte Ltd, intervener) and another appeal[2009] 3 SLR(R) 109 at [135]. A solicitor should therefore act vis-à-vis his client with utmost good faith. One purpose of the disciplinary process is to uphold such norms of fiduciary conduct:Law Society of Singapore v Uthayasurian Sidambaram[2009] 4 SLR(R) 674 at [1]. Whilst a solicitor who borrows from his client who is not independently advised may not be considered dishonest in the usual sense, he is certainly taking advantage of his position to obtain a benefit for himself in breach of his duty of fidelity. 30     In the premises, we think it incumbent to send a clear message to the profession that such violations are not trivial and will be dealt with accordingly. We reiterate the proposition that it is irrelevant, both as a matter of liability and as a mitigating factor, that the client suffered no loss as a result of a prohibited borrowing transaction (Re Shan Rajagopalat [13]). We add, however, that where a solicitor has not repaid the loan and the client is left worse off, this would be taken as an aggravating factor that calls for more severe punishment.",
        "Is the imposition of a monetary penalty appropriate for a failure to adhere to accounting rules?": "31     In contrast to a solicitor who enters into a prohibited borrowing transaction with a client, we recognise that a failure to adhere to the SA Rules may not necessarily entail the violation of norms of fiduciary conduct. That said, it does not follow that such failures will inevitably be less serious. For instance, a one-off inadvertent failure to comply with the SA Rules is clearly distinguishable from persistent default. Put simply, the offence embraces a range of culpability depending on the fact-situation. 32     The entire object of the SA Rules for solicitors is to ensure that clients’ money is properly recorded and accounted for. When a solicitor’s accounts are not in order, it cannot be known if clients’ money has been misplaced, or used for inappropriate purposes. As we indicated above, at one end of the spectrum, a solicitor may commit a one-off trivial or technical breach of the SA Rules due to inadvertence or negligence which has since been resolved. If the solicitor has by and large adhered to the SA Rules, save for that one technical breach, a fine should suffice. At the other end of the spectrum, a solicitor may have systematically and deliberately flouted the SA Rules in an effort to obfuscate the systematic diversion of clients’ monies for personal use. In such a case, the solicitor should be struck off the Roll. 33     We were of the view that blatant non-compliance (unless the non-compliance is one-off) is a serious form of misconduct, even if the solicitor had not diverted clients’ money for his own use. A fine would not be adequate in such a case. In this regard the following propositions advanced inEdwin Taywere germane: (a)     Even if no apparent dishonesty is involved, a solicitor could be struck off  if the lapse is of such a nature as to indicate that he lacks the requisite qualities of character and trustworthiness (at [20]). (b)     The deliberate, wilful and prolonged breach of the SA Rules, which have the force of law, indicates a manifest defect of character and the solicitor cannot be trusted to responsibly discharge his obligations to uphold the rule of law (at [22]). (c)     Solicitors breaching the SA Rules cannot claim in mitigation that no loss has occurred; if no accounts whatsoever have been maintained, that makes it inherently difficult to determine whether any loss had indeed occurred. In any event, the essence of the wrong is in the deliberate disregard of the statutory rules designed and enacted to protect the public (at [28]). 34     As can be seen from [12(c)] above, the reason the Respondent gave for not maintaining any books of account was that he seldom held client’s money. Whenever possible, he would ask the paying party to pay directly to client, obviating the need for his firm to act as a conduit. That notwithstanding, and no matter how few the occasions in which the Respondent’s firm would have to hold client’s money, the Respondent should have nevertheless complied with the SA Rules. The Respondent had deliberately flouted the rules and for such grave misconduct a fine would not suffice. We emphasise again that an isolated lapse in compliance is one thing, but knowingly and persistently failing to comply with the SA Rules is quite another.",
        "Does the Court of Three Judges have the power to impose consecutive suspensions from practice which in total exceeds five years?": "35     Before dealing with the proper punishment for the breaches of the SA Rules, we needed to first address the following procedural point. Section 83(1)(b) of the LPA provides that, on due cause being shown, an advocate and solicitor shall be liable to be suspended from practice for a period not exceeding five years. The question that arose was whether the Court of Three Judges could punish a solicitor with consecutive suspensions that exceed five years in total. Where criminal matters are concerned, the statutory framework is clear. Section 303 of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) (“the CPC”) empowers the High Court to pass any sentence authorised by law. Section 306(2) of the CPC expressly provides that imprisonment terms may be ordered to run consecutively or concurrently, subject to the requirement that where the accused is convicted and sentenced to imprisonment for at least three distinct offences, sentences for a least two of the offences must run consecutively. 36     At common law, consecutive sentences have always been permitted for criminal matters. InRex v John Wilkes, Esq(1770) 4 Burr 2527 (“R v Wilkes”), the defendant had already been convicted and sentenced to imprisonment for seditious libel, and was again convicted and sentenced to imprisonment for another count of libel. The defendant filed a writ of error (via the Attorney-General) to the House of Lords. The House of Lords was asked three questions of law, one of which pertained to consecutive sentences. It held that a judgment of imprisonment imposed against a defendant which was to commence from and after the determination of an earlier imprisonment term to which he was sentenced for another offence, was good in law (at 2577). 37R v Wilkeswas followed by the English Court of Criminal Appeal inRex v Albury[1951] 1 KB 680. There the appellant had already been sentenced to two years’ corrective training when he admitted to guilt in respect of another six offences. He was sentenced to another two years’ corrective detention to follow the original sentence. There were no statutory provisions which stated that consecutive corrective training sentences were permitted. Speaking for a unanimous court, Lord Goddard CJ said that the principle inR v Wilkesalso applied to corrective training, and there was no reason in law why it would not be possible to impose a sentence of corrective training to follow immediately after a similar sentence. 38R v WilkesandRex v Alburyundoubtedly form part of the common law of Singapore. The provisions of the CPC that allow a court to impose consecutive sentences are a codification of the common law. Quite apart from the CPC, the High Court has the power to pass any sentence authorised bylaw(s 15(1) of the Supreme Court of Judicature Act (Cap 322, 2007 Rev Ed), (“the SCJA”)), and law must be taken to also comprise the common law as received into Singapore by the Second Charter of Justice, which includesR v Wilkes. 39     By analogy fromR v WilkesandRex v Albury, a court exercising its disciplinary jurisdiction has the power to impose consecutive periods of suspension. However, it is another question entirely whether the totality of the two or more periods of suspension can exceed five years. In this regard, it is pertinent to note that the Court of Three Judges is a specially constituted court exercising a unique disciplinary jurisdiction under the LPA:Re Nalpon Zero Geraldo Mario[2013] 3 SLR 258 at [55] and [67]. In the light of s 83(1)(b) of the LPA, we were of the view that the Court of Three Judges cannot in any circumstances impose a suspension period exceeding five years in total. 40     Ordinarily, unless there are reasons which dictate otherwise, a single DT could be constituted to hear several distinct sets of offences. Even where, for good reason, separate DTs are constituted to hear separate sets of offences, they could still be collectively brought before the Court of Three Judges, as in this case. Where an application made to the Court of Three Judges involves more than one set of misconduct on the part of the solicitor, the court would naturally view the misconduct in totality and determine the appropriate sentence. 41     However, the situation could arise where a solicitor’s further wrongdoing surfaces and is brought before the Court of Three Judges whilst he is serving his term of suspension imposed earlier for a different set of misconduct. If the court thinks that a five year period of suspension would be the appropriate punishment to mete out to the solicitor for these newly surfaced wrongdoings, can the court impose a five year suspension to commence after the first period of suspension? We think the answer is in the negative. If the court thinks that the solicitor deserves no less than a five year suspension for the new wrongdoings, then the court should strike him off the Roll. However, the position would be different if the second set of offences were to come before the court after the first period of suspension had already been served. The court could, in this situation, impose a suspension of up to five years, if it deems this to be appropriate.",
        "The appropriate punishment": "42     As we held above at [26] – [30], dishonesty is not the sole criterion for imposing a period of suspension in respect of prohibited borrowing from a client. Additionally, the following aggravating features demonstrated the gravity and seriousness of the Respondent’s breach which called for a lengthier period of suspension: (a)     The Respondent requested for the loan while the complainant was incarcerated in an Indonesian jail. This placed tremendous psychological pressure on the complainant; he would have found it difficult to say no to the Respondent, who was actively working on his release; (b)     The Respondent avoided contact with the complainant and the complainant’s sister for an extended period of time in order to avoid repaying the loan; (c)     The Respondent expressed frustration at the complainant and the latter’s sister for chasing for repayment, and threatened to “response accordingly” [sic]. The Respondent made good on that threat, and presented several bills totalling $118,000. At taxation, he sought to increase the claims for his fees to $148,000, which was eventually taxed down to $20,000; (d)     To the date of hearing, the Respondent had only repaid $700 of the $34,000 loan. That the client was demonstrably worse off is a significant aggravating factor (see [30] above). 43     The Respondent’s failures to produce and maintain accounting records were grave and systemic: (a)     The Respondent admitted that he did not adhere to the accounting rules in order to save costs; (b)     Despite numerous requests and warnings to adhere to the accounting rules starting from July 2012, he only found somebody to “do my book over the weekend free of charge” in February 2013; (c)     The Respondent had, to the date of hearing, still not remedied the breaches. 44     During the hearing before us, the Respondent pointed out that his accounts had to be audited in order for his practising certificate to be renewed. This is indeed the case: s 25(1) of the LPA stipulates that practising certificates must be applied for yearly, and s 73(1) of the LPA further requires an accountant’s report to be submitted with every application for a practising certificate. Rule 2 of the Legal Profession (Practising Certificate) Rules (Cap 161, R 6, 2010 Rev Ed) states that a practice year comprises the period from 1 April in any calendar year to 31 March in the next ensuing calendar year. This meant that the Respondent would have, at the very latest, submitted an accountant’s report to the Registrar on 31 March 2012. As the accounting period for the report must terminate not more than 12 months before the date of the delivery of the report to the Law Society:  see s 73(3)(c) of the LPA, the Respondent’s accounts must have been in order until 31 March 2011. 45     However, when quizzed on why he did not obtain a letter from his accountant confirming this to be the case, the Respondent could not answer. Whatever might be the reason for the Respondent’s failure to obtain such a letter from his accountant, it would be true to say that from 1 April 2011 to 6 December 2012, a period of more than one and a half years, the Respondent deliberately and persistently failed to comply with the SA Rules. We could not view this as a one-off lapse; on the contrary it amounted to grave misconduct on the Respondent’s part. In our opinion, it called for a reasonable length of suspension. 46     We therefore affirmed the DTs’ findings of due cause and imposed the following penalties: for OS 1149/2013, in respect of the prohibited borrowing transaction, a suspension of two years; and for OS 157/2014, in respect of the accounting breaches a suspension of three years. There was absolutely no question of the one-transaction rule applying, because these were two distinct sets of offences. Both terms were to run consecutively for a total of five years’ suspension, commencing on 7 July 2014. 47     Costs, incurred both before the two DTs and this court, were awarded to the Law Society — to be taxed, if not agreed.  [note: 1]OS 1149/2013 RP Vol 1 p 90 [note: 2]OS 1149/2013 RP Vol 4 at para 16 [note: 3]OS 157/2014 RP Vol 1 p 104 [note: 4]OS 157/2014 RP Vol 1 p 136"
    }
}