{
    "case_title": "Pang Beng Kim\n      v\n      Ang Han Teong",
    "ncitation": "[2014] SGHC 240",
    "coram": "Tan Siong Thye J",
    "sections": {
        "Introduction": "1       This was a matrimonial case relating to the division of a matrimonial flat. The appellant is the former wife (“the wife”). She is deaf and dumb and used to be represented by the Legal Aid Bureau (“Legal Aid”).[note: 1]However at this appeal, she appeared in-person. Her brother was her spokesperson at the proceedings.[note: 2]The respondent is the former husband (“the husband”). He is also deaf and dumb as well as blind and half paralysed. He was represented by Legal Aid. 2       I heard the two appeals: Registrar’s Appeal No 73 of 2014 (“RA 73”) and Registrar’s Appeal No 75 of 2013 (“RA 75”) filed by the appellant. RA 73 was an appeal against Summons 4216 of 2014 (“SUM 4216”). It was an appeal against the decision of the District Judge, who dismissed the appellant’s application to set aside:[note: 3] (a)     a consent order dated 15 November 2006; (b)     the High Court order granted by Judith Prakash J on 28 February 2012; and (c)     another High Court order granted by Lai Siu Chiu J on 3 July 2013. 3       RA 75 was an appeal against the District Judge order who granted the respondent leave to issue a writ of possession on 23 January 2014.[note: 4] 4       The respondent applied to strike out both RAs. First, he submitted that RA 75 was filed out of time and the relevant documents for the appeal were not filed or served on time. Second, although RA 73 was filed within the prescribed time limit, the stipulated appeal documents were not filed and served pursuant to the Supreme Court Practice Directions. 5       I granted the respondent’s application to strike out both RAs. The appellant is now dissatisfied with my decision and lodged an appeal against the order.",
        "The background facts": "6       I would like to mention that the background facts are taken from the respondent’s submissions. This case had a long history of about eight years. It started on 1 June 2006, when the appellant commenced the divorce proceedings. On 15 November 2006, after a mediation session, the parties came to an agreement and a consent order was granted. It was agreed that the matrimonial flat would be sold and the proceeds were to be divided in the proportion of 55% to the appellant and 45% to the respondent. Thereafter, the appellant refused to sell the matrimonial flat. On 24 March 2011, the appellant took out Summons 5329 of 2011 (“SUM 5329”) for an order that the matrimonial flat be transferred to her solely without any payment to the respondent. This summons was dismissed. 7       On 30 June 2011, the respondent filed Summons 8086 of 2011 (“SUM 8086”) for an order to allow the respondent to solely conduct the sale of the matrimonial flat and for the appellant to vacate the flat within six weeks. This application was granted. 8       Subsequently, the appellant took out Summons 15542 of 2011 (“SUM 15542”) to set aside the two orders granted in SUM 5329 and SUM 8086. This action was dismissed. 9       On 20 October 2011, the appellant lodged RAS 190 of 2011 to appeal the consent order and all the orders granted by the Family Court in SUM 5329, SUM 8086 and SUM 15542. The appeal was heard by Prakash J on 28 February 2012. She dismissed the appeal with costs. She further ordered that unless the appellant bought over the respondent’s share of the flat within three months upon paying the respondent 45% of the open market value of the flat, she would have to vacate the flat within three months. 10     On 23 August 2012, the appellant tried to remove the respondent’s brother who was the court appointed Deputy for the respondent under the Mental Capacity Act (Cap 177A, 2010 Rev Ed). This application was dismissed. 11     On 31 October 2012, the respondent filed Summons 16852 of 2012 to enforce Prakash J’s order that the appellant vacate the flat immediately. On 24 December 2012, the appellant filed Summons 19533 of 2012 (“SUM 19533”) to vary Prakash J’s order on the ground of fraud. The appellant also filed Summons 2528 of 2013 (“SUM 2528”) for discovery of documents. Both SUM 19533 and SUM 2528 were dismissed with costs on 20 June 2013. 12     The appellant filed RA 87 of 2013 against the dismissal of SUM 19533 and SUM 2528. On 3 July 2013, Lai J dismissed the appeal with costs. 13     On 22 August 2013, the appellant filed Summons 11907 of 2013 for a stay of proceedings. This was also dismissed with costs. 14     On 2 October 2013, the respondent applied for writ of possession against the appellant. On 23 January 2014 the court issued a writ of possession to the respondent. This was executed on 21 April 2014. 15     On 25 March 2014 the appellant filed SUM 4216 to set aside the consent order made in 2006, Prakash J’s and Lai J’s orders on the ground of fraud. This application was dismissed with costs. 16     On 17 April 2014 the appellant filed RA 73 against the dismissal of SUM 4216. She also filed RA 75 of 2014 against the order made under Summons 30069 of 2013 (“SUM 30069”).",
        "RA 75 of 2014": "17     This was an appeal by the appellant against the decision of the district Judge in SUM 30069 who issued a writ of possession against the appellant on 23 January. The appellant was dissatisfied with the decision of the District Judge and wanted to reverse the judgment issued against her. 18     The writ of possession was issued on 23 January 2014 against the appellant as she refused to comply with the consent order made on 15 November 2006. This order was made after a mediation session in which she agreed to accept 55% of the matrimonial flat while the respondent receives 45%. Since 2006, the appellant had been making numerous applications to frustrate the consent order. On 24 March 2011, she even took out SUM 5329 to ask for an order that the matrimonial flat be transferred to her solely without any payment to the respondent. This summons was dismissed. I was of the view that the appellant was unlikely to succeed in RA 75. 19     Furthermore, the appellant had failed to comply with O 55C r 1(4) of the Rules of Court (Cap 322, R 5 2006 Rev Ed) (“ROC”) as she did not file an appeal within 14 days from the date of the decision.[note: 5]The last day to file the appeal was 7 February 2014. The Notice of Appeal was only lodged more than two months after the deadline for the appeal.[note: 6]The appellant also had not filed any application for an extension of time to lodge an appeal against the order of the District Judge.[note: 7]In the meantime the writ of possession had already been executed. 20     The appellant referred to O 2 of the ROC. She argued that O 2 of the ROC states that irregularities could not nullify the proceedings. O 2 reads: Non-compliance with Rules (O. 2, r. 1) 1.—(1) Where, in beginning or purporting to begin any proceedings or at any stage in the course of or in connection with any proceedings, there has, by reason of anything done or left undone, been a failure to comply with the requirements of these Rules, whether in respect of time, place, manner, form or content or in any other respect,the failure shall be treated as an irregularity and shall not nullify the proceedings, any step taken in the proceedings, or any document, judgment or order therein. (2) Subject to paragraph (3), the Court may, on the ground that there has been such a failure as is mentioned in paragraph (1), and on such terms as to costs or otherwise as it thinks just, set aside either wholly or in part the proceedings in which the failure occurred, any step taken in those proceedings or any document, judgment or order therein or exercise its powers under these Rules to allow such amendments (if any) to be made and to make such order (if any) dealing with the proceedings generally as it thinks fit. (3) The Court shall not wholly set aside any proceedings or the originating process by which they were begun on the ground that the proceedings were required by any of these Rules to be begun by an originating process other than the one employed. [emphasis added] 21     The appellant had clearly failed to comply with the timeline for appeal in RA 75. This was an irregularity that should have been rectified by an application for an extension of time under O 3 r 4 of the ROC. It was not done. 22     The appellant also had not filed the requisite documents for the purpose of the appeal as specified under para 142 the Supreme Court Practice Directions despite the reminder by the Assistant Registrar (“AR”) at the pre-trial conference on 19 June 2014.[note: 8]The appellant was required to file and serve those documents by 10 July 2014.[note: 9]However she had failed to file and serve the Record of Appeal, Core Bundle or any Bundle of Authorities.[note: 10]There was therefore substantial non-compliance with the AR’s directions. As per O 57 r 9(4) of the ROC, the appeal is deemed withdrawn. I set out the relevant provisions below: 9.  Record of Appeal and Appellant’s Case (O. 57, r. 9) (1) Within 2 months after service of the notice referred to in Rule 5 (2), the appellant must file — (a) one copy of the record of appeal; (b) subject to Rule 9A, the Appellant’s Case referred to in that Rule; and (c) a core bundle of documents (referred to in this Order as the core bundle), and serve a copy each thereof on every respondent to the appeal or his solicitor except that if the appeal is to be heard by a Court of Appeal consisting of 2 Judges of Appeal, these documents shall be filed and served within one month after service of the notice referred to in Rule 5 (2). … (4) Where an appellant omits to comply with paragraph (1), theappeal shall be deemed to have been withdrawn, but nothing in this Rule shall be deemed to limit or restrict the powers of extending time conferred upon the Court of Appeal. [emphasis added] 23     At the hearing, when the appellant heard that she was required to apply for an extension of time to file the appeal, she immediately sought to make the application. The respondent objected as the appellant had to file an affidavit to explain the reason for the delay, the length of delay, whether any prejudice had been caused to the respondent as well as set out her chances of succeeding at the appeal.[note: 11]The respondent would then have an opportunity to respond to the appellant. The procedure had not been complied with. It is my view that rules and procedure have to be complied with to ensure a level playing field for the parties. They are critical in an adversarial system.",
        "RA 73 of 2014": "24     RA 73 was an appeal against the dismissal of SUM 4216 to set aside the earlier consent order and the orders of Lai J and Prakash J. The consent order was made in 2006. Since then, the appellant had refused to comply with that court order and even wanted the matrimonial flat for herself. In RA 73, she appealed against the order of Prakash J who ordered her to vacate the matrimonial flat within three months and then sell it in the open market. Thereafter she was to pay the respondent 45% of the sale proceeds. 25     In the same RA 73, the appellant also appealed against Lai J’s order dismissing her appeal to vary Prakash J’s order on ground of fraud and refusing her discovery of documents. The appellant should have filed an appeal to the Court of Appeal if she was dissatisfied with the decisions of Prakash J and Lai J. Taking out a summons action because she was dissatisfied with the High Court decision is inappropriate. Perhaps, she was unfamiliar with the court’s civil procedure but be that as it may, the grounds of appeal in RA 73 were clearly baseless. 26     Although RA 73 was filed within the prescribed time, the appellant had also failed to comply with the substantial aspect of the Supreme Court Practice Directions regarding the filing and service of relevant documents for the appeal.",
        "My decision": "27     For RA 75, the appellant failed to lodge the appeal within the prescribed timeline. Both RA 73 and RA 75 did not comply with the Supreme Court Practice Directions. Accordingly, I set aside both the RAs until the appellant applied for an extension of time and complied with the Supreme Court Practice Direction for both RAs. 28     I noticed that the appellant had made numerous applications to prevent the consent order which she entered willingly in 2006 from taking effect. All those applications were dismissed. In my view, they were an abuse of the legal process to prevent the respondent who was deaf and dumb as well as blind and half paralysed from having his rightful share of the matrimonial flat.",
        "Conclusion": "29     These appeals were clearly unmeritorious and frivolous. I further ordered that the appellant pay costs fixed at $700 for both RAs to the respondent.  [note: 1]N/E of the District Judge at p 1. [note: 2]Minutes of hearing on 1/9/2014 at p 1. [note: 3]Minutes of hearing on 1/9/2014 at p 1. [note: 4]Minutes of hearing on 1/9/2014 at p 1. [note: 5]Minutes of hearing on 1/9/2014 at p 2. [note: 6]Minutes of hearing on 1/9/2014 at p 2. [note: 7]Minutes of hearing on 1/9/2014 at p 4. [note: 8]Ang Han Hock’s affidavit filed 22/7/2014 at para 5. [note: 9]Ang Han Hock’s affidavit filed 22/7/2014 at para 3. [note: 10]Ang Han Hock’s affidavit filed 22/7/2014 at para 4; Minutes of hearing on 1/9/2014 at p 2. [note: 11]Minutes of hearing on 1/9/2014 at p 3."
    }
}