{
    "case_title": "SH Cogent Logistics Pte Ltd and another\n      v\n      Singapore\nAgro Agricultural Pte Ltd and others",
    "ncitation": "[2014] SGHC 203",
    "coram": "Woo Bih Li J",
    "sections": {
        "Introduction": "1       This\ndispute is between the current and previous master tenants of a state-owned\nplot of land at the former Bukit Timah Turf Club at 200 Turf Club\nRoad Singapore 287994 (“the Site”). The current master tenant of\nthe Site alleges that the previous master tenant conspired with\nothers to injure it in the period leading up to the handover of\nthe Site.",
        "The Site": "2       The\nlandlord of the Site is the Government of the Republic of Singapore\n(“the Government”). The Government was, at the relevant time, acting\nthrough the Singapore Land Authority (“SLA”). It is not necessary for\npresent purposes to draw a distinction between the Government and SLA.\nI will henceforth make reference only to SLA. 3       The\nSite is one of the subdivided plots that make up the former Bukit Timah\nTurf Club. The approximate area of the Site is 178,762m2(about 1,923,837ft2).[note: 1]It\ncomprises a two-storey car park and a grandstand. The car park was\nconverted for use as a car mart. It was made up of 137 showroom units\nwith attached offices.[note: 2]The units\nwere sub-tenanted or licensed to second-hand car dealers. The grandstand\nwas converted for use as a retail block. It was made up of about\n94 retail units.[note: 3]The units\nwere sub-tenanted or licensed to shops, restaurants and other businesses.",
        "The parties": "4       There\nare various parties and witnesses. To minimise confusion, I will abbreviate\nthe names of corporations and refer to the names of persons in full. 5       The\nplaintiffs are part of the Cogent group. The second plaintiff, Cogent\nLand Capital Pte Ltd (“Cogent Land”) is, and has been, the master tenant\nof the Site since 1 March 2012. It is responsible for the management and\nmaintenance of the Site. The first plaintiff, SH Cogent Logistics\nPte Ltd (“SH Cogent”), was the entity that bid for the tenancy which\nCogent Land currently holds. When the tenancy was awarded to SH\nCogent, Cogent Land was incorporated for the purpose of entering\ninto the tenancy with SLA. Cogent Land is wholly-owned by SH Cogent. 6       The\nfirst defendant, Singapore Agro Agricultural Pte Ltd (“SAA”) was the\nprevious master tenant of the former Turf Club plot. It became the master\ntenant in 2001. During SAA’s term as master tenant, the former Bukit\nTimah Turf Club plot was subdivided into smaller plots, one of which is\nthe Site (the other plots are not material for present purposes).\nSAA’s tenancy expired on 29 February 2012, the day before Cogent\nLand’s tenancy commenced. The third defendant, Turf City Management\nPte Ltd (“TCM”) was responsible for the management and maintenance\nof the Site. The second defendant, Tan Chee Beng, said he was the\n“real decision-maker” in SAA[note: 4].\nTan Chee Beng was a majority shareholder and one of two directors of\nSAA (the other, Tan Bee Bee, was his sister) at the material time.[note: 5]He\nwas also a shareholder and a director of TCM at the material time.\nThe fourth defendant, Koh Khong Meng, also known as Roger Koh, was\na shareholder and a director of TCM at the material time. 7       Assuming\nthat there was a conspiracy, Cogent Land, the current master tenant,\nwould presumably have been the entity that suffered the loss, if\nany, caused by the conspiracy. TCM would presumably have been the entity\nwhich executed the acts pursuant to the conspiracy. SAA and TCM would\nalso presumably have been acting in accordance with the instructions\nand the intention of Tan Chee Beng, Roger Koh, or both. They were\ndirectors of one or both companies at the material time. 8       The\nparties, however, have not attempted to distinguish the various entities\nand persons in their pleadings and submissions. Further, none of the\ndefendants sought to distance himself or itself from the intention\nor conduct of any of the others. Therefore, for the sake of convenience,\nI will make reference to “the Plaintiffs” and “the Defendants” instead\nof the individual entities and persons, unless it is appropriate\nto refer to an individual entity or person.",
        "The cases of the parties": "9       The\nPlaintiffs allege that the Defendants conspired to injure the Plaintiffs\nby damaging their business of sub-tenanting and licensing the units\nas the subsequent master tenant of the Site. The Defendants did\nso by preventing the Plaintiffs from hitting the ground running\nwhen the Plaintiffs took over the Site from the Defendants. The\nDefendants did this in two ways. 10     First,\nthe Defendants removed electrical fittings, utilities equipment and\nstructures while carrying out reinstatement work at the Site prior\nto the handover. The Plaintiffs complain, in particular, of the\nDefendants’ deliberate removal of 18 items (these items are listed\nin the annexure to this judgment, and I shall refer to them collectively\nas “the 18 Items”).[note: 6]The Defendants\naccept that they removed five of the 18 Items, but dispute having\nremoved the rest. The Plaintiffs allege that they had to incur expense and\ntime to replace these removed items. 11     Second,\nthe Defendants obstructed existing sub-tenants and licensees at\nthe Site from continuing with their sub-tenancies and licences under\nthe Plaintiffs. This obstruction was the cumulative result of two\nacts of the Defendants: (a)     The\nDefendants created an air of uncertainty and anxiety which caused\nthen-existing sub-tenants and licensees to leave the Site. The Defendants\nsent letters to the sub-tenants and licensees insisting that all\nof them (even those that were prepared to consider entering into new\nagreements with the Plaintiffs) vacate their units by 31 January 2012.\nThis was disruptive to the businesses of those sub-tenants and licensees\nwho intended to continue under the Plaintiffs as they would have\nto vacate their units for a month or more before returning when the\nPlaintiffs’ tenancy commenced on 1 March 2012. (b)     The\nDefendants deliberately stopped supplying utilities and waste-disposal\nservices at the Site between 31 January 2012 and 29 February 2012,\neven though there were sub-tenants and licensees still occupying\nunits at the Site. According to the Plaintiffs, many sub-tenants and licensees\nleft because of the Defendants’ acts. The Defendants’ acts foiled\nthe Plaintiffs’ attempts at persuading these sub-tenants and licensees\nto continue under the Plaintiffs, leading to loss of income from\nrent and licence fees. 12     The\nDefendants deny intending to cause damage to the Plaintiffs. The Defendants\nsay that their position and actions were motivated by their desire\nto comply with obligations owed to SLA under their tenancy, and\nthe Urban Redevelopment Authority (“URA”) under certain regulations. 13     On\n20 January 2012, the Plaintiffs obtained an injunction (“the Injunction”)\nrestraining the Defendants from carrying out reinstatement work\nat the Site and from acting in a manner prejudicial to the sub-tenants and\nlicensees who remained at the Site. The Defendants applied to discharge\nthe Injunction on 20 February 2012, and it was discharged on 24 February\n2012. In the present action, the Defendants counterclaim for damages\nagainst the Plaintiffs for obtaining the Injunction wrongly.",
        "The law on conspiracy": "14     I\nwill touch on the law on conspiracy in brief before stating the\nissues that arise in this case. As a preliminary point, the Singapore\nCourt of Appeal inEFT Holdings, Inc and another\nv Marineteknik Shipbuilders (S) Pte Ltd and another[2014]\n1 SLR 860 at [90] questioned whether the tort of conspiracy should\neven continue to be part of the law of Singapore. The Court of Appeal\neventually refrained from deciding the point. 15     I\nrecognise the force in the argument that the tort of conspiracy appears\nto be an aberration in the common law. It is difficult to explain\nwhy an act, when committed pursuant to an agreement between a number\nof persons triggers liability, while the very same act, when committed\nby one person alone does not. However, I do not think that it is\nfor the High Court to say that the tort of conspiracy should no\nlonger apply. 16     InLonrho Ltd v Shell Petroleum Co Ltd (No 2)[1982]\nAC 173 at 188, Lord Diplock (whose speech the rest of the House\nof Lords agreed with) expressed dissatisfaction at the rationale\nunderlying the tort of conspiracy. Lord Diplock nonetheless held\nthat the tort was too well-established for it to be discarded. If\nthe tort of conspiracy is abolished, the lacuna could possibly be\nfilled by a widening of the unlawful interference tort coupled with\njoint tortfeasorship. But as these issues do not arise for consideration,\nI shall say no more. 17     I\nturn now to the law on conspiracy proper. The essence of conspiracy is\nan agreement between two or more persons to act in a manner that\nis intended to, and does injure another. There are two branches\nto the tort of conspiracy. The first, where the acts committed pursuant\nto the conspiracy are lawful. The second, where the acts committed\npursuant to the conspiracy are unlawful. I will refer to the former\nas “lawful means conspiracy” and the latter as “unlawful means conspiracy”. 18     The\nelements of the tort of conspiracy were set out inNagase Singapore\nPte Ltd v Ching Kai Huat and others[2008] 1 SLR(R) 80\nat [23]: (a)     an\nagreement between two or more persons to do certain acts; (b)     if\nthe conspiracy involves: (i)unlawfulmeans, the conspirators\nmust haveintendedto cause damage\nto the claimant; (ii)lawfulmeans, then the conspirators\nmust additionally have had thepredominant\npurposeof causing damage to the claimant; (c)     the\nacts must have actually been performed in furtherance of the agreement;\nand (d)     damage\nmust have been suffered by the claimant. 19     The\nelements of the two forms of conspiracy are therefore similar, save\nfor one distinction: the mental element is less stringent where\nunlawful means, as opposed to lawful means, are employed pursuant\nto the conspiracy.",
        "The issues": "20     The\nPlaintiffs’ claim in conspiracy raises four issues: (a)     whether\nthe Defendants committed acts pursuant to an agreement between themselves; (b)     whether\nthe Defendants’ predominant purpose (or intention) was to cause\ndamage to the Plaintiffs; (c)     whether\nthe Defendants employed unlawful means; and (d)     whether\nthe Plaintiffs suffered damage. If it is found that the Defendants’ predominant purpose was\nto cause damage to the Plaintiffs, then the issue of unlawful means\nbecomes academic. 21     The\nDefendants’ counterclaim raises a single issue: whether the Injunction\nwas wrongly obtained such that the Defendants should be entitled\nto damages.",
        "The facts": "",
        "The Extension Tenancy": "22     SAA\nbecame the master tenant of the site in 2001. Its tenancy of the Site\nwas due to expire on 31 August 2011. In a letter dated 12 March\n2011, SAA wrote to SLA requesting an extension of the tenancy to\n29 February 2012.[note: 7] 23     The\nthrust of SAA’s proposal to SLA was that the extension would bebeneficial for the sub-tenants and licensees.\nSAA stated that the sub-tenants and licensees would prefer to move\nout after the Chinese New Year of 2012, which fell on 23 and 24 January\n2012. An extension of the tenancy to 29 February 2012 would give\nthe sub-tenants and licensees three to four weeks to reinstate their\nunits after Chinese New Year, before returning the units to SAA.[note: 8]Further,\nthe expiry date of the then-existing tenancy (31 August 2011) coincided\nwith the seventh month of the lunar calendar. The seventh month\nwas an inauspicious period for the sub-tenants and licensees to\nvacate their units. SAA also stated that the children’s education vendors\nwhich occupied the Site would benefit from being able to conduct classes\ntill the end of the calendar year in 2011. 24     In\na letter dated 3 June 2011, SLA wrote to SAA agreeing to the extension.\nSAA’s final tenancy with SLA, extended up to 29 February 2012, will\nbe referred to as “the Extension Tenancy”. In the letter, SLA stressed that\nthe purpose of the Extension Tenancy was to “facilitate the relocation of\nbusinesses to alternative premises” and to allow more time for SAA\n“to complete all the requisite reinstatement works in a satisfactory\nmanner prior to handing over”.[note: 9]",
        "The tender for the new tenancy\nof the Site": "25     In\nJune and July 2011, SLA launched a tender for the new tenancy of the\nSite. This tenancy was to commence on 1 March 2012, immediately after\nthe Extension Tenancy expired on 29 February 2012. 12 bids were received.\nSH Cogent and SAA were among the bidders. SH Cogent’s bid was the\nhighest, at a monthly rental rate of $1,065,678 per month. SAA’s\nbid was the fourth-highest, at $718,888 per month.[note: 10] 26     SLA\ndisclosed the identity of the bidders and their respective bids\nto the public shortly after the bidding had closed in July 2011.[note: 11]SLA did not, however, award\nthe new tenancy to any of the bidders at that point in time. The\naward of the new tenancy by SLA was only to be done on 10 October 2011.\nThere was therefore a period of approximately four months between the\ndate the bidders and their bid amounts became public information,\nand SLA’s eventual award of the new tenancy. Tan Chee Beng said\nhe knew that SAA did not have a realistic chance of being awarded\nthe tenancy once the identity of the bidders and their respective\nbids were disclosed, because SAA was only the fourth-highest bidder.[note: 12] 27     In\nAugust 2011, SAA entered into extension agreements with the sub-tenants\nand licensees at the Site. This was because the then-existing agreements\nwere made on the basis that SAA’s own tenancy would expire on 31 August\n2011. The sub-tenancies and licences were extended up to 31 January\n2012, with an option for a further extension to 29 February 2012,\nconditional on SAA being awarded the new tenancy which commenced\n1 March 2012. 28     On\n10 October 2011, SLA awarded the new tenancy of the Site to SH Cogent.[note: 13]",
        "The Defendants’ reinstatement\nwork and letters to sub-tenants and licensees": "29     On\n1 November 2011, SAA sent a letter to its sub-tenants and licensees.\nSAA stated that their sub-tenancies and licences would expire on 31 January\n2012, and that the reinstatement work for their respective units was\nto be completed by that date.[note: 14] 30     On\n3 November 2011, Benson Tan and Yap Chee Sing conducted an inspection\nof the Site. At the material time, Benson Tan was the deputy chief\nexecutive officer of SH Cogent and a director of Cogent Land. Yap Chee\nSing was the general manager of SH Cogent and a director of Cogent Land.\nBoth were involved in the preparation for the taking-over of the\nSite on behalf the Plaintiffs. They were also the Plaintiffs’ principal\nwitnesses at the trial. At this inspection, Benson Tan and Yap Chee\nSing were accompanied by two SLA officers. Benson Tan and Yap Chee\nSing claimed that they noticed parts of the main grandstand being\nremoved by workers.[note: 15] 31     Benson\nTan and Yap Chee Sing met with Ong Ah Sui, TCM’s chief security\nofficer, after the inspection was completed. Benson Tan and Yap Chee\nSing alleged that Ong Ah Sui told them that Roger Koh wanted to meet\nwith them. Ong Ah Sui also purportedly informed them that Roger Koh\nhad threatened to dismantle all the fixtures and fittings at the\nSite unless the Plaintiffs paid the Defendants $3m.[note: 16] 32     On\n8 November 2011, Yap Chee Sing emailed SLA. He raised concerns about\nSAA’s reinstatement work.[note: 17]He also stated that the sub-tenants\nand licensees who wanted to continue under the Plaintiffs were concerned\nabout having to vacate their premises on 31 January 2012 and to return\nonly on 1 March 2012. This would result in the sub-tenants having to\nstop their businesses for effectively two to three months. Yap Chee\nSing stated that unless the continuity of these sub-tenants’ and\nlicensees’ businesses was preserved, most of them would look for\nalternative locations and not continue under the Plaintiffs. 33     On\n29 November 2011, SLA sent a letter to SAA. The letter stressed that\nthe very basis for the extension of SAA’s tenancy to 29 February\n2012 was to “minimise the disruption to existing businesses”. SLA\nstated that sub-tenants and licensees had given feedback that they\nwere being required to vacate the Site on or before 31 January 2012,\neven though they were negotiating with the next master tenant to\nremain on-site. SLA indicated that SAA was to take necessary steps\nto facilitate the continued stay of interested sub-tenants and occupants\nbeyond 31 January 2012.[note: 18] 34     Benson\nTan conducted another inspection of the Site on 30 November 2011.\nHe stated that he witnessed workers using a blowtorch to dismantle\nthe metal deck flooring on the fifth level of the grandstand (“the\nMetal Deck Flooring”).[note: 19]The Metal Deck Flooring\nwas a structure which increased the useable floor area on the fifth\nlevel of the grandstand. Yap Chee Sing wrote an email to SLA on\nthe same day complaining of this incident.[note: 20] 35     On\n1 December 2011, Benson Tan and Yap Chee Sing met up with Tan Chee\nBeng and Roger Koh. The meeting concerned the Defendants’ reinstatement\nwork and their requirement that the sub-tenants and licensees to\nvacate their units by 31 January 2012. Benson Tan and Yap Chee Sing\nmade a concealed audio recording of this meeting. There was disagreement\nas to the effect or implication of what was said at this meeting. The\nPlaintiffs claim that the Defendants were extorting or seeking a\ncorrupt payment from the Plaintiffs so that the Defendants would\nstop their disruptive conduct. The Defendants claim that they were\nmerely seeking a “commercial resolution” to the problem. 36     On\nthe same day, SAA sent out another letter to the sub-tenants and licensees.\nThis was the second letter that SAA had addressed to the sub-tenants\nand licensees (the first is mentioned at [29] above). SAA reminded them\nof the obligation to hand over their units to SAA by 31 January 2012.[note: 21] 37     On\nthe other hand, SLA reiterated its position to SAA that business continuity\nwas of paramount importance. In letters dated 2, 6 and 16 December\n2011, and 4 January 2012, SLA requested that SAA assist sub-tenants\nand licensees who had arrangements with the incoming master tenant,\nso as to minimise business disruption, and also stated that reinstatement\nwork need not be carried out at certain areas at the Site. I refer\nto the five letters from SLA to SAA—dated 29 November 2011 (at [33] above),\n2, 6 and 16 December 2011, and 4 January 2012—collectively as “the\nFive SLA Letters”. 38     SAA,\nhowever, wrote a third, more aggressively-worded letter to the sub-tenants\nand licensees on 4 January 2012.[note: 22]The letter reminded the sub-tenants\nand licensees that their agreements with SAA would expire on 31 January\n2012. It also stated the consequences that would follow if their units\nwere not vacated by then. 39     On\n9 January 2012, SAA wrote to SLA. In that letter, it mentioned for the\nfirst time that it was carrying out reinstatement work at the Site pursuant\nto regulatory requirements imposed by URA.[note: 23]",
        "The undertaking from SLA to\nSAA and continued reinstatement work": "40     On\n11 January 2012, SLA held a press conference concerning the problems\nat the Site. SLA also wrote to SAA on the same day, reiterating that\nSAA was not required to carry out reinstatement work on units where sub-tenants\nor licensees would continue operating beyond 29 February 2012. SLA\nfurther undertook not to hold SAA “liable for loss or damage which\nmay be caused by the retention of the Works on [the Site]”.[note: 24]SLA granted\nthe undertaking to SAA only because SH Cogent had agreed to grant\na cross-undertaking to SLA. In the cross-undertaking, SH Cogent undertook\na number of obligations, one of which was to indemnify SLA against\nany liability or loss arising from a breach of SH Cogent’s undertakings\nto SLA.[note: 25] 41     Notwithstanding\nSLA’s undertaking, SAA wrote to URA on 16 January 2012 stating that\nit was removing temporary structures in compliance with URA’s directions\nand in reliance on SAA’s consultants’ advice.[note: 26] 42     In\nan email to SLA dated 17 January 2012, Yap Chee Sing stated that SAA\nwas still engaging in reinstatement work.[note: 27]He\nappended pictures which he had taken of such work being carried\nout at the Site. 43     SLA\nwrote to SAA on 20 January 2012.[note: 28]The\nletter appended a list of reinstatement work that SLA required SAA\nto perform. This list revised a previous list that SLA had sent\nto SAA on 20 June 2011 by reducing the scope of reinstatement work\nwhich SLA required SAA to perform.",
        "The Injunction": "44     The\nPlaintiffs sought and obtained the Injunction on 20 January 2012. The\nInjunction restrained the Defendants from: carrying out reinstatement work;\ndemanding that present sub-tenants or licensees carry out reinstatement\nwork; and evicting any of the sub-tenants or licensees, or impeding\nthe sub-tenants’ or licensees’ access to, use and enjoyment of the Site.\nThe Injunction also specifically prohibited the Defendants from ceasing\nthe supply of utilities at the Site, such as power, water and communication\nlines, up till and including 29 February 2012. 45     Despite\nthe Injunction, SLA officers observed that items had been removed\nfrom the main grandstand building and car park at site inspections\nconducted on 25 January 2012 and 31 January 2012. The removed items\nincluded partitions, glass enclosures, air-conditioning diffusers,\nlighting and floor, wall and ceiling finishes. Electrical wires\nhad also been cut. 46     SLA\nwrote to SAA on 1 February 2012 placing on record these observations.\nThe letter stated that SAA’s reinstatement work amounted to a failure\nto comply with SLA’s instructions.[note: 29] 47     SLA\nalso wrote another letter to SAA on 1 February 2012 stating that the\nlighting in the common areas had been switched off, and that there\nwas improper disposal of waste at the Site. SLA stressed that this\ncreated health and safety concerns.[note: 30]SLA wrote again on 2 February\n2012 stating that their officers had inspected the site on the afternoon\nof 1 February 2012, and observed that the lighting remained switched\noff and that the waste was still not properly disposed of.[note: 31] 48     On\n10 February 2012, URA replied to SAA’s letter of 16 January 2012 (see\n[41] above). URA stated that it “will not require … existing additions and\nalterations erected to be demolished at this juncture”.[note: 32] 49     The\nDefendants subsequently applied to discharge the Injunction. They\nsucceeded in doing so. The Injunction was discharged on 24 February 2012.\nSLA wrote to SAA on that day acknowledging the discharge of the Injunction.\nSLA nonetheless urged SAA to take a reasonable approach, and to\nfacilitate a smooth transition for businesses continuing to operate\nat the Site.[note: 33]The letter also reiterated\nSAA’s obligations under the Extension Tenancy. 50     The\nDefendants returned possession of the Site to SLA on 29 February\n2012. The Plaintiffs took over possession of the Site the following\nday, on 1 March 2012.",
        "Whether the Defendants committed\nacts pursuant to an agreement between themselves": "51     Conspiracies\nare usually conceived of in private. The agreement between the conspirators\nis usually tacit. Courts have thus inferred the existence of an\nagreement from the conspirators’ acts (OCM\nOpportunities Fund II, LP v Burhan Uray[2004] SGHC 115\nat [47]). It has also been held that a company can, together with\nits controlling director, be liable for the tort of conspiracy (Visionhealthone Corp Pte Ltd v HD Holdings Pte Ltd\nand others and another appeal[2013] SGCA 47 at [39]). 52     On\nthe facts before me, this was not just a case of SAA acting only through\nits controlling director, Tan Chee Beng. The Defendants did not dispute\nthat TCM and Roger Koh were parties to what SAA and Tan Chee Beng\nwere trying to do. 53     The\nfirst issue is whether Tan Chee Beng, Roger Koh, SAA and TCM had\nagreed to, and actually did, carry out reinstatement work at the\nSite and cause the sub-tenants and licensees to vacate their units\nby 31 January 2012. 54     Tan\nChee Beng was a majority shareholder and director in both SAA and\nTCM. Roger Koh was a shareholder and director in TCM. SAA was the master\ntenant; it had signed the sub-tenancies and licences with the occupants\nof the various units at the Site. TCM was in charge of managing the\nSite. In the light of the relationship between the parties and the undisputed\nfacts, it is clear that the Defendants had agreed to implement reinstatement\nwork at the Site and to cause the sub-tenants and licensees to leave\nby 31 January 2012. It is also clear that the Defendants had carried\nout acts pursuant to this agreement. Indeed, the Defendants did\nnot seriously dispute these allegations. 55     The\ncrux of the dispute was whether the Defendants’ predominant purpose\n(or intention) was to injure the Plaintiffs. The Defendants also disputed\nthe extent of the acts which the Plaintiffs allege were carried\nout pursuant to the conspiracy, if any. I will address the second\npoint later on. I turn first to the crucial question of the mental\nelement behind the Defendants’ agreement and the acts committed\npursuant to that agreement.",
        "Whether the Defendants’ predominant\npurpose (or intention) was to injure the Plaintiffs": "56     In\nmost cases of conspiracy, it is difficult to prove that the conspirators\nintended to cause damage to a claimant because the acts committed\npursuant to the conspiracy usually also benefit the conspirators. One\nshades into the other. It is often not clear where to draw the line between\nwhen the conspirators intended to benefit themselves and when they\nintended to cause damage to the claimant. 57     That\ndifficulty does not arise here. Rather, it is quite the opposite.\nIt would not have been in the Defendants’ commercial interest to\nrequire sub-tenants and licensees who wanted to continue under the\nPlaintiffs to vacate their units by 31 January 2012. The Defendants\nwould have earned an additional month’s rent for February 2012 if\nthey were prepared to allow those sub-tenants and licensees to continue\ntill 29 February 2012. 58     It\nwould also not have been in the Defendants’ commercial interest\nto engage in reinstatement work which SLA had informed them was unnecessary.\nThe Defendants would have incurred expense in doing so. The Defendants\nwould also have put themselves at risk of legal liability to SLA\nfor breach of contract. 59     Clause 9.1.1\nof the Extension Tenancy stated that “all renovations, repairs and\nauthorised alterations, additions and structural changes shall remain\nthe property of the Landlord”.[note: 34]Further, cll 7.3 and 9.5.2\nof the Extension Tenancy stipulated that SAA was to carry out reinstatement work\nonly “if so required by [SLA]”.[note: 35]Clause 9 of Appendix A-1\nto the Extension Tenancy stated that SAA was not allowed to demolish\nexisting structures at the Site without the written consent of SLA. 60     The\nscope of reinstatement work that SAA was required, or indeed,permittedto undertake under the Extension\nTenancy was subject to the instructions of SLA. This was not a situation\nwhere the Defendants were entitled to deal freely with the additions\nand alterations on the Site because they had renovated the grandstand\nand the car park and converted them to retail use. The Defendants\nwere contractually constrained to comply with SLA’s instructions\non what, if any, and how much was to be removed. 61     SLA’s\ninstructions to SAA in letters dated 20 June 2011,[note: 36]2 December\n2011,[note: 37]4 January 2012[note: 38]and\n20 January 2012[note: 39]had significantly reduced the\nscope of reinstatement work that SLA required of SAA. The Defendants\ndid not contest the Plaintiffs’ allegation that the five of the\n18 Items (which the Defendants agreed that they had removed) were removed\nin contravention of SLA’s instructions. In fact, Tan Chee Beng admitted\nin cross-examination that by removing electrical cables, pipes, fittings,\nthe fire safety system and the fire protection system, SAA did not comply\nwith SLA’s instructions, and accordingly, with SAA’s obligations under\nthe Extension Tenancy.[note: 40] 62     Yet\nthe Defendants were unrelenting in both requiring sub-tenants and\nlicensees to vacate by 31 January 2012, and the reinstatement work. 63     The\nDefendants’ explanation for requiring sub-tenants and licensees to\nvacate by 31 January 2012 was that they wanted a one-month buffer between\nthe handover of the units from the sub-tenants and licensees to SAA,\nand the handover of the Site from SAA to SLA on 29 February 2012. 64     The\nDefendants’ explanation for engaging in reinstatement work was that\nthey believed that they were obliged to do so because of the lapse\nof a written permission dated 19 August 2010 (“the 2010 WP”) issued\nby URA. They maintain that the obligations under the 2010 WP existed independently\nfrom the any contractual obligations which SAA may have owed to\nSLA under the Extension Tenancy. 65     I\ndo not accept these explanations. In my view, the Defendants’ acts were\nmotivated by a predominant purpose to cause damage to the Plaintiffs.\nI make this finding for three reasons. 66     First,\nthe transcripts of the meeting of 1 December 2011 (see [35] above)\nshowed that the Defendants threatened to injure the Plaintiffsunlessthe Plaintiffs were willing to\nprovide the Defendants with adequate compensation. Second, the Defendants’\npersistent pressure on sub-tenants and licensees to vacate by 31 January\n2012 was done against SLA’s express requests to facilitate a smooth\ntransition for those persons. Third, the Defendants did not genuinely\nbelieve that they were legally obliged to carry out reinstatement\nwork under the 2010 WP. 67     Proof\nof conspiracy and the requisite mental element will normally be inferred\nfrom objective facts (Asian Corporate Services\n(SEA) Pte Ltd v Eastwest Management Ltd (Singapore Branch)[2006]\n1 SLR(R) 901 at [19]). The three reasons mentioned above are derived\nfrom objective facts which, in my view, lead to the inexorable conclusion\nthat the Defendants’ predominant purpose was to cause damage to\nthe Plaintiffs.",
        "The meeting of 1 December 2011": "68     The\nmeeting of 1 December 2011 was between Benson Tan and Yap Chee Sing\nof the Plaintiffs, and Tan Chee Beng and Roger Koh of the Defendants.\nIt was secretly recorded by Benson Tan and Yap Chee Sing, and subsequently\ntranslated into English (the conversation was a mixture of Mandarin\nand Hokkien interspersed with English) and transcribed by the Plaintiffs.\nParties agreed to the accuracy of the transcript, save for some minor\namendments made by Tan Chee Beng.[note: 41]The amendments are immaterial, and\nany reference to or excerpts from the transcript are from the amended\nversion. 69     In\nmy view, what transpired at the meeting cast the Defendants’ intentions\ninto sharp relief. The message Tan Chee Beng and Roger Koh conveyed\nto Benson Tan and Yap Chee Sing at that meeting was a straightforward\none: pay the Defendants a sum of money or the Defendants will continue\nwith their systematic reinstatement of the Site and eviction of the\nsub-tenants and licensees. While none of the statements were phrased in\nexplicit terms, it is clear from the entire conversation on 1 December 2011\nthat the Defendants were making thinly-veiled threats. 70     Below\nare extracts quotedverbatimfrom\nthe transcript of the meeting which illustrate the point. In the\nportions of the conversation quoted, Benson Tan was expressing his\nconcern about the reinstatement work and the letter dated 1 November\n2011 which SAA had sent to the sub-tenants and licensees. This was\nthe first letter SAA sent to remind these occupants of their obligation\nto vacate their units by 31 January 2012. In the meeting, Tan Chee\nBeng was warning the Plaintiffs that unless the Defendants were compensated,\nthe Defendants would follow up with a second and a third letter\nto the sub-tenants and licensees along similar lines as the first\nletter. Tan Chee Beng alluded to a three-month fitting-out period\nwhich SLA gave to the incoming master tenant. Tan Chee Beng’s point\nwas that if the Plaintiffs hit the ground running, they would be\nable to earn rent for that three-month fitting-out period. The quantum\nof compensation which the Defendants wanted was based on this three-month\nfitting-out period. Tan Chee Beng:If you want to (indecipherable) our contract with SLA, then\nwe have to see how we satisfy our contractual agreement with SLA,\nhor? …If you want to(indecipherable)our contract, then we have to discuss it in private.\nDiscuss privately.Otherwise we don’t have the need to\ntalk at all. Because I also know what your intentions are. You wish\nto continue collecting rental as usual from the existing tenants\nduring the 3 months … during the fitting out period. We built up\nthis business 10 years ago. We used the tangible and intangible assets\n…So if you want to have the tangible and intangible,\nto get rental during the 3 month fitting out period, I think from\na commercial point of view, a reasonable resolution should be given… You\nget what I’m trying to say? If your purpose in coming today is to\ntell me about SLA, then let’s not waste time … We are very clear\nabout what SLA can and cannot ask us to do. ……Benson Tan:So the key thing is, uh, we know we, I think, we are not stupid\nlah.We know what you mean lah. But the thing\nis ah, we are actually a listed company.Tan Chee Beng:I know.Benson Tan:So as a listed company ah, you also are a director of a listed\ncompany.…Tan Chee Beng:So it is how you do it lah. You can get a independent valuer\nto value certain things lah. Like I told you, I just give you the\nhint lah. Tangible intangible. You just get a independent financial, you\nknow, advisor advise you, they’ll probably give you something lah.…I’m a listed company also lah. There\nare a lot of ways to skin a cat.End of the day … whether\nyou have 3 months or 6 months of renovation, and we lose two, we\nlose two, two um, two ways. We got to renovate and we got a loss\nof income, or you continue right from day one, first of March. Get income.…The answer is very clear. You know it’s, it’s very obvious.\nIt is it’s your, it’s your choice. Ok? As for how you do, how you\nskin the cat, I think you are listed ah so I don’t ……Benson Tan:We heard lah, Roger refers to you lah,we\nheard that Roger has told some people. See what kind of arrangement\nCogent can make with you. Otherwise, you will demolish everything.\nTear everything down.So when everyone heard about it,\nthis is what they told us. Otherwise you all will tear everything\ndown. SLA, we know we can come in and expect everything in order.\nYou know you can’t take over something torn down and empty.Roger Koh:Oh, you are wrong. When we take over, we didn’t have anything.\nWe don’t have anything. We used to build Turf City.…Benson Tan:But as I said, we have to answer to the shareholders. Because\nthey will say that in the contract, we have our rights, SAA is not\nallowed to tear things down. But let me tell you, the very first\nthing is,your letter made … a lot of people who\nreceived the letter, say that SAA will not be extending with them\nunder any circumstances.Tan Chee Beng:Actually, there is a second and a third\none coming.I told you already.The\nsystem is in place. So, unless we find some quick solution lah.\nIf not the system is going to drag until January.…Tan Chee Beng:But, but I think today is the only first time we really engage\non this topic lah, hor.That can be stopped quite\neasily.Because I already told you. In fact, during our\ndinner.There are certain things in place,\nright until the very last day we hand over to SLA. So unless you\nare engaging in a talk with us, the system will keep on going lah.\nIncluding with the second letter and the third letter.…Tan Chee Beng:It is very simple.You have 3 months\nfree fitting period, you go check.Benson Tan:But if three months are free, and we\ngive you the three months, then … what is the point?Tan Chee Beng:I told you already. It’s what you are comfortable with.…   [emphasis in bold italics] 71     It\nis clear to me that Tan Chee Beng wanted compensation to stop doing\nwhat was not in thebona fideinterest\nof the Defendants to do in the first place. If no such compensation\nwas forthcoming, the Defendants would continue “the system” of reinstatement\nwork and eviction of the sub-tenants and licensees. 72     The\nDefendants were aware that continuing with “the system” would derail\nthe Plaintiffs’ plans to replace the Defendants as master tenants\nwith minimal interruption to the business of sub-tenanting and licensing\nthe units. The Plaintiffs would be forced to expend time and money\nreplacing what had been removed and sourcing for new occupants.\nThe Defendants wanted to be compensated for not making things difficult\nfor the Plaintiffs. The Defendants were, in substance, engaging\nin commercial blackmail or extortion, or were attempting to do so. 73     The\nDefendants’ counsel, Mr Andre Yeap SC, raised two points in an attempt\nto explain the conversation at the meeting. Mr Yeap stated that\nthe meeting was “more akin to an amicable business discussion”,\nand that if the price was right, the Plaintiffs would have agreed.[note: 42]Mr Yeap also accused the\nPlaintiffs of “baiting” Tan Chee Beng at the meeting.[note: 43]Mr Yeap emphasised,\nin particular, the “surreptitious” manner in which the meeting was\nrecorded. 74     I\ndo not accept these two points. First, they are inconsistent positions that\ncannot be credibly advanced together. To suggest that Tan Chee Beng was\nbaited necessarily assumes that his statements were improper. The assumption\nof impropriety contradicts the point that the meeting was really abona fidebusiness discussion. The Defendants’\nsuggestion of baiting actuallysupportsthe\nPlaintiffs’ case that they had been the subject of threats to pay.\nThere would have been no need for the Plaintiffs to bait the Defendants\nunless the former genuinely believed that the latter wanted such compensation. 75     Second,\neven if the Plaintiffs would have been willing to pay the Defendants\nif the price was right, that would not make the transaction abona fidecommercial resolution of matters.\nIt would merely have meant that the Plaintiffs had yielded to the\nblackmail or extortion. Whether or not the Plaintiffs yielded to\nthe blackmail or extortion would not affect the true nature of the\ntransaction. 76     The\nevidence on the reason why the 1 December 2011 meeting was arranged\nfortifies my conclusion drawn from the conversation at the meeting.\nBenson Tan’s evidence was that prior to the 1 December 2011 meeting,\nhe and Yap Chee Sing met with Ong Ah Sui at the Site (see [30] and\n[31] above). Ong Ah Sui told them that Roger Koh wanted to meet\nwith them. Ong Ah Sui said Roger Koh wanted the Plaintiffs to pay\nthe Defendants $3m, if not the Defendants would “dismantle all fixtures\nand fittings found [at the Site]”.[note: 44]Benson Tan’s evidence\nwas that this formed the basis of the meeting on 1 December 2011.[note: 45]A similar account was given by Yap\nChee Sing.[note: 46] 77     The\nDefendants dispute that such instructions had emanated from Roger Koh.\nThe Defendants assert that even if Ong Ah Sui had threatened the\nPlaintiffs to pay $3m, he had done so without authority from either\nTan Chee Beng or Roger Koh. 78     Neither\nRoger Koh nor Ong Ah Sui was called to give evidence. The fact that\nOng Ah Sui made the statement to Benson Tan and Yap Chee Sing therefore\ncannot be relied on to prove thetruth of thecontentof Ong Ah Sui’s statement (ie, that Roger Koh had issued the threat).\nThat would violate the rule against hearsay evidence. 79     I\nnonetheless accept Benson Tan’s and Yap Chee Sing’s evidence that Ong\nAh Sui had made such a statement to them on 3 November 2011, and that\nthat statement was the reason the meeting was arranged. Benson Tan was\na steady and credible witness. It was not put to Benson Tan in cross-examination\nthat Ong Ah Sui did not say what Benson Tan was alleging. Also,\nsuch an explanation for the 1 December 2011 meeting is consistent with\nBenson Tan’s and Yap Chee Sing’s eventual decision to record it.\nThey would not have done so unless they sensed something was amiss. 80     The\nreason the meeting was arranged, coupled with what was said at the\nmeeting further confirms the role that Roger Koh played in the Defendants’\nscheme. At the meeting Benson Tan said that “Roger [Koh] has told\nsome people … [s]ee what kind of arrangement Cogent can make with you.\nOtherwise, you will demolish everything” (see [70] above). Benson\nTan went on to say, “[y]ou know you can’t take over something torn\ndown and empty”. Although Roger Koh did say in response, “you are\nwrong”, I am of the view from the rest of his response that this\nwas not a denial of his threat. Rather, it was to make the point\nthat the Defendants did not have the benefit of taking over something\nfrom an existing master tenant (unlike what the Plaintiffs wanted),\nand that the Defendants had to convert the Site from scratch so\nthat it could be used for retail purposes. 81     It\nwas open to the Defendants to call Roger Koh and Ong Ah Sui to give\nevidence to dispute the allegation of the Plaintiffs or support\nthose of the Defendants. This was not done. 82     The\nDefendants argue that an adverse inference should not be drawn against\nthem for their failure to call Roger Koh and Ong Ah Sui. In respect of\nRoger Koh, the Defendants say that they offered him to the Plaintiffs\nfor cross-examination. The Plaintiffs chose not to do so.[note: 47]In respect of Ong Ah Sui, they\nargue that they had subpoenaed him, but he refused to attend court\nin breach of the subpoena.[note: 48]They therefore\nsay that there was a good reason for Ong Ah Sui’s absence. 83     I\ndo not accept these arguments. Benson Tan and Yap Chee Sing had given\ndamning evidence of what Ong Ah Sui had said about Roger Koh’s purported\ninstructions, and also what Tan Chee Beng and Roger Koh had said\nat the meeting. Since Ong Ah Sui was not attending court as a witness in\nviolation of the subpoena, thenall the morethe\nDefendants should have called Roger Koh to give evidence to rebut\nthe Plaintiffs’ allegations. I do not think it is a sufficient answer\nfor the Defendants to say that they offered Roger Koh to the Plaintiffs\nfor cross-examination. 84     There\nwas no suggestion that Roger Koh was unable or unwilling to give\nevidence for the Defendants. He was present in court in the course\nof the trial, if not throughout the entire trial. Roger Koh chose\nnot to give evidence to dispute what the Plaintiffs said at the\nmeeting,ie, that they had heard\nthat Roger Koh wanted to see what arrangement the Plaintiffs could make,\notherwise everything would be demolished. Neither did he give evidence\nto disclaim his involvement in “the system” that the Defendants had\nin place, which Tan Chee Beng had made so many references to. I\ndraw an adverse inference against all the Defendants for not calling\nRoger Koh as a witness. 85     I\ntherefore conclude that the Defendants were making implicit threats for\nthe Plaintiffs to pay them compensation at the 1 December 2011 meeting.\nThe threats emanated from and were communicated through both Tan\nChee Beng and Roger Koh.",
        "The obligations to SLA under\nthe Extension Tenancy": "86     The\nDefendants argue that the reason they were insistent on the sub-tenants\nand licensees vacating their respective units by 31 January 2012\nwas to create a one-month buffer before handing the Site back to\nSLA. The Defendants rely on provisions in the Extension Tenancy\nwhich stipulated that SAA was responsible to SLA for the sub-tenants’\nand licensees’ compliance with the relevant obligations under the\nExtension Tenancy. 87     As\na precursor, the argument about a buffer does not sit well with SAA’s\noriginal reason for seeking the extension of their tenancy up till 29 February\n2012 from SLA. SAA’s proposal was made on the basis that it would\nbe beneficial for the sub-tenants and licensees to be able to enjoy\nthe Chinese New Year Holiday (see [23] above). By requiring the\nsub-tenants and licensees to vacate their units by 31 January 2012,\nthe Defendants were effectively preventing them from enjoying Chinese\nNew Year (which fell on 23 and 24 January 2012) at the Site, as\nthe sub-tenants and licensees would take between two to four weeks\nto reinstate their units prior to vacating them.[note: 49]This\nwas confirmed by Tan Chee Beng in cross-examination.[note: 50] 88     Even\nif the Defendants had only subsequently realised that they ought to\nhave a one-month buffer in case any sub-tenant or licensee was dilatory in\nreturning its unit, SLA had made it clear that SAA was to assist\nwith the continuity of businesses that intended to remain at the\nSite under the Plaintiffs. 89     The\nemphasis of the Five SLA Letters sent in November 2011, December\n2011, and early-January 2012 (see [33] and [37] above), was that the\ncontinuity of existing businesses was paramount,especiallyfor\nthose sub-tenants and licensees which were continuing under the\nsubsequent master tenant after 29 February 2012. Further, on 11 January\n2012, SLA agreed not to hold SAA liable for loss or damage caused\nby the retention of works at the Site. 90     By\nlate-2011 through to early-2012, events had overtaken any legitimate\nconcern that the Defendants might otherwise have had about the late\nreturn of units. By that point in time, the Defendants were not\njustified in relying on SAA’s original contractual obligations to\nSLA in order to compel sub-tenants and licensees to vacate their\nunits by 31 January 2012 so as to create a one-month buffer. 91     All\nthe Defendants had to do was to inform sub-tenants and licensees that\nif they could produce documentary evidence of a new sub-tenancy\nor licence with the subsequent master tenant commencing 1 March\n2012, they would be allowed to stay on until 29 February 2012. The\nrent or licence fee for the month of February 2012 could have been\neasily resolved. Indeed, the Defendants did not suggest that the\nrent or licence fees for that last month in February 2012 would\nhave been an issue if they were minded to allow these sub-tenants\nand licensees to stay on until 29 February 2012. 92     The\nDefendants, however, did not inform the sub-tenants and licensees\nthat they might be allowed to stay on until 29 February 2012. Instead,\nbetween late-2011 and 29 February 2012, the Defendants’ posture towards\nthe sub-tenants and licensees became increasingly severe. 93     On\n1 November 2011, SAA wrote to the sub-tenants and licensees. SAA\nreminded them that their leases would expire on 31 January 2012. SAA\nstressed that the reinstatement work for their respective units\nwas to be completed by that date in order to “smoothen the … process\nof [their] rental deposit refund.”[note: 51]SAA also stated that the sub-tenants\nwould be responsible for any loss or damage that arose from failure\nto reinstate and hand over their units by 31 January 2012. 94     On\n1 December 2011, SAA sent out a second letter to the sub-tenants repeating\nthe contents of their letter dated 1 November 2011.[note: 52]SAA\nadded that if the sub-tenants and licensees failed to comply, SAA\nwould recover possession of the units and claim damages for trespass\nand breach of contract. 95     SAA\nwrote a third letter to the sub-tenants on 4 January 2012 repeating\nthe contents of the earlier two letters. SAA asserted that it will\ncut off all electricity and water supplies, terminate fire safety,\nand cease management and maintenance services on 31 January 2012.\nSAA also stated that in the event of non-compliance, it would “exercise\n[SAA’s] rights as the Licensor immediately without further notice\nand all costs and expenses including removal fees, contractor costs\nand legal fees, incurred will be borne by [the sub-tenants and licensees]”.[note: 53] 96     The\nPlaintiffs obtained the Injunction on 20 January 2012. The Defendants’\nresponse to the Injunction was striking. SAA sent a letter to the sub-tenants\nand licensees on 25 January 2012, informing them that an injunction\nhad been obtained by the Plaintiffs. SAA stated that it had instructed\nlawyers to apply to set aside the Injunction. SAA concluded by stating\nthat if the Injunction “is discharged,we will\nno longer be prohibited from evicting any sub-tenant or licensee\nthat remains on our propertyafter the expiration of\ntheir [licence] or sub-tenancy on 31 January 2012” [emphasis added].[note: 54] 97     All\nthis was done in the face of SLA’s repeated letters informing SAA about\nthe importance of ensuring continuity for the businesses of sub-tenants\nand licensees beyond 31 January 2012. 98     On\na separate but related point, there was also some dispute as to whether\nthe Defendants maintained utilities and waste-disposal services\nat the Site between 31 January 2012 and 29 February 2012. 99     The\nPlaintiffs allege that the Defendants ceased providing these services\nto the sub-tenants and licensees at the site after 31 January 2012, even\nthough the Defendants knew that many of them were still in occupation\nof their units. The Plaintiffs say that this was part of the Defendants’\nplan to force the sub-tenants and licensees out of their units, and\nto prevent them from continuing under the Plaintiffs. 100    The\nDefendants disagree. They deny that they failed to provide adequate\nlighting in the common areas. The Defendants also assert that they\ncontinued to provide waste-disposal services. They claim that they maintained\na “skeletal but functional force to carry out some basic cleaning and\nmaintenance”.[note: 55] 101    Lincoln\nGabriel and Tan Lay Hoon gave evidence on behalf of the Plaintiffs.\nBoth were sub-tenants at the Site when the Defendants were still master\ntenants. They gave evidence that the Defendants failed to maintain basic\namenities such as lighting and waste-disposal services after 31 January 2012.\nLincoln Gabriel’s affidavit of evidence-in-chief (“AEIC”) further exhibited\nphotographs taken in January and February 2012 of dimly-lit or dark\ncorridors and walkways.[note: 56] 102    Ang\nKiong Teng, who was the chief operating officer of TCM at the material\ntime, gave evidence for the Defendants. He filed an affidavit in response\nto Lincoln Gabriel’s and Tan Lay Hoon’s AEICs. He stated that the\n“decrease in illumination was due to the fact that by 2 February\n2012, most, if not all, of the [sub-tenants and licensees] at [the\nSite] had vacated their units”.[note: 57]In support\nof this contention, Ang Kiong Teng exhibited invoices for utilities\ncharges for the month of February 2012 which the Defendants incurred\nin respect of the Site. 103    I\nprefer the evidence of the Plaintiffs’ witness on this point. Their evidence\nwas unchallenged in cross-examination. Their evidence is further corroborated\nby contemporaneous letters from SLA to SAA in February 2012 (see\n[47] above). In those letters, SLA complained to SAA of the inadequate\nlighting and improper waste disposal at the Site, highlighting the\n“safety and security concerns” and the “[disruption] for businesses”. 104    I\ndo not find the reason for the Defendants’ reason for the “decrease in\nillumination” persuasive. First, any loss of illumination from lights\nbeing turned off in the vacated units should have had little impact\non the amount of lighting in the common areas, which was what was\nbeing complained of. Second, I doubt that a decrease in illumination\nmerely from the vacant units would have been sufficient to motivate\nSLA to write two letters in rapid succession to SAA, warning them\nof the safety and security concerns arising from the lack of proper\nlighting. Also, the mere fact that the Defendants exhibited invoices\nfor utilities for the month of February 2012 does not assist them.\nWhile it proves that the Defendants did incursomeutilities\nexpenses, it does not show that the Defendants did not cut back\non lighting and waste-disposal services during that period. 105    In\nmy view, it was no coincidence that the Defendants’ pressure on the\nsub-tenants and licensees began in November 2011, after the tender\nwas awarded to Cogent Land on 10 October 2011. Neither was it coincidence that\nthis pressure intensified after the non-conclusive meeting on 1 December\n2011. The Defendants further carried through with their hostile\nbehaviour beyond 31 January 2012, by switching off lighting and ceasing\nother basic services despite being aware that some units at the\nSite were still being occupied. 106    I\ntherefore conclude that the Defendants’ attempts to force the sub-tenants\nand licensees to vacate their units by 31 January 2012 were not\nin the hope of creating a one-month buffer prior to the handover\nof the Site to SLA. There was no need for a buffer for those who\nwere continuing with the subsequent master tenant.",
        "The obligations to URA under\nthe 2010 WP": "107    The\nDefendants argued that they carried out the reinstatement work with\nthe “genuine belief” that they were “duty bound” to do so.[note: 58]They believed\nthat they were legally obliged to do so under the 2010 WP issued\nby URA, notwithstanding SLA’s instructions to the contrary. 108    URA\nis the authority that oversees the uses that land is put to. If\na land occupier wants to apply a plot of land to a particular use,\nhe would first need to seek URA’s approval. URA gives such approval\nin the form of written permissions (“WPs”). The necessity for a\nvalid WP for the use that a particular plot of land is put to is\na regulatory requirement. This requirement exists independently\nfrom any contractual permission which SAA might have had to obtain\nfrom SLA under the Extension Tenancy, or any of the earlier tenancies. 109    SAA,\nduring their term as master tenants, had applied for and obtained\na number of WPs and subsequent extensions for the use of the Site.\nEach of these WPs (or their extensions) was only valid for a period\nof between one and three years. SAA would therefore have had to\nmake applications for new WPs (or extensions of existing ones) as\nand when the validity of an existing WP was about to lapse. 110    The\nWP in question is the 2010 WP. It was the last WP that SAA obtained\nfrom URA in respect of the Site prior to its handover on 29 February\n2012. The 2010 WP was granted on 19 August 2010 and was valid until\n31 August 2011. Planning Condition (c) of the 2010 WP stated that\n“[u]nless renewal of planning permission is granted, the approved\nuse shall cease and thestructures erected\nshall be demolishedupon the expiry\nof this permission” [emphasis added].[note: 59]Similar\nconditions were present in all the previous WPs that SAA had obtained. 111    Planning\nCondition (c) was the lynchpin of the Defendants’ case on the reinstatement\nwork. The Defendants argue that they carried out the reinstatement\nwork believing that they were required to do so under Planning Condition\n(c). They did not, therefore, intend to cause damage to the Plaintiffs. 112    The\nDefendants rely on two letters purportedly received from their architectural\nadvisors, Samson Tan Associates (“STA”), to buttress this argument.\nThese letters were dated 19 August 2010 and 31 August 2011. I will\nrefer to them collectively as “the STA Letters”. The dates on the\nSTA Letters coincided with the dates of the grant and expiry of\nthe 2010 WP. 113    The\nfirst STA letter purported to remind SAA of its obligation under Planning\nCondition (c) of the 2010 WP to demolish “temporary structures” upon\nthe expiry of the 2010 WP. It also emphasised that for safety reasons, “temporary\nworks” should be removed after their temporary uses have expired\nby August 2011.[note: 60] 114    The\nsecond STA letter purported to reiterate Planning Condition (c) of\nthe 2010 WP. The second letter stated that STA absolved themselves from\nprofessional liability for uses that extended beyond the expiry\ndate of the 2010 WP. The second letter further stated that “temporary\nworks including the M&E works, partitions, the light weight\nmetal plate floors and metal sheet walls” were only certified temporary\nand not meant to last for more than ten years. They were to be removed\n“for reasons of public safety”.[note: 61] 115    The\nPlaintiffs dispute the authenticity of these letters. The Plaintiffs claim\nthat the STA Letters were fabricated to support the Defendants’\ncase. 116    I\nam of the view that the Defendants did not carry out the reinstatement\nwork because they believed they were legally obliged to do so under\nthe 2010 WP. Rather, the Defendants’ reliance on the 2010 WP and the\nSTA Letters was a convenient and belated excuse to mask their predominant\npurpose to cause damage to the Plaintiffs. The reasons for this conclusion\nfollow below. The Defendants failed to establish\nthe authenticity of the STA Letters 117    I\nfind that the Defendants have failed to establish that the STA Letters were\ngenuine letters issued by STA on the purported dates stated in them. 118    Instead,\nI am of the view that Ong Cher Keong fabricated and backdated the\nSTA Letters to assist the Defendants with their case. Ong Cher Keong\nwas one of the Defendants’ witnesses. He was a director of SAA from\n1999 to 2003. During that time, he was a majority shareholder of\nOCK International Development Pte Ltd (“OCK International”). OCK International,\nin turn, owned 40% of the shares in SAA.[note: 62]He was a certified\narchitect until 2003, when his certification lapsed due to his bankruptcy.\nHe was thereafter consulted on anad hocbasis\nby SAA on matters pertaining to planning, building control approval\nand construction. 119    The\nfollowing factors lead me to believe that Ong Cher Keong fabricated\nand backdated the letters to assist the Defendants’ case: (a)     The\noriginals of the STA Letters were not produced. Only copies were\nproduced. No satisfactory reason was given as to why the originals\nwere not produced. Ong Cher Keong said he had handed the letters,\npresumably on two different occasions, to Ang Kiong Teng, the chief\noperating officer of SAA, who also gave evidence for the Defendants\nat trial. Ang Kiong Teng did not explain what had become of these\noriginals. (b)     The\nsignatory of the STA Letters was not identified by name in the letters. (c)     It\nwas only during cross-examination that Ong Cher Keong testified\nthat he had drafted and signed the STA Letters himself. He claimed\nhe did so in consultation with Samson Tan (who was apparently STA’s\nprincipal architect).[note: 63]Yet no mention was\nmade of these points in Ong Cher Keong’s AEIC. I find it unlikely\nthat Samson Tan would authorise Ong Cher Keong to issue letters\non STA’s behalf, as there was no apparent reason for granting him\nsuch authority. There was no clear evidence that Ong Cher Keong\nwas employed by STA. Neither was he a certified architect on the\ndates that the letters bore. His certification had lapsed long before,\nin 2003, when he was made a bankrupt. (d)     The\nDefendants did not call Samson Tan as a witness to corroborate Ong\nCher Keong’s evidence that he had consulted with Samson Tan before\neach letter was sent. (e)     Ong\nCher Keong was an interested party in SAA. In his AEIC, Ong Cher\nKeong had disclosed his previous directorship and interest in SAA\nthrough his OCK International Shares. However, he did not disclose\nthat although he was no longer a shareholder in OCK International,\nhe had transferred his shares in OCK International to his brother, David\nOng Chit Beng, in 2002. Ong Cher Keong also did not disclose that\nhis brother continued to hold a 75% interest in OCK International\nat the time of the proceedings. This information only surfaced when\nOng Cher Keong was being cross-examined.[note: 64] (f)     The\nSTA Letters were only brought to SLA’s attention very much later\nthan the dates that they bore. The STA Letters were dated 19 August\n2010 and 31 August 2011. The first time SAA made mention of the\nSTA Letters to SLA was only on 9 January 2012. If the STA Letters\nwere genuine and were as crucial as the Defendants made them out\nto be, they would have been raised to SLA much earlier. (g)     The\nfirst STA letter misquoted Planning Condition (c) of the 2010 WP\nby inserting an additional word “temporary” to the word “structures”\n(see [113] above). The word “temporary” did not appear in Planning\nCondition (c) of the 2010 WP (see [110] above). The addition of\nthis word appeared to be deliberate to support the Defendants’ case\nthat the structures in question were temporary and hence had to\nbe demolished. (h)     The\nsecond STA letter stated that the works were to be removed for reasons\nof “public safety”. But in cross-examination, Ong Cher Keong admitted\nthat he was not in a position to comment on the safety of the structures\nbecause he was not a structural engineer.[note: 65]He also accepted that he had\ndrafted the STA Letters without the knowledge or expertise to comment\non the safety of the structures.[note: 66] (i)     The\ncontent of the second STA letter goes beyond what was necessary\nfor the protection of the architects. Ong Cher Keong claimed in\ncross-examination that the purpose of the STA Letters was to discharge\nSTA from their professional liability.[note: 67]Yet the\nsecond STA letter did more than that. It “strongly advised” SAA\nto ensure that its tenants remove the works in question. The “advice”\nappeared to be calculated to provide the basis for the Defendants’\nreinstatement work. 120    I\nam therefore of the view that the STA Letters were fabricated. This removed\nan important plank on which the Defendants’ argument about the 2010\nWP stood. The Defendants adopted inconsistent\npositions in respect of their obligations under the 2010 WP 121    The\nevidence given by the Defendants’ witnesses attempting to justify their\nreinstatement work with the 2010 WP was unsatisfactory. Tan Chee Beng,\nOng Cher Keong and Ang Kiong Teng gave evidence on this point for\nthe Defendants. Some of the evidence was incoherent, and there were inconsistencies\nin their evidence. 122    I\nbegin with Ong Cher Keong’s evidence. It was convoluted and difficult\nto follow. It was also characterised by constant shifts to make\nup for apparent inconsistencies in the positions he took. 123    His\nAEIC stated that 76 groups of works, which he referred to as “temporary\nstructures”,[note: 68]needed to be\nremoved pursuant to Planning Condition (c) upon the lapse of the\n2010 WP.[note: 69]However, in\ncross-examination, Ong Cher Keong admitted that URA approved the\nuse of space, and not actual structures.[note: 70]He conceded that\nmany of the 76 temporary structures were not reflected in the plans\nthat were submitted to URA for approval.[note: 71]This did not\nsit well with the position taken in his AEIC. 124    Ong\nCher Keong then changed tack. He stated that when a WP expires,\nthe approved use of space expires, and consequently, any structure that\nencloses or defines the space must be demolished.[note: 72]The\nterm “structures enclosing or defining space” was not mentioned\nin his AEIC. Further, it was apparent that many of the 76 temporary\nstructures (which included the likes of drains, air-conditioning\nunits and fire-protection systems) could not be conceived of as\nstructures enclosing space. 125    Ong\nCher Keong also attempted to justify his use of the phrase “temporary\nstructures”, which did not appear in the 2010 WP. He acknowledged\nthat the 2010 WP only mentioned “structures” and not “temporary\nstructures”.[note: 73]He went\non to state that “temporary structures” were works that were restricted\nby time, and that the time restriction was “specified by URA that\napproved use is [sic] only for three\nyears”.[note: 74]Ong Cher Keong, however,\naccepted that the works were not intended to last only for three\nyears,[note: 75]and that SAA did\nnot intend the temporary structures to last only for a specified\nperiod of time.[note: 76]Yet Ong Cher Keong refused\nto admit that there was no basis for him to label the works “temporary”,\nand he was unable to satisfactorily explain the use of that phrase.[note: 77] 126    Tan\nChee Beng’s evidence did not suffer from the same inconsistencies\nthat Ong Cher Keong’s did. There were, however, conflicting accounts\nbetween Tan Chee Beng’s and Ong Cher Keong’s evidence. This was\nso notwithstanding that the Defendants had elected for Tan Chee\nBeng to give his evidence last (even though he was the Defendants’\nmain witness). Tan Chee Beng, being a named defendant in the proceedings,\nwas entitled to be present in court throughout the trial. Tan Chee\nBeng therefore had the opportunity of listening to Ong Cher Keong’s evidence\nin full before he gave his evidence. 127    For\nexample, when Ong Cher Keong was questioned about whether SAA would\nbe required to remove the structures and replace them if SAA won\nthe new tender, he stated that SAA would have to take the structures down\nand study them, before putting them up again.[note: 78]This stood in stark contrast\nto Tan Chee Beng’s evidence on the point. Tan Chee Beng stated that\nif SAA won the tender, they would not have removed the structures (see\n[146] below). 128    Another\nexample of the inconsistencies in the Defendants’ case and evidence\nis their position on the Metal Deck Flooring. This is one of the\n18 Items that the Plaintiffs complain the Defendants removed. 129    The\nDefendants’ pleadings took the position that the Metal Deck Flooring\nwas required to be demolished because it was a “structure” under Planning\nCondition (c) of the 2010 WP.[note: 79]Ang Kiong Teng’s AEIC, however,\nindicated that the Metal Deck Flooring was required to be removed,\nnot because it fell within the scope of the 2010 WP, but because\nit was anillegal structure.[note: 80]In cross-examination, he acknowledged\nthe inconsistency but was unable to explain it.[note: 81]Ang Kiong Teng\nlater admitted that he signed his AEIC simply to comply with the\ninstructions of Tan Chee Beng.[note: 82] 130    Tan\nChee Beng’s evidence was that the Metal Deck Flooring was an illegal\nstructure from the outset. But that position is a curious one, in\nthree respects. First, Tan Chee Beng claimed that the Metal Deck\nFlooring was erected in 2002 by an unnamed sub-tenant. I do not\nfind his explanation as to why an illegal structure was even allowed\nto be constructed satisfactory. Second, if the structure was illegal\nfrom the outset, then it is surprising why the Defendants allowed\nit to stand for nine years before it was removed in 2011. They did\nnot say that they had discovered the existence of the structure\nor its illegality only in 2011. Third, the Metal Deck Flooring was present\nin the drawings that were submitted to URA for approval, and was approved\nas an area for “institutional” use.[note: 83]Tan Chee\nBeng attempted to explain why the Metal Deck Flooring was illegal\neven though URA had approved it for institutional use. Tan Chee\nBeng stated that the Metal Deck Flooring was being applied to a\n“commercial” use instead of the “institutional” use that approval\nhad been granted for.[note: 84]But this\nwould merely mean that the Defendants were applying the Metal Deck\nFlooring to an incorrect use, rather than the structure being illegal\nin the sense that it did not fall within the scope of the WPs to\nbegin with.[note: 85] 131    The\nDefendants argue that they have maintained a consistent position on\nthe illegality of the Metal Deck Flooring. They rely on the fact\nthat Tan Chee Beng alluded to the illegality at the meeting of 1 December\n2011. I do not think that Tan Chee Beng’s mere reference to the\nfact that it was illegal at the meeting is enough to remedy the\nother patent inconsistencies in the Defendants’ position. In the\nfirst place, it was not even made clear at the meeting what Tan\nChee Beng meant when he said that the Metal Deck Flooring was illegal.\nWas it illegal because it did not have the necessary approval from\nsome other authority, or was it illegal because the 2010 WP had\nlapsed? 132    The\nDefendants’ contradictions on the Metal Deck Flooring were not limited\nonly to the reason for its removal. The Defendants prevaricated even\non the location of the Metal Deck Flooring, and which portions of\nthe Metal Deck Flooring they had removed. This is apparent from\nthe differences between the Defendants’ case which was put to the\nPlaintiffs’ witnesses, and the subsequent evidence that Tan Chee\nBeng gave. 133    The\nMetal Deck Flooring was situated on the fifth level of the grandstand.\nThe floor plan of the fifth-level grandstand was segregated into four\nareas, which I shall refer to as Areas A, B, C and D for convenience.[note: 86] 134    The\nPlaintiffs’ witness, Tan Tze Suen, gave evidence on which portions\nof the Metal Deck Flooring had been removed. She was a registered\narchitect since 2007, and a qualified person for the purpose of\nthe Planning Act (Cap 232, 1998 Rev Ed) (“the Planning Act”). Tan\nTze Suen’s evidence was that the Metal Deck Flooring was removed\nfrom Areas B, C and D. 135    In\ncross-examination, Mr Yeap referred Tan Tze Suen to Area A. Mr Yeap\nstated that the Defendants’ instructions were that the Metal Deck Flooring\nwas removed from Area A.[note: 87] 136    Tan\nTze Suen stated that there had never been any Metal Deck Flooring\nconstructed within Area A, because that area was “in its original conditions\n[sic] with tile floors and steps”.[note: 88]She stated that there was\nno debris or marks in Area A. This was in contrast with Areas B,\nC, and D, which were littered with hacked-off metal stumps and other\nfragments, indicating that structures had been destroyed and removed.[note: 89] 137    When\nTan Chee Beng was on the stand, he took a completely different position\nfrom what Mr Yeap had put to the Plaintiffs’ witnesses. Tan Chee\nBeng stated that the Metal Deck Flooring at Area A was still intact,\nand that no Metal Deck Flooring had been removed from Area A at all.[note: 90]He further\nstated that the removal of the Metal Deck Flooring was from areasoutsideof Areas A, B, C and D referred\nto by Tan Tze Suen.[note: 91] 138    Not\nonly was Tan Chee Beng’s evidence inconsistent with the case that\nthe Defendants’ counsel had put to the Plaintiffs’ witnesses, it\nalso did not meet the Plaintiffs’ contention. If the Metal Deck\nFlooring was removed from an area outside Areas A, B, C and D, then\nit would have been a non-issue, as the Plaintiffs were complaining\nonly about the removal of such flooring from Areas B, C and D. 139    In\ntotality, the evidence of the Defendants’ witnesses and the case\nthey put forth was unimpressive. The incoherence and inconsistencies\nsuggested that they did not genuinely believe that the 2010 WP required\nthe reinstatement work and the removal of the 18 Items. Rather,\nthe inevitable conclusion is that the Defendants’ relied on the\n2010 WP as an excuse to justify their reinstatement work. The Defendants relied on the\n2010 WP belatedly 140    Third,\nthe Defendants’ reliance on the 2010 WP was belated. The Defendants\ndid not make any mention of the 2010 WP until 9 January 2012 in\na letter from SAA to SLA, despite there having been frequent correspondence\nabout the reinstatement work throughout November and December 2011,\nand January 2012. 141    In\nthe Five SLA Letters sent to SAA over that period (see [33] and\n[37] above), SLA emphasised that it did not require extensive reinstatement work\nfor units that would be used by existing occupants beyond 29 February\n2012. SLA also stated that there was no need to remove “renovations,\nrepairs and authorised alterations, additions and structural changes”\nfrom the first level of the main car park building.[note: 92]In\nthe letter of 4 January 2012, SLA also appended a reduced list of\nreinstatement work, and also stated specific structures which were\nto be retained.[note: 93]SAA did not raise the 2010\nWP in response to any of these letters. 142    Further,\nthere was no mention of the 2010 WP at the meeting of 1 December\n2011 between Benson Tan, Yap Chee Sing, Tan Chee Beng and Roger\nKoh. At no time did Tan Chee Beng and Roger Koh say that there was\nno choice but to carry on with the reinstatement work because of\nthe 2010 WP. On the contrary, their message was that they were prepared\nto stop such reinstatement work if appropriate compensation was\npaid by the Plaintiffs. 143    The\nlateness of the Defendants’ mention of the 2010 WP is even starker\nin the light of their assertion that they acted in reliance on the second\nSTA letter dated 31 August 2011. If the Defendants were well informed\nand aware of their obligations under the 2010 WP because of STA’s\nadvice, as was their case, then it is inconceivable that they did\nnot raise the purported obligations under the 2010 WP to SLA at\nthe first instance that SLA informed the Defendants to cease reinstatement\nwork. 144    The\nDefendants’ failure to raise the 2010 WP as a concern till so late in\nthe day contradicts its own position on the authenticity and importance of\nthe STA Letters. The lateness supports the conclusion that it was\nnever a genuine concern to begin with. The Defendants did not believe\nthat SLA and URA would adopt independent and conflicting positions 145    Finally,\nI do not accept a suggestion for the Defendants that they believed\nthat the obligation to reinstate under the 2010 WP existed independently\nfrom SLA’s instructions, which had significantly pared down the\nscope of reinstatement work required under the Extension Tenancy. Rather,\nI am of the view that Tan Chee Beng himself believed that SLA and URA\nwould not adopt independent and conflicting positions, and that\nSLA and URA would work together to resolve any outstanding issues. 146    In\ncross-examination, Tan Chee Beng was asked what SAA’s position on\nthe reinstatement work would be if SAA won the tender for the new tenancy,\nSLA stated that there was no need to reinstate, and URA was silent on\nit (apart from the 2010 WP).[note: 94]Tan Chee\nBeng stated that “[l]awfully, SAA has to, but SAA will not have\nto [reinstate].”[note: 95]Tan Chee\nBeng later explained that if SAA won the tender for the new tenancy,\nSAA would not have carried out reinstatement work pursuant to its\nobligations under the 2010 WP as “SAA considers this is something\nthat will be sorted out between URA and SLA, because [Tan Chee Beng\nconsiders that he is] dealing with the government as one body”.[note: 96]Tan Chee Beng also stated that\nthis was the reason that SAA operated without a valid WP for the period\nbetween 27 October 2004 and 30 November 2005.[note: 97] 147    Tan\nChee Beng’s oral evidence was also corroborated by independent contemporaneous\ndocuments. SAA’s tender proposal for the new tenancy that was submitted\nin July 2011 indicated that no monies were estimated to be spent\non structural and building works, M&E works, architectural equipment,\nfittings and fixtures.[note: 98]The tender proposal was made\non the basis that SAA would not need to carry out reinstatement\nwork, and then replace all the items they had removed, if they won\nthe tender. 148    It\ntherefore appears to me that Tan Chee Beng’s understanding of the situation\nwas that SLA and URA would work together to determine what had to\nbe removed and what need not be removed. It was not a case where Tan\nChee Beng genuinely believed that even though SLA was urging SAA to\nstop reinstatement work, URA would take a different position. 149    The\nDefendants in their reply submissions point to the fact that SH Cogent’s\nundertaking to SLA dated 11 January 2012, required SH Cogent to indemnify\nSLA from any potential claims including “any civil penalty which\nmay be imposed by URA as a debt”.[note: 99]The Defendants argue that it was\nclear from this undertaking that SLA itself contemplated the possibility of\na civil penalty imposed by URA if SAA did not remove the structures\nas required by the 2010 WP. They say that “SLA saw the issue … as\na real and legitimate concern” and that “[t]he Defendants’ concern\ncan only be even greater given that they were the ones who erected\nthese additions and alterations”.[note: 100] 150    This\nargument misses the point. The question is not whether SAA or SLA\nwouldactuallyhave faced potential\nliability to URA for a civil penalty if the reinstatement work was\nnot carried out. Rather, the question is whether the Defendants\ncarried out the reinstatement work because they were motivated by\nthe belief that SAA was required to do so under the 2010 WP, and\nthe desire to avoid the consequence of potential liability if they\ndid not. The Defendants were clearly not concerned about the lapse\nof the 2010 WP. It was never mentioned at the meeting of 1 December\n2011 (see [142] above) and was mentioned late only in SAA’s letter\nto SLA dated 9 January 2012. 151    The\nreasons I have discussed above lead me to the conclusion that the Defendants\ndid not carry out the reinstatement work because they believed that\nthey were obliged to do so under the 2010 WP. Tan Chee Beng believed all\nalong that URA would not complain if no reinstatement work was carried\nout because there was a subsequent master tenant taking over the Site\nwho wanted to use it in its existing state. It was just a matter\nof formalising the permissions and approvals between the subsequent\nmaster tenant and URA. This belief was the reason SAA’s tender proposal\nfor the subsequent tenancy of the Site indicated that no money was\nto be spent on additional works. This belief was reaffirmed by URA’s\nletter to SAA dated 10 February 2012 stating that URA did not require\nthe demolition of any of the structures for which the approved use\nhad ceased. 152    Rather,\nthe reason the Defendants carried out the reinstatement work against\nthe instructions of SLA, and the reason the Defendants attempted\nto force the sub-tenants and licensees to vacate their units by\n31 January 2012 was because the Defendants’ predominant purpose\nwas to injure the Plaintiffs. The Plaintiffs refused to provide\nthe Defendants with the compensation they wanted, and so, the Defendants\nwanted to make the Plaintiffs pay the price for their refusal.",
        "Whether the Defendants employed\nunlawful means": "153    In\nview of my finding above that the predominant purpose of the Defendants\nwas to injure the Plaintiffs, the question of whether unlawful means\nwas employed becomes academic. It is no longer necessary for me\nto address this point, and I will not do so.",
        "Whether the Plaintiffs suffered\ndamage": "154    The\nPlaintiffs argued that they suffered three categories of damage\nas a consequence of the Defendants’ conspiracy. First, the expenses\nincurred in replacing the 18 Items that were removed in the course\nof the Defendants’ reinstatement work. Second, loss of income in\nthe form of rent and licence fees from the sub-tenants and licensees\nwho would have continued under the Plaintiffs but did not. Third,\nexpenses incurred in uncovering the Defendants’ conspiracy and minimising\nthe damage done to the Plaintiffs, namely, legal and private investigation\ncosts. 155    Proof\nof damage is necessary to establish the tort of conspiracy. However,\nonce the Plaintiffs prove actual pecuniary loss, “the damages are at\nlarge, in the sense that they are not limited to a precise calculation\nof the amount of actual pecuniary loss actually proved” (Lonrho plc and others v Fayed and others (No 5)1\nWLR 1489 (“Lonrho v Fayed (No 5)”)\nat 1494). The hearing of liability and quantum has been bifurcated.\nTherefore, as long as the Plaintiffs prove some actual pecuniary\nloss, I leave the precise extent of damage to be assessed at the\nhearing to determine quantum.",
        "Damage from the removal of the\n18 Items": "156    The\nPlaintiffs’ pleaded case relies on the Defendants’ purported removal\nof the 18 Items from the Site. The Defendants admit that they removed\nfive of the items (see the annexure to this judgment). They deny removing\nany of the rest. As I am concerned only with liability at this stage of\nthe proceedings, I need not go into the question of whether all\nof the 18 Items were removed by the Defendants. The precise number\nof items that were removed goes to quantum rather than liability.\nI will therefore proceed on the basis that the Defendants have only\nremoved five items. 157    I\nam of the view that the Plaintiffs have suffered some actual pecuniary\nloss as a result of the removal of the five items. I accept the evidence\nof the Plaintiffs’ witness, Loh Yi-Shin, on this point. She was\na professional engineer of nine years’ standing, and a qualified\nperson for the purposes of the Planning Act. She was an employee\nof Cogent Holdings at the material time. She was assigned to oversee\nplanning, renovation and refurbishment of the Site. 158    In\nher AEIC, she gave evidence that the removal of the five items resulted\nin the Plaintiffs having to incur expenses replacing them, with some\nof the replacement work needing to be carried out on an urgent basis.[note: 101]Her AEIC also exhibited a spreadsheet\nlisting the estimated cost of replacing the structures that the\nPlaintiffs alleged were removed.[note: 102]I am of\nthe view that the removal of the five items resulted in some actual pecuniary\nloss to the Plaintiffs. 159    The\nDefendants argued that the Plaintiffs suffered no loss because the Plaintiffs\nwere not entitled to any fixtures, fittings or structures under\nthe Plaintiffs’ agreement with SLA. The Plaintiffs were only entitled\nto the Site on an “as is where is” basis. In other words, the Plaintiffs\ncould not suffer a loss from the removal of what it was not entitled\nto. 160    I\ndo not accept this argument. It wrongly presupposes that loss can only\nbe suffered in respect of damage done to property owned by the Plaintiffs.\nBut the Plaintiffs could have suffered loss by delays and/or being required\nto incur expenses that they would not have had to, had the tort\nnot been committed. It is clear that but for the Defendants’ acts\ncommitted pursuant to the conspiracy to injure the Plaintiffs, the\nexpenses and time that was wasted would not have materialised.",
        "Damage from loss of income from\nrent and licence fees": "161    The\nPlaintiffs allege that the loss of income they suffered arose in\ntwo ways. First, the Defendants’ acts created an atmosphere of anxiety\nand uncertainty amongst the second-hand car dealers at the car mart.\nThis caused car dealers who were prepared to consider entering into\nlicence agreements with the Plaintiffs to leave the Site, in search\nof alternative locations. As a result, the Plaintiffs did not enjoy\nlicence fees they would have obtained until they were able to find\nreplacement licensees for the vacated units. Second, the handover\nof units to sub-tenants and licensees of the Plaintiffs was delayed\ndue to the time the Plaintiffs had to spend replacing the items\nwhich had been removed from the Site by the Defendants. The delay\nresulted in them not being able to start collecting rent or licence\nfees for those units from an earlier date. 162    On\nthe first ground, the Plaintiffs claim loss of income for the period between\n1 March 2012 and the date replacement licensees were found for the\nunits concerned. 1 March 2012 would have been the date the Plaintiffs started\nreceiving licence fees from those existing car dealers who would have\ncontinued under the Plaintiffs if they had not left the Site. The Plaintiffs\nprovided particulars of 13 car dealers who purportedly left due\nto the Defendants’ conduct.[note: 103] 163    The\nDefendants, on the other hand, argued that the car dealers did not\nleave as a result of their conduct. Rather, they left because of\nthe significantly higher licence fees that the Plaintiffs were asking\nfor. 164    Sean\nPeh, the Plaintiffs’ witness, gave evidence on this point. He was head\nof the automotive department of Cogent Automotive Logistics Pte\nLtd at the material time. His evidence in cross-examination was\nthat of the 13 car dealers, two left due (either in whole or in\npart) to the uncertainty and anxiety. Two of the car dealers did\nnot leave the Site, but merely switched units after the handover.\nThe remaining nine of the 13 car dealers left as a result of the\nincrease in licence fees.[note: 104] 165    It\nis not yet clear to me at this stage that the increase in licence\nfees was so significant that it was the sole, decisive, factor.\nIn my view, the Defendants’ acts would have had a role to play in\nthe car dealers’ departures. Sean Peh’s evidence that two car dealers\nleft as a result of the anxiety and uncertainty was not challenged.\nIn respect of the other 11 car dealers, Mr Adrian Wong, counsel\nfor the Defendants who was conducting the cross-examination of Sean\nPeh, stopped short of suggesting to Sean Peh that thesole reasonthey left the Site was the\nhigher licence fees. The higher licence fees may merely have been\none of the factors that resulted in them leaving the Site. It is\nopen to the Plaintiffs to prove the precise extent of loss suffered\nat the quantum stage of the proceedings. 166    On\nthe second basis of the Plaintiffs’ claim for loss of income from rent\nand licence fees, I accept that the evidence given by Loh Yi-Shin.\nAs mentioned above (at [157]), she gave evidence that the reinstatement\nwork resulted in the Plaintiffs having to replace the items that\nthe Defendants had removed, some on an urgent basis.[note: 105]The spreadsheet referred to above also\nlisted the commencement date and expected end date of the replacement\nwork in respect of each of the items.[note: 106]I accept\nher evidence that the time spent replacing these items would have\ndelayed the earliest date which the Plaintiffs could have let out\nthe affected units, and resulted in them suffering a loss of rent\nor licence fees for those units.",
        "Damage from expenses incurred\nin uncovering the conspiracy": "167    The\nPlaintiffs argue that the damage necessary for actionable conspiracy\ncan be established by expenses incurred in exposing the conspiracy.\nThey rely on the English High Court case ofBritish\nMotor Trade Association v Salvadori and others[1949]\nCh 556 (“British Motor”) at 569.\nThe Plaintiffs argue that they incurred expenses in the process\nof uncovering the Defendants’ conspiracy, and attempting to prevent\nfurther harm by the Defendants. For the former, they had to hire\nprivate investigators to conduct surveillance at the Site and to\nuncover what the Defendants’ were doing. For the latter, they had\nto obtain the Injunction to prevent the Defendants from causing\nfurther loss pursuant to the conspiracy. The Plaintiffs argue that\nthis expense was, in itself, able to satisfy the requirement of\ndamage for actionable conspiracy. 168    The\nDefendants argue thatBritish Motoris\ndistinguishable. They argue that the facts ofBritish\nMotorwere exceptional; the English High Court there\nfound that the conspiracy “imperil[ed] [the claimant’s] very existence”\n(British Motorat 569). They also\nargue that the court inBritish Motordid\nnot hold that expenses incurred in exposing the conspiracy were, by\nthemselves, sufficient for the purpose of making out a case for conspiracy.\nThey say that if that were the case, the requirement of damage for\nactionable conspiracy would be rendered otiose, as the claimant\nwould almost always incur expenses in uncovering a conspiracy. 169    In\nview of my findings above that the Plaintiffs have suffered actual pecuniary\nloss over and above the expenses incurred in uncovering the conspiracy,\nI do not need to decide whether such expenses are, by themselves,\nsufficient to establish damage. The expenses can nonetheless be recovered\nby the Plaintiff, subject to proof at the quantum stage of the proceedings.",
        "Whether the Defendants are entitled\nto damages on the Plaintiffs’ undertaking in respect of the Injunction": "170    I\nnow address the Defendants’ counterclaim. The Defendants seek damages\nfor what they say was the Plaintiffs’ wrongful application for the Injunction.\nThe Defendants are asking the court to enforce the Plaintiffs’ undertaking\nto abide by any order for damages which the Plaintiffs gave to the\ncourt when they applied for the Injunction on 20 January 2012.[note: 107]Further,\nthe Defendants, in their closing submissions, rely onRookes v Barnard[1964] 2 WLR 269 to argue\nthat the Plaintiffs should be required to pay exemplary damages.\nThey say that the Plaintiffs’ “conduct in seeking an injunction\nto advance their financial interests [is] an abuse of process”,\nand “was a cold and calculated act on the part of the Plaintiffs”.[note: 108] 171    The\ncourt has the discretion in deciding whether or not to enforce a claimant’s\nundertaking in damages. It is to be exercised by reference to all the\ncircumstances of the case (Tribune Investment\nTrust Inc v Soosan Trading Co Ltd[2000] 2 SLR(R) 407\n(“Tribune Investment”) at [54]).\nIn order for the court to be persuaded that a claimant’s undertaking\nin damages should be enforced, it has to be satisfied of two things:\nfirst, that the injunction was wrongly granted; and second, that\nthere are no special circumstances militating against the enforcement\nof the claimant’s undertaking (Canadian Pacific\n(Bermuda) Ltd v Nederkoorn Pte Ltd and another[1999]\n1 SLR(R) 628 at [50]). 172    Once\nit is established that the undertaking should be enforced, the court\ncan decide whether to do so summarily, or by ordering an inquiry\nas to damages (Tribune Investmentat\n[53]). 173    I\npause to mention that a claim in respect of an undertaking in damages\nshould not be pleaded as a counterclaim (David Bean, Isabel Parry &\nAndrew Burns,Injunctions(2012,\n11th Ed, Sweet & Maxwell) at para 6–14), as the Defendants have\ndone in this case. The undertaking in damages, which the claimant\ngives upon the grant of an injunction, is given to thecourtand not to the defendant. It does\nnot create any right on the part of the defendant which can found\na cause of action (Cheltenham & Gloucester\nBuilding Society (formerly Portsmouth Building Society) v Ricketts[1993]\n1 WLR 1545 (“Cheltenham”) at 1551D,\nper Neill LJ). The defendant can ask the court to enforce the undertaking.\nBut the defendant “has no right to its enforcement or any right\nto damages until the discretion is exercised in his favour and damages\nare awarded” (Cheltenhamat 1555B, per\nPeter Gibson LJ). Notwithstanding the Defendants’ incorrect approach of\ncharacterising the enforcement of the undertaking as a counterclaim rather\nthan an application, I will nonetheless deal with the merits of\ntheir claim for the undertaking in damages to be enforced. 174    I\nturn to the question of whether the Injunction was wrongly granted. The\nsuccess of the claimant at trial and the circumstances in which\nthe order was obtained are important to this question (Marubeni International Petroleum (S) v Projector\nSA[2004] 4 SLR(R) 233 at [15]). If the claimant fails\nin its claim at the trial, then the injunction would usually have\nbeen wrongly granted. 175    The\nDefendants’ position runs into difficulties at this point. They have\nnot elucidated in their pleadings or submissions a basis for their assertion\nthat the Injunction was wrongly granted. Their position appears to\nhave been premised on the discharge of the Injunction and perhaps\nthe expected failure of the Plaintiffs’ claim. But the latter premise\nfalls away with my finding in favour of the Plaintiffs in respect\nof their substantive claim in this action. As for the former premise,\nthe Defendants assume that the discharge of the Injunction at the\ninterlocutory stage must mean that it was wrongly obtained in the\nfirst place. This is incorrect. 176    The\nfacts and the decision of the English Court of Appeal inCheltenhamare instructive. There, the\nplaintiffs obtained an interlocutory injunction against the defendants\nin a fraud claim. The injunction was discharged prior to the trial\nof the main action. The judge discharging the injunction ordered\nthat the plaintiffs’ undertaking in damages be enforced, and that\nthere be an inquiry as to damages. The Court of Appeal set aside the\norder. The Court of Appeal held that the decision of the judge enforcing the\nplaintiffs’ undertaking in damages was premature. If the allegation\nof fraud was made out at the trial, it would have been material\nto the exercise of the discretion whether to enforce the undertaking\nin damages. Neill LJ observed at 1551F that “[i]t is important to\nunderline the fact that the question whether the undertaking should\nbe enforced is aseparate questionfrom\nthe question whether the injunction should be discharged or continued”\n[emphasis added]. 177    The\njudge in the present case who granted and discharged the Injunction\nmust have been aware of this distinction. The judge expressly reserved\nthe issue of whether an inquiry as to damages was to be ordered\nfor the trial judge. 178    No\nwritten reasons were given by the judge for the decision to discharge\nthe Injunction. However, with the benefit of the dispute being ventilated\nin the trial before me and a full picture of the facts as they unfolded,\nI am of the view that the Injunction was not wrongly obtained. This\nis therefore not a proper case for the court to exercise its discretion\nto enforce the Plaintiffs’ undertaking in damages. The Defendants’ counterclaim\nis dismissed.",
        "Conclusion": "179    The\nDefendants’ conduct was reprehensible. While they intended to target\nthe Plaintiffs, it is troubling to note that others were also adversely affected\nby their conduct. 180    The\nDefendants must have known that the systematic conduct they embarked\non was causing anxiety, inconvenience and probably loss to their own\nsub-tenants and licensees, that is, those who were prepared to consider entering\ninto new agreements with the Plaintiffs. The plight of these sub-tenants\nand licensees came to the attention of the media and of SLA. But notwithstanding\nSLA’s intervention, the Defendants remained callous and unrelenting\nin what the Plaintiffs have aptly described as the Defendants’ scorched-earth\npolicy.[note: 109] 181    Yet,\ndespite the Defendants’ own wilful conduct, they have suggested in\ntheir closing submissions that they are entitled to exemplary damages from\nthe Plaintiffs, whom the Defendants allege acted in a “cold and calculated\nmanner” by obtaining the Injunction. 182    In\nthe future, landlords who operate through a master tenant should consider\nincluding adequate legal rights for themselves to protect the interests\nof sub-tenants, licensees and other beneficiaries from the acts\nof an unreasonable master tenant. Landlords must also be courageous\nenough to exercise those rights to protect such interests. 183    As\nan example, landlords should consider including for themselves the\nright to compel the master tenant to grant fresh sub-tenancies or licences\nup till the end of the existing tenancy, and to enter into such agreements\non behalf of the master tenant if it refuses to do so. Accompanying\nthis should also be the right of the landlord to insist that the master\ntenant stop reinstatement work and to seek injunctive relief to\nstop such work. 184    In\nthe present case, SLA did try to help sub-tenants and licensees\nwho wanted to continue under the Plaintiffs. SLA sent numerous letters\nto SAA to that effect. However, SLA stopped short of taking any\nlegal action to compel SAA to cooperate. Perhaps SLA did not have\nthe appropriate legal rights to commence legal action against SAA\nand intervene more directly. I hope it was not a lack of courage\nor a wish simply to avoid litigation that precluded them from intervening\nmore directly. 185    I\ngrant the Plaintiffs judgment against the Defendants for damages\nto be assessed for the loss and damage caused by the Defendants’\nconspiracy to injure the Plaintiffs. The assessment of damages is\nto be conducted by me or another judge (or judicial commissioner)\nof the High Court. I will hear the parties and make a final decision\non the costs of the action at a later date, after the quantum of\ndamages has been resolved. However, if either party wishes such\ncosts to be determined before the quantum of damages is resolved,\nthat party may make a written request accordingly.",
        "ANNEXURE:\nTHE 18 ITEMS": "S/No.ItemLocationWhether the Defendants dispute\nhaving removed the item1.Metal Deck FlooringSouth Grandstand Level 5No2.Cables at Chong Pang Steam\nBoat unitNorth Grandstand Level 2Yes3.Switch Room equipmentSouth Grandstand Level 4Yes4.Air-conditioning units and\ncablesSouth Grandstand Level 4Yes5.Air-conditioning unitsNorth Grandstand Level 3Yes6.Air-conditioning unitsManagement OfficeNo7.Electrical riser cablesNorth GrandstandYes8.Motherboard of sub-alarm\npanelNorth Grandstand Levels\n6, 7 and 8Yes9.Public Announcement System\nfor building and car martManagement OfficeNo10.Air-conditioning units and\ncablesCar mart units #B-76 and\n#C-19Yes11.Children’s playground structuresCourtyardNo12.Directional guide-postSouth Grandstand Level 1No13.Lightning protection systemNorth and South GranstandYes14.Earthing cable of lightning\nprotection systemCar martYes15.Fire alarm systemCar martYes16.Switch-boardsSouth Grandstand Level 6Yes17.Bus-barsMain switch-roomYes18.Meters, DBs and IsolatorsNorth Grandstand Level 2Yes    [note: 1]10 AB, p 102. [note: 2]Tan\nChee Beng’s AEIC, para 5(2). [note: 3]Tan\nChee Beng’s AEIC, para 5(1). [note: 4]12 March\n2014 Notes of Evidence (“N/E”), p 151 lines 1–2. [note: 5]2 PCB, p 742. [note: 6]Plaintiffs’\nfurther and better particulars dated 16 January 2013, Schedule A. [note: 7]1 PCB,\np 91. [note: 8]1 PCB, p 92. [note: 9]1 PCB,\np 103. [note: 10]1 PCB, p 156. [note: 11]13 March 2014 N/E,\np 99 lines 1–4. [note: 12]13 March 2014 N/E,\np 100 lines 14–18. [note: 13]1 PCB, p 503. [note: 14]1\nPCB, p 529. [note: 15]Benson\nTan’s AEIC, p 12. [note: 16]Benson Tan’s AEIC,\np 13. [note: 17]1\nPCB, p 533. [note: 18]1\nPCB, p 553. [note: 19]Benson\nTan’s AEIC, p 15. [note: 20]1 PCB, p 583. [note: 21]1 PCB, p 559. [note: 22]2\nPCB, p 262. [note: 23]2 PCB, p 313. [note: 24]2 PCB, p 390. [note: 25]2\nPCB, pp 387–388. [note: 26]2 PCB, p 407. [note: 27]2 PCB, p 415. [note: 28] [note: 29]2\nPCB, p 497. [note: 30]2\nPCB, p 501. [note: 31]2 PCB, p 505. [note: 32]2 PCB, p 557. [note: 33]2\nPCB, p 579. [note: 34]1\nPCB, p 492. [note: 35]1\nPCB, pp 491–492. [note: 36]1 PCB, pp 131–132. [note: 37]1\nPCB, p 600. [note: 38]2 PCB, pp 263–265. [note: 39]2\nPCB, p 434. [note: 40]13\nMarch 2014 N/E, p 86. [note: 41]Exhibit\nD10. [note: 42]Defendants’ closing\nsubmissions, para 68(a). [note: 43]Defendants’ closing\nsubmissions, para 68(a). [note: 44]Benson\nTan’s AEIC, at para 34. [note: 45]4 March 2014 N/E, pp\n79–80. [note: 46]6\nMarch 2014 N/E, pp 15–16. [note: 47]Defendants’ reply submissions,\npara 15. [note: 48]Defendants’\nreply submissions, paras 18–22. [note: 49]1 PCB, p 92. [note: 50]13 March 2014 N/E,\np 38 lines 12–18. [note: 51]1\nPCB, p 529. [note: 52]1 PCB, p 559. [note: 53]2 PCB, p 262. [note: 54]2 PCB, p 480. [note: 55]Ang\nKeng Tiong’s AEIC, para 40(c). [note: 56]Lincoln\nGabriel’s AEIC, pp 9–16. [note: 57]Ang\nKiong Teng’s 2nd AEIC, para 14. [note: 58]Defendants’ closing\nsubmissions, paras 48 and 49. [note: 59]1 PCB, p 47. [note: 60]2\nPCB, p 411. [note: 61]2\nPCB, p 410. [note: 62]11 March\n2014 N/E, p 33 lines 18–24. [note: 63]11\nMarch 2014 N/E, p 121. [note: 64]11\nMarch 2014 N/E, p 34 line 25–p 36 line 21. [note: 65]11 March 2014 N/E,\npp 173–175. [note: 66]11\nMarch 2014 N/E, pp 173–175. [note: 67]11\nMarch 2014 N/E, p 119 lines 4–20. [note: 68]Ong\nCher Keong’s AEIC, para 14. [note: 69]Ong\nCher Keong’s AEIC, para 19. [note: 70]11\nMarch 2014 N/E, pp 39–40, [note: 71]11\nMarch 2014 N/E, pp 64–74. [note: 72]11 March 2014 N/E,\np 48; 11 March 2014 N/E, p 55 lines 19–22. [note: 73]11\nMarch 2014 N/E, p 95 lines 14–21. [note: 74]11\nMarch 2014 N/E, p 96. [note: 75]11\nMarch 2014 N/E, p 97. [note: 76]11\nMarch 2014 N/E, p 108. [note: 77]11 March 2014 N/E,\np 118. [note: 78]12 March 2014 N/E,\npp 87–89. [note: 79]Defence,\npara 25B(2)(a). [note: 80]Ang Kiong Teng’s AEIC,\npara 58. [note: 81]12 March 2014 N/E,\np 127 line 23–p 128 line 1. [note: 82]12\nMarch 2014 N/E, p 129 lines 11–16. [note: 83]14\nMarch 2014 N/E, p 74 lines 22–24. [note: 84]14\nMarch 2014 N/E, p 75 lines 4–8. [note: 85]14\nMarch 2014 N/E, p 76 lines 6–24. [note: 86]Exhibit D3. [note: 87]7\nMarch 2014 N/E, p 24 lines 6–9; p 28 line 23–p 29 line 2. [note: 88]7 March 2014 N/E, p\n29 lines 3–8. [note: 89]7 March 2014 N/E, p\n31 line 20–p 32 line 14. [note: 90]14 March 2014 N/E p\n73 lines 1–2; p 74 line 12. [note: 91]14\nMarch 2014 N/E p 74 lines 1–9. [note: 92]1 PCB, p 600. [note: 93]2\nPCB, p 263. [note: 94]13\nMarch 2014 N/E, p 28 lines 1–7. [note: 95]13\nMarch 2014 N/E, p 28 line 16. [note: 96]13 March 2014 N/E,\npp 28–29. [note: 97]13 March 2014 N/E,\np 12. [note: 98]1\nPCB, p 480. [note: 99]2\nPCB, p 388. [note: 100]Defendants’\nreply submissions, para 56(1). [note: 101]Loh Yi-Shin’s AEIC,\npara 39. [note: 102]Loh\nYi-Shin’s AEIC, Exhibit LYS-12. [note: 103]Plaintiffs’\nfurther and better particulars dated 16 January 2013, Schedule B. [note: 104]7\nMarch 2014 N/E, pp 120–124. [note: 105]Loh Yi-Shin’s AEIC,\npara 39. [note: 106]Loh\nYi-Shin’s AEIC, Exhibit LYS-12. [note: 107]Defence and counterclaim\n(Amendment No 2), para 26(8)(b). [note: 108]Defendants’ closing\nsubmissions, paras 121–122. [note: 109]Plaintiffs’\nclosing submissions, paras 37, 53 and 161."
    }
}