{
    "case_title": "Loh Siew Hock and others\n      v\n      Lang Chin Ngau",
    "ncitation": "[2014] SGHC 191",
    "coram": "Tan Siong Thye JC (as he then was)",
    "sections": {
        "Introduction": "1       The plaintiffs and the defendant are members of\n                    the Char Yong (Dabu) Association (“CYA”). This dispute relates to\n                    the plaintiffs’ allegation that the defendant had made certain defamatory\n                    statements about them during the election of the 35th Management Council for CYA\n                    in December 2012. They claim that the statements had the effect of lowering the\n                    plaintiffs’ standing in the eyes of the right thinking members of the\n                    public. 2       At the close of the plaintiffs’ case, the\n                    defendant’s counsel, Mr Quek Mong Hua (“Mr Quek”) submitted\n                    that there was no case to answer. He argued that the statements in question were\n                    not defamatory. Alternatively, the defendant sought to rely on the defences of\n                    fair comment and qualified privilege if the statements were found to be\n                    defamatory.",
        "Implication of the defendant’s submission of no case to\n                answer": "3       Before I deal with the above issues, I would\n                    like to address the implication of the defendant’s submission of a no case\n                    to answer at the close of the plaintiffs’ case. I had previously dealt\n                    with the principles applicable to a no case to answer submission inLena Leowardi v Yeap Cheen Soo[2014] SGHC 44 at\n                    [18]–[22]. When the defendant mounted a no case to answer submission, he\n                    in effect elected not to call evidence. The result is that the plaintiffs only\n                    need to make out aprima faciecase to succeed in\n                    the suit. Furthermore, I must assume that any evidence led by the plaintiffs is\n                    true, unless it is inherently incredible or out of all common sense or\n                    reason. 4       Nevertheless, this does not free the plaintiffs\n                    from their burden of proof. They must still prove all the essential elements of\n                    their claim based on the totality of their evidence although this is subject to\n                    the court’s minimum evaluation. Bearing these principles in mind, I shall\n                    proceed to deal with the substantive issues.",
        "Facts": "5       The background of this case is important for a\n                    full appraisal of the issues which I shall deal with shortly. The origin of the\n                    dispute arose from the affairs of the Hakka Clan Association in the course of\n                    the election of office bearers for the 35thCYA Management Council.",
        "Char Yong (Dabu) Association": "6       CYA is a Hakka Clan association founded in 1858\n                    to benefit and educate its Hakka members. This includes the provision for needy\n                    Hakka elders and the award of scholarships for Hakka students. CYA also engages\n                    in other charitable and educational causes.[note: 1]CYA established Char Yong (Dabu)\n                    Foundation (“CYF”), a separate entity registered as a charity to\n                    administer these charitable activities.[note: 2] 7       As stated in the CYA’s Constitution,\n                    CYA’s members are restricted to Singaporean Hakkas whose ancestral home is\n                    in Char Yong (Dabu) District, China.[note: 3]CYA’s\n                    affairs are managed by its Management Council, which consists of 41 people. Out\n                    of the 41 members on the Management Council, 35 of them are elected directly by\n                    CYA members with the remaining 6 members co-opted by the elected\n                        members.[note: 4]Prior to the election of the 35th Management\n                    Council in December 2012, the first, second and third plaintiffs, as well as the\n                    defendant, were all members of CYA’s 34th Management Council.[note: 5]",
        "Char Yong (Dabu) Foundation": "8       CYF was established in 1995 with the primary\n                    purpose of promoting educational and other charitable activities. It did so by\n                    managing the assets of CYA, which it held on trust in furtherance of those\n                    charitable activities. Since 30 June 2012, CYF held a sum of $91,611,554\n                    (“the $90m fund”) under a charitable purpose trust created by\n                    CYA. 9       CYF and its assets are managed by CYF’s\n                    board of directors, which consists of 17 directors. All 17 directors were\n                    initially appointed from CYA’s Management Council. However, after an audit\n                    conducted in April 2010, it was recommended that for the purposes of good\n                    governance, CYF’s board of directors should be restructured to include\n                    independent directors who were not part of CYA’s Management Council. In\n                    response to this, CYF’s management was restructured in 2011.[note: 6]Out of 17\n                    directors, 10 are now appointed from CYA’s Management Council\n                    (“related directors”) and seven are independent directors who are\n                    not members of CYA’s Management Council (“non-related\n                        directors”).[note: 7]These independent directors do not\n                    necessarily have to be CYA members and Char Yong (Dabu) District, China, does\n                    not necessarily have to be their ancestral home. During the December 2012\n                    election, the first three plaintiffs and the defendant were all related\n                    directors of CYF while the fourth plaintiff was a non-related director of\n                        CYF.[note: 8]",
        "The election of the 35th Management Council": "10     The election of the 35th Management Council\n                    was held on 9 December 2012 and 56 CYA members were nominated as candidates.\n                    They were to be elected by the other CYA members to fill 35 elected seats in the\n                    35th Management Council.[note: 9]Out of these 56 candidates, 39 were returning\n                    members from the 34th Management Council which the first to third plaintiffs and\n                    the defendant were part of. 11     Despite campaigning in teams, candidates had\n                    to be elected individually. The plaintiffs and the defendant had initially\n                    campaigned together as part of a team of returning members of the 34th\n                    Management Council (“the 34th Management Council\n                        team”).[note: 10]Later, a disagreement arose between the\n                    defendant and some of the other returning members of the 34th Management Council\n                    regarding the composition of the team. The third plaintiff was among the members\n                    with whom the defendant disagreed. As a result, the defendant withdrew from the\n                    34th Management Council team[note: 11]and instead campaigned separately\n                    as the leader of another group of candidates.[note: 12] 12     As a result, there were two teams competing in\n                    the election. One was the 34th Management Council team led by the third\n                    plaintiff which included the other plaintiffs. The other was led by the\n                        defendant.[note: 13]However as the\n                    defendant’s team did not have enough candidates to fill up all 35 elected\n                    seats in the Management Council, it also included the fourth plaintiff in its\n                    list of 35 recommended candidates.[note: 14]",
        "The defamatory statements": "13     During the course of the defendant’s\n                    election campaign, a meeting was organised at the Nanyang Khek Community Guild\n                    on 2 December 2012 for around 100 CYA members.[note: 15]The defendant spoke at this\n                    meeting about the need to protect the $90m fund, which was held on trust by CYF\n                    for the benefit of CYA, and to prevent it from falling “into the hands of\n                        outsiders”.[note: 16]A flyer was also distributed to the CYA\n                    members present at the meeting which summarised the contents of the\n                    defendant’s speech (“the Flyer”). It stated, in\n                        Chinese:[note: 17] In order to defend the dignity of the people of Char Yong Dabu clansmen\n                        and to ensure that theassets of our Char Yong Dabu\n                            Association and its ninety million in funds do not fall into the hands\n                            of outsiders, we sincerely hope that fellow Dabu townsmen\n                        that have a conscience will vote for us. [emphasis added] 14     On the day of the election,ie, 9 December 2012, the defendant, together with his team and\n                    their supporters, distributed copies of a brochure (“the\n                    Brochure”) together with copies of the Flyer to CYA members that were\n                    present at the voting premises. The Brochure stated, in Chinese:[note: 18] To better safeguard the Association’s Ninety-Six\n                            Million in Foundation Assets Strictly prohibit the carving-out of the Association’s Foundation\n                        Assets to be an Independent Entity … [emphasis added]",
        "Interview of the defendant by Shin Min Daily": "15     Subsequently, in an interview published in the\n                    Shin Min Daily on 19 December 2012 (“the Interview”), it was\n                    reported, in Chinese, that the defendant stated: [The defendant] said during an interview that when he said he didn’t\n                        “want to let the Association’s money fall into the hands of\n                        outsiders”, he was not making personal attacks on the seven\n                        independent council members, but was merely saying that the main\n                        directorship should remain within the Association.",
        "The dispute": "16     It is the plaintiffs’ case that the\n                    statements which were made in the Flyer, the Brochure and the Interview were\n                    defamatory. As a result, the plaintiffs’ standing in the eyes of\n                    right-thinking members of the public was adversely affected. The defendant\n                    submitted that those statements were not defamatory and that they did not refer\n                    to the plaintiffs. He also submitted that if the court found the statements\n                    defamatory, he should be protected under the defences of fair comment and\n                    qualified privilege.",
        "The issues": "17     The above dispute raises the following\n                    issues: (a)     Were the statements in question\n                        defamatory? (b)     Did\n                        the defendant publish or cause to be published the alleged defamatory\n                        statements? (c)     Did\n                        the defamatory statements refer to the plaintiffs? (d)     Could the defendant rely on the\n                        defence of qualified privilege in the light of s 14 of the Defamation\n                        Act (Cap 75, 2014 Rev Ed) (“the Act”), which forbids the use\n                        of the qualified privilege defence in electoral\n                    situations? (e)     Was the\n                        defence of fair comment established?",
        "Were the statements in questions defamatory?": "18     As stated in Gary K Y Chan and Lee Pey Woan,The Law of Torts in Singapore(Academy\n                    Publishing, 2011) (“The Law of Torts in\n                        Singapore”) at p 451, aprima\n                        faciecase of defamation is made out when the following legal\n                    requirements are satisfied: (a)     the statement is defamatory in\n                        nature; (b)     the\n                        statement refers to the plaintiff; and (c)     the statement is published or caused to be published by\n                        the defendant. 19     The defendant argued that the first two\n                    requirements were not fulfilled in relation to the statements in the Brochure,\n                    the Flyer and the Interview. He also submitted that the requirement of\n                    publication had not been met in relation to the statement made in the Flyer. As\n                    such, I shall address the requirement of publication which he said was\n                    unfulfilled only in relation to the statements made in the Flyer. Thereafter I\n                    shall deal with the first two requirements which are common to the statements\n                    made in the Brochure, the Flyer and the Interview.",
        "Was the statement in the Flyer published or caused to be published by\n                the defendant?": "20     It is trite law that anyone who participates\n                    directly or vicariously in the publication of a defamatory statement is jointly\n                    and severally liable for the statement regardless of the extent of his\n                    involvement. This is succinctly explained inGatley on Libel\n                        and Slander(Alastair Mullis & Richard Parker eds) (Sweet\n                    & Maxwell, 12th Ed, 2013) at paras 6.10 to 6.11: The person who first spoke or composed the defamatory matter (the\n                        originator) is of course liable, provided he intended to publish it or\n                        failed to take reasonable care to prevent its publication. However, at\n                        common law liability extends to any person who participated in, secured, or\n                        authorised the publication (even the printer of the defamatory work)\n                        … 21     Thus in accordance with general principle, all\n                    persons who procure or participate in the publication of the libel are jointly\n                    and severally liable for the whole damage suffered by the claimant. In the case\n                    of a newspaper, the journalist, editor and publisher are all joint\n                    tortfeasors. 22     The plaintiffs submitted that the defendant\n                    either published or caused the statements in the Flyer to be published. In\n                    support of his case, PW3, Mr Kuan Ngee Ser, testified that the defendant gave a\n                    speech on 2 December 2012 at the Nanyang Khek Community Guild. In that speech,\n                    the defendant said that the $90m fund must not fall in the hands of outsiders:[note: 19] Mr Quek.I will come back to this shortly, but you\n                                            were trying to tell us, halfway, what you heard Mr Lang\n                                            Chin Ngau, the defendant, spoke at the meeting on 2\n                                            December. Can you please\n                                    elaborate?A.So I continue? He mentioned that the $90\n                                            million must not “fall into the hands of\n                                            outsiders”. He spoke fervently. It was only then\n                                            that I got to know of this matter … I questioned,\n                                            was there such a thing?   23     PW1, Mr Joseph Liew, also said the Flyer was\n                    distributed on the day of the election,ie, 9\n                    December 2012, in the presence of the defendant while the Brochure was given to\n                    PW3 by the defendant. The defendant did not take steps to dissociate himself\n                    from the Flyer. The contents of the Interview were similar to the statements in\n                    the Flyer and Brochure. The above showed that the defendant intended to convey\n                    the message of the statements to CYA members during the electoral campaign.\n                    Thus, the plaintiffs submitted there is aprima\n                        faciecase that the statements in the Flyer were published on\n                    behalf of the defendant and his team for the purpose of their electoral\n                    campaign. 24     The defendant does not dispute the requirement\n                    of publication in relation to the Brochure. However, he submitted that the\n                    plaintiffs had failed to prove the requirement of publication in relation to the\n                    distribution of the Flyer on 2 December 2012. He denied that he had published\n                    the Flyer or caused it to be published. He also submitted that he did not\n                    authorise, procure or participate in the publication of the Flyer. 25     In my view, the evidence indicated that the\n                    defendant had knowledge of the Flyer and its contents. Moreover, the alleged\n                    defamatory statements in the Brochure and the Flyer were also similar. The\n                    defendant also did not dispute the issue of publication for the\n                Brochure. 26     My finding that the Flyer had been published\n                    by the defendant is also supported by the testimonies of the plaintiffs’\n                    witnesses. PW3 testified that the defendant gave him the Flyer. PW1 said the\n                    Flyer and Brochure were distributed on the day of the electionie, 9 December 2012, in the presence of the defendant.\n                    No effort was made by the defendant to dissociate himself from the contents of\n                    the Flyer (see [23] above). 27     Moreover, the contents of the Interview were\n                    also similar to the statements in the Flyer and Brochure. This showed that the\n                    defendant intended to convey the message of the statements to CYA members during\n                    the electoral campaign. Thus, there is aprima\n                        faciecase that the Flyer was also published on behalf of the\n                    defendant and his team for the purpose of their campaign for votes. I am unable\n                    to accept that the defendant did not authorise, procure or participate in the\n                    publication of the flyer.",
        "Did the statements refer to the plaintiffs?": "28     The next issue I have to decide is whether the\n                    statements made in the Flyer, the Brochure and the Interview referred to the\n                    plaintiffs. In the course of the proceedings, from the testimonies of the\n                    witnesses, I found that the plaintiffs’ position at trial was different\n                    from their pleaded case. In their statement of claim, they stated that the\n                    context of the statements meant that the plaintiffs were remiss in their duties\n                    while serving on the CYF’s Board of Directors.[note: 20]However at trial,\n                    they appeared to suggest that the election was a contest between the\n                    defendant’s team and the plaintiffs’ team and the statements\n                    referred to them in the context of the elections. This latter version is not the\n                    plaintiff’s pleaded case. Moreover, the fourth plaintiff was also in the\n                    defendant’s team. The premise on which I will proceed is on the\n                    plaintiffs’ pleaded case. 29     The law on the issue that the defamatory\n                    statements must refer to the plaintiff is settled and the Court of Appeal inReview Publishing Co Ltd and another v Lee Hsien Loong\n                        and another appeal[2010] 1 SLR 52 (“Review Publishing”) at [48]–[49] held that: 48    It is trite law that, to succeed in an action for\n                            defamation, the plaintiff must prove not only that the defendant\n                            published the offending words, but that those words were publishedof the plaintiff\n                        … 49The test is\n                                anobjectiveone, and it is simply whether the ordinary reasonable\n                                person who, at the material time, was aware of the relevant\n                                circumstances or special facts (if any) would reasonably understand\n                                the plaintiff to be referred to by the offending words… InA Balakrishnan v Nirumalan K\n                                Pillay[1999] 2 SLR(R) 462 (\"A Balakrishnan\"), this court held that, having regard to\n                            the article which contained the offending words and the publicity given\n                            to the plaintiffs as members of an organising committee that had\n                            organised an event called \"Tamil Language Week\" (which was the subject\n                            matter of that article), a reasonable person who was acquainted with the\n                            plaintiffs, on reading the article, would come to the conclusion that\n                            the offending words referred to the plaintiffs even though the\n                            plaintiffs were not expressly identified in the article. It follows from\n                            the decision inA Balakrishnanthat\n                            the plaintiff need not be expressly referred to by name in the offending\n                            words; it is also immaterial whether or not the defendant intended to\n                            refer to the plaintiff … [emphasis in bold] The court has to apply the objective test as advocated by the\n                        Court of Appeal inReview Publishingto\n                        determine whether “the ordinary reasonable person who, at the\n                        material time, was aware of the relevant circumstances or special facts (if\n                        any) would reasonably understand the plaintiff[s] to be referred to\n                        by” the statements in the Flyer, Brochure and the\n                    Interview. 30     The statements were part of the\n                    defendant’s election campaign manifesto to appeal to the CYA\n                    members’ conscience to safeguard and protect CYA’s assets. This was\n                    to ensure that the $90m fund would not fall into the hands of outsiders. The\n                    statements also made no reference to the CYF Board of Directors or the\n                    CYA’s Management Council. In such circumstances, could the statements\n                    indirectly or by inference point to the plaintiffs as CYF’s board of\n                    directors. Could the statements suggest that they had breached, neglected and/or\n                    abdicated their duties as pleaded in the Statement of Claim? 31     I find that the plaintiffs’ submission\n                    that the statements were directed at the incumbent CYF board is not supported by\n                    the evidence. Firstly, the defendant and six of his endorsed candidates formed\n                    the majority of the ten main CYF board members.[note: 21]In the circumstances, it would seem\n                    incredible for the defendant to defame himself with the statements especially\n                    since the plaintiffs’ case was that the statements alleged that they were\n                    in “breach of, neglected and/or abdicated their\n                        duties”.[note: 22] 32     Secondly, eight board members and the fourth\n                    plaintiff who was the independent director were elected to the 35th CYA\n                    Management Council. This indicated that CYA members could not have interpreted\n                    the statements as defamatory against the incumbent CYF board. Nine out of the\n                    eleven board members who stood for the election were elected. PW1, the treasurer\n                    of the board, had secured the highest number of votes. The overwhelming results\n                    showed that the statements did not have any defamatory effect and could not have\n                    referred to the CYF board. 33     For the purpose of addressing whether the\n                    statements were directed at the plaintiffs expressly or impliedly, I am of the\n                    view that the statements referred to the possible risk that the $90m fund might\n                    fall into the hands of outsiders if no positive action is done to avert it. No\n                    ordinary reasonable member of CYA who was aware of the circumstances would\n                    reasonably understand or conclude that the statements referred to the\n                    plaintiffs. In fact, the defendant in the Interview had clarified that the\n                    statements were not personal attacks against the seven independent directors.\n                    Thus the plaintiffs have failed to prove on aprima\n                        faciebasis that the statements referred to them. 34     On this ground alone, the plaintiffs’\n                    case can be dismissed. Nevertheless, I shall proceed to ascertain whether the\n                    statements are defamatory in their natural and ordinary sense as well as to give\n                    my findings on the other issues in this case.",
        "What was the meaning of the statements?": "35     Whether a statement is defamatory depends on\n                    its natural and ordinary meaning assessed objectively. For this, reference is\n                    usually made to the ordinary, reasonable and reasonably interested person. In\n                    this regard, the Court of Appeal decision inChan Cheng Wah\n                        Bernard and others v Koh Sin Chong Freddie and another appeal[2012] 1 SLR 506 (“Bernard Chan”) is\n                    instructive as it also dealt with the scenario whereby statements were\n                    distributed to members of an association. The Court of Appeal held at [19] and\n                    [26] that: 19    … theclass of\n                                readeris relevant in determining the scope of\n                            possible meanings the publication may bear… For example,\n                                inRees v Law Society\n                                Gazette(2003)…Gray J noted that a solicitor\n                            reading the UK's Law Society Gazette is less prone to \"loose\n                            thinking\" than the average ordinary reader. In the context of the\n                            present case where the statements were contained in the minutes of the\n                            Club's MC meetings and which were published principally to Club members,\n                            the \"ordinary reasonable person\" would be, as the Judge had held at [29]\n                            of the Judgment,the ordinary reasonable and\n                                interested Club member possessing general knowledge of the affairs\n                                of the Club.It should be noted that this view\n                                isnotcontested by the\n                            Defendant in this appeal. … 26    In this regard,we would stress\n                                that the person from whose perspective one should gauge the sense of\n                                a statement is not that of any ordinary Club member but that of an\n                                ordinary, reasonable, and reasonably interested Club member\n                                (\"reasonably interested member\"). Such a member would\n                            likely have attended the Club's AGMs, or have at least acquainted\n                            himself with the pertinent issues that are to be decided at these\n                            meetings. He would also have been generally aware of information\n                            disseminated on the Club's notice boards, including minutes of MC\n                            meetings, as the Defendant had himself acknowledged that \"it is\n                                along-standing practiceof\n                            the Club for the minutes of the MC meetings to be posted on the Club's\n                            notice board to inform members and staff of the Club on issues,\n                            discussions and decisions of the MC affecting or relevant to the Club\".\n                            … [emphasis in original in italics; emphasis added in bold] 36     Both the plaintiffs and the defendant accept\n                    this legal proposition. They agree that the appropriate reference point to take\n                    is that of the ordinary, reasonable and reasonably interested CYA member.\n                    However, they differ as to what meaning such a CYA member would ascribe to the\n                    statements in question. The plaintiffs urged the court “to take into\n                    account inferences or implications that the ordinary reasonable person may draw\n                    from those words in the light of his general knowledge, common sense and\n                        experience”.[note: 23]They\n                    submitted that the statements in the Flyer, which called for CYA members to vote\n                    for the defendant so that the $90m fund “[does] not fall into the hands\n                    of outsiders”, suggested that the then CYF board of directors, which\n                    included the plaintiffs, had mismanaged the $90m fund. They alleged that the\n                    defamatory statements in the Flyer and Brochure therefore “cast doubt on\n                    the competence, honesty and integrity of the then CYF Board.”[note: 24] 37     In their submissions, the plaintiffs placed\n                    special emphasis on the use of the word “conscience” which was a\n                    translation of the actual Chinese word “liang zhi”. Although the\n                    defendant disputed such a translation, I note that such a translation was\n                    provided by the PW4, Mrs Chin-Paur Yow Hoy, a qualified translator. Hence I\n                    accept PW4’s translation. 38     According to the plaintiffs, the defendant\n                    urged CYA members to use their “conscience” to vote in the Flyer\n                    suggested that there was some misconduct on the part of the directors of CYF in\n                    managing the $90m fund. The third plaintiff even alleged that the statements\n                    indicated that the $90m fund had already fallen into the hands of outsiders. He\n                    further added that the funds had gone missing. These were the third\n                    plaintiff’s responses during cross-examination:[note: 25] Mr Quek… Can you point out to the\n                                            interpreter which part of the statement says it has\n                                            already dropped into the hands of\n                                        outsiders.A.You should read the two sentences\n                                            together. It’s actually appealing to members with\n                                            a conscience to support them, okay? If the monies had\n                                            not fallen into the hands of others, it would not\n                                            necessary to put down these two words “liang\n                                            zhi”,\n                                    “conscience”.…A.Firstly, it is appealing to members with\n                                            a conscience to judge whether it’s right or wrong.\n                                            Because the funds have already fallen into the hands of\n                                            others, that’s why they’re appealing to\n                                            members with conscience to support his team in getting\n                                            back the funds.…QYes, but what is the meaning of the money\n                                            going to the hands of the outsiders? What do you mean by\n                                            that?AIt means that the funds in the foundation\n                                            had gone missing.   39     The second plaintiff said that the statement\n                    alleged that the CYF Board of Directors were remiss in their duties during\n                        cross-examination:[note: 26] Mr Quek.My question was, what was your most\n                                            immediate concern about this\n                                    flyer?A.Firstly, I was most concerned with the\n                                            word “fallen into the hands of outsiders”.\n                                            It implied that the directors had failed in their\n                                            duties. I’m talking about the flyer. And then also\n                                            because of the word used, the word\n                                            “liangzhi”,\n                                    conscience.   40     The plaintiffs also argued that such a meaning\n                    is further reinforced by contents of the Brochure, which contained the words\n                    “to better safeguard the Association’s Ninety-Six Million in\n                    Foundation Assets”. This seemed to suggest that the funds were either\n                    lost or under threat. It was therefore the plaintiffs’ submission that the\n                    words “do not fall into the hands of outsiders” meant that the\n                    funds were already in the hands of outsiders. Therefore there was a need to\n                    “better safeguard” the funds by recovering them. As a result, the\n                    plaintiffs alleged that they were defamed as this suggested misconduct on the\n                    part of CYF board of directors. 41     I find that the plaintiffs’\n                    interpretation of the statements at trial, that the statements suggested that\n                    the funds had already fallen into the hands of outsiders, is not only\n                    unsupported by the natural and ordinary meaning of the words complained of but\n                    it had also gone beyond their pleaded case (see below at [42] for their pleaded\n                    case). The Court of Appeal inReview Publishingstated that the plaintiff is bound by his pleadings (at [130]): For all of the above reasons, we prefer Diplock LJ's view in [Slim v Daily Telegraph Ltd [1968] 2 QB 157],viz, that, where the plaintiff has chosen\n                        to set out in his SOC the particular defamatory meaning which he contends is\n                        the natural and ordinary meaning of the offending words, \"the defamatory\n                        meaning so averred is treated at the trial asthe most\n                            injurious meaningwhich the words are capable of bearing\"\n                        [emphasis added] (Slimat 175). As we said\n                        earlier, the plaintiff must be the best person to know the sting of the\n                        alleged libel concerning him. He should thus be bound by the meaning which\n                        he has pleaded, subject to any change brought about by an amendment to his\n                        SOC so as to plead a more defamatory or variant meaning from that originally\n                        pleaded. 42     In their pleaded case, the plaintiffs had\n                    stated that their claim was brought on the basis that they were “in\n                    breach of, neglected and/or abdicated their duties as directors of CYF\n                        …”[note: 27]That the funds were already in the hands of\n                    outsiders (see [40] above) was not pleaded in its Statement of Claim. Therefore\n                    the plaintiffs’ aggravated interpretation of the statements at trial that\n                    the funds had fallen into the hands of others was not supported by their\n                    pleadings and must fail. I shall proceed to examine the natural and ordinary\n                    meaning of the statements based on the plaintiffs’ pleaded\n                case.",
        "The law in relation to the construction of words": "43     It is instructive to refer to the Court of\n                    Appeal decision inBernard Chanwhich set out the\n                    general principles regarding the construction of words based on their natural\n                    and ordinary meanings at [18]: The general principles applicable to the construction of\n                        words based on their natural and ordinary meanings are as follows: (a) the natural and ordinary meaning of a word is that which is\n                            conveyed to an ordinary reasonable person; (b) as the test is objective, the meaning which the defendant intended\n                            to convey is irrelevant; (c) the ordinary reasonable reader is not avid for scandal but can\n                            read between the lines and draw inferences; (d) where there are a number of possible interpretations, some of\n                            which may be non-defamatory, such a reader will not seize on only the\n                            defamatory one; (e) the ordinary reasonable reader is treated as having read the\n                            publication as a whole in determining its meaning, thus \"the bane and\n                            the antidote must be taken together\"; and (f) the ordinary reasonable reader will take note of the circumstances\n                            and manner of the publication. 44     On the general principles espoused by the\n                    Court of Appeal, I find that the words “ensure that the assets and $90\n                    million funds of Char Yong Dabu Association do not fall into the hands of\n                    outsiders” were not defamatory and were merely made to alert CYA members\n                    to such a future possibility. The words “to better safeguard”\n                    might just be a call for improvement. This is not necessarily premised upon the\n                    fact that the circumstances at that time were unsatisfactory. Improvements could\n                    still be made even if the circumstances were satisfactory. 45     The above interpretation is also supported by\n                    the circumstances. The management and control of the $90m fund in the context of\n                    the election are relevant. This holistic approach is recommended by the Court of\n                    Appeal inJeyasegaram David (alias David Gerald Jeyasegaram)\n                        v Ban Song Long David[2005] 2 SLR(R) 712(“Jeyasegaram David”)at [27]: In determining the meaning of the words alleged to be defamatory,a holistic approach had to be adopted, as\n                        it was the broad impression conveyed by the alleged libel that fell to be\n                        considered, and not the meaning of each word or sentence under\n                        analysis. [emphasis added] The management and control of the $90m fund 46     With respect to CYF’s affairs, I note in\n                    particular that there was a significant restructuring of the CYF’s board\n                    of directors in 2011. For better governance, seven independent directors who\n                    might not be of Char Yong (Dabu) heritage were included in the board of\n                    directors. This gave rise to some concerns regarding the role of the external\n                    individuals in the handling of the $90m fund held on trust and managed by CYF.\n                    During cross-examination, PW1 also stated that the second plaintiff suggested at\n                    a CYF Annual General Meeting (“AGM”) that CYF should be\n                    “totally independent” from CYA. He also said that the funds should\n                    be held by CYF independently rather than on trust.[note: 28]This was held on 7 October\n                    2011 prior to the election. 47     In light of this, I find that the ordinary,\n                    reasonable CYA member who was reasonably interested would have been concerned\n                    about the management and control of the funds held by CYF. As admitted by the\n                    first plaintiff during cross-examination:[note: 29] Mr Quek.The Char Yong Foundation was started to\n                                            manage the big sum of money belonging to Char Yong\n                                            Association for charitable\n                                    purposes?A.Yes.Q.So long as the charitable purposes are in\n                                            line with the objects, the beneficiaries of this charity\n                                            need not be Hakka people?A.That’s\n                                    right.Q.Nevertheless, it is in the interests of\n                                            the Char Yong Association members to want to remain in\n                                            control of how this charity is to be managed? Am I\n                                            right?A.Yes.Q.It is also in the interests of members to\n                                            want to continue the education of future generations\n                                            about their rich heritage?A.Yes.Q.One of these important aspects will be to\n                                            maintain the close association between the Char Yong\n                                            Association and the Char Yong\n                                    Foundation?A.Yes.   48     Therefore, a reasonably interested CYA member\n                    would have been interested in the issue relating to the management and control\n                    of the $90m fund held by CYF. However, different CYA members might have taken\n                    different views as to how the $90m fund should be handled. Some might have been\n                    of the view that there should be no independent directors managing the funds.\n                    This responsibility should be born only by CYA Management Council members who\n                    are Hakka and are of Char Yong (Dabu) heritage. Such CYA members would also want\n                    the funds to be held on trust and they might be regarded as the more\n                    conservative members. On the other hand, some might be more liberal. They might\n                    be of the view that more independent directors who are not Hakka and not of Char\n                    Yong (Dabu) heritage may be introduced, so long as they could manage the funds\n                    well. These liberal members might also be of the view that CYA does not have to\n                    be in control of the funds and that CYF can hold the funds independently. Such\n                    differences among the members may be gleaned from the cross-examination of the\n                    fourth plaintiff:[note: 30] Mr Quek.Your Honour, the three categories, I say,\n                                            they are on the left side, which is the extremists; no\n                                            matter how, they want only Hakkas.\n                                        ……Q.Then, on the right side, are those that\n                                            are very liberal. They say, “No need at all, so\n                                            long as they make money for us”. The centre group\n                                            is, “Controlled by Hakka, but can use the\n                                            non-Hakkas to help us make money.” So to be\n                                            clear, from your answer, it seems like you are on the\n                                            right side?A.Your Honour, if you are talking of\n                                            non-Hakkas, we can accept the person. But you are\n                                            talking about control, that’s another\n                                            matter.Q.No, I just asked you a simple question,\n                                            as to which of the three groups do you identify with as\n                                            belonging to?A.I’m the more liberal-minded\n                                            type.   49     This was further clarified during the course\n                    of the cross-examination of the fourth plaintiff:[note: 31] Mr Quek.… Let’s, for once, make it\n                                            very clear, okay? We have the conservative group on the\n                                            left, conservative: no matter how Hakka. Then, on the\n                                            right, we have the liberals: so long as can make money\n                                            for us, it’s okay. Make money for the foundation,\n                                            that is, not for the association, all right? Then the\n                                            middle is the moderates. The moderates are the people\n                                            who say: foundation be under the control of Hakkas but\n                                            we can use some non-Hakkas to help us make money\n                                            ……Q.… With these three categories, the\n                                            conservative, the moderate, the liberal, are you still\n                                            liberal?A.In my view, this is a little confusing.\n                                            You have to be liberal in these times. There’s no\n                                            differentiation with race.Q.Yes -- we are not talking even of dialect\n                                            group?A.Whether it’s Hakkas or non-Hakkas,\n                                            as long as they can bring benefits to the foundation.\n                                            But control of funds ultimately lies with the\n                                            association.   50     It is therefore clear that the management and\n                    control of funds was an important issue that would interest and might divide the\n                    CYA members. Even though the issue related to the funds held by CYF, it cannot\n                    be divorced from the operations of CYF, which are closely related to the affairs\n                    of CYA. This is because CYF was established for the primary purpose of\n                    furthering CYA’s charitable objectives. Furthermore, it can also be seen\n                    from the Interview that the defendant adopted a more conservative view when he\n                    stated that “the main directorship [of CYF] should remain within\n                    [CYA].” The election context 51     The issue as to the management and control of\n                    funds held by CYF would be of concern to the ordinary, reasonable and reasonably\n                    interested CYA member. This would also be of special concern to an ordinary CYA\n                    member when electing the members of the CYA Management Council as: (a)     It is for the CYA Management Council\n                        to decide whether to allow CYF to hold the funds\n                    independently. (b)     The\n                        related directors, who constitute a majority of the CYF board of directors,\n                        are CYA Management Council members. (c)     The related directors have the final say in the\n                        restructuring of CYF’s board of directors to include more independent\n                        directors. 52     The statements urged CYA members to retain\n                    control of the $90m fund so that it would not fall into the hands of outsiders.\n                    It is logical that a conservative CYA member would after hearing the statements\n                    be more inclined to vote for a fellow conservative. My findings on the natural and ordinary meaning of the\n                statements 53     The statements in question must be interpreted\n                    in the light of the context described above. I am of the view that the statement\n                    in the Flyer was simply a call by the defendant for CYA members to ensure that\n                    the $90m continues to be in the control of CYA. The words “ensure that\n                    the assets and $90m funds of Char Yong Dabu Association do not fall into the\n                    hands of outsiders” simply meant that the defendant appealed to members\n                    of CYA not to accept the suggestion made at the October 2011 AGM that the $90m\n                    fund be an outright gift to CYF for it toindependentlymanage the fund. The CYF is not totally comprised\n                    of Hakka and Char Yong (Dabu) heritage. It has a board of directors consisting\n                    of ten members of CYA’s Management Council and seven independent\n                    directors. The seven independent directors may not be Hakka or of Char Yong\n                    (Dabu) heritage. Thus they could be described as “outsiders” as\n                    they lacked ties with CYA. The voters could “ensure” that their\n                    conservative interests were advanced by voting conservative CYA members into the\n                    35th Management Council. They could be assured that these members would not\n                    adopt a liberal policy in relation to the management and control of the funds\n                    held by CYF. 54     It was also in this light that the defendant\n                    appealed to the “conscience” of the CYA members. He was asking\n                    them to vote wisely while being aware of the need to preserve their Char Yong\n                    (Dabu) heritage. This was possibly the principal reason for adopting a\n                    conservative stance towards the issue of the management and control of CYF\n                    funds. This then explained why the words “to protect the dignity of the\n                    people of Char Yong Dabu Association” were used in the\n                Flyer. 55     Similarly, the exhortation to “better\n                    safeguard” the funds held by CYF in the Brochure was also a plea for\n                    members to vote conservative candidates into the 35th Management Council. This\n                    was made especially clear by the follow up statement which read\n                    “[s]trictly prohibit the carving-out of the Association’s\n                    Foundation Assets to be an Independent Entity” which was a call for the\n                    CYA members to oppose the idea that CYF should hold the funds independently of\n                    CYA. This also ties in with the appropriate interpretation of the statement in\n                    the Flyer, which was distributed together with the Brochure. 56     The first plaintiff in his unguarded moments\n                    candidly revealed his true understanding about the statements. Under\n                    cross-examination, he indicated that he would not have found the statements to\n                    be defamatory if they had been made at a board of directors meeting:[note: 32] A.The team led by the defendant, especially\n                                            the defendant himself. If they had raised these issues\n                                            in the past, during board meetings, I would not have an\n                                            issue with it, but they chose to distribute this on the\n                                            day of the election.Mr Quek.So you agree that these are issues that\n                                            could be raised but you are saying the timing that\n                                            it’s raised is\n                                    inappropriate?A.Yes, that’s what I meant by wrong\n                                            time, wrong place, wrong action.Q.At the right time, they are valid\n                                            issues?A.No, it depends on – at what\n                                            place.Q.I’m afraid I don’t understand\n                                            why you must look at the place. Can you just\n                                            explain?A.Let me explain. Let me put it this way,\n                                            if this issue was raised at a board of directors meeting\n                                            held in the conference room of Char Yong Association, I\n                                            have no issue with that.   57     If the plaintiffs were of the view that the\n                    statements indicated a mismanagement of funds, a fact that was entirely untrue,\n                    why would they condone such allegations being made at a board meeting? They\n                    would still be defamatory since they would be false allegations of misconduct or\n                    mismanagement of funds. I was therefore not surprised that after an adjournment\n                    of the trial proceedings, the first plaintiff realised the implication of his\n                    earlier answers and retracted his position. He said that he would still have\n                    taken issue with the making of the statements even if they were made at a board\n                    of directors meeting. I am of the view that this was an\n                afterthought. 58     The first plaintiff probably also regarded the\n                    statements as referring to the management and control of the funds held by CYF\n                    above. He must have felt that such an issue was better dealt with behind closed\n                    doors given its divisive nature and the impact that it might have on the\n                    election. That would explain why he would have been amenable to having the issue\n                    aired at a board of directors meeting rather than during the course of the\n                    election. It is telling of the weakness of the plaintiffs’ case that even\n                    the first plaintiff was aware that the statements pertained to the management\n                    and control of funds rather than the alleged insinuation of a mismanagement of\n                    funds. 59     I therefore do not agree with the plaintiffs\n                    that the statements suggested a mismanagement of funds. Hence the statements\n                    could not mean “that the funds in the foundation had gone\n                        missing”.[note: 33]Neither could the statements\n                    mean that “the assets … had fallen into the hands of\n                        outsiders”.[note: 34]An ordinary,\n                    reasonable and reasonably interested CYA member with an understanding of the\n                    issue relating to the management and control of funds held by CYF would not have\n                    interpreted the statements as suggesting a mismanagement of funds or that the\n                    funds had already fallen into the hands of outsiders. Such a CYA member would\n                    have understood the defendant as merely appealing to the members to vote\n                    conservative candidates into the 35th Management Council to oppose the idea that\n                    CYF should hold the funds independently of CYA. The statements were thus\n                    non-defamatory. 60     I would also like to point out that the\n                    defendant was part of the CYF’s board of directors at the time the\n                    statements were made. It would have been absurd for him to make the statements\n                    that defamed the CYF’s board of directors at a time when he was competing\n                    at the election, especially when he was the leader of his campaigning team (see\n                    also [30] above). That would have meant that he was lowering his own standing\n                    amongst CYA members as well. The plaintiffs contended that the defendant did\n                    this out of desperation. There was no evidence to suggest that the defendant\n                    would have taken such desperate and illogical measures. Moreover, the defendant\n                    had endorsed eight members of the CYF board of directors, including the fourth\n                    plaintiff, as members of his team in his list of 35 recommended candidates for\n                    the 35th Management Council election. It would seem highly improbable that the\n                    defendant would defame the candidates he recommended to the voters. I cannot\n                    accept such a submission.",
        "The opinion of CYA members regarding the statements": "61     The plaintiffs called two CYA members, namely\n                    PW1 and PW3, to give their views on their understanding of the statements. They\n                    opined that the statements were defamatory in nature as they suggested that\n                    there was a mismanagement of funds. The plaintiffs submitted that the court\n                    should accept PW1 and PW3’s opinions since they were neutral and\n                    reasonable members of CYA. I wish to reiterate that the court is required to use\n                    the objective test of an ordinary, reasonable and reasonably interested CYA\n                    member to ascertain whether the statements are defamatory. Thus neither the\n                    intention of the defendant nor what the plaintiffs understood to be the meaning\n                    of the statements matter. The views of any particular CYA member are also not\n                    decisive. 62     I find that the interpretations of PW1 and PW3\n                    went against the grain of the natural and ordinary meaning of the statements in\n                    the Flyer and Brochure. Their testimonies were also biased and partial. PW3 even\n                    said that the statements suggested that CYF Directors had misappropriated the\n                    $90m fund. However I find that there is no way for the purported defamatory\n                    statements to have such meanings, short of distorting them. I also question the\n                    objectivity of PW1, as he had admitted that he was particularly sensitive to the\n                    statements during cross-examination:[note: 35] Mr Quek.Can I put it to you, therefore, that\n                                            there’s a reason why both you and Mr Leow Soon\n                                            Guan are particularly sensitive to that statement. Do\n                                            you agree? You don’t have to elaborate, just\n                                            agree, disagree.A.Yes, I think it will be very sensitive to\n                                            me because I was the treasurer [of\n                                    CYF].   63     The ordinary, reasonable and reasonably\n                    interested CYA member cannot be overly sensitive:Bernard\n                        Chanat [18]. The fact that PW1 admitted to being “very\n                    sensitive” would therefore disqualify his opinion as to how the\n                    statements should be read. In my view, it is unsafe to rely on PW1 and\n                    PW3’s understanding of the statements. The objective test must be used to\n                    ascertain the meaning of the statements from the perspective of an ordinary,\n                    reasonable and reasonably interested CYA member. In other words“…the ordinary reasonable person is very\n                    much an average rational layperson, neither brilliant nor foolhardy, and not\n                    idiosyncratic in his behaviour or disposition”:Bernard Chanat [18].",
        "The apology of the defendant": "64     The plaintiffs submitted in evidence the\n                    transcript of the 21 December CYF board meeting in which the defendant was\n                    confronted and interrogated at length on the statements in the Flyer and the\n                    Brochure. They said that the defendant had admitted that the statements were\n                    misleading and had caused hurt to the CYF board of directors. The defendant had\n                    also apologised to the board of directors at this meeting. Therefore the\n                    plaintiffs argued that the defendant had admitted to the defamatory\n                    statements. 65     I disagree. An audio recording was taken at\n                    this meeting and I reproduce the relevant portion of the defendant’s\n                    speech:[note: 36] … So I also want to, isn’t it, use this opportunity,\n                        isn’t it, to explain, isn’t it, that is the inconvenience and\n                        misunderstanding that I have, isn’t it, caused to everyone,\n                        isn’t it. I still want to apologise to everyone … It is clear that the defendant, in apologising, was not\n                        admitting that the statements were defamatory. He only admitted that it had\n                        caused some “misunderstanding”, for which he was apologising.\n                        That was consistent with his evidence in the Interview. The defendant had\n                        said that he had been wronged by the CYF board of directors. He had been\n                        made to bear the responsibility for the statements even though he did not\n                        make them. On 7 January 2013, he had sent a letter to the CYF board to\n                        clarify the statements and complimented the work of the board. On 2 February\n                        2013, the new CYF board (the first, second and fourth plaintiffs were not in\n                        this board) accepted the defendant’s explanation. He was no longer\n                        required to publish a public apology as required by the previous CYF board\n                        in the 21 December board meeting. Be that as it may, the central issue of\n                        this case turns on the natural and ordinary meaning of the statements and\n                        not the intention of the defendant or the understanding of the plaintiffs.\n                        This factor is thus irrelevant.",
        "The plaintiffs’ poor results at the election": "66     The plaintiffs further submitted that their\n                    poor results at the 35th Management Council election supported their position\n                    that the statements were defamatory. The first and second plaintiffs who were\n                    part of the 34th Management Council lost their seats. The third plaintiff,\n                    although elected into the 35th Management Council, also suffered a significant\n                    plunge in his popularity. He was ranked fifth in the election for the 34th\n                    Management Council but he was ranked 32nd in the election for the 35th\n                    Management Council.[note: 37] 67     I am not convinced that the adverse results\n                    were caused by the defendant’s statements. While the first, second and\n                    third plaintiffs (although elected) did not perform well in the elections, the\n                    election results also showed that eight board members and the fourth plaintiff,\n                    who was a non-related director, were elected to the 35th CYA Management Council.\n                    Nine out of the eleven board members who stood for the election were elected.\n                    PW1, the treasurer of the board, had secured the highest number of votes. If the\n                    statements of misappropriation of funds were believed, PW1 should logically not\n                    have been elected or if elected should not have attained the highest number of\n                    votes as he was the treasurer. Thus even if the plaintiffs had sought to rely on\n                    the loss of votes as proof of the statements being defamatory, these\n                    overwhelming results went against the plaintiffs’ case.",
        "Change of voting system": "68     It must be emphasised that unlike previous\n                    elections that allowed for voting via proxies, the election of the 35th\n                    Management Council adopted for the first time a different method of voting. It\n                    required all CYA members to vote in person. This change in voting method was\n                    further discussed during the cross-examination of the third plaintiff:[note: 38] Mr Quek.Am I correct that, what, the 34th council\n                                            election voting could be by\n                                    proxy?A.Yes.Q.So a candidate would be able to canvass\n                                            for proxy votes prior to the\n                                    election?A.Yes.Q.So a good canvasser would be able to\n                                            collect a substantial amount of votes prior to election\n                                            day?A.Yes.Q.So this could be the reason why there can\n                                            be a change in the voting\n                                    pattern?A.You mean the result? Are you talking\n                                            about the result?Q.I’m talking about the method where\n                                            you can canvass before beforehand and one where people\n                                            must go on the election day itself. That’s the\n                                            difference.A.Well, the entire method has changed so,\n                                            of course, I would say it’s\n                                        different.   69     I am also of the view that the poor results of\n                    the plaintiffs at the election of the 35th Management Council were most probably\n                    a result of the change in voting method. This also explained why the defendant\n                    suffered a sharp decline in his popularity at the election of the 35th\n                    Management Council. He was previously one of the top five elected candidates at\n                    the election of the 34th Management Council whereas he was ranked 28th at the\n                    election of the 35th Management Council.",
        "My conclusion on the first issue": "70     In summary, I hold that the statements are not\n                    defamatory in nature. Therefore I am unable to accept the plaintiffs’\n                    submission that “the effect of the Flyer was to cast doubt on the\n                    competence, honesty and integrity of the then CYF Board”.[note: 39]The plaintiffs have\n                    failed to establish aprima faciecase of\n                    defamation. For completeness, and as the parties have submitted on the defences\n                    of qualified privilege and fair comment, I shall proceed to give my views on\n                    those submissions.",
        "The defence of qualified privilege": "71     Qualified privilege is a common law defence\n                    against defamation. This defence arises in situations when the defendant has an\n                    interest or a duty, legal, social or moral to communicate certain information\n                    and the recipient has the corresponding interest or duty to receive the\n                    information also. It is commonly known as the duty-interest test. The Court of\n                    Appeal inBernard Chanat [86] has explained the\n                    nature of the defence of qualified privilege as follows: The nature of the defence of qualified privilege is explained inGatley on Libel & Slander(Patrick Milmo and W V\n                        H Rogers eds) (Sweet & Maxwell, 11th Ed, 2008) (\"Gatley\") at para 14.1: There are circumstances in which, on grounds of public policy and\n                        convenience, less compelling than those which give rise to absolute\n                        privilege, a person may yet, without incurring liability for defamation,\n                        make statements of fact about another which are defamatory and in fact\n                        untrue. These are cases of qualified privilege ... For a very long time\n                        these cases primarily concerned communications of a 'private' nature,\n                        commonly arising out of the necessities of some existing relationship\n                        between the maker of the statement and the recipient. Protection was granted\n                        if the statement was 'fairly warranted by the occasion' (that is to say,\n                        fell within the scope of the purpose for which the law grants the privilege)\n                        and so long as it was not shown by the person defamed that the statement was\n                        made with malice, i.e. with some indirect or improper motive, which was\n                        typically established by proof that the defendant knew the statement to be\n                        untrue, or was recklessly indifferent as to its truth... 72     However, the defence of qualified privilege is\n                    explicitly curtailed in the context of election proceedings under s 14 of the\n                    Defamation Act, which reads: Limitation of privilege at elections 14.A defamatory statement published by or\n                        on behalf of a candidate in any election to the office of President or to\n                        Parliament or other elected or partially elected bodyshall not be deemed to be published on a privileged occasion on the\n                            ground that it is material to a question in issue in the\n                            election, whether or not the person by whom it is published\n                        is qualified to vote at the election. [emphasis added]",
        "The plaintiffs’ view": "73     The plaintiffs submitted that the defendant is\n                    absolutely barred from relying on the qualified privilege defence because\n                    Parliament disallowed this defence in an election. They referred to theSingapore Parliamentary Reports, Official\n                        Report(26 November 1998) vol 69 at cols 1764–1765, where\n                    Assoc Prof Ho Peng Kee stated: Elections and electioneeringshould never be\n                            justification for defaming or maligning an opposing candidatewhether with words which are plain and ordinary in the meaning or, more\n                        often than not, words with innuendo meaning. Why should the law give licence\n                        to politicians, whether Opposition or Government, to make defamatory\n                        statements? If any politician thinks it is in the public interest to expose\n                        any character flaw or wrongdoing of an opposing candidate, he can and indeed\n                        should do so. But, at the same time, he must be prepared to justify these\n                        allegations, and that is the way it should be. [emphasis added] 74     The plaintiffs further made reference toJeyaretnam Joshua Benjamin v Lee Kuan Yew[1992] 1 SLR(R) 791 (“JBJ”) where\n                    the Court of Appeal held that the circumstances of a general election were\n                    insufficient to result in an occasion of privilege even if the subject-matter in\n                    issue was a material one. The plaintiffs in this case submitted that there was\n                    also no evidence that the matters were of current interest or in matters which\n                    the CYA members would be interested at the time of the election.[note: 40]",
        "The defendant’s view": "75     In contrast, the defendant submitted that\n                    while s 14 deemed election proceedings to be insufficient in making out the\n                    qualified privilege defence, it did not mean that the qualified privilege\n                    defence was always inapplicable to an election situation. He argued that the\n                    qualified privilege defence is available to him notwithstanding s 14\n                    because he was not relying on the elections as a basis for establishing his\n                    interest in communicating the statements to the CYA members. 76     The defendant traced the history of s 14\n                    back to the Defamation Ordinance 1957 (F M Ordinance No 20 of 1957)\n                    (M’sia), which was inherited from Malaysia and which was in turn inherited\n                    from the United Kingdom’s Defamation Act 1952 (15 & 16 Geo 6 & 1\n                    Eliz 2 c 66) (UK) (“the Defamation Act 1952”):Singapore Parliamentary Reports, Official Report(13 January\n                    1960) vol 12 cols 73–74 andJBJat [58]. The\n                    defendant submitted that s 10 of the Defamation Act 1952 isin pari materiawith s 14 and had been interpreted\n                    by Denning MR inPlummer v Charman And Others[1962] 1 WLR 1469 (“Plummer”) at\n                    1472 not to preclude the applicability of the qualified privilege defence (in an\n                    election situation).[note: 41]Similarly, the possibility of the privilege being invoked in electoral\n                    situations was observed by Upjohn LJ in the same case, although he observed that\n                    the possibility might be a “theoretical one”. This position was\n                    reaffirmed inCulnane v Morris[2006] 1 WLR\n                    2880. 77     Next, the defendant further submitted that\n                    s 14 should not apply if the communicator of the statements was under a\n                    public or private duty, legal or moral, in matters where his interests were\n                    concerned, to communicate it to the persons who were in fact the electors who\n                    had an interest in receiving them:Plummerat\n                    1472. 78     In this case, the defendant thus argued that\n                    his statements were made at the election campaign. He was under a public or\n                    private duty, legal or moral, in matters where his interests were concerned, to\n                    communicate the statements to CYA members who were the voters. The CYA members\n                    also had an interest in receiving them.[note: 42]Such circumstances would be\n                    sufficient to establish the qualified privilege defence because the privilege\n                    was being claimed on the basis of the traditional common law duty-interest test.\n                    It was not being claimed on the basis that the statements were material to the\n                    question in issue in an election, which is prohibited by s 14 of the\n                        Act.[note: 43] 79     The defendant further argued that if the\n                    statements were found to be defamatory he had a duty to inform the CYA members\n                    of the importance to protect and safeguard the huge assets of CYA from being\n                    fallen into the hands of outsiders. The CYA members also had a corresponding\n                    interest to know and decide the fate of the $90m fund which was held on trust by\n                    CYF for CYA’s benefit. Thus the defence submitted that the defence of\n                    qualified privilege was made out as the statements were made without\n                    malice.",
        "My views on the interaction between s 14 and the qualified privilege\n                defence": "80     Does s 14 disallow the defendant from\n                    relying on the defence of qualified privilege as the statements were made in the\n                    course of the election of members of the 35th CYA Management Council? A close\n                    scrutiny of s 14 does not show that Parliament has totally precluded the\n                    defence of qualified privilege in an election situation. The crucial phrase of\n                    s 14 is as follows: “…shall not be deemed\n                        to be published on a privileged occasion on the ground that it is material\n                        to a question in issue in the election…”. This\n                    means that the defendant cannot found his qualified privilege defence on thesoleevent of an election. We can see that the\n                    courts have been reluctant to allow the defendants to seek refuge under\n                    qualified privilege as a defence for defamation in an election. I shall make\n                    reference to case law. 81     InJBJ, the\n                    respondent was the former Prime Minister of Singapore who sued the appellant, an\n                    opposition politician, for slander because of what he said at a political rally\n                    on 26 August 1988. His case was that the appellant had disparaged him as the\n                    Prime Minister and thus had harmed his character, credit and reputation. The\n                    appellant had however sought to rely on the defence of qualified privilege on\n                    the basis that his speech was made at a political rally. His case was that he\n                    had a legitimate interest to make that speech to an audience who had a\n                    corresponding and legitimate interest in receiving that communication. The Court\n                    of Appeal disallowed this defence and stated at [72]–[73] that: 72    Parliament has thus legislated that the\n                            circumstances of a general election are not sufficient to give rise to\n                            an occasion of privilege even if the subject matter of the publication\n                            is material to an issue in the election. It is true that the section is\n                            limited to publications by or on behalf of a candidate in an election.\n                            But that is indicative of Parliament’s intention as to the scope\n                            of privilege to be attached to a speech made at an election, andthe courts should be slow to extend such\n                                privilege. … 73    In our opinion, the appellant’s interest in\n                            the subject matter of his speech and the interest, if any, of the\n                            audience in the same subject matter are not enough, by themselves, to\n                            found the defence of privilege;there must also be\n                                present a legal, moral or social duty on his part to communicate the\n                                subject matter of his speech to the\n                        audience. [emphasis added] From the above, it is clear that while the Court of Appeal\n                        held that courts should be slow to allow the qualified privilege defence to\n                        be used in electoral situations, s 14 does not totally disallow the\n                        defence of qualified privilege in an election. 82     This position is also consistent withPlummer. In that case, the plaintiff was an\n                    elected Member of Parliament who was running for re-election. He sued the\n                    defendants, who were opposing electoral candidates, for libel. The defendants\n                    had sought to amend their pleadings to include the defence of qualified\n                    privilege. The issue before the court was whether the amendments should be\n                    allowed. In disallowing the amendment, Denning MR first commented that s 10\n                    of the Defamation Act 1952 had overruled the previous position inBraddock and others v Bevins and another[1948] 1 KB 580\n                    where the English Court of Appeal held that statements contained in an election\n                    address regarding an opposing candidate and his supporters were published on a\n                    privileged occasion, unless there was malice. Next at 1472, he held that: … It seems plain to me that that means that if the candidate\n                        himself publishes a statement, or anyone publishes a statement on his\n                        behalf, to the electors in support of his candidature, then it is no longer\n                        a privileged occasion. The result is that in the ordinary way the only\n                        defences open to a person who makes an election address and puts it out to\n                        the electors is either that the words were true or that they were fair\n                        comment on a matter of public interest.I do not exclude\n                            the possibility that there might be a case where a person might\n                            conceivably say: “I am an elector; I made a communication to the\n                            other electors on a matter of common interest to us in such\n                            circumstances that it is privileged,” and it is not caught by\n                            section 10. I do not exclude the possibility of such a case,\n                        but in all ordinary circumstances an election address published by or on\n                        behalf of a candidate is no longer the subject of qualified privilege. The\n                        only defences open, if defamatory statements are contained in it, are\n                        justification or fair comment on a matter of public interest. [emphasis added] 83     The possibility of statements falling outside\n                    s 10 of the Defamation Act 1952 can also be discerned from Upjohn\n                    LJ’s judgment where he stated at 1473: … I would think a somewhat theoretical one – where the\n                        statement although contained in an election address, may be the subject of\n                        some qualified privilege because, quite independently of it being the\n                        occasion of an election or being contained in an election address, the\n                        person who has made it was under a public or private duty, legal or moral,\n                        in matters where his interests were concerned, to communicate it to the\n                        persons who were in fact the electors who had an interest to receive\n                        it. Therefore in this case, the defendant may find it extremely\n                        difficult to avail himself to the defence of qualified\n                    privilege. 84     In this case, does s 14 of the Act apply? I am\n                    of the view that it does. The statements here were contained in the\n                    defendant’s election manifesto made to canvass for votes. These statements\n                    were his election strategy to win votes. They were the defendant’s\n                    dominant or sole purpose for use in the election to compete against the\n                    plaintiffs’ team. This is the typical election situation to which\n                    s 14 applies and if the statements were defamatory, the defendant cannot\n                    rely on the event of an election to set up his defence of qualified privilege.\n                    Since he has not shown any other reason apart from the event of the election to\n                    justify his publication of the statements, he cannot rely on the qualified\n                    privilege defence. I shall now address whether the fair comment defence is\n                    available to the defendant.",
        "Is the defence of fair comment available to the defendant?": "85     The fair comment defence is founded upon the\n                    protection and promotion of freedom of comment by anyone on matters of public\n                    interest:Overseas-Chinese Banking Corp Ltd v Wright Norman\n                        and others and another suit[1994] 3 SLR(R) 410 at [32]. To\n                    establish this defence, the following elements must be satisfied: (a)     the words complained of must be\n                        comments, though they may consist of or include inference of\n                    facts; (b)     the comment\n                        is on a matter of public interest; (c)     the comment is based on facts; and (d)     the comment is one which a fair-minded\n                        person can honestly make on the facts proved.",
        "Were the statements comments or statements of fact?": "86     There is a difference between comments and\n                    facts. The Court of Appeal explained this difference inReview Publishingat [140]–[141]: 140    The fundamental\n                            rule is that the defence of fair comment applies only tocommentsand not imputations of facts, and the\n                            difficulty lies precisely in trying to distinguish a comment from a\n                            statement of fact. This difficulty, as well as the test for\n                            distinguishing between comments and statements of facts, has been aptly\n                            summarised by the learned authors ofEvans on\n                                Defamation([26]supra) at\n                            p 103 as follows: It will often be very difficult to decide whether a\n                                given statement expresses a comment or [an] opinion, or by contrast\n                                constitutes an allegation of fact. The same words\n                            published in one context may be statement[s] of fact, yet in another may\n                            be comment[s].Therefore, whether this element of the\n                                defence is established is one of fact, dependent upon the nature of\n                                the imputation conveyed, and the context and circumstances in which\n                                it is published. The test in deciding whether the words are fact or\n                                comment is an objective one - namely, whether an ordinary,\n                                reasonable reader on reading the whole article would understand the\n                                words as comment[s] or [as] statements of fact. The\n                            statement must be recognisable as [a] comment by the ordinary,\n                            reasonable and fair-minded reader having regard to the whole context of\n                            the publication.When such a reader cannot readily\n                                distinguish whether the defendant is stating a fact or making a\n                                comment, then the proper approach will be to deny the defendant the\n                                benefit of the defence. [emphasis added] … 141    Generally speaking, a comment is often equated\n                            with a statement of opinion (seeTun Datuk Patinggi\n                                Haji Abdul-Rahman Ya'kub v Bre Sdn Bhd[1996] 1 MLJ 393\n                            at 408, where it was stated that \"it is settled law that a comment is a\n                            statement of opinion on facts truly stated\", andLee\n                                Kuan Yew v Jeyaretnam Joshua Benjamin[1979-1980] SLR(R)\n                            24 (\"Jeyaretnam JB\") at [57], where it was\n                            stated that \"[a] comment is a statement of opinion on facts\") or a\n                            statement of conclusion (seeMitchell v\n                                Sprott[2002] 1 NZLR 766 at [19], where it was stated\n                            that \"[t]he defence applies when the words appear to a reasonable reader\n                            to be conclusionary\"). More specifically, a comment has been said to be\n                            \"something which is or can reasonably be inferred to be a deduction,\n                            inference, conclusion, criticism, judgment, remark, observance, etc.\"\n                            (seeClarke v Norton[1910] VLR 494 at\n                            499; see also generallyGatleyat para\n                            12.6). 87     Whether the statements are comments or facts\n                    depends on the understanding of the ordinary and reasonable CYA member of the\n                    statements. This principle was articulated by Lord Porter inKemsley v Foot[1952] AC 345 (“Kemsley”) at 356 (see alsoThe Law of\n                        Torts in Singaporeat para 13.014): If the defendant accurately states what some public man has really done,\n                        and then asserts that ‘such conduct is disgraceful’, this is\n                        merely the expression of his opinion, his comment on the plaintiff’s\n                        conduct. So [it is], if without setting it out, he identifies the conduct on\n                        which he comments by a clear reference. In either case, thedefendant enables his readers to judge for themselves how far\n                            his opinion is well founded; and, therefore, what would\n                        otherwise have been an allegation of fact becomes merely a comment. But if\n                        he asserts that the plaintiff has been guilty of disgraceful conduct, and\n                        does not state what the conduct was, this is an allegation of fact for which\n                        there is no defence but privilege or truth. [emphasis added] The defence of fair comments will only be relevant if the\n                        statements are considered to be defamatory and the statements must therefore\n                        first mean that the plaintiffs have been remiss in their duties.[note: 44]The plaintiffs\n                        submitted that the statements were not comments because there was an imputed\n                        meaning that the plaintiffs had been incompetent, lacking in integrity and\n                        lacking in honesty with no basis. 88     I cannot agree with the plaintiffs’\n                    submission. The statements were exhortatory comments by the defendant to the CYA\n                    members beseeching them to vote for candidates who believed in keeping the\n                    control and management of CYF and its assets within CYA. They were not\n                    statements of fact. There were two factions at the election with different ideas\n                    on how to manage and control the $90m fund (see above at [48] – [50]). The\n                    statements could not be facts as the $90m fund had not fallen into the hands of\n                    outsiders. Instead, I find that they were merely expressions of the\n                    defendant’s views or opinions regarding the control and management of the\n                    $90m fund. Moreover, the defendant had clarified in the Interview that the\n                    statements were not personal attacks against the CYF independent directors but\n                    simply his view that the control and management of CYF should remain with CYA.\n                    There was no express allegation of misconduct in the statements. The ordinary\n                    reasonable person reading those comments would thus understand them to be\n                    comments rather than statements of fact.",
        "Were the statements relating to matters of public interest?": "89     What constitutes public interest is wide and\n                    includes any matter affecting people at large so that they may be legitimately\n                    interested in what is going on or how they might be affected:Aaron Anne Joseph and others v Cheong Yip Seng and others[1996]\n                    1 SLR(R) 258 (“Aaron Anne Joseph”)\n                    at [75]. The term “public interest” has been read widely by\n                    Denning MR inLondon Artists Ltd v Littler Grade Organisation\n                        Ltd[1969] 2 QB 375 at 391 when he held that: There is no definition in the books as to what is a matter of public\n                        interest. All we are given is a list of examples, coupled with the statement\n                        that it is for the judge and not for the jury. I would not myself confine it\n                        within narrow limits. 90     Such matters have been held to pertain not\n                    just to matters of national importance, but also matters in which a significant\n                    number of people would have a legitimate interest in (seeLondon Artists LtdandSouth Hetton Coal\n                        Company, Limited v North-Eastern News Association, Limited[1894]\n                    1 QB 133). Here, the statements concerned the $90m held on trust by CYF. The\n                    election of appropriate candidates into the 35th CYA Management Council would be\n                    important for the safeguarding of the fund. This is a matter that is\n                    understandably of concern to the members of CYA. Given that many clan\n                    associations in Singapore run charitable initiatives, it is my view that the\n                    statements referred to matters of public interest.",
        "Were the comments based on facts?": "91     The plaintiffs argued that the facts relied\n                    upon by the defendant must be true. The defendant sought to rely on a proposal\n                    (“the 7 October proposal”) made at a CYA Board of Directors\n                    meeting on 7 October 2011 as the basis of his comments. The 7 October proposal\n                    envisaged that instead of CYF holding the $90m fund on trust for CYF, the latter\n                    would have full control over the $90m fund with certain conditions attached. The\n                    plaintiffs submitted that this was merely a suggestion that CYA might wish to\n                    consider in the future.[note: 45]It did not suggest that the money was to be an outright gift to CYF without\n                    restrictions and processes to have control over the funds.[note: 46]Therefore,\n                    it could not constitute a fact on which the defendant’s statements could\n                    be based on. 92     The crux of this issue rests on the\n                    interpretation of the 7 October proposal. It is not disputed that the 7 October\n                    proposal was a suggestion made by PW1 and the second plaintiff. In my view, the\n                    basis of the defendant’s statements was on the 7 October proposal and it\n                    is a fact that the suggestion was made. The defendant, being a more conservative\n                    CYA member, would understandably be concerned at the perceived\n                    “loosening” of control by the CYA over the funds should the 7\n                    October proposal be considered and eventually come into fruition in the future.\n                    This was the background behind the defendant’s statements. This position\n                    would also uphold the objective of the fair comment defence, which is premised\n                    on the protection and promotion of free speech (see [85] above). Thus I find\n                    that the statements were based on facts.",
        "Was the defendant fair-minded and honest when he made the statements\n                on the facts?": "93     Lastly, the plaintiffs submitted that the\n                    defendant could not have honestly made the comments in the statements. The\n                    plaintiff argued that the defendant knew that legal advice was sought from M/s\n                    Joo Toon & Co on the 7 October proposal. The legal opinion indicated that\n                    CYA could not transfer or confer any interest in the $90m fund to CYF and that\n                    CYF could not claim any legal or equitable interests to the funds.[note: 47]Thus the\n                    plaintiffs submitted that the comments made by the defendant did not satisfy\n                    this threshold because they were “extreme and grave\n                        allegations”.[note: 48] 94     A fair comment is an opinion that a\n                    fair-minded person could honestly hold, with some leeway given for prejudices\n                    and exaggerations:The Law of Torts in Singaporeat para 13.026, citingAaron Anne Josephat\n                    [77]–[78]. The test of honesty is an objective one (Chen Cheng and another v Central Christian Church and other\n                        appeals[1998] 3 SLR(R) 236 at [48]) and the defendant is to be\n                    given every allowance or latitude for prejudice and exaggeration as long as he\n                    was fair-minded:Aaron Anne Josephat\n                        [78].[note: 49] 95     I find that the defendant made the statements\n                    honestly as a fair-minded person. He was opposed to the independence of CYF from\n                    CYA. He was contesting an election and knew of the 7 October proposal which was\n                    a suggestion made by the second plaintiff for consideration in the future. As\n                    part of the 34th Management Committee standing for re-election, he would\n                    understandably be concerned. Thus he would do his utmost to prevent the 7\n                    October proposal from being considered by CYA’s Board. It is true that\n                    legal advice was obtained from M/s Joo Toon & Co. The latter opined that CYF\n                    could neither claim a legal nor an equitable interest in the fund. It was also\n                    not possible for CYA to transfer its interest in the fund to CYF. However, this\n                    was of no comfort to the defendant since the CYA Constitution can be easily\n                    changed by the CYA Management Council in order to accommodate CYF’s\n                    independence from CYA should the 7 October proposal come to\n                fruition. 96     The defendant has therefore satisfied the four\n                    conditions needed in establishing the fair comment defence. I turn now to\n                    examine whether the defendant was malicious when he made the statements as\n                    malice would vitiate the fair comment defence.",
        "Was the defendant malicious?": "97     To find malice, there must be evidence to\n                    indicate that the defendant did not genuinely believe in what he stated or that\n                    he acted with a dominant motive of injuring the other person:Bernard Chanat [90]. The plaintiffs submitted that the\n                    defendant did not raise any objection when the 7 October proposal was raised at\n                    the meeting. He also did not bring up this issue before the defendant decided to\n                    form his own team for the election. Neither did he mention the 7 October\n                    proposal at the CYF board meeting on 21 December to seek clarification on the\n                    statement. In my view, these omissions are insufficient to show that the\n                    defendant lacked honesty when he made the statements. Furthermore, as noted at\n                    [59] above, the defendant had endorsed the fourth plaintiff as member of his\n                    team in the election campaign. It is highly inconsistent and improbable that he\n                    would endorse them and later make a malicious statement against them. Hence I am\n                    satisfied that there was no malice on the facts and the defendant would succeed\n                    on the fair comment defence if the statements were defamatory.",
        "Is the High Court the correct forum to bring this action?": "98     Before the commencement of the trial, at one\n                    of the pre-trial conferences, the parties, particularly the plaintiffs, were\n                    advised to review their options on whether the High Court or the State Courts\n                    was the appropriate forum for this defamation suit.[note: 50]The parties’ attention was drawn to the Court of Appeal case ofKoh Sin Chong Freddie v Chan Cheng Wah Bernard and others and\n                        another appeal[2013] 4 SLR 629 in which costs were awarded on\n                    the then Subordinate Courts scale as each of the plaintiffs who was defamed\n                    received an amount less than $250,000. The jurisdiction of the High Court can\n                    only be invoked when the claim is for more than $250,000. Yet, the plaintiffs in\n                    this case proceeded to pursue this suit in the High Court when in their closing\n                    submissions they stated that the damages to be awarded to each plaintiff were to\n                    be a minimum of $50,000 per plaintiff.[note: 51]In the\n                    circumstances, the High Court may not be the appropriate forum to bring their\n                    case.",
        "Conclusion": "99     This is an unfortunate case in which the\n                    plaintiffs had overreacted to the defendant’s campaign slogan. They had\n                    read into the purported defamatory statements extraneous matters that were not\n                    in the statements, thus arriving at an offensive and derogatory meaning which no\n                    ordinary reasonable person would have come to. The tempest in the teacup was\n                    self-induced and unwarranted. For the reasons given above, the plaintiffs’\n                    have failed to establish aprima faciecase that\n                    they had been defamed. Therefore I dismiss their claim. I will hear the parties\n                    on the issue of costs.  [note: 1]Plaintiffs’ Bundle of Pleadings (“PBOP”), Tab\n                                1, [1]. [note: 2]PBOP, Tab 1,\n                                [2]. [note: 3]Plaintiffs’ Bundle of Authorities (“PBOA”), Tab\n                                2, p 47, Article 4(a)(i) [note: 4]PBOA, Tab 2, pp 3–4,\n                        [10]. [note: 5]PBOA, Tab 2, p 5,\n                [15]. [note: 6]PBOP, Tab 1, [3]. [note: 7]PBOA, Tab 2, p 4,\n                        [12]. [note: 8]PBOA, Tab 2, p 6,\n                        [16]–[17]. [note: 9]PBOA, Tab 2,\n                        [18]. [note: 10]PBOA, Tab 2,\n                        [20]. [note: 11]PBOA, Tab\n                                3, [10]. [note: 12]PBOA, Tab\n                                3, [11]–[12]. [note: 13]PBOA, Tab 2,\n                            [22]–[23]. [note: 14]PBOA, Tab\n                                4, p 3, [11]; NE, 6 May 2014, p 7, lines 8\n                        –14. [note: 15]PBOP, Tab\n                                1, [10]. [note: 16]PBOA, Tab 5,\n                        [5]. [note: 17]PBOA, Tab 2, p\n                        95. [note: 18]PBOA, Tab 2, p 100. [note: 19]NE, 7 May 2014, at p 13, lines\n                            6–18. [note: 20]PBOP, Tab 1, [15]. [note: 21]Agreed\n                                Bundle at p 49; Plaintiffs’ bundle of affidavit-in-chiefs\n                                (“PBAEIC”), Tab 2, pp\n                        100–101. [note: 22]PBOP, Tab 1,\n                        [15]. [note: 23]Plaintiff’s closing submissions\n                                (“PCS”) at [87]. [note: 24]PCS at [31]. [note: 25]NE, 7 May 2014, pp 71–72, lines 11–4; NE, 8 May\n                                2014, p 17, lines 2–16. [note: 26]NE, 9 May 2014, pp 49–50, lines\n                                20–1. [note: 27]PBOP, Tab 1,\n                        [15]. [note: 28]NE, 6 May\n                                2014, p 46, lines 14–17 and pp 49–50, lines\n                                19–10. [note: 29]NE, 8 May\n                                2014, pp 13–14, lines\n                    14–8. [note: 30]NE, 8 May 2014, pp 93–94, lines\n                                21–15. [note: 31]NE, 8 May\n                                2014, pp 96–97, lines\n                    3–2. [note: 32]NE, 8 May 2014, pp 46–47, lines\n                                15–7. [note: 33]NE, 8 May 2014, p 17, lines\n                                2–16. [note: 34]NE, 7 May 2014, p 72, lines 1–2;\n                                NE, 9 May 2014, p 38, lines 1–14; p 49, lines 11–14\n                                & 20; p 50, line 1. [note: 35]NE, 6 May\n                                2014, p 50, lines 10–15. [note: 36]PBOD at p 201. [note: 37]NE, 7 May 2014, p 63, lines 1–2,\n                                6–10. [note: 38]NE, 7 May 2014, pp 69–70, lines\n                                13–4. [note: 39]PCS at [31]. [note: 40]Plaintiffs’ reply submissions (“PRS”) at\n                                [46]. [note: 41]Defendant’s reply submissions\n                                (“DRS”) at [86]–[89]. [note: 42]DRS at\n                                [102]. [note: 43]DRS at [102]. [note: 44]PCS at [113]. [note: 45]PCS at [114]. [note: 46]PCS at [115]–[116]. [note: 47]AB at p 10–11. [note: 48]PCS at\n                    [123]. [note: 49]Defendant’s closing submissions at\n                            [69]. [note: 50]Minute sheet dated 31 March 2014. [note: 51]Minute\n                                sheet dated 8 July 2014."
    }
}