{
    "case_title": "Khor Liang Ing Grace (executor of the estate\nof Tan See Wee, deceased)\n      v\n      Nie\nJianmin",
    "ncitation": "[2014] SGHC 202",
    "coram": "Tan Siong Thye J",
    "sections": {
        "Introduction": "1       This\nis an application by Khor Liang Ing Grace (“Ms Khor”), the executor\nof the estate of Tan See Wee, her deceased husband (“the deceased”).\nShe seeks to remove a caveat filed by Nie Jianmin (“Ms Nie”) against\na grant of probate for the purposes of executing the deceased’s\nwill. 2       Ms\nNie’s caveat was lodged on the basis of an alleged $762,000 loan she\nhad made to the deceased not long before his demise. She is claiming this\nsum from the deceased’s estate. I have to decide whether there was\nsuch a loan and also whether the caveat should be removed.",
        "The facts": "3       The\ndeceased was a banker and fund manager working first as an investment\nmanager with the Development Bank of Singapore. Later, he worked\nas a fund manager with Merrill Lynch Asset Managers.[note: 1]He\ndied on 18 March 2014,[note: 2]leaving behind his will\nwhich named Ms Khor as the sole executor and trustee of his estate.[note: 3]There\nis no dispute about this.",
        "The dispute": "4       Soon\nafter the deceased’s death, Ms Nie lodged a caveat against the grant\nof probate in respect of the deceased’s estate. This was filed on\n26 March 2014.[note: 4]Ms Nie claims that she has an interest\nin the deceased’s estate as the deceased owed her $762,000.[note: 5]Her\nversion of the story is that she had lent money to the deceased,\nwhom her husband, Tan Chau Chuang (“Mr Tan”), had described as a\n“reliable long term friend”.[note: 6]She claims that she had\nonly lent the money on her husband’s assurance that the deceased\nwas financially sound and would repay the money. Pursuant to this,\nshe handed the deceased a cashier’s order for $762,000 in the deceased’s\nname on 30 December 2013.[note: 7]Ms Nie thus claims that\nshe lodged the caveat to protect her interest as a creditor.[note: 8] 5       Ms\nKhor’s story is different. The sum was not a loan but rather an investment\nin the deceased’s new project in Vietnam. The deceased told her that\nhe had entered into an investment. She then found out that Mr Tan had\ninvested his money into the deceased’s new project as well.[note: 9]Her position therefore is that the\n$762,000 was not a loan given to the deceased but an investment\nmade by Mr Tan in a business venture with the deceased.",
        "The present proceedings": "6       Subsequently,\nMs Khor made an application on 24 April 2014 in her capacity as\nthe executor of the deceased’s estate. She sought for probate to be\ngranted to her.[note: 10]The next day, she filed her supporting\naffidavit pursuant to O 71 r 5 of the Rules of Court (Cap 322, R\n5, 2006 Rev Ed) (“the ROC”). The supporting affidavit was filed\ntogether with an extract from the Register of Deaths (stating the\ncause of the deceased’s death) and his last will.[note: 11]It\nwas then that her lawyers informed her that a caveat had been lodged\nby Ms Nie against the grant of probate. As Ms Khor had always known\nMs Nie as “Jessie”, she did not know that they were the same person until\nlater. It was only after speaking with Mr Tan and a friend, Teoh\nTeik Kee (“Mr Teoh”), that she drew the connection between the caveat\nthat was filed by Ms Nie and the $762,000 investment purportedly\nmade by Mr Tan.[note: 12]",
        "The meeting between Ms Khor\nand Mr Tan in the presence of Samuel Koh": "7       In\norder to understand the circumstances surrounding the alleged debt\nof $762,000, Ms Khor met Mr Tan on 23 May 2014 with a friend, Samuel\nKoh (“Mr Koh”). At the meeting, Mr Tan stated that the deceased had\nowed him US$500,000. This sum was Mr Tan’s investment in the deceased’s\nVietnam project. This was an investment in Tri Viet Media Corp (“TVM”),\na Vietnamese media company.[note: 13] 8       As\nproof of Mr Tan’s investment, Ms Khor was shown copies of the remittance\nadvice to the deceased. She was also shown text messages sent through\nWhatsApp Messenger between Mr Tan and the deceased, indicating that\nthe deceased had asked Mr Tan to prepare acurriculum vitaeto\nbe presented to a Vietnamese company with him as a potential investor.[note: 14] 9       Ms\nKhor later understood from the meeting that Mr Tan had subsequently\nborrowed money from Ms Nie to invest in TVM – he did not have the\nmoney to invest in the project then. As the deceased had passed away,\nMr Tan sought a return of his investment and the caveat was filed\nto protect his investment interest.[note: 15]",
        "The show cause action": "10     On\n26 May 2014, a notice was served on Ms Nie’s solicitors. It warned her\nto appear within eight days of service to file a notice of appearance stating\nher interest in the estate of the deceased. If she had no contrary interest,\nthen she had to show cause against the grant of probate to Ms Khor.\nThe court would proceed to issue a grant of probate to the executor\nif she defaulted.[note: 16] 11     Ms\nNie thus entered her appearance on 3 June 2014 showing cause against\nthe grant of probate to Ms Khor. She alleged that she was a creditor of\nthe deceased’s estate. Therefore, the grant of probate should not\nbe made unless her interests could be assured. On the other hand,\nMs Khor requested that Ms Nie’s caveat be expunged.[note: 17] 12     In\naddition to her objections against the grant of probate to Ms Khor, Ms\nNie also requested that her claim be recognised and that the court\nmake an order for Ms Khor to repay the debt to her.[note: 18]",
        "The issues": "13     On\nthe above facts, the following issues are: (a)     whether\nthis court has the power under s 33 of the Probate and Administration\nAct (Cap 251, 1985 Rev Ed) (“PBA”) to hear or grant Ms Nie’s application\nfor her debt claim to be recognised or to order that the debt be\nrepaid to her; and (b)     whether\nMs Nie has a caveatable interest against the deceased’s estate.",
        "Does this court have the power\nunder s 33 of the PBA to hear Ms Nie’s debt claim or grant Ms Nie’s\napplication for her debt claim to be recognised or to order that\nthe debt be repaid to her?": "14     Section\n33 of the PBA reads as follows: Caveat 33.    Any\nperson having or claiming to have interest may, at any time after the\ndeath of a deceased person and before probate or letters of administration have\nbeen granted to his estate, enter a general caveat, so that no probate\nor letters of administration shall be granted without notice to\nthe caveator, and after entry of any such caveat no such grant shall\nbe made until the caveator has been given opportunity to contest\nthe right of any petitioner to a grant. 15     Ms\nKhor submits that this court does not have the power under s 33 to\nhear or grant Ms Nie’s application. This is because, in her view,\nthe court neither has the power to recognise Ms Nie’s debt claim\nof $762,000, nor the power to order the executor to pay the alleged\ndebt owed to Ms Nie when probate has yet to be granted.[note: 19]She also\nsubmits that this power is absent under O 71 r 37 of the ROC.[note: 20]Does\nthis court have the power under s 33 of the PBA or O 71 r 37 of\nthe ROC to adjudicate on Ms Nie’s debt claim before the grant of\nprobate? In order to determine this question, regard must be had\nto the purpose of s 33 of the PBA. 16     Section\n33 allows one to lodge a caveat against the grant of probate. The\nperson seeking the grant of probate will then be notified before\nthe grant of probate is issued:Halsbury’s\nLaws of Singaporevol 15 (LexisNexis, 2013 Reissue) (“Halsbury’s Laws of Singapore”) at para\n190.015. The following passage from Jonathan Winegarten, Roland\nD’ Costa & Terry Synak,Tristram and Coote’s\nProbate Practice(LexisNexis, 30th Ed, 2013) at para\n23.04 is instructive (see also G Raman,Probate\nand Administration in Singapore and Malaysia(LexisNexis,\n3rd Ed, 2012) (“Probate and Administration\nin Singapore and Malaysia”) at p 134): The following are some of the purposes\nfor which a caveat may be entered: (a)to give time to the caveator to make enquiries and to obtain\nsuch information as may enable him to determine whether or not there\nare grounds for his opposing the grant; (b)to give any person interested in the\nestate an opportunity of bringing any question arising in respect\nof the grant before the court on summons; and (c)as a step preliminary to a probate\nclaim, or to the issuing of a citation … Once the caveat has been filed, the caveator has to show cause\nwhy the grant of probate should not be given. Typically, the show\ncause action would take place when the caveator wants some form\nof assurance that the deceased’s estate would be administered in\nthe interests of all the beneficiaries:Probate and\nAdministration in Singapore and Malaysiaat p 135. 17     Accordingly,\nI am of the view that this court does not have the power under s\n33 of the PBA or O 71 r 37 of the ROC to decide on the merits of\nMs Nie’s debt claim. The power under s 33 of the PBA or O 71 r 37\nof the ROC shouldonlybe invoked\ninsofar as Ms Nie seeks to establish a contrary interest in the\nestate, which arises if she is claiming an interest either as an executor\nor beneficiary of the will: Ng Peng Hong, George Tan Keok Heng and\nHo Hock Lai,Atkin’s Court Forms Singapore(LexisNexis,\n2007) at para 1004. The rights of a creditor should not be adjudicated\nat this stage. As Sir William Wynne inElme\nv Da Costa(1791) 1 Phill Ecc 174 at 177 held: The right of a creditor is only this;he cannot be paid his debt till a representation\nto the deceased is made; he can then call on all who\nhave a right to administer; before an administration is granted\nif a will be produced, the creditor has no right to contradict or\ndeny it; for if there is a will, or a next of kin claims the administration,\nthen a person offers to make himself a representative, and the creditor\ngets all that he has a right to. [emphasis added] 18     It\nis clear that the caveat lodged by Ms Nie cannot circumvent the usual\nprobate procedure. If she is alleging that she is a creditor of\nthe deceased, she should wait for the executor to obtain the grant\nof probate before submitting her claim to the estate via the executor\nor administrator:Halsbury’s Laws of Singaporeat\npara 190.095. It is not for this court to adjudicate on her claim\nat this stage and find that she was owed a loan or make an order\nfor its return. 19     Moreover,\nMs Nie’s position is that she does not object to Ms Khor administering\nthe estate. She is only interested in recovering what she claims\nis owed to her. The filing of the caveat in this case is therefore misconceived,\nas there is no basis to withhold the grant of probate to Ms Khor.\nI agree with Ms Khor’s submission that the court does not have the power\nto hear or grant Ms Nie’s debt claim of $762,000 under s 33 of the PBA\nor O 71 r 37 of the ROC. I shall now examine whether Ms Nie has\na caveatable interest against the deceased’s estate.",
        "Does Ms Nie have a caveatable\ninterest against the deceased’s estate?": "20     The\nparties’ dispute is with respect to the nature of the sum and whether\nit constitutes a caveatable interest. Ms Nie submits that the $762,000\nis a loan which is due to her from the deceased. Ms Khor, on the other\nhand, submits that it is an investment, the sum being given pursuant an\ninvestment made by Mr Tan in TVM. A third view appears tenable as well\nfrom the evidence of Mr Tan. He is of the view that the sum had\nbeen lent to him by Ms Nie for his investment in TVM. While he has\nprovided a third possible view, it is important to note that he\nis not party to the proceedings. 21     Which\nof the three versions is correct is, in my view, immaterial. I hold\nthat none of them amounts to a caveatable interest in this case.\nInRe Devoy; Fitzgerald v Fitzgerald(1943)\nQSR 137 (“Re Devoy”) at 144, it\nwas held that: … It is conceded that a person who merely\nhad an interest or pretended interest in the estate could not, merely\nupon showing such an interest or pretended interest, oppose a will:\nhe must have been able to show that the grant of probate would affect\nsome interest of his. It is also conceded that the law provided\nthat no person could intervene in a probate action merely because\nhe was interested in the estate: he must have shown that he was interested\nin the cause. … A person’s interest arising under a loan or an investment\nis not such an interest.",
        "Is a loan a caveatable interest?": "22     Loans\ndo not give rise to caveatable interests under s 33 of the PBA. This\nhas been the position in the United Kingdom (Burroughs\nv Griffiths and Hall(1754) 1 Lee 544 (“Burroughs”)),\nHong Kong (Re John Tung Chi Ying[1987]\nHKCFI 57 (“Re John Tung Chi Ying”))\nand Australia (Re Donald Keith Owen,\n21 August 1992 (unreported)). In fact, creditors who have lodged\ncaveats have been criticised as abusing the caveat process. I agree. 23     I\nfind the facts ofRe John Tung Chi Yinggermane\nto this case. In that case, John Tung passed away and left behind\na will. His grandnephew asserted that he had loaned John Tung US$11m\nwhich had remained unpaid. On that basis, the grandnephew lodged\na caveat and subsequently, the executor of the will sought to expunge\nthe caveat. The application to expunge the caveat was allowed. It\nwas held that the grandnephew’s actions were “inexplicable and unjustified”.\nHis interests were better protected and preserved after the grant\nof probate. 24     Parallels\ncan be drawn betweenRe John Tung Chi Yingand\nthe present case. Here, Ms Nie’s caveat is premised on her assertion\nthat the $762,000 was a loan to the deceased. Her interest is for\nthe return of the $762,000 to her. This was apparent when she stated\nin the affidavit that she had lodged the caveat only to protect\nher own interests. She was willing to withdraw the caveat provided\nMs Khor gave her some assurances with respect to the debt. I find\nno reason to maintain the caveat on the basis of a loan and hold\nthat the caveat must be expunged from the register.",
        "Is an investment a caveatable\ninterest?": "25     I\nalso do not find that an interest pursuant to an investment can\ngive rise to a caveatable interest under s 33 of the PBA. InRe Devoyat 145, it was held that: … [A] person “interested” or “interested\nin the estate” cannot enforce the bringing of an action in which\nhe can dispute the validity of the will, unless he can show an interest\nsufficient to entitle him to object to the grant applied for. How is the sufficiency of that interest\nto be determined? I know of no other way than by reference to the\ngeneral body of probate law;and according\nto that law an interest sufficient to entitled a person to object\nto a grant must be some right of that person which will be affected\nby the grant. [emphasis added] In my view, if the $762,000 were an investment instead of\na loan as Ms Khor contends, it is still not a caveatable interest\nas it is not a probate issue. 26     Here,\nthe preliminary question would be whether Ms Nie even has any standing\nto bring an action against Ms Khor as the executor, since the investment\nwas made by Mr Tan. She merely lent money to her husband; she would\nhave no standing to make this application against Ms Khor. Second,\nif the $762,000 was an investment, Mr Tan’s investment could be held\nby the deceased on trust for Mr Tan’s benefit or could even be held legally\nby Mr Tan. If the former, Ms Nie’s interest would be best taken\ncare of if the grant of probate is given to Ms Khor. Mr Tan can\nthen work with Ms Khor as the executor to realise his beneficial\ninterest under the $762,000. If the latter, Ms Nie’s interest would\nbe best taken care of between herself and Mr Tan. Ms Khor will not\nbe involved. Therefore no caveatable interest can arise from an\ninvestment interest.",
        "Is Ms Nie’s claim on moneys\nhad and received sustainable?": "27     Finally,\nI wish to comment on Ms Nie’s claim on the grounds of unjust enrichment.\nMs Nie submits that her claim is one for monies had and received.\nShe relies onTjong Very Sumito and others\nv Chan Sing En and others[2012] 3 SLR 953 at [81] for\nthe elements of unjust enrichment. She submits that it isunjustfor the deceased’s estate to retain\nthe sum claimed for. 28     InAlwieHandoyov Tjong Very Sumito and another and another appeal[2013]\n4 SLR 308 at [125], the Court of Appeal held that: …Plaintiffs should\nbe precise in elucidating the basis for their restitutionary claims.\nIdentifying the precise underlying cause of action for a restitutionary\nclaim has practical consequences in terms of affecting what the plaintiff\nneeds to show in order to establish the claim. We agree with the comment\nby the editors ofGoff & Jones (8th Ed)([101]supra) at para 1.29 that “[t]he old language\nof ‘money had and received’ … conceals as much as it reveals about\nthe nature of a claim”. In our view, the underlying basis for the\naction for money had and received is now embraced under the rubric\nofunjust enrichment: seeWestdeutscheLandesbankGirozentrale v Islington London Borough Council[1996]\nAC 669 at 710. [original emphasis in italics; emphasis\nadded in bold] 29     Ms\nNie’s bare assertion of an enrichment being unjust is insufficient\nif she seeks to establish her claim based on money had and received.\nThe same point was noted by Judith Prakash J inLo\nMan Heng and another v UBS AG (Yap Loo Mien, third party)[2014]\nSGHC 134 at [82]: that an unjust enrichment claim must be premised\non an “unjust factor”. Since Ms Nie has not shown that any such\nunjust factor exists, I hold that her claim based on moneys had\nand received can neither succeed nor form a basis for a caveatable\ninterest. 30     There\nare material differences in the facts ofTan\nBeng Tian v Teoh Hock Kooi[2012] SGDC 268 which Ms Nie\nrelied on to show that the court had ordered a refund of an investment\nsum. In that case, the defendant, who was the recipient of the money\nin question, had induced the plaintiff by stating that if the plaintiff\nremained unconvinced about the investment potential of a potential\ninvestment, the defendant would return the investment sum to the\nplaintiff. There was no evidence of such facts before me.",
        "Is the sum claimed for an investment\nor loan?": "31     The\npurpose of the $762,000 is a hotly contested issue between the parties.\nIt is not necessary for me to dwell on this issue as I have explained above\nthat I have no power under s 33 of the PBA to recognise Ms Nie’s claim\nor to make an order for the debt to be repaid to her. Neither does\nMs Nie have a caveatable interest against the deceased’s estate.\nSince the purpose of $762,000 is central to this application, I\nshall therefore give my views on whether the $762,000 is more likely\nto be a loan or an investment. However, I stress that my findings\nare only on the evidence before me. They are without prejudice to\nMs Nie’s right to subsequently bring a claim for the $762,000 on\nthe basis that it is a loan if it is necessary for her to do so\nlater.",
        "The case for the $762,000 being\nan investment": "32     Ms\nKhor’s position is that the $762,000 was a sum of money which Ms Nie\nlent to Mr Tan for the purpose of investing with the deceased in\nTVM. Ms Nie and Mr Tan were aware that the deceased had an investment\nin TVM. According to Mr Tan’s affidavit, it is undisputed that in\nDecember 2013, the deceased was keenly interested in TVM. At that\ntime, the deceased required US$2m for the first tranche of the investment. 33     The\ncrucial issue is whether the deceased borrowed $762,000 from Ms Nie\nfor this investment or whether Mr Tan used this sum to invest together with\nthe deceased. Mr Teoh, who knew the deceased, Ms Khor and Mr Tan, stated\nin his affidavit that the deceased had told him that Mr Tan and\nthe deceased had invested in TVM through the deceased’s investment\nvehicle ADAD Investments Pte Ltd.[note: 21]Mr Tan denied this.\nMr Teoh also said that he was surprised to learn that Ms Nie extended\na loan of $762,000 to the deceased in December 2013.[note: 22] 34     Furthermore,\nMs Khor said that when she met Mr Tan on 23 May 2013 together with\nMr Koh, Mr Tan stated that the deceased owed him US$500,000. This\nsum was Mr Tan’s investment in TVM. This investment proposition\nis corroborated by a series of text messages sent through WhatsApp\nMessenger from Mr Tan to the deceased in January 2014. The messages\nare as follows:[note: 23] Deceased:Also, next step, pls prepare ur CV (as Investor - why they want\nu!), let me hv a look to provide feedback. Best sw.Mr Tan:Noted…. will doDeceased:Also,\nwld appreciate ur intro to the potential investor + provide me with\nthe contact details to follow up..   Mr Tan also admitted that he had attended the annual dinner\nof TVM in Vietnam with the deceased and Mr Teoh on 24 Jaunary 2014.\nHowever, he alleged that his attendance was not in his capacity\nas an investor.",
        "The case for the $762,000 being\na loan": "35     Ms\nNie’s story was that the sum was a loan due to her from the deceased.\nHowever, there was no documentary evidence in either hardcopy or\nelectronic form to indicate that it was a loan. As Ms Khor pointed\nout, all that Ms Nie had tendered in support of her claim was a\nremittance advice from her in favour of the deceased.[note: 24]The\nonly other piece of evidence was the affidavit of Ms Nie’s husband,\nMr Tan, who echoed her assertion that the $762,000 was a loan. If\nit were a loan, it lacked the essential characteristics of one.\nWas it a demand or term loan? If it was a term loan, what was the\nduration of that loan? Was it an interest free or interest chargeable\nloan? Those questions were left unanswered by the evidence before\nme. 36     It\nappears from Mr Tan’s affidavit that “[b]ased on my understanding,\n[the deceased] had been prepared to pay interest of at least 4%\nper annum on the loan amount”.[note: 25]The 4% is merely\nwhat Mr Tan thought should be the interest rate. There was no discussion\nor agreement between the deceased and Ms Nie or Mr Tan as to the\ninterest rate and hence no indication whether the deceased agreed\nto the 4% per annum. I find it unusual for the lack of evidence\nas the sum loaned is not a small figure. Even among the best of\nfriends, at the very least, one would expect some evidence with\nrespect to the interest rate for a loan figure of $762,000. 37     Ms\nNie’s explanation is that the absence of any interest rate was due\nto the fact that the loan was taken out on an urgent basis. However\nI find that the evidence indicated otherwise. The purported loan\nwas given on 30 December 2013 and the demise of the deceased was\non 18 March 2014. For ten weeks, there had been no documentary or\nelectronic correspondence on this loan. I find it incredible that\nparties as sophisticated as the deceased and Mr Tan, would have\nmade the loan in this manner, even taking into account their friendship\nties. Therefore, in my view, Ms Nie’s contention that the sum was\na loan is less convincing.",
        "The case for the $762,000 as\nan investment is stronger": "38     The\ncircumstances above thus seem to point towards the fact that the deceased\nand Mr Tan were investing in TVM. Ms Khor’s version of the events\nwas also corroborated by Mr Teoh’s account. While Mr Tan filed an affidavit\nin support of Ms Nie’s version of the events, it appears that Ms Khor’s\nversion is more likely having regard to the above facts. Ms Nie’s evidence\nis mostly premised on bare assertions, with the only person corroborating\nher story being her husband, Mr Tan. I thus find that on the evidence\nbefore me it is more likely that the $762,000 is an investment rather\nthan a loan.",
        "Conclusion": "39     In\nmy view the proceedings would have been expedited and Ms Nie would\nhave been able to recover the $762,000 sooner (if it was really\na loan) had she not lodged the caveat and refused to take it off\nthe register. The views of Sir George Lee inBurroughsat\n551 are apposite: … [A] creditor had only a right to have\na constat of the deceased’s estate, to see whether there were assets\nsufficient to pay the debts, but could not controvert the validity\nof a will, for it was indifferent whether he should receive his\ndebt from an executor or an administrator, and if a creditor was admitted\nto dispute the validity of a will, it would create infinite trouble, expense\nand delay to executors … 40     It\nis also pertinent to note that Ms Nie does not oppose the grant\nof probate to Ms Khor. Thus there is no issue with respect to the\ngrant of probate. I therefore allow the application made by Ms Khor,\nthe executor, and order that the caveat be struck off the register\nand the grant of probate to be issued. I also dismiss Ms Nie’s application\nfor the $762,000 to be returned to her and will hear the parties\non costs.  [note: 1]Caveator’s bundle of\ndocuments (“CBOD”) Tab 8, at para 5. [note: 2]CBOD\nTab 8, at para 4. [note: 3]CBOD Tab 3, at p 8. [note: 4]CBOD\nTab 1. [note: 5]CBOD Tab 1. [note: 6]CBOD\nTab 7, at para 7. [note: 7]CBOD\nTab 7, at para 6. [note: 8]CBOD Tab 7, at para\n9. [note: 9]CBOD Tab 8, at para\n18. [note: 10]CBOD\nTab 2. [note: 11]CBOD Tab 3. [note: 12]CBOD\nTab 8, at paras 20– 21. [note: 13]CBOD\nTab 8, at para 22; CBOD Tab 9, at para 5. [note: 14]CBOD Tab 8, at para\n22. [note: 15]CBOD\nTab 8, at para 24. [note: 16]CBOD\nTab 4. [note: 17]CBOD Tab 8, at para\n7. [note: 18]CBOD Tab 7, at para\n19. [note: 19]Applicant’s skeletal\nsubmissions (“AS”), at para 14. [note: 20]AS, at para 15. [note: 21]CBOD\nTab 9, at p 3 para 9. [note: 22]CBOD Tab 9, at p 3\npara 10. [note: 23]CBOD\nTab 8, at p 11. [note: 24]CBOD Tab 7, at p 7. [note: 25]CBOD\nTab 11, at p 5 para 7(f)."
    }
}