{
    "case_title": "Tan Poh Choo Joscelyn\n      v\n      Tan\nPoh Seng and another",
    "ncitation": "[2014] SGHC 22",
    "coram": "Judith Prakash J",
    "sections": {
        "Introduction": "1       The\nplaintiff in this action holds a certain sum of money as a trustee and\nshe has come to the court for a determination as to who the rightful beneficial\nowner of the money is. The two competing claimants are the first and\nsecond defendants to the action. All the parties are related, the\nfirst defendant being the elder brother of the plaintiff and the\nfather of the second defendant. The trust funds are derived from\ncertain shares that originally belonged to the plaintiff’s mother,\nand the history of the competing claims goes back some 30 years.\nThe story is therefore somewhat involved and due to the lapse of\ntime and the loss of documents, there are many gaps.",
        "Background": "",
        "Events from 1980 up to 1987": "2       In\n1980, one Madam Yeo Siew Guat (“Mdm Yeo”) was the owner of 950 shares\nin a company called Tai Seng Realty Co Pte Ltd (“TSR”) and 10 shares\nin a company called General Sawmill Pte Ltd (“GSPL”). Both these companies\nwere family businesses run by her husband. Mdm Yeo had nine children,\nnamely (not in order of age): (a)     Tan\nLucy (now known by her married name of Lucy Lim) (“Lucy Lim”) (b)     Tan\nChin Chye, Amy (“Amy Tan”) (c)     Tan\nPoh Choo, Joscelyn (the plaintiff) (d)     Tan\nPof Eng (formerly known as Tan Poh Eng and called Ali by the family)\n(“Pof Eng”) (e)     Tan\nPoh Wah, Nelly (“Nelly Tan”) (f)     Tan\nPoh Chuan (also called Eric by the family) (“Chuan”) (g)     Tan\nPoh Siong (also called Johnson by the family) (“Siong”) (h)     Tan\nPoh Seng, Robert (also known as Robert Tan), the first defendant;\nand (i)     Tan\nPoh Lin (“Poh Lin”). 3       In\nAugust 1980, Siong and Chuan incorporated a private limited company\nin Singapore called Hock Ann Holdings Pte Ltd (“HAPL”) as an investment\ncompany. Siong and Chuan were the initial shareholders and directors\nof the company. On 2 May 1981, HAPL passed a directors’ resolution\nby which it was resolved that the company would acquire 950 TSR\nshares from Mdm Yeo at a price of $158,000. No similar resolution\nwas produced in respect of the GSPL shares but subsequently (the\nexact date is not known), Mdm Yeo’s TSR and GSPL shares were transferred\nfrom her into the ownership of HAPL. It is the evidence of Chuan\nthat Mdm Yeo was paid $168,000 for these two counters but there\nwas no document adduced to support such testimony. The first defendant\ndoes not believe that any money was ever paid to Mdm Yeo. 4       At\nabout the same time, again no dates have been furnished, a number of\nMdm Yeo’s children who also held shares in TSR transferred their shareholdings\nto HAPL. As a result, HAPL became the owner of 4,070 TSR shares. 5       The\nposition of the plaintiff is that on the advice of Chuan, Mdm Yeo had\ndecided to do some estate planning because in the 1980s estate duties were\nvery high. She decided to make a gift (“the Gift”) of her TSR and\nGSPL shares to her nine children equally and the shares were transferred\nto HAPL pursuant to this intention. The scheme was that the children\nwould become shareholders of HAPL itself and would thereby secure\ntheir interests in the Gift. 6       The\nposition of the first defendant is that Mdm Yeo transferred her shares\nto HAPL for the latter to hold the same on trust for Mdm Yeo for\nher lifetime and thereafter, on trust for distribution to her children\nin equal shares. 7       According\nto the plaintiff and her witnesses, the common intention was that\neach of the children was to receive 22,000 shares in HAPL. These 22,000\nshares were to represent such child’s interest in the shares that\nMdm Yeo had transferred to HAPL. This scheme was not carried out\ncompletely in that not all the children became shareholders in HAPL.\nIn the case of Poh Lin, he informed Chuan that he wanted to give\nhis portion of the Gift to his elder brother, Pof Eng, and therefore\nhe never became a shareholder in HAPL. Instead, Pof Eng was regarded\nbeing entitled to two shares of the Gift. As for the first defendant,\nit is the evidence of Chuan that the first defendant wanted his\nportion to be put in the name of his son, the second defendant,\nto be held by the latter on trust for himself and his sisters, who are\nnamed Arlette and Alena. The plaintiff’s position is that for a\nlong time, she was aware only that the first defendant wanted to\npass on his share of the Gift to the second defendant. She was not\ntold that the same was to be held on trust by the second defendant. 8       There\nis no document in court showing exactly how many shares in HAPL\nwere allotted to Mdm Yeo’s children in the 1980s. However, from\na document dated 24 December 1988 (“the Deed”) (a very important document\nabout which I say more below), it appears that in December 1988,\nLucy Lim, the plaintiff, Amy Tan, Nelly Tan and Pof Eng were among the\nregistered shareholders of HAPL. These siblings held their shareholdings\nin part for themselves beneficially and in part for other siblings\nnamely, Lucy Lim, Nelly Tan, Siong and Chuan. From the evidence, Siong\nand Chuan must also have been registered shareholders as they had procured\nthe incorporation of HAPL. There is no documentary evidence that\neither the first or second defendant was a shareholder of HAPL at\nany time. Chuan and Amy Tan, however, insisted in their testimony\nthat the first defendant’s intention was that the second defendant\nshould be a shareholder in his place and Chuan at least was convinced\nthat this intention had been effected and the second defendant had\nbecome a shareholder of HAPL. 9       The\nsecond defendant’s evidence was that in late January or early February1984,\njust before his 17thbirthday, his parents\nvisited him at his boarding school in England. During this visit,\nthe first defendant told the second defendant that he did not want\nto accept the shares that Mdm Yeo had given him. He said that he\nhad told his siblings that his 1/9thportion\nof the Gift was to be given to the second defendant. He also told\nthe second defendant that this portion was meant for the second\ndefendant alone and that his sisters had no share in it. The first\ndefendant denies that any such conversation took place. 10     At\nthe time that Mdm Yeo’s shares were transferred to HAPL, her husband\nwas still alive and he was maintaining her. The senior Mr Tan died in\nNovember 1983. Thereafter, Mdm Yeo was maintained for a number of years\nfrom her own funds and by some of her children. 11     In\nApril 1988, Mdm Yeo executed her last will. She appointed Amy Tan\nand the plaintiff as her executors and trustees. By the will, she bequeathed\nthe whole of her estate including her jewellery to her four daughters\nin equal shares.",
        "The Deed": "12     In\nDecember 1987, TSR was put into members’ voluntary liquidation. The\nquestion then arose as to what HAPL should do. By that time, Chuan who\nhad been managing HAPL, was no longer living in Singapore and neither\nwas Siong. They were considering winding up HAPL and did not want\nthe company to be responsible for the TSR shares which “belonged”\nto their siblings including the 950 TSR shares which had come from\nMdm Yeo. It should be noted, though nothing turns on it, that in\nthe event HAPL was only wound up in 2003. 13     It\nwas decided, after various discussions amongst the siblings, that these\nshares should be taken out of HAPL. It was in these circumstances that\nthe Deed was drawn up and executed. The actual dates of execution\nof the document by the various parties are not known but it was\ndated 24 December 1988. It should be noted that Mdm Yeo witnessed\nthe signatures of the seven siblings who signed the Deed. 14     It\nmay be helpful for me to set out the main provisions of the Deed\nat this point. There were three sets of parties to the Deed: the\nVendors, the Purchasers and the company (HAPL). The Vendors were\nLucy Lim, Amy Tan, Nelly Tan, the plaintiff and Pof Eng; the Purchasers\nwere Siong and Chuan. The recitals to the Deed stated that the Vendors\nwere the beneficial owners of 262,000 shares in HAPL and were also\nthe registered owners of a further 814,000 shares which they held\non trust for the Purchasers. It was also stated that the Vendors\nand the Purchasers were to purchase 1,600 TSR shares from HAPL. 15     In\nthe main body of the Deed, the following were effected: (a)     By\ncl (i), in consideration of the sum of $681,200 paid by the Purchasers\nto the Vendors, the Vendors transferred a total of 538,000 shares\nto Siong and an identical number of shares to Chuan: (b)     By\ncl (ii), in consideration of the sum of $660,800 paid to HAPL, the\ncompany sold to the Vendors and the Purchasers 1600 shares in TSR\nto be transferred to them as follows: (i)       140 TSR shares to each of Lucy Lim and the plaintiff; (ii)       280 TSR shares to Amy Tan; (iii)       90 TSR shares to Pof Eng; and (iv)       a block of 950 TSR shares to be allocated in the following manner: (A)       2/9thshares\nto Pof Eng; (B)       1/9thshare\nto Lucy Lim; (C)       1/9thshare\nto Amy Tan; (D)       1/9thshare\nto Nelly Tan; (E)       1/9thshare\nto the plaintiff; (F)       1/9thshare\nto Chuan; (G)       1/9thshare\nto Siong; and (H)       1/9thshare\nto the second defendant. 16     Clause\n(v) of the Deed is important and must be set out in full. It says: The Vendors and the Purchasers further\nagree that the said 950 shares in Tai Sing Realty Co., (Pte) Ltd\nshall remain intact during the life time of Madam Yeo Siew Guat\nand that any dividends declared by the liquidator of Tai Sing Realty\nCo., (Pte) Ltd or assets distributed shall be applied to the maintenance and\nup keep of the said Madam Yeo Siew Guat in her lifetime. 17     As\nmight be anticipated, the first defendant places a great deal of emphasis\non cl (v) and says that it supports his stand that the 950 TSR shares\nwere never given by Madam Yeo to her children but were instead put into\na trust for her benefit during her lifetime. The plaintiff takes\nthe position that the clause reflects the consensus among the siblings,\nexcluding the first defendant, that whilst the 950 shares belonged\nto them absolutely, they had a moral obligation to support their\nmother and should therefore only use the proceeds of the same for\nthis purpose during her lifetime and postpone distribution amongst\nthemselves till after her death. 18     In\nthis context, cl (iii) of the Deed cannot be overlooked. That clause stated\nthat in the event the transfer of 1600 TSR shares to the various\nparties mentioned in cl (ii) was not effected, then HAPL was to\nhold the same in trust for the Vendors and the Purchasers “who shall\nretain the beneficial interest of the said shares” in the proportions\nstated in cl (ii).",
        "Events after the Deed": "19     There\nis no evidence exactly how the transfer of the 950 TSR shares contemplated\nby the Deed took place. It is however common ground that eventually\nassets representing these shares, mainly UOB shares and cash, were\ndistributed by the liquidator of TSR to the plaintiff and Amy Tan\nwho considered that they held the same on trust for the eight persons\nnamed in cl (ii) of the Deed. The parties referred to these assets\nas “the 950 account”. In 1994, it was agreed that all the assets\nof the 950 account should be held by the plaintiff alone. However,\neven thereafter the siblings generally seem to have regarded both\nthe plaintiff and Amy Tan as the trustees. By the time of Mdm Yeo’s\ndeath in 2009, however, the plaintiff alone was acting as trustee. 20     It\nshould be noted that the first defendant who was not a party to\nthe Deed asserts that he was not aware of its existence in 1988\nor 1989. The second defendant claims, however, that in March 1989\nwhen he visited his mother’s home in London, his father brought\nout a document and showed him a single page of the same: the page\nin which cl (ii) and the names of the various persons who were allocated\nportions of the 950 TSR shares were written. The first defendant\nshowed the second defendant the latter’s name in the clause and\nindicated that this evidenced the second defendant’s share of the\nGift.",
        "Events after the execution of\nthe Deed": "21     The\nplaintiff’s position is that after December 1988, the siblings (sometimes\nincluding the first defendant) would meet from time to time to discuss\nhow the 950 account should be managed. She said that she acted at all\ntimes with the knowledge, information and consent of all siblings, including\nthe first defendant, and of the second defendant. The 950 account itself\nwas always independently audited so that she could report its net worth\nwhen the siblings held their meetings. 22     These\nmeetings were not formal meetings but took place as family gatherings\nor reunions. One such meeting was in Bangkok in 1994. This gathering\nwas partly to celebrate Mdm Yeo’s birthday and partly to discuss the\nmanagement of the 950 account. According to Lucy Lim, a few days prior\nto the meeting, the first defendant telephoned her and asked her\nto make a request to the meeting and to the other siblings and to\nthe second defendant. He wanted the second defendant’s 1/9thportion\nto be divided into three so that it would be held in equal shares\nby the second defendant, Arlette and Alena. His request was that\nthe siblings or the second defendant should add Arlette’s and Alena’s\nnames to the second defendant’s name as beneficiaries of the 950\naccount. Lucy Lim then passed this request on to the plaintiff. 23     The\nBangkok meeting was attended by all the siblings apart from the first\ndefendant. The second defendant was also absent. Minutes were taken at\nthe meeting and subsequently circulated to the siblings. The plaintiff\nand the siblings who testified on her behalf, ie. Chuan, Amy Tan\nand Lucy Lim, accepted the minutes as reflecting what had happened\nat the meeting. The topics discussed were the maintenance of Mdm\nYeo and how the assets of the 950 account should be dealt with.\nAmongst other things, the attendees agreed on the following: (a)     That\n$2,500 a month should be paid for Mdm Yeo’s rent; (b)     All\nshares belonging to the 950 account would continue to be in the\nplaintiff’s name and any shares in Amy Tan’s name would be transferred\nto the plaintiff. The plaintiff would indicate in her will that the\nassets of the 950 account were held by her in trust for all; and (c)     They\nwere all happy with the management of the 950 account so far and\nthe plaintiff and Amy Tan were to continue to be the trustees. 24     The\nminutes also noted that the first defendant had made a request through\nLucy Lim that the second defendant’s share in the 950 account should\nbe placed in the names of the second defendant, Arlette and Alena. In\nthis regard, it stated that Lucy Lim was to inform the first defendant\nthat the legal advice received by the plaintiff was that since the\nportion was in the second defendant’s name alone, the second defendant\nneeded to write in to all the other beneficiaries to effect the\nchange. According to Lucy Lim, the plaintiff told the meeting that\nthe second defendant was not agreeable to adding his sisters’ names\nto the 950 account. Lucy Lim was tasked with informing the first\ndefendant about the requirement for the second defendant to consent\nto the change and that the second defendant had not agreed to do\nso. 25     The\nonly other meeting at which minutes were taken and subsequently\ncirculated was a meeting held in Malacca on 31 March 2005. This\nmeeting started in the morning and continued to the night. Present were\nthe plaintiff, Lucy Lim, Amy Tan, Nelly Tan, Pof Eng, Chuan, Siong, the\nfirst defendant and the second defendant. The defendants were not present\nin the morning but arrived in Malacca in time to attend the afternoon\nand evening sessions. 26     According\nto the minutes, in the morning the parties discussed the accounts\nand Mdm Yeo’s condition. It was agreed that the plaintiff should continue\nto have the discretion to spend whatever was necessary for Mdm Yeo’s\ncare and maintenance. Pof Eng proposed that since the funds in the 950\naccount were more than sufficient for Mdm Yeo’s maintenance, some distribution\ncould be made to the beneficiaries. He had two proposals: (a) that\nthe excess income after expenses be distributed; or (b) that the\ncapital be halved. He believed that either way there would still\nbe sufficient assets to provide for Mdm Yeo’s care. It should be\nnoted that according to the balance sheet of the 950 account, as\nat 31 December 2004, the total assets of the account amounted to\n$13,497,347.28 of which $2,048,391.48 was held in cash in two bank\naccounts. Further, for the year 2004, the expenses of the fund (basically\nthe cost of looking after Mdm Yeo) had amounted to only $139,575.82. 27     In\nthe afternoon, the defendants were told about the proposals made by\nPof Eng and the siblings and the second defendant then had a long discussion\non these proposals. In this regard, para 15 of the minutes is significant.\nIt is a paragraph on which the first defendant relies to support his\ncase. It says: All agreed that 950 was set up with [Mdm\nYeo’s] shares, and that she is the true owner although legally,\nthe shares are held in [the plaintiff’s] name (and the bank account\nin [Amy Tan’s and the plaintiff’s] names) in trust for the 8 “beneficiaries”.\nThe 950 fund was set up to be used for [Mdm Yeo’s] care and maintenance,\nand that we were considering distributing some of it only because\nof extenuating circumstances. 28     The\nminutes also state that the first defendant was told that the second\ndefendant was the named “beneficiary” and that any distribution had\nto be made directly to the second defendant only. The first defendant apparently\nsaid that he understood the situation and that he would like the siblings\nto impress on the second defendant that the first defendant’s share was\nmeant for his three children if the first defendant was no longer\nalive. 29     As\nregards the proposals made by Pof Eng, the second proposal was rejected.\nThe first proposal was considered a possibility since it would leave the\ncapital intact and available to take care of unforeseen problems.\nChuan and Siong objected to the proposal outright. They felt it\nwas a breach of trust to make any distribution. After dinner, everyone\ngot together for a third proposal made by Siong. He suggested that\nall “the trustees” would be entitled to ask for a loan which would\nbe their portion of the excess of the income of the trust over its\nexpenses. Nominal interest would be charged. The first defendant\nobjected to the suggestion that interest be charged. It was agreed\nthat the for the sake of an unanimous agreement, the interest element\nwould be dropped and interest-free loans offered. According to the minutes,\nall agreed to the third proposal as so modified. 30     After\nthe Malacca meeting, distributions of the surplus income of the 950\naccount were made on an annual basis to each of the “beneficiaries”. The\nsecond defendant as a named beneficiary was given his share of the distribution.\nAccording to the plaintiff, the first defendant never objected to this.\nThe first defendant however asserted that he had objected in no uncertain\nterms to the plaintiff giving a share of the trust income to the second\ndefendant.",
        "Mdm Yeo’s death and subsequent\nevents leading to these proceedings": "31     Mdm\nYeo died on 2 September 2009. A meeting was held on Monday 7 September\n2009 to read Mdm Yeo’s Will and to agree on the distribution of\nthe 950 account. This meeting was attended by the second defendant\nand all the siblings apart from Siong. 32     The\nplaintiff says that the meeting decided that, as the purpose of\nthe 950 account had ended with Mdm Yeo’s death, the 950 account\nwould be liquidated and each beneficiary would be given his or her\nshare in due course. The first defendant asked to read the Will\nhimself and was given the document in order that he could do so.\nHe did not raise any objections to the Will or to the decisions\nmade during the meeting. He did not make any request for the 1/9thportion\nin the second defendant’s name to be paid or to be given to him. 33     The\nplaintiff also says that to determine the transfer fee payable when she\ntransferred the second defendant’s 1/9thportion\nto him, she needed the birth certificate of the defendants to prove\nthat the second defendant was the first defendant’s son and that\nthe first defendant was her brother. She asked both of them for\nthese documents at the meeting. Subsequently, the first defendant\ntold her that he had reminded the second defendant to pass over\nthe birth certificate as soon as possible. There was no indication\nat this time that the first defendant was disputing the second defendant’s entitlement\nto share in the distribution. 34     The\nposition changed a few weeks later. On 22 October 2009, the first defendant,\nthrough his solicitors, sent a letter of demand to the plaintiff\nand Amy Tan. This letter stated that the first defendant was the\nbeneficiary of Mdm Yeo under the Intestate Succession Act and that\nhis “rightful 1/9 share in the estate should be distributed to and\ngiven only to him and in his personal name”. Subsequently, lawyers\nfor the plaintiff and Amy Tan responded to state that Mdm Yeo had\nnot died intestate and that under her will, the only beneficiaries\nwere her four daughters. On 5 November 2009, the first defendant\nthrough his lawyers changed his position again and made a claim\nfor a 1/9 share in the 950 account. The plaintiff did not accept this.\nHer solicitors responded to the effect that when Mdm Yeo made the Gift,\nthe first defendant had given instructions that his share of the\nsame should be given to his son, the second defendant. Therefore\nif the first defendant wanted to retract his gift to his son, he\nwould have to ask the latter to relinquish his rights. 35     Shortly\nthereafter the second defendant also appointed lawyers and correspondence\nsubsequently ensued between all the parties. In February 2010, the\nsecond defendant took the position that there was no basis on which\nthe first defendant could make a claim for a 1/9thshare\nin the 950 account. He asked for that share to be paid to him forthwith.\nThe first defendant did not withdraw his claim.",
        "The proceedings": "36     The\nplaintiff commenced these proceedings by writ in June 2012. In her\nstatement of claim, after setting out the facts and asserting that\nthe dispute was between the first defendant and the second defendant,\nshe stated the respective positions of the defendants as at the\nfiling of the claim to be as follows: (a)     The\nfirst defendant had maintained that it was his intent at all times\nthat his portion of the Gift was to be eventually given to his three\nchildren, including the second defendant, equally; and (b)     The\nsecond defendant had maintained that it was the intent of the first\ndefendant that the first defendant’s portion was to be given to the\nsecond defendant absolutely. 37     The\nplaintiff went on in para 5 of the statement of claim to formulate what\nshe saw as the issues raised by the dispute between the defendants. Among\nthese are: (a)     When\nthe first defendant initially placed his 1/9thshare\ninto the name of the second defendant was it an outright gift? (b)     Did\nthe first defendant have any rights or residual rights over the\n1/9thshare? (c)     Was\nthe second defendant to hold the 1/9thshare\nfor the benefit of all the first defendant’s children in equal shares? (d)     Which\nparty is the lawful beneficiary of the 1/9thshare? 38     The\nfirst defendant filed a long defence. At first he based his defence on\nthe premise that Mdm Yeo had died intestate and as one of her children he\nwas entitled to a 1/9thportion of the\nestate under the laws of intestacy. A copy of the will was then\nforwarded to his lawyers and the first defendant’s defence was amended.\nThe material averments of the amended defence can be summarised\nas follows: (a)     At\nall material times, the assets of the 950 account were in law and\nfact beneficially owned by Mdm Yeo. (b)     In\nabout 1981, Mdm Yeo created a trust whereby her shares in TSR were\nto be held on trust for herself until her death and thereafter, the\ntrust funds were to be distributed equally to her lawful children and\nnone other. (c)     Mdm\nYeo had 9 lawful children including the first defendant; the second\ndefendant who is the son of the first defendant was not a beneficiary\nof the 950 account. (d)     The\nplaintiff was the trustee of the 950 account; she administered the\naccount during Mdm Yeo’s lifetime and upon Mdm Yeo’s demise distributed\n8/9thof the assets to the children of\nMdm Yeo, including herself, but failed refused and neglected to\ndistribute the 1/9thshare due to the\nfirst defendant despite his demand on 22 October 2009. (e)     As\na result, the plaintiff is in breach of her duties as trustee of the\n950 account. (f)     HAPL\nwas a limited company created solely for the purpose of receiving\nfunds due to Mdm Yeo and maintaining her from the dividends generated\nby her shares. All the assets of HAPL were held as trust assets\nfor Mdm Yeo under the 950 account. (g)     The\ndirectors of HAPL had no right to transfer the assets of the 950\naccount to Mdm Yeo’s children before her death. (h)     He\ndenied that he had chosen to have his share transferred to the name\nof the second defendant and asserted that the directors of HAPL\nacted wrongfully in putting the share in the name of the second defendant\nwho, at the material time, had no legal capacity or right to hold\nany shares in HAPL. In any event, any share held by the second defendant\nin HAPL was held as a nominee and on trust for the first defendant\nand was never intended to be given to the second defendant. As the\nsecond defendant was an infant at the material time, any share transfer\nto him would have been invalid in law. (i)     The\ndissolution of HAPL did not detract from its object and the beneficial\ninterest in all the shares of HAPL was held on trust and for the\nsole benefit of Mdm Yeo in accordance with the 950 account. The purpose\nof the 950 account was to generate income for the maintenance of\nMdm Yeo. (j)     The\nfirst defendant was not a party to the Deed and the alleged designation\nof the second defendant as the named owner of a 1/9thportion\nwas invalid for, at all material times, the true owner was Mdm Yeo. (k)     The\nplaintiff by her conduct in seeking to divest the ownership of Mdm\nYeo’s assets during Mdm Yeo’s lifetime had acted in breach of trust. (l)     On\nMdm Yeo’s death, her estate comprising the whole of the 950 account\nought to have been distributed in accordance with her intention\nin equal shares to her beneficiaries who were her nine children. (m)     The\nplaintiff was in breach of her duties as trustee of the 950 account\nand had initiated unnecessary proceedings. The 950 account should\nnot be penalised for costs and the plaintiff and/or the second defendant\nshould be made to bear the legal costs of the proceedings on an\nindemnity basis. 39     I\nhave set out the first defendant’s pleadings in some detail so as\nto indicate the whole thrust of his case which the second defendant\nhad to meet. The significance of this will be apparent later. 40     The\nsecond defendant put in a defence and counterclaim. He admitted\nmost of the averments of the plaintiff in the Statement of Claim\nin relation to the origin and history of the 950 account. He noted\nthat the plaintiff had confirmed in para 55 in the Statement of\nClaim that in 1983, the first defendant had asked her to put his\n1/9thshare of the 950 account in the\nname of the second defendant. He relied on the plaintiff’s pleadings\nas to the relative positions of the first and second defendants\nin respect of the 950 account. Accordingly his position is: (a)     The\nplaintiff has failed in her duties as trustee of the 950 account by\nnot adhering to the fact that a 1/9thshare\nthereof has always been in the name of the second defendant and\nthe plaintiff has no legal basis on which to withhold payment of\nthis share to the second defendant; (b)     The\nplaintiff has breached her duties as trustee of the 950 account\nby not distributing to the second defendant the money to which he\nis entitled. The plaintiff had no need to apply to the court for directions\nand it was for the second defendant to seek his remedy, if any,\nin the courts; (c)     The\npresent proceedings are unnecessary and unreasonable and the plaintiff\nshould not be entitled to recover costs on any basis. 41     In\nrelation to the first defendant’s defence, the second defendant denied\nthe substantive claims of the first defendant. Essentially, he maintained\nthat a gift had been made to him of the first defendant’s interest in\nthe 950 account. The main bases for this assertion were that: (a)     By\ngiving instructions that the 1/9thshare\nof the 950 account should be registered in the name of the second\ndefendant, the first defendant made an absolute gift of the same\nto the second defendant. (b)     In\nthe alternative, these instructions amounted to an advancement to\nthe second defendant as the son of the first defendant. 42     In\nhis counterclaim, the second defendant claims payment of the sum of\nmoney in the 950 account which represents his 1/9thshare,\ninterest and costs.",
        "Issues": "43     The\nmain issues arising from the pleadings are: (a)     When\nshe transferred her 950 TSR shares to HAPL, was Mdm Yeo making a\ngift of the same to her children or was she setting up a trust for\nherself for her lifetime and thereafter for her children? (b)     If\na gift was made, what happened to the first defendant’s share in\nthe gift? (c)     Was\nthe plaintiff justified in commencing this lawsuit and can she be\nindemnified for costs?",
        "Did Mdm Yeo make a gift or declare\na trust?": "",
        "The evidence": "44     The\nlegal position regarding the effect of the legal transfer of property by\none person to another free of any obligation on the part of the\nrecipient to pay for the same is not in doubt. Whether the recipient\nbecomes the legal and beneficial owner of the transferred property\nor becomes only the legal owner, holding the beneficial interest\non trust for the transferor, depends on the intention of the transferor.\nThis intention may be expressed orally or in writing or may be inferred\nfrom conduct and circumstances. 45     On\nbehalf of the plaintiff, Chuan was the main witness as to Mdm Yeo’s\nintentions in 1981. He testified that he and Siong set up HAPL as\nan investment holding company to manage Mdm Yeo’s shareholdings\nin TSR and GSPL. He said that this arrangement arose out of his\nidea to do estate planning for his mother. Chuan thought estate\nplanning would ensure a smooth transition of Mdm Yeo’s TSR and GSPL\nshares which had the potential to become very valuable one day.\nHe approached his mother and advised her that, for estate planning\npurposes, she should look into giving her shares away and asked\nher who she wanted to give them to. Mdm Yeo was receptive to estate\nplanning and told him that she wanted to give the shares to her\nnine children equally. The purpose of the estate planning was to\neffect an immediate distribution of the shares and not a distribution upon\nMdm Yeo’s death. Mdm Yeo knew this and was agreeable to the idea. 46     Chuan\nalso advised his mother that the best way of disposing of her shares\nfor estate planning purposes would be to set up a company which could\nbuy over the shares and then the shareholders of the company would hold\nits shares in proportion to their interests in her gift. Chuan testified that\nMdm Yeo had not told him anything about holding the shares in a trust.\nHe subsequently informed some of his siblings, including the second defendant\nand Pof Eng, about Mdm Yeo’s intentions and told them that their\nmother wanted to give each of them a 1/9th portion of her TSR and GSPL\nshares. 47     Chuan\nwas the only child who spoke directly to Mdm Yeo about her intentions.\nLucy Lim’s evidence was that she was told contemporaneously by Chuan\nthat her mother wanted to give her shares to all the nine children and\nthat this gift would be effected by transferring the shares to HAPL\nand making the children shareholders of HAPL. At the time, Lucy\nLim was living in the United States. She did not speak to her mother\nabout the latter’s intentions. 48     Whilst\nAmy Tan did not speak to Mdm Yeo about the shares, her testimony\nwas that Chuan told her about Mdm Yeo’s intention to make her children\na gift of the shares and that he did so in their mother’s presence.\nAt that time Mdm Yeo was in her early sixties and was in good health.\nThe plaintiff herself was not able to add any direct evidence on\nthis point. All she could say was that at all times all of Mdm Yeo’s\nchildren knew that it was their mother’s intent to give away her\nshares in TSR and GS before her death. 49     In\nhis affidavit, the first defendant asserted that it was always his\nlate mother’s intention throughout her lifetime right up to the\ndate of her death that only her children surviving at her demise\nwould be entitled to her shares in TSR and GSPL. He did not say\nin that affidavit how he knew what Mdm Yeo’s intention was. When\nhe was questioned about this in court, he said that until this case\nstarted, he did not know exactly whether his mother held shares\nin TSR and GSPL because she had not discussed the matter with him.\nAll he knew was that his mother was very rich. His mother told him that\nshe had so much money and that when she died she wanted to see that all\nher children would have one share of her money. However, she did\nnot tell him what share counters she had. He also said that he assumed\nthat Mdm Yeo would never give him anything whilst she was alive.\nThat was more or less the sum total of his evidence on Mdm Yeo’s\nintentions. 50     Pof\nEng, who testified on behalf of the first defendant, asserted in\nhis affidavit that Mdm Yeo created a trust of her TSR and GSPL shares\nso that the dividends arising from the shares would be accumulated\nand held on trust to maintain her during her lifetime and, after\nher demise, the accumulated proceeds would be divided equally amongst\nher nine children. In court, he elaborated that Mdm Yeo had told\nhim this during her lifetime. She had said that she wanted her shares\nto be given to her children after her death. She also said that\nthere was a company which was holding the shares for her and this\ncompany would pay for all her expenses throughout her years. 51     Apart\nfrom assertions as to what Mdm Yeo told her children, there are\nsome other pieces of evidence that may assist in solving the puzzle.\nFirst, there is the fact that between 1981 and 1988 when the Deed\nwas executed, no dividends were paid to HAPL in respect of the TSR\nand GSPL shares and HAPL did not maintain Mdm Yeo. Until his death\nin November 1983, Mdm Yeo’s husband maintained her. After that,\nshe was maintained out of her own funds and also by some of her\nchildren. Nothing was paid by HAPL. This evidence supports the plaintiff’s\nposition because if Mdm Yeo had no need of income from the TSR and\nGSPL shares in 1981 and, in any case, these counters were not income-producing\nthen she would have had no cause to create a trust of the income\nfor her own support. It was the undisputed evidence of the plaintiff\nthat it was only sometime after 1988, when the liquidator of TSR\nmade a distribution in specie of UOB shares as representing contributories’\nholdings in TSR, that the 950 account started receiving dividend\nincome. 52     The\nnext piece of evidence relates to the manner in which the TSR and\nGSPL shares were transferred to HAPL. While it is the plaintiff’s position\nthat they were transferred to HAPL as a gift to her children, that company\nin fact passed a resolution to purchase the TSR shares for $158,000.\nThere was probably a similar resolution in respect of the GSPL shares\nbut that was not produced in court. Chuan’s evidence was that HAPL\npaid Mdm Yeo cash of $168,000 for both counters and that he himself\nhad financed this payment by selling his own publicly listed shares. Upon\nreflection I think that this evidence, if true, is by itself neutral\nvis a vis the parties’ respective positions. The usual inference\nthat is drawn when a company acquires an asset for value is that\nthe company itself is the legal and beneficial owner of the asset.\nIt does not hold that asset on trust for the vendor nor do its own\nshareholders have any interest in the asset. Thus, while a sale\nof the shares would militate against an intention to make a gift, it\nwould also militate against the establishment of a trust in favour\nof Mdm Yeo herself. 53     There\nis, however, evidence from Lucy Lim as to why the transfer was structured\nas a purchase. She explained that there was a concern that unless valuable\nconsideration was shown as having been paid, the authorities would\nnot accept that Mdm Yeo had genuinely disposed of her assets and then\nthe estate planning exercise would have failed. Lucy Lim also believed that\nthe consideration paid was nominal and it was not until these proceedings\nstarted and she saw the resolution passed by HAPL that she changed\nher mind and accepted that a substantial sum had been paid. In fact,\nthere is no evidence that this payment was anything more than a\npaper transaction. No document supported Chuan’s assertion that\nhe had sold his shares and that Mdm Yeo had received the full amount\nof $168,000. It is significant that when it came to the Deed, although\nthe same mentioned large sums of money as purchase consideration\nfor the various transfers that took place pursuant to the Deed,\nthe evidence of some of the parties to the Deed was that they had\nnot paid anything to each other. Chuan himself was unable to say\nwhether any money had changed hands in relation to the Deed. He\nsaid that he did not know about this and that, because by then he was\nno longer in charge of HAPL, he had relied on Siong who was “performing\nthe mechanics” required to effect the transactions agreed to in the\nDeed. 54     Chuan\ntestified that it was he who came up with the mechanism for the\ntransfer of his mother’s shares in order to give effect to her intention\nto gift them to her children. He invited his siblings to subscribe\nfor shares in HAPL. His siblings agreed to this but not all of them\ntook up the subscriptions in their own names. He also testified\nthat they were each allotted 22,000 shares but he could not remember\nhow many paid for the shares and how many did not. The first defendant\ncriticised this evidence as being unsupported by documents or the\ntestimony of the plaintiff, Lucy Lim and Amy Tan. Also the first\ndefendant denied Chuan’s assertion that he had paid for shares in\nHAPL. In my view, what was important in this arrangement was that\nthe siblings took up shares in HAPL. No doubt if they paid for the\nshares that could be considered some indication that no gift was\nmade. It could mean equally that HAPL was not intended to be a trustee\nas it would be odd for the siblings to pay for shares in a company which\nwas going to hold a substantial portion of its assets on trust for Madam\nYeo. The true import of their becoming shareholders was that this was\nconsistent with an intention to make a gift of the shares to them,\nalbeit through this mechanism their interests were indirect. If\nHAPL’s purpose was only to manage Mdm Yeo’s shares as trustee, Siong\nand Chuan could have remained its sole shareholders and there would\nhave been no need to involve any other sibling as a shareholder.\nThese two brothers would then have been able to manage the company\nwithout having to be accountable, even notionally, to anyone else. 55     The\nnext piece of evidence is the Deed itself. This provides for 950\nof HAPL’s TSR shares to be transferred to the eight persons named\nin cl (ii) and for one of these persons to receive 2/9thsof\nthe 950 TSR shares while the other seven were to receive 1/9theach\nof the same corpus. In my view, the distribution of the 950 shares\nto eight persons was not consistent with the same being held on\ntrust for Mdm Yeo. If that were the case, it would have been simpler\nto provide for the shares to be transferred to one sibling to be held\non trust for Mdm Yeo during her lifetime. Instead there was this somewhat\nawkward arrangement of a declared transfer to all eight and then a\nprovision whereby the parties to the Deed agreed to hold the shares\nintact during Mdm Yeo’s lifetime. The fact that they had to make\nsuch an agreement also supports the inference that the 950 TSR shares\nno longer belonged to Mdm Yeo. This conclusion is reinforced by\ncl (iii) of the Deed which expressly provides in respect of the\n1600 TSR shares “purchased” by the Purchasers and Vendors that in\nthe event the transfer to them was not effected, they would nevertheless\nretain the beneficial ownership of the shares. 56     Next,\nI come to the parties’ conduct after the execution of the Deed. The\nfirst defendant submitted that the conduct of the Plaintiff and\nher witnesses in keeping the 950 account “intact” during Mdm Yeo’s\nlifetime and only distributing it on her death rebutted the plaintiff’s\nclaim that Mdm Yeo had given away the 950 TSR shares in her lifetime.\nHe laid emphasis on the fact that the minutes of the Malacca meeting\nreferred to all attendees agreeing “that 950 was set up with [Mdm\nYeo’s] shares, and that she is the true owner”. He said that this\nreflected the true position of the 950 account. 57     Having\nconsidered all of the evidence of the parties’ conduct after the establishment\nof the 950 trust, I am satisfied that the same reflected the common\nunderstanding of the siblings (except perhaps that of the first defendant)\nthat Mdm Yeo had given away her shares to her children absolutely.\nTheir conduct at the two meetings supports Chuan’s evidence as to\nthe original reason for the transfer of the shares to HAPL rather\nthan the first defendant’s assertions in this regard. 58     Chuan\nand Lucy Lim also testified that the reason why the Deed was executed\nwas that many of the siblings wanted to take back control over the shares\nthat they had injected into HAPL. At that time Mdm Yeo had her own\nmoney but the siblings generally thought that whatever she had given them\nmight have to be used to support her as well. They felt it would\nbe best to keep her gift intact and use it to support her as long\nas she lived. This was the reason why the 950 account was set up\ninstead of making an immediate distribution of the Gift. 59     I\naccept the evidence that after 1988, the siblings met from time\nto time and continued to discuss how Mdm Yeo should be looked after. Generally\nthey were happy with the way that the 950 trust was administered by\nthe plaintiff and Amy Tan. The minutes of the Bangkok meeting in\n1994 reflect some of these discussions in particular in relation\nto her accommodation. At that meeting, the attendees (who included\nPof Eng) agreed that if the property market stabilised, a property\nshould be purchased for Mdm Yeo and in the event of her death, that\nproperty should be sold by the beneficiaries entitled to it either\nunder her will or under the intestate succession law and the sale\nproceeds should be distributed to the parties in accordance with\ntheir entitlements under the 950 account. This is significant because\nit meant that the proceeds of any property purchased for Mdm Yeo\nwith the assets of the 950 account would go back to the beneficiaries\nof the 950 account and would not be distributed in accordance with\nher will or the laws of intestacy. Such an agreement was contrary\nto the first defendant’s stand that upon Mdm Yeo’s death, the proceeds\nof the 950 account were to be divided equally amongst her children.\nIn this regard, I accept the testimony given for the plaintiff that\nthe siblings regarded the second defendant as a beneficiary of the\n950 account and that until this action was started no claim was\nmade that it was the first defendant who was the true beneficiary\nin place of his son. 60     The\nminutes of the Bangkok meeting also noted that all shares belonging\nto the 950 account were to be put in the plaintiff’s name and that she\nwas to make a provision in her will that such shares were held in\ntrust by her “for all”. Further the plaintiff was to declare her\nproportion of dividends received from the shares belonging to the\n950 account as her income and, again significantly, “everyone is\nadvised to do likewise”. All the siblings apart from the first defendant\nattended this meeting and these two agreements that I have referred\nto demonstrate their understanding that the 950 account belonged\nto them not Mdm Yeo. 61     Moving\non to the minutes of the Malacca meeting in 2005, I deal first with\nthe reference to Mdm Yeo being the true owner of the TSR shares. Lucy\nLim took the minutes and she was asked why she had written this.\nHer response was that she had put it this way because she felt that\nthe siblings were morally obliged to use the funds in the 950 account\nfor their mother’s benefit. This had come up because Pof Eng had\nasked for the funds to be distributed and the others felt, some\nstrongly, some less so, that they should not touch the money in\ncase Mdm Yeo needed it. However in the end it was agreed that some\ndistribution should be made of the income. I accept this explanation\nand that Lucy Lim meant to indicate that Mdm Yeo was the original\nowner of the 950 TSR shares and not that she was the legal owner\nof the assets in the 950 account as at 2005. 62     Apart\nfrom the statement as to the “true ownership” of the trust funds,\nthe discussion of the distribution of surplus funds as reflected\nin the Malacca minutes demonstrate the siblings’ understanding that\nthey were the beneficial owners of the assets of the 950 account.\nThe proposal regarding distribution came from Pof Eng. He made two\nsuggestions: distribute excess income after expenditure or, secondly,\nhalve the capital. These suggestions were not consistent with the\nposition he took in court that the assets belonged to Mdm Yeo for\nher lifetime and that the siblings’ entitlement would only arise\nafter her death. When he was asked in court how he could have made\na proposal that was against Mdm Yeo’s intent (as asserted by him)\nthat the assets should belong to her for life, he said he did not\nsee anything wrong in it. When pressed, his response was that the proposals\nwould not harm her. 63     The\nmeeting discussed Pof Eng’s proposal and, as noted above, the eventual\nconclusion was that the capital had to be kept intact but that excess income\ncould be distributed as loans. Pof Eng agreed in court that it had been\ndecided at the meeting that the proposal to make a distribution\nwould not be implemented unless there was unanimous agreement on\nthe same. It was pointed out to him that the decision for unanimous\nagreement by the siblings and the second defendant would be inconsistent\nwith his stand that the only trustees of the 950 account were Siong\nand Chuan (this was a position also taken by the first defendant).\nHis reply was that the inconsistency had not occurred to him at\nthe time. At a later point in his testimony, he maintained that\nwhen he made the proposal he was hoping that in the circumstances\nthe siblings could utilise the surplus assets whether this course\nwas right or wrong in respect to the fact that this account was\na trust for Mdm Yeo. It can be seen that he was not able to rationalise\nhis inconsistent positions. 64     It\nis worth noting that subsequent to this meeting, annual distributions\nof the surplus income were made to the eight persons named in the\nDeed and that Pof Eng received and kept 2/9thsof\neach such distribution. None of the recipients objected to the distributions.\nOn 18 April 2007 Lucy Lim sent an email to each of the eight, including\nPof Eng and the second defendant. She attached the final accounts\nof the 950 account for 2006 to the email. In its text, she said\nthat based on the decision to distribute the excess of income over\nexpenses, the distribution in 2007 would come to $50,000 per 1/9thshare.\nShe asked for instructions on how each person wanted their distribution\ngiven to them and stated that objections should be raised by 29\nApril 2007. There was no evidence that Pof Eng, or for that matter\nanyone else, objected to the distribution whether by the stated\ndate or thereafter. 65     I\nalso find it significant that the first defendant had contributed\nto the discussion on distribution during the Malacca meeting. In\nrelation to the proposal that it be by way of loan which could either\nbe repaid at the option of the recipient or deducted from the final\ndistribution, he objected to the suggestion that interest be charged.\nThe minutes do not note any objection by him to distributionpersethough\nthey do state that Chuan and Siong felt such action would be a breach\nof trust. 66     On\na consideration of all the evidence I am satisfied that it has been proved\non a balance of probabilities that it was Mdm Yeo’s intention in 1980\nor 1981 to make an immediate gift of her shares to her children\nin equal shares. I accept Chuan’s oral evidence as to how the Gift\narose and that his mother had clearly expressed her intention to\nhim. I also accept the evidence of the plaintiff and her sisters\nthat the common understanding of all the siblings including the\nfirst defendant was that this was a gift and they were intended\nto be the absolute owners of their mother’s shares. I do not accept\nPof Eng’s evidence that his mother told him something different.\nAs I have pointed out above his conduct was inconsistent with such\nan understanding. In fact, his acceptance that he had a 2/9thinterest\nin the 950 account was in itself contrary to his stand that the\nsiblings’ rights would only arise on Mdm Yeo’s death. When he was\nquestioned about this, he was not able to explain how Tan Poh Lim\ncould have given him the extra 1/9thportion\nat the very beginning in 1981 or thereabouts when Mdm Yeo was still\nalive. Further, it did not make sense for Mdm Yeo to transfer her\nshares to HAPL if her intention was for the company to hold and\nuse the shares for her benefit. Such an intention would mean that\nshe had not relinquished all interest in the shares and would have\nrisked nullifying the aim of taking the shares out of her estate\nso as to avoid estate duties on her death. The plaintiff’s explanation\nthat the shares were transferred to HAPL as the mechanism by which\nthe Gift was effected is a more coherent explanation than the first\ndefendant’s explanation that the transfer was a way of setting up\na trust for Mdm Yeo’s benefit. 67     I\nshould also state that I did not find the first defendant to be\na credible witness. He was frequently evasive in his testimony and\nalso prevaricated a great deal. Often he was not able to give coherent\nanswers to the questions he was asked. His testimony on Mdm Yeo’s\nintentions, in particular, appeared to be made up. He admitted that\nMdm Yeo had never spoken to him about the shares and asserted that\nhe did not even know that there were such shares. All his mother\ntold him, he said was that she was a rich woman and wanted her money\nto go to her children on her death. If this is what Mdm Yeo told\nhim, then it was far from establishing that she intended HAPL to\nhold the shares she transferred to it on trust for her during her\nlifetime. I think that the first defendant did not have any direct knowledge\nof Mdm Yeo’s intention in relation to the shares and that whatever\nhe said on this topic was fabricated. Some support for this conclusion\nalso comes from the way he framed his case in the first place—as a\nclaim for his entitlement in his mother’s alleged intestacy. The\nclaim was pleaded this way despite the fact that the first defendant\nhad read Mdm Yeo’s will shortly after her death and should have\nknown that he inherited nothing under the will. I infer that the\nbasis of the first defendant’s claim only changed when he realised\nthat his original cause of action was a non-starter. 68     I\nhold that Mdm Yeo’s gift to her children was completed when she transferred\nher shares to HAPL. The 950 account was a fund that was set up in\n1988 by the children as the owners of the Gift in order to have\nready resources to maintain their mother. At that time Mdm Yeo had\nno beneficial interest in the Gift and no right to tell her children\nwhat to do with the 950 account.",
        "What happened to the first defendant’s\nportion of Mdm Yeo’s gift?": "69     The\nfirst defendant did not give any positive evidence as to what had happened\nto the 1/9thportion of the Gift that\nhad been intended for him. He could not do so because his position\nwas that there was no gift that took effect in 1981 and that it\nwas not until his mother’s death in 2009 that her children became\nentitled to share in the assets of the 950 account. However, there\nwas a great deal of evidence from the witnesses for the plaintiff\nas to what the first defendant had wanted to do and had done. Whilst\nthe first defendant denied he had said what they testified to, there\nwas also some documentary evidence supporting their testimony. This\ntook the form of a letter written in 1988 and the minutes for the\nBangkok and Malacca meetings. I am satisfied on the basis of all\nthe evidence that the first defendant intended to give his portion\nof the gift to his three children in equal shares but that, equally,\nhe had directed that it be put in the name of the second defendant.\nSome of this evidence is set out below. 70     Chuan\ntestified that all nine children were to be allotted shares in HAPL\nequally in order to reflect Mdm Yeo’s intention that the Gift was\nto be distributed equally amongst them. He remembered that the first defendant\nhad told him and Siong that the first defendant’s portion should be\nput in the second defendant’s name for the second defendant to hold\non behalf of himself and his sisters. Chuan did not recall whether\nhe had told the other siblings about this. The plaintiff’s testimony\nwas that she knew that the first defendant had given his portion\nto the second defendant but did not know until after the start of\nthese proceedings what the first defendant’s intentions had been\nin 1983. 71     Amy\nTan testified that after Mdm Yeo had decided to make the Gift, she\nhad been present at a meeting in the family home amongst herself, Siong,\nChuan, Pof Eng, Poh Lin and the first defendant. It was at this meeting\nthat she heard the first defendant say that his portion of the Gift should\nbe put in the second defendant’s name. 72     Further,\nthe plaintiff testified that in 1987 when she was living in Toronto,\nsome of the siblings had visited her and discussed the 950 TSR shares.\nThis was at a time when the siblings were considering taking the TSR\nshares out of HAPL. During this visit, the first defendant had stated that\nhe still wanted his portion to remain in the second defendant’s\nname. This testimony was given after Amy Tan produced a letter dated\n3 January 1988 which the plaintiff had written to her to inform\nher about the Toronto discussions. The letter states that in the\ncourse of those meetings, the plaintiff herself heard the first\ndefendant say that he wanted “Andrew’s [that is the second defendant’s]\nname down”. 73     The\nother evidence of the first defendant’s intentions comes from what\nhe said in 1994 and 2005. In 1994, he asked Lucy Lim whether the portion\nof the 950 account in the second defendant’s name could be put into\nhis daughters’ names as well. The plaintiff took legal advice on\nthis query and informed the meeting that for this to be effected\nthe second defendant had to agree. This outcome was conveyed to\nthe first defendant. Then in 2005, according to the Malacca minutes,\nthe first defendant was told that the second defendant was the “named\n‘beneficiary’” and that distribution could be made to the second\ndefendant only. Changes could be effected only with the second defendant’s\nconsent. The minutes went on to record that the first defendant\nstated that he understood the situation and that he wanted the others\nto impress on the second defendant that the first defendant’s original\nportion was meant for his three children in the event of his death. 74     Thus,\nI am satisfied that in or about 1983 when the issue came up about\nallotting shares in HAPL, the first defendant gave instructions\nthat his portion should be put in the second defendant’s name. There\nis no evidence that, following these instructions, HAPL shares were\nindeed allotted to the second defendant. However, there is no evidence\nthat they were put in the first defendant’s name either. Chuan did\nproduce a document which he said showed the shareholders of HAPL\nfrom time to time. That was a handwritten document allegedly based\non the records of HAPL. However, neither such records nor the maker\nof the document were produced. As such the document was hearsay\nand could not be relied on as evidence. Therefore it is only the\nappearance of the second defendant’s name in the Deed that shows\nhow the first defendant’s instructions were given effect to. I accept\nthe evidence given for the plaintiff that the Deed was drafted in\nthe way it was because the other siblings believed that the first defendant\nhad given his share of the Gift to the second defendant and accordingly,\nthat the second defendant had a 1/9thinterest\nin the 950 TSR shares when they were transferred out of HAPL. 75     I\nshould also say that I accept the second defendant’s evidence that\non two occasions in the 1980s the first defendant told him that\nhe had given the second defendant his share of the Gift. I am not\nso sure that the first defendant also stated expressly that Arlette\nand Alena were not to have any share in the same as this evidence\nof the second defendant is rather self-serving and is also contradicted\nby the evidence of Chuan that he knew from 1983 that the first defendant\nwanted all his children to benefit equally. On the other hand, I\nam satisfied that the first defendant never told the second defendant\nthat he was to hold the portion of the Gift for himself and his\nsisters. There was no evidence at all of such a declaration, least\nof all from the first defendant himself. 76     The\nquestion that arises is whether on the facts as I have found them, the\nfirst defendant made an effective gift to the second defendant.\nThe first defendant submitted that even if he had asked Chuan to\nallot 22,000 HAPL shares to the second defendant instead of to himself,\nthat instruction only related to HAPL shares and could not have\nin any way related or affected his portion of the Gift. If at all\nthere was any gift from the first defendant to the second defendant,\nthat gift was of HAPL shares only. In any event that could not have\nbeen a valid gift because as an infant the second defendant could\nnot become the owner of shares. He also argued that since there\nwas no documentary evidence of the gift to his son and he gave Chuan\noral instructions only, in law, no valid gift could have been made.\nThis was because under s 7(2) of the Civil Law Act (Cap 43, 1999\nRev Ed) (“the CLA”) a disposition of an equitable interest must\nbe made in writing signed by the person disposing of the same. 77     On\nthe evidence, I do not accept that the first defendant’s intentions were\nonly that his son should have 22,000 HAPL shares and that intention did\nnot relate to the Gift. The first defendant was aware that the way\nin which the Gift was to be completed was by the allotment of shares\nin HAPL and therefore that becoming shareholders of that company\nwas the way in which the children would accept their mother’s gift.\nIn giving Chuan instructions to make the second defendant a shareholder\nof HAPL in his place, the first defendant knew and intended that\nthis would in effect pass to the second defendant the first defendant’s\nright to take up a 1/9thportion of the\nGift in the designated manner. It is significant in this respect\nthat in later years the first defendant did not assert a personal\nright to the Gift; rather his position was that his portion was\nto be shared equally amongst his children. 78     In\nrelation to the second argument, it is not the law that as an infant the\nsecond defendant could not be the owner of shares in 1983. He could\nbe allotted shares or become the owner of the same by legal transfer.\nAny such allotment or transfer of company shares to him during his\ninfancy would be voidable but not void. The avoidance would have\nto be done by the second defendant himself on reaching his majority\nand a third party would have no standing to challenge the validity\nof the transaction.Walter Woon on Company\nLawat para 5.4 makes clear that an infant may repudiate\nsuch allotment or transfer within a reasonable time of reaching\nhis majority but is bound by it if he affirms it after coming of\nage. The position is similar in Australia and England (see also:Hamilton v Vaughan-Sherrin Electrical Co[1894]\n3 Ch 589). The second defendant never repudiated the Gift. The first defendant’s\nsecond argument therefore fails. 79     It\nis the third argument that has given me some concern. Section 7(2) of\nthe CLA was only enacted in 1993 but it was derived from the English Statute\nof Frauds 1677 and was accepted as part of Singapore law before 1993.\nThus the same requirement as to the manner in which equitable interests\ncould be effectively disposed of or transferred applied here in\n1983 and 1988. It is undisputed that the first defendant never made\nany writing in which he indicated his intention to make a gift of\nhis portion of the Gift either to the second defendant alone or\nto his three children equally. This submission would therefore seem\nto be an absolute answer to the second defendant’s claim. 80     I\nhave, however, come to the conclusion that it is not. As would be apparent\nfrom the detailed summary of the first defendant’s defence at [38] above,\nhe did not plead s 7(2) or the preceding English legislation as\na basis on which to invalidate the alleged gift. It is a basic principle\nof our system of civil litigation that a litigant must plead the\nmaterial facts on which he relies so as to allow the opponent a\nchance to meet the case. Whilst in general legal principles need\nnot be pleaded, this is not so when one is relying on a specific\nstatutory provision such as the Limitation Act or the Statute of Frauds\nto found a defence. At the least, material facts should be pleaded\nso as to alert the opponent to the position that is being taken.\nThe first defendant could have pleaded that any gift made to the\nsecond defendant was oral and therefore legally ineffective for\nwant of compliance with the requisite formalities. He had no trouble\npleading that the gift was not valid at law because of the second\ndefendant’s infancy at the material time but did not take the further\nstep of pleading that the formalities required to complete the gift\nhad not been taken. That he did not do so is perhaps not surprising\nsince most of his defence was given over to his stand that Mdm Yeo\nhad not made the Gift but had declared a trust under which he could only\nbenefit upon her death. It is, however, a defect which prevents\nhim from raising the argument now. 81     It\nis well established that a party is bound by his pleaded case. InAbdul Latif Bin Mohammed Thahiar (trading as Canary\nAgencies) v Saeed Husain s/o Hakim Gulam Hohiudin (trading as United\nLimousine)[2003] 2 SLR(R) 61, the plaintiff’s solicitor\nhad failed to amend the pleadings on appeal regarding the quantum\nof damages, even though the accountant’s report in evidence had\nmentioned a higher sum than that awarded by the trial judge. On\nappeal, it was held that it is settled law that parties stand by their\npleaded case and any defect in the pleadings could not be cured\nby averments in affidavits or references in counsel’s closing speech. 82     In\nthe present case, if the first defendant had pleaded the lack of formalities\nthe second defendant would have had the opportunity to meet the\ncase by pleading facts that could perhaps have established the applicability\nof the rule laid down inVandervell v Inland\nRevenue Commissioners[1967] 2 A.C. 291 (which sets out\nthe circumstances in which s 7(2) is inapplicable) or laid the foundation\nfor a plea of estoppel or part performance as a rebuttal to the\nfirst defendant’s position. Evidence could then have been led in\nsupport of the pleas. Whether the pleas would have succeeded is\nnot the point; by failing to plead such a position, the first defendant\nindicated he was not taking the point and the second defendant was\nentitled to rely on its omission. For me to now allow the first\ndefendant to deprive the second defendant of his interest in the\n950 account on the basis of an unpleaded point would not only be\nunjust but would also undermine the importance of pleadings in civil\nlitigation. 83     The\nfirst defendant also argued that even if the second defendant acquired\nan interest in the Gift, he held that interest on trust for the\nfirst defendant. I do not accept that argument. Apart from the fact\nthat the second defendant was then an infant and thus unable to\nbe a trustee, the presumption of advancement which the second defendant\nrelied on would mean that the first defendant could only claw back\nhis interest in the Gift from his son if he could prove that it\nwas not his intention to make a gift. The evidence before me established\nplainly that at the material time the first defendant’s intention\nwas to give away his portion of the Gift. He gave directions for\nit to be put in his son’s name with this intention and while he might\nhave wanted the second defendant to hold it for his sisters as well\nas himself, he did not tell the second defendant this. What he told\nhis brother Chuan in this regard was not material to the manner\nin which the second defendant received the gift from the first defendant.\nFurther, in reference to the second defendant, no attempt was made\nby the first defendant to impose a trust for the benefit of Arlette\nand Alena. Thus even if the second defendant’s and his mother’s\nevidence that the first defendant specifically told them that his\ninterest in the Gift was being passed on only to the second defendant\nis not accepted, no trust for the sisters was constituted. I should\npoint out that in any case due to the second defendant’s lack of\nlegal capacity in the early 1980s, he could not have been a trustee\nfor his sisters. 84     I\nhold that the second defendant is entitled to receive the remaining undistributed\n1/9thportion of the 950 account free\nfrom any claim of the first defendant.",
        "Costs": "85     The\nplaintiff has asked to be indemnified in respect of the costs of these\nproceedings out of the trust monies in her hands. Her argument is that\nshe had to commence these proceedings because she was faced with two\ncompeting and incompatible claims to the funds. She had done her\nbest to get the defendants to meet and sort out the conundrum but\nthey did not respond to her requests. Nor did either defendant take\nany step to obtain a court order so she was left with no choice\nbut to start the present action. 86     The\nsecond defendant submitted that this litigation was unnecessary and\nit would not be reasonable to deduct the plaintiff’s costs out of\nthe remaining money in the 950 account before paying him the same.\nFor 29 years the plaintiff had recognised the second defendant as\nthe owner of 1/9thof the Gift and a\nbeneficiary of the 950 account. She was given an indemnity in September\n2009 by the second defendant in which he stated that he agreed to\nindemnify her “against all claims relating to the distribution”.\nThe plaintiff, said the second defendant, should just have carried\nout her duty as trustee and paid him the money instead of seeking\na court order. Thus, the plaintiff should not be entitled to take\nher costs from the fund. If at all she was entitled to costs, she\nshould recover them from the first defendant whose frivolous claim\nhad caused her to initiate the action. 87     I\nconsider that the plaintiff acted reasonably in starting this suit. There\nwas clearly a considerable dispute of fact which had to be decided\nin a court of law. The plaintiff herself, although she believed\nthat the second defendant was rightfully entitled to a 1/9thportion\nof the 950 account, could not have settled the dispute between the\ndefendants without coming to court. The problem was that there were\ndiffering accounts, events took place many years ago and the parties\ndid not document each step they took thoroughly. Further the law\nin this area is rather complicated and therefore the outcome was\nuncertain. If the plaintiff had paid the second defendant his portion\nof the 950 account in 2009 she would have laid herself open to a lawsuit\nfrom the first defendant. I cannot fault her for considering that\nto be an unattractive option, notwithstanding the existence of the\nsecond defendant’s indemnity. 88     I\nhold that the first defendant must bear the costs of the second defendant\non the standard basis and of the plaintiff on the indemnity basis. His\nactions led to this lawsuit. Having originally indicated his intention\nto divest himself of his interest in the Gift (whether to his son\nonly or to all three children), he did an about turn when he found\nout that there was nothing for him to inherit in Mdm Yeo’s intestacy\nand mounted a claim on a basis which undermined and called into\nquestion the very foundation on which all his siblings had been\nproceeding for decades. That meant that as many of the siblings\nas possible had to give evidence. If the first defendant had taken\naction simply in relation to the question of whether he or his son was\nthe true beneficiary of the 950 account, the case would have been shorter,\nless complicated and less expensive and the plaintiff need not have been\ninvolved at all except as a nominal defendant. 89     Having\nsaid that the first defendant is ultimately responsible for the costs\nof the plaintiff, I think it is fair to allow her to recover her\ncosts, as taxed or agreed on an indemnity basis, from the remaining\nfunds in the 950 account. The plaintiff should not be out of pocket\nin the event that the first defendant is unable to pay these costs.\nThe first defendant shall reimburse the second defendant with the\namount of any costs paid to the plaintiff in relation to these proceedings\nwhich are taken from the 950 account.",
        "Conclusion": "90     For\nthe reasons given above, I have found that the person who is entitled\nto the 1/9thportion of the Gift which\nwas originally intended to be given to the first defendant, is the\nsecond defendant. The second defendant is entitled to be paid the\nremaining balance of the 950 account inclusive of any interest that\nhas accrued thereon. The first defendant shall bear the costs of\nthe plaintiff and the second defendant as stated in [88] above. However,\nthe plaintiff shall be entitled, if she so desires, to recover her\ncosts from the 950 account and in that event the first defendant\nshall reimburse the second defendant with the amount of the same.\nI shall see the parties to settle the wording of the orders made\nherein."
    }
}