{
    "case_title": "YTL Construction (S) Pte Ltd\n      v\n      Balanced Engineering & Construction Pte Ltd",
    "ncitation": "[2014] SGHC 142",
    "coram": "Tan Siong Thye J",
    "sections": {
        "Introduction": "1       This is an application by the Plaintiff, YTL\n                    Construction (S) Pte Ltd, to set aside an adjudication determination dated 11\n                    December 2013 made pursuant to the Building and Construction Industry Security\n                    of Payment Act (Cap 30B, 2006 Rev Ed) (“the SOP Act”). Under the\n                    adjudication determination, the Plaintiff was directed to pay the Defendant\n                    $754,111.22 (inclusive of Goods and Services Tax (“GST”)). This\n                    was the amount certified and payable by the Plaintiff to the Defendant for the\n                    work done and materials supplied.",
        "Facts": "",
        "Background": "2       The Adjudication between the parties arose out\n                    of a project for the construction of three 30,000 tonne cement silos and a\n                    four-storey office building with associated services at the existing Jurong Port\n                    Cement Terminal, Pulau Damar Laut, Singapore (“the\n                        Project”).[note: 1]The Plaintiff was appointed as the main\n                    contractor for the Project on 15 December 2011. Subsequently, the Plaintiff\n                    entered into a sub-contract agreement with the Defendant for the Defendant to\n                    supply labour, machinery and equipment to install and complete structural works\n                    (“the Subcontract”). The original agreed value of the works to be\n                    executed by the Defendant was about $9m.[note: 2]",
        "The payment claim and payment response": "3       On 6 September 2013, the Defendant served on the\n                    Plaintiff a payment claim for progress payment for work done under the\n                    Subcontract in August 2013 pursuant to s 10(1) of the SOP Act. The payment claim\n                    stated that the cumulative value of the work done by the Defendant from the\n                    start of the Project till August 2013 was $6,152,032.37. The payment claim did\n                    not specify the amount claimed for the month of August 2013.[note: 3] 4       Nevertheless, the Plaintiff subsequently served\n                    its payment response on the Defendant on 30 September 2013 pursuant to s 11(1)\n                    of the SOP Act. The payment response certified that the cumulative value of the\n                    work done to be $5,608,268.53. It also provided that the payment amount\n                    certified for August 2013 was $695,370.76 (exclusive of GST).[note: 4] 5       Under cl 17 of the Subcontract, the Defendant\n                    was required to prepare a tax invoice amount based on the response amount as\n                    stated in the payment response in order to obtain payment. On 9 October 2013,\n                    the Defendant issued its tax invoice to claim $744,046.71. However, the\n                    calculations in this tax invoice did not include the GST. Upon the\n                    Plaintiff’s request, the Defendant subsequently issued a revised tax\n                    invoice for $897,889.83 on 10 October 2013. This amount was set off against the\n                    Plaintiff’s cross invoice for $143,778.61. Hence a net sum of $754,111.22\n                    (inclusive of GST) was payable to the Defendant.[note: 5]",
        "The adjudication application": "Was the adjudication application filed out of time? 35     The Plaintiff submitted that as the Defendant\n                    claimed for $1,328,536.83 in its adjudication application, an amount higher than\n                    that stated in its payment response, the Defendant was in fact disputing the\n                    payment response provided by the Plaintiff. Furthermore, the Defendant had\n                    indicated in the Notice that it was claiming $897,889.83. Thus, both these\n                    amounts claimed were higher than the payment response of $695,370.36 (exclusive\n                    of GST). In such a scenario, the time for the Defendant to lodge an adjudication\n                    application is determined in accordance with s 12(2) and s 12(5) of the SOP\n                    Act which state that: 12(2) Where, in\n                            relation to a construction contract - (a)    the claimant\n                                disputes a payment response provided by the respondent;\n                            or (b)    the respondent fails to provide a payment\n                                response to the claimant by the date or within the period referred\n                                to in section 11(1), the claimant is entitled to make an adjudication application under\n                            section 13 in relation to the relevant payment claim if, by the end of\n                            the dispute settlement period, the dispute is not settled or the\n                            respondent does not provide the payment response, as the case may\n                            be. … 12(5)  In this section, “dispute settlement\n                                period”, in relation to a payment claim dispute, means the\n                                period of 7 days after the date on which or the period within which\n                                the payment response is required to be provided under section\n                                11(1). 36     In this case, the Plaintiff served the payment\n                    response on the Defendant on 30 September 2013. The “dispute settlement\n                    period” therefore started on 1 October 2013 and ended on 7 October 2013.\n                    Therefore, the Defendant was entitled to lodge an adjudication application from\n                    8 October 2013 onwards. The time limit for lodging an adjudication application\n                    would then be within 7 days after 8 October 2013 in accordance with s 13(3)(a)\n                    of the SOP Act which states that: 13(3) An adjudication\n                            application - (a)    shall be made\n                                within 7 days after the entitlement of the claimant to make an\n                                adjudication application first arises under section 12\n                                … 37     The last day for the Defendant to lodge its\n                    adjudication application was on 15 October 2013. However, in this case, the\n                    adjudication application was only lodged with the SMC on 20 November 2013. Thus\n                    it was lodged out of time. 38     However, the Defendant submitted that the\n                    nature of the dispute was not in relation to the payment response but was\n                    instead based on the failure of the Plaintiff to pay the amount of $695,370.36\n                    (exclusive of GST) stated in its payment response. This was despite the fact\n                    that the Defendant had indicated its claimed amount as $1,328,536.83 which was\n                    higher than the Plaintiff’s payment response amount. In the Notice, the\n                    claimed amount of $897,889.83 is also higher than the response amount.\n                    Notwithstanding these facts, the Defendant relies on the fact that in both the\n                    Notice and its adjudication application, it had ticked the boxes beside the\n                    phrases “Paid amount disputed (including nil payment by the payment due\n                    date)” and “Paid amount disputed (include nil payment)”\n                    respectively. The boxes ticked indicated the nature of the dispute in both\n                    forms. The Defendant submitted that it did not tick the boxes with the phrases\n                    “Payment response disputed (applicable to construction contracts\n                    only)” and “Disputed payment response” in the Notice and\n                    its adjudication application respectively. 39     According to the Defendant’s\n                    submissions, it was entitled to lodge its adjudication application on the day\n                    after the payment date for $695,370.36 (exclusive of GST) on 14 November 2013\n                    had passed. Section 12(1) of the SOP Act states that: 12(1) Subject to subsection (2), a claimant who, in\n                            relation to a construction contract, fails to receive payment by the due\n                            date of the response amount which he has accepted is entitled to make an\n                            adjudication application under section 13 in relation to the relevant\n                            payment claim. 40     Given that the Defendant was only entitled to\n                    lodge its adjudication application on 15 November 2013, the last day for lodging\n                    its adjudication application would be 22 November 2013. Therefore, since the\n                    adjudication application was lodged by the Defendant on 20 November 2013, it was\n                    lodged within time. 41     I cannot accept the Defendant’s\n                    submission. Its adjudication application was clearly based on a dispute as to\n                    the Plaintiff’s payment response. Although it kept insisting that the\n                    dispute was in relation to “[p]aid amount disputed”, it never\n                    unequivocally abandoned or withdrew the claim of $1,328,536.83. Although the\n                    Defendant agreed that Plaintiff should pay it $695,370.36 (exclusive of GST),\n                    this did not mean that the Defendant was not claiming in excess of $695,370.36\n                    (exclusive of GST) as well. The Defendant did not adduce any evidence that it\n                    had “accepted” the payment response, as required by s 12(1) of the\n                    SOP Act, such that it has agreed to accept the payment response in satisfaction\n                    of its payment claim in its entirety. On the contrary, the Defendant had\n                    indicated that it was claiming for higher amounts in both the Notice and the\n                    adjudication application. Furthermore, if the Defendant was truly only claiming\n                    for $695,370.36 (exclusive of GST) and nothing in excess of the payment\n                    response—which would render it a dispute as to the payment\n                    response—it could have applied to the adjudicator to amend its\n                    adjudication application by correcting the claimed amount such that it reflected\n                    $695,370.36 (exclusive of GST) only. This is permitted under reg 7(2A) of\n                    the SOPR which states that: 7(2A) The adjudicator appointed under section 14\n                            of the Act may, at any time before the making of the determination and\n                            on such terms as to costs or otherwise as he thinks just, allow such\n                            amendments to be made to an adjudication application as he thinks\n                            fit. 42     However, the Defendant did not attempt to make\n                    any amendment to its adjudication application. This was despite it knowing of\n                    the problem with the claimed amount before the adjudication determination was\n                    issued on 11 December 2013. It is peculiar that the Defendant could make\n                    submissions to the effect that the dispute was one as to “[p]aid amount\n                    disputed” but could not make an application to amend its adjudication\n                    application. The Defendant clearly wanted to have its cake and eat it. It\n                    claimed for a higher amount while insisting on timelines that only applied if it\n                    claimed for the payment response amount only. Even if the higher claimed amount\n                    was a clerical mistake, the Defendant made no attempt to correct the mistake. By\n                    not abandoning or withdrawing the higher claimed amount, the Defendant took a\n                    risk. It kept alive the possibility that it could receive a determination for a\n                    sum greater than $695,370.36 (exclusive of GST). However, at the same time, it\n                    gave rise to the possibility that its adjudication application could be found to\n                    be lodged out of the time. This was what happened in this case. By claiming for\n                    a higher amount, the Defendant in effect disputed the payment response. It\n                    should have lodged its adjudication application by 15 October 2013 but failed to\n                    do so. Therefore, I find that the Defendant had lodged its adjudication\n                    application out of time and failed to comply with s 13(3)(a) of the SOP\n                    Act. Must an adjudication determination premised on an out of time\n                adjudication application be set aside? 43     Section 16(2)(a) of the SOP Act states\n                    that: 16(2) An adjudicator\n                            shall reject - (a) any adjudication application that is\n                            not made in accordance with section 13(3)(a), (b) or (c) … 44     This is a directive to the adjudicator to\n                    reject the adjudication application if it was filed out of time pursuant to s\n                    13(3)(a) of the SOP Act. This is elaborated on in Chow Kok Fong,Security of Payments and Construction Adjudication(LexisNexis, 2nd Ed, 2013) at para 9.52: Of the requirements stipulated under section 13(3), those under paragraphs\n                        (a), (b) and (c) are particularly important because section 16(2)(a)\n                        provides that ‘an adjudicator shall reject … any adjudication\n                        application that is not made in accordance with section 13(3)(a), (b) or\n                        (c)’: Given the mandatory wording of the subsection, as long as a case\n                        for non-compliance with any of these three requirements has been made, the\n                        adjudicator is obliged to dismiss the adjudication application. 45     Although the Court of Appeal did not express\n                    an opinion as to whether an adjudication determination premised on an out of\n                    time adjudication must be set aside inChua Say\n                        Engat [61], subsequent cases have answered the question in the\n                    affirmative. InRN & Associates Pte Ltd v TPX Builders\n                        Pte Ltd[2013] 1 SLR 848, Andrew Ang J held at [54]\n                    –[55]: 54    Besides, s 16(2) of the SOP Act circumscribes the\n                            jurisdiction of an adjudicator by laying out the circumstances wherein\n                            an adjudicatormustreject an adjudication\n                            application,viz, where the application\n                            does not comply with s 13(3)(a),\n                                (b) or (c) of the SOP Act. ... 55     The SOP Act has chosen the grounds under s\n                            13(3)(a), (b) and (c) of the SOP Act to\n                        circumscribe the adjudicator's jurisdiction in relation to an adjudication\n                        application. ... [emphasis in original] The above was followed by AR Jordan Tan inShin Khai Construction Pte Ltd v FL Wong Construction Pte\n                            Ltd[2013] SGHCR 4 at [26]–[28]. 46     I agree with the above two decisions in\n                    relation to s 16(2)(a) of the SOP Act which makes it mandatory for an\n                    adjudicator to reject an adjudication application that does not comply with ss\n                    13(3)(a), (b) or (c). This is especially the case for s 13(3)(a) of the SOP Act\n                    which deals with timelines, an essential factor in ensuring a fast and fluid\n                    cash flow within the building and construction industry. As stated by Mr Cedric\n                    Foo Chee Keng, then Minister of State for National Development, during the\n                    second reading of the Building and Construction Industry Security of Payment\n                    Bill 2004 (Bill 54 of 2004) (\"the SOP Bill\"), which was later enacted as Act\n                    57/2004,Singapore Parliamentary Debates, Official\n                        Report(16 November 2004) vol 78 at col 1112: The SOP Bill will preserve the rights to payment for work done and goods\n                        supplied of all the parties in the construction industry. It also\n                        facilitates cash flow by establishing a fast and low cost adjudication\n                        system to resolve payment disputes. Affected parties will have the right to\n                        suspend work or withhold the supply of goods and services, if the\n                        adjudicated amount is not paid in full or not paid at all. 47     The timelines under the SOP Act are therefore\n                    very tight so as to facilitate “cash flow by establishing a fast and low\n                    cost adjudication system”:W Y Steel Construction Pte\n                        Ltd v Osko Pte Ltd[2013] 3 SLR 380 (“W\n                        Y Steel”) at [25]. The importance of observing such tight\n                    timelines was elaborate by McDougall J in the Australian decision ofChase Oyster Bar v Hamo Industries[2010] NSWCA 190\n                        (“Chase Oyster”) at\n                    [208]–[209]: 208    Further, theSecurity of\n                                Payment Actoperates in a way that has been described as\n                            “rough and ready” or, less kindly, as\n                            “Draconian”. It imposes a mandatory regime regardless of\n                            the parties’ contract: s 34. It provides extremely abbreviated\n                            time frames for the exchange of payment claims, payment schedules,\n                            adjudication applications and adjudication responses. It provides a very\n                            limited time for adjudicators to make their decisions on what,\n                            experience shows, are often extremely complex claims involving very\n                            substantial volumes of documents (see, for example, my decision inLaing O’Rourke Australia Construction v\n                                H&M Engineering and Construction[2010] NSWSC 818 at\n                            [8]). 209    TheSecurity of Payment\n                                Actgives very valuable, and commercially important,\n                            advantages to builders and subcontractors. At each stage of the regime\n                            for enforcement of the statutory right to progress payments, theSecurity of Payment Actlays down\n                            clear specifications of time and other requirements to be observed. It\n                            is not difficult to understand that the availability of those rights\n                            should depend on strict observance of the statutory requirements that\n                            are involved in their creation. 48     Hence, the legislative intent was for the\n                    7-day timeline in s 13(3)(a) to be observed strictly such that the\n                    adjudicator must, without any room for discretion, reject an adjudication\n                    application lodged out of time. This would also mean that there is no room for\n                    waiver of the formal requirements by the parties to the adjudication. Even\n                    though this may seem draconian, the observations by the Court of Appeal inW Y Steelat [22] must be borne in\n                    mind: Statutory adjudication of building and construction disputes takes the\n                        concept one step further. Interim payment claimsper\n                            seare not granted temporary finality under the adjudication\n                        scheme. Instead, the parties enter into an expedited and, indeed, an\n                        abbreviated process of dispute resolution in which payment claims and\n                        payment responses must be made within the stipulated deadlines to an\n                        adjudicator, who is himself constrained to render a quick decision. As a\n                        species of justice, it is admittedly somewhat roughshod, but it is fast; and\n                        any shortcomings in the process are offset by the fact that the resultant\n                        decision only has temporary finality. The party found to be in default has\n                        to pay the amount which the adjudicator holds to be due (referred to in the\n                        Act as the \"adjudicated amount\"), but the dispute can be reopened at a later\n                        time and ventilated in another more thorough and deliberate forum. 49     Therefore the adjudicator should have rejected\n                    the adjudication application as required by s 16(2) which circumscribes the\n                    adjudicator’s jurisdiction. There is no exception to this obligation. The\n                    Plaintiff also succeeds on this ground of setting aside.",
        "The adjudication determination": "Was the adjudication determination rendered out of time? 53     As stated by s 17(1) of the SOP\n                    Act: 17(1) An adjudicator\n                            shall determine an adjudication application - (a)    within 7 days after the commencement of\n                                the adjudication, if the adjudication relates to a construction\n                                contract and the respondent - (i)    has failed to make a payment response and\n                                    to lodge an adjudication response by the commencement of the\n                                    adjudication; or (ii)   has failed to pay the response amount,\n                                    which has been accepted by the claimant, by the due date;\n                                    or (b)    in any other case, within 14 days after the\n                                commencement of the adjudication or within such longer period as may\n                                have been requested by the adjudicator and agreed to by the claimant\n                                and the respondent. 54     In accordance with s 16(1) of the SOP Act, an\n                    adjudication is deemed to have commenced after the 7-day time limit for the\n                    respondent to file an adjudication response stipulated in s 15(1) has expired.\n                    Section 15(1) of the SOP Act provides that the respondent has to file an\n                    adjudication response within 7 days after it receives the adjudication\n                    application. Since the Plaintiff received the adjudication application on 21\n                    November 2013, the last day for filing an adjudication response is 28 November\n                    2013. 55     The Plaintiff submitted that if the\n                    Defendant’s argument that the dispute fell under s 12(1) of the SOP Act\n                    (see [37] above), such that it was a dispute as to failure to make payment, then\n                    the deadline for the rendering of the adjudication determination would be 7 days\n                    after 28 November 2013 (the deadline for filing the adjudication response) in\n                    accordance with s 17(1)(a)(ii) of the SOP Act. Therefore, the deadline would be\n                    5 December 2013. The adjudication determination rendered on 11 December 2013\n                    would be rendered out of time. 56     However, as I have rejected the\n                    Defendant’s argument that the dispute concerned the failure to make\n                    payment (see [40] above), the correct provision to apply would be s 17(1)(b)\n                    since this is a dispute as to the payment response itself. Therefore, the\n                    deadline would be 14 days after 28 November 2013, which would then be 12\n                    December 2013. Therefore, I find that the adjudication rendered on 11 December\n                    2013 was within time. 57     I would like to further add that s 17(1)(b) of\n                    the SOP Act allows the adjudicator to request for more time to submit his\n                    adjudication determination with the agreement of the parties. In this case the\n                    Defendant had emailed the adjudicator on 5 December 2013 asking whether the\n                    adjudicator required more time as it thought that s 17(1)(a) was the operative\n                    provision,iethe adjudicator had only 7 days to\n                    issue the adjudication determination. The adjudicator was of the view that this\n                    case involved a disputed payment response. Thus s 17(1)(b) applied, giving the\n                    adjudicator 14 days to issue his adjudication determination. This was\n                    communicated to the parties in the adjudicator’s email dated 6 December.\n                    The Plaintiff did not express a contrary view. If it did, I am certain that the\n                    adjudicator would have requested for more time from the parties. It is\n                    therefore, not right for the Plaintiff to now complain that the adjudication\n                    determination was rendered out of time.",
        "The plaintiff’s submissions": "16     The Plaintiff submitted that the adjudication\n                    determination should be set aside for the following reasons: (a)     That the payment claim failed to\n                        comply with s 10(3)(a) of the SOP Act by stating the claimed amount\n                        calculated by reference to the period to which the payment claim relates\n                        instead of the outstanding unpaid amount; (b)     That the adjudication application was lodged out\n                        of time and should have been rejected by the adjudicator in accordance with\n                        s 16(2)(a) of the SOP Act; (c)     That there was a failure by the adjudicator to comply\n                        with the principles of natural justice as required under s 16(3)(c) of the\n                        SOP Act; (d)     That\n                        the adjudication determination was rendered out of\n                time.",
        "Court’s decision": "",
        "The court’s role in a setting aside application": "17     In deciding whether or not to set aside an\n                    adjudication determination it is not the court’s role to scrutinise the\n                    decisions of the adjudicator. However, an invalid appointment of the adjudicator\n                    will nullify an adjudication determination. There are also certain legislative\n                    provisions in the SOP Act that are so important that their breach may affect the\n                    validity of the adjudication determination. These are the observations made by\n                    the Court of Appeal inLee Wee Lick Terence (alias Li Weili\n                        Terence) v Chua Say Eng (formerly trading as Weng Fatt Construction\n                        Engineering) and another appeal[2013] 1 SLR 401 (\"Chua Say Eng”) at [66]–[67]: 66    Turning now to the court's role in a setting-aside\n                            action, we agree with the holding inSEF\n                                Construction([14]supra)\n                            that the court should not review the merits of an adjudicator's\n                            decision. The court does, however, have the power to decide whether the\n                            adjudicator was validly appointed. If there is no payment claim or\n                            service of a payment claim, the appointment of an adjudicator will be\n                            invalid, and the resulting adjudication determination would be null and\n                            void. 67    Even if there is a payment claim and service of\n                            that payment claim, the court may still set aside the adjudication\n                            determination on the ground that the claimant, in the course of making\n                            an adjudication application, has not complied with one (or more) of the\n                            provisions under the Act which is so important thatit is the legislative purpose that an act done in breach of the\n                                provision should be invalid, whether it is labelled as an\n                            essential condition or a mandatory condition. A breach of such a\n                            provision would result in the adjudication determination being invalid.\n                            [emphasis in original] 18     Therefore, the crux of the matter lies in the\n                    legislative intent behind the provisions. Regardless of whether the word\n                    “shall” is used, the court must always ask itself whether it was\n                    Parliament’s intent to have adjudication determinations that are made in\n                    violation of certain requirements set aside. Certain factors would have to be\n                    considered in answering such a question. As stated by Woo Bih Li J inAustralia Timber Products Pte Ltd v A Pacific Construction &\n                        Development Pte Ltd[2013] 2 SLR 776 (“Australia Timber”) at [75]: It seems to me that a number of considerations ought to influence the\n                        determination of whether a particular provision of the Act or the SOPR is a\n                        legislatively important provision. These considerations would include the\n                        overarching purpose of the Act, the degree of difficulty in ascertaining\n                        compliance with that provision, the fact that curial intervention is\n                        permitted in the Act's adjudication mechanism, and the practical realities\n                        of the construction industry and its operation. I hasten to add that this is\n                        not an exhaustive list. 19     Bearing these considerations in mind, I\n                    proceed to examine the Plaintiff’s submissions.",
        "The payment claim": "Is the payment claim valid? 20     Section 10(3)(a) of the SOP Act states\n                    that: 10(3) A payment claim\n                            - (a)    shall state the\n                                claimed amount, calculated by reference to the period to which the\n                                payment claim relates … 21     Regulation 5(2) of the SOPR also provides\n                    that: 5(2)  A payment claim\n                            shall - (a)    be in\n                                writing; (b)    identify the\n                                contract to which the progress payment that is the subject of the\n                                payment claim relates;\n                                and (c)    contain details of\n                                the claimed amount, including - (i)    a breakdown of the items constituting the\n                                    claimed amount; (ii)   a description of these\n                                items; (iii)   the quantity or quantum of each item;\n                                    and (iv)   the calculations which show how the\n                                    claimed amount is derived. 22     The purpose for having these requirements was\n                    enunciated by the Court of Appeal inChua Say Engat [74]: … It seems to us that the legislated formal requirements for\n                        payment claims are designed to ensure that specified items of information\n                        are made available to the respondent before the claimant's rights under the\n                        Act are engaged. The emphasis is therefore not on the claimant's intention\n                        but on the respondent being given notice of certain information about the\n                        claim (such as the amount claimed, the contract under which the claim is\n                        made and a breakdown of the items constituting the claim). … Bearing in mind the purpose of such requirements, the Court of\n                        Appeal concluded at [78]: … the correct test for determining the validity of a payment claim\n                        is whether a purported payment claim satisfies all the formal requirements\n                        in s 10(3)(a) of the Act and reg 5(2) of the\n                        SOPR. If it does, it is a valid payment claim. … 23     Nonetheless, although a payment claim that\n                    satisfies all the formal requirements in s 10(3)(a) of the Act and reg 5(2) of\n                    the SOPR is a valid payment claim, the converse cannot be said to be true. As\n                    stated by Woo Bih Li J inAustralia Timberat\n                    [30]: In my view, therefore, the two-step analysis proceeds as follows. If a\n                        purported payment claim complies with s 10(3)(a) of the Act and reg 5(2) of the SOPR, it is a valid\n                        payment claim and no further question arises as to its validity, although an\n                        argument based on estoppel against the claimant can still be made (Chua Say Engat [33], [73] and [78]). If, however,\n                        the purported payment claim does not comply with these statutory provisions,\n                        it is not necessarily rendered invalid and the adjudication determination is\n                        not automatically invalidated. The court should instead proceed to examine\n                        whether any of the provisions which were not complied with was so important\n                        that it was the legislative purpose that an act done in breach of the\n                        provision should be invalid, so that non-compliance with such a provision\n                        would invalidate the adjudication determination (Chua Say\n                            Engat [67]). 24     For the purposes of determining the validity\n                    of the payment claim, I shall only consider the original payment claim served on\n                    the Plaintiff on 6 September 2013. I shall comment on the amended payment claim\n                    annexed with the Defendant’s adjudication application later on. The\n                    Defendant does not dispute that the payment claim served on the Plaintiff on 6\n                    September 2013 for progress payment for work done under the Subcontract in the\n                    month of August 2013 did not state the specific amount claimed for the reference\n                    period which is the month of August 2013. It only stated the cumulative value of\n                    the work done from the start of the Project till the end of August 2013. The\n                    Plaintiff would not know the actual amount claimed from the original payment\n                    claim until the payment claim was amended with handwritten entries subsequently.\n                    This amended payment claim was lodged by the Defendant together with its\n                    adjudication application stating the amount claimed. Therefore, when the\n                    Plaintiff was served with the payment claim on 6 September 2013, it would not\n                    know how much the Defendant was actually claiming. The Defendant argued that the\n                    payment claim was in order as the SOP Act does not specify what constitutes a\n                    claim amount and what does not. Furthermore, the Defendant submitted that the\n                    Plaintiff is estopped from disputing the validity of the payment claim. The\n                    Defendant also argued that the Plaintiff did its own calculation and in its\n                    payment response issued interim Payment Certificate 12 approving payment to the\n                    Defendant for $695,370.76. This was on 30 September 2013. 25     How important is the payment claim under the\n                    SOP Act? This requires a close perusal of s 10 of the SOP Act, particularly s\n                    10(3) that deals with payment claim: 10(3) A payment claim — (a) shall state the claimed amount, calculated by reference to the period\n                        to which the payment claim relates; and (b) shall be made in such form and manner, and contain such other\n                        information or be accompanied by such documents, as may be\n                        prescribed. 26     From the above wordings it is clear that\n                    Parliament had mandated that the payment claim must state the claimed amount.\n                    This is a basic requirement because the respondent, and later on the\n                    adjudicator, will want to know what is being claimed. After all, the main\n                    purpose of the SOP Act is to facilitate easy and quick processing of claims in\n                    the construction industry. It is the payment claim that initiates the claim\n                    protocol under the SOP Act. Therefore the payment claim must clearly state what\n                    the claim amount is. It is very unfortunate that the Defendant had failed to\n                    indicate the exact amount it was claiming for the month of August 2013. This is\n                    a series of serious errors made by the Defendant. Later, when no payment was\n                    forthcoming despite the Plaintiff certifying the amount of $695,370.76\n                    (exclusive of GST), the Defendant served the Notice of Intention to apply for\n                    adjudication on the Plaintiff on 15 November 2013. It did not indicate\n                    $695,370.76 (exclusive of GST) as the claimed amount but $897,889.83 instead.\n                    When the Defendant lodged its adjudication application, it once again claimed a\n                    different amount. This time the Defendant claimed $1,328,536.83. What then is\n                    the actual amount that the Defendant was claiming? At the hearing before me the\n                    Defendant submitted that it was claiming $695,370.76 (exclusive of GST) but this\n                    was not apparent when the Defendant initiated the claim proceedings under the\n                    SOP Act. 27     It is common sense that for any claim or\n                    adjudication procedure to advance expeditiously and efficiently, the claimed\n                    amount must be made known in the payment claim pursuant to s 10(3)(a) of the SOP\n                    Act. If that is not the case, it would be difficult for the respondent to serve\n                    a proper payment response. How would one be able to decide on how much to pay\n                    another if he does not even know how much is demanded? Further, if there is a\n                    dispute as to the payment response, the respondent will be unable to negotiate\n                    with the claimant since he is unaware of the claimant’s position. The\n                    adjudication process will then not be able to proceed in accordance with the\n                    envisioned framework of the SOP Act. 28     Here, it was not a situation whereby the\n                    figures provided in the payment claim would allow a person to logically\n                    ascertain what the actual claimed amount was at that point in time. There was no\n                    indication of the amount claimed. It was later at the adjudication application\n                    that figures were hand written and labelled as “Amount approved\n                    previously” and “Retention 10%”. These were added on in the\n                    amended payment claim. The amounts also did not correspond with any of the\n                    numbers in the Plaintiff’s payment response. Thus the Plaintiff would not\n                    have known the Defendant’s claimed amount for the month of August 2013. In\n                    short, it was impossible for the Plaintiff to have figured out what the\n                    Defendant’s actual claim in its payment claim. This explains why\n                    subsequently when the Plaintiff lodged its adjudication response at section B\n                    under “Contract type” it ticked the box “Disputed payment\n                    response” and for “Nature of Dispute” it ticked the boxes\n                    “Disputed payment response” and “Paid amount disputed\n                    (including nil payment)”[note: 12]. In\n                    this case when the Plaintiff certified $695,370.76 (exclusive of GST) on 30\n                    September in response to the payment claim, it did so from its own calculation\n                    and understanding of the amount outstanding for the month of August 2013. It did\n                    not and could not do so based on the Defendant’s understanding since the\n                    Defendant’s payment claim failed to stipulate the claimed amount in breach\n                    of s 10(3) of the SOP Act. Hence, I find that the non-compliance with s 10(3)(a)\n                    rendered the Defendant’s payment claim invalid. May the invalidity of the payment claim be waived? 29     Despite the Defendant’s failure to state\n                    the amount claimed in its payment claim, the Defendant turned the table and\n                    argued that the Plaintiff is estopped or had waived the claim requirement under\n                    the SOP Act. Is this a valid argument when it is the Defendant who had failed to\n                    comply with the SOP Act in its pursuit of its claim under the same\n                Act? 30     As held by Judith Prakash J inChip Hup Hup Kee Construction Pte Ltd v Ssangyong Engineering &\n                        Construction Co Ltd[2010] 1 SLR 658 at [43]–[44]: 43    Considering the\n                            authorities cited by each party, it appeared at first that they could\n                            not be reconciled. On the one hand, it was declared by high authority\n                            that parties could not be estopped from contesting jurisdiction and, on\n                            the other hand, there were numerous cases in which exactly that seemed\n                            to have happened. There was, however, an answer to the quandary and it\n                            was provided by the claimant. The claimant pointed out that the\n                            confusion arose from the way in which the word \"jurisdiction\" was used\n                            by the respondent. Agreeing that parties could not confer or waive\n                            \"jurisdiction\" as explained in the authorities cited by the respondent,\n                            the claimant averred that that was the case when \"jurisdiction\" was used\n                            in its narrow meaning of \"competence to hear\". When \"jurisdiction\" was\n                            used in a wider sense,ie, in reference to\n                            the manner in which the court's power was exercised then waiver or\n                            estoppel could be relied on. The distinction between the two meanings of\n                            the word appears clearly from the following passage of the judgment of\n                            Deane J inThen Kang Chu v Tan Kim Hoe[1925] SSLR 4: By the jurisdiction of a Court is meant the authority which the Court\n                            has to decide matters litigated before it or to take cognizance of\n                            matters presented in a formal way for its decision. Its limits are\n                            defined in the Statute, Charter or commission constituting the Court and\n                            must be sought for there. ... The last point to be dealt with is the argument that defendant having\n                            appeared in the lower Court and taken no objection to the jurisdiction\n                            is thereby estopped from pleading to it. The principles governing the\n                            application of estoppel in such cases are well stated in Spencer Bower\n                            on 'Estoppel by Representation' at page 187, 'Even the most plain and\n                            express contract or consent, a fortiori, therefore, any mere conduct or\n                            inaction or acquiescence, of a party litigant from which a\n                            representation may be implied, such as to give rise to an estoppel,\n                            cannot confer judicial authority on any of His Majesty's subjects not\n                            (18) already invested with such authority by the law of the land, or add\n                            to the jurisdiction lawfully exercised by any judicial tribunal'. ... On\n                            the other hand, 'where it is merely a question of irregularity of\n                            procedure, or of a defect in \"contingent\" jurisdiction or non-compliance\n                            with statutory conditions precedent to the validity of a step in the\n                            litigation, of such a character that, if one of the parties be allowed\n                            to waive, or by conduct or inaction to estop himself from setting up\n                            such irregularity or want of \"contingent\" jurisdiction or noncompliance,\n                            no new jurisdiction is thereby impliedly created, and no existing\n                            jurisdiction is thereby impliedly extended beyond its existing\n                            boundaries, the estoppel will be maintained, and the affirmative answer\n                            of illegality will fail'. 44    Thus, it seemed that when what was being alleged\n                            was an absolute lack of jurisdiction on the part of a particular\n                            tribunal or court to hear a particular dispute, \"jurisdiction\" being\n                            used in the strict sense of capacity to hear, then if the tribunal\n                            concerned does not have such jurisdiction, any party to the dispute may\n                            assert the lack of jurisdiction at any stage and can never be held to be\n                            estopped from doing so or to have waived its right of protest. On the\n                            contrary, when it is a question of irregularity of procedure or\n                            contingent jurisdiction or non-compliance with a statutory condition\n                            precedent to the validity of a step in the litigation, such irregularity\n                            or non-compliance can be waived because the effect of the waiver would\n                            not be to create or confer any jurisdiction that did not previously\n                            exist. 31     Therefore, in such an instance, the question\n                    would then depend on whether the irregularity pertaining to the requirements of\n                    making a valid payment claim relates to “jurisdiction” in the\n                    narrow sense or the wider sense. In relation to non-compliance with s 10(3) of\n                    the SOP Act, Quentin Loh J held inAdmin Construction Pte Ltd\n                        v Vivaldi (S) Pte Ltd[2013] 3 SLR 609 at [59]–[60]: 59    … In\n                            discussingTPX Builders[Woo Bih Li J]\n                            said that a payment claim made in breach of the Act would undermine the\n                            jurisdiction of the adjudicator and therefore the validity of his\n                            rendered determination: at [35]. Accordingly neither s 15(3) of the\n                            [SOP] Act nor estoppel should preclude a respondent from challenging the\n                            validity of the payment claim in an action for setting aside. Woo J\n                            pointed toTerence Leeat [64]-[65] for\n                            the proposition that a dispute over the validity of the payment claim\n                            was an issue to be determined by the court and not the adjudicator and\n                            repeated this reasoning in the recent case ofAustralian Timber Products Pte Ltd v A Pacific Construction &\n                                Development Pte Ltd[2013] 2 SLR 776 at\n                        [36]: The formal validity of a payment claim under s 10(3) of the Act is\n                            therefore not a matter on which an adjudicator is entitled to decide;\n                            and in this regard, it would be superfluous to raise for the\n                            adjudicator's consideration any objection to validity stemming from the\n                            lack of detail in a purported payment claim. No question of any estoppel\n                            can arise, given that the adjudicator cannot decide on the point even if\n                            it is brought up for his consideration. 60     I agree that inTerence\n                            Lee, the Court of Appeal definitively clarified that a\n                        challenge to the validity of a payment claim amounts to a challenge to the\n                        validity of the appointment of the adjudicator,ie, a challenge to the adjudicator's jurisdiction rather\n                        than the exercise of such jurisdiction (see [21] above) … 32     Therefore, given that the irregularity here\n                    related to “jurisdiction” in the strict sense, such that it\n                    affected the validity of the appointment of the adjudicator and his competence\n                    to hear the adjudication, no defence of waiver or estoppel may be relied upon by\n                    the Defendant. Woo Bih Li J also found that non-compliance with s 10(1) of the\n                    SOP Act could not be waived inJFC Builders Pte Ltd v\n                        LionCity Construction Co Pte Ltd[2013] 1 SLR 1157 at [43].\n                    Accordingly, I find that non-compliance with s 10(3) of the SOP Act cannot be\n                    waived as well. I would also like to point out that the adjudicator could not\n                    have decided on the issue of waiver in his adjudication determination since he\n                    did not have the power to decide on issues related to the validity of his own\n                    appointment. 33     In any event I do not think that the Plaintiff\n                    had waived compliance with s 10(3)(a) or had been estopped from complaining\n                    about it at any point in time of the adjudication. The Plaintiff was never aware\n                    of the actual claim of $1,328,536.83 until the time the amended payment claim\n                    was lodged together with the adjudication application and forwarded to it by the\n                    SMC. Upon discovery of this unexpected amount, the Plaintiff then began to mount\n                    its complaints. The serving of the payment response on the Defendant cannot be\n                    taken to mean that the Plaintiff had forgone its legal rights since it was all\n                    the Plaintiff could have done at that point in time other than refusing to\n                    respond to the Defendant. The Plaintiff could not have challenged its validity\n                    because there was no forum for the Plaintiff to do so at that point in time.\n                    This also applies to all the previous instances where the Defendant served a\n                    payment claim for an unspecified amount and subsequently accepted the\n                    Plaintiff’s payment response. 34     Therefore, when SMC appointed George Tan as\n                    the adjudicator for this case it was unaware of the invalidity of the payment\n                    claim. Hence this had affected the validity of the adjudicator’s\n                    appointment. He would then have no jurisdiction or competence to make an\n                    adjudication determination. This itself is sufficient for the setting aside of\n                    the adjudication determination. However, I shall proceed to consider the other\n                    grounds of setting aside raised by the Plaintiff.",
        "Was there a failure by the adjudicator to comply with the principles\n                of natural justice as required under s 16(3)(c) of the SOP Act": "50     The Plaintiff submitted that after the\n                    adjudicator found that the Defendant had failed to comply with the requirements\n                    of the SOP Act, the adjudicator concluded that the Plaintiff, through its\n                    conduct, had waived the strict compliance with the requirements of the SOP Act\n                    in favour of the Defendant. The Plaintiff argued that it had not waived the\n                    strict compliance of the SOP Act as it opposed the Defendant’s claim. The\n                    Plaintiff took issue with the fact that the adjudicator had not solicited the\n                    Plaintiff’s view on this issue of waiver and thus the Plaintiff was denied\n                    the opportunity to address the adjudicator. In my view this ground for setting\n                    aside the adjudication determination is unmeritorious. 51     Section 18 of the SOP Act permits an aggrieved\n                    respondent to seek a review of the adjudication determination. The Plaintiff\n                    chose not to seek an adjudication review in this case. InAM\n                        Associates (Singapore) Pte Ltd v Laguna National Golf and Country Club\n                        Ltd[2009] SGHC 260, Judith Prakash J opined that the Court would\n                    not lightly interfere with an adjudication determination on the ground of\n                    natural justice as the aggrieved respondent could seek a review of the\n                    adjudication determination under s 18 of the SOP Act. The Court held at [26]\n                    that : The principles of natural justice are concerned with the provision of a\n                        fair hearing to contending parties. They do not mandate any particular\n                        result. As long as the parties have been given a fair hearing, the decision\n                        cannot be set aside for failure to comply with natural justice. A party who\n                        is dissatisfied with the decision on its merits cannot use the principles of\n                        natural justice to have the decision set aside. In the scheme for\n                        adjudication set out by the SOP Act, a respondent who is dissatisfied with\n                        an adjudication determination can ask for a review adjudicator or review\n                        adjudication panel to be appointed to review the determination. If this is\n                        done, then the evidence can be revisited on the review and the review\n                        adjudicator may, if he sees fit, make a different decision from that made by\n                        the adjudicator. The SOP Act has provided a means for dissatisfied\n                        respondents to be reheard and that is the review adjudication; it is not the\n                        application to court for setting aside under s 27(5). The court cannot be\n                        asked under cover of an allegation of breach of natural justice to review\n                        the merits of the adjudicator’s decision. 52     I am of the view that the Plaintiff was given\n                    a fair opportunity to be heard. There is no evidence to suggest that he was\n                    denied an opportunity to be heard. Thus there was no breach of natural\n                    justice.",
        "Conclusion": "58     Although the adjudication determination was\n                    rendered within time, the Defendant’s payment claim is invalid. The\n                    Defendant’s adjudication application was also lodged out of time. These\n                    are valid grounds for setting aside the adjudication determination and I\n                    accordingly allowed the Plaintiff’s application. I would like parties to\n                    address me on the issue of costs.  [note: 1]Affidavit of Tan Jiann Jiong, p 3, para\n                                4. [note: 2]Affidavit of\n                                Tan Jiann Jiong, p 3, para 5. [note: 3]Affidavit of Tan Jiann Jiong, p 4, para\n                        7. [note: 4]Affidavit of Tan Jiann Jiong, p 4, para\n                        8. [note: 5]Affidavit of\n                                Tan Jiann Jiong, p 5, para 9 –\n                    10. [note: 6]Affidavit of\n                                Peter Green, p 312. [note: 7]Affidavit of Tan Jiann Jiong, p\n                                37. [note: 8]Affidavit of\n                                Tan Jiann Jiong, p 37. [note: 9]Affidavit of Tan Jiann Jiong, p\n                                290. [note: 10]Affidavit\n                                of Tan Jiann Jiong, p 687, para 18. [note: 11]Affidavit\n                                of Tan Jiann Jiong, p 8, para\n                18. [note: 12]Affidavit\n                                of Tan Jiann Jiong, Tab 5 page 266."
    }
}