{
    "case_title": "Management Corporation Strata Title Plan No 367 \n      v\n      Lee Siew Yuen and another",
    "ncitation": "[2014] SGHC 161",
    "coram": "Tan Siong Thye J",
    "sections": {
        "Introduction": "1       The appellant, Management Corporation Strata Title Plan No 367 (“the MCST”), is the management corporation of Highpoint Condominium (“the Development”) located at 30 Mount Elizabeth, Singapore. The Development is about 41 years old. It consists of 22 levels with 59 units.[note: 1] 2       The respondents are Madam Lee Siew Yuen and Mr Eng Chiet Shoong (“the Respondents”). They are subsidiary proprietors of unit #04-30 (“the Unit”) of the Development. The Unit is a single level apartment and is not a maisonette (ie, a unit that has two levels). The Respondents have been the subsidiary proprietors since 1993 and have tenanted the Unit from 1997 to 2012.[note: 2] 3       Sometime in January 2012, the Respondents’ contractor discovered serious cracks in the structural beams above the ceilings of the master bedroom toilet and the kitchen of the Unit. These were referred to the MCST for its necessary action. It became apparent that a dispute arose as to who was responsible for the rectification and payment of these defects. The MCST referred this dispute to the Strata Titles Board (“STB”), seeking an order that the Respondents make good the defects of the beams inside the Unit. The STB held that the affected beams were not part of the common property of the Development as defined under s 2(1) of the Building Maintenance and Strata Management Act (Cap 30C, 2008 Rev Ed) (“BMSMA”). However, the STB found that the MCST was duty bound to rectify the said defects as the cracks in the beams in the Unit were “structural defects” within the meaning of s 30(5)(a) of the BMSMA. In coming to this decision, the STB was satisfied that the Respondents were not in breach of the duty imposed on them under s 63(a)(i) of the BMSMA. The MCST is dissatisfied with the decision of the STB. This action is an appeal by the MCST against the decision of the STB.",
        "Appeal to the High Court on question of law": "4       Under s 98(1) of the BMSMA there is no right of appeal against the decision of the STB except on a point of law: 98.—(1) No appeal shall lie to the High Court against an order made by a Board under this Part or the Land Titles (Strata) Act (Cap. 158) except on a point of law. 5       The Respondents and the MCST agree that the determination of this case involves matters that are of public interest as the outcome will have an impact on other units in the Development and other condominiums in Singapore. The decision will clarify the rights and obligations of management corporations and subsidiary proprietors in Singapore pertaining to the rectification of defective beams.",
        "The facts": "",
        "Visual inspection of the Development": "6       The MCST and the Respondents are largely in agreement as to the facts of the case. Sometime in December 2010, the MCST engaged WTS Consulting Engineers (“WTS”) to conduct a ten-yearly visual inspection as required under the Building Control Act (Cap 29, 1999 Rev Ed). The subject matters of the inspection were the common property and randomly selected units within the Development. The outcome of the inspection, as provided for in a structural report generated by WTS after the inspection, is as follows:[note: 3] CONCLUSION OF INSPECTION In conclusion, the structural condition of the buildings inspected was in relatively good condition with no major signs of defects or deterioration detected during the inspection. However concrete ceiling spalling at the apartment toilets were noted some localized and some of them wide spread that require minor structural repair to prevent further deterioration of the ceiling slab. No signs of major damages, distress, deformations were noticed during the course of the building inspection. The overall structural integrity and stability of the building was in order. 7       In response to WTS’ structural report, the MCST sent a circular to all subsidiary proprietors of the Development requesting that they check the ceilings of their respective units for spalling concrete and to rectify the defects in their units, if any.[note: 4]The Respondents allege that they did not receive this circular.[note: 5]",
        "Discovery of cracks in the beams of the Unit": "8       About a year later, sometime in January 2012, the Respondents complained to the MCST that there were cracks in the concrete beams in the Unit. The MCST then engaged WTS to inspect the Unit and the unit below. The inspection was conducted on 9 February 2012. WTS then produced a report the following day, which stated:[note: 6] The reinforcement steel bars including links and bottom bars of the RC beams below the bathtub/shower closet were found seriously rusty causing spalling and detaching of concrete covers of the beams. The bottom steel bars of the floor slabs were also found rusty in most areas causing detachment of concrete covers of the slabs. Such defects had significantly reduced the load bearing capacities of the floor structures and adversely affected the safety of the occupants. Apparently the corrosion of the steel bars was a result of failure or lack of waterproofing to the bathroom floors. An earlier description of the above defects and the need for repair was presented in our periodic building report dated 6 January 2011 and reiterated in BCA's subsequent letter accepting our report. Apparently, the defects have since deteriorated further to a state that requires repair to be taken urgently. 9       On 19 March 2012, the MCST sent an email with an attached letter to the Respondents that it would rectify the affected beam in the master bedroom.[note: 7]However, the MCST did nothing as it was unsure as to whether the rectification of the beams was something which fell within its obligations under the BMSMA. 10     The MCST then proceeded to inquire with the Building and Construction Authority (“BCA”) and the Singapore Land Authority (“SLA”) as to who was responsible for the rectification of the defects in the affected beams. On 23 March 2012, the MCST sent an email to the SLA asking whether “structural columns and beams inside the apartment are the MCST’s responsibility to maintain it, considering the building is over 30 years old”.[note: 8]The SLA replied on 5 April 2012 which states: We have received BCA’s input on your query, and wish to inform that the MCST has a responsibility to maintain the beams and columns of the building in good and serviceable state.[note: 9]",
        "The MCST refers the dispute to the STB": "11     Notwithstanding the SLA’s decision that the MCST is obliged to rectify the defects in the affected beams, the MCST referred the same issue to the STB for determination on 27 April 2012.[note: 10]The case was heard by the STB on 27 May 2013, 7 June 2013 and 4 July 2013.[note: 11]The STB released its grounds of decision at the last hearing on 4 July 2013.[note: 12] 12     In its grounds of decision, the STB found that the affected beams were not part of the “common property” of the Development as they were within the Unit.[note: 13]However, the STB found that the defects in the beams were structural defects under s 30(5)(a) of the BMSMA.[note: 14]The STB also found no evidence to suggest that the Respondents were in breach of their duty under s 63(a)(i) of the BMSMA.[note: 15]The STB therefore ordered the MCST to rectify the defective beams in the Unit. The MCST is dissatisfied with the decision of the STB and subsequently brought this appeal against it. The MCST is of the opinion that the defects in the affected beams are not structural defects which it is required to rectify under s 30(5) of the BMSMA. The Respondents are also dissatisfied with the decision to the extent that the STB found that the affected beams did not constitute common property under the BMSMA.",
        "The appeal": "13     It is clear from s 98(1) of the BMSMA that there is no appeal against the decision of the STB except on a point of law. Before I proceed to identify the points of the law that this court is asked to deal with, I would like to make some general observations. The MCST, in the course of the proceedings, has failed to appreciate the narrow purpose of this appeal. The MCST has criticised almost every aspect of the STB’s deliberations, including its findings of fact. It also alleged that the STB had misconducted the proceedings, regardless of whether or not it relates to a point of law. This is an abuse of the appeal process. Nonetheless, there remain certain points of law that I must deal with. 14     In my view, the points of law that this court is asked to decide are as follows: (a)     Are the defective beams part of the “common property” of the Development under the BMSMA which the MCST must repair? (b)     Are the defective beams “structural defects” under s 30(5) of the BMSMA which the MCST must repair?",
        "Are the defective beams part of the “common property” of the Development under the BMSMA which the MCST must repair?": "15     Under s 29(1)(b)(i) of the BMSMA, the MCST is required to maintain the common property of the Development: Duties and powers of management corporation in respect of property 29.—(1) Except as otherwise provided in subsection (3), it shall be the duty of a management corporation — ... (b)    to properly maintain and keep in a state of good and serviceable repair (including, where reasonably necessary, renew or replace the whole or part thereof) — (i)    the common property … 16     If the defective beams are part of the common property, then the MCST is required to rectify the defects found in the beams pursuant to s 29(1)(b)(i) of the BMSMA. The MCST submitted that the defective beams are within the Unit and thus are not part of the common property as defined under the BMSMA. The Respondents, on the other hand, argued that the affected beams fall within the definition of common property under the BMSMA. The STB ruled that the defective beams were not part of the common property of the Development.",
        "The meaning of “common property” under the BMSMA": "17     Section 2(1) of the BMSMA defines common property as follows: 2.—(1)    In this Act, unless the context otherwise requires — … \"common property\", subject to subsection (9), means — (a)    in relation to any land and building comprised or to be comprised in a strata title plan, such part of the land and building — (i)    not comprised in any lot or proposed lot in that strata title plan; and (ii)   used or capable of being used or enjoyed by occupiers of 2 or more lots or proposed lots; or (b)    in relation to any other land and building, such part of the land and building – (i)    not comprised in any non-strata lot; and (ii)   used or capable of being used or enjoyed by occupiers of 2 or more non-strata lots within that land or building 18     This definition is subject to s 2(9) of the BMSMA which provides that: 2.—(9) For the purposes of this Act — (a)    all windows of a lot, proposed lot or non-strata lot that are located on any exterior wall of the lot, proposed lot or (as the case may be) non-strata lot, being either louvres, casement windows, sliding windows or windows with any movable part, shall be part of the lot, proposed lot or (as the case may be) non-strata lot and not common property; and (b)    all other windows of a lot, proposed lot or non-strata lot that are located on any exterior wall of the lot, proposed lot or (as the case may be) non-strata lot shall be common property, unless otherwise described in a strata title plan. 19     The definition of common property under the BMSMA is identical to the definition of common property under s 3(1) of the Land Titles (Strata) Act (Cap 158, 2009 Rev Ed) (“LTSA”), which is subject to s 3(2) of the LTSA. Section 3(2) of the LTSA uses the same wording as s 2(9) of the BMSMA. This definition of common property under the LTSA was only introduced via an amendment effected by the enactment of the BMSMA, which took effect on 1 April 2005. Prior to the amendment of the definition, common property was defined under s 3 of the previous edition of the LTSA as specifically including beams and supports. These structures were therefore considered as part of the common property “unless otherwise described specifically as comprised in any lot in a strata title plan and shown as capable of being comprised in such lot” (see below). It is pertinent to refer to the previous definition of common property under the LTSA which is reproduced below: In this Act, unless the context otherwise requires — … \"common property\" — ... (c)    unless otherwise described specifically as comprised in any lot in a strata title plan and shown as capable of being comprised in such lot, includes — (i)    foundations, columns, beams, supports, walls, roofs, lobbies, corridors, stairs, stairways, fire escapes, entrances and exits of the building and windows installed in the external walls of the building; 20     It is evident that after 2005, the definition of common property omitted to specify a list of structures which Parliament considers to be part of the common property after the passing of the BMMA Bill No. 6/2004 (“the BMMA Bill”). Why did Parliament decide not to mention features that are generally and commonly understood as common property? The rationale for this can be gleaned from the Parliamentary process leading up to the passing of the BMMA Bill. The BMMA Bill was committed to the Select Committee by resolution of the Parliament. The Select Committee received 61 written representations. Some of these representations suggested that the definition of common property for non-strata developments under the BMMA Bill should be the same as that for strata developments under the LTSA. The Select Committee accepted this suggestion. This resulted in the introduction of a more generic definition of common property under both the BMSMA and the LTSA as seen from para 11 of the Report of the Select Committee on the Building Maintenance and Management Bill No. 6/2004: The Committee accepted this suggestion [to adopt a common definition of common property for both strata and non-strata developments] and recommended that the Bill be amended toincorporate a generic definition of common propertyto cover both strata and non-strata developments. [emphasis added] 21     In addition, the Singapore Institute of Surveyors and Valuers (“SISV”) had also, in its written representation to the Select Committee, suggested that the definition of common property be simplified. Their suggestion as to the definition of common property is reproduced below:[note: 16] 2.0Definition of Common Property 2.1    The definition of “Common Property” as provided in this Bill makes a distinction between land and buildings not comprised in a strata title plan and those comprised in a strata title plan. The definition further provides that in the case of land and building comprised in a strata title plan “common property” has the same meaning as that in a Land Titles (Strata) Act. 2.2Common Property is defined to great technical details in this Bill.  We are of the opinion that this very detailed definition of “common property” can create confusion and give rise to ambiguity in interpretation.  This is particularly in relation to the definition  as provided in (d)(i)(A) to (C), (d)(ii) and (e) which attempts to enumerate all types of scenarios with regard to the location of pipes, wires etc between lots, buildings, common property, another land parcel etc.  It is envisaged that with changing technology and architecture, it is not possible to be exhaustive in providing for all types of scenarios regarding common property. 2.3    We propose that to avoid confusion, the Bill should adopt the same definition of common property as in the LTSA which is already known and accepted by people in the industry. [emphasis added] 22     Parliament accepted the SISV’s suggestions and decided to simplify the definition of common property without having to list any structure that are generally considered as part of common property. Therefore, in consideration of these various factors, instead of the preceding definition of common property under the previous edition of the LTSA, the more general definition as found in the current BMSMA and LTSA was preferred by Parliament. As seen from the representation made by the SISV, such a simplification was not meant to exclude from the definition of common property the specific structures listed in the previous edition of the LTSA. Rather, it was meant to avoid having to rely on an exhaustive list of structures so as to accommodate future developments in technology and architecture. Furthermore, a more generic definition was needed so as to accommodate non-strata developments, which had different features as compared to strata developments. 23     From this, it can be seen that Parliament in 2005 did not have the intention to change the definition of common property or to exclude foundation, beams, supports,etcfrom the definition of common property when it passed the BMMA Bill which contained a simplified definition of common property. When I asked counsel for the MCST whether Parliament intended to exclude those structures from the definition of common property, she conceded that it was not Parliament’s intention to exclude beams from the definition. 24     I therefore agree with the Respondents that the simplified definition of common property has given rise to confusion and ambiguity as to what common property consists of, especially in relation to beams and supports. This concern was in fact recently expressed by the BCA in a 2013 report made pursuant to a public consultation on the proposed amendments to the BMSMA and the LTSA. The report found that the definition of common property is unclear as to whether foundations, beams, columns are included as part of the common property. The report recommended that the definition of common property should be made clearer via the inclusion of key structures such as foundations, beams, columns of the building within the definition of common property:[note: 17] Definition of “Common Property” 41    “Common property” under the BMSMA is currently defined as any land and building that is not comprised in any lot and used or capable of being used or enjoyed by occupiers of 2 or more lots. 42    There was feedback that the current definition of “common property” in the BMSMA should follow the former definition under the repealed Land Titles Strata Act (LTSA) where common property was defined as including foundations, columns and beams,  unless described specifically as comprised in any lot and shown as capable of being comprised in such lot. Under the current definition of common property, foundations, columns and beams are not included. As a result, it is unclear if such structures that may reside within a lot but which support the entire building still form part of the common property. In practice, owners and MCSTs recognise that these structures should form part of the common property. Critical components such as key structural elements and systems spanning across SPs’ lots are better maintained by the MCST, as the individual owners have less of a vested interest in maintaining these structures on behalf of the other residents.  Doing so would also facilitate emergency repairs and minimise disputes between the MCST and individual owners on who is to maintain such common property. ... Recommendation 11 (a)To make clearer the definition of “common property” to include key structural elements (foundations, beams, columns) of the building. [emphasis added] 25     It is also mentioned in the above Public Consultation Report that “[i]n practice, owners and MCSTs recognise that these structures should form part of the common property”.[note: 18]In this case, when the Respondents’ renovation contractor noticed the cracks in the beams, he suggested that these defects be referred to the MCST. The MCST also initially agreed to rectify these defects. Later, the MCST had a change of heart and decided to seek a second opinion from the BCA and the SLA to ascertain whether it was the MCST or the Respondents who should make good the defects in the beams. The SLA, after considering inputs from the BCA, informed the MCST that they were responsible for the rectification of the defective beams.",
        "Does the definition of common property under the BMSMA include the affected beams?": "26     The fact that the definition of common property under s 2(1) of the BMSMA is ambiguous causes me to have regard to parliamentary intent as gleaned from the material above to assist me in interpreting the definition of common property pursuant to s 9A(2)(b)(i) read with s 9A(3) of the Interpretation Act (Cap 1, 2002 Rev Ed).  Bearing this in mind, I proceed to deal with whether the current definition of common property under s 2(1) of the BMSMA includes the affected beams in this case. 27     Under s 2(1) of the BMSMA, for a structure to be common property, it has to satisfy two conditions: (a)     it is not comprised in any lot or proposed lot in that strata title plan; and (b)     it is used or capable of being used or enjoyed by occupiers of two or more non-strata lots within that land or building. 28     The affected beams in this case are located above the kitchen, the master bedroom and the bathroom in the second bedroom of the Unit. The Unit is a single level apartment. These beams are located in between the Unit and the unit above. The STB agreed with the MCST and came to the conclusion that the affected beams “are comprised in the said unit”. Since the first condition was not satisfied, the STB ruled that the affected beams are not part of the common property. 29     The crucial word in the first condition is “comprised”. I agree with the Respondents’ counsel that “comprised” does not mean “situated”. “Comprise”, according toStroud’s Judicial Dictionary of Words and Phrasesvol A-E (Daniel Greenberg ed) (Sweet & Maxwell, 8th Ed, 2012) at p 524, means “include”. The apartment surely did not include the beams that are located on top of the Unit when the Respondents bought the Unit. The beams are part of a supporting infrastructure that holds the entire building together. It seems logical and obvious that the beams are common property as these beams are crucial in ensuring the structural integrity of the building. In fact, the Respondents, if they could have their way, would not want these beams in their apartment as they occupy space and do not serve any purpose or function for the Unit. These beams are also unsightly. However, these beams are critical to the Development as they support the units above it. The photographs of these beams may suggest that they are inside the Unit. This is because the photographs and the strata title plan are one dimensional and are not able to disclose those portions of the beam that are located inside the unit above it. I also note the fact that WTS had also advised that the beams are “shared by two units” (ie, the Unit and the unit above).[note: 19]Hence, I am of the view that these beams are not comprised in the Unit in the strata title plan and the first condition of the definition of common property under the BMSMA is satisfied. 30     The second condition is easily fulfilled. As I have explained above, the beams in question serve the purpose of supporting the building blocks of the Development. Hence, the purpose is more than mere enjoyment for the other occupiers. The MCST submitted that the affected beams are “used exclusively by the Respondents”.[note: 20]As I have mentioned earlier, the beams serve no useful purpose to the Respondents. The MCST has not explained how these beams are useful to the Respondents. The beams are key features and provide the essential structure for the safety of the building. 31     The MCST citedManagement Corporation Strata Title Plan No 958 v Tay Soo Seng[1992] 3 SLR(R) 818 (“Tay Soo Seng”) in support of the proposition that the affected beams are not part of the common property. The court in that case decided that the glass panel separating the unit from a common corridor was not common property. GP Selvam JC (as he then was) further added at [13] that: Common property is defined by s 3 of the Act as “so much of the land not comprised in any lot shown in a strata title plan”. The Act gives certain pointers to what would constitute common property. Some of them are foundations, columns, beams, supports, walls and roof. However, if they are comprised in any lot shown in a strata title plan they will form part of the private strata lot and not common property. The Act thus makes a clear dichotomy between common property which is vested in the management corporation and private property which is vested in the subsidiary proprietor of the lot. 32     The second case cited by the MCST isTsui Sai Cheong and another v Management Corporation Strata Title Plan No 1186 (Loyang Valley) and others[1995] 3 SLR (R) 713 (“Tsui Sai Cheong”), which concerned a water pipe that traversed the common property into the unit in question. This pipe served only the unit and the corroded part was in the unit. Hence, the court held that the water pipe was not part of the common property. The facts of that case are materially different from this case. Thus, it is also not very helpful. 33     I do not think that these cases assist the MCST. The purpose behind the definition of common property under s 2(1) of the BMSMA is to exclude from common property those objects that are solely constructed within the subsidiary proprietor’s unit for the enjoyment of the subsidiary proprietor only. This is consistent with the term “common”, which indicates that the particular property must serve a common purpose. This is exactly the purpose served by the affected beams here since they were erected to support the units above. This is why the glass panel inTay Soo Sengwas not found to be a part of common property since the only purpose it served was to insulate the unit in question from the common corridor, thereby benefiting the subsidiary proprietor only. Similarly inTsui Sai Cheong, the corroded part of the pipe in question only served the subsidiary proprietor. These cases are unlike the present situation whereby the beams do not benefit the Respondents at all. 34     For the above reasons, I disagree with the conclusion of the STB that the affected beams were not common property. These beams are, indeed, part of the common property under the BMSMA. Furthermore, it was never the intention of Parliament to exclude such beams from the definition of common property. On this ground alone, the MCST has to make good the defective beams in the Unit pursuant to its obligation under s 29(1)(b)(i) of the BMSMA. I shall now proceed to deal with the remaining point of law in this case.",
        "Are the defective beams structural defects under s 30(5) of the BMSMA which the MCST must repair?": "",
        "Are the defects structural defects?": "35     The STB found that the defective beams were structural defects under s 30(5) of the BMSMA. Section 30(5) of the BMSMA states that: 30.—(5) Where — (a)    any part of a building comprised in a lot contains any structural defect which affects or is likely to affect the support or shelter provided by that lot for another lot in that building or the common property; or … and the defect is not due to any breach of the duty imposed on any person by section 63(a), the management corporation shall carry out such work as is necessary to rectify the defect and may recover the cost of such work from any person who has a duty to remedy the defect as a debt in any court of competent jurisdiction. 36     Section 30(5) refers to structural defects. Are the affected beams structural defects? The BMSMA does not define structural defects. However, s 2(1) of the Building Control Act (Chapter 29) defines what “key structural elements” are: … “key structural elements” means the foundations, columns, beams, shear cores, structural walls, struts, ground anchors and such other parts of a building which are essential for its support and overall structural stability … 37     The Oxford Dictionary definition of “structure” is as follows: Structure — way in which building etc is constructed; supporting framework or essential parts; thing constructed; complex whole; building. Structural – of structure 38     The beams are part of the structure of the Development. Further, the beams, which are essential for the support of the building and its overall structural stability, are clearly “key structural elements” of the Development. Both the consulting engineer of MCST, WTS and the expert of the Respondents, Mr Song Wee Ngee (“Mr Song”), agreed that the cracks in the beams are structural in nature. These defects have significantly affected the load bearing capacities of the beams and require urgent rectification.[note: 21]It is not disputed that the affected beams are structural defects under s 30(5) of the BMSMA. Therefore, the MCST is responsible for the rectification of the affected beams provided the Respondents have not breached their duty under s 63(a) of the BMSMA.",
        "Have the Respondents breached their duty under s 63(a) of the BMSMA": "The scope of the subsidiary proprietor’s duties under s 63(a) of the BMSMA 39     Section 63(a) of the BMSMA provides as follows: Duties of subsidiary proprietors and other occupiers of lots 63.    A subsidiary proprietor, mortgagee in possession (whether by himself or any other person), lessee or occupier of a lot shall not — (a)    do anything or permit anything to be done on or in relation to that lot so that — (i)    any support or shelter provided by that lot for another lot or common property is interfered with … 40     In this case, the MCST is of the view that the Respondents caused the structural defects in the beams. They thus argued that the Respondents have breached their duty under s 63(a) of the BMSMA. This statutory duty mandates that the subsidiary proprietor “shall not do anything” to cause structural defects.  This implies that the subsidiary proprietor should refrain from doing a positive and direct act which causes the structural defect. The statutory duty also mandates that the subsidiary proprietor “shall not permit anything to be done” which causes structural defects. This carries a different meaning from the first prohibition. Unlike the first prohibition which relates to positive and direct acts, this prohibition requires that the subsidiary proprietor refrains from allowing another party, such as his contractor, to do an act which causes structural defects. Furthermore, the phrase “do anything or permit anything to be done” connotes a conscious state of mind in which the subsidiary proprietor knowingly causes the structural defect or allows it to be caused. Can an omission amount to a breach of s 63(a) of the BMSMA? 41     The MCST submitted that an omission can amount to a breach of s 63(a) of the BMSMA. The Respondents’ counsel seems to indicate that s 63(a) does contemplate omissions which cause the structural defect when he stated that “[i]t is not the Respondents’ case that Section 30(5) covers only positive acts and not omissions”.[note: 22]In this regard, the MCST referred to the Interpretation Act to argue that s 63(a) contemplates breaches of it by way of omissions: 2.—(1)    In this Act, and in every written law enacted before or after 28th December 1965, the following words and expressions shall, without prejudice to anything done prior to that date, have the meanings respectively assigned to them unless there is something in the subject or context inconsistent with such construction or unless it is therein otherwise expressly provided: … \"act\",in relation to an offence or civil wrong, includes a series of acts, and words which refer to acts done shall be construed as extending toillegal omissions… [emphasis added] 42     Section 2(1) of the Interpretation Act indicates that an “act” in relation to a civil wrong shall be construed as extending to “illegal omissions”. In other words, the Interpretation Act does not construe an act to mean a mere omission. It refers to an illegal omission. The emphasis is on the adjective “illegal”. When the definition of “act” under the Interpretation Act is applied to s 63(a) of the BMSMA, it does not mean that the provision refers to every omissionper se. The omission has to be illegal. What constitutes an illegal omission under s 63(a) of the BMSMA? This requires an analysis of the phrase “do anything or permit anything to be done” which I have explained above (at [40]).  The subsidiary proprietor must have done a positive act with the intention, knowledge or wilfully caused the structural defect. The subsidiary proprietor will also be liable if he lets, agrees, allows, authorises, approves or even facilitates actions that result in the structural defect. Therefore, the illegal omission under s 63(a) has to be considered in this context. Hence, it has to be a conscious, deliberate or wilful omission with the knowledge that such omission will result in a structural defect. 43     Both WTS and Mr Song agreed that the steel bars in the affected beams had shown signs of serious corrosion that caused spalling of the concrete. This could only be caused by water seepage from the upper floor.[note: 23]As these affected beams are located in the false ceiling of the Unit, such defects are not apparent to the Respondents. Furthermore, the Development is about 41 years old and is plagued with widespread problems of extensive spalling concrete that affected many other units. This was discovered by the MCST engineer at the last ten-yearly inspection in 2010. 44     There is no evidence to suggest that the Respondents had caused or permitted anything to be done to the affected beams that resulted in the structural defects. There is also no evidence to suggest that the defective beams were the result of a wilful omission on the part of the Respondents. On the contrary, if water seepage from the upper floor was the dominant cause of the defects, the defects could not possibly be intentionally caused by the Respondents. Furthermore, given that the beams are hidden in the false ceiling, the Respondents would have had no knowledge of such defects or their ability to cause such defects. 45     The MCST alleged that after the inspection by WTS, it was found that there were problems with spalling concrete in the vicinity of the apartment toilets. The MCST submitted that it had discharged its duty when it issued circulars on 23 March 2011 requiring subsidiary proprietors, including the Respondents, to check their ceilings for spalling concrete and to make good these defects. The Respondents alleged that they had not received the said circular. Be that as it may, the MCST argued that the Respondents had omitted to act on the circular and thus failed to discharge its duty under s 63(a) of the BMSMA. The flaw in the MCST’s argument is that it fails to recognise that these affected beams are structural defects and that it is the responsibility of the MCST to carry out the repairs and not the Respondents. The MCST cannot possibly deflect such an obligation by simply sending out a circular asking the subsidiary proprietors to remedy the problem. I therefore agree with the STB that the MCST is legally obliged under s 30(5) of the BMSMA to rectify the affected beams.",
        "Conclusion": "46     Before I conclude, I would like to point out that WTS, which was engaged by the MCST to inspect the affected beams, has called for urgent repairs to be carried out on the affected beams. As explained by WTS in their letter to the MCST on 10 February 2012:[note: 24] ... Such defects hadsignificantly reduced the load bearing capacities of the floor structuresandadversely affected the safety of the occupants. ... ... Apparently, the defects have since deteriorated further to a state thatrequires repair to be taken urgently. [emphasis added] 47     Similarly, the Respondents’ expert, Mr Song, has, on 7 November 2012, urged immediate action to be taken: … since the integrity of floor beams are affected and these beams are forming as a structural frame resisting not only vertical loads but also lateral loads (wind loads and notional loads) of the whole building, it isequally important that early repair to these beams is to be carried out.[note: 25] [emphasis added] 48     Many lives are at stake here. Safety of the occupants of the Development is of paramount importance. Unfortunately, the MCST has taken a nonchalant attitude towards such a serious matter. I would expect a responsible MCST that is concerned for the lives and safety of its occupants at the Development to urgently rectify the structural defects and then subsequently deal with the legal issues and ascertain who is to bear the cost of the repairs. 49     These defects were first discovered by the Respondents’ contractor in January 2012. It has now been more than two years since then and we do not know how long these structural defects were there before they were discovered. Such a deteriorating condition cannot be allowed to continue as there are very serious consequences that may follow. Accordingly, for the reasons given above, I thereby dismiss this appeal and order that the MCST proceed to carry out the repairs immediately. 50     I also order that the MCST bear the costs of this appeal and the proceedings below to be agreed or taxed.  [note: 1]Record of Proceedings, Volume 5, p 4. [note: 2]Record of Proceedings, Volume 5, p 4. [note: 3]Record of Proceedings, Volume III Part A at p 30, para k. [note: 4]Record of Proceedings, Volume III Part A at pp 38–40. [note: 5]Record of Proceedings, Volume III Part C at p 225, para 3. [note: 6]Record of Proceedings, Volume III Part A at p 51. [note: 7]Record of Proceedings, Volume III Part A at p 171. [note: 8]Record of Proceedings, Volume III Part A at p 81. [note: 9]Record of Proceedings, Volume III Part A at p 80. [note: 10]Record of Proceedings, Volume II at p 9. [note: 11]Record of Proceedings, Volume III Part C at pp 226–266; Record of Proceedings, Volume III Part D at pp 4–84, 85–97. [note: 12]Record of Proceedings, Volume III Part D at pp 85–97. [note: 13]Record of Proceedings, Volume I at p 6. [note: 14]Record of Proceedings, Volume I at pp 6–7. [note: 15]Record of Proceedings, Volume I at pp 7–8. [note: 16]Respondent Bundle of Authorities Tab 6 p B62 [note: 17]Respondents’ Bundle of Authorities at Tab 7, pp 17–18. [note: 18]Respondents’ Bundle of Authorities at Tab 7, p 17. [note: 19]Record of Proceedings, Volume III Part A at p 118. [note: 20]Appellant’s Written Submissions dated 14 February 2014 at p 9, para 23. [note: 21]Record of Proceedings, Volume III Part A at pp 166, 224–225. [note: 22]Respondents’ Submissions dated 14 February 2014 at p 29, para 49. [note: 23]Record of Proceedings, Volume III Part A at p 166. [note: 24]Record of Proceedings, Volume III Part A at p 166. [note: 25]Record of Proceedings, Volume III Part A at p 224, para 4.2."
    }
}