{
    "case_title": "Tan Kian Tiong\n      v\n      Public Prosecutor",
    "ncitation": "[2014] SGHC 153",
    "coram": "See Kee Oon JC",
    "sections": {
        "Introduction": "1       This is an appeal against the decision of the\n                    District Judge inPublic Prosecutor v Tan Kian\n                        Tiong[2014] SGDC 85 (“the GD”). The appellant\n                    pleaded guilty to a charge under the Road Traffic Act (Cap 276, 2004 Rev Ed)\n                    (“RTA”) and was sentenced to a fine of $800 and disqualified from\n                    holding or obtaining a driving licence for all classes of vehicle for six months\n                    (“the disqualification order”) from the date of his conviction. He\n                    has appealed against the imposition of the disqualification order\n                only. 2       The facts of this case are straightforward. The\n                    charge that the appellant pleaded guilty to is as follows: You, Tan Kian Tiong, are charged that you, on\n                            8thday of May 2013, at about 3:35pm, along\n                        Sims Avenue towards Sims Avenue East, Singapore, being the driver of motor\n                        vehicle SJE 7597D, did use a mobile telephone while the said motor vehicle\n                        was in motion, and you have thereby committed an offence punishable under\n                        Section 65B of the Road Traffic Act, Chapter 276. 3       When the appeal came before me on 25 June 2014,\n                    apart from elaborating on the grounds of appeal found in the appellant’s\n                    petition of appeal, counsel for the appellant also raised the possibility of\n                    filing a criminal revision in order to qualify the appellant’s plea of\n                    guilt. I observed then that based on counsels’ submissions, there was no\n                    prejudice or serious injustice so as to invoke the revisionary jurisdiction of\n                    the court, but reserved my judgment on the appeal to be delivered on a later\n                    date. After considering the arguments raised by the parties, I am satisfied that\n                    the District Judge did not err and that the imposition of the disqualification\n                    order is not manifestly excessive. My reasons for dismissing the appeal are set\n                    out below.",
        "The decision below": "4       The appellant was not represented in the\n                    proceedings below. He pleaded guilty to the charge and his Statement of Facts\n                    (“SOF”) was admitted without qualification. In mitigation, the\n                    appellant asked for a lighter fine and stated that he needed his driving licence\n                    for the purposes of his work. 5       In deciding on the appropriate sentence, the\n                    District Judge observed that the primary sentencing principle in such cases was\n                    one of deterrence. She relied on the decision of the High Court inHeng Jee Tai v PP[1997] 1 SLR(R) 149 (“Heng Jee Tai”) and the relevant Parliamentary\n                    Debates pertaining to the introduction of the offence of using a mobile phone\n                    while driving a vehicle. As there was no particular aggravating or mitigating\n                    factor, the District Judge imposed a fine of $800 and a disqualification order\n                    of six months, noting that this was consistent with sentences ordinarily meted\n                    out for this offence.",
        "The appellant’s arguments": "6       The appellant raised four grounds of appeal\n                    which can be found in his petition of appeal dated 24 March 2014. These grounds\n                    assert that the District Judge had erred in law and in fact as she had: (a)     failed to fully appreciate that the\n                        appellant’s handling of the mobile telephone was momentary and, as\n                        such, his ability to control his vehicle was\n                    questionable; (b)     failed\n                        to fully appreciate the exceptional circumstances surrounding the case, in\n                        that the appellant had not deliberately used the mobile phone and was merely\n                        trying to switch off the phone which was ringing continuously and, towards\n                        that end, had only responded to say “I will call back” before\n                        ending the call; (c)     failed to give sufficient weight and/or consideration to all the factors,\n                        especially the length of the call, such that a shorter disqualification\n                        period would have sufficed due to the exceptional circumstances of the case;\n                        and (d)     been\n                        influenced by irrelevant considerations outside the proper scope and/or\n                        ambit leading to her imposing a sentence that was not in accordance with the\n                        law. 7       The appellant’s argument that the District\n                    Judge had been influenced by “irrelevant considerations” requires\n                    some elaboration. The appellant had admitted to the following facts at paragraph\n                    3 of the SOF: …the driver was holding the mobile phone in his right hand to his\n                        right ear and was seen communicating with it while using only his left hand\n                        to control the steering wheel of the vehicle when driving. In doing so, the\n                        driverlessened his ability to control the vehicle and\n                            diminished his concentration on the road. [Emphasis\n                        own] 8       On appeal, the appellant challenged his\n                    admission that his ability was lessened and that his concentration was\n                    diminished. According to him, he was under the impression that he was only\n                    admitting to the act of using his phone whilst driving. This is significant\n                    because, so the appellant argued, the admission of the lessening of his ability\n                    and the diminishing of his concentration pertains to a charge under s 65 of the\n                    RTA, whereas an admission of the use of his mobile phonesimpliciterpertains to a charge under s 65B of the RTA, which\n                    was what he was charged with. By making this “additional”\n                    admission which he did not intend to, the District Judge was made to take into\n                    account “irrelevant considerations” in deciding on the sentence.\n                    Furthermore, the appellant asserted that the reliance onHeng\n                        Jee Taiwas erroneous as the decision inHeng\n                        Jee Taiwas premised on the fact that there was a lessening of\n                    ability and diminishing of concentration and not on the use of a mobile phonesimpliciter.",
        "My decision": "9       There are two issues that should be explored in\n                    deciding whether the disqualification order for six months is manifestly\n                    excessive. First, whether the appellant should be allowed to retract his\n                    admission of paragraph 3 of the SOF and, second, assuming that his plea can be\n                    qualified to that extent, whether it would mean that the disqualification order\n                    for six months is manifestly excessive given his other grounds of\n                appeal.",
        "Should the appellant be allowed to retract his admission of paragraph\n                3 of the SOF?": "10     The law on whether a plea of guilt is\n                    qualified is well-established. As explained by then Chief Justice Yong Pung How\n                    (“CJ Yong”) inToh Lam Seng v Public\n                        Prosecutor[2003] 2 SLR(R) 346 (“Toh\n                        Lam Seng”) at [5] (see alsoBalasubramanian Palaniappa Vaiyapuri v PP[2002] 1 SLR(R) 138\n                        (“Balasubramanian”) andKoh Thian Huat v PP[2002] 2 SLR(R) 113),\n                    there are three procedural safeguards to be observed before a plea of guilt can\n                    be accepted: (a)     that the accused should plead guilty\n                        by his own mouth; (b)     that the onus lies on the court to ensure that the accused\n                        understands the true nature and consequences of his plea;\n                    and (c)     that the court\n                        must establish that the accused intends to admit without qualification the\n                        offence alleged against him. 11     The observations of then CJ Yong inToh Lam Sengat [8] and [9], describing the purpose and\n                    the approach to be taken in applying these safeguards, are instructive: 8       There is good reason for these\n                        stringent requirements. As I observed inKoh Thian\n                            Huat, a revisionary court must jealously guard its powers to\n                        prevent abuse by litigants seeking to use it as an alternative avenue of\n                        appeal against their conviction. The safeguards protect accused persons from\n                        uninformed or misguided pleas of guilt and as such are to be stringently\n                        observed; equally, however, where circumstances show that one has pleaded\n                        guilty unreservedly and with full knowledge of the consequences, it would be\n                        an abuse of the court's revisionary jurisdiction to allow a retraction of\n                        his plea. 9       Accordingly, the paramount\n                        function of the lower courts when accepting a plea of guilt is to\n                        determine whether the accused knowingly and unreservedly intends to plead\n                        guilty to the charge and admit the truth of the allegations against him in\n                        the SOF. In pursuance of this, it is beholden on the lower court to fully\n                        explain to the accused the nature and consequences of both the charge and\n                        his plea of guilt to it, and to ensure his comprehension. With\n                        regard to a mitigation plea, a statement which discloses the\n                        possibility of a defence does not\n                        always qualify a plea of guilt. Such statements made in\n                        mitigation could validly be treated as being made solely for their\n                        mitigatory effect without an intention to deny or contradict the accused\n                        person's prior admissions to the charge and SOF. 12     As seen from above, it is paramount for the\n                    court to ensure that the accused “knowingly and unreservedly intends to\n                    plead guilty to the charge and admit the truth of the allegations”. That\n                    said, it cannot be the case that a plea of guilt would be qualified and rejected\n                    every time an accused simply asserts that he did not understand what he was\n                    pleading to. To that end, the court must carefully consider the circumstances\n                    surrounding his plea and, if relevant, also properly consider the mitigation\n                    plea to see whether this qualifies his plea of guilt. Where there is a dispute\n                    in relation to facts that may have a material effect on sentence\n                    (notwithstanding that the plea of guilt remains valid) and the dispute cannot be\n                    resolved, the proper course would be for the court to convene a post-conviction\n                    (orNewton) hearing pursuant to s 228(5) of the\n                    Criminal Procedure Code (Cap 68, 2012 Rev Ed) and hear evidence, if\n                    necessary. 13     In the present case, counsel for the appellant\n                    suggested that the plea of guilt remained valid as there was no qualification of\n                    the legal ingredients of the charge under s 65B of the RTA, but the appellant\n                    should nonetheless be permitted to retract his admission of paragraph 3 of the\n                    SOF. According to counsel, the appellant had not intended to make this\n                    “additional” admission and it was not germane to an offence under\n                    s 65B of the RTA. In substance, this was an attempt to invoke the court’s\n                    revisionary jurisdiction to allow the appellant to retract his admission of the\n                    SOF insofar as paragraph 3 was concerned. To that limited extent, his plea of\n                    guilt was qualified but it would not warrant a rejection of the plea\n                    outright. 14     There are three points that can be made in\n                    relation to the appellant’s plea of guilt. First, I am not convinced that\n                    the appellant did not know or understand what he had admitted to in his SOF as a\n                    matter of plain English. The SOF comprises four paragraphs and is not complex.\n                    Given that the appellant understands English, I cannot see how he could not have\n                    understood the four simple paragraphs and the facts that they\n                cover. 15     Second, I am not persuaded that, as counsel\n                    for the appellant argued, the appellant did not have a “proper\n                    realization of the far reachingconsequencesof” admitting that the use of the mobile phone “lessened his\n                    ability to control the vehicle and diminished his concentration on the\n                    road”. Implicit in this argument is a challenge that the court had not\n                    adhered to the procedural safeguard of ensuring that the accused understands the\n                    true nature andconsequencesof his plea (see [10]\n                    to [12] above). As explained inBalasubramanianat\n                    [25]: the court must ascertain that the accused understands the nature and\n                        consequences of his plea and intends to admit without qualification the\n                        offence alleged against him. By \"nature\" of the plea, this meant that the\n                        accused must know exactly what he was being charged with.As for the \"consequences\" of the plea, the accused had to be aware of\n                            the punishment prescribed by the law so that he knew the possible\n                            sentence that he would receive upon conviction. [Emphasis in\n                        italics added] 16     As a matter of law, however, it is incorrect\n                    to say that the appellant did not understand the consequences of his plea simply\n                    because he admitted to a certain fact that could be an aggravating factor as a\n                    matter of sentencing. So long as the appellant knew the possible sentence that\n                    he could receive, he is taken to have understood the consequences of his plea.\n                    In this case, it is clear that possible consequence of disqualification from\n                    driving was plain to the appellant, given that he had pleaded in mitigation that\n                    he needed his driving licence for the purposes of his work. 17     Third, counsel for the appellant also raised\n                    what seems to be a hypothetical or ‘imagined” situation where, if\n                    the appellant had appreciated the consequences better, he: …could have agreed that whilst his attention was divided between\n                        the call and the driving he could nevertheless have said that he had slowed\n                        down and he was on the extreme lane of the road such that he was able to\n                        proceed at a tortoise pace and successfully rebut the fear of imminent\n                        danger to third parties… Suffice to say, the appellant has had his full opportunity to\n                        challenge the SOF, or to raise the relevant matters in his mitigation plea.\n                        The fact that he did not do so strongly suggests that this was a purely\n                        hypothetical situation, and therefore, I see absolutely no merit in this\n                        argument. Even if he had raised these points, they are of dubious mitigating\n                        value. Quite apart from the flippancy of the claim that he was able to slow\n                        down and proceed “at a tortoise pace” on the extreme left lane\n                        of the road, this did not mean he could never pose any risk to other road\n                        users when he was using his mobile phone. Conceivably, there might well have\n                        been a separate charge of inconsiderate driving for holding up traffic\n                        behind him as he drove in such a fashion while attending to the\n                    call. 18     In these circumstances, I see no reason to\n                    allow the appellant to retract his earlier admission of paragraph 3 of the SOF.\n                    There was no credible basis whatsoever for his contention that he did not intend\n                    to make this “additional” admission. I find that the appellant had\n                    admitted fully to the facts as found in his SOF and there is thus no\n                    justification for the court to exercise its revisionary\n                jurisdiction.",
        "Is the disqualification order of six months manifestly excessive?": "19     Even if it were assumed that the appellant did\n                    not admit to the fact that using his mobile phone while driving had\n                    “lessened his ability to control the vehicle and diminished his\n                    concentration on the road” (“the admitted words”), I am not\n                    persuaded that the disqualification order of six months is manifestly excessive.\n                    The disqualification order of six months is in accordance with previous\n                    sentencing precedents – see the cases cited inSentencing Practice in the Subordinate Courts Volume II(LexisNexis, 3rd Ed, 2013) at pp 1706 and 1707. Counsel for the appellant,\n                    however, submitted that the cases under s 65 of the RTA should not be used\n                    as a sentencing benchmark for a s 65B offence because: (a)     the admitted words form the key\n                        ingredients of an offence under s 65 of the RTA, which the appellant was not\n                        convicted of; and (b)     there is a distinction between the cases under s 65 of the RTA and\n                        those under s 65B of the RTA. 20     I disagree. As can be discerned from the\n                    relevant Parliamentary Debates which were cited by the District Judge at [6] of\n                    the GD, the primary purpose of creating a separate offence was to curb the\n                    rising number of drivers who were using their mobile phones. While such offences\n                    were prosecuted under s 65 of the RTA in the past, special recognition is now\n                    given to this class of offences because of the problem ofprevalence, and not so much because there is a difference in the\n                    moral culpability between the specific offence of using a hand phone while\n                    driving on one hand, and the general offence of driving without due care and\n                    attention and without reasonable consideration on the other. 21     In my judgment, the sentencing regime and\n                    precedence for such offences under s 65 of the RTA followingHeng Jee Tai’scase continue to remain relevant and\n                    applicable for offences under s 65B of the RTA. This is also supported by the\n                    fact that both the courts (when such offences fell under s 65 of the RTA) and\n                    the Parliamentary Debates (commenting on such offences under s 65B of the RTA)\n                    reflect the same concerns and sentiment – drivers who use mobile phones\n                    pose serious risks to other road users as they are likely to have less control\n                    over their vehicles, and there is a need to take a deterrent approach as a\n                    manner of sentencing. I therefore do not agree with counsel for the appellant\n                    that the approach for such cases which had previously been dealt with under s 65\n                    of the RTA is not relevant for cases prosecuted under s 65B of the\n                RTA. 22     The appellant argued that the use of his\n                    mobile phone was only “momentary”, in that all he did was to tell\n                    the caller that he would call back shortly. Further, the appellant also\n                    submitted that he was merely trying to switch off the phone which was ringing\n                    continuously. In my view, these assertions do little to help the\n                    appellant’s case. They were clear afterthoughts. They were also inherently\n                    contradictory in that he claimed, on one hand, that he had wanted to switch off\n                    his phone, and on the other, that he went ahead instead to answer the call,\n                    albeit only momentarily. In any event, the appellant chose not to raise such\n                    facts in his mitigation plea and has only raised them at this stage. I cannot\n                    see how he would have thought that it was irrelevant to raise these facts\n                    earlier on. 23     It is also pertinent to note that counsel for\n                    the appellant had initially intimated that he would seek leave to adduce further\n                    evidence which could support the appellant’s claim, namely the call logs\n                    showing the duration of the call. At the commencement of the appeal hearing,\n                    counsel conceded that he would not pursue this line of argument, having seen the\n                    relevant call logs produced by the prosecution. No more need be said about this\n                    as the inference is obvious. As such, his claims are merely bare assertions, and\n                    I see no reason why they should be accepted by this court.",
        "Conclusion": "24     To further buttress their case, the\n                    Prosecution brought to my attention a decision of the State Courts and two\n                    newspapers articles commenting on the increasing number of summonses being\n                    issued to drivers for using their mobile phones. This was done by letter after\n                    the appeal hearing. While these documents might indeed be relevant to the appeal\n                    and the act of bringing them to my attention is appreciated, the proper\n                    procedure is for these documents to have been exchanged and tendered during the\n                    hearing before me. If, for whatever reason, parties see a need to supplement\n                    their case after the hearing, the appropriate way to do this would be to write\n                    in to request for permission to adduce further arguments or documentsbeforesubmitting them. 25     As the documents had already come to my\n                    attention, it was only fair to afford the appellant an opportunity to respond.\n                    Counsel was duly informed of this and was directed to file a response in writing\n                    if he so desired by 21 July 2014. In the event, no such response was received.\n                    In any case, there was no need in the circumstances to rely on the\n                    Prosecution’s additional documents or counsel’s response to come to\n                    my decision, as the sentencing policy and practice for such offences is clearly\n                    established. For the reasons stated above, I do not find that the\n                    disqualification order of six months is manifestly excessive, and therefore,\n                    dismiss the appeal."
    }
}