{
    "case_title": "Chen Qiangshi\n      v\n      Hong Fei CDY Construction Pte Ltd and another",
    "ncitation": "[2014] SGHC 177",
    "coram": "George Wei JC",
    "sections": {
        "Background": "5       The accident occurred at the fifth and, what was then the highest, floor of the partially-constructed industrial building. A rebar cage collapsed on the plaintiff as it was about to be lifted by a tower crane.",
        "Rebar cages in construction work": "6       An understanding of the accident in its proper context will require a brief description of the use and installation of a rebar cage. A rebar cage is a grid of interlocking steel bars that is utilised in the construction of reinforced concrete columns. It has the appearance of a long rectangular box-like structure open at the top and bottom. The rebar cage that collapsed on the plaintiff was a rectangular column said to have a height of 6.8m, a length of 1.5m and a breadth of 0.6m.[note: 2]It is not disputed that it also had a considerable weight, although the precise figure was not in the evidence. 7       A rebar cage is installed on a concrete floor by securing each steel bar at the bottom end of the rebar cage to a corresponding starter rebar using three wire ties. Starter rebars are steel bars that protrude from the concrete floor which the rebar cage is to be installed on. Once the rebar cage is installed, it will be cast in concrete to form a reinforced concrete pillar. 8       The installation of a rebar cage requires the lifting assistance of a tower crane. This is especially so when the rebar cage is to be installed on a floor above ground level. The rebar cage is fabricated off-site. It is transported to the construction site by vehicle and off-loaded onto the ground level in a lying-down position. 9       While the rebar cage is still in a lying-down position, it is rigged up (ie, attached) to two hoist chains. The hoist chains have hooks on one end, which are used to rig up a load for lifting. The other end of the hoist chains is connected to the tower crane. 10     Both hoist chains are inserted through the top opening of the rebar cage and run along the inside of the entire height of the rebar cage. Both hoist chains are then looped around on either side of the base of the rebar cage. The hooks at the end of each hoist chain are connected to one of the horizontal bars along the breadth of the rebar cage about 1.5m from its base. A simplified diagrammatic representation of how a rebar cage is rigged up is found in the annexure to this judgment. The diagram was exhibited in the plaintiff’s affidavit of evidence-in-chief (“AEIC”) filed in this suit. Parties do not dispute that the diagram depicts the usual method for rigging up a rebar cage for a lifting operation. 11     Once the rebar cage is rigged up, it is lifted by the tower crane. Because of the manner in which it is rigged up, the rebar cage will naturally be suspended in an upright position. The pivot of the suspended rebar cage restsbelowits centre of gravity, resulting in an unstable system. The rebar cage is nonetheless prevented from toppling over and held in position by the hoist chains running through the entire height on the inside of the cage (see the annexure to this judgment). 12     The rebar cage is lifted to the floor where it is to be installed. It is guided to the precise location for installation and lowered. The rebar cage is, all this while, suspended by the tower crane in an upright position. When the rebar cage is close enough to the concrete floor where it is to be installed, rebar workers will begin securing the rebar cage to the starter rebars with wire ties. At this point, the hoist chains connected to the tower crane are kept taut and they still bear at least some of the weight of the rebar cage. The tension in the hoist chains keeps the rebar cage in an upright position while it is being secured to the starter rebars by the rebar workers. 13     At the trial, a good deal of evidence was heard on the sequence and number of wire ties which were used to secure the starter rebars to the rebar cage. The significant point is that not all the starter bars would be secured to the rebar cage before the hoist chains are released. It is sufficient to secure only alternate starter bars (working inwards from each corner).[note: 3]Once this is done, the hoist chains are loosened and released. The rebar workers would then complete the installation of the rebar cage by securing the remaining steel bars to their corresponding starter rebars. 14     The practice is not to release the hoist chains only after securingallthe starter rebars. The rebar cage was considered sufficiently secure once the alternate starter rebars were secured – the tower crane would accordingly be freed up at that point. The tower crane is in high demand, and requiring all the starter rebars to be secured would tie the tower crane down for a longer period of time. 15     No independent witness was called to testify on what would be the proper procedure for the installation of the rebar cage. There is no evidence from witnesses to suggest that the procedure used for the installation of rebar cages at the Worksite was out of line with industry practice.",
        "Roles and responsibilities of the persons involved in the installation of rebar cages": "16     Rebar workers work in teams of two or three. The plaintiff was an experienced rebar worker and ade factoleader of one of these teams.[note: 4]He had worked as a rebar worker in Singapore for about four years,[note: 5]and “many years” before in the PRC.[note: 6]The rebar workers were employed by the first defendant, the sub-subcontractor. The teams of rebar workers at the Worksite were supervised by Chen Dongyu. Mr Chen, a PRC national, was a Singapore permanent resident and a director of the first defendant at the material time. 17     Two other persons who play an instrumental role in the lifting and installation of the rebar cage are the rigger and the signalman. The rigger is responsible for rigging up loads to the hoist chains. His duty is to ensure that a load is properly rigged up and balanced before it is lifted by a tower crane. The signalman is responsible for communicating with the tower crane operator. The signalman gives all the commands on when to lift or move the load. He is the only person on the ground (barring the lifting supervisor, who I shall come to in a moment) with a direct line by walkie-talkie to the tower crane operator and the only person on whose instructions the tower crane operator will act. 18     A construction worker is required to attend courses and obtain qualifications before he is permitted to perform either of these roles. The rigger and signalman therefore have roles that are functionally distinct from those of the rebar workers. But a close degree of cooperation between these two functional groups is necessary for the successful lifting and installation of a rebar cage. 19     Masum Miah Benjir Ahamd, whom I shall refer to as Mr Masum, was both the rigger and the signalman. Mr Masum was a Bangladeshi who was employed by the first defendant. He had obtained all the necessary qualifications, but was a relatively inexperienced rigger/signalman. Mr Masum started work at the Worksite in around July or August 2012. At that time, he was assigned odd jobs or simple concreting work, such as transporting wet cement in a wheel barrow.[note: 7]Mr Masum started rigging and signalling work in early October 2012 after completing the requisite courses. He only had about three months of experience as a rigger/signalman at the time of the accident.[note: 8] 20     Mr Masum’s evidence was that he would often ask one of his more experienced colleagues, Palani Kumar, to be present to ensure that he did everything correctly. Mr Kumar, also a rigger/signalman, appears to have more experience than Mr Masum. Indeed, even after working as a rigger/signalman for about three months, Mr Masum candidly admitted that while he was experienced, he would “keep Mr Kumar with me to avoid a mistake, which can indicate by me, highlight by me”.[note: 9] 21     The final two persons who play subsidiary, albeit arguably more pivotal, roles in the lifting and installation process are the lifting and safety supervisors. Their responsibilities are as their titles suggest. Arumugam Thirunavukkarasu, whom I shall refer to as Mr Arasu, was the lifting supervisor and Sangussubramanian Nambimohan, whom I shall refer to as Mr Mohan, was the safety supervisor. Both were Indian nationals and employed by the second defendant, the main contractor.",
        "The installation of the rebar cage in the incorrect position on 25 December 2012": "22     The accident did not occur during the course of a routine rebar cage lifting and installation operation. Rather, the accident occurred when the construction workers were attempting to relocate a rebar cage that had been installed at an incorrect location the day before. 23     Relocating a rebar cage presents peculiar difficulties not present in a usual installation operation (ie, lifting the lying-down rebar cage from the ground level up to the floor where it is to be installed). For one, it first requires the installation procedure to be performed in the reverse order to uninstall the incorrectly-positioned rebar cage. It also necessitates the rigging up of the 6.8m-tall rebar cage while it is in an upright position, as opposed to it being rigged up while it is lying flat on the ground. These difficulties are not insignificant – they will become apparent as I describe the manner in which the accident occurred below. 24     On 25 December 2012, the plaintiff’s team of rebar workers had installed a rebar cage in an incorrect location close to the edge on one side of the fifth floor.[note: 10]The responsibility for the mistake appears to have been the plaintiff’s. He had instructed his team of rebar workers to position the rebar cage in accordance with an outdated schematic diagram of the fifth floor. Mr Masum was working with the plaintiff’s team on 25 December 2012. 25     The plaintiff’s evidence was that Mr Masum and the other rebar workers knew on 25 December 2012 that the rebar cage had been fixed in an incorrect position.[note: 11]Mr Masum disputed that he found out that the rebar cage had to be re-installed on 25 December 2012. He claimed he only found out the following morning. Either way, the rebar cage had to be relocated the next morning. 26     Prior to this incident, neither Mr Masum nor the plaintiff (who had numerous years of rebar-work experience under his belt) had been involved in the relocation of an incorrectly-positioned rebar cage. It is not disputed that installing rebar cages in an incorrect position was a rare occurrence.",
        "The accident on 26 December 2012": "27     On the morning of 26 December 2012, the plaintiff instructed Mr Masum to call the hoist chains from the tower crane over to assist in the relocation of the incorrectly-positioned rebar cage. Mr Masum complied. Before the hoist chains arrived, the plaintiff and his co-worker undid the wire ties on alternate steel bars of the incorrectly-positioned rebar cage.[note: 12] 28     What happened from this point on is the subject of deep disagreement between both sides. The turn of events leading up to the accident spanned no more than 20 minutes. What is agreed is that the rebar cage was eventually rigged up in an improper manner. The hoist chains were not lowered through the top of the rebar cage and allowed to run on the inside through the entire height of the rebar cage, as was usual. The evidence as to how exactly the rebar cage was hooked up was difficult to follow. Instead, it appears from oral evidence[note: 13]and exhibits that the hoist chains were simply hooked up from the outside of the rebar cage about 1.5m–2m from the base of the rebar cage. 29     Once the rebar cage was (improperly) rigged up, the plaintiff, with the help of a co-worker (known only as “Mr Shamsul”), undid the remaining wire ties which secured the rebar cage to the starter rebars. With this, the 6.8m-tall rebar cage was upset from its precarious equilibrium and it tipped over and collapsed on the plaintiff. 30     The evidence was unclear as to what led the rebar cage to collapse rather than to stand upright once the remaining wire ties were removed. There are two possibilities. 31     The first is that the tower crane operator tautened the hoist chains (which were already hooked up to the rebar cage at this point). This would mean that at least some, if not all, of the weight of the rebar cage was supported by the tautened hoist chains. Once the remaining wire ties were removed, the weight of the 6.8m-tall rebar cage pivoted about the point where the hoist chains were hooked up to it (about 1.5–2m from its base). The pivot, which would have been below the centre of gravity of the rebar cage, coupled with the upward force from the tautened hoist chains could have destabilised the rebar cage and caused it to collapse. 32     The second possibility is that the hoist chains werenottautened. The rebar cage would then have been a free-standing object once the wire ties which secured it to the starter rebars were removed. The rebar cage did not remain in balance in an upright position and as a result, collapsed on the plaintiff. 33     In either scenario, even without the benefit of expert evidence, it is clear and undisputed that the root cause of the collapse was the improper rigging up of the rebar cage. If it had been rigged up in a proper manner and the usual lifting procedure adhered to in reverse, the accident would not have occurred. 34     It is undisputed that Mr Chen, the rebar workers’ supervisor, as well as Mr Arasu and Mr Mohan, the lifting and safety supervisors, were not present while the relocation operation was being carried out. The only persons who perceived the accident directly were the plaintiff, his co-worker, Mr Shamsul, and the rigger/signalman, Mr Masum.",
        "The issues": "35     There are four broad issues that arise in this case. The first is factual, the other three are legal: (a)     The first issue concerns the sequence of events leading up and immediately prior to the accident. There are numerous factual disputes between both sides, but I will group them together for the sake of convenience. The various factual disputes will be fleshed out as sub-issues below. (b)     The second issue is whether the defendants were negligent. (c)     The third issue is whether Mr Arasu and Mr Masum were negligent and if so, whether either of the defendants is vicariously liable for their negligence. (d)     The fourth issue is whether there was contributory negligence on the part of the plaintiff and if so, the extent to which the defendants’ liability should be reduced.",
        "The witnesses and evidence": "36     There are three observations I would like to make on the witnesses and evidence before turning to deal with the issues. The first concerns the witnesses that testified in court and their demeanour in general. The second is on the contemporaneous documentation on the accident, especially the post-accident investigation. The final observation concerns expert evidence. 37     The plaintiff, who was his only witness, was in some physical discomfort during his testimony. He was candid and frank in admitting that he wanted to relocate the incorrectly-positioned rebar cage on 25 December 2012 itself, so that his supervisors would not discover his mistake. 38     The general impression that I formed was that the plaintiff was a hardworking employee who had been working on Christmas Day and who was keen on earning overtime pay.[note: 14]He appeared to be sincere and candid for the most part. There are, however, some specific areas of his evidence which were riddled with inconsistencies. One such area concerns the circumstances in which the rebar cage was rigged up, which will be dealt with below. 39     There was some suggestion from Mr Chen, the plaintiff’s supervisor, that the plaintiff had been careless in his work on some previous occasions. That was a bare assertion. There is no other evidence to corroborate this allegation.[note: 15]No details of previous instances of carelessness were given. If the plaintiff was an anxious worker prone to making mistakes, it begs the question why the first defendant put him in charge of a small team of rebar workers. The evidence (including the plaintiff’s) only went as far as to suggest that the plaintiff was an eager worker, anxious to complete the task at hand.[note: 16]It is clear that the plaintiff regarded himself as an experienced rebar worker. He was also embarrassed by his mistake of installing the rebar cage in an incorrect position. 40     The witnesses for the defendants were: (a) Mr Masum (the rigger/signalman); (b) Mr Chen (the rebar workers’ supervisor); (c) Mr Arasu (the lifting supervisor); and (d) Mr Mohan (the safety supervisor). 41     Mr Masum was younger and had less experience than the plaintiff.  The morning of the accident appears to be one of the few occasions he was working on his own as a rigger/signalman, without the supervision of either the lifting supervisor or his more experienced colleague, Mr Kumar.[note: 17] 42     Mr Chen, Mr Arasu and Mr Mohan all stated they did not witness the accident. Their evidence focused on what happened in the immediate aftermath of the accident. Their testimony also covered general procedures at the Worksite. 43     Neither party called Mr Shamsul or the tower crane operator as witnesses. Mr Shamsul would have provided valuable evidence since he was one of only three persons (apart from the plaintiff and Mr Masum) who had perceived the accident first-hand. Attempts at contacting Mr Shamsul were apparently unsuccessful because he had left for Bangladesh. 44     The tower crane operator might have given evidence on what instructions he received from Mr Masum prior to the accident. The defendants claimed that they provided the tower crane operator’s particulars to the plaintiff, who chose not to call him as a witness. 45     The contemporaneous documentary evidence relating to the evidence is scant. In particular, the incident report and investigation into the accident appears to be rather cursory. 46     Mr Chen stated that he was not involved in the safety investigation because that was the duty of the safety officer.[note: 18]Mr Mohan, the safety supervisor (not to be confused with the safety officer), also stated that the post-accident investigations were the duty of the safety officer. Mr Mohan nonetheless arrived on the scene of the accident shortly after it occurred. Mr Mohan took only three photographs of the accident scene. They were taken from a wide-angle perspective; no close-up photographs were taken. Mr Mohan stated that he did not take more photographs because he was more concerned with the safety of the plaintiff at that point in time. 47     Curiously, these photographs, which were taken just after the accident occurred, showed the accident sceneafterthe hoist chains had already been unhooked from the collapsed rebar cage. The defendants claimed that they were unable to discover the identity of who unhooked the hoist chains from the collapsed rebar cage just after the accident had occurred. There was therefore no photographic evidence of the exact manner in which the rebar cage was improperly rigged up. There was also no evidence as to why the hoist chains were unhooked after the accident and before any photographs were taken. 48     A post-accident Incident Investigations and Analysis Report (“the Investigation Report”) was also placed before the court. The Investigation Report was purportedly prepared by the safety officer, who was not called to give evidence. No explanation was provided for this. 49     As part of the post-accident investigations, Mr Masum was the only person from whom a statement was taken. The statement was a bare one with few details of what had occurred leading up to the accident. No statement was taken from Mr Shamsul, who was the only other eye-witness of the accident (apart from the plaintiff). No statement was taken from the tower crane operator, who could have shed light on the instructions Mr Masum had given him. Given the severity of the plaintiff’s injuries and the seriousness of the accident, it is surprising that no statements were taken from these two persons as part of the post-accident investigations. 50     In cross-examination, Mr Mohan accepted that it was important to obtain statements from all witnesses to the accident. He explained that a statement was not obtained from Mr Shamsul because he was a supply worker who had been “supplied” to another worksite the following day.[note: 19]Mr Mohan stated that the tower crane operator was asked what happened, but the tower crane operator simply claimed that he did not know anything and that he simply followed Mr Masum’s commands.[note: 20] 51     Finally, no expert evidence was placed before the court as to proper rigging and lifting procedures for lifting rebar cages, especially non-routine lifts where a rebar cage which is installed at the wrong location is to be relocated. No evidence was provided on what could or might have caused the collapse of the rebar cage: whether the rebar cage simply could not stand upright once the wire ties had been removed, or whether the imbalance must have been caused by tautened hoist chains (see [15] and [30]–[32] above). 52     While these were highly technical issues, the absence of expert evidence and material witnesses and the deficiency in contemporaneous documentation meant that they had to be resolved by deciding between the conflicting accounts of the witnesses called at the trial.",
        "Issue 1: The sequence of events leading up to the accident": "53     Four factual points arise, all of which are crucial to the outcome of the dispute. 54     The first is whether Mr Chen, the plaintiff’s supervisor, was aware on the morning of 26 December 2012 that the rebar cage had been installed in an incorrect position and that the plaintiff’s team of rebar workers intended to relocate it to the correct position. The plaintiff claims that Mr Chen had such knowledge. The defendants deny that Mr Chen had such knowledge until after the accident occurred. 55     The second point is whether Mr Masum informed Mr Arasu about the need to relocate the rebar cage prior to attempting to execute the lifting operation. Mr Masum’s evidence was that he had radioed Mr Arasu to tell him. Mr Arasu’s evidence was that he was not told anything about the relocation of the rebar cage prior to the accident. 56     The third point concerns who rigged up the rebar cage in the improper manner. The plaintiff alleges that Mr Masum took the lead and attached one of the hoist chains and that he (the plaintiff) followed suit with the other hoist chain. The defendants allege that the plaintiff attached both hoist chains to the rebar cage in the improper manner against the profuse protestations of Mr Masum who stood on watching. 57     The fourth point concerns what happened after the hoist chains were hooked up to the rebar cage. The question is whether Mr Masum gave instructions to the tower crane operator to tauten the hoist chains. The plaintiff alleges that Mr Masum instructed the tower crane operator to tension the hoist chains. The defendants deny that he did.",
        "Whether Mr Chen was aware that the rebar cage was mounted in an incorrect position on the morning of 26 December 2012": "58     The defendants claim that Mr Chen, the plaintiff’s supervisor, was unaware of the incorrectly-positioned rebar cage until after the accident occurred. The defendants argue that the plaintiff had a motive to hurry the rigging up of the rebar cage, so that it could be relocated without Mr Chen finding out about the mistake. 59     The plaintiff’s evidence was that on the afternoon of 25 December 2012, he realised that his team had installed the rebar cage in an incorrect position.[note: 21]According to the plaintiff, the rebar workers in his team and Mr Masum were aware that a mistake had been made and that “we all realised it was wrong”.[note: 22]It is clear and not disputed is that the plaintiff did not, however, tell his supervisors about the mistake.[note: 23] 60     The plaintiff candidly admitted in cross-examination that he and his team of rebar workers intended to relocate the rebar cage on the afternoon of 25 December 2012 and keep their mistake from Mr Chen. They were unable to relocate the rebar cage that day. They had to wait till the morning of 26 December 2012 to relocate it.[note: 24]The plaintiff’s evidence was that by the morning of 26 December 2012, they could not keep the mistake from Mr Chen, who found out about the incorrectly-positioned rebar cage and the need to relocate it as he was doing his rounds in the morning on that day.[note: 25] 61     Under cross-examination, the plaintiff stated that on the morning of the 26 December 2012, Mr Chen and Pu Wei Hai (a project manager) noticed the improperly located rebar cage and were informed of the mistake and the need for relocation. According to the plaintiff, the response of Mr Chen was short: relocate it to the right place.[note: 26]In re-examination, the plaintiff’s account changed slightly. The plaintiff stated that, after Mr Chen and Mr Pu discovered the mistake, they did not say much and walked away.[note: 27] 62     Mr Chen gave evidence for the defendants on this point. Mr Chen’s evidence was that he did not know the rebar cage was incorrectly positioned prior to the accident.[note: 28]Mr Chen also denied that Mr Pu was together with him[note: 29]on the morning of 26 December 2012 when he was patrolling the fifth floor of the then partially-constructed building. The defendants did not call Mr Pu to give evidence. Mr Chen claimed that he was unaware that the incorrectly-positioned rebar cage was being relocated. He claimed that, when he “turned over, [the rebar cage] was already falling”.[note: 30]By this, Mr Chen appeared to mean that he was walking around the fifth floor when he turned and saw the rebar cage falling. It was only after the accident occurred that he discovered what had gone on. 63     Under cross-examination, Mr Chen stated that he did not hear any shouting between the plaintiff and Mr Masum on the morning of the accident while he was walking on the fifth floor. The Worksite was a noisy place at the time.[note: 31]Further, while he was the director of the first defendant, his role was not to supervise the plaintiff’s work; rather, it was to follow the progress of the project. His evidence was that even though he had been in the construction industry for many years, the first defendant was a new and small company. His evidence was that if he was approached by a worker with a problem, he would usually refer the worker to the supervisor.[note: 32] 64     While this is understandable, I note that on the morning of the accident, the lifting and safety supervisors were on the ground floor, the safety officer was on leave,[note: 33]and Mr Kumar (Mr Masum’s more senior colleague  who was also a rigger/signalman) whom the plaintiff normally worked with was working elsewhere at the Worksite. In short, it appears that there were no supervisors or safety officers on the fifth floor at the time of the accident. 65     I prefer the plaintiff’s evidence to Mr Chen’s. In cross-examination, it was suggested to Mr Chen that he knew that the rebar cage was incorrectly positioned prior to the accident.[note: 34]Mr Chen responded that this was “totally impossible” because he was not at work on 25 December 2012 as it was Christmas.[note: 35]Mr Chen then explained that “on the second day [26 December 2012], [I] ... will come very late, about 8 to 9[am]; and then I went up to patrol”. Mr Chen was suggesting that he came too late to have found out about the incorrectly-positioned rebar cage before the accident occurred. 66     Learned counsel for the plaintiff then suggested to Mr Chen that “the accident happened at about 9.30[am]”.[note: 36]The point was then put to Mr Chen that the contemporaneous documentary evidence recorded that the accident occurred at 9.30am. Mr Chen then responded that the accident occurred at “around 9.00[am]”[note: 37]and attempted to explain his position:[note: 38] QOkay. So now, the accident happened about 9.30, correct? AI’m not sure whether it was 9.30. QOkay. What time do you think it is? AI was saying it was around 9.00. QBecause [9.30] is what you had given in the notification. You knew the rebar cage has fallen in your own notification, done by you. It was stated as 9.30 at page 33. I can show it to you. AI’m not specific---I---I can’t tell the specific time because when I saw the rebar falling, I wouldn’t look at my watch. This is---I would just give a [sic] approximate time. So it would be around 9.00-plus. I am unimpressed by Mr Chen’s explanation. It contradicted the contemporaneous documentation about the time of the accident. It was also a departure from the defendant’s prior apparent acceptance of the plaintiff’s position that the accident occurred at about 9.30am. 67     Further, I am of the view that it is unlikely Mr Chen would have patrolled the fifth floor on 26 December 2012 without detecting that the rebar cage was installed in an incorrect position. In Mr Chen’s words, “the usual thing I do is to walk around and to see the progress”.[note: 39]I find it unlikely that after being away from the Worksite the previous day, while doing his rounds on the morning of 26 December 2012, Mr Chen would not have inspected the work that had been done the previous day to ensure that everything was in order. 68     Indeed, in re-examination, Mr Chen stated that when he went up to the fifth floor on the morning of 26 December 2012, he recalled that there were people doing work at Row 11 “at the very side, at the edge after I went up”. Mr Chen, however, added that when he walked past the column which was involved in the accident (said to be some 30m away), “there were [sic] nobody there and I was thinking, why is this column here?”[note: 40] 69     The difficulty however is that on Mr Chen’s own evidence, by the time he arrived at the Worksite at about 9am on 26 December 2012, it would be very likely that the plaintiff was already at the incorrectly-positioned rebar column. In response to a question from the court, Mr Chen explained that he meant that as he was patrolling, he noticed workers at Row 11 and that when he walked past the wrongly placed rebar cage, he was puzzled as to why the rebar cage was at that location. Nevertheless, he continued with his patrol of the fifth floor. Shortly after, as he turned, he saw the rebar cage falling and that the workers were at the site of the rebar cage.[note: 41] 70     I find this aspect of Mr Chen’s evidence hard to accept. If he was puzzled by the rebar cage being in an incorrect position, why did he not ask for a clarification? After all, Mr Pu, the project manager was on-site even if he was not at the fifth floor at the time. Even if no workers were there, the natural thing to have done would have been to find out what had happened. Further, given the short span of time, it seems very unlikely that the plaintiff, his co-worker and Mr Masum could have arrived and commenced the lifting operation only after he walked past the column, and did what they did, resulting in the collapse of the rebar column, only just as Mr Chen turned round. 71     The defendants, on the other hand, submit that the plaintiff’s evidence was “inconsistent, confusing and vague”.[note: 42]The defendants rely on apparent contradictions between the plaintiff’s evidence in cross-examination and re-examination. The defendants say that in cross-examination, the plaintiff stated that Mr Chen “knew about” the wrongly-positioned rebar cage.[note: 43]In re-examination, however, the plaintiff contradicted himself by stating that on the morning of 26 December 2012, he told Mr Chen about the mistake that he had made the previous day.[note: 44] 72     I reject this submission. One would be hard-pressed to find an inconsistency in the plaintiff’s evidence on this point. The plaintiff’s statement in cross-examination merely indicated that Mr Chen possessed such knowledge on the morning of 26 December 2012; it did not address the means through which Mr Chen acquired that knowledge, which was what the plaintiff’s later statement in re-examination concerned. And even if there is in fact an inconsistency, I am of the view that it is largely immaterial. 73     On balance, I accept the plaintiff’s evidence that Mr Chen was aware of the incorrectly-positioned rebar cage on the morning of 26 December 2012, and that Mr Chen knew that it had to be repositioned. 74     This finding is consistent with the Work Accident Notification Report (“the Notification Report”) which was submitted by Mr Chen for the first defendant. The report stated that “on the day of the incident, the injured worker and his co-worker weretaskedto relocate a wrongly erected column reinforcement cage to the correct location” [emphasis added]. I am aware of the danger of reading too much into the Notification Report. The expression used (“tasked”) is nonetheless consistent with Mr Chen being aware of the need to relocate the rebar cage, as it would suggest that Mr Chen had indeeddirectedthe plaintiff to do so. 75     I also note that para 4 of the defence filed by the defendants in this suit states that “on the morning of 26 December 2012, the Plaintiff and his co-worker were instructed to relocate a column rebar reinforcement cage … erected in the wrong position … on the 5thstorey of the building”. The defendants’ own pleading is consistent with the plaintiff’s evidence that Mr Chen discovered the mistake on the morning of the 26 December 2012 and instructed the plaintiff to correct it.",
        "Whether Mr Masum informed Mr Arasu about the need to relocate the rebar cage prior to attempting to execute the lifting operation": "76     It is clear from the evidence that Mr Arasu, the lifting supervisor, was not present during the relocation operation.[note: 45]Mr Arasu therefore was not supervising the lifting operation and did not witness the accident. There was an inconsistency between Mr Masum’s and Mr Arasu’s evidence about whether the former had radioed the latter to inform him about the need to relocate the rebar cage prior to the relocation operation. 77     According to Mr Masum, he radioed Mr Arasu to come to the fifth floor.[note: 46]Mr Masum told Mr Arasu that there was a rebar cage which had been installed in an incorrect position and needed to be relocated. Mr Arasu replied that he was “busy with some other job ... he need [sic] to receive another rebar column”,[note: 47]and that Mr Masum “can proceed if [he] can. Otherwise, [Mr Arasu] asked [Mr Masum] to wait”.[note: 48] 78     Mr Arasu’s evidence was that he was not told about the operation to relocate the rebar cage. The first time he found out about the lifting operation was when he was informed there was an accident.[note: 49] 79     I prefer Mr Masum’s evidence over Mr Arasu’s. Mr Masum appeared to me generally honest and reliable. He would have had no reason to give untrue evidence on whether he radioed his supervisor before proceeding with the lifting operation. 80     The fact that Mr Masum would have radioed Mr Arasu to inform him about the lifting operation was consistent with his earlier evidence. Mr Masum stated that “whenever I hoisting [sic] this rebar cage, I keep Mr Kumar with me, we worked together”.[note: 50]As mentioned earlier, Mr Masum went on to state that, although he considered himself competent at his job, he nonetheless “keep Mr Kumar with me to avoid a mistake, which can indicate by me highlight by me [sic]”.[note: 51] 81     It seems to me unlikely that Mr Masum would have proceeded with a non-routine lifting operation without at least informing his lifting supervisor about it when he did not have the benefit of Mr Kumar’s supervision and guidance that day. I therefore prefer the evidence of Mr Masum and find that he had radioed Mr Arasu before calling the tower crane over to the incorrectly-positioned rebar cage to carry out the relocation lift.",
        "Whether the plaintiff or Mr Masum rigged up the rebar cage in the improper manner": "82     It is not disputed that the plaintiff and Mr Shamsul began removing wire ties on the rebar cage before Mr Masum directed the tower crane to lower the hoist chains at their location.[note: 52] 83     There is some dispute as to how many wire ties were removed at this juncture and whether it was safe to do so. The plaintiff stated that he only removed the middle wire tie securing each alternate starter rebar to the rebar cage. The rest were left in place to secure the structure.[note: 53]Mr Masum’s evidence was equivocal. He stated that the plaintiff and Mr Shamsul had removed some wire ties which would have affected the stability of the structure. Mr Masum however could not say whether the structure was “strong or not”.[note: 54]No expert evidence was led to show that the removal of the middle wire tie or some wire ties was a departure from usual practice or unsafe. I am of the view that the evidence tends to support the plaintiff’s case that the rebar cage was still sufficiently secure notwithstanding the removal of the middle wire tie or some wire ties attached to alternate starter rebars. 84     Turning to the question of who rigged up the rebar cage in the improper manner, the plaintiff’s and defendants’ accounts were markedly different. 85     The plaintiff’s evidence was that when the hoist chains were called over and lowered, Mr Masum was wondering how to rig up the rebar cage. Mr Masum asked the plaintiff to climb the rebar cage in order to guide the hoist chains through the centre of the rebar cage as they were being lowered.[note: 55]This would allow the rebar cage to be rigged up in the usual manner. The plaintiff refused to do so because rigging up loads was not his job. The plaintiff’s evidence was that Mr Masum did not want to climb the rebar cage either because of its height.[note: 56] 86     The plaintiff’s evidence was that at that moment, he “left the scene and went to join [his] other co-workers in their work elsewhere on the [Worksite]”.[note: 57]The plaintiff then returned to the scene “very quickly”, within “3 to 4 minutes” of leaving.[note: 58]The plaintiff gave evidence that when he returned, Mr Masum his co-worker had attached one of the two hoist chains to one side of the rebar cage with the hoist chain running largely outside of the rebar cage.[note: 59]The plaintiff got back in time to see Mr Masum doing the final adjustment to the position of the hook of that hoist chain.[note: 60] 87     The plaintiff’s evidence on how exactly the hoist chain was attached was convoluted and difficult to follow. In essence, it appears from (a) a drawing[note: 61]of how the rebar cage was improperly rigged from the outside; and (b) oral testimony, that the hoist chains were inserted from outside to inside the rebar cage at the height which was readily reachable by the workers (without climbing) and allowed to run down the inside for a short length before being looped outside again and attached. 88     The result was a highly unstable system whichdid nothave the restraint of the hoist chains threaded through almost the entire inside length of the rebar cage thereby holding it upright. But it is clear that the plaintiff’s claim was that he followed Mr Masum’s lead and attached the other hoist chain to the other side of the rebar cage in the same manner.[note: 62]The plaintiff stated that he realised that the method of rigging up the rebar cage was not the usual manner onlyafterhe had attached the hoist chain on his side.[note: 63]After this realisation, he asked Mr Masum: “You see good or no good. Open you, you clip” to which he received the response: “Okay, okay”.[note: 64] 89     Mr Masum was the defendants’ witness on this point. His evidence was that when he directed the hoist chains to the position of the incorrectly-positioned rebar cage, he realised that the hoist chains had to be raised again, so that they could be lowered through the top opening of the rebar cage in order for it to be rigged up in the usual manner. Mr Masum testified that he asked the plaintiff to attach the hoist chains from the inside of the rebar cage.[note: 65]That said, Mr Masum denied that he asked the plaintiff to climb the rebar cage. 90     Mr Masum claimed that all he told the plaintiff was to use the correct procedure to do the rigging up. The plaintiff refused to do so, apparently because he was in a hurry and wanted to complete the job quickly.[note: 66]I stress that Mr Masum accepted that he did ask the plaintiff to rig up the rebar cage using what he said was the “correct procedure.” As will be discussed later, the plaintiff was a rebar worker. Senior as he may have been, the plaintiff should not have been asked to rig up or assist in the rigging up of the rebar cage at all. Mr Masum claimed that the plaintiff subsequently of his own accord proceeded to attach both hoist chains from the outside of the rebar cage, thus rigging up the rebar cage in an improper manner.[note: 67] 91     I reject the plaintiff’s account that Mr Masum had rigged up one of the hoist chains and the plaintiff merely followed suit, for three reasons. 92     First, it is inexplicable that the plaintiff would “leave the scene” only to return three to four minutes later. The plaintiff, in cross-examination, attempted to explain why he had left:[note: 68] A:At the time [Mr Masum] wanted me to climb [the rebar cage] and I didn’t want to climb and I want him to climb and he didn’t want. And I---and I stood there and he didn’t want to move, so what was I standing there for? I just went to do the work, other work elsewhere. I find this explanation unsatisfactory. From the entirety of the plaintiff’s evidence and his demeanour in court, my impression was that the plaintiff was a man of action. It is unlikely that he would have abandoned the operation in the thick of it, especially when it was his mistake that caused the rebar cage to be installed at the incorrect position. Further, while the plaintiff’s explanation may account for why he left the scene, it does not explain why he would have returned a mere three to four minutes later. Within that time, he would not have accomplished any of the other “work” that he had purportedly helped with when he left the scene. If his annoyance with Mr Masum was the reason for him leaving, logic would suggest that he would stay away until at least the rigging up of the rebar cage was complete, lest Mr Masum make the same requests that drove him away. 93     Second, the plaintiff’s account of what happened is inconsistent. The plaintiff’s AEIC did not state that he had left the scene because Mr Masum asked him to climb the rebar cage and guide the hoist chains into the cage. It merely stated that the plaintiff left while Mr Masum was “figuring out how to rig the hooks of the hoist chains to the rebar cage”.[note: 69]In his cross-examination on 25 March 2014, the plaintiff mentioned for the first time that the reason he left was because Mr Masum asked him to climb the rebar cage. During the plaintiff’s cross-examination on 26 March 2014, the plaintiff supplemented his account by stating that he had first asked Mr Masum to climb the rebar cage to guide the hoist chains in.[note: 70]Mr Masum refused to do so, and asked the plaintiff to climb, which the plaintiff refused. This was not mentioned in the plaintiff’s AEIC or his oral evidence in court the previous day. 94     Third, and most importantly, the plaintiff’s account, even if it were accepted in its entirety, was internally incoherent. The plaintiff claimed that he did not realise that the rebar cage was improperly rigged until after he had finished securing the hoist chain on his side. If the plaintiff had first asked Mr Masum to climb the rebar cage and guide the hoist chains through the centre of the rebar cage, he must have been alive to the fact that that was the proper way to rig up the rebar cage. Being alive to that consideration, the plaintiff must have known, based on his version of the events that it was well-nigh impossible for Mr Masum to have attached the hoist chain in the proper manner in the three to four minutes that the plaintiff was away. Mr Masum would have had to climb the 6.8m-tall rebar cage, while at the same time coordinating the raising and lowering of the hoist chains with the tower crane operator. He would finally have hooked up one of the hoist chains to the rebar cage. All that would have had to occur within narrow window of the three to four minutes which the plaintiff claimed he was away. 95     Indeed, Mr Masum’s evidence was that rigging up the rebar cage properly would have been a slow process.[note: 71]Mr Masum agreed with learned counsel’s suggestion that the proper way was to climb the rebar cage or, if this was not possible, to erect some sort of platform so that the top opening of the rebar cage could be reached and the hoist chains guided inside.[note: 72]The plaintiff would therefore have likely been aware that the only way Mr Masum could have attached one hoist chain within the span of three to four minutes was if it was done improperly. 96     The plaintiff stated in cross-examination that it was only after he had finished rigging up the rebar cage that he knew the hoist chains were attached in a “different” manner. The plaintiff claimed that he nonetheless left it to Mr Masum, who was the trained rigger. 97     The plaintiff disagreed that he must have realised that the rebar cage had been rigged up in an unsafe manner even though he claimed to have had a dispute with Mr Masum on who should climb the rebar cage to insert the chains inside.[note: 73]And yet the plaintiff had earlier testified that he knew that the point of placing hoist chains inside the rebar cage, as depicted in the diagram in the annexure, was “to prevent it from swaying and to prevent it from toppling down”. The plaintiff also agreed that if the rebar cage was rigged from the outside, it would topple over.[note: 74] 98     Taking the plaintiff’s evidence at its highest, it was internally incoherent. I prefer Mr Masum’s evidence that the plaintiff, of his own accord, rigged up the rebar cage with the hoist chains substantially on the outside of the rebar cage.",
        "Whether Mr Masum instructed the tower crane operator to tauten the hoist chains": "99     This point was hotly contested. The plaintiff stated that after both hoist chains were attached and the rebar cage was rigged up, he saw Mr Masum speaking into the walkie-talkie. The hoist chains were then raised by the tower crane operator until the chains were taut.[note: 75]Once the hoist chains were taut, the plaintiff proceeded to remove the remaining wire ties with the assistance of another Bangladeshi worker and, within ten minutes of that, the rebar cage collapsed on him.[note: 76] 100    Mr Masum’s evidence was that he did no such thing. Mr Masum’s evidence was that he did not give any instructions to the tower crane operator to lift the hoist chains.[note: 77]According to Mr Masum, the hoist chains were slack, and were not supporting the weight of the rebar cage. Mr Masum claimed that the plaintiff proceeded to undo the remaining wire ties,[note: 78]against his profuse protestations to stop.[note: 79] 101    I am of the view that the plaintiff’s evidence on this point is to be preferred. At the time when the hoist chains were attached to the rebar cage, there must have been sufficient slack to permit the chains to be manoeuvred into position. The hoist chains could not have been taut then, because it would have been impossible to hook them up to the rebar cage if that were the case. 102    While Mr Masum’s evidence in cross-examination was that he had not instructed the tower crane operator to tauten the hoist chains, he stated that he was not sure if the hoist chains were taut when the rebar cage collapsed on the plaintiff.[note: 80]This is puzzling. If he was sure that he had not given instructions to the tower crane operator to tauten the hoist chains, then it must follow that they could not have been taut. It is clear that Mr Masum was the only person with the walkie-talkie who could instruct the tower crane operator. 103    Further, Mr Masum also agreed in cross-examination that it was “only natural” that the plaintiff would remove the remaining wire ties only if he had thought that the hoist chains were taut.[note: 81]The plaintiff indeed testified under cross-examination that he saw Mr Masum speak into the walkie-talkie and that the hoist chains were subsequently tautened.[note: 82] 104    As I have stated above (at [30]–[33]), the collapse of the rebar cage would have been possible whether or not the hoist chains were tautened. I am of the view that the chains were tautened because it is unlikely that the plaintiff would have continued removing the remaining wire ties if the hoist chains were not first tautened. It is true that in view of the improper rigging up of the rebar cage, the tautening may have actuallydestabilisedthe rebar cage rather supporting it in an upright position. But the accident occurred within a short span of time and what might appear obvious in the cold light of day may not have been so apparent to the plaintiff.",
        "Summary of my factual findings": "105    In summary, I find that on the morning of 26 December 2012, the plaintiff informed Mr Masum that a rebar cage was incorrectly-positioned the day before and had to be relocated. 106    Mr Masum radioed his lifting supervisor, Mr Arasu, who was on the ground floor, to inform him about relocation of the rebar cage. Mr Arasu told Mr Masum that he was occupied and that the lifting operation could be proceeded with as long as he (Mr Masum) was confident. Mr Masum decided to proceed and instructed the tower crane operator to assist with the relocation of the incorrectly-positioned rebar cage. 107    Once the hoist chains had arrived and were lowered, Mr Masum requested that the plaintiff climb the rebar cage to guide the chains through the top of the rebar cage to rig it up properly. The plaintiff was in a hurry to relocate the rebar cage, probably because the incorrect placement of the rebar cage was caused by a mistake on his part. The plaintiff recognised the time and effort that would be occasioned if the rebar cage was to be rigged up in the usual manner. The plaintiff therefore, of his own accord, rigged up the rebar cage improperly. 108    The plaintiff was probably under impression that Mr Masum was going to call for the hoist chains to be tautened since the rebar cage had been rigged up, albeit in an unusual manner. When the plaintiff saw the hoist chains being tautened, he proceeded to loosen the remaining wire ties, which led to the collapse of the rebar cage on him. 109    It is clear that while the root cause of the accident was the improper rigging up of the rebar cage, the collapse of the rebar cage was precipitated by the plaintiff’s removal of the remaining wire ties after the hoist chains had been tautened. Indeed, Mr Mohan, the safety supervisor, agreed that, if only a few wire ties were taken off before the hoist chains were attached, the integrity of the structure may not be affected.[note: 83]Had the plaintiff not gone on to remove the remaining wire ties, the accident would not have occurred. 110    The events as they unfolded that day were probably further confused because of the significant language barrier between the plaintiff and Mr Masum. The plaintiff was a PRC national and spoke primarily Mandarin. Mr Masum, a Bangladeshi, spoke primarily Bengali. Both had very limited competence in English, which was the only common language between them.[note: 84]Both gave their evidence through an interpreter at the trial. At separate instances during the course of the trial, the plaintiff and Mr Masum were asked to give the evidence of their attempts at communication with the other in English and with hand gestures without the assistance of an interpreter.[note: 85] 111    Their attempts at expressing the evidence of what they had said to the other bordered on unintelligibility. It bears mentioning that on the plaintiff’s own evidence, after he had hooked up hoist chain, he asked Mr Masum to look at the way in which the rebar cage was rigged in the following terms: “See lah” and “Masum, you see good or not good? You clip.” According to the plaintiff, Mr Masum’s response was “Okay, okay lah”.[note: 86]Mr Masum’s evidence was that he shouted to the plaintiff: “Hook lock no good – hook lock, no good” to which the plaintiff responded: “No understand, talking many, many.”[note: 87] 112    Irrespective of whose evidence is believed as to what was said (or more accurately shouted), it is readily apparent that the communication between the plaintiff and Mr Masum was poor. It was in these general circumstances that the plaintiff, seeing the hoist chains tautened, proceeded to remove the remaining wire ties. 113    With the factual background set out, I now turn to the legal issues.",
        "Issue 2: Whether the defendants were negligent": "114    Accidents at worksites may trigger the liability of an employer in two modes: primary or secondary (Chandran a/l Subbiah v Dockers Marine Pte Ltd[2010] 1 SLR 786 at [13]). The former is concerned with duties that the employer owes directly to its employees, such as the employer’s non-delegable duty to take care of the health and safety of its employees. The latter is concerned with duties that one employee owes to another employee, for which the employer is made vicariously liable. 115    These two modes of liability are complicated somewhat for accidents that occur at construction worksites. The multiplicity of parties at a construction site – from the main contractor to subcontractors, each carrying out different activities – gives rise to intersecting and overlapping duties owed by and to each other. Further, a construction worker can be the “employee” of a contractor for the purposes of vicarious liability even if there is no direct contractual relationship between the construction worker and the contractor (see, for example, the Court of Appeal decision ofAwang bin Dollah v Shun Shing Construction & Engineering Co Ltd and other appeals[1997] 2 SLR(R) 746 (“Awang v Shun Shing”) at [19] and [20]). 116    Counsel for both sides did not distinguish between the defendants in their pleadings or submissions. Learned counsel for the defendants, Appoo Ramesh, further confirmed in open court that he was instructed by the insurers who had issued the work injury compensation policy which covered both defendants. Mr Ramesh therefore stated that no distinction needed to be drawn between the defendants.[note: 88]I will nonetheless preserve the distinction between both defendants as far as is necessary. Practically, the payment may be made by the same insurance company whichever defendant (if either) is liable. But the theoretical distinction is important because the scope of duties owed to the plaintiff by one defendant may not be coterminous with the scope of duties owed by the other. 117    I also note in passing that the interface between the tort of negligence and the traditional common law rules on occupier’s liability (much of which predated the birth of the modern tort of negligence in 1932) was discussed at length and clarified by the Court of Appeal in the recent decision:See Toh Siew Kee v Ho Ah Lam Ferrocement (Pte) Ltd[2013] 3 SLR 284 (“See Toh Siew Kee”). 118    In that case, V K Rajah JA described the complicated and arbitrary distinctions drawn between events connected with the static condition of the property (occupier’s liability) and dynamic activities (tort of negligence) as well as the distinction drawn by occupier’s liability law between different classes of entrants: invitees, licensees and trespassers. See also the review and observation in Michael Rutter,Occupier’s Liability in Singapore and Malaysia(Butterworths, 1985) at p 21 that the failure of the law to deal with all cases of unintentional damage under the tort of negligence led to complexity and confusion. 119    Rather than attempt to try and untie the Gordian knot that was said to have shackled traditional common law rules on occupier’s liability, Rajah JA held (at [52] ofSee Toh Siew Kee) that the time had come to cut the Gordian knot by subsuming occupier’s liability under the general tort of negligence as expounded on by the Court of Appeal in Singapore inSpandeck Engineering (S) Pte Ltd v Defence Science & Technology Agency[2007] 4 SLR(R) 100 (“Spandeck”). 120    This means that the general principles set out inSpandeckon when a duty of care arises under the tort of negligence should be the very same principles used to determine the question of duty arising from facts and circumstances formerly falling with the realm of occupier’s liability rules. Many of the distinctions drawn by the occupier’s liability rules on lawful entrants and unlawful entrants,etc, could be subsumed within the general test of factual foreseeability, proximity and policy set out inSpandeck. 121    It follows that whether a duty of care is owed by an occupier to an entrant depends on the facts and circumstances of each case. In cases where the entrant is an unlawful entrant, it was said inSee Toh Siew Keecase that much will depend on the circumstances which render the entry unlawful. 122    Delivering a largely concurring judgment, Sundaresh Menon CJ agreed (at [132] ofSee Toh Siew Kee) that all occupier’s liability claims could and should be assessed and dealt with within the framework of the tort of negligence. In the case of unlawful entrants, theSpandeckapproach with its stress on proximity and policy was flexible enough to take on board the fact that an entrant may be unlawful for a myriad of reasons: from the innocent toddler wandering where he should not be to a housebreaker and more. Indeed, Menon CJ pointed out that even where the entrant was lawfully on the premises there could be special and unusual circumstances which might negate a duty of care.",
        "The relevance of the statutory framework governing construction activities": "123    The accident occurred in the course of operational activities which are embraced entirely by the Workplace Safety and Health Act (Cap 354A, 2009 Rev Ed) (“the WSHA”) and its accompanying regulations (collectively, “the WSH Framework”). 124    Where statutory duties exist, two threshold questions arise. First, does the statutory provision, in and of itself, create and confer a right of action to the affected individual. Second, is there in any case, a concurrent common law duty of care under the tort of negligence which can be relied on by the individual who claims to have been affected by the facts underlying the breach of statutory duty. In the present case, it is noted that s 60 of the WSHA provides that the WSHA is not to be construed as conferring a right of action in any civil proceedings in respect of any contravention, whether by act or omission. While the plaintiff does not enjoy a right to sue for a breach of statutory duty, this does not mean that he does not enjoy a right under the common law tort of negligence. 125    Before addressing the question of negligence proper, it will be apposite to consider the WSH Framework and its effect on negligence liability at common law. The four-fold test for negligence is trite: (a) the defendant must have owed the claimant a duty of care; (b) the defendant’s conduct must have breached the duty of care by falling below the requisite standard of care; (c) the claimant must have suffered loss; and (d) the defendant’s breach of duty must have been a cause of the claimant’s loss. The WSH Framework intersects with the tort of negligence at the first two stages of the inquiry. 126    The principles on a statutory duty shaping the existence of a duty of care were discussed by the Court of Appeal inTan Juay Pah v Kimly Construction Pte Ltd and others[2012] 2 SLR 549 at [53]–[54]: 53     Under the first limb of theSpandecktest,one of the many factors taken into consideration is the existence of a statutory duty. However, as amply clarified inAnimal Concerns,the mere existence of a statutory duty owed by the defendant to the relevant authorities isnotin itself conclusive in establishing that the defendant owes a common law duty of care to the plaintiff. As for the second limb of theSpandecktest, one important policy consideration that the courts will evaluate in determining whether a particular statutory duty gives rise to a concomitant common law duty of care is thatthe imposition of the alleged common law duty of careshould not be inconsistent with the statutory scheme concerned and the statutory duties owed under that scheme(seeHarris v Evans[1998] 1 WLR 1285 at 1297, applyingX (Minors) v Bedfordshire County Council[1995] 2 AC 633). 54     Several general principles inform the law in this area. First, the party seeking to establish that a private right of action exists for a breach of statutory duty must show that Parliament, in imposing the statutory duty in question to protect the members of a class, intended those members to have such a right of action. Here, it must also be borne in mind that such right is not immediately established just because a statute is intended to protect a particular class of persons. Ordinarily, something more is required to demonstrate a statutory intention to confer a private right of action. In matters where the statute's objective is to protect the public in general, exceptionally clear language will be required before an intention to confer a private remedy for a breach of statutory duty can be established. Second,a concurrent common law duty of care may be found alongside a statutory duty imposed by subsidiary legislation provided there are clear indications that the primary legislation contemplates the creation of such a common law duty. Third, while the existence of a statutory remedy for a breach of statutory duty is relevant and may suggest the absence of a private right of action for such breach, it is not in itself decisive (seeCharlesworth & Percy on Negligence(Christopher Walton gen ed) (Sweet & Maxwell, 12th Ed, 2010) at paras 12-43-12-44). Similarly, the existence of a statutory sanction for a breach of statutory duty neither necessarily nor conclusively indicates that the Legislature intended to preclude a private right of action for such breach (see,eg,Animal Concernsat [81]). Fourth, we caution that in this complex area of the law, formulas are not helpful. While the general principles stated here may help in terms of setting out relevant factors for consideration, they are mere guidelines and will not yield answers as to whether a common law duty of care exists alongside a statutory duty in a particular case. The variety of statutory duties and the different objects which different statutes are directed at make it impossible to have a universal formula. Each statute will have to be considered contextually, and precedents will illuminate only infrequently the right legal path to be taken. Fifth,we emphasise that the underlying statutory scheme and the parliamentary intention behind the enactment of that scheme are not controlling factors in determining whether an alleged common law duty of care exists concurrently with a statutory duty, but rather go towards the alleged common law duty of care(ie, these factors are considered under the second limb of theSpandecktest, rather than under the first limb). [emphasis added] 127    These principles were later considered by the Court of Appeal inJurong Primewide Pte Ltd v Moh Seng Cranes Pte Ltd and others[2014] 2 SLR 360 (“Jurong Primewide v Moh Seng Cranes”). 128Jurong Primewide v Moh Seng Cranesconcerned the collapse of a tower crane at a construction site. The owner of the collapsed crane brought an action in negligence against the main contractor and a subcontractor who were operating on the construction site at the time of the collapse. One of the questions before the Court of Appeal was the extent to which the WSH Framework affects the duty of care owed by the main contractor and the subcontractor to persons present on the construction site. 129    The Court of Appeal undertook a detailed analysis of the WSH Framework and its statutory purpose. It cited the speech of Dr Ng Eng Hen, the then Minister for Manpower, at the second reading of the Workplace Safety and Health Bill 2005 (No 36 of 2005) (Singapore Parliamentary Debates, Official Report(17 January 2006) vol 80 (“the WSH Parliamentary Debates”) at cols 2208–2210). It will be helpful to reproduce in full the portions of Dr Ng’s speech cited by the Court of Appeal: Third, this Bill will betterdefine persons who are accountable, their responsibilities and institute penaltieswhich reflect the true economic and social cost of risks and accidents. Penalties should be sufficient to deter risk-taking behaviour and ensure that companies areproactive in preventing incidents. Appropriately, companies and persons that showpoor safety managementshould be penalised even if no accident has occurred. This Bill will put into place a new and more effective framework to reduce accidents at the workplace – to bring about a quantum improvement in OSH standards and to achieve our intermediate goal of halving the present occupational fatality rate by 2015. [emphasis of the Court of Appeal adopted] 130    The Court of Appeal concluded at [41]–[42] that: 41     From the foregoing it is clear that [main]contractors and subcontractors...are precisely the entities which the WSHA seeks to increase direct liability on for workplace safety. They have \"primary responsibility\" in all areas of safety, given their \"operational control\" of workplaces. In fact,the main purpose of the WSHA is to strengthen the accountability of and impose responsibilities on parties such as the main contractor and subcontractors so as to ensure a safer working environment at construction sites. These statutory responsibilities also complement the very aims of the common law tort of negligence, which is concerned with ensuring that negligent conduct, within legal limits, would attract corresponding liability.The law of tort serves two functions here: it is an engine of compensation as well as a financial deterrent. The law governing the establishment of a duty of care in turn helps to limit claims in negligence to only parties with sufficient proximity and foreseeability, so that the net of liability is not cast too widely.Plainly, contractors and subcontractors are parties whose negligence on construction sites has the most potential to result in fatal, or at least costly, consequences, given their well-placed abilities to foresee and be aware of the various possible mishaps that others without operational responsibilities and control may not be able to identify. In fact, it would be very hard to think of situations where sufficient proximity to give rise to a common law duty of care will not be found to exist due to the control contractors and subcontractors have over the worksite and the on-going activities on it. 42The WSHA is clearly focussed on strengthening the safety management of worksites as its primary aim. By placing heavy responsibilities on contractors and subcontractors, the scheme of the WSHA intends that the burden of making worksites as free from hazards as possible and installing necessary systems and safeguards would fall on these parties. [emphasis added] 131    The Court of Appeal’s reasoning makes clear that there is a parity of objectives between the tort of negligence and the WSH Framework. The latter would therefore have an impact on the existence of a duty of care owed by the main contractor and subcontractors operating in a construction site. 132    The WSH Framework is also relevant in ascertaining the appropriate standard of care expected of the defendant. The standard of care is the general objective standard of a reasonable person using ordinary care and skill. Industry standards and normal practice are indicative of this standard (see for example,Tesa Tape Asia Pacific Pte Ltd v Wing Seng Logistics Pte Ltd[2006] 3 SLR(R) 116 at [17]). The Court of Appeal inJurong Primewide v Moh Seng Cranesendorsed (at [43]) reference to the WSH Framework and other guidelines which lay down such industry standards.",
        "The existence of a duty of care": "178    I am of the view that both Mr Arasu and Mr Masum owed a duty of care to the plaintiff, a rebar worker. Factual foreseeability would have been easily satisfied in the present case. 179    The relationship between Mr Arasu and Mr Masum on one hand and the plaintiff on the other was also proximate. Both Mr Arasu and Mr Masum played key roles in the performance and execution of lifting operations. Further, the mounting of rebar cages required close cooperation and coordination between the two functional groups that were responsible for the lifting operations and the installation of the rebar cages respectively. 180    Second, both Mr Arasu and Mr Masum were under statutory duties imposed by the Crane Regulations (reg 17 for lifting supervisors, at [153] above; regs 18 and 19 for riggers/signalmen, at [154] and [155] above). Dr Ng’s remarks during the WSH Parliamentary Debates (at col 2211) are pertinent. They indicate that the WSH Framework was not intended only to increase the direct liability of contractors and subcontractors (asJurong Primewide v Moh Seng Cranesobserved at [41]), but in certain situations, that ofemployeesas well: While management commitment is critical, it is not sufficient if employees ignore clear instructions. Under this new liability regime,responsibility for the safety and health of others will lie not only with employers, but also with employees, whether they be supervisors or rank-and-file workers. [emphasis added] 181    The spirit of these remarks is captured by the Crane Regulations. The Crane Regulations draw a sharp distinction between duties of theresponsible person(who would in most cases be a contractor or a subcontractor), and the duties of theemployees or persons appointed bythe responsible person to perform the roles of a lifting supervisor, rigger or signalman. The statutory duties of the responsible person relate more broadly to the development and implementation of a safe system of work. The statutory duties of the lifting supervisor and rigger/signalman on the other hand demarcate clearly the scope of responsibility for each in a lifting operation. 182    I am therefore of the view that there was a legally proximate relationship between both Mr Arasu and Mr Masum and the plaintiff. There are no policy factors that militate against the existence of a duty of care. The relevant policy considerations fortify its existence rather than detract from it.",
        "The standard of care": "183    I have discussed how Mr Arasu’s actions fell short of the standard of care expected of a lifting supervisor at [172]–[175] above. I therefore find that Mr Arasu was negligent. 184    I now turn to whether Mr Masum acted in breach of his duty of care. I am of the view that he did. Under the Crane Regulations, a rigger is under a duty to ensure that the load was “secure, stable and balanced” (reg 18(4)(e) of the Crane Regulations). A signalman, is under a duty to “ensure ... that the load [was] properly rigged up before [giving] a clear signal to the crane operator to lift the load” (reg 19(4)(a) of the Crane Regulations). 185    First, Mr Masum should not have attempted to lift and relocate the rebar cage without supervision. This was a non-routine lifting operation. Mr Masum was relatively inexperienced. It was the first time he had encountered such a lift. Mr Masum should not have proceeded with the lift in the absence of Mr Arasu or at least his colleague, Mr Kumar, who was the more experienced rigger/signalman. 186    Second, Mr Masum should not have asked, much less allowed the plaintiff to assist in the rigging at all. The plaintiff was not trained or qualified in rigging. That was not the kind of work a rebar worker had the necessary expertise or training to deal with safely and effectively.  Mr Masum realised that the rigging up of an installed rebar column presented special difficulties. It is clear that, on Mr Masum’s own evidence, he asked the plaintiff to rig up the rebar cage in what he termed as “the correct procedure.”[note: 100] 187    Even if Mr Masum protested profusely at the improper manner in which the plaintiff hooked the hoist chains to the rebar cage, Mr Masum should not even have asked the plaintiff to rig up the rebar cage to begin with. By asking the plaintiff to rig up the rebar cage (or assist in doing so), the scene was set for the subsequent unfortunate chain of events. To merely shout protests at the manner in which the plaintiff rigged up the load was clearly insufficient, given the communication problems and the scale of the danger. Mr Masum should have at least tried to stop the plaintiff directly – and not just shout at him. 188    Mr Mohan, the safety supervisor, testified that he would not allow a rebar man to assist in rigging. This was something that was strictly not allowed, even if there were insufficient riggers/signalmen available to assist.[note: 101]Mr Arasu, the lifting supervisor, agreed that it would be wrong and a breach of the rules if Mr Masum had asked a rebar worker to rig up loads.[note: 102] 189    Third, Mr Masum should not have instructed the tower crane operator to tauten the hoist chains after the rebar cage was rigged up in the improper manner. By doing so, Mr Masum was in breach of his duty to ensure the load was properly rigged up before giving instructions to the tower crane operator to lift the load. The tautening of the hoist chains in what was already a confused and chaotic situation may also have led the plaintiff to believe that it was safe to continue. All this supports my finding that Mr Masum, as the sole trained rigger and signalman present at the time, failed to take reasonable care.",
        "Issue 3: Whether Mr Arasu and Mr Masum were negligent": "177    I turn now to address the question of secondary liability: whether either defendant is vicariously liable for the negligence of their employees.",
        "Whether and if so which of the defendants are vicariously liable for Mr Arasu’s and Mr Masum’s negligence": "190    While the defendants did dispute whether Mr Arasu and Mr Masum were negligent, neither contended that they would not be vicariously liable for Mr Arasu’s and Mr Masum’s acts if they were found to be negligent. 191    Mr Arasu was employed and controlled by the second defendant at the material time. His negligence occurred in the course of his employment with the second defendant. I accordingly find that the second defendant is vicariously liable for his negligence. 192    The position in respect of Mr Masum is less clear. Mr Masum’s negligent acts were performed while he was an employee of the first defendant and in the course of his employment by the first defendant. But while Mr Masum was an employee of the first defendant, it does not necessarily follow that the first defendant is liable for Mr Masum’s negligence. 193    In the House of Lords case ofMersey Docks and Harbour Board v Coggins & Griffiths (Liverpool) Limited[1947] AC 1 (“Mersey Docks”), Lord Macmillan stated that as a general rule, the employer of a person would usually be vicariously liable for the person’s negligence. Lord Macmillan nonetheless recognised (at 13) that: ... it is always open to an employer to show, if he can, thathe has for a particular purpose or on a particular occasion temporarily transferred the services of one of his general servants to another partyso as to constitute himpro hac vicethe servant of that other party with consequent liability for his negligent acts. The burden is on the general employer to establish that such a transference has been effected. [emphasis added] 194    The Court of Appeal inAwang v Shun Shingheld (at [19]) that the plaintiff-worker, who had an employment contract with a subcontractor, was an “employee” of the main contractor, because the main contractor “at the material time exercised control or had the right to exercise control over [the worker] in relation to the work he was engaged to do”. The Court of Appeal also citedMersey Dockswith approval, remarking that: It has long been recognised, especiallyin cases dealing with employer’s vicarious liability for damage caused by his employee to a third party, that an “employer” in such a case means not only the party who actually employs the employee, but also the one who at the material time exercises or has the right to exercise control over the employee in respect of the work he was engaged to perform, notwithstanding that there is no contract of employment between him and the party who exercises or has the right to exercise control. [emphasis added] 195    The evidence on whether the first or the second defendant was exercising control, or had the right to exercise control over Mr Masum at the material time was regrettably thin. None of the parties raised the issue in submissions in the light of Mr Ramesh’s concession in open court that the distinction between both defendants was immaterial from a practical standpoint. 196    I am nonetheless of the view that, at the material time, Mr Masum was the second defendant’s employeepro hac vice. The second defendant was exercising control over Mr Masum in respect of the lifting operations. Mr Masum’s evidence was that he received instructions from Mr Arasu, the second defendant’s lifting supervisor.[note: 103]Further, Mr Masum was to report to Mr Arasu and seek his guidance if he was unable or unsure of how to proceed with the lifting work.[note: 104]Mr Masum was also recorded as the appointed rigger/signalman under the daily lifting permit applied for by the second defendant and under its letterhead. Mr Masum played an integral role in the lifting operations, which the second defendant had control of at the Worksite. 197    There is English authority that in appropriate cases, two employers may be dually vicariously liable for an employee’s negligence. InViasystems (Tyneside) Ltd v Thermal Transfer (Northern) Ltd and others[2006] QB 510 (“Viasystems”) the English Court of Appeal held that liability for a worker’s negligence was shared by two employers. 198    InViasystems, X had supplied to Y a worker on a labour-only basis to carry out some ducting work. The work was carelessly performed and resulted in damage to a factory. The English Court of Appeal held that it was possible for X and Y to be dually vicariously liable for the negligence of the worker. In doing so, the English Court of Appeal considered (at [31] ofViasystems) a Privy Council case which was on appeal from Singapore:Karuppan Bhoomides v Port of Singapore Authority[1978] 1 WLR 189 (“Karuppan v PSA”). InKaruppan v PSA, the Privy Council appears to have assumed that where an employee is “loaned” by one employer to another, then either one or the other – but not both – will be subject to vicarious liability. May LJ inViasystems, however, pointed out that the possibility of dual vicarious liability was not argued (nor was it possible on the facts) before the Privy Council inKaruppan v PSA. In short, the English Court of Appeal was of the view that there was no binding authority in England against dual vicarious liability. 199    The English Court of Appeal elaborated that the essence of dual vicarious liability wasshared control. It was, however, divided on whether there was an additional requirement that dual liability had to be just in the circumstances. Rix LJ stated at [79] that he was “a little sceptical that the doctrine of dual vicarious liability is to be wholly equated with the question of control.” He went on to elaborate: I would hazard ... the view that what one is looking for is a situation where the employee in question, at any rate for relevant purposes, is so much a part of the work, business or organisation of both employers that it is just to make both employers answer for his negligence. That notwithstanding, it is clear that the possibility of dual responsibility was thought to provide a coherent solution in the context of vicarious liability for borrowed employees and analogous situations. 200    Dual vicarious liability was not addressed in the submissions. I nonetheless agree in principle that vicarious liability can be borne by two employers in the appropriate cases. 201    Given the fact that Mr Masum, the rigger/signalman was: (a) employed by the first defendant; (b) working with the plaintiff, who was also employed by the first defendant; and (c) in a task that required coordination of workers with different functional skills and responsibilities, I am of the view that the first defendant (bearing in mind that Mr Chen was on-site and patrolling the fifth floor) retained sufficient control to fall under the principle of dual responsibility for Mr Masum’s acts. 202    On the facts of this case, I need not resolve the disagreement in the English Court of Appeal whether there is a superadded requirement that dual vicarious liability be just in the circumstances. But given the fluid and dynamic relationship between the work of the riggers/signalmen and that of the rebar workers, I would say that the requirement would have, in any event, been satisfied in this case. 203    Given the position taken by Mr Ramesh, learned counsel for the defendants, that no distinction was to be drawn between the first and second defendant, I will not address the question of the relative proportion of their responsibility. Instead, I now move to consider the question of contributory negligence.",
        "Issue 4: Whether there was contributory negligence on the part of the plaintiff, and if so, the extent to which the defendants’ liability should be reduced": "204    Contributory negligence arises where a claimant has acted in a careless manner that has contributed in part to the loss that was suffered. The Court of Appeal inParno v SC Marine Pte Ltd[1999] 3 SLR(R) 377 (“Parno v SC Marine”) at [59] cited with approval the observation of Lord Denning MR inFroom v Butcher[1976] QB 286 at 291: Negligence depends on a breach of duty, whereas contributory negligence does not. Negligence is a man’s carelessness in breach of duty to others. Contributory negligence is a man’s carelessness in looking after his own safety. He is guilty of contributory negligence if he ought reasonably to have foreseen that, if he did not act as a reasonable prudent man, he might hurt himself. The label “contributory negligence” is therefore, to a certain extent, a misnomer. There is no need for the defendant to show that a claimant has breached a legal duty of care, as is necessary in a claim for negligence (Gary Chan,The Law of Torts in Singapore(Academy Publishing, 2011) (“The Law of Torts in Singapore”) at para 7.071). 205    Contributory negligence is a statutory concept encapsulated in s 3(1) of the Contributory Negligence and Personal Injuries Act (Cap 54, 2002 Rev Ed) (“the Contributory Negligence Act”), which states as follows: Apportionment of liability in case of contributory negligence 3.—(1)  Where any person suffers damage as the resultpartly of his own faultand partly of the fault of any other person or persons, a claim in respect of that damage shall not be defeated by reason of the fault of the person suffering the damage, butthe damages recoverable in respect thereof shall be reduced to such extent as the court thinks just and equitable having regard to the claimant’s share in the responsibility for the damage. [emphasis added] 206    Returning to the facts of the present case, I am of the view that there was contributory negligence on the part of the plaintiff for rigging up the rebar cage in an improper manner. 207    The plaintiff was an experienced rebar worker. On his own evidence, he was aware of the proper manner of rigging up a rebar cage in an upright position even though he was not a qualified rigger. He was nonetheless eager, perhaps overly so, to complete the job as quickly as possible and with minimum hassle. Indeed, his failure to notify his superiors of the mistake he made on 25 December 2012 should not and does not go un-noticed. If he had notified his supervisors, the defendants would have had much more time to assess the situation and develop a proper lifting plan. The plaintiff rigged up the rebar cage in an improper and unsafe manner. He then proceeded to release the remaining wire ties after the rebar cage was improperly rigged. The accident would not have occurred if the plaintiff had performed neither of these acts. I am of the view that the plaintiff’s act of folly was a substantial cause of the accident. 208    I am further of the view that the negligence of the first and second defendants was also a substantial cause of the accident and the consequential injuries sustained by the plaintiff. 209    If Mr Masum had not asked the plaintiff to rig the rebar cage and had exercised his authority as the qualified rigger to take charge of the rigging, the accident is unlikely to have occurred. His failure to do this and his instructions to the tower crane operator to tauten the hoist chains when the rebar cage was not properly secured set the scene for the plaintiff removing the remaining wire ties. The fact that Mr Masum shouted protests to the plaintiff in these circumstances was insufficient to discharge his duty of reasonable care. 210    Mr Arasu’s failure to respond properly when informed of the need to relocate the rebar cage on the fifth floor was also a cause of the accident. Mr Arasu accepted that if he had been present the accident would not have occurred. He would not have permitted the plaintiff, who was not a qualified rigger, to do the rigging at all, much less in the manner in which it was done. 211    The plaintiff’s carelessness in the manner in which he carried out the rigging up of the rebar cage and the removal of the wire ties is undoubtedly a serious matter. However, thekey purposeof the duties of the first and second defendants as well as those of their employees was precisely to prevent, or at least lessen, the risk of untrained hands foolishly meddling in high-risk operations. It bears repeating that the WSH Framework was intended to provide safety for all persons at the worksite. The new statutory scheme was introduced on the back of a perceived need to change mind sets towards a more proactive approach to safety. 212    A rebar column of the size and weight that was wrongly installed at the edge of the fifth floor presented obvious challenges. The rebar cage toppled onto the deck of the fifth floor trapping and causing the injuries to the plaintiff. If the rebar cage had toppled in a different direction or manner the accident may have been far more serious. The rebar cage would have fallen off the fifth floor and endangered all the persons on the ground floor. While there is no expert evidence that this might have happened, it is an inference which may be drawn from the photographs taken after the accident. 213    The point that is being made is that lifting operations, especially non-routine lifts, are dangerous operations. They require proactive responses. Lifting supervisors who are not present when informed of the need of an unanticipated non-routine lift, must respond in the appropriate manner. The fault of Mr Arasu was not that he did not have a lifting plan at the start of the work day: after all he did not know at that point that the rebar cage had to be uninstalled, lifted and relocated. The fault arose when, after he had been apprised of the need to conduct the non-routine lift, he responded in an inappropriate manner. What is the proper response by a lifting supervisor when he is informed of a new development will depend on the circumstances of the case. In the present case, Mr Arasu’s instruction to Mr Masum to proceed if he could, or wait if could not, was an inadequate response. 214    I am mindful that there is some evidence that part of the problem at the Worksite was the poor communication between workers from different functional groups. Indeed, Mr Mohan under cross-examination agreed that the rules required that the lifting team use a common language.[note: 105]In the light of the absence of sufficient evidence on the effect of language competence (or lack of it) resulting in the accident, I will only make the passing observation that the need for supervision isheightenedespecially where different groups of workers of different nationalities and varying degrees of language fluency are carrying out dynamic work activities. Supervisors should plan not just for the routine and expected events of the day. In a busy complex worksite, unexpected events can quickly arise and develop. 215    I am therefore of the view that the breaches of the defendants and their employees were also a substantial cause of the accident. The accident would not have occurred had the proper procedures been in place. 216    Overall, I am of the view that it is just and equitable that the liability of the defendants to the plaintiff should be reduced by 50%.  In coming to the decision, I am reminded by the remarks of V K Rajah JC inCheong Ghim Fah v Murugian s/o Rangasamy[2004] 1 SLR(R) 628 that apportionment is more an exercise in discretion rather than clinical science. 217    I am aware that a reduction of 50% is sizeable. Indeed, it may be thought that once contributory negligence crosses the 50% threshold, it approaches the end of the spectrum so far as reductions for contributory negligence are concerned. After all, at some point, the contributory negligence of the claimant will shade into a break in the chain of causation of the defendant’s negligence or a plea ofvolenti non fit injuria. 218    InDennis Toole v Bolton Metropolitan Borough Council[2002] EWCA Civ 588, in the context of a breach of statutory duty, Buxton LJ remarked at [13] that: It is not usual for there to be marked findings of contributory negligence in a breach of statutory duty case, and it is, I am bound to say in my experience, veryunusual indeed for there to be a finding of contributory negligence at the level of 75 per cent. If in a statutory duty case the judge finds himself driven in that direction, he should, in my judgment, seriously consider whether he is not in fact finding that there has been no causal connection at all between the breach of statutory duty and the injury.[emphasis added] 219Munkman on Employer’s Liability(Daniel Bennett gen ed) (LexisNexis, 16th Ed, 2013) (“Munkman on Employer’s Liability”) states at para 6.17 that: Having reviewed the reported cases available over the last ten years, there has not been found a higher court award in which a reduction has been made that exceeded 75% ... In practice, the maximum reduction is now 75%. 220    Buxton LJ’s observation is an instructive one. His experience also appears to conform with practice as far as the review of the case law conducted byMunkman on Employer’s Liabilitysuggests. There are nonetheless two points which colour the context in which these observations are made. 221    First, the remarks quoted above appear to have been directed at cases of breaches of statutory duty rather than negligence (although admittedly, the distinction between the two is diminished in cases such as this where the governing statutory framework intersects substantially with negligence liability). It has been said that the court is slower to find contributory negligence in cases of breach of statutory duty, as opposed to negligence. The reason for this was stated by Lord Tucker in the case ofStaveley Iron & Chemical Co Ltd v Jones[1956] AC 627 at 648: ... the purpose of imposing the absolute obligation is to protect the workmen against those very acts of inattention which are sometimes relied upon as constituting contributory negligence so that too strict a standard would defeat the object of the statute. 222    Second, notwithstanding this more protectionist approach in cases of a breach of statutory duty, the English courts have drawn a dichotomy between situations of “momentary inattention” referred to by Lord Tucker and situations where a risk has been consciously accepted by an employee. InSherlock v Chester City Council[2004] EWCA Civ 201, Latham LJ cited portions of Buxton LJ’s judgment (quoted at [218] above) and stated: InToole v Bolton Metropolitan Borough Council[2002] EWCA Civ 588, Buxton LJ said: “It is not usual for there to be marked findings of contributory negligence in a breach of statutory duty case.” There may well be some justification for that view in cases of momentary inattention by an employee. But where a risk has been consciously accepted by an employee, it seems to me that different considerations may arise.That isparticularly so where the employee is skilled and the precaution in question is neither esoteric nor one which he could not take himself. In the present case he could have made himself a run-off bench, or ensured that Mr Webb was there when he cut the relevant fascia board. In those circumstances, it seems to me that the appellant can properly be required to bear the greater responsibility. I would assess his responsibility for the accident at 60%. Accordingly he is entitled to 40% of whatever damages are ultimately considered to be appropriate for the dreadful injury he suffered to his hand. [emphasis added] Arden and Auld LJJ agreed with Latham LJ’s reasoning. 223    In coming to my decision, I have also borne in mind the observation of the learned author ofThe Law of Torts in Singaporeat para 7.079 that where contributory negligence is alleged against an employee, the law tends, on balance, to lean in favour of the employee who had suffered damage due to the employer’s negligence. Where the negligence of the employer related to the failure to ensure that there was a safe system of work, the fact that an employee took a risk or made an error of judgment does not inevitably support a heavy finding of contributory negligence (or at all). Following the observation in theParno v SC Marinecase at [64], “the primary responsibility for ensuring safety rests on the employer”. One factor that is relevant is whether the employee took a risk in circumstances (giving rise to the taking of the risk) which arose (in whole or in part) due to the negligence of the defendant. 224    I note also the observations of Rajah JA inZheng Yu Shan v Lian Beng Construction (1988) Pte Ltd[2009] 2 SLR(R) 587 at [38] that in carrying out his duty to provide a safe system of work, an employer must take “the employee’s carelessness in relation to safety into account when devising a safe system of work.” Thereafter it behoves the employer to take reasonable care to see that the system is complied with. These observations are relevant not just in determining whether the employer has breached his duty of care. They are also pertinent in determining whether there is contributory negligence by the employee and, if so, the degree as compared to the negligence of the employer. 225    Bearing these cases in mind, in view of the plaintiff’s own act of folly, the fact that he was an experienced rebar worker leading a small team of rebar workers, balanced against the negligence of the defendants, it is just and equitable that the defendants’ liability to the plaintiff be reduced by 50%. Whilst this is undoubtedly a high reduction, it is supported by the unusually high degrees of responsibility borne bybothsides on the facts of this case.",
        "Conclusion": "226    I find the defendants liable in negligence to the plaintiff. I also find that a reduction is appropriate as a consequence of the plaintiff’s contributory negligence. The defendants are to bear 50% of the loss and damage that the plaintiff suffered as a consequence of the accident. 227    Costs are to be agreed or taxed.",
        "ANNEXURE": "[note: 1]Statement of claim, Annexure A. [note: 2]Statement of claim, at para 6; Defence, at para 4. [note: 3]N/E 26 March 2014, at pp 4–6. [note: 4]N/E 25 March 2014, at p 23 line 3. [note: 5]N/E 25 March 2014, at p 7 lines 11–27. [note: 6]N/E 25 March 2014, at p 7 lines 28–30. [note: 7]N/E 4 June 2014, at pp 18–19. [note: 8]N/E 4 June 2014, at p 21. [note: 9]N/E 4 June 2014, at p 32 lines 2–8. [note: 10]N/E 4 June 2014, at p 80 line 19 –p 82 line 8. [note: 11]N/E 27 March 2014, at p 12 lines 12–28. [note: 12]N/E 26 March 2014, at p 11 line 30–p 12 line 20. [note: 13]Plaintiff’s bundle of documents, at p 20; N/E 26 March 2014, at p19 line 26–p 24 line 16. [note: 14]N/E 25 March 2014, at p 20 lines 3–5. [note: 15]N/E 5 June 2014, at p 88 lines 5–8. [note: 16]N/E 5 June 2014, at p 87 lines 7–13. [note: 17]N/E 4 June 2014, at pp 31–32. [note: 18]N/E 5 June 2014, at p 81 lines 4–5. [note: 19]N/E 6 June 2014, at p 15 lines 8–13; N/E 6 June 2014, at p 17 lines 28–30. [note: 20]N/E 6 June 2014, at p 19 lines 3–25. [note: 21]N/E 25 March 2014, at p 37 line 1. [note: 22]N/E 27 March 2014, at p 12. [note: 23]N/E 25 March 2014, at p 37 lines 6–30. [note: 24]N/E 25 March 2014, at p 38 line 31–p 39 line 12. [note: 25]N/E 25 March 2014, at p 38 line 31–p 39 line 12. [note: 26]N/E 25 March 2014, at p 38 lines 5–11. [note: 27]N/E 27 March 2014, at p 17 line 2. [note: 28]N/E 5 June 2014, at p 76 lines 16–26. [note: 29]N/E 5 June 2014, at p 81 lines 6–11. [note: 30]N/E 5 June 2014, at p 78 lines 16–20. [note: 31]N/E 5 June 2014, at p 77 lines 14–17. [note: 32]N/E 5 June 2014, at p 79 lines 5–18. [note: 33]N/E 6 June 2014, at p 8 lines 9–11. [note: 34]N/E 5 June 2014, at p 81 lines 12–13. [note: 35]N/E 5 June 2014, at p 81 lines 14–15. [note: 36]N/E 5 June 2014, at p 81 line 19. [note: 37]N/E 5 June 2014, at p 81 lines 22. [note: 38]N/E 5 June 2014, at p 81 lines 19–28. [note: 39]N/E 5 June 2014, at p 79 line 8. [note: 40]N/E 5 June 2014, at page 92 lines 3–6. [note: 41]N/E 5 June 2014, pp 95–96. [note: 42]Defendants’ closing submissions, at para 122. [note: 43]Defendants’ closing submissions, at para 121. [note: 44]Defendants’ closing submissions, at para 123. [note: 45]N/E 5 June 2014, at p 61 lines 30–32; N/E 6 June 2014, p 119 lines 5–7. [note: 46]N/E 4 June 2014, at p 67 lines 4–6. [note: 47]N/E 5 June 2014, at p 61 lines 12–18. [note: 48]N/E 5 June 2014, at p 61 lines 22–23 [note: 49]N/E 6 June 2014, at p 118 lines 9–30. [note: 50]N/E 4 June 2014, at p 31 line 20–p 32 line 1. [note: 51]N/E 4 June 2014, at p 32 lines 5–8. [note: 52]N/E 25 March 2014, at p 48 line 25–p 49 line 6. [note: 53]N/E 25 March 2014, at p 40 line 21–p 41 line 25; N/E 25 March 2014, p 50. [note: 54]N/E 4 June 2014, at p 69 lines 1–10. [note: 55]N/E 25 March 2014, at p 51 line 2–p 52 line 4. [note: 56]N/E 25 March 2014, at pp 51–52. [note: 57]Plaintiff’s AEIC, at para 21. [note: 58]N/E 25 March 2014, at p 53 line 1. [note: 59]N/E 25 March 2014, at p 54 lines 9–10. [note: 60]N/E 25 March 2014, at p 55 lines 6–8; N/E 26 March 2014, at p 15 lines 2–3. [note: 61]PBOD, page 20.  See also N/E 26 March 2014, at p 19 line 26 – p 24 line 6. [note: 62]N/E 26 March 2014, at p 26 lines 14–27. [note: 63]N/E 26 March 2014, at p 30 lines 18–31; N/E 26 March 2014, at p 31 lines 14–26. [note: 64]N/E 26 March 2014, at p 33 lines 28–29. [note: 65]N/E 4 June 2014, at p 70 lines 30–32; N/E 4 June 2014, at p 74 lines 13–23. [note: 66]N/E 4 June 2014, at p 71 lines 2–4. [note: 67]N/E 5 June 2014, at p 5 line 16. [note: 68]N/E 25 March 2014, at p 53 lines 5–8. [note: 69]Plaintiff’s AEIC, at para 21. [note: 70]N/E 26 March 2014, at p 34 lines 3–5. [note: 71]N/E 4 June 2014, at p 77 line 14. [note: 72]N/E 4 June 2014, at p 78 lines 16-22. [note: 73]N/E 26 March 2014, at p 32 line 18–p 33 line 24. [note: 74]N/E 26 March 2014, at p 32 lines 10–17. [note: 75]N/E 26 March 2014, at p 45 lines 15–p 46 line 1. [note: 76]N/E 26 March 2014, at p 47 lines 4–15. [note: 77]N/E 5 June 2014, at p 10 lines 9–10. [note: 78]N/E 5 June 2014, at p 5 lines 18–20; N/E 5 June 2014, at p 6 lines 18–20. [note: 79]N/E 5 June 2014, at p 6 lines 14–31. [note: 80]N/E 5 June 2014, at p 38 line 25; N/E 5 June 2014, at p 57. [note: 81]N/E 5 June 2014, at p 38 lines 26–29. [note: 82]N/E 26 March 2014, at p 45 line 31–p 46 line 4. [note: 83]N/E 6 June 2014, at p 93. [note: 84]N/E 4 June 2014, at p 25 lines 17–26. [note: 85]N/E 26 March 2014, at p 33; N/E 5 June 2014, at pp 6–7. [note: 86]N/E 26 March 2014, at p 31 line 29–p 32 line 3. [note: 87]N/E 5 June 2014, at p 6 line 24–p 7 line 3. [note: 88]N/E 4 June 2014, at pp 7–8. [note: 89]N/E 4 June 2014, at p 29 lines 11–13. [note: 90]N/E 4 June 2014, at p 29 lines 7– 25. [note: 91]N/E 4 June 2014, at p 29 line 25. [note: 92]N/E 4 June 2014, at p 29 lines 7–9. [note: 93]N/E 4 June 2014, at p 33, lines 29–30. [note: 94]N/E 4 June 2014, at p 43 lines 21–23. [note: 95]N/E 4 June 2014, at p 54 lines 19–32. [note: 96]N/E 5 June 2014, at p 61. [note: 97]N/E 6 June 2014, at p 23 lines 1– 21. [note: 98]N/E 6 June 2014, at p 119. [note: 99]N/E 6 June 2014, at p 132 lines 1–19. [note: 100]N/E 4 June 2014, at p 71 line 9. [note: 101]N/E 6 June 2014, at p 38 line 21–p 40 line 21. [note: 102]N/E 6 June 2014, at p 124 lines 14–21. [note: 103]N/E 4 June 2014 at p 40 lines 8–9. [note: 104]N/E 4 June 2014 at p 43 lines 21–23. [note: 105]N/E 6 June 2014, at p 47 lines 9–27."
    }
}